{"format": "raw", "annotations": [], "confidence": 0.9283769163100616, "data": [{"start_time": 0, "text": "Good afternoon, everybody. Thank you for being here for August 5th meeting its 2:01 p.m. On the for the August 5th, 2019 city council meeting on Bruce Harrell present the council. Please call the roll. He's here. Calling just calling real sir. swan Bike Shop Gonzales herbold O'Brien president Harrell the introduction and referral calendar will be adopted but council member O'Brien me at 7 to say about that got smile or Brian. I do have something to say about that. I appreciate you reminding me council president hero can a filibuster here for a second when I pull up my notes into the referral counselor by introducing Council 11960 for entitled an ordinance relating to the green New Deal for Seattle establishing the green New Deal oversight board providing compensation for those who in Current financial hardship by their participation on the board requesting that the APA sustainability environment create a departmental team to advance the green New Deal for Seattle amending Section 3. 14.9 70 of the Seattle municipal code and adding a new section 3.1 4.9 792 the Seattle municipal code and be referring to the sustainability and transportation committee will stated can smell Bryant's almost had a script to say all of that. Okay, we have an amendment and it's been second any questions or comments. All those in favor of amending the introduction referral Calendar, please say I opposed the eyes have it. So now we're going to actually adopted those in favor of adopting the minute introduction referral Calendar, please say I oppose the eyes have it. If there's no objection to dance agenda will be adopted. Can objects in the agenda is adopted the minutes of the July 29th, 2019 city council meeting has been reviewed and there's no objection. The minutes will be signed. Can objects in a minister being signed? Presentations I believe council member mosquito will have a presentation and we look forward to hearing her hearing from her council member Mosqueda a proclamation that has been signed by all of the city council members and the mayor in support of the art workers union and the work that they are currently doing to raise the voices of art workers at Frye Museum. I want to first thing come to Marissa want for her a statement of support and your support on going for these efforts over the last few weeks months and to reiterate our commitment as an entire Council as well for this work. Our office was contacted about the ability to conquer ties our support and to show us standing in solidarity with the workers who are bringing these issues to light and bringing bargaining a forward to making possible for many of the art workers in our region a big. Thank you to John Sarah author bold Kelsey Barnes from the art workers union for here with us today and a special. Thanks to John who reached out and work with us. I'm putting such a freak on our chief of staff who is not here to add be able to celebrate with us today. But was really instrumental in pulling this together this morning at Council briefing art workers and crafts people have throughout history helps a lead and support labor and other Progressive movements and their work words. Advocacy arts and Leadership earlier this year the staff of the Frye Art Museum who have long struggled with wages working conditions and the desire to bring a voice to the job decided to form in Union fees workers have struggled over medical cost housing cost and I've been forced to live further and further away from their jobs and their community and more last Monday. They began to bargain with the museum and in true Seattle fashion, the security staff at the Frye art museum has also put forward their effort to create a First Union or the security staff at the Museum and our city and in our state Starting to be able to bring this forward. This is your work and an in honor of their work and in honor of the struggle that you are currently engaged in. It's also really exciting here to be able to bring this forward. We celebrated earlier the hundred year anniversary of the Seattle general strike the 110 year anniversary of the Spokane Free Speech fight and the 100 year anniversary of the Centralia tragedy and the 20th anniversary of the battle in Seattle. So in light of our work to applaud uplift and support unions the right to collectively bargain and Frontline workers. We applaud the art workers union and want to stand in solidarity with you with this sign Proclamation and really appreciate your courage your dedication and your passion and your artistic leadership that you bring to the community and to the moon and building. Thank you. Cancel Amber Moscato before we presented here from our honorees with any other customer would like to say any other words council members want as a rank-and-file member of the teachers union myself and an electric representative. Seattle's working people. I'm very happy to be supporting his Proclamation and honored to stand with art Workers Union. Some of them are here today from the moment you all decided to get you nice and maybe before that and thanks also to all the labor organizations and DSA and socialist alternative who stood with you all from the very beginning. It's very important to have a strong Community solidarity. And as the proclamation says we are celebrating the the formation of a new Union especially in light of the fact that Union density has gone down over the past decade. So new forces among the working class becoming part of the union movement is extremely important and How's your own experiences starting to show as you started a bargaining that the union-busting tactics are the bosses don't stop. Once you form a union you have to continue to fight for achieving adjust contract. And that is why we're really delighted to stand in solidarity with you and to that effect. I want to do mention two things one is I sent a letter to the director Joe Joseph Russo. Who's the CEO of Frye Art Museum today just had one and I wanted to read that out says Mr. Rosa as a rank-and-file member of the local teachers union as District RI city council member elected representatives. Seattle's working people. I ordered you can negotiate without delay adjust Union contract with the museum security guards unionized of the art Workers Union. I have been appalled to learn from the members of yard Workers Union about the office gation hostility. You have displayed to date you challenge the voting eligibility of nearly half the work. Union election last month you have now hired a huge international law firm Dorsey & Whitney to represent you at the bargaining table and your lawyer proceeded to bully and tighten the workers at the very first bargaining session going to report. I received from union members your hostility to the workers is completely counterproductive and I can assure you that my Council Office will spare no effort to see that the fry workers to see full Justice. There's no excuse for frying management to deny wage and benefit Improvement of the workers. The Fry's security guards are among those who help have helped make Seattle vibrant Dynamic community that share their creativity and Artistry of glass blowers printmakers painters and pen and ink artist. They're called security guards by Friday. But in fact they do more than guard artwork the guide Museum visitors and lend their own artistic expertise and teaching people about the Fry's accept any of these workers face economic eviction from Seattle because of the Vise grip of your stinginess and Affordable drones from greedy corporate landlords to nickel-and-dime the workers on wages while paying you the CEO more than $229,000 a year and paying themselves relatively well to do directors the equivalent of $115 per hour for their board service. According to the Museum's on 2017 IRS 990 filings. And so we are going to be mentioned in the letter how the fry has talked about the endowment that makes it the Envy of its peers it proclaims that fried if you receive contributions from Balkan usbank bny Mellon wealth management Windermere Real Estate another major corporations, and so we really are the A-frame management to make sure that they immediately negotiate adjust contract. And the last thing I wanted to know what is it. This is August 5th almost to a date a year ago August sex 2018 the Museum of Modern Art Union which was at that time as you are. I'm sure know better than I do were in contract negotiations and on that day, you're almost a year ago the normal local 2110 width of the Union that represents 200 members of the Museum of Modern Art in New York City walked out of their post descending the stairs into the museum Lobby to protest the current contract after being offered by the museum Administration. So another words is happening on a really interesting anniversary of hard workers are going to continue in that struggle. So congratulations to you all and we look forward to you receiving adjust contract. Thank you. Cancel membership. What mosquito would you like to say a few more words proclamation of self as I'm A Hazard twerkers and crafts people throughout history have used their skills to Advocate fight and protect and protests for labor standards and civil liberties for the betterment of people everywhere are as organizing policy victories and labor invitations that start in Seattle often replicated across the country are for August 5th that the city council office Proclaim August 5th as a day of art Workers Union day. Thank you all for your incredible Work lyrics to now or suspend the rules to say something is not required, but we all will always want to give you the opportunity. Is that okay? I'll just say I'd like to start off by thanking something out of the state or city council. Of course, I'd like to also thank you want or the help and of course, thank you very much for that letter today support is invaluable. It also represents City council's dedication to ensuring Seattle remains at leader and workers and civil rights in the united states and cities support is a great reminder to our team that we are Uniontown. And the sprinklers and strengthens our resolve. We are Scrappy despite the hardships my co-workers face including a state earlier a livable wages traveling up to an hour to get to work for growing medical treatment too few work hours or the exhaustion of extra work being available. But that work instead being contracted out to a third-party subcontracted out. They keep showing up to the job. They love but love doesn't put food on the table and Patch. It doesn't keep a roof over your head and dedication doesn't pay medical bills. commuting cost Sorry. This is why we formed the art Workers Union. The first Museum Des Union not only in Seattle in the state of Washington to make sure the place we left work remains accessible not only to the Seattle public employees as well. Your world have long Viber Azria protesting action and we don't see they Wu's being any different now. We hope to fry management support and lives up to their Progressive Mission by promptly meeting in good faith at the bargaining table to stablish a contract with a W you because when the Fry's workers Thrive, so will the fry Thank you very much. Thank you for being here in for your commitment to that work and council members from scada and sawant for recognizing their efforts. Thank you very much. Okay, at this time. We will take public comment on items that appear on today's agenda our introduction and referral calendar or are 2019 work program. I think we have two people signed up. Thank you for Cheyenne will limit our comments to accept comments for 20 minutes and then we'll go to minutes a piece will start off with number one Megan Murphy followed by number to Colleen McAllen McAllen McAllen. Hi, I'm really glad you're passing the ordinance for sound protection for orcas from the naval test. You can't quite protective but you can endorse that you're against it. I think the degradation of the environment is like so rapidly accelerating. It's really scary. So I think people have an interest to selling things that come from degrading the environment. I think that there needs to be a check on them. I'm from the state cuz that's in the best interest of the most people so I think Super Pacs should be banned which there's going to be something at the Seattle Municipal Tower 4010. That's going to be on I think it's August 13th. And I also think that there should be free Transit because I think that also upgrades the environment. So the Seattle Transit Riders Union is having something at 6 on September 11th at seiu775. I do this as a mother who's had because of the state's judgment there, you know, the state is in the sting of flux where sometimes they can protect people and sometimes people aren't being protected because I lost custody of my son from a diagnosis. I don't even have and there are people at the border that are being separated from their families because of militaristic reasons reasons for trading with people that are not in the best interest of the common good. So I'm really glad you're thinking of orcas and the sound levels and how It hurts their ears, and I only wish everybody could be so sensitive. Thanks. Colleen will be our second and last speaker, please. Afternoon, thank you. My name is Colleen McAleer and I speak as an individual today and today just want to support the acquisition of the sun park that's on the agenda as part of the open space Acquisitions and just a little bit of background for fun today. Usually it's something heavy. But this is a good thing today representing our Founders Jeanne mechante Dixie Porter an eight-member steering committee of the sun park and sun park stands for saving Urban nature and a 2007 was a vision that was created to the purchase of a very small private lot. And then thank you to the city. We had a neighborhood Grant and neighbors and community members participate in the process to develop a native plant garden as a teaching tool over the years. We needed to find a place to stewarded and Fortera formerly Cascade Land Conservancy became our partner and so they kept the funds. And we continue to raise over $100,000 to give back in addition to this gift to the city for Acquisitions to be purchased elsewhere in the city and over the last 12 years of sun team is Envision built. We did and spent over twelve hundred hours taken care of that little Park, which is right across from the elementary school teachers use it as an outdoor classroom and laboratory of the native plants. So we thank U City Council Members for considering this the gift, and we also want to thank our Founders. Again Genie mcdicks reporter at parks department city of Chip and Evans and Michelle Connor Fortera. Thanks again. Expert testimony and that will conclude our public testimony section. I think we're finished with that. Just move to the payment of the bill section. Please read the title and ordering payment thereof 9596 remove the second of the bill pass any further questions or comments that please call the role of the passage of the bill Salon Gonzales O'Brien Herald high tide in favor and opposed the bill pass. I'm sure we'll set it. Please read agenda item number one from the Civic development public assets and Native communities committee assets and Native communities committee Jenna Dewan cancel, but one 12582 relating to the Department of parks recreation authorizing acquisition of real property property Colony known as 7900 10th Avenue South Acceptance of a recording of a deed for open space Park and Recreation purposes and ratifying confirm research and piroxicam you recommend a bill passed really happy to say thank councilmember Gonzalez and cancer Bagshaw that the city actually can grow some property every now and then and the duwamish park requisition and I've been wanting to say this for a long time when I'm done speaking. I believe the good lady from District 1 Council for her, but would like to say a few words this ordinance authorizes the purchase of a parcel of land located within the duwamish Waterway Park is currently on biking County. The purchase price is about a million dollars the park will serve the South Park Community citistaff perform due diligence which include obtaining soil samples that revealed low-level Arsenic and soil below the grass and some discreet hot spots with higher concentrations in soil below the grass at the North End the city will probably perform a remedial action upon acquisition of the parcel to remove the contamination, even though locations in concentrations currently do not Doesn't excuse me did not present and mediate public Hazard King County was notified and they agreed to reduce the purchase price by $100,000 and sufficient funds fees are sufficient funds for the city to perform the remediation. This is compliant with requirement to pay fair market value for the property of the city reminds responsible for any park recreation costs exceeding $100,000 the results of due diligence investigation indicate that exceeding the cost estimate is very unlikely and Edition city staff of the assistance of the Law Department negotiated that King County retain all liability associated with contaminant releases from the property there be remediated through epa's lower duwamish Waterway Superfund sentiment clean up the Civic development public assets and Native communities committee recommends full Council passes ordinance. Thank you so much. I want to thank can County for its consideration of reducing the price of the the property in consideration for the needs around site remediation. I also want to thank the Seattle Parks Foundation because of their effort and leading a fundraising campaign for future improvements at the park. I want to take this opportunity to flag a couple of issues that we learned about a recent South Park Community safety walk and talk with the executive departments those two items that have been flagged is a request from the duwamish Rowing Club to add some sand and or rocks to the beachfront area. So it's easier for them to take their growing equipment in and out of the park. And the executive is looking at you working with the Army Corps of Engineers to get a permit to do so and looks like we're making some good progress there. Other item that was flagged in the the executive walk and talk in South Park in July relate specifically to ongoing graffiti tagging in the park and looking for the defect that in the past using murals to dissuade graffiti. Tagging has been very effective in in South Park. So we're looking at more opportunities to work with youth and create art on the surfaces around the park in order to discourage future graffiti. Thank you. Any other comments or questions, please call the roll on the passage of the bill. Salon Bagshaw Gonzales herbold O'Bryan Barrel 9 in favor and unopposed Bill passenger side. Please read agenda item number to arthritis and acceptance of a gift of three art pieces and art tiles and title Explorer Voyage from the friends of Christy Park to be installed in Christy park for public use. Could you recommend simple path and worst president? This is a bill that authorizes the acceptance of a gift from Friends of Christy Park friends and Christy Parker represented by a group of Taiwanese Americans who value celebrating their culture exploration and friendship between the people of Seattle and Taiwan donation D donatien call the Explorer Voyage includes three sculpture pieces made and fabricated steel with wood sliding for bench seat friends of Christy Park chose to donate art by art by Paul sori an artist who was inspired by the Taiwanese folk culture specifically boats from Orchid Island donation clothes E6000. I doubt it to maintain the pieces Christy Park is located in the heart of the University District. Civic development public assets and Native communities recommends full Council passed this ordinance that please call the roll on the passage of the bill. Other bill of the Bill of the mascara I O'Brien president Harold. Please read the short title, please. Three cancel 1195 88th Lane to Seattle Parks and Recreation and many orcas 25724 Witchduck the 2019 budget including the 2019 through 2024 Capital Improvement program authorized acceptance of a definition of real property in Seattle from Ventura Northwest security recommence at the full path or supporter of the issues raised her hand to thank her for coming and also coming to committee. So I'm at 3 as you know is an ordinance that authorizes acceptance of a donation of real property and cash to the Seattle public Seattle Parks and Recreation Department at Laurelhurst community and Fort or Northwest would like to donate the property located at 4700 Northeast 47th Street. And the donation is $100,000 for stewardship of the park. Has you heard Fortera is a North Fortera Northwest is a non has is a non-profit since 1989 whose mission is Land Conservancy. Bridging the Gap between public and private entities we work with Fortera Northwest in the past on many projects Laurelhurst residents play an active role in stewardship of this park. They've established. This is sun park in the ordinate also allows sunpark to become part of the city's Park system and family and we welcome that the Civic development public assets and Native communities recommence full Council passes ordinance comments cancel my back show. Thank you rewards for shepherding this and Miss McAleer. Thanks for all the work that you and your neighbors have done also want to recognize the work that was done on yesler is SLU. Is that what you called it over the years just appreciate the work that you have done. So happy to support this. I just first thing you calling for coming to speak on behalf of the Lord community and that we now have to ditional Treasures in District for so, thank you. All right, actually, I think will please call the roll on the passage of the Bill O'Brien president Harold opposed. Please read the next agenda item from the finance and neighborhoods committee committee recommends adult pass. Thank you very much would raise the wages the hydro maintenance workers 1 and 2 at Seattle City Light in their boundary Dam as the boundary Dam employees. I cancel my room is Gator. Would you since his comes out of Seattle City Light. Do you have anything you'd like to add her you want me just to continue? Absolutely. So this was a requested by the Union in October of 2018 Seattle City Light pulled together a wage Review Committee and determine that wage increases for this group of workers wear appropriate for the positions are due to an increased scope of work and the total cost of additional expenditure is to Seattle City Light Up be about $77,000 annual. And we recommend approval of this item or comments. If not, please call the roll on the pasture the bill. Salon Gonzales herbold O'Brien president Harold the bill passed in Sherwood. Sign it please read the report of the gender Equity safe communities new Americans and education committee. Please read the short Title 5 Constable 1 19589 related to the city's criminal code conforming to Seattle municipal code to state law for crimes that require the submission of biological samples to the state of Washington the committee recommend simple path Gonzalez council president. This Council bill would conform the Seattle municipal code to state law for 11 serious or sex-related crimes that require the submission of biological samples in other words DNA to the Washington State Patrol crime lab little bit of History here until 2014 the Washington State Patrol crime lab Lab had been processed. And entering into the federal combined DNA index system database DNA from offenders convicted of misdemeanor crimes Define as defined in the Seattle Municipal Code officials from the Washington State Patrol discontinued this practice in 2014, because they believe that it was not legally required for the state to process those samples from offenders that are convicted of local crimes under local statutes. However, in this last legislative session thanks to the leadership of Representative. She was able to receive a opinion from the Attorney General's office that noted at the Washington State Patrol crime lab Lab would be bound legal aid to process Seattle a DNA sample and results if the SMC still municipal code definitions conformed it to state law so the city attorney's office transmitted. Cancel this particular Bill Council billing 19589. In order to bring the city's code into compliance with that attorney general's office opinion. And then the city attorney's office has also I spent much time with me and my office and and also joined us at committee last week to walk us through the proposed legislation and made very clear that this legislation does not substantively change the elements of any of the underlined 11 crimes for which DNA samples are taken that would then be placed in the CODIS database. They also clarified that the DNA that would be captured in this instance would only be after conviction. So we're not talking about pre-conviction before I conviction all of this would occur after conviction consistent with the ordinance and with state law. It is really I think important To make sure that we I continue to support these efforts in the advancement of the General Public Safety staff from our Seattle Police Department have indicated that this recent change in the state law will shift responsibility from the Seattle assistant City prosecutors to the Seattle Police Department this burden of collecting the DNA from out of custody offenders. And so I just would be really necessary in order for them to continue that work and aspd is indicated. They can absorb this additional burden within existing budget. So in total we again have reached out to various stakeholders and who were it involved pretty have laid in this issue for the last several years at the state legislature and none of them have expressed concerns with the underlined components of this bill and feel that is consistent with what the intent was under the state law. So I feel pretty comfortable. We're not creating a Dragnet here or take another penalty of action in these in this area. This is purely largely a technical Bill to allow us to continue the efforts to deal with both backlog issues related to our DNA samples. And which in large part are related to again sex crimes and we've heard pretty clearly from a lot of survivors in in this area that this is an incredibly important step to move this public safety issue Ford. So implementing this legislation in summary will allow the police department and other law enforcement agencies to use DNA evidence to solve crimes cats perpetrators and bring Justice to victims and their families in the future. So I'm really happy and proud to advance this particular piece of legislation together with City attorney. Pete Holmes who I'd like to thank for his advocacy on his face also want to thank John schocket and Play Harris in the city attorney's office for their work on those drafting the bill committee committee to prevent on the bill and making sure that we had all the information necessary to walk some of our advocacy organizations in friends through the various components of this bill Rebecca Johnson who joined us at the table last week. She's been real. She's represents the city on a variety of Public Safety related legislative priorities. This was one of the city's a legislative priorities last session. And so she was able to join us and walk us through at the committee the varying degree of Engagement with privacy concerns and with the public safety concerns at the committee table really appreciated her time and attention to that and then lastly just wanted us think central staff for doing an analysis of the bill is emitted by the city attorney's office and to Briana Thomas for my office for being the policy lead on this issue. So with that being said the committee considered this This week in a special committee, and we recommend that the city council passed Council bill 19589. President I want to thank the committee chair for her leadership on this issue not just in committee, but also it with your advocacy at the state level on two advances legislation in addition to the Community Partners that to mention and I think that the clarification that you've offered today should help set the record straight. I also want to offer a few pieces to clarify and underscore some of the commands that you just made due to the concerns of the ACLU has continued to raise and have been covered on some of our local media channels. I think it's really important to hear the words that comes on Morgan's olives just said And to clarify that this legislation creates a mechanism for the state patrol to be able to accept the DNA samples already been collected some people who have already been convicted of a serious or a sex-related misdemeanor crimes of this bill does not lead to any new process or changes at the city level and are mindful of the unintended consequences the unintended impact, especially on communities of color as we think about individuals from communities of color be disproportionately represented. In the criminal legal justice system and are mindful of time. It comes to collecting information or a DNA is how this information could potentially be misused. We address those questions. Thank you madam chair for your answer to those questions in committee and to The Advocates of the table who address it head-on and in addition to the point that this is not seeking to create new changes in our current process. We are also wanting to underscore today but this sharing of information that I've dated a DNA that has already been collected could help uplift an underscore our commitment to exonerate people who have been wrongly convicted so that to the extent that we are sharing information and can help free individuals who are wrongly being held and don't have the DNA evidence to prove that this DNA may be able to help exonerate some individuals who are wrongly being convicted. So I want to thank the chair again for making that Rsji, comments really heard last week and again today and of the sexual assault and Survivor protection Advocates including or with an affordable and our City attorney again for continuing to work on this but I think that's an important clarification does it to right the wrong narrative on this? Any other questions or comments? Okay again, I want to thank you catch my pajamas and guess what my schedule for asking all the right questions and getting to the to the heart of it all so with that. Please call the roll on the passage of the bill Pacheco. Salon I bake shop Gonzales Nana post bill passed in show Silent please read a gin item number 6 1 0 8 3 3 3 play some file 7 is a 2018 annual report from the Seattle police chief reporting a report concerning activities regulated by ordinance 108333, which is commonly referred to as the investigations ordinance. If you look at the underlined, it's very simple. There's I think two pages worth of reports. This is in order. Comply with Seattle Municipal Code 14.12 .380 that requires that the chief of the Seattle Police Department submitted a report on the implementation of that chapter 2 the mayor of the city council and the city clerk for filing as a public record. And so really wet this and report it lays out the type of information that the police department may have collected in the prior-year for law enforcement purposes. There are requirements under the Seattle Municipal Code that that require destruction of that certain types of information if it is gathered and this is the Chiefs obligation to report to us and the general public. I'm asked to the agency's compliance with those those retention and ordered the destruction Provisions within the ordinance and Consistent with cancel Central stats report and the chief of police is report. It appears that the ordinance has been complied with so this is our due diligence and filing this report publicly consistent with the municode. So the committee recommends that the core belief that the clerk file be filed. You're not those in favor of filing the clerk file, please vote. Aye aye those bows vote. No the motion carries nakark file is placed on file. Please read agenda item number 7. 10007 Clarks 53144 to 3 chief of police audit report of Select files obtained through the police department's membership in the law enforcement agents unit and the western states Information Network maintain exclusively for confidential information dated, February 27th, 2018 accordance with organs when 08333 the file be placed on file enforcement public safety items on the agenda. So this is also related to the previous agenda. Agenda items 6th Court files. 31442222314423 is also report that seeks to ensure compliance with ordinance 1 0 8 3 3 3 which is the investigations or that ordinance requires that the chief of police audit select police files maintained exclusively for confidential information. This information would have been obtained through the police department's membership in the law. Enforcement intelligence unit and the western states Information Network. The chief of police best has submitted her latest audit report as required by the ordinance and that report indicates that she found no violations during the audit process, which she is required to do Under the ordinance. So she has now filed a certification through the clerk file for the public record to certify the fact that the audit report was prepared by the chief and that she is certified in it as final and and for those of you who didn't have time to go through the report. It appears that there were 30 administrative documents that were audited and the law enforcement section and and there were a lot more out of it and about 230 240 audited in the western states information network files and and Only a hundred and Seventy-Six audited items are currently being retained consistent with the ordinance under the confidentiality Provisions. So with that being said the committee considered this and is able to ask questions and receive it to a briefing from Campbell Central staff and and voted to recommend that the city council file the clerk file you're gone and so too until then I probably would have otherwise done. Hey those in favor of filing the clerk file, please go die by those opposed both know the motion carries nakark file is placed on file. Please read the report of the planning land use and zoning committee. You put the planning land use and zoning committee agenda to make cancel both on 19471 delay until I'm using sanding clear find the definition of vessel and consistently using the term vessel in the shoreline master program in a many sections. 23.68 point two zero four point nine 16.942 cm is because it can be overcome as a bill passes amended definition of a vessel to address a ruling from the hearing examiner in December of 2016. The clarification will return the vessel definition to its original intention and will close a loophole that has allowed non-operable formally recreational vessels to be verified by the city as floating on water residences, Leslie Pool has left an uptick and a non-operable vessels being verified and could lead to many more if we do not act today as part of Consideration of this legislation my office and others met with stakeholders including the Lake Union live-aboard Association to better understand the concerns that proposed changes do not affect any existing floating on water residences. I like to I like to thank councilmember herbel for bringing in a minute and committee which reaffirm this fat. And so with that said just want to thank Central staff kill specifically for his assistance on this bill. Thank you very much. Are there any questions or comments? Did not please call the roll on the passage of the bill. Mascara O'Brien president Harrell. Agenda items 9 and 10 if there's no objection. I like to do by unanimous consent. I'd like to reverse the Order special we can hear agenda item number 10 before 9. I've been told by the chair of the committee customer Brian that flows little better that way if I don't hear any objection, I'm going to ask and direct the clerk to read at United number 10 first and then we'll come back at 9 after okay. Okay, please religion of number 10 into a maintenance agreement with Children's Hospital in Washington. Nonprofit corporation is the condition of public benefit requirement for the street vacation portions of 41st Avenue Northeast and a portion of Northeast 46th Street petition approved containing Creek FL 30969 0 committee recommends the bill pass. Thank you. So this is a portion of Tell Jason to the burke-gilman trail that connects the burke-gilman trail to the Seattle Children's Hospital campus. It's something that's been in place for a number of years and it was part of the requirement for a street vacation approval. We did a number of years ago and the Orleans today. They finally got all of the legal pieces in the line. And so this will accept the easements of the parks can take over operations of that connection. I will say this is the final piece to formally be completed from the street vacation. That was a conceptually approved by this Council a number of years ago. And so the reason I asked to flip these is cuz once this is done we will be in the clear and we can actually do this week vacation. I don't know that a few minutes makes a huge difference. But doing them in order seems like The Prudent thing to do. Very much any questions or comments on this Council bill. That please call the roll on the pasture the bill I O'Bryan president Harold 9 in favor and opposed the Northeast any portion Northeast 46th Street on a petition of Seattle Children's Hospital the committee recommends that the bill pass. Thank you. So now that we have adopted the the easement for Parks children's hospital has met all the conditions of the street vacation. It was conceptually approved. And so this will finalize that and they get formal the streets are now vacated and part of Children's Hospital. It's very much any questions or comments. Please call the roll on the pastor the bill herbold Juarez. Mascara O'Brien president. Can spell 1195 81 relating to Seattle commute trip Reduction Program adopting an update is for to take Plan adopting a local designation of Seattle City Center center city has a growth and transportation Efficiency Center. The committee recommends to go pass. This is an update to the production program the city of Seattle. That's a program that's authorized by state legislature requires businesses with more than a hundred employees to participate in a group of addiction program Seattle is a partner with county in downtown Seattle Association trip to Seattle and does a lot of great work with that. This legislation does a lot of updating and sending some new targets some of the transportation modes that were in place. So just a few years ago during the last update to the Future production program in place today. I should say didn't exist and specifically tncs and so it doesn't 15 of things to make that work better. I want to just applaud and commend the S. Staff who continue to do great work. I can meet your production and also the team at commute Seattle this legislation will help them continue their great work and I believe we need those teams to be doing even greater work in light of the climate crisis were facing. Thank you very much and your comments. That please call the roll on the pastor the bill Salon in solace herbold. Where is mascara O'Brien night in favor and unopposed agenda item 12 Revolution 31892 expressing concerns with the Northwest testing and training proposal of the United States Department of the Navy for Puget Sound Coastal Waters from Northern California through Washington State and for Alaska, the committee recommends a resolution be adopted additional tests of their sonar and explosive devices in the waters off a pita sound and up and down the coast as the bill describes as part of that proposal. They've been required to do a supplemental environmental impact statement. I believe no one actually conducts it and threw that will be seen is that the work they're proposing to do without significant impacts on marine mammal To use various methods for navigating a communicating including the Orca population of Puget Sound. We know that the massive amounts of sonar they can potentially be put under water or explosives have had sometimes the billeting and occasionally life-threatening impacts on these marine mammals and this resolution asked the Navy to reconsider their proposal in light of the science and come back with some ideas of how they can conduct their tests in a way that sensitive to the population particularly highlighting the plight of the orcas in Puget Sound. The reality is that those three ponds that make their home in Puget Sound water is in the safe Peter Salish sea are on the brink of Extinction and the death of just one or two of them could jeopardize their ability to sustain as populations. Also, we will be sharing this with our federal delegation as my call. Using others to high like this for a federal delegation so that they can have a similar conversation with the Navy to try to adjust the proposal that your customer or Brian any other questions or comments on the resolution. Are the orcas denoting the closing? Where's okay. Thank you cast member Bryan spring this year. I want attention. Those in favor of adopting the resolution, please vote aye aye those opposed vote. No the motion carries a resolution adopted in the chair will sign it. Is there any further business coming for the council? Customer consalus council president I need to move to be excused on August 12th 2018. That's next Monday as I mentioned during council meeting this morning. I will be leaving on Friday evening to join a multi-disciplinary cohort in Copenhagen Denmark for an immersion program around sustainability and planning a public spaces and will need to be excused. But I do plan as I mentioned during Council briefing to make accommodations to have the rules suspended so that I can call in for the the re-vote on the sweetened beverage tax ordinance. It's been moved and seconded that counts, Gonzales be excused on August 12th that you will participate in at least one Legend item around midnight as I understand around you any other questions or comments on that before we vote all those in favor. Say aye I opposed the council. If not, we stand adjourned and I won't have a great rest of the day.", "end_time": 3201.7}]}