{"format": "raw", "annotations": [], "confidence": 0.9500786817195465, "data": [{"start_time": 0, "text": "Good morning. Everyone. Today is Thursday May 2nd soon be joined by a chair of the committee as the Director of the office of the employee on but sodium on but as hoteliers are going to be here in our first freezing of the Fort Lawton Redevelopment plans of The Pact agenda. Also, very excited to see a packed audience today. Thank you all so much for being here before the public comment. I'd like to take a quick moment to recognize it yesterday was International workers day around solid. I would like to have a quick second to invite Walter. Thank you Walter for being a sheriff you work with us because there's an exhibit that we're sharing right outside of City Hall here. You can see the pillars over there that's called solidarity forever. The union makes us stronger Walter is an active member of the California Teachers Association and he participated in the months-long strike by members of CTA against the Compton Unified School District and after retiring from teaching Walters lifelong interest in photography intensified, he started use info and focus a Seattle after school photography program. And the mission of this nonprofit is to work with and into Empower Urban Youth through photography and to experience their world in new ways and to focus on positive choices. He was awarded. Taller a word from the President Clinton's Department of Arts and Humanities and Walter is here with us to talk a little bit about the display and I think that it's so exciting. We're up there for the full month of May in honor of workers this month. So the double checking to make sure it's on us yesterday. We were installing the exhibit that is here in the lobby that you passed coming in and it's just a great honor to have this exhibit here at City Hall. The project came about last fall or Labor Day when some bad Court decisions were coming in for labor. And then also there were talked about Celebrating the the Centennial of the general strike and Seattle and there were several other things that my stepson Dmitri iglitzin to somebody know Dimitri and I were talking about the great history of Labor situations in in this part of the country. So we thought we thought we would be a good project to maybe take portraits of today's workers and union members and just show the diversity and the dignity and the strength of those those people that we sometimes just kind of walked by and don't notice. So we started the project of taking portraits of them and the result of small up a portion of the the portraits are now on display right outside this room, and we're just very proud to have that makes Hear what we hope to show was the diversity and strength than of the working person and especially the union member and that's what we found. We found a lot more that says we found a seventy-year-old woman at the University of Washington who was a plumber keeping the toilets going and we found mechanics assembling airplanes that for Boeing and we found longshoreman unloading ships cargo ones and items that were destined for Costco. And we found truck drivers that we're delivering items on the bed for the benefit of Amazon customers leaving the the electricity and Power on making sure that we were able to charge our phones and and the Microsoft software would work at all of these things were were here. especially if we had the delivery people and like letter carriers and UPS drivers that agreed to be part of this program. So it was wonderful finding them and I hope that you'll have a chance to take a look at the portraits. We found a great deal of of power in the in the labor movement and very proud to have the opportunity and thank you for helping us get the exhibit up into the Arts and cultures department for their support and help labor activists and for the use for their labor as well. Thanks for lifting up the voice of the workers. And then we tried to do in this excited to have that the future right outside the Halls over the next month here. And so thank you so much for the Youth who helped that these photographs. Thank you and welcome council member. Whereas thank you so much for being here. No, that's fine. I just want to take a quick second before we do public comment to say happy birthday to my dad as well yesterday and his birthday is on International workers day and he is a long-standing activist and she got on fighter educator and I he is in Havana Cuba right now and he marched yesterday in the air. So I hope you're having a great time and happy 70th to my dad. Larry must get them. Okay at this time. Let's go ahead and take public comment. There are two people signed up for public, today. Our love back. Yes. I knew that hang Andrew good to see you. Good morning. Thank you for holding this hearing. My name is Andrew and I am representing the Housing Development Consortium of Seattle King County Seattle is growing and changing and we urge the council to move the Fort Lawton Redevelopment forward with all the urgency of this moment and Tails. They almost 250 affordable home set to be built at Fort Lawton will keep us on the path towards ensuring that Seattle is Affordable and inclusive to all who live here turning underutilized land of the homes for everyone from extremely low-income seniors to Lauren. Come home owners will also demonstrate that keeping saddle affordable for people across the income spectrum is acidic priority. What time is gym time to demonstrate that priority is now. Please act quickly and move this proposal forward. Thank you. Thank you so much. I walk mm. And that's all the folks that I have signed up to speak in case anybody's interested in speaking. You didn't get a chance to sign up. There's another sign up sheet up the front if you did want to speak welcome, Tom. Thank you. I'm not very good at sharing with the Echoes. I can hear you great. Can you hear me? I can hear you before I get into my main thing. I just want to comment about where I come from. Of one of the three main things I did in my life before getting old as a lawyer North Oregon coast representing people who were injured in canneries or in the woods. I probably represented over the course of 20 years 2 to 3000 iwa members show have deep roots. my purpose here today is Self-centered and for that I apologize. It's my living situation. I've been in Magnolia. Since the mid-90s and a couple years ago. I got notice in my rent was going to go up. Oh, let me preface this. I'm 73. A couple of years ago. I got notice my rent was going to go up 95% so I had to find another place and I did. And I also in October of 2016 apply to the Seattle Housing Authority and I'm on the short list as of December of 2018 for the Fort Lawton senior housing facility under the Sha and another unit. And I sent an email yesterday about speaking today, and I thought that we were going to get well that I was going to get a notice to vacate in my current situation that came up fruition later in the day yesterday 30 day notice. I'm income $1,197. Plus $57 EBT. Let me think about this for a second. I done everything at the Chicago Housing Authority that I could do and I'm on the list. They tell me that's fine. But there are people ahead of me. Kicker with me and I'd go anywhere in the system, but the other kicker with me on TV and for the public, but just know that I'm grateful when I say that I talk to my oncologist. Dr. Michael Schweitzer last week, and he's writing a letter. I may do some good with the Housing Authority may not but I don't know exactly what it said. It's the letter is written. I don't know exactly what it said, but it's comment to me was that my medical condition is a life-threatening. Mr. Hanlon, in any case it's an issue and I think it's self-centered but I don't think it's just me in my age group. That's right. Given my income show offer that we have our friend Aaron houses here. She's from my office and she can actually work with you to see if there's anything else that we can do in the interim. I think that what you've underscored is not selfish at all, which is actually outlined is the situation that many families in individuals are in especially folks who are on a limited income, and this is exactly the urgency that I think the previous speaker spoke about was Fort Lawton in the need to create this housing. So I will make sure the Aaron Falls up with you. She's right here in the back with a purple scarf, and we also have hearing devices if you're interested as well and that I want to say thank you for sharing your story not self-centered at all. We appreciate you being here. Thank you. And if there isn't anybody else here to sign up for public testimony today, we want to thank mr. Hamlin and mr. Oral back for testifying today. Appreciate you doing that and we'll move on to the first item of business reading into the record the first item of business. And as we do that if we could also be joined at the table by Garfunkel and cream from the office of labor standards to give us a quick update on the office of labor standards activities. We will also soon be joined by Will Pitts and Marilyn Watkins, if you are also here you are welcome to join us at the table at this time. Cast member can I read items 1 2 3 all the appropriate items one through three would be great. Thank you for the one two three appointments of gay Gilmore William Pitts and Marilyn Watkins for at members of the labor standards advisory commission for trim to April 30 2021 for briefing discussion impossible vote. Happy Labor Day to you about what the officer what's the labor standards advisory commission has been up to if you can give us a quick update and then I'll give a little background on the individuals that I know by way of introduction before I do that. I I have to pause on International workers day as many of you know, it started 143 years ago in Chicago in support of a Labor Standard the 8 hour day. And of course Seattle has followed quickly afterwards with its own labor standards and in recognition of that day, just so you know our office emptied out for a day of Outreach and education because we recognized that the vast majority of businesses want to comply and they sometimes need help in complying in understanding the laws. So everyone in our office went out to all corners of Seattle not done business is distributed literature. Make sure they had our phone number. I spent a wonderful day in the 5 and it was to consider that our first annual OLS International workers day, but I'm really here to introduce Karen Leavitt ass and do to the funding that you all provided last year. We were able to hire another policy analyst and Aaron Levitt ass is that policy analyst than one of his jobs is going to be to staff the outside in the past. We were Staffing it with various people he pitched in and now we have the capacity to have a dedicated person which is really helpful to us. Karen has actually been with all the last for almost 3 years playing different roles mostly as an engagement and special policy specialist and has a x work with El saxo. We had some have some background with them before he became an employee at OLS. He worked as an attorney for both workers and businesses providing advice on wage an hour and discrimination another employment law. So we're very lucky to have them and he's a great person to be in that role and we don't turn it over to Karen. Welcome. Thank you. Thank you for that introduction. Just a few quick words is Marty mention that worked with L Sac on and off in different forms for her for many years. So I'm excited to have that roll of all opened and move into a former are more formal policy and programmatic support role and briefly on Ellis a queer very appreciative that last for the expertise that the nutritions land in front of the realities implementing labor standards for both businesses and workers enforcement enforcement efforts and our Outreach efforts, and they really service aren't the sort of the initial stakeholder group and we're talking about new policies and programs I'll be working on in the near-term is the A subcommittee on this classification looking at the problem of Miss classification advising OS on on approaches and that's in direct response. Do the resolution that Council passed a couple months ago? Call me when Elsa had to look into that for her doing with that the new commissioner and I'll be reaching out to set up meetings with with both of you and to all Val second. Thanks for the the time Labor Day. It's really exciting to talk about the momentum in the city as always such a commission these three individuals Commissioners to whom have turned out and one who took a new job. So first, I'd like to thank Rebecca Smith if anybody has a chance to work with Becky Smith and tell us the of archbright and he was a co-ed co-chair of the commission. I want to thank the three of them and Rebecca for their service. The city and helping to launch a labor standards advisory commission. And today we have individual serving position 9 had the chance to work with will when he was the former executive director at Washington Community Action Network. We worked a lot on healthcare for all always bringing up the labor priorities and work her perspective in this conversation. He currently works at Teamsters Local 107 and brings a long history of working with the $15 an hour fast food strikes in 2013, and I'm really excited about the work that will is currently engaged in and ride sharing and TNC is as we consider how labor protections impact independent contractors and address issues in this classification. So since will not hear you may have more to share but I just want to provide that background. Founder of optimism Brewing Company up on Capitol Hill College attic plug for optimism. Thank you for all of the work that you did especially in 2017 when we had the chance to work with you when I was running and you were very welcoming not just in terms of the space but sharing ideas about how we can lift up workers and small business owners at the same time and make it workable for small business owners including things. Like how do we improve a zoning and permitting which is something that we know of many small businesses deal with so thank you for your leadership with helping to be a high road employer paying workers $20 an hour because they've 100% medical leave in dental vision paid for medical and dental and paid for it. So thank you for that and for your leadership and how we continue to improve labor standards. We always talk about the laws only as good as the paper. It's written on if it can't be implemented by our smallest businesses. So thank you for helping to make those that possible. Over the last I don't know 10 years or so. She's taking the position for number 13 and Maryland is a policy director of Economic Opportunity Institute. I have the chance to work with Marilyn for well eight of the ten years that it took us to get paid family medical leave past minimum wage in sick leave pass through initiative 1433. Thanks for your leadership and expertise on that and then pass work on our passing the Equal Pay legislation. Maryland is truly a walking dictionary and thesaurus and legal resource when it comes to labor standards implementation. I have to say this because again Chief of Staff Parikh wrote the song from the greatest University in the country University of Michigan go Blue. I started something. So just want to say thanks for the interest in surveying and turned over to the nominees for there. Okay, and Marilyn if you guys would like to share more about what interest you what your background is and why you are looking forward to serving on ltac. Thank you. Teresa. Not used to Mike's. Thank you. Thanks so much for that lovely introduction. I think I was asked as you mentioned to be on the committee because I am one of those small business owners and we do try to lead by example on paying $20 an hour or giving Health dental vision practice secure scheduling, even though we are a small business and are not required to and we provide vacation and sick leave to our workers as well. It's all very rare in our industry, which is really that hospitality and service industry on his Wells Manufacturing, but the real reason why I accepted this is not just because I want to spread what we do to other small businesses. I do believe that we can spread them not just by example, but by having the right economic incentives and the right structural or legislative wants and so I want to help influence them. I care more about labor standards now that I'm an actual employer. It's what small businesses. One of their great Prides is employing people and knowing that they are giving making families happen allowing people to survive and live at the great pride and something. I never really considered until I was the one cutting the checks for those individuals. I've lived in Seattle for more than 30 years, and I started working in the technology sector. So I also know and care a lot about what's happening in the city on so it's not just what happens to the lowest level workers, but to also the workers who are the highest paid and there's different things that we can do for both sorts of businesses, and I really just want to thank Teresa, and I really look forward to giving back to the city that I looking for a long time and hope my kids will grow up and stand to thanks. Thank you. Thank you so much. I am just press this little button and it's great to be here and it has been a council member for so many years on so many fronts as well as council member and badshah and I really appreciate being nominated to this position. I've worked in advancing High Road labor standards for about 20 years now and I just wanted to highlight two of the things that I've really learned during that time. And the first one is how important it is to really involve a wide variety of voices in in crafting policy and including small business owners at the table, including the lowest wage workers and workers up and down the economic ladder at the table. I'm as well as starting to work from the very beginning from the very beginning of policy development with the implementing agency. And I think both of those things are really critically important to developing really good policy that's going to be effective and well implemented and also following through after a policy is passed through the whole implementation process and Beyond and evaluating are also critically important elements and I think that is what helped make the Seattle paid sick and safe leave policy successful and really a national model Seattle's first big foray into labor standards back in 2011, and it was also what was really made our ability to pass Paid Family and Medical Leave through the state legislature in early bipartisan fashion and looks like we're already a model nationally on that as well. Even though that program isn't even fully implemented yet. I'm so I'm really excited about being able to work again with more closely with the city and I'm developing labor standards. I've lived here for 40 years now and really want to I'll continue to make Seattle maintain Seattle and its leadership in terms of making this really a city that everyone can live in working and driving. Wonderful questions for the nominees. Actually, it's not a question 2 comments. First of all, I really do acknowledge the amount of work both of you have done and I wanted to start Marilyn and tell you something how grateful I've been for your leadership in this Arena 2011 paid sick leave here in council chambers. I talk to you tonight before the vote. And at that time I was still thinking this has to be a Statewide effort. We can't do it alone. We kept hearing from businesses, but also thinking about what belt but Bellevue would do and what the at reaction was you with the one that convinced me. And you said it Seattle doesn't do it. The state will never do it. So I just want to acknowledge how much I've appreciated you and your voice. So thank you for being willing to serve on this board and just how much you've meant and gay so since we're shamelessly plug in your beautiful place. I got it was interesting that I have a next door neighbor who has Small kids and I believe you open it up on Sunday morning and allow families to come up and that they do that adjust a it is so great. And your people are so gracious to the families and they can do a birthday party or have a brunch and and have a place where they can be. So thank you for optimism. Thank you for what you're doing and I really think that it's and then just the fact that you're caring so much for your workers. It's really a model that we all acknowledge and thanking know that that's not easy by depreciate the work you're doing and thank you for being willing to serve on the board. Thank you so much. If there's no more questions, are there any other comments that you would like to make or OLS? Okay. We know that the LSAT committee has had honestly and also, you know that has meant that the work plan is never-ending. If there is things that come up in your conversations. If there's additional assistance that you all needs. Please make sure to reach out to us and let us know how things are going. We want to make sure that this is build a productive body for your time and that results in additional policy changes and consideration. Every piece of legislation is not a Flawless. We have to continue to update itself as you think about implementation as you hear real life experience. Please continue to let us know what we can do to advance some of the policy changes that will be needed. I just thank you again for your interest in serving at this time. I would like to move the committee recommend the confirmation of will Pitts gay Gilmore. All in favor and you are not required. You're not required to be incredibly busy too. So we will look forward to passing your final confirmation committee. Thank you record the 4th annual business and the table along with anybody else who's interested in before appointment of amarah Khan as director of The Office of employee on bad for briefing discussion and possible votes. Wonderful. Thank you for the day and welcome. Dr. Khan. So good to see you. Thank you so much for being here WW2 mayor if we could have folks maybe introduce himself for the record the female. Maybe we can start with you and then come this way. Good morning council members. Good morning. Hi. My name is amarah Khan. Do you want to just yourself as well as member of the ITT office and also part of the IDT? So thank you so much for being here are very excited to have you in front of us today. And as you were walking up our colleagues were commenting on the impressive portfolio that was submitted along with your name for this nomination. I want to take a quick second to acknowledge the path in which it takes it for us to get here after many months over four months of the harassment and discrimination in a departmental team or the IDT S40. They said was formed to identify and address areas for improvement to make recommendations to establish an inclusive safe and welcoming environment for all city employees. It was with the input from folks directly on the ground level, and I know dr. Condon you and I've had a chance to talk about the in very impressive product that came from that conversation. 34 recommendations 126 strategies carefully deliberated informed by lived experience with the intent to truly create policies and practices that respond and help actually prevent harassment intimidation discrimination in the workplace the recommendations I think embody our effort to truly move forward with a more transparent accountable and committed workwise play so that everybody can feel safe when they come to work, especially in the city of Seattle of those key recommendations. Just one of the nation's was the creation of a central Hub that should be independent and use as a resource for employees Rivas receive assistance in understanding and assessing their options to have an advocate and a resource to address any Personnel issues that have come up any cultures of intimidation or harassment and making sure that were creating the central Hub that could be accessed by all employees being the office of the employee. I'm really really pleased by what I've heard so far from folks who participated in the interdepartmental task force and their interview with you. I think all of us on Council really take the recommendations of front-line workers silence Breakers the change team makers and the folks who've been living this day in and day out too hard on recommendations come forward and the recommendation that I've heard from you was overwhelming support. So you come highly recommended from members of the IDT silence Breakers key stakeholders, including our friends in labor, and I've really enjoyed our conversations of very quick conversation. But in Your Vision that you've talked about so welcome to the table and happy to have you here, Okay nerd action. Good morning. It is my great pleasure to submit for your consideration the nomination of doctor America. I want to be the very first director of our newly minted Office of the employee on bud as you reference. This is the culmination of more than a Year's work to make sure that we have a independent neutral place for employees to bring their concerns and and and share those with the office of the Ombudsman doctor tomorrow at cons of hard Decades of experience in this work of particularly in the space of a conflict management as she is a trained expert in race and social justice and she has a deep understanding of how the internet sectionality impact harassment and discrimination in the workplace. You know, I am I a cool what you say cuz remember I had the opportunity to be on the interview panel and the recommendation was unanimous to for dr. Khansa name for considering I'm just a quick brief update on the process. So we conducted a national search received about 127 applicants and forwarded to be for further consideration members of the ITT interview does applicants are France and labor as well as someone from your staff was on that and that panel the mayor also consulted with folks from the change teams and other Affinity groups before she made her final decision and you know, we are pleased that amarah emerged as the top Contender for med-surg. So thank you for all your efforts can swim room skata, as we as we stand up this office and then and continue to advance more Equitable workplace for the viewing audience and for our colleagues here at the table on dr. Khan has provided a comprehensive answers to the various questions that we submitted. Thank you so much for including those in for your very thoughtful. Especially around trauma-informed service. So we will turn it over to you. If you could just give us a little bit of background on who you are the perspective that you carry into this work and really what you're looking forward to in serving in this position. Thank you again for the people introduce you with such a humbling moment, but I I want to share with respected panel Hair by training I study culture and I I didn't realize until literally, you know, I'm raising this role in presenting myself at how important that that core training in understanding organizational in people's culture is to the hunter who I am today because so much of This work is going to be informed by who we are as people in and not just working for the city. But as a community, I want to be a student of that culture. I want to study and I want to be informed by it. I want to respond to it. And that's going to be the core of my service to this city. I will respond to the needs of the of the community members all on a daily basis. I've had I've worn a lot of Harrison in my career. I've been an international Aid worker I I have served and I've been a teacher I write curriculum. I was with the Renton School District as their Chief Equity officer. And the one thing that's been consistent in my wart is the ability to introduce humanity and Grace into conflict conflict is natural in half. Things we cannot avoid it in fact organization stuff or more when there's a cultural conflict avoidance. But how do we engage in Conflict from a place of acknowledging people's Humanity knowing that we are imperfect means but also holding each other accountable for a hot a very high standard of service and commitment to each other. So that's really my philosophy and that's what I'm hoping to serve the city with. So one important thing that I think I'm the mayor's office and Deputy Mayor and the council would all agree on is crafting this position one important thing that we heard was it important to have Independence. So while you're sitting with the city council members and members of the executive team, can you talk a little bit more about how you'll help to ensure that the workers across the city understand that you know, this is not going to be overseen by any sort of political influence. This is truly a body that you will have on Direction on what what's your vision for how I tell you both run that and communicate that I think communicating how the how the office is going to function and what kind of services we can and cannot offer is going to be a critical part of launching the office. I I shared my interests. I I am I intend to spend six to eight weeks and just making myself available to listening sessions. I I have no problem spending an entire David folks learning what their needs are not communicating. What does office would do how it would serve their there are legal and function related parameters that people need to understand and Independence is a critical part of it. So the one of the one of the things that I'd learned very quick is that there are clearly gaps in the way people are being served right now. So the creation of the office and itself is Testament to the fact that people need something new reliable and Optical free. So the until Independence is kind of built into the DNA of this office and I'm not honoring that need is going to be my job and I I am very comfortable sharing that for me Independence is as much A function as it is a personal principal for me in my duty as the numbers for the city. So one of the things that I have here with with community members is that perhaps if people understand what I'd special for care as they would understand that and Independence is kind of somewhat guaranteed to that Soviet. We are not a judicator as we are not judge or jury. My office would not be determining so much right vs wrong, but our job is to when someone walks in that enough evidence for us to know that a harm has occurred very few people just walk around complaining because they have nothing else to do. So our art a shield for carrots Bay is is literally very accessible you walk in you stayed what's been on your mind what has harmed you that's it that's enough for us to know and we will try to engage both. What is in an order to remedy that harm it is not in our interest to find out who the villain is. It's more important that we just acknowledge that people everyday are carrying a lot of hurt disrespect in their heart and they need a forum where that's acknowledged formed and rest and if possible through the scores remedied questions from a quick comment. Thank you for coming and spending so much time with me on Tuesday. So she was I think planning to come and talk to me for about 15 or 20 minutes and I think I kept you for a long over an hour or I was just stunned by your sense of compassion towards this job and really appreciated the fact that you talked so deeply and honestly about the respect that you quickly can Garner from people and there was no doubt in my mind that that you had tons of experience and that and that you'll you'll provide a safe place for people and like you just said you're not there to look for villains, but that you can hear from whether it's just both sides are all sides and I am delighted that you are going to be our first director in this position. So thank you so much and I think my office has already reached out to schedule some more time with you. Thank you. I really appreciate your comment. Chaka Khan, thank you. We had a chance to first of all your confirmation packet is very impressive and it's so being you look so young. You answered the 13 questions that we put forward to you and I want to say that all the time that I've been looking at confirmation packets and soon as we we present a lot of questions to ask candidates and all kinds of things that was really refreshing to read your responses because if they weren't just tekoteko a technocrat you actually I actually could read through what you were talking about building trust and having Grace and is customer Bachelor and I was former lawyers know that conflict is just a natural Human Condition You can't please everybody but what you were saying about injecting, you know humanity and Grayson to that and consensus and having an open door and most of all what struck me is. Wonderful, which we don't hear a lot at this table. It's just the humanity piece, but also about building trust that there's a place people can go to talk about in like you said, you're not judge jury and executioner. Are you here to say I need to know kind of almost to Healing aspect and I really appreciate that so I'll be in your office next week. The one of the things I'm interested in in in your conversations with workers with folks who are management with us with the entrance interesting anecdotes or issues that you're hoping to tackle in the first 6 months to talk a little bit about what the first six months looks like. But are there any things that have risen up from the conversation that you've had that you think are important to shed light on? I picked you again. You know, I like I like I shared my my back Garden in anthropology. I study people I study Kaiser and even doing all the various stages of interview. My license was that there there's a pattern to what kind of conflict exists in this community and I'm a newcomer so I might be terribly wrong about this but this is Anna an observation from from a professional standpoint and I could I could in my heart I could send the the there's a there's a certain kind of disrespect. That's at the heart of some of what I what people are on carrying in there and their heart and it's usually disrespect to on two words a certain kind of body A Certain Shade of body and Have accents something I would not of stuff related to power and and status and those are consistent with our big organizations big or small actually perhaps that's why it is so much more of a mission than just a job for me to invite people to understand that power and influence and privileged does impact certain kind of people and certain kind of bodies in that much more deeper way because they've been deprived of opportunity and privileging in Fallout 4 for a sustained amount of time. And what I observed is actually no different from from my observation and other places. It's just that my my avernus of what people will have shared and while they would likely share only solidifies my Respective that when there are so many people voicing their heart and it's already it's a movement. It has momentum. It's only fair that we multiply the number of resources that exist to honor and remedy that her I'm just going to be one of that resource and I will make sure that I work as a collaborator with all the other people were holding this container, but really you can't just keep asking people to speak up and not provide avenues for them to be heard. So I am honored that I be one of those safe places. Thank you for that. One of the things that we talked about in the consideration of the arm, but office as a whole is not just hope we provided assistance to the individual but how we look at exactly what you just said the patterns and identify what those patterns really say in terms of what policy change need to be put into place and with training. I need to be put into place to prevent that type of behavior on the front end to an appropriate action. So really looking forward to hearing from you about the policy recommendations, the training recommendations and the retraining so that is this continual education as cycle that we're going through because they change and our expectations and norms and behavior should change as well. So looking forward to hearing more from you. I think we will hear from you at the end of the summer from policy recommendations for anyone who is watching out there who happens to work in the city and is excited about this office excited about you excited about the recommendations from the id10t. Can you talk a little bit about confidentiality and some of the strategies you may be thinking of so that there's not a hesitation they could be excited but still fearful to come forward. Can you talk a little About what you'd like to consider or to put in place to address confidentiality. I think it is precisely for that reason to build trust not just about the institution of the numbers but also who I am and I know my team would be that's why I want to spend time going to people having them come to me prior to event opening the gates and inviting people and starting case management. I it's a very intentional effort on my part to let people know what the process would be and how confidentiality could or couldn't be injured. So the so there's the question of what is I intend intend is offering people absolute safety trust and an affirmation but there are legal limitations. So the only time we would ever review Someone coming to us if we are compelled by the law, but other than that, I am already working with various stakeholders didn't know and colleagues there on the city on brainstorming ideas on how to make sure that people who come to me come with confidence. They leave the confidence. The information is secure and within the parameters of the law, I have I I I I can give people my commitment that they Envy would do everything legally possible to ensure that the information about that Dad said, I'm also very committed to the you know, supporting the city and its reform and growth heifer. So what people share that that's would be part of our are designed the same day. We would read trans we would read what kind of patterns of behavior are toxic be would be would be would end and I will be Play Imma Be transparent person. I'm a real transparent leader. I don't have to hold me back from from sharing. You know what I'm saying? So we can change our practice we can change policy and so far I feel so encouraged by all all colleagues all different levels of leadership. People want to know what's going on in Harvey corrected. So I'm going to balance the confidentiality peace with their analysis and learning so that people stories don't come to die in that day that they live and we learn from them. But there's no other questions as I want to thank you for your interest in doing this. I know that you had a very great job as well before this and to take on both this Challenge and opportunity is something that we really appreciate as a thank you for putting your name forward want to think the mayor and the mayor's office for your extensive search. We were really excited about the process that you went through in an inclusion of ITT Folks at the table and the result is very impressive. So thank you very much. I want to thank members of the IDT including Friday if it was part of the and to reiterate something that you said when we met with dr. Khan the work of the IDT, it's not over this was one of the recommendations and it's really important that we continue to lift up and give voice and opportunity for those recommendations to come to full fruition. So I'm really thankful for their ongoing work. I went to we have your biggest supporter in the audience as well. But I know that there's more people out there who are supporting you in this effort, so I would Like to go ahead and set the committee recommends a confirmation of doctor amarah Khan as the Director of the office of the employee on but no sentience. It's unanimous. We will bring forward your recommendation for full confirmation to the full Council committee meeting on May 6th. Would love to have you there yet. Are you I would have got a chance to say a few words if you are a table and interested and really thank you again for your intense work. We know we will see you often. Thank you so much for being here. Okay, let's move on to the 5th item of business. Thank you guys. Agenda item 5 hotel workers and Industry standards for roofing in discussion. Embarrassed and people are still Reeling for how exciting that was a hotel worker safety and standards. We have the opportunity to hear today from Anna Boone from the Seattle hotel association Shannon Sharon from the from Hotel Sorrento Katherine Nevarez Barajas from Hyatt Marcus from Fairmont Olympic Hotel and mussab. Ali Amir from Seattle Marriott Waterfront. I would love to have you guys join me at the table and for you all to introduce ourselves as well because I'm sure I did not say some of those names correctly and I apologize for that. I apologize for any mispronunciation Tayana welcome at so we're really excited to have you all here. Thank you so much as a council colleagues know this item is on our agenda for I'm pretty much the next three months or so as we work through policy considerations, very excited to have you all join us at the table today and Anna and will probably start with you and by way of introduction and then go down the table then I have some sheet a few commas before you get started. What does one more time in Seattle Hotel generation? My name is Shannon Sharon, and I am the President of the Seattle hotel association as well as the managing director of Hotel Sorrento. Thank you. I'm Katherine Ross and I'm the area director of Kali culture for Hyatt. masaba Henry director of operations Seattle Marriott, Waterfront Good morning, Marcus dropping her album the general manager at the Olympic. Great. Well, thank you all for being here. And this is really exciting off for weeks ago. We did have a chance to have a hearing as well with some of the workers in the hotel industry. They sat at the table and talked about some of their experiences the desire to have stronger work site protection. And today we're really excited to hear from you later than the industry to talk about your experiences. So far with implementation of initiative 124 and your recommendation for how we can continue to make improvements as I said earlier with our friends from the office of labor standards at the table. We know that any piece of legislation and this applies to initiatives as well. There's always a need to look at how it's implemented in real life and what strategies could be implemented to make it better for workers and those who art of making the implementation happen as the employers. So excited to hear from you that after the initiative was passed to Seattle restaurant Alliance and the hotel association advocated for the Panic buttons at the state level Spacek worker protection makes a lot of sense and very very excite. How to see that ad because he happened in our state capital so thank you for being here with us today and for sharing your experiences and if you want overview and then we'll go down after her Pamela is here today to share a little bit about their backgrounds and how they got into the industry if they think that provide some great contacts for the conversation we're having so you don't mind I'll pass over to Shannon great. Thank you and thank you very much for this opportunity to to meet to discuss. It's very urgent and important topic. So I got into this business about 20 almost 30 years ago out of the Marine Corps. I needed a job. That would allow me to work flexible hours mostly evenings and not know much about it. I took a job and was grateful to have a job that works with my school schedule and I started as a at the time it was referred to as a busboy, but best person I have done almost every job in the industry really with the exception of engineering so Stark food server work my way through the rooms at department sales and just really have a well verse understanding of almost every classification of job in our industry. Thank you actually started. My my first started growing up. I grew up on a wheat farm in Eastern Washington, I grew up driving combine and eventually became head cook for our Harvest crew and not really kind of sparked my interest in and surveying and and being in this industry. So my first position with actions a PBX operator Ivan worked through college as a restaurant Hostess a breakfast bar attendant, so to speak getting up very early. Before classes. I'm in really helping me through college as well out of out of college. I actually was able to join Hyatt in our Management training program, which is a fantastic opportunity would I most appreciate it is we rotated throughout every department and I had the opportunity to work side-by-side and every position within the hotel so some great exposure before I went into my HR field that I'm in now. I'm going to take you back a little bit in the Middle East and I'm infertile due to conflicts in the Middle East. I did have to leave travel between countries in the Middle East and then I was like enough to come to this to the state as an undocumented immigrant. Upon arrival we got help from the local community was no great to see the community pull together something that was very new to us as we learn the culture and learn the language and unfortunately in the early 2000s, my parents were deported, I was as an undocumented immigrant. I didn't have anywhere to be supportive to so they couldn't really kick me out there. They were stuck with me here. Of course. Yeah, yeah, and so I was in high school at this time when my parents were deported, so it was here on my own and you know a lot of mixed emotions during that time going from having a family here with now so things that were born in Seattle that were raised in Seattle that have to leave all of a sudden they had to leave to their age. They weren't forced to leave obviously, but I was the one that was that couldn't leave at that time in Fortune couldn't see my parents for almost 10 years until I got a refugee travel Document and was finally able to see them was able to go and visit them. So that was great. But during that time when I was in high school. I did have the opportunity to intern in exchange for some credit for some School Credit Highline High School. And that was my first exposure to the hotel industry and it was great exposure. I fell in love with it right away had the opportunity to work in many different roles, which I really enjoyed and luckily that summer. I did get a work authorization permit which allowed me to work so that summer I did apply and got my first job as a dishwasher from there moved on to housekeeping. I'm working on various roles. I'm security and Val a shuttle driver side lock primarily in the SeaTac area that made my way into the downtown area where I work at the Westin Seattle was a union member for quite some time and continue to go into Community College college spent six years getting my 2-year degree and I was lucky to get into the University of Washington where continued working in the industry and moving my way up and graduated to finally in 2013 with my bachelor's and Turn that time just kept on working in multiple roles. Didn't know that I want to be in the hotel industry. Enjoyed it and yeah working with people. That's really what time to stay in the industry and now the director of operations again at the Seattle Marriott, Waterfront. Good morning, yet similar to many of the panelists. I'm also not American Life German I grew up in Europe and I've worked in four different country some till I came to Seattle out for years ago. I think so much everybody on the panel. I've taken great pride throughout my 25-year career to have really worked in every position of the hotel. I think this is what makes Hotel. So unique that you have to have the hands-on experience to be a better manager. I've been a housekeeper. I've been a room attendant. I've worked in the kitchen if working store things. I've come to work and I think the pride I take and I think it's so meaningful for this conversation is that managers have a good understanding of what those employees go through it really on a date today. I think if you haven't done it, it's very difficult to judge. I think what an everyday looks like for an employee at the hotel. So but I think all that experience helps us to provide input Thank you. And before we dive into 124 specifically Bastion and to lead us through a conversation about who we are with us, LOL Association is and then we'll laugh at the timing on a conversation around some opportunities. We see with improvements to the law cuz me and I'll leave plenty of time for questions will be all so thank you. So we are here representing the Seattle hotel association that is a collection of over eighty hotels in the downtown or Seattle area. So what we represent is really the promotion of a healthy and vibrant Workforce, we obviously have a economic tax benefits to our community. And we also provide training training is a really pretty significant part of what we do and who we are so training individual Brands and best practice and also the promotion of aboard Mobility so everyone is sitting at this Cable started at an entry-level. We started an hourly. We started in the in the in the dishwashing areas at the front desk and housekeeping in that and in in these very very entry-level position. So that is what we were present and what we've learned and we'll go through that shortly in really this initiative is really we are here to promote the highest and best standards for our industry Bull City and Beyond so there is also a state and National Association that we have some best practice sharing and so really were eager and excited to talk through this initiative and let let you know that we represent the the over 80 hotels attended you in a complying with the ordinance. Excellent. Thank you. So for 80 hotels you said I represent in a cat scratched and currently complying with the with the initiative. Sure. I think well, I'm go ahead and you mention our support for the state sales and thank you for recognizing that and for those in the audience who don't know in this legislative session. There's a bill that was passed that extends the panic button requirement to hotel workers. Statewide valves his mother Industries and I will let Shannon and Catherine expand a bit on our commitment to employees safety and tattoo on Panic buttons are there and was up past unit on a bipartisan basis, I believe so so I think you know when we look at this ordinance, we we really start with safety safety sort of the centerpiece of what what was intended and what we've all adopted and so on. I think that we have been out front really at the Inception of this law that we are in support of panic buttons. We are in support of safety safety and all of the Realms that's ongoing training as well. So you can have a some equipment you can have some process but if you're not refocusing and retraining your Associates for those very unusually needed. I then it cannot be it. It's not top of line. So there are some best practices Catherine really leads to a large organization and I'm going to let her sort of dive into some of the spirit that we've all said and I best practice thank you as as one of the larger employers here in the city. It was about most important that we implemented the safety buttons and we were actually proud to start that process before I 124 came along Hyatt is one of the many employers he's part of the HLA five-star promise to implement Panic buttons across the country. So Something that's been important to us for a long time and ensuring that are that our employees had those buttons available to them and continue to is is really of the utmost importance regardless of the law. Even with the Senate bill being passed. This is something that's critical to us as an organization and I think together with the Seattle hotel association really feel strongly and 100% support the use of panic buttons for our for employees working in guest rooms alone, whether that's a room attendant. It could be an in-room dining server. There's there's multiple positions at this could impact we truly hope that they never have to press that button. That's that's the goal is that that never happens but that we provide the training in the support and they ongoing education to ensure that they do know what they need to do and that it stays top of mind if and when about never needs to be pressed. So we're proud to be part of that in addition to that. We this is just one element of art 3D programs for their there's no there is some ongoing training related to other hazards and lifts in Salt Lake chemical which is included in there as well. So Panic buttons are truly just one element of the areas that we consistently train all of our Associates on. You shouldn't do any use this is an opportunity to talk about the best training as well. So I think you another element that is it again. This isn't really decel promoted to Simply facture Seattle hotel association has reached out where there is a need in our community and attempted endeavored and had success and strengthening through our community outreach So currently we have we are partnered with stolen youth selling used Endeavor. Is there an umbrella organization that Endeavors to end human trafficking and so for about a decade we have been involved with bath switches businesses to end human trafficking and it's a training that was created really for hotels, but it's now been adopted by the porch and other agencies. It really helps identify risk symptoms and signs of those being held under under duress and under with There their consent how we are particularly focused on Youth and so stolen use it was a great partner. We raised under $600,000 this year and continue to be a broad support to them through the years other Charities that we have raised Millions for include Mary's place. And again, I think that we're so very proud of the work that they do and and then the work that partnership that we've created with them Pike Place Foundation. We've also supported other agencies, but really this training that best as we just recently did it a couple weeks ago at the Silver Cloud Inn, but we've been able to create through the relationship is no cost. No fee for these hotels to voluntarily have their Associates trained in their leaders train on these really important identified. Medication components and so that is something that didn't start yesterday. We've really been an indirect partnership an alignment for over a decade. I'm just quick question on the stolen youth effort. So I used to be on the human trafficking task force. That is run at the University of Washington Women's Center Dr. SE top of us who is the Auntie of one of our staff members and one of the things that we talked a lot about was the the prime locations were individuals may have the opportunity to intervene when somebody has been human trafficked and weed so pissed a lot on the medical industry by the doctors the providers are nurses. So did you say that your team your staff is trained in identifying potential individuals who have been victims of human trafficking that are that have and are currently being okay. Thank you for that. I wasn't aware certainly. Thank you. So as I mentioned at the outset you were really interested in finding Solutions on some of the challenges as we spent the last 2 and 1/2 years implementing 124 and really seeing how that works in terms of operations. And so no as you know from there and reductions we have subject matter experts here. So if we're going to focus right now in the medical coverage piece, and then it's because little bit about the room cleaning piece and then happy to take questions or discuss anything else of interest to you all and I will pass over to Catherine to speak to medical coverage. Thank you as an employer implementing the medical coverage portion of eye 124. I think one of the things that we learned as part of that implementation and the way that the rule process implemented the law is there was an unfortunate circumstance of having a cash incentive to opt out of the medical coverage so are employers within the association offering High-quality low-cost coverage. If someone were to opt out they had a cash incentive to do so and those amounts were often a significant portion oftentimes providing them as much if not more of their normal compensation for the cash payout that would be the equivalent for their medical coverage. So part of our recommendation and part of what we would like to see he is if an employee is offer. Coverage that there is not an option to then decline it and still be additionally compensated. We have employees receive coverage for other places that are still covered from their parents plan their spouse domestic partner. We have employees who receive coverage for the military. There's a variety of sources where or another employer for that matter. They do have medical coverage that an employer then who offers it and they decline should then not be obligated to provide additional compensation. So quick question and I have the chance to have a healthcare background and sit on the exchange guess I'm not well understood is that when an employer offers health coverage there is not in theory at this point. You never know what's happening in DC, but there is no. And there is not supposed to be according to the law. They're supposed to be firewalls any requirement that that employee verify citizenship at the time of offering health coverage. And I think this is really important that we're making sure that you know, there's no misperceptions out there about people thinking of us. Should I decline this coverage? Because I might be a given subject to some of their scrutiny whether it's verification of documentation or you just even if they are does Minotaur citizens people get very nervous about being on government lists and things like that. Buford either anecdotally about people being concerned about that or are you guys doing anything to help make sure that people know that people shouldn't fear signing up for health care if that is a concern but it's not something that I specifically have heard. I'll defer to my other people here if they've heard of that but it's it's definitely not part of the process that they have to declare such new ship status and it's definitely not a concern that I've heard within my my hotels part of the lawn and I think it's been incredibly well received but I think there is this Gap off this cash incentive for The Gap that we infect pea subsidy for somebody that have a spouse working for us in his hands covered. So I think they is that mine or Gap. I think other than that. No, I have not hurt them. I think one of the thing that I just wanted to add to is intimately knowing that calculation and and how it works which it is. It is a complicated calculation it is unfortunately also and sent people to declare themselves as smokers. The calculation does provide greater compensation if you are a smoker because the cost of your coverage is more substantial. So there's some other unfortunate again just side effects of the way it's written and how it's calculated if you are also a smoker Thank you. That was sort of something that got hashed out in it wasn't part of the initiative for say how to make the calculation of the initiative requires that to be reflective of the cost to receive health insurance on the market and smoking is a consideration for that. Okay. Thank you for the reminder other questions on the health-care. Peace. Your employees have access to that cuz it's been an issue as you all well know and do you have high quality Health Care at a reasonable cost is something that matters a lot particularly for people who are struggling. Just give me to pay rent and to do all the things that this High Cost of Living City require. So, I'm glad to hear that. It's moving forward well. Thank you. Is there another questions on that section? I'm on room cleaning if we've acknowledged that every hotel is very different and it's hard to have a one-size-fits-all. I'm however understanding the interest from this Council in and looking at regulating room cleaning in the substation think we have some suggestions on how to make that current process and work better and some things that were maybe not considered in that initial draft that we realized for implementation. I'm so I'm going to ask Miss stop if he'll speak a bit too. I'm some of those suggestions and impacts footage at our property. I can't wait around the square footage of our property really hasn't changed. The number of rooms at the associates are cleaning some of the challenges that we are facing some of our Associates dislike to work together what they would team up on a room if a room is 400 square feet now, it's not 200 for each but it would be 400 for each has a tree. Has limited their ability to work together to you know, what? I'm just for the sake of having somebody else inside the room with them and just to clean the room a little bit faster and the other of course. So I didn't quite understand what you were saying 200 square feet and you can have one person 400 square feet to get to people so feed prior to prior to this initiative Associates would just help each other clean room. So we have to housekeeping Associates with were perfectly fine with we have an issue with that and they would help each other clean the rooms in the current state there to do that because of chew Associates clean that room it goes towards 400 square feet per associate that square footage not divided amongst the two so they're unable to do that anymore. Just in order to stay within their square footage that the lauded for the day just put that in different words to the way the laws written on it defines. I want you to add an employee clean the guest room that the square footage of that guest room is part of that calculation and the maximum is 5000 square feet in an 8 hour day and there's no mechanism of two employees clean. Castro to the buy that square footage proportionally to be allocated in the full square footage of the room to each employee who cleaned it rather than splitting it. A flaw in the law because I'm going to argue and I think we've mentioned this before this table the two people can clean something and make a bed far faster than one person can so what would you recommend a shin be so that it's it's fair to both parties whether you are an employer or an employee. I think there's a way to amend the language that just has if the guest room is serviced by more than one employee in the square footage is divided proportionally for those employees at that leaves the option without without the unintended consequence of the additional square footage. Gatsby's online ordinance. We have some language we can share the follow-up if they if they finish their bored. Let's see in six or seven hours. We would pay them for the entire day because if they're finishing their board and their inspections are good and they're doing a great job. Why not allow them to leave early with a gun with that. I want to watch that. I want 24 we're unable to be that as of right now because they do need to meet make sure that they meet those 8 hours within the square footage and so now associate cleaning the same amount of rooms, but the art they aren't making it stretch so that way they are there for the entire duration of the eight hours. And that's one of the that's one of the items that are Associates have voice that are not necessarily in favor of thank you. What questions do you all have? the next steps for all of you So we have been. Providing this feedback to the council and we've met with customers scada and I know they're few offices looking right now and will be consumed in the process to but fracking and you're really helpful that there's opportunity to provide not only for us to provide these solutions for to have those written into any new legislation that's considered by this Council felt that mesob just brought up that I thought that is a very good thing for us to pay attention to that in their hotel. If the people who are cleaning the rooms get done faster than the 8 hours that they pay them for the full eight hours and they have in the past allowed them to leave early. So benefits the standards are met in the rooms are done that they get paid for the full eight hours, but they can leave now under this world that can't and so some of the employees are saying that's an unintended consequence that isn't helping them and clearly, you know, you're good will that you were willing to do Extinguish by a law that has been passed that isn't meeting the needs of either employer-employee to I'd like to look into that that be great and just to add to someone over the next few weeks flashing on two months were going to have the opportunity to have conversations with hoteliers with the hotel workers and the folks have been engaged in looking through various sections of the initiative to basically get of these questions. What was the goal are we able to accomplish it with existing legislation and M. What? If not then what how do we get to that? So thank you for that Edition. Also want to know that that's the same for the healthcare piece that you mentioned. Appreciate you sharing that. And I was just going to add our appreciation that we are able to be at the table through this process and I think we're in a unique situation where we do have two years to + years of actually implementing them to understand. What is working. What's not so we are very excited to help come up with Solutions on the pieces that aren't the fact that you are here talkin to us about it in a in a very collegial way towards me hear what your concerns are and that we can work together to move forward to have a question for that the five of you anyone want to answer. Are you seeing behaviors change our people and I'm not talkin employees here. I'm talking about our guests. Are they acting better? Are you having a problem? I don't know and I think that I'm not sure you can refer their back to the law. I think we've always been focused on making sure our employees are safe. So if there is behavior without gas that is unsafe, we would have addressed this before. I mean this law addresses this but you don't fortunately unfortunately we have into them self guests misbehaving and I think that has always happened and we've always addressed it. So we have elected people or when we have processes in place to address the safety of our colleagues at all times. I don't know if I Specific for my hotel, I would not have seen that change in behavior. That is a lot of our guests are international are there traveling from other states? They're not very familiar with the law. I'm so excited. It's hard to pinpoint to say that this is making the behavior better or worse, like my colleague mentioned. We do have systems in place. We do have training isn't place. I'm in order to handle. I need those situations that our eyes Give me that people believe that the law was necessary. If you have systems in place that you were addressing. Let's just save the misbehaving guest behavior that there must be other places that don't have systems in place because we heard a lot from people that were saying, you know, where we feel vulnerable or people are not listening to us if we've been so thank you for having systems in place. Maybe you'll be there, you know that high standard that were asking others to reach as well. So I look forward to hearing I'm if others come forward and say yeah, we think that it's made a change so that of course is what the objective is as people to be safe. Feel safe that your hotel is full and thriving. I was just going to add that in our commitment to panic buttons as a component of you no greater equipment to employees safety that is not just another players represented here today, but that's on behalf of our entire Association. So which represents hotels throughout the city so they can you look at the industry in Seattle that time commitment to employees safety really outstrip. Thank you. I appreciate that thing up those stories cuz we've definitely heard stories are acknowledging that I do think there is something interesting right Behavior might not have changed from the perspective of the owners of the hotel. I'm in Imagine International gas some people coming in from other states and perhaps you're not aware. I think one of the things that I heard from the workers was there is a sense of relief that they now know that if something does, There is a fall back for them, right they can come to you all and say this happened and we really don't need action to take place. I don't you know, I don't pretend that any of our work places are free from harassment and intimidation. I'm clearly we have incidences here and City Hall where we feel like there is no threats of either violence and I have not yet had the incidence of being sexually harassed here at City Hall. But we also have a panic button right there under our desks right here and here and it was a situation in which we want everyone to feel safe. And if I don't feel safe I've been able to go to our council president and say I don't feel safe. I feel like we need additional protocols and then know that that that backing is there is really great and we have our friends from the security. Thank you for being here. So I think one take on that question is something that will want to take out forward and future conversations. That there is. Safety net for workers to have as a backstop so that if something does happen to them they have they have a policy to Reliant is really helpful and I like what you said about doing the trainings that you have on the Panic buttons and place and that you are doing everything you can to help your sass feel like they have the protocols but that we can't really protect from inappropriate behavior from others. And when that does happen that they have someone in a policy to Reliant is looking to be critical lighting for us going forward to ensure that those policies stay in place and that their workable whereas you have the final question here for us like you just I'll be brief so someone has been working on this and looking at this since the spring of 2016 to when we actually crafted in the past to get on the November ballot. I know you talked to let me talk to off offline, but just to be candid what what parts of it the intent of the law. I was to protect the workers that was the one of the main safety features and I know that you challenged the law and you guys it's obviously a pending and the 9th circuit ruled in favor. And so that's they'll be another discussion. I'll just be candida straight for with you cuz I don't really want to waste a lot of time. So what what do you see is this is how are you? Where are you offended where you feel like it's not working for the industry. I I can understand about the registry. I get that sounds like we're in agreement on obviously safety and panic buttons. There may be some other issues about the chemical police are medical, but without just being around the bush just tell me what it is. Actually that you think we can meet tomorrow. Dr. Khan who was just in here about conflict where we can enter Jack Grace and humility and humanity and resolve this because the ultimate goal is the same as what you want because you want patrons and you want Please that are safe. So without going around and around and being around the bush. What is it that you find that would work that we can start talking about that to me makes sense? Otherwise, I think we're wasting our time. It should only wasting my time. Sure. I'll see if we agree with intent to make sure that our employees always are working in a safe and healthy workplace. I was just a commitment of our association in our members. There are we would have some challenges of specific sections and also could have throughout their opportunities to tweak things to make them make more sense operationally, you mentioned a couple of other challenges Around The Blacklist Ian. Peace, and I'm really interested in continuing to work with Council the Diggin on you know, how can we do that in a way that's not violating due process rights of our gas but also in a continue to ensure that our employees feel safe. So I think there are some challenges and that section and then more so just an opportunity to have industry input Make things easier make more sense operationally with protecting employees and making sure it makes sense for our employees as well. So if the employee if you felt that you had input in the beginning back in the spring of 2016. What would you have had him put in a nose a little bit maybe but you don't want to put you on the spot. I'm sorry, but we both been dealing with this for what three years now what kind of know the issues just one example where if there were more industry input that you could have helped us craft this so it withstood legal scrutiny. I don't know how much we can dive into that but there's an opportunity to improve and make it make it work better frankly and work better when I do work better than work better for employees as well as being more stream. Imitation so I wouldn't say they're so a one big thing, but we can go through and I think we've gone through with going to start living Toms River musky that her staff but the section by section to understand where their treats her with himself after dinner considered and just make the entire piece work better. I think what's really important is it to wholesale space between really the solutions we think are right and the law is there isn't this significant Delta? And so that's what we're heartened by that's what we've been looking at for the same amount of time that you've been looking at it and it's one thing when it first comes out when you're like, well, we just don't like this what we don't lie cuz you don't like it what you put it in place when she look at it once you operationalize is there is there some acceptance are some better practice or some best practices. So throughout that process we've been like, okay. Well if we were to look at it, how would we look at it differently perhaps 5000 Square Peter's square footage is an adequate way to look at it. I think that there's a little bit more conversation and I think that we've shown genuine interest and concern and taking your time and met with YouTube to speak directly about the areas that we think are nuanced or need a little bit greater clarification or need support related to administering it collectively and fairly at every single property. Not just sit there at that people around the table, but making sure that we get there easy to administer a term that I know that Catherine I were both had a very engaged throughout the whole process. That's why I was just going to add that to to go back to your original question. And I think one of the things that we discussed at length and it was part of her own making and it's been an ongoing conversation is if you look at the room cleaning section specifically it's taking a very general standard and trying to apply it and hotels of different sizes different service different parameters, and it's a very complicated Thing to apply very simply it's it's been extremely simplified which for good reason because I think much like we've agreed 5000 may be an agreeable square footage, but what that looks like for for each of us and all of our different properties is dramatically different what type of service we want to provide at the different levels of hotels is dramatically different and as part of the rulemaking process. We discussed that at length we talked about Flex service bus vs. Full service. We talked about refresh service which not all hotels provide refresh or or turn down. So it's it's a very it's a giant range of different levels trying to work into a very narrow definition. Do I have the answer? No, I don't I think collectively and I think that's the goal of today and moving forward is collectively hopefully in talking out only with employers employees who have actually lived through the process in the last couple of years. What have you liked? What have you not like because I think we've all heard thing. Set there and favor and things that they're not in favour much like we already share the examples. So my point is this just to be candid and I know you have to be careful cuz this is still pending and I know that their legal purposes. So I feel like until we can actually drill down on some specifics that you either find defensive or they don't work or it doesn't work in the industry or you felt like you weren't heard that I think we're just going around in circles. The second piece is we pass this legislation with it with the intent the black letter law of intent to protect workers. That's our main goal. So we will be airing on the side of that with understanding the impact of business, right? We want a practical piece that makes sense for the industry and for the workers and just for society as a whole that people can go to work and be safe. So I'm pretty pragmatic about things I would be interested if you can give us something in writing perhaps where you take apart, I think it's it's Parts, and I know that your lawyer said have done briefing but it doesn't it doesn't mean showing your hand on what your legal position would be if his case indeed gets accepted by the Washington state supreme court would give me some idea where you have a problem cuz I think we're just going around and around without actually saying this is the problem. I have I don't think a hotel registry is is is legal. We have a problem with that. I would probably agree with you on that one on the other issues and you use the word week, but you know, I love working with you, but I think we're talking about more than tweaking. I think we're going to have to be honest about what we're talking about. If you guys if you're telling me today that you're on board that there should be a law but maybe not like this, but if we know what the end goal is and that's worker safety and a healthy economy where people can come to our hotels then I know that we're on board, but if you're just sitting here today telling me maybe what I you think I want to hear. Hoping that you know your cases of hell didn't have to deal with it. Then you're wasting all of our time and then we're just going to take another run at it. That's that's what's going to happen. So I'm going to be honest with you. I appreciate that very committed to being part of a conversation on new legislation and making sure that our feedback right on every section some things. We agreed don't you know might not work the way they're framed like The Blacklist in peace and then other things that we shared around medical access and have room cleaning. There are simply some updates to make those sections work better for our employees that were really committed to working. So I'm going to say thank you both for your homework and also for the adding an actual a special committee meeting to our calendar to try to come back next month on this issue as well. So be on the lookout for that and in the meantime, thank you so much for all of your feedback and input. We know that you're sick. The other table talking about those details that camera wires is getting into and I have no doubt that there will be follow up materials coming and thought conversation. So we appreciate your time and we appreciate your perspective and for all that you've already implemented to help create safer workplaces. I had thanks again and congratulations on the Panic buttons in Olympia. Thank you a lot of friends to join us here at the table. So I'm going to get ready to read in our last item of business as far as I know if you could join us at the table and we'll do formal introductions in a second language development plan for discussion. Wonderful. So thank you so much everybody for being here and we're really excited to have all of you here to kick off our conversation around Fort Lawton as we get ready to do introductions. Thank you Tracy from being at the table with us from Central staff. If I didn't call your name, you should definitely because we want to make sure that everybody gets on the record here and Tracy Bunch start with introductions, then. I'll say a few opening comments with the office of housing Seattle Public Schools. Fax Jacob, Seattle Parks and Recreation. Robert Van Tassel Catholic community services Seattle Indian Services Commission really excited you all are here today. And this is a really great opportunity for us. This is a unique opportunity after 12 years and I've only been here for an all year and a half and I'm excited about this. I can't even imagine your anticipation for this conversation. This is an opportunity for us to create a variety of affordable housing options and services for our neighbors who really need them along with ample open public space park space and Recreation areas on 60% of the land and obtain much of the land at no cost to the city. We've been talking about various aspects of the Fort Lawton Redevelopment plan for quite a while including housing for seniors family size rental homes homeownership opportunities for low-income families and open space for a public. This is actually my notes a 15 years is 15 years more accurate. Okay, that's sad as soon as around their own. And so I know that I'm very excited about this from Alvarado from the office of housing is going to give us a high-level overview of the legislation and a preview of what's to come. She gave a previous iteration of this on our April 18th meeting. So we got a little little tiny window into that then and today we're going to go from Community Partners, very excited that many of you have been involved in the development of this plan for over this decade and for all of your work, we really look forward to making sure that this comes into fruition going to continue to review the local Redevelopment Authority's application to the federal government for reuse of the decommissioned army base at Fort Lawton. The application includes the Redevelopment plan and homeless assistance submission, which is an appendix to the plan both documents along with the reason legislation are available on the city council and office of housing websites. Super transparent of where folks can find it and it is all up there. And as we previously heard from City staff the Redevelopment plan Redevelopment that was previously provided by UPS previously approved by Hud. There was significant opportunity for public comment and review of the 2008 plan homeless assistance submission. And now the city is updating the plan and the homeless assistance submit submission so that we are reflecting current conditions and knees and what they had to do an overview and kick ass off here. Thank you and thank you for that really good description of some of the technical pieces of what we're reviewing today when we talked about our Fort Lawton work. There is a broad legislative package that's included in this body of work. The first piece is the Fort Lawton Redevelopment plan legislation. That is the Redevelopment plan and also includes as you just mentioned. The homeless assistance submission that's appendix H to the plan and those documents if approved by the council comprises the local Redevelopment authorities application that we will submit to the federal government namely to the Department of Housing and Urban Development. The second piece of this package keto will describe in more detail, which is the reason legislation. And then finally as I discussed the Redevelopment plan, I will also cover with our partners from Seattle Public Schools partnership opportunity with the public schools not really part of the show today, but looking forward to a public hearing and within the legislative package is a rezone bill that would rezone approximately 9 Acres of the Redevelopment area from single-family 7202 low-rise to with an M1 on mandatory housing affordability. Suffix on that reason bill is a necessary step for future Redevelopment of affordable multi-family housing. I'm in the Redevelopment area. So the council members are you familiar with our recent changes to the Lodi to Zone designation that Grandpa made it through. Mha at the low rise to zone is a multi-family Zone that allows I'll walk up apartments and ground related housing such as townhouses and outro house is the maximum hunt songs about 40 feet. So it's similar to the maximum height of single-family zoning. I'm in the vicinity. So that's not but you'll be hearing about primarily today but looking forward to the 21st will be a public Hearing in one of the purposes of the public hearing is to I hear testimony about the recent bill. We're also as you can obviously tell joined by many of our partners who are really the organizations and individuals who helped to carry out many of the components of this plant as you'll see as we're talking about the plan many of these Partners were identified as early as in 2006 or 7 when the notice of Interest Woods responded to and I'll walk through those responses on and they will be discussing themselves their organizational strength their connection to this project and connection to this land as we go through the presentation. I have talked about at a high-level the vision for redevelopment for London many times. This is taking a publicly-owned piece of property and creating an affordable and a livable Community. One thing. I wanted to point out today is the extent to which this fits in this Vision into the framework that the established by the Fed. Government for the purpose of reuse of their land and I'm sorry that I'm going to start this sentence by saying more for more than four decades. The US Department of Defense has closed or relined military installations and really many communities have already successfully converted. It was former military installations to civilian uses including affordable housing transitional housing for homeless people parks and business centers in 1987 Congress enacted the McKinney homeless assistance act and title V of that act said that serving the Homeless was the first priority for use of all Surplus Federal properties, including military installations. We've moved forward since then in 1994. There was a new Act passed the base closure community redevelopment and homelessness assistance act and is part of that act was designed to accommodate communities multiple interests in Bay Street. And also the national priority to assist homeless individuals and so that act place the responsibility on the local Redevelopment Authority which in this case is us the city of Seattle to really balance the needs of various communities, including homeless assistance and then submit that balance to proposal too hard for it to determine is compliance with the statute. And so really given that Federal framework. I thought it was essential so that we can move forward and seek your review and approval of this. What is really a balanced plan that's balancing at its focus a priority to serve homeless individuals with another interest of our city to expand Parks and Recreation space and the local priority to expand affordable housing for people with a range of incomes in 2006 the city provided Otis on the availability of property at Fort Lawton in 2007. We received five and a wise notices of Interest one was from United Indians of all tribes, which included a homeless housing market rate housing community in open space component one from the Seattle Housing Authority that had a similar mix 1 from dese the downtown emergency service center and to analyze that included no homeless components but one of which talked about park space and one about a Seattle Veterans Museum, I bring the slide up in part because many of the names of the organizations are the exact organizations that are sitting with us these many years later and also to show that what we did is take the component of those notice of this of interest where they were reflecting the strength of the organization and the vision of the public and our city and combines them as they are now reflect. In this plan, I'm we've had as we said over a decade of public comment. I'm going to reflect very briefly on some of the comments. We've heard tell you the instances in which we were able to incorporate that comment in some cases in which we were not on there has been a consistent refrain calling for a family safe environment as we do this Redevelopment. We are proposing to have a range of affordable housing on this site people of all incomes want to have their children live in communities that are safe as we bring more households into the neighborhood. I'm sure all new residents have a vested interest in the safety of this community and we have been asked to find a more suitable or different location for low-income housing and I would say as I said previously that our submission for our assessment for fair housing took an approach saying that we need a lot of affordable housing and we can't just pursue. One site. So this is not an either-or. This is the both and we can both have housing at this site and continue to look for other opportunities. We've had comments about not wanting us to allow housing for people with addiction or behavioral health challenges as we talk later a portion of this plan is the homeless assistance submission that asks us to look at this plans consistency with our adopted Continuum of Care for the region our Continuum of Care prioritizes housing first, as of vision in for serving homeless people and that is about providing the housing and then providing the services that people need and I know Catholic community services can talk more about that. We had Thomas to build even more affordable housing than we've proposed at this site. There is certainly a need for affordable housing across our city. Again, we think that this is a balanced approach That we proposed here. I'm we had comments about building a school at this site and because of an overwhelming amount of comments on that issue, we did incorporate the opportunity for Seattle Public Schools to acquire a portion of the site to create multi-purpose fields, which is a priority educational use for for that agency. We've been asked to incorporate the entire property into Discovery Park again that doesn't reflect the balancing of interest, but we were able to accommodate a portion several Acres that would be incorporated into Discovery Park. We were asked to minimize impervious surface on the throughout the site and we'll talk about how there are additional opportunities particularly at the maintenance building. I'm to consider ways to right-size the amount of impervious surface that's there and we've been asked to protect the Blue Heron habitat and I would say That our plan does acknowledge that there's a wildlife Environmental Conservation Area that's mapped by the city in the Fort Lawton site. And that includes a blue heron management area and there are strict requirements in place that comes with that kind of protection and all future development and related construction on the site will be subject to applicable state or local requirements. And then finally there's a consistent public comment about reflecting neighborhood character. I would point out that's a really sad adjectives and individualized assessment of what constitutes neighborhood character but to the extent that that comment is really about creating high-quality housing or Landscaping which is consistent with The Neighbourhood the plan reflects both of those outcomes. Emily I'm going to ask that maybe we turn to some of our Community Partners at the table, we have literally options ownership options Parks related fuses. I'm active Open Spaces Etc. But if we return to each of Our Community Partners in the order that you would receive a perfect I will turn over the mic. The first portion of the plan is really about creating 85 units of permanent Supportive Housing. We are very lucky to have Community Partners in Catholic Housing Services and United Indians of all tribes who would lead in the work of providing this permanent Supportive Housing, that would be at a no-cost conveyance to the city with a long-term lease to these entities to build a three-story apartment building with on-site services in the form of permanent Supportive Housing designed to meet the population. All right. I'll go ahead and start on Rob Van Tassel with Catholic Housing Services. And we are very proud to be partnering with United Indians of all tribes Foundation as well. So thank you for having us here to talk about who we are a little bit about what we do we've been going about this ice. I tell people before there was a state of Washington before it was a city of Seattle that were nuns here working with the native community and others going about doing this taken care of folks. So this is who we are and this is what we do we have approximately 9 different properties that do something very similar to this within the city of Seattle. We've been doing it for about 40 years throughout Western Washington. We have about twenty-five hundred units of affordable housing that we operate in addition to permanent Supportive Housing. We also do farmworker housing Workforce housing and some other types we decided to go ahead and do this with With the really the requirement that we work with the native community and that's why we have Mike to lie here with United Indians of all tribes Foundation as well as Jodi Olney with Seattle Indian Services Commission. And we feel that that is really critical. We don't want to go about this without that partnership. We all know about that kind of relationship that happens when the Catholic Church gets involved with the state and the native communities doesn't always come out well, so so that's why this is really important for us not to just come in here and do it. But to really partner with them. Our opportunity here is really create wealth within the native Community as well. As I share with them are processes on how we go about development as well as operating buildings and so on we would want them to be the eventual owners of this property within a. Of time maybe 10 years or so, but we would work on a plan with them. We're working on a memo of understanding right now, so I don't know maybe mid now Mike or Joey or both could go ahead. Speak to the thank you for your time that you know, there's been a rather history that's been up in very conducive for Native existence of berseria 1865 all are natives or pushed out of this area up all the indigenous people fast forward to 1970. The Takeover was kind of the beginning of that the reversal process but that being said natives are still struggle profusely in the city. We're doing our part to try to help that process along United Indians were struggling profusely. I even three years ago. Our door is almost closed. I was hired about 26 months ago. We are searching we are getting stronger all the time about 45 employees wear for scattered. Now, we're up to 78 full and part-time. We are we are down to two structures now. We're up to 4. We just found out Today we gained our funding from the state to I'll finalize our tribal canoe project Southwest Lake Union. So I'll see what that means is we're going to be devised an infrastructure down there and I were also going to take over a building at Columbia City. So now we're growing in the Mary Kay and we're also starting to provide stronger services. That being said we are determined to make sure all of our obligations are Mets. We're very determined. We're hiring a highly skilled people have a lot of people who are just really taking attention towards us or board is on board for their get there really they're excited about this opportunity finalizing our on mou with the Catholic community services making sure that everything is accomplished wraparound Services the physical maintenance of it Security on the job training. Condition of a tax credits is accomplished and we're more than glad to take over full ownership of the system Jodi. Yes morning and thank you for the time and opportunity to speak with you. So I've been on staff at the commission for about a year, but the commission has been around since the 70s. So I think trying to just figure out how to be of support to other native organizations pursuing development and asset acquisition and just you know as much as possible. And Consulting with Rob and his team and being accessible to Mike as well as calling in her efforts as to her and the house bored and so I think it's it's a critical time for Native organizations and lot of unmet need and so just trying to any meaningful way keep us moving forward. And I would say that just from a technical perspective the portion of the arrangement of how these groups work together is included as part of the legally binding agreements that's included in appendix H and Redevelopment plan. I'm and I also asked Emily Meyer who's here with us to speak about the services we provide. Good morning. You can adjust this if you need to. All right, so good morning. I supervise are Supportive Housing Programs in Seattle that are serving homeless individuals and we have several other similar projects to this where we work with homeless individuals who are coming to us. I prioritize through the coordinated entry system who have significant mental health behavioral health substance abuse physical aging needs and we bring people on site we welcome them or rat housing first is that the only mentioned a priority of our our community and also of Hud and we are very used to meeting people who have been homeless and living outside for a long. Of time walking them into our buildings and starting to build relationships with people. We know the importance of community of meeting people where they're at learning people's names hearing there. Stories building relationships with people and we know that that can have a really transformative impact on people's lives as we start to talk with people about what are their goals. What is it that they want? What does it mean to be a part of the community in our building and also the community outside of our building we have other buildings in the city where residents have eventually gotten really involved in neighborhood groups in cleanup efforts, then I'm different neighborhood barbecues the the Bell Street Park. We have a number of buildings near there where we have residents are active in participating in the events there. We have a building in North Fremont where we also have residents who are really involved in helping with different local cleanup efforts or summer barbecues are concerts and all of that comes with time, but we're really in it. As Rod said we've been doing this for a very long time. We're committed to building that Community within our buildings within our Neighbors outside of our buildings we want to be a good partner in whatever neighborhood were in so that the our residents feel welcomed and are also feeling like they're a part of the neighborhood as well. We know that people go through ups and downs and housing all of us go through ups and downs in our lives and people on our buildings are just like us in that way until we're committed to supporting people through highs and lows and keeping people in housing is our primary goal. I think you there been significant questions throughout the process about the extent to which there are available services in the Magnolia Community to serve residents of the housing and I think as you heard Emily say that part of psh is in fact creating the services on site to support that population. Yeah, I probably could have said more that we do in these buildings. We do have 24-hour Staffing and so that is there's someone always available. I'm either at the front desk or we have multiple case managers on-site who are available to connect people with needed medical or Behavioral Health Services other services. I'm generally are buildings have a van for transportation so we can help people get to medical appointments or go shopping things like that. And then again having someone on site 24-hours who is available if someone is having whatever type of situation Arise at any time of day or over the weekend or if a neighbor needs to call because they Hear something that they're concerned about then our staff would be able to respond as well. And another piece of more technical detail before we hear from more Community Partners, is that the thrust of the arrangement that you just heard discussed is the portion of the plan that's also included and outlined in our homeless assistance submission. And this as I mentioned earlier is a key piece that makes up our application to the federal government. The homeless assistance submission is largely similar to as it was in 2008 with a few notable changes that I wanted a flag for you all and for the general public first of all, we updated information about homelessness in Seattle based on current conditions and based on new information provided in the Consolidated plan as you all know since 2008, there hasn't been an increase in population including of the unsheltered population included updated information to reflect the fact that this new plan a transitions all of the Hub. US housing to be 85 units or designated for seniors the old plan had a component which was serving homeless families homeless assistance submission also updates information on how this plan addresses gaps in the Continuum of Care as I mentioned earlier that really emphasizes providing housing affordable housing in permanent Supportive Housing and you'll see an update in that piece about the the assessment for the need for a 85 units a permanent homeless housing, which of course I'm pales in comparison to what the actual need is. The second portion of this plan is affordable rental housing. That's also going to be provided by Catholic Housing Services. I don't know if there's something additional that you want to say about General affordable housing PowerPoint speaks family housing and very similar to housing me operating other places in Seattle and throughout Western, Washington. He's our families who have Lisa's and who are long-term tenants of the building in many cases on this property adjust notably as part of a conveyance. This would be a negotiated sale affordable housing is not a conveyance. It's identified by the federal government has no cost. So we would have a negotiated sale the purpose of having this housing is part of the community again is to represent both a balance of incomes and a balance of community needs and priorities with the US Army. Let's do Park schools. The other portion of this plan is a permanently affordable home ownership. This is a piece that has been scaled up since the 2008 plan going from 4 or 5 permanently affordable homes to what is now approximately 53 bedroom row houses. We will be arguing for a no-cost conveyance for this property based on the needs and construction costs, and we're really happy to have Habitat for Humanity. Another identified partner is part of the analyze. I'm joining us in in delivering this piece. Thank you have to have your manager. Seattle King County is 1 of 1200 North American Affiliates of Habitat for Humanity International with a common goal to provide affordable homeownership opportunities to families earning less than 80% of area median income at Fort Lawton as Emily mentioned. We propose to build around 53 bedroom homes and Townhomes similar projects that we've built are roughly 1200 square feet and will be solved the families about the six people all homes are certified energy efficient buy a third-part third party to keep long-term cost of ownership down at the completion of projects. Are we establish a homeowners association that will be responsible for the long-term upkeep and maintenance of the Fist of the buildings. We had a presence in King County for more than 30 years. We build more than 300 homes across the county and repaired or rehabbed more than 150. We handle everything in-house All Phases of construction are done by our staff as well as the selection of families and mortgage qualification for those buyers. Habitat buyers as I mentioned all earn less than 80% of area median income and they must have minimum credit requirement sword to qualify for a mortgage Under Armour model, which is a self-help model future buyers perform a minimum of 250 hours of Sweat Equity a large portion of those hours are spent a building their home and the home of their neighbors additional hours are spent to meet our education requirements include classes on financial management Home Maintenance mortgage document review an introduction to homeowners associations. I'll have it at homes are part of our land trust program, which means they'll never be sold on the open market a homeowner owns Equity by paying down their mortgage and threw a fixed depreciation formula overtime this ensures that when it's sold to the next buyer another family earning less than 80% of area median income can afford it the program requires Habitat to qualify any future buyers to make sure that they are in need of affordable housing and finally all homes are required to be the permanent residents of the owner which we verify annually. Amazing. Thank you. Are there HOA fees and the affordability? Now I'm going to turn to roughly 60% of the acreage in the plan which will be dedicated to parks and park related uses. Thank you very much. Thanks for taking off this meeting helps memory by saying this is a unique opportunity because it truly is the parks department is thrilled to be part of this great collaborative effort because what we getting it is approximately 13 acres of Parkland not counting the athletic fields for free. It's an absolutely amazing opportunity. We're expanding of regional Gem of a park and we're also having a really great collocation with some other very needed to Sylhet. He's so we're thrilled to be part of this this and the 13 acres have as you can see on the slide. There's there is a passive Recreation It's a combination of existing Open Fields and also natural areas and portions that will be incorporated into Discovery Park. So that we're thrilled about the the basic idea as far as the ultimate planning and development of other resources at the park. That's going to be part of a future effort. Thank you for being part of that. Child. You mind using the microphone to talk about the red line. So it looks to me like we're preserving land that's already there. That was the army. So when people say well we want 30 more Acres apart. That's the matter is it's their preserving and protecting it and I know that we'll we'll hear from mr. Podesta about athletic fields here in a moment, but that's teenagers that's going to be transferred to the city that we will Preserve. So this is a lot of land are comprehensive plan has some very ambitious goals and requirements for us to add open space to the city in order to serve the increasing density in order to have a livable City. We have to have additional open space. This is a once-in-a-career opportunity for us to to take 13 acres of land as you said or already existing mostly forested land and bring it into permanent public park and recreation. Use another outcome could have been the federal government could have sold it and it could have been developed in something totally different. So this is a huge win for the city and is Emily said comes at no cost which is kind of amazing cuz I heard sheriff in person eating something. I want to say thank you in advance for the work. They're doing with our office. We had heard in some of the earlier both public testimony. And then I'm in partnership with some of the people came to Ted to speak about Fort Lawton with me on the Seattle Channel who had some concerns that they would love to look at what it looks. The right size the parking lot for the parks a new facility. So thank you for helping to analyze that because part of our goals over the entire city is to reduce underutilized and unused space and much of that space is parking lots. So if we can help create more wildlife habitat areas and Emperor end and reduce the parking lot size for a job working in to this plan with you. Don't you so much exactly. That's one of our big gold everywhere. And so we're analyzing. As we speak and I think we'll be able to come back with some details on what that right-sizing really looks like and also that portion of the site which is the maintenance building in the parking associated with Maintenance building is in fact in addition to these 13-acre. So these 13 acres are specifically about passive open space there and then an additional approximate 6 Acres which will move into now for active open space. And then there is additional site for the maintenance facility that then the parks department will look at right-sizing the impervious surface surrounding that so this is three various Parks and Recreation components as part of this plan. The second piece that's not passive is this active open space in in rfe is we studied to have two unlit multi-purpose athletic fields the opportunity here presents itself with a partnership with Seattle Public Schools, I think both SPS and the City Parks and Recreation identify a need for more fields in our city to have Recreation on and so this presents an opportunity to have participation with SPS to meet their educational needs while also ensuring the outcome that's been promised in this plan for recreation uses. Don't know welcome back to the table to be here. Once again, I want to thank the council and our partners in the office of Housing and Seattle Parks and Recreation for working with us. The district is like everyone else to table it has to develop property is thankful to be able to participate in the potential opportunity like this. We have needs to assemble acreage just like everyone else around the table and it's getting harder to heart and harder to do in Seattle. We have potential Education Direct educational needs. But right now we have a shortage of athletic fields. We're opening a new Comprehensive High School Lincoln High School. The first one in decades that the district is open and what has no athletic fields and we are joined at the hip with our partners and Seattle Parks and sharing athletic fields to a joint use agreement. So however, the property gets develop athletic fields will be good for the city. District is welcome an opportunity perhaps participate and funded the development funds in the effects 5 Levi which voters generously approved in February. So we have funding in place to develop to multi-purpose athletic fields will work in partnership with Parks. So the as we always do so the design of the fields meet recreational needs both for schools and for General recreational purposes for the public, I think from the standpoint of the context of this project. I think the city's on the path where the same outcome will occur. They'll be athletic fields. That's how do we get there? How do we work our relationships with the federal government? I guess I should put down marker at this point. If the district ends up owning the property down the road. It may need to be a school. You know, we would have to judge in the future. Do we need athletic? Is more or do we need a school more? That would be a separate again? Oh, that would be every development at 4 to change of use all that and that would be a no a decade down the road and in our current a world athletic fields are as much of a pinch point for us at schools are perhaps more. So that's not a foregone conclusion either but I think that's the main difference in terms of what the community will see if if Parks develops if I think it's a park in perpetuity or it may be an athletic field forever or someday. Maybe you need to be a school if that's a higher educational need. We have bad credit, but we got a lot of horse trading for that happened. So I'm just letting you know now just cuz your school over there now knowledge to that. This is something that the Magnolia neighbors have asked for mad. I just I know how hard that this has been and the fact that there's been years and years in the work going back 15 years, and I know that you suffered through a number of public meetings. I was there to witness some that people want something different than what you are maybe providing and they want it passionately and I just want to really acknowledge Emily just how strong you've been throughout this office of housing has been a fabulously in the fact that the school district has stepped up. So, you know, thanks for the alert and maybe an athletic field for 10 chilis. And and over it. Eating her out this morning, but thank you, I just want to acknowledge that we have funding for an athletic field. And for the purposes of of the plan and in for the public in the event that there was any future use that would have its own environmental work associated with it. The outcome that is covered by our environmental work is the multi-purpose fields and also the way in which the plan handles this relationship is that it provides an opportunity for Seattle Public Schools to submit for a conveyance. And in the event that they choose not to or unsuccessful the Seattle Parks and Recreation would go ahead with a no-cost conveyance for the park uses us up with a few concluding comments here and we mentioned the mark the parks Maintenance building and more opportunity to discuss that just very quickly summarizing these conveniences. The only one that we haven't mentioned that also shows up on this is related to the infrastructure that I can mention later and that is Remembering this is a federal piece of land. So text this way, which is the primary right of way in that property is federally owned and would also need to be conveyed to the city to become a public right-of-way. I'll mention that as part of the infrastructure doing a planning effort like this and the Redevelopment necessitates significant attention to new and upgraded public infrastructure. So we are working closely with our friends at spu in City Light and she just sound energy and solid waste to really discuss how we transition this from a private to a more public property a portion of the costs associated with those new infrastructure pieces will be included in the development budgets. And as with all development. This will be an ongoing process in all does not need to be completely finalized prior to submission of this. Plan, I mention the Landscaping that will keep it in mind to keep moving on the neighborhood character. What is existing in that Community Development funding much of the affordable housing would be funded the way we do affordable housing funding on the permanent Supportive Housing and on the affordable rental housing we act as a gap under we anticipate that the projects would also include low income housing tax credits may include State money and then also private private bonds by and find financing. I'm for the permanently affordable homeownership units aside from the funding that would come from our office of Housing Home Ownership program. The majority of the leverage comes from individuals down payments and mortgages and then there is some other hypothetical Partners through the HUD self-help homeownership program and Federal Home loan banks on the park site. The primary development costs would be associated with developing Fields. Otherwise, this would be a no cost transfer of property. And then as Max said overtime there could be talked about what resources and what planning is needed to further activate the space. Great some before we go to questions any other comments for the Community Partners has an impressive group of stakeholders and Advocates who been engaged or any other comments even get a chance to share. I will take that as 15 years of comets have already been provided questions and we will have multiple conversations coming up here soon by way of reminder the next committee a discussion will look at the legislation on May 16th. We will look at then at having MD her Committee in the housing Health Energy and workers rights committee on June 6th a possible vote after another discussion on June 6th. Again, May 16th and June 6th. There will also be a public Hearing in the evening that will be right here in council chambers on May 21st at 5:30 p.m. We encourage the public to come and comment on all portions of the plan including the Redevelopment plan the homeless assistance submission and the rezone legislation. That's why we have multiple on Central staff members here. We want to let the public know that childcare will be provided that Things we do. Hope people turn out and our kiddos will be cared for him and the plans and the submissions on the website the proposed Redevelopment plan and companion zoning legislation is also available on this committee's website as well. Look forward to having the conversation on going with Parks about changing the legislation before final passage to include creating more space out of the chair and the future. We look forward to Future conversations with the schools as well about the need for additional schools child care in addition to arm our Parklands and play field. And then the last thing I would say is when you come next time could you give us an update on your conversations with the partners? You mentioned spu City Lights somebody other agencies and I'd love to have an update as well at that time. Sorry to Spring this on you but on Our conversations are going with Metro on increasing potential bus utilization. That's the two things are three things. I heard your side of a housing. Wish there was more they want to have schools. They want to have more and they want to have more buses and I think as you see in what we talked about already, we are doing a lot to address all of those ideas and concerns that Emily outline the beginning from public comment to look forward to hearing more about that. You guys are tremendous fifteen years. We are going to actually move forward on this and hopefully we will see some of you on the May 16th date on Xfinity is May 16th. As I mentioned. We will have Fort Lawton plan amendments at that time. I look at the legislation will also have an Administration and finance plan and housing fund Administration and finance a financial plan is an at it finally referred to as of the ANS plan. Thank you officer housing program appointment. Adjust quick announcement would be hosting a 5:30 to 7 p.m. At the University of Washington University Friends meeting place at 4001. This will be with the University of Washington Post stocks of representatives from the University of Washington as well and experts from harassment and discrimination policy and legal research that will be talking about best practices as public institutions. Want to leave by example on this issue and to lift up the voices of workers who brought their issues for both hearing from workers and and will be great Community Forum. You guys are tremendous looking forward to getting this over at the finish line with all of you and this meeting is adjourned. Thank you. Thank you.", "end_time": 8438.7}]}