{"format": "raw", "annotations": [], "confidence": 0.9354329764306009, "data": [{"start_time": 0, "text": "Good afternoon, everybody. Hello. Find we're going to go ahead and get started to ask folks to turn their voices down a little bit. My name is Mike O'Brien. Welcome to the sustainability and transportation committee. I'm joined today by my colleague council members Johnson and semont. Thank you both for being here and staffed by Jasmine Roth. Thank you Jasmine for being here to we have four items on this afternoon's agenda. We're going to start with a presentation on the bike master plan implementation plan. Then we will have a discussion about legislation which won't be voting on today creating an EV electric bill Readiness ordinance for new construction, and then finally will take up to reappointments to the levy to move Seattle oversight committee. We have a lot of folks signed up and I'm going to I'm going for about 30 minutes on public comment and try to get as many folks in as possible. We've cut the public comment time to 1 minute each and a folks are here together and if three or more people come up in a group Speak together or share some words. I'll give you 3 minutes as a group to do that. And so that was another sign up sheet. But just if you come forward and say you're part of a group in those three people, you can only be in one group just to be clear, trying to get as many different people to speak today. So I'm going to start with David Haynes and then Doug Doug miles maybe and then Tom Gaffney. Oh David, yeah. We need to fire those still in charge you failed miserably copycatting elsewhere places on business vacation to Patchwork fix a total modern third world infrastructure for bikes. In fact, the second most dangerous location and 1st and permanent injuries is a burke Gilman Pikepass specifically under the Ballard Bridge East to bloc's there is a cement and Joy Ride train causing thousands of Rex while government claims. They have the answers by adding another Lane of highway traffic coming off Leary Avenue speeding bypassing 3 traffic lights at 11th Avenue 14th Ave and 15th Ave Seattle government in charge drinking and think about it changing with adding another Lane of highway. Traffic is unnecessary. We need to force the cement trucks on to Leary Avenue or out of Ballard. It's totally unsafe to ride your bike starting to Black Sea to the Ballard Bridge headed west on under the bridge. There is an obnoxiously loud Train That's destroying the Fresh Air with toxic plume 24/7. The dirty trucks are short cutting and speeding right in between two gas stations. One of which is the PCC. Being built in feet 10 feet from the talk to train and is kicking up poems of does retro. These kids are coming to preschool. You need to shut down the same a big concrete and Gravel Company is David haven't been joined by counselor. Miss K. Thank you for being here. I am David Myles. I live right over the hill on Martin Luther King just a couple blocks south of cherry. I've been riding a bike in Seattle and commuting in Seattle for over 60 years and I'd stay over the decades more people biked it got safer more mutual respect lately in the past decade decade and a half. There's been a push that's made biking less safe. There's been a push for bike path except these unsafe separated for the Curve will knock you down with the Roosevelt, which I remember my sister saying how much she liked to ride down Roosevelt because she could just zoom along. Well, I've been down at twice since I put the bike lane. Of course, I don't ride in the bike lane because it's dangerous. It goes behind the bus stops. You cannot ride fast, which is what I like to do. So I I think maybe it was the wrong reason for canceling that 35th Avenue bike path, but it was the right thing to do and I've written 35th. That's where I had my most unpleasant experience in Seattle when I was riding for friends house block and a half away and a guy you leaned over his baby to curse at me and say get yourself on the trail. He was talking about the burke-gilman trail the trails and the past make biking more dangerous David, Tom. And tells me followed by gave Glenda and then Marty open timer. I'm Gabe galanda with Tom Gaffney and Bob's Fish. We can't love 3 minutes will do that. I'm a civil rights lawyer with my office in Wedgwood and I'm an advocate for the safe 35th Community Coalition price of 5091 taxpayers 57 entrepreneurs who owns small businesses along 35th Avenue Northeast and five Community associations from North Seattle to be clear. We support a safer 35th Avenue and a smart redesign of our communities Main Street. We support slower speed limits left hand turn lanes that signals or crosswalks and flashing beacons more sidewalks, of course, cuz there are no sidewalks in Northeast Seattle and curb cuts that are accessible to all we also support preserve a bus stops. The only point of contention was a 2.3 mile bosal 44 protected bike Lanes, which we believe would have been paired small business owners in Commerce and displays certain demographics in our community like the elderly. Recalled by late 2016 s. Recommended against we Channel ization and platooning of traffic along 35th by way of bike Lanes based on 68% Community opposition. Heated the bike Master plans requirement to the city engage with and listen to the community as you all know since 2015 the bike bike master plan is provided quote as project move through the project development process analysis design and Community engagement may lead to a project being developed in a different way than envisioned in the plan. That's precisely what happened. That language was the linchpin to our community. Advocacy, especially and mediation with the mayor's office and S. We followed the bike master plan in our advocacy. We did our research wendgames to traffic planner in the traffic engineer who devised our own position engage in the mediation process in good faith position paper supported by 39 dependencies that we'd like to offer the committee for its consideration due process. We proposed compromise by the mapping the Tom Gaffney here generated. We propose need a safety improvements along the 39th Avenue Greenway, which are part of the mayor's adopted plan. We propose a new Greenway along 30th, which we solicited and receive community support for we also proposed and supported proposed bike Lanes along part, but not all of the 2.3 Mile Stretch. Unfortunately, the bike Lobby was not interested in any compromise leaving the decision ultimately to make a TV made by the mayor. Andy and the city follow the bike master plan in a ride to the compromise it provides further quote the BMP May recommend a protected bike lane on a particular street, but there are projected development and Outreach process. We may determine that an alternative facility such as a parallel neighborhood Greenway would be preferable that's precisely what the mayor decided in adopting improvements to the 39th Avenue Greenway that exists in our neighborhood. We were main support of a new Greenway and other facilities that will allow for biking in our neighborhood. We thank the mayor for the decision she made it was a compromise and is everyone knows and compromised situation. You don't get everything we want we're at 100% pleased with the decision, but we support the decision on the less. Thank you for your audience. Thank you next and Marty's going to be followed by the park and then fill up twice. I'm joined by Debbie wellner from Lakewood Seward Park. So will last for 2 minutes if we made Transportation share of Lakewood Seward Park neighborhood association, and I'm here today to speak against the S. Protected bike Lanes on Wilson Avenue South. I can tell you that the residence of Wilson Avenue and the neighborhood including many Avid bicyclists are largely opposed to the installation of these bike Lanes Estee proposes that they will be installed in the interest of safety, but we know they will have an opposite. In fact bike lane project will eliminate parking on one side of the street which will force our many seniors disabled and families with small children to park on one side and cross a busy street to their homes on the other side that sets up a dangerous situation F. Also believes the change will result in safer driving conditions, which we question. In fact, we know that Rainier Avenue South Road diet has diverted a significant number of drivers on 2 Wilson Avenue South and that increased traffic is created more safety problems including periodic accidents in our neighborhood. Furthermore. The Wilson Avenue South project creates eight tenths of a mile of orphaned protected bike Lanes what I mean by that is this project provides a tenth of a mile a protected bike Lanes in a 4 and 1/2 Mile stretch of road way most of which can never be protected if the entire 4 and 1/2 Mile Stretch could be protected the community might have a different opinion, but this project only creates this orphaned 1/10 Mile Stretch a bike lane at one of our meetings with us. 1 Stafford told us that there was a commitment to 50 miles of protected bike Lanes in the city, and this was going to be part of it. Additionally, the preferred path of the vast majority a bicyclist is to travel North or South following Seward Park Avenue South and Lake Washington Boulevard not Wilson Avenue South most bicycle is do not travel on Wilson Avenue SI degrees to read to do a study of bikes autos and pedestrians which they did for one week last met despite having agreed to share those results for the community 10 months later. We have not seen them. That was set for 3, but you only have 2 minutes so And you can pick his me fall by Philip Weiss Kathy Dunn and David girlfriend. Good afternoon, Wiki Claude Cascade Bicycle Club. Bike Line on 5th. Ave. Northeast is a blow to anyone who engage in the public proving that straight for the next decade or more protected bike Lanes demonstrably make Street safe of people walking and biking and help create safe to travel speeds for all the solution is a confusing middle ground that doesn't seem to address any of the concerns raised in opposition, but more importantly does not make it so people why can't biking or walking. That's the question. What is the station for transportation in this growing city what two and three people want more options to get around in some somewhere other than the car? Alaskan Council today for the support. We need more accountability somehow passing laws and policies be that Visions are I will complete Straits is not enough somehow by the public money with the move Seattle area is not enough. We are not doing enough to make us to be safer for everyone and that needs to change. Thank you and tell you that because he's like this not have safe bike routes and I'm angry that the mayor in s. Of canceled say bicycle of proving some 35th Avenue. How can I trust the city of going to follow through on its promises Eastlake? If you can't follow through on the Promises to 4 35th Avenue? The safe bicycle routes in my neighborhood have already been delayed a 2024 which gives five years for the mayor and S. To find out when it way to renege. Implementation plan that is being presented to you today. Might as well be written on toilet paper for all the tea actually guarantee. You will Erica Barnett in the urbanist written pieces about this about how it moves to go put closer and still cleans touchdowns recycling. I also want to know that the levy oversight committee nominations of for you those people should be advocating on their communicating fourth at nine the last three months of minutes for that. I do not see that make ask them if they will do that. Thank you. Thank you, Kathy. I'm Kathy Dunn. I live in West Seattle. I'm 68 years old. We had a success story and Admiral Way, we had five meetings with the community and it has started to try to wait by Clint One Way bike lane on each side of the street people scream. They cried. They were bitter fate one woman got up and bawled because she was going to lose a parking space in front of her house in the on the parking and we they put them in and now it's safer is, they have statistics now that are Less ad accidents on them away and I'm not scared to death because I don't have any grocery stores there any shops at all in my neighborhood. I have to bike up that hill and there's no alternative route and I would like to say that this morning I get my weekly ride from West Seattle to Beacon Hill first class. There's six blocks of Terror on 4th Avenue South between Spokane and Lander they paved it recently they put in 6 Planes and two parking Lanes, but they couldn't squeeze in a complete street bike lane on each side and they said well wait some day. We're going to have an alternate route. I've been waiting since 1996 for that alternate route. And then Alec Zimmerman. Hi, my name is David. I'm West Seattle bicycle computer in the downtown on my West Seattle. Bike connections member Cascade member. I'm a taxpayer I have voted for just about every tax it that we are ever put on a ballot, you know, it's if it says we're going to improve things. I'm I'm for it and the bike master plan was one of the things that I find the the Levee the the move Levi is one of the things that I voted for and I'd like to see it continue. I'd like to see progress made and I'm not so sure that we're on the right step by. backing off on a lot of different projects for other priorities Thank you. healthy Chelsea Michigan with transportation choices Coalition speak on the PMP implementation plan. We want to acknowledge a lot has happened since continued escalation of costs and often unpredictable Federal funding situation and we understand this year's BMP implementation plan is grounded in those sometimes Stark realities and that it reflects a priority to rebuild trust with the public and we appreciate that. However, we also want to acknowledge that there remains an enormous and existentially critical need to transform our transportation system and the active Transportation including a robust bicycle Network that is integrated with and complementary to our growing transit system is an essential part of that functioning system and to achieve this is City needs not only a viable plan but and improved process for implementing that That is respectful of all opinions, but truly grounded in the policies. We've agreed to his City Vision zero complete streets and our climate goals all about Don Brubeck then Sarah and even Rico and then Joseph laubach. Vehicle right. If you are not see big enough to get stop a pig from Animal Farm. I might I speak right now with you seven hundred thousand freaking idiot who live in the city pay for bike. Co don't have license to pay for that releasing tax for my car. Take it everything in a thousand bucks. Why? Why is it $700,000 Bill gay? Or another Amazon billionaires. Why are you freaking 700,000? Idiot in the money is Kim killing everybody bike and Driver everybody on his next week knowledge. This is council member Johnson's last committee meeting and hence. It's the last time you'll hear testimony from Alexander McQueen. All right. I'm a member of West Seattle Bike connections. And I'd like to thank the council members especially outgoing members Rock Johnson and Michael Brian and Sally Bagshaw for being champions of Equitable and safe connect to Transportation Systems dedicated by staff. Read Breathe by Caskey that you reject this update to the bicycle master plan implementation plan. It goes backwards instead of making progress instead require s. To adopt and implement the 2018 version which was never accepted by the mirror. And and put that into effect in the ad in about the 21 billion dollars of funding over the remaining years of the move Seattle Levy in order to fully implement the projects to actually meet our targets of 2034 a connected City Wide Network in 2035 for complete completion of the bike master plan implementation. Sara and Ava Hi, I'm Sarah. This is my four and a half year old daughter Ava mom and a bike computer. We ride for fun for sport to work and to school and to explore this great City. It was peddling on her own industry without training wheels before she was for access to see streets in bicycle options is just one of the reasons we love Seattle, even I can use together Daley sometimes by bus our car and most often on a cargo bikes together from our home and Wedgewood does a blocked off 35th after winding through various bike infrastructure or lack thereof. We find our way downtown just blocks from here for our work in school. We used to ride regularly on 35th, but after being hit by a car making a right turn there one morning, we're forced to find an alternate route where we could find more comfortably coexist with cars out of her way on the 39th Avenue Greenway. It is not an acceptable alternate or parallel route nor does it allow me and my family are safe and direct way to access the neighborhood businesses on 35th, which would like to partake restaurants grocery store coffee shop in the library. I chose this neighborhood in this community and part so I can continue to buy to the places. I love or want and need to be I want to live in a city that prioritizes Safe Streets for me and my entire family be in our car or on bicycle assistance to scrap the bicycle master plan in favor of more cars on streets is disappointing. We are angry and sad and it is not a compromised. It does nothing to support our vision zero and the Safe Community. We all want Ava and I stand here and ask for your continued leadership to step up and say what's right to carry out the bicycle master plan and support policy that prioritize the safety of all of our residents big and small with you to go a little lower because you had two people that are so thanks for testifying. Joseph Hello, my name is Joe Lubbock. My family lives in West Seattle. I'm an active member of the move Seattle Levy oversight Committee in our 2018 annual letter sent to the mayor and Council on March 5th, which I hope you've had the opportunity to read the committee states that the 2018 Levy goals of the bicycle safety subprogram. We're not met specifically referring to the number of protected bike Lanes constructed. The letter States at this rate of progress is unacceptable. These are not just empty words much of the public testimony. Our committee hears relates to meeting Vision zero goals and giving people the ability to get around our city safely on bike and by foot. I'm a bike rider and parents of an 8 year old bike rider. I'm not yet comfortable having my daughter by concert and stretches of road to get from our house to amazing places like Alki Beach. So we end up in the car when I learned the city abandoned plans for a protected bike lane on 35th Avenue. I was very frustrated will the same short-sighted decisions jeopardize protected bike Lanes in other parts of Seattle. Play some pool event. Please implement the will of the voters and connect every neighborhood with safe comfortable and convenient bike routes. Thank you. Thank you to Megan Murphy you next by Peter Goldman and then Glenn Bowman. I was in Olympia about a month ago and somebody was discussing the electric bike renewal tax how they're they're going to get a break if they buy an electric bike and all the psychological benefits and physical benefits emotional benefits of bike riding. So, how are we going to use this tax? If there's no bike Lanes in Seattle mayor? Durkan, we're passing the ball to you because I'm families want to have safe places to bike ride and sometimes the first design isn't the most elegant design and we're at we're inviting mayor durkan to struggle with us. I'm on finding the best design. We tried to pass the carbon tax and believe it or not someday. It's going to pass because climate change is having impacts disproportionately on people who struggle financially and if we have these bike Lanes, then it's more on the grid of the future. We have to invest in the new grid, which is that of Renewables bikes and it's time. Playing now. Thank you. Peter good afternoon. My name is Peter Goldman. I've lived in West Seattle for 36 years on both the bike commuter to Pioneer Square and a recreational bicyclist. I'm here today to Earth political leaders in this great screen and supposedly sustainable and livable City to recommit the building out the master pipe plan when Amazon was searching for a second headquarters. What are the criteria for each proposed site in your region identify all transit options, including bike lanes and pedestrian access to the site in Amazon Silver Bullet down. What is this signify? What is the Amazon signified? It means that all of us living in this city and region know they're just too many people too many cars and too much traffic bikes. And of course bus Rapid Transit Light Rail in buses are our only hope to move people around safely comfortably officially officially and sustainably this is not about bikes vs. Cars. It's not about spikes vs. Small stores. This is not about any of that. This is simply about Transportation policy sustainability and safety. Livability the way Amazon wants to see its cities, please double down. We are promised that 930 million-dollar Levi, and we know we're only halfway through and it doesn't look good. Please double down. Let's build it. Thank you Peter. Can you be followed by Phillip singer and then Barbara Gordon? Is she still here? Hi, my name is Glenn Bowman. And I am not a member of the bike Lobby. I'm simply a dad with two kids one who's 16 and frites fight by himself. I regularly have to go to 35th and I'm here to speak in favor of doing whatever Council can to get that plan back on track specifically. I'm I have four asks do whatever you can to director for chest. To follow the city's complete streets and vision zero policies ensure that any recent projects that were called bike projects are not counting work that is not related to bicycling in particular 100% of the 35th Avenue Northeast project including the $14,000 for the mediator. Pathfinding legislation which legally requires s. To build complete streets require a start to not present a do-nothing design for projects when that design does not meet city ordinances and policies. This is one of the reasons neighborhoods to man these designs and don't feel heard. When s. Chooses a plan that does follow city ordinances and thank you to all of you especially Rob Johnson for everything he's done. I thought Hi, good afternoon. My name is Phillip singer. I live in Northeast Seattle in the Sand Point Way area. And I want to urge the mayor's office the mayor and the city council to implement the bike master plan and to implement bike Lanes on 35th Avenue Northeast. I've lived in Seattle for 22 years. I've seen a lot of changes. I biked for 22 years around here. I'd like in North Seattle Seattle ebike in South Seattle and I've seen a lot of improvement. I've seen a lot of good things happen and I want to see that happen to my neighborhood. I live in the Sand Point Way area and the closest shopping area to me is 35th Avenue I go up there is a library and go up there to the bakery's I go to the Post Office and my dentist is on 35th Avenue and he has a sign in his window saying no bike Lanes on 35th Avenue. So we really need to have this. I think it really improves the street and improve some neighborhood just makes the City more livable you will but I've seen throughout this city. It really helps and I don't want to see happen what happened several years ago on 75th and 35th Avenue where two people are killed by two pedestrians were killed by a drunk driver on 75th Avenue. I don't want to see that happen again as some driver to put in a bike like thank you. Thank you. Barbara is going to be followed by Emily Payne and then Patrick Taylor. Hi, I'm Barbara Gordon. I'm a mom and my mom to an 11 year old who lives on the greenway, right and Bryant and Greenway is amazing great to have but it doesn't get you to businesses and the bicycle master plan was addressing just that by putting in a bike lane on a street where there's library and there's businesses that an eleven-year-old child wants to go to that families all over that neighborhood want to go to it makes so much sense. It doesn't make sense to keep people just on Greenways Greenways are wonderful, and they get you from one neighborhood to another and they are enjoyable for the neighborhood, but people want access businesses, and I just wanted to So, thank you. I'm Emily Payne co-chair of the Seattle bicycle Advisory Board commenting just as a private citizen because the board did not see the butts of bicycle master plan implementation plan in time to organize a group response. I'm concerned some of them particularly regarding the designation of some projects as risky. We think that this potentially gives us. Excuse to back down on projects that they've already decided that they're not going to put their full force behind. We're also really concerned that there are projects in the implementation plan list that are not endorsement. That's my time. But thank you very much. You all are meeting tomorrow night. I believe in so I don't know if you'll have time to get to Baxley probably already have an agenda. But whenever you're ready, we really want to hear from the committee and pepper pepper. Give me followed by Matthieu Lange and then Paul Factory and will take three more after that and then we're going to hold public comment until the end of the meeting for folks who want to stick around. Sorry about that name is Patrick Taylor mslc, as well. As a member of The Advisory Board said I'm speaking as an individual. I'm here today to speak because patterns emerged in this administration of delaying eliminating bike plans that you've proved challenging controversial bocinas on 35th 40 s 12th Avenue South much of the central city planners have been delayed at the counseling tourist. I'm in the one I look at the implementation plan and see many of the most important. Jax is listed as risky which within pair with an Administration that does not seem to have the gumption or Vision to follow through on Project approved challenging. I I feel a strong sense of concern and I would like to either see as you said earlier a strong statement from the mirror. I'm expressing her vision for transportation in our city and we're bikes play into it or failing that my money and endorsements from the council for a revised plan that I'm as more of a guarantee of what will be built and we will follow through on your commitments. Hi there, my name is Matthew laying on the lead organizer at the transit Riders Union. I'm here today to speak for the transit Riders Union. We are not pleased with the decision of Mayor Durkin Administration to cut the protected bike lane on 35th Avenue Northeast. It is it is a problematic thing because we have the bike master plan and the S. Study that showed that we should be building these protected bike Lanes. We need to be taken care of people in Seattle that that use other forms of transportation other than cars as a car driver myself. I work Oliver King County. So I have to drive I drive along the 35th Avenue often. I drive along Shilshole as well. We are not prioritizing safe bike transportation. I feel like I am I I feel like people are not safe right eye. I would rather prioritize people safety then have to circle around the block again to find another parking spot. Thank you. Call after Paul. We're going to hear from Kim kinchen and then 350 Seattle has a group will hear from Tamara schmolze and a puma and then with your family and then that'll be it for now and will move in the presentations and the end will take some more public comment is about 10 more people to find out if you stick around him. I'll stick around to hear from you. Thank you for my name is Paul and the 15-year residents of the neighborhood near 35th Avenue. I'm a pedestrian in the area transit Rider. I take bus and light-rail. I am a driver and I'm also a cyclist occasionally. I think that the revised plan that was presented last week for 35th is simply poor urban planning. It goes against everything we know about Urban Design about trading Vibrance healthy human scale. Livable walkable neighborhoods and I think that sdot knows of that and I think that this was a political decision and I don't think anybody at. He is proud of this design. This is a car's first design. And it exacerbates an already bad. streets Street design Thank you Paul regarding the parking concerns that were voiced. I think that this really doesn't seem to be about parking as the final plan doesn't really answer that most of these businesses have off-street parking already plentiful off-street parking. Hi, my name is Kimberly kitchen and I live on Capitol Hill and I buy a can I walk and I bus I do not drive. I'm almost twenty years ago. I took a photograph and a pile of paperwork to one of the city's neighborhood service centers to apply for a passport and I brought supporting paperwork far beyond what the US Department of State required of me and for photo ID. I brought my Washington state ID card, which is issued by the same Department. That issues drivers licenses. The clerk told me that because I did not have a driver's license. I would need someone who did to vouch for my identity, even though my ID card was issued by the State Department of Licensing. The city literally not recognize me on my own without a license or without a license driver. Today with this scaling back again another bike master plan. It doesn't feel like much has changed in the city. It feels like the city still barely recognizes those of us who cannot drive or if you try to choose to drive last I can't and I'm so tired of being an afterthought. All streets can't do all things for all people. Mr. Zimbabwe. Do you know where that is? It's because s. Continues to prioritize the movement of cars and the convenience of drivers over the movement and safety of people on virtually 100% of our streets, but it's just like to go to the cars and people get you know, all of our streets. It's a public health issue Public Health. Would you ever back down on public health policy because of the vocal minority of people who spread misinformation and fear Frank, Iero. 350. Org I'm 3 minutes 350 Seattle. Thank you Mike. I know it's like right with our transportation team and fully connected. Bike Works are required. Absolutely. If we are to eliminate the 50% of Seattle's greenhouse gas emissions that come from personal transportation. We ask that the city keep his promise. Personal note, I'm not glad also with their transportation team as a cyclist in the city and has made of harassment of people out on the street a bicyclist in North Seattle on the road into a crosswalk and told I am sick of you people. Get out of my way. That is the daily reality for those of us who bike in the city and that is what I hear from. My neighbor said he's okay for that harassment and for me not to be safe on the streets and it is astonishing to me that our mare comes out get out get out of the main street did over to the like little rim size trees out of the way. Go hide go hide out of the public eye out of our public spaces, and she wouldn't understand. The similarities to me that we take that seriously when it comes to the safety and the health. Of people who get around by bike on soil in wheelchairs. We need to take that. Seriously. We need to think about what it means to make our our streets a safe place appreciate this Committee of folks because I know that you keep those values in mind and I ask as many others have asked you today actually hold members of our community in mind as we make decisions about how we use our street space cuz that's what we need. We have the climate crisis. That's what I'm supposed to be up here. What is always it always comes down to personal as well and how we get around and we need to we need to have some Grace and love for one another and understand that all of us here to be safe, and we need to save space is on her streets, and I hope that my neighbors in North Seattle will consider that. Thank you. Cassie and I will give you 2 minutes and then monali will be our last speaker for 1 minute. Mourns the loss of the bicycle master plan Seattle climate action plan And the complete streets ordinance. And we look to your counsel for guidance and Advising the mayor and the mayor's office in s. To bring them back. Hello, I'm gonna lie. I live in South Southeast Seattle by the Association and I'm 80 years old. I I bike everywhere. That's I don't drive the car. I put my bike on the train the Light Rail and on the bus and even on the ferry. I last drove a car in 1999. So you figure out how much a less pollution areas in the air because of the fact that I've gone in my bicycle instead of in the car all these years and a lot of people tell me their maze that I'm bicycling because they think it's so dangerous. Well, if people in Singapore so dangerous just think how much and they were bicycling just like how much less pollution that would be in here and how does he owe to emissions causing climate change would be there would be The only the only bike route through our neighborhood in the Rainier Valley from going from from south to North or North to South is a the bike Greenway going Route over the it goes right over the mountain. Well, I don't understand why the car is good to go on Martin Luther King way and Rainier and they could stay on the flat and so what so what's really needed is a bike lane along Rainier. It's really right wide Street and it doesn't necessarily have to be a One of those fancy ones that like down on 2nd Street would be nice if we had that but if I don't see why it would be so terribly expensive to paint Lane by along Rainier and Othello Springer along Rainier Avenue on either side so that people could bicycle right now. It's creating lots of Hazards and last week. So when was killed there a buy a run driver bicyclist? I want to thank everyone for coming out for public, today again, there's about 10 more folks that signed out that I'm in a pause on so we can get to the presentation. I apologize folks that were the came to get public comment and I'm holding you to the end of the stick around till the end of the committee. I'll I'll stick around to hear from you and I really appreciate we heard a variety of use today, but I appreciate the folks being respectful of each other as we work through these challenging policy decisions. Jasmine would you like to read agenda item number one into the record? This is the information I didn't related to the 2019 bicycle master plan implementation Plan update. When we start with introductions Calvin go first album childhood Council Central staff. The button is up on the stem. Jim Curtin s. Monica Valdez. I don't know that I have much more to say than what you've all heard. So why don't we talk to you this is because right sounds good. I will give a little bit of a intro and then I'll turn it over to Jim and Monica to run through the presentation. So thank you for having this meeting meeting today, and thanks for the opportunity to come here and talk about the 2019 to 2024 proposed bicycle master plan implementation plan a long title. I just know what I know what men who are watching are interested in which is our shared commitment to building a connected bicycle Network in Seattle over the past three years city of Seattle is Bill 27 miles of new bike facilities. We're on track to deliver another nearly eleven miles of project in 2019 last week though as we heard before we announce that we would not be moving forward with installing bike Lanes on 35th Avenue Northeast. Which was a real challenge the paving an asset management work planned on the quarter head giving us the opportunity to redesign the street to better organize the space and address the multi-modal safety issues based on the bike master plan our original plan original design include a protected bike lane. However, because of the 40-foot curb to curb distance in much of the cord are especially between 85th and 65th to fit a protected bike lane on one side of the street with an unprotected 5-foot bike lane on the other. We also needed to accommodate the existing frequent Transit service and maintain some parking for businesses and residents. All this way to squeeze which included Lane Whitsett narrow is 10 ft in places. We move forward with that plan. Throughout product development in NC construction. We continue to hear from the Northeast Seattle Community both for and against the original design choice to change the design throughout the community engagement. There was consensus that make you safer pedestrian Crossings while reducing particular speeds and aggressive driving were important shared goals compared to the street today the new design for 35th will help us address. Those issues will not precluding future by connections 35th Avenue remains in the bicycle master plan. We're also committed to making enhancements into the 39th Avenue Greenway and continuing our work to improve Connections in the area with a future 68th Street Greenway. This brings me to the 2019 to 2024 bicycle master plan proposed implementation plan. They were here to discuss we changed a few things from previous years. We're seeking public input on the Public Funding implementation Plan before we finalize it and second we've gone to Greater lengths to explain our product delivery constraints identify potential risks in the plan that could further affect project delivery. We think both of these things will help us create a stronger understanding of the plan with the public and ate us as we continue project-level Outreach and engagement. The proposed plan reflects the hard work agency is done over the past year to complete a comprehensive assessment of the levy to move Seattle under the leadership of Mayor durkan and based on real more realistic assumptions in the city used in 2015 because the bike master plan is funded in large part by the levy we've been working with the Seattle bicycle Advisory Board to prioritize projects to make the best investments and maximize safety conductivity Equity ridership eligibility as a result. This is a realistic plan that reflects nearly 77 million dollars in funding we expect to be available over the next 6 years for bike Investments as a proposed implementation plan demonstrates Mallorca, and I remain committed to building out of connected and save bicycle Network throughout the city and we can be discussing the plan with the Levee oversight committee tonight and a bicycle Advisory Board tomorrow evening events over the next month to hear from people directly about their priorities for the implementation plan. What time does reflect some difficult choices related to the cost of projects are also highlight the important connections were making to existing future Transit schools and other communities destinations. I'll be working throughout the agency to see how we can deliver our projects more effectively and more efficiently and stretch our funding as far as I can go. But we have remove some projects from the proposed implementation plan their main part of the long-range bicycle master plan and as funding becomes available, and we've progressed projects we can hopefully draw these or other priorities back into the work plan. I hear the folks who gave public, today and I understand their frustration and I'll continue to listen to what they have to say. I also see this plan as an opportunity for safety Advocates are Department in all of our residents to move forward together. The plan includes many of the bike safety projects that you and many in this room have consistently prioritizes important projects to build these combined with the 27 miles of bike is installed over the last three years will continue building our bike Network and make it safer and more enjoyable for Riders biking through a city now and there was that might be drawn in the future with that. I'll turn it over to Jim and Monica to walk through the presentation and I'll stay here to answer any questions you have posi wall for just a second cuz I want to just comment on some of the things you said. They're Sam Chris Paul. Thank you all for being here. But the decision and how we got there and I acknowledge it. It's Challenge and it's been a challenge the dozens of times. We've been out in community doing this there is nothing. Unique that was said in on 35th Avenue Northeast is not come up in multiple other communities. I would say that the length of the process was a lot longer and some of the reactions they were taken or maybe more severe than we've seen another projects, but the general sense of what happens when we go to build a bike lane. We know that play but I don't imagine another city Beaverton Sam. It's the same and the only way you get through these hard decisions is with having these Northstar that's guiding you in a direction and we worked really hard on a vision zero commitments to fight the year 2030 no fatalities and serious injuries. We were really hard on the climate action plan that shows that we're going to have to be carbon neutral by the year 2050 and have triple the bicycle Rider shift from 2007 to 2017. That didn't happen even come close. And so I think you know, I don't believe anything you said is inaccurate. I haven't measured the Wayne with myself and all those things but I trust that those are all accurate things and yet if those are not if we're not being Guided by meeting our climate objectives meeting her safety objectives, it feels like then we will always say well this one's just too hard and that's what feels like a mess and I fear what happens everywhere else what happens going forward because you look back and time after time is amazing people at us. That are really smart and very clear they come to me and tell me things that I would like to see if that's not going to work in this place or not going to be able to do this. Here's what we recommend and I will defer to those experts because I know that they are focused on that same guiding Guiding Light of where they're going. What did we have a shared Vision about what needs to happen and what happens if those projects is a year later we go back we studying we talked to neighbors. Those are show up usually most don't show up because at that point they're fine with it. We show that the traffic movement is still the same speed. Usually lower because we wanted them to be lower because that's safer. But the same number of people and vehicles are getting through we show that there fewer collisions that are happening because we have really smart people that are guided not by just folks fear of what happened. I'm an early so that businesses are doing fine. I mean, there's plenty of studies in Seattle around the country around the world to do that. And so I'm struggling with with what is is guiding the department in the mayor's office on this right now and I don't expect you to answer that at this moment, but it's something that I think we really need to get clarity because I'm a little shaken right now. Is there a lot of people in the community? I don't want to get the presenters tied up in too much of this but I want to give a space for her colleagues to make hummus to go with everything that you said councilman election poll in the city's history where and we're trying to manage a lot of growth in the city and we're also trying to be consistent with those visions and values that you've talked about, you know, in addition in this neck of the woods, which I'm fortunate to represent for another 72 hours of so, we also have a couple of major institutions the folks at childrens in the books at the University of Washington. Could we have banded together and said we want you to be good neighbors and one of the ways that you can be good neighbors is by making sure that you have fewer folks that are driving to and from your institutions on a regular basis. We sat goals and objectives for those institutions to really reduce the amount of driving that they have going to their neighborhoods in the University of Washington. We set an aggressive gold on to 12% from the 17% at Children's we are trying to go from 37% to 32% And so those Folks at those institutions that make stuff up to those challenges and they want to be good neighbors. And so they do Innovative things like offering free bikes to folks who choose to bike to commute to work or working really hard to build more infrastructure on the u-dub campus to be able to host folks who are making that choice to bike to work and I struggle little bit without disconnect to because it feels to me like we have a set of policies while we're asking is Major institutions to join with us. And when I talked to the leadership within those institutions, they expressed concern about having the next brilliant researcher or the next credible lecturer be struck and killed on their way to work one day and so we've seen that happen. Come again. We've seen folks that have been unfortunately struck and killed in this neighborhood. I walked past a ghost bike everyday and I think a lot about slander and his untimely death at 46 and how I'm rapidly approaching that number and how he had two little girls and how I have three little girls and how hard it would be for my little kids to grow up without a dad. And so I really I believe in this city and our ability to come together to try to make our decisions and time. And again, we have struggled with the construction of protected bike lanes and we've convene processes that have done a good job of helping to find a way to get to a consensus. That's one of the reasons why I personally Rob Johnson advocated for the hiring of John Howell as a mediator in this process because I thought that we have had a good mediation process has in the past with that was the Westlake cycle track, but I was the SEC. Avenue bike lane whether or not it was several other examples on Stone way or we have had facilitated conversations The Missing Link in Ballard. I mean in each of these instances where people on both sides of a topic we've brought people together and facilitated conversation with come with an outcome that maybe wasn't perfect for everybody but did end up building those facilities in most every instant. I would really love to see that kind of opportunity for us to continue to have that dialogue Salem hardened by the fact that in your opening remarks. She said that 35th is still on the list for the bicycle master plan. I'm hopeful that doesn't opportunity for us to continue this dialogue from my perspective. I think it's a really valuable Corridor and we are building a network of connected bicycle facilities in District 4, and I'm really proud of that fact the one that is just about to open we're going to cut the ribbon on this coming weekend, but it's actually really been open for a couple weeks. The tremendous amount of use just in the last couple weeks and that's going to get people to the Light Rail station. So we know I'm hopeful that you have experience working environments where there's different political opinions, and I just really hope that there's an opportunity for us to be mindful of those folks who said today that they are concerned about their safety. Concerned about the bullying Behavior that's happening when they choose to get on a bike. They're concerned about the impacts of those folks to make that decision to drive at 3000 pound vehicle on how one small decision could change their life forever in the life of their friends and their family. So I asked you to keep that top of mind and and counter Brands turn back that's true north for us and I look forward to seeing how the next couple years. We might be able to continue see those values play out in real infrastructure on the ground. Pepper Johnson I know Jeri Ryan, you said that we should let the presentation go on and of course generally agree. But I also there's a part of me that doesn't entirely agree because it seems meaningless to me to go through a presentation that has slides like that are titled Seattle is an award-winning bike city data shows more people. Are we riding bikes progress and building a completed bike Network? It seems meaningless to me instead of tone deaf and out of touch to go to a presentation. I mean, obviously you will go to the presentation. I won't stop you. But my point is that it's it's strange for the mayor to send you all for this kind of presentation at the same time that the mayor's office and installed leadership has dealt a blow a significant blow to the whole plan of addressing climate change and also as the speaker who made a very poignant remark about how her identification was not accepted because she didn't have a driver's license and she pointed this is actually it is about the question of carbon emissions in this region, but also about the rights of people who walk people who bike people who need to use Wheelchairs and people who use or need to use public transit and I think the mayor's office is being tone-deaf also the the whole spectrum of community members who are fighting for our author Seattle to be a bicyclist safe and pedestrian save City It's Working Class People even just two days a public testimony shows that working-class people middle-class people families with little children or elderly individuals community members all of them have spoken and so I don't really understand when the mayor of Presley says about community and gay Jim and it's about public feedback who's feedback. Are you actually listening to is the question? And I and I and I will say this to in in support of those because you said said this already is that the most Seattle Levy is one of the many many examples of we're working and middle-class people have shown their willingness again, and again to tax themselves in a city with the most regressive tax system in the entire nation in order to do the right thing. And so after having repeal the Amazon Dash the least the mayor's office could do is not deal a blow to you know, the tax of money being used for doing the right thing and azzara tax revenues that are being generated from working people's limited incomes and the mayor's press release or whatever the email that was sent out. I think this is the actual person leaves of a long press release and it has lots of nice word that says we have heard consistently that safety along this Corridor is the neighborhood's number one priority, but clearly you're not this this move is not an example of prior. Reading safety of pedestrians and bicyclists. And so I mean as you go to the presentation today, that's fine. But honestly, my question is much more fundamental is what are you actually going to do to reinstate this work and stop being anachronistic and behind the times and listening to when you say community feedback really what the marriage listening to his business owners and not ordinary people and invite some of them are business owners themselves who support the bike master plan. And the last thing I would say is that for those of you all were fighting for the city to be a pedestrian bike bicyclist friendly City and for vision zero and for the bicycle master plan fees always know that my office is strongly on your side and in solidarity with you and please let us know what we can do to help build the fight back because honestly, this will have to be a fight back of the mayor has chosen to ignore us all and do what she has done and we we we need to fight back and I also wanted to apologize in advance. I have to deal with another emergency personal friend, so I will have to leave at 3:30. fidget spinner I am actually interested in hearing your presentation and having some discussion about the elimination plan. So let's jump in and get through this and Scott's number O'Brien. So today I will be going over we will be going over to the recent progress that we've made on the BMP talk about our priority ization process talk about how we look at Equity when we're coming up with the implementation plan also mentioned that new this year. We've done a risk assessments and also knew this year will be doing Outreach around this plan, which is something that we have not done before and then we'll go into a little bit of the nuts and bolts of the plan. So Seattle that has made progress over the last few years. In fact, we have the number one new bike weigh in 2018 on 2nd Avenue the PPL out there. We were named the number one bike city in the United States by bicycling magazine as well. And that's all down the Footsteps in 2016 of the best new facility that year which was the Westlake protected bike lane. In addition. People are riding more with this is a great Trend here in 2018 bike ridership was up by 12% at our for permanent counters at Spokane Street the Fremont bridge Elliott Bay and 2nd Avenue. I would encourage anyone to go out to the Fremont bridge in the morning or in the afternoon and see the Swarms of a bicyclist who are using that area. It really is that and I think the the Spokane Street Bridge the Westy. I was really one of the epicenter of cycling it in Seattle and it's it's very encouraging to see that when we In the Second Avenue Extension, we had a 32% increase in ridership showing that you guys when we build things people do come and bikes were definitely a great travel option during the Seattle squeeze and we had a massive increase in the number of people biking at that time and there's no doubt that those folks were partially responsible for the success of the Seattle squeeze. Basically, we had about 30 to 40 volt buses worth of people who decided to take their bicycle. And of course, we didn't have capacity on our streets for those buses at all during the squeeze and I'd like to point out that these are just for counters and that there are literally thousands of other trips that occur in our neighborhoods that don't get counted here, but nevertheless this is really encouraging and something that we want to monitor as we head into the future. We are making progress in completing the the bike Network. We recently completed the phase one of the West Seattle neighborhood Greenway, which starts south of Roxbury Street in West Seattle and meanders along a topographic Lee enhance route to deal with some of the big Hills to connect up to some of the schools and parks that we have in the neighborhood. The Rainier north south Greenway was recently completed as well. This isn't nearly six mile facility in southeast Seattle. We have a number of projects that are under construction including Northeast 65th Street Colombian Wilson Avenue pbl's as well. And of course we have many projects that are in design and of course the center city bike Network. We are charging forward on on those projects. But again, we also have projects in other parts of the city as well as Stone Way in Green Lake we have protected bike Lanes as well as Delridge as as well. Citi Bike for a couple weeks ago and this is showing up as in design as opposed to construction for completion. I know there was some little pieces a couple weeks ago that there's some challenges that the majority of that is going to get built this year. I just want to make sure that I shouldn't read this as a shift in the last 2 weeks. No, not at all. So we prioritize the projects in the 2014 bicycle master plan every year and we report to you as required by ordinant. There's a quantitative analysis that takes into account safety connectivity equity ridership and livability and then along with the Seattle bicycle Advisory Board. We work through some of the more qualitative measures as well we go over some of the leveraging opportunities that we may have for example, if there is a baby in Project we often like to partner with that project to do our best to save some some funding there. We coordinate with many different partners. We look at the geographic Equity to try our best to invest in each neighborhood or each sector of the city as equities Equitable bully as possible. We're making conscious efforts to connect to light rail Transit and urban Villages. And of course we're building to our budget. We are looking at the funding availability per our Levy to move Seattle reassessment which we of course completed last one of the things that was different this year from previous years as we've put together the list based off of mileage that we're this year. We base it off of a we tried to apply it towards the amount of funding that we had and select projects within those parameters. We work with the Seattle bicycle Advisory Board to select their top priority projects and I want to I want to clarify something that we should have clarified when we said when we submitted the plan they had a large list of prioritize projects at that were their priority, but we didn't have enough funding for all those prioritize projects to make this list and so we selected projects from that night. All of their prioritize projects made the list and I apologize. We should have shown that reflected it differently in the project list. We should have shown it as bad prioritize, but funding constraint. Thank you. As previously mentioned we are committed to creating not just a bicycle Network that is connected to people places and goods but also balance geographically across the city we can look at each of our projects from a geographic perspective. We look at socioeconomic factors health and accessibility issues as well. We also Incorporated a quantitative analysis as well to help kind of confirm the things that we saw in our quantitative analysis furthermore. We we understand that there's a lot more that we could do. We have recently partnered with the University of Washington in the oven school there to the to do a review of effective Outreach strategies and actually kind of look in the mirror as well. So they're going to do a review of of what we do and what we've done in the past 2 and and look at different ways that we can ensure that the verse verse voices are heard and that we are well aware of the many is That may determine whether someone decides to ride a bike take the bus or ride drive a vehicle. Community engagement of courses welcome and this year as mentioned previously. We are going to take a different tax with this this plan by having a more open conversation earlier in the project design process. So here we are at level 1 on our graphic here in the prioritization process in the pre-planning face at this point. We want to go out and talk to the community and end this year as well. We really looked at the rest. This was a an effort to increase transparency. I with all the stakeholders on the on the plan and we also looked at two different considerations as well as including where we are in the design phase clearly. We are much more aware of some of the risks when we are further along and design then when we are in the pre-planning face, which is one of the reasons why we want to talk to people more frequently about these projects, of course looked at our funding levels. As we assess the Levee and sell but we had to actually go to construction. We're looking at our potential Partnerships and what that means for some of our projects and right-of-way requirements as well. Our next step is to start getting input on these projects projects that are in the planning phase. We are very interested to hear what folks who live where work out in these neighborhoods have to say about these. What we really want to do is go out there and help people understand the value of a connected bike Network and what that means for livability and what that means for safety. We also want to help people understand how we got to these projects how we selected these projects as well. So tonight will be at the Levi oversight committee tomorrow night will be at the bicycle Advisory Board and then throughout the month of April will be conducting Outreach events to hear from folks out in these communities will report back to U console and the bike Advisory Board in May. Quick question personal gym card picture of a small protected bike lane in my neck of the woods which came about because it's citizen one of our city-sponsored parking days took over a section of the right-of-way and show that had this sexually will work just fine right traffic still made it through and introduced us. For taking that citizen generated idea from parking day and turning it into something that really works. Well for bicyclists to the neighborhood, you mentioned no funding priorities, one of the guiding Lights of the Investments that we've been tended to make and protected bike Lanes is driven by other projects that are happening with NS. Portfolio. It's a way for us to demonstrate that we have efficiencies of scale and rather than coming back several years later and re-implemented. Something is a hell of a lot cheaper for us to do something concur. With other Paving projects are other issues that s. Is looking at based on the project list over the next couple of years. Do you anticipate anything coming up all the priority list or coming down off the priority list because of that synergistic opportunity where we might be able to leverage other projects that are moving forward to ADD protected facility that don't exist today. Yeah. I think you'd there's definitely opportunities for projects to move up from the InDesign list to the funded through construction listed. I think this is especially true on project for we have cost savings whether that be at the overall product project level or even down in the weeds a little bit more on the individual components of the bicycle facility that's being designed there. So I do believe that there are opportunities as we move forward and again like what this with this proposed implementation plan as well we Made a conscious effort to not include any of our grant funding in this so that we could be true to the levy to move Seattle. So I think there is a lot more opportunities for things to move up on the left future grant funding and med-pass plans. We have had a line item for you. No future grant funding and we didn't we didn't put that in this time, but we still plan on actively pursuing grants appreciate that. I mean, I think part of my frustration and this is not just the frustration around bicycling but also as cancel a rhinoceros a bunch of times downtown as well. You know, we got about 30% of the city's landmass that's paved over for roads and right away and if we've got 5% of the folks who are making the choice to ride a bike to and from work or to shopping or to other destinations in the city. We are nowhere near even 5% of 30% being safe and protected bike Lanes the same the same could be said for the be no more than 50% of people who are making the choice to ride Transit into downtown everyday. We don't dedicate 50% We have 50% of people that are taking the bus. And so I think you got the frustration that you're hearing from Folks up here. And I think I'm out in the community is that these are hard choices but their political choices fundamentally because when we get together and make a decision, we can paint something pretty quickly and we can put up post pretty quickly and we can make it a safe place for people pretty quickly. And what I'm hopeful for is that you're sharing a real interest from the community to see what are those projects that might be rising in the priority list and find Opportunities to leverage new ideas. That will make it safer. So the 2019 to 2020 2024 proposed implementation plan is a 6 year plan. This aligns with the next six years the last six years of Levy to move Seattle. And of course, we have reassessed that and this plan reflects the spending moving forward. We have 62 miles of new facilities that will be constructed or designed in this current plan that represent about 76 million dollar investment almost $77 in Investments, and I think it reflect the city's commitment to build that connected and safe bike Network as the city continues to grow. So here's how we're doing it. It's a mix of protected bike Lanes bike lanes and trails as you can see in this picture here. This is Northeast 65th Street, which as you know is currently in the process of being transformed into a much more friendly Street for people who want to ride their bicycle people who want to walk and still for people who want to to drive as well. So I think what you'll see out here is a street that works well for everyone and provides people with connections to their Light Rail station as well and we are connecting to propose frequent Transit Network routes were connecting to Link light Rail stations, and we're connecting to schools as well to those destinations that people do want to get to We're also building a network of neighborhood Greenways as you know, which are typically installed on lower volume. On arterial streets and have some fantastic arterial Crossings as well on our neighborhood Greenways. We are connecting to schools. We are connecting to Transit as well and soon to be open Link light Rail stations. As we head into the project, you can see that we're investing throughout the city like to highlight a few projects. So we have in southeast Seattle on Swift Myrtle and Othello. We have bike facilities that are currently under construction as well as on Columbian way and Wilson Avenue South in West Seattle the red line you see there is the recently-completed West Seattle neighborhood Greenway. We're about to go to construction on the Avalon Way project as well, which is a project that does reconfigure parking and make for an excellent Street for people who are taking the bus or taking the bike or taking their bike or or just walking around the neighborhood. In central Seattle our Focus has definitely remains on the center citibike network, but you'll see that we have project proposed throughout the central part of the city code in Eastlake and Union Street as well. And it North Seattle a slew of projects are currently in the works are under way. You can see 65th and 68th Street neighborhood Greenway with Sam referenced earlier as well as projects pre-planning that will connect neighborhoods. Like Little Brook and Cedar Park that are close together, but are currently challenging to get to because of major barriers like State routes in the neighborhood as well jump on the previous lighter the previous three just as an example of the the The Legend with the different colors of somewhat confusing to me I get what you're trying to say, but when I look at this map, but I want to see his like when is the thing near me getting built and I'd love to see maybe suggestion would be to color coded by completion year. So folks can say I miss you. I'm 3 years out and I can imagine you might be able to say what I know. It's been pretty planning, but I don't actually know what I need a belt but I guess maybe there's a masters or something, but it would be much more helpful. I think than to just know that stuff. Yeah, that's great feedback. I think that's something we can definitely do for you. So as we move forward, I think I previously mentioned that will be at the oversight committee tonight will be at the bicycle Advisory Board tomorrow night will be doing some Outreach events throughout April and in may we will transmit an updated and hopefully final plan to you all for approval. And of course, I'm going to be want to talk with with folks more frequently about these so that if there is an issue to mitigate we can start working on those Solutions sooner than we have in the past. I took a poll of their kind of questions on this and then I have some more broad comments. I want to just make you talk to in the presentation about a new category of risk, and I see that in the draft plan that it shows up. When I see the word risk, the first thing is awesome eyes, like risk that someone might die. And so that would be a top priority. I don't think that's what this risk is. Can you use this political risk of this third-party funding risk is this So I think this is this was a new attempt by us. As the first time that we we presented the list like this and I think that in the past if something changed from what the list that was delivered it was seen as as a failure to meet a commitment and there's a lot of things that are moving on a lot of a lot of these projects where we wanted to make sure we were clear and where there are challenges that are out there. So some of them and some of them are third-party coordination. Some of them are other projects related items. Some of them are funding available for for all like the You to move things into construction site. I just wanted to highlight what those things are that we are still working on to not make it seem like we figured out everything about every project that is still three or four years away from delivery. So I didn't hear and they're like political risk or controversial but is that a component of or not? There for all of these that are still in the planning or design stages there. There is still Community engagement left to happen and there are still concerns that that need to be addressed my perspective as you tell me you're going to go somewhere in the city. You don't have to tell me where on the map is it'll be controversial at some level for somebody. I guess I'm curious is all the things that are flagged as rest are some of those we think this is going to be more controversial than others and we want to brace ourselves for that vs. This is only going to get done if psrc approves our whatever tip funding or something and so how how how to read this and understand you tried to highlight what the top issues that we see out there are the ones that are funded through construction with low-risk. We don't anticipate anything. Affecting those going forward. So we we've tried to be clear and transparent. I agree every bike lane that I've ever been a part of installing has somebody who didn't know about it until it was being installed or had some concerns about it. I've worked through 90% of those problems in my career. So I think we're trying we're open to the feedback Romans you back from from you and I heard some concerns in public about how this is being received the idea behind this and behind all of the Levee reset activities was to be clear with everybody about where we stand with projects so that our delivery is also understandable and serve a bit more predictable and kind of transparent in August in and that's great because there is uncertainty in all this stuff and we know that I guess let's continue to work together and work with community members on how we characterize out of me. I can imagine that you know, like you said the ones that were about to break ground on tomorrow. We're feeling really good about in the ones five years from now. There's just more uncertainty. It'd be great to know if if from the Department the mayor's office if there's a particular one that's come in the future. Will we know that's going to be real challenging because we've already heard from whatever the business is on that street and to just like that so folks know and if folks want to start doing organizing now to talk to people that can be great and if it's just a funding risk for something that that's different just so we can understand the different criteria. And so I think it's great to not just say everything the plan we know exact timing. I think the communities is aware that that's probably not true based on past performance. But but but understanding what those things are that we're already worried about and how we can mitigate those who like this was going to lie in state funding we will do that. So I'm going to ask you some questions that I think are going to sound ridiculous, but I feel compelled to do so because this is some of the Mission that is out there s. Employee who works in the bike program get extra Kickbacks about the construction of protected bike Lanes. Do they personally profit or benefit from the construction of protected bike Lanes? I don't use it for your the defendant said no there there has been rumors and allegations that either individuals who are employed by the City Department of Transportation or I myself have Santa personally financially benefit from the construction of protected bike Lanes throughout the city. So it's wonderful to hear you say, no they do not and I want to reaffirm that I do not as well. Also, I love to ask you another somewhat ridiculous question, but can you talk a little bit about the goals of protection and safety of the department because I do I think people want to hear a little more about your vision for protecting people in the city who make the choice to walk bike or take transit and you talked about this a lot in your confirmation process, but there's a lot of people who are here today that weren't tracking that I love for you to have the chance to talk a little bit about your commitment to Vision zero and two safety in this sure so Yeah, I mean I I have a deep-seated commitment to protecting everybody that that travels around the city. I think that comes from building out a connected network of all ages and abilities facilities and that includes bicycle pedestrian and Transit facilities that starts from understanding where our safety challenges are and prioritizing our investments in those locations to address the issues that we are currently seeing in in the community and At working to overcome the actual crash patterns that that we see and I'm working to overcome those. I do think that building out connected networks is critical and and to me that means connecting people to transit to schools to other destinations that they are trying to get to you and make end in getting people to and from those locations. This isn't there isn't there is a long process in and doing that in some cases and incremental Investments that we make should build on one another and and contain a build-out. I connect Network. I'm grateful to say it's a man. You know, I feel obviously a sense of personal responsibility associated with not only the project that a lot of people talk about in public testimony, but other projects and in my neighborhood part of the reason why I'm so proud of the opening of the new protected bike lane on 65th is because of the series of deaths that we've had in the neighborhood on that street. I myself I was accused of personally again benefiting by my relationship to the city and getting a crosswalk painted nearby my house and somebody submitted an Ethics complaint. I'm saying that I had exerted undue influence by asking the crosswalk. Well, the reason why I asked is because two weeks earlier an 80 year old woman was struck and killed by a card making a left hand turn to while she was trying to get to the coffee shop and one of the things that we do A death like that occurs as we go out and refresh the crosswalk paint, which is a simple thing to do, but it's an important visual thing to do. So I feel a real responsibility and I know from our conversations that you feel that real responsibility to and I think I'm very excited to see how we might translate those Visions into real action soon. I have two more kind of overarching comments on the plan. The first is about the timing and I just want to say I'm a little disappointed and frustrated on the timing on this the last if we know that the goal of the city is to do any updates last fall. There was a lot of move Seattle reset going on and so there was requested. Hey, we want to take some more time to get the bike thing right inside appreciated that the expectation was my expectation was clear, but by the end of March the final plan that have gone through months of feedback with community members and to get a 5:05 p.m. On Friday the last day of March with draft written all over it and hearing from a lot of folks that we haven't had time to review this didn't comment on it. I appreciate that in the coming month. There's going to be a lot of options for feedback cuz I do think there's some work to be done there. I just Sense of urgency that I feel is missing, you know, every these these projects they save lives and so every month or two late is the risk the real risk that someone's going to get injured or killed these projects save carbon emissions and we're and we should be at least in a speedy race to prevent more than 1.5 degrees of warming by the end of the next decade or we're going to be in real trouble and these projects make a huge difference on that. And so there is a I just really want to urged us to figure out how we put some urgency behind this work at both the planning work the feedback work and then the delivery work at you know, we we need to be doing community outreach when I go out to communities. We learn a lot to learn a lot of people know in the community people have different opinions and different sets of values of what they want to prioritize but it's critically important that we learn what's going on there, but it shouldn't take a year, you know, let's hear with a business owner. Let's go with the neighbors need let's hear that and then bring her expertise expertise. We've learned from doing this in dozens of other neighborhoods and move on things relatively quickly and come back report on it measure it, you know, it may be that occasionally we do something with the hate. I didn't quite work out but I can tell you is the vast majority of things come back and it's like yeah, it worked out just like we thought it's great. So unconcerned. The second concern is even higher arching in this is really directed at the mayor and her teams and soon. She'll get that from listening to this. There is some real challenges facing, you know, if climate change really to fix a safety razor to fix cities around the world would have done it a long time ago and the mayor for sure inherited Olevia that had some challenges probably both in design by previous administration some challenges because of construction environment were operating in that didn't exist. When is Levi went out and some challenges from a federal Administration that maybe Isn't his generous with matching grants that at the time this went out to those are all legitimate changes. And you know, I think the mayor has done a decent job through this reset in her whole team in the committee members on recognizing what's things are going to have to change a ranch me so much flexible. The thing that's hard and maybe it just hasn't come yet because this was just released late Friday is someone saying like look the same products that we're not going to be able to do in this plan with this pool of money, but we have these other things. We absolutely have to do them and I'm committed to Vision zero. I'm committed to our climate action plan. I'm committed to buy 20/20. This is give me the modes put on bikes. And so we're going to find new ways to do this. We're not to get more creative whether it's lower-cost things or New Pools of money or look at rebalancing or whatever that is, but some commitment that did well this plan shows some things that are disappointing we want to tell the people that we're not going to we're not happy with this. This is not an excuse to not do let to do less but it is actually motivating us to do a lot more and we want to come back and tell you what what and how we're going to do that and it's it's going to be even harder but I want to be able to hear what that vision is. I want to be convinced that that's a vision that I can buy into that the folks in the audience can buy into and how we come together. And then the last thing I'll just mentioned it about the rebalancing which I talked about. You know, we looked at the Levi reset in the fall without these pieces of information the the spending on bike facilities drops a couple million dollars a year previously was about 14 and 1/2 million a year on of the five year plan. Now, we're at about 12 and a half million a year for the six year plan and so important that we look at that in the context of the overall package and I don't know the exact timing to do that. But you know, we're building a new some projects are a couple hundred million dollars for a few blocks of an overpass. It's really expensive I get it, but I want to look at this in the context of all the things were doing and make sure that when we send our client we sent her I'm safety there. We have the right balance. Now that we have more of the pieces of the puzzle kind of deceived sandwiches together. How about my soapbox? Thank you all for being here a lot of work to do but I appreciate you all showing up today and having the conversation he did. I thought we wanted another number two. Agenda item number to cancel Bill 11947 to an ordinance relating to land Easton zoning and planning section 23 2206 223 2404 520-349-1920 54030 + 2380 for a 100 of the Seattle municipal code for this is also a pretty exciting but much less controversial about how we're going to make all the buildings in our city ready to accommodate what we expect to be a rapid transformation two more electric vehicle. Use those who don't want to stay just ask you to keep your volume down as you exit the chambers and you can have your conversations outside the wall. Thank you again for being here. So why don't we start with introductions Yolanda. Would you like to go first at Yolanda how to cancel Central staff? What's the office of sustainability in environment Aundrea Pratt with the office of State sustainability environment brief opening to this and why don't you jump into the presentation electric vehicle Readiness ordinance. I'm going to quickly pass it along to my colleagues who work so hard to develop this ordinance. I will stay just briefly that we recognize that electric vehicles are not the end-all be-all. They are not our only solution to reduce global warming pollution, but they are nevertheless a critical part of a piece of the puzzle. So really excited to be here to talk with you a bit about why we think this ordinance is so important the work that went into developing it and incense more detail about what it does. And with that I will I will pass it along to Andrea. Great, thank you. So today we're just going to give you a beef brief background and kind of go over to how we develop the proposal and give you an overview. And without further Ado the Eevee Readiness ordinance was a joint effort between OS C&S DCI and support several City policy goals first and foremost electrifying transportation is critical to reach our Net Zero greenhouse gas emissions by 2050 Council resolution 31696 ask the city to transition or transportation system from oil to electricity using half the oil by 2035 and having 30% of all vehicles in the city of Seattle be electric by 2030 this organ sits. Also one of 12 climate action priorities Outline by marriage working in 2018. And is the key implementation action of dry clean Seattle and I do we just want to take a moment to acknowledge that this this ordinance supports a broader climate framework that promotes walking biking Transit and reducing our dependence on single occupancy Vehicles just to be clear. This organs does not require or incentivize additional parking but it just ensures where developers are choosing to parking spaces are electrified. Thank you for for making those points. I really appreciate reiterating that and we're electric vehicles fit in the overall framework in occasionally hear from say like we don't need to worry about it because I want to be driving electric vehicles in the kids are free for one am not sure the path to get there makes sense into is also a lot of other impacts when you have a ton of vehicles going around like we talked about a question on the gold at 30% by 2030 see a lot more electric vehicles out there today, but where where are we? What's our latest number? Without further Ado see the top us markets for TV sales in the nation and adoption rates are climbing at the end of last year. We had 6700 V's in the city and today 10% So 1 out of 10 of all new registered vehicles in the city as electric total we have roughly I believe around 600,000 1% total, but what we do know by that statistic is when people are choosing to buy a new vehicle when out of 10 of those it's electric and the growth curve is exponential. So we continue that or we expect that to continue. I'm going forward. I don't like hers are all in on electrification and they're ramping up production with dozens of new models coming out over the next few years. One of the biggest barriers to EV adoption is lack of access to charging do the convenience and cost most charging happens at home. Which also happens to be the best time for the utility grid. So we prioritise residential development in this ordinance. You know, when you think about parking in the parking that were building today is going to last 50 years or more and this ordinance ensures that all new parking facility is is facilitating the transition from Dirty fossil fuel vehicles to clean your emission vehicles. So when we talk about Evie Readiness what we mean is that all of the infrastructure is in place at the time of construction to support charging. So this includes everything from the electrical service the Transformers the panel's the conduit in the circuits. They're all going to be big enough to support 40 amp or level 2 Charging which is similar to a dryer plug another term for this is called fully wired circuits. We know installing this infrastructure at the time of construction is by far the cheapest and retrofitting later is cost-prohibitive particularly for apartments in multi-family right now you be infrastructure is being installed as kind of a higher-end amenity marketed to higher-income environmentally conscious fires and all newly constructed parking will increase TV access across the development types, including multi-family and traditionally underserved communities. That's great. So what we're seeing if I hear you correctly is that that the market is delivering some Eevee but it's a premium product as opposed to a baseline. That's great that we have a solution to fix it. So other leading cities with Progressive ID codes include San Francisco, Vancouver BC and Atlanta and we worked with all three of these cities to understand the nuances of their policy Lessons Learned and we really wanted to take what other people had already done and kind of use that to inform our process and Achieve. Our desired outcomes are ordinances similar in the fact that it focuses on residential including single-family and multi-family, but our policy requires fully wired circuits instead of just conduit and that will avoid those costly retrofit Slater. I just want to point out that osc and STC. I did significant research Outreach. And engagements, we really wanted the goal to have all new parking b e be ready in the city, but we didn't want the requirements to overbuild or exacerbate the cost of development and I think we were successful on both of those accounts with this point. I'll pass it over to you and have some requirements for us in the electrical code. There is a as hungry as graphic show to connect a Continuum of Readiness. And and right now we have some really helpful but basic stuff in there about sizing your mechanical room so that you can have space for charging infrastructure there in the future or reserving the basement panels. Is there certainly great steps but we are proposing today is much more significant than that and we'll really have those. I'm parking facilities be fully you be ready so excited about that. So in developing this legislation, we had a couple kind of high-level goals to keep in mind. We really wanted to maximize Readiness as Aundrea mention for very clear good reason and also balance that constant issue with minimizing costs in the city were also struggling with housing portability of shoes and and rising cost of construction and as she also mentioned we want this these rules to apply to all parking whether it's required by cities rules or whether it is built by the developer or the property owner for their own reasons. And again, as we mentioned before on this isn't changing any of the parking requirements that are in the land use code or in the zoning code is is just applying kind of design criteria to those as well. So we looked we thought about questions of what types of development are appropriate to have this EV infrastructure. What portion of parking spaces are appropriate to be served. What type of charging the structure of the level of charging and then as part of all of our conversations and thoughts just what are the potential existing racial Equity implications and how would those be impacted or dress by this bill? Let me talk to a lot of people and mainly last spring and summer talk to various people in the Eevee communities charging providers organizations that do retrofitz all kinds of different organizations environmental organizations that are focused on TV work and climate work. We had also a lot of conversations with a development Community. The master builder is really helpful. I'm sitting down and and working through some of the technical issues related to what kind of smaller scale development and just in general. I really tried to understand all the different applications that may come out of this not wanting to accidentally create got issues for construction. We also received a great job facilitating conversations with environmental justice Community as well and let me talk to you infernal City departments and about potential to be like, obviously it's a huge player in this and then the office of Housing and since they're the ones that So a lot of talking and we heard first was a ramp assist to focus on residential development again, because of the opportunity for. To reduce barriers for people to buy an Eevee. We also heard that level two kind of the 40 amp outlet store the most appropriate you can sort of charger car with the standard 110 household outlet but it's really long time and batteries are getting bigger as what we heard. And so that's a good Baseline and we also heard that there are opportunities in larger scale development for load management technology. Luqman is my management systems to help stretch the power from one Outlet to serve multiple parking spaces in so you don't actually need a plug for every single parking space because there are all kinds of software developers in technology and easiest out there who are happy. Bannon. Alternatives for that as well and along the lines of what Andre mentioned renters and people who multi-family housing face much bigger barriers to the adoption in part because of issues of retrofitting this facilities with you. If you don't owe on your property, it's hard to put it in wiring for your EV charger or if you do on your property, but it's a condo or townhouse the movie the legal barriers that get in the way there and so are those are important things. We also heard that for right hell drivers that may be interested in adopting V's that access to home charging would be critical for them as well among many other things. And so we had all of these conversations and they really helped and drive and shape the proposal and so we're pretty proud of what we came up with. No regard. So in terms of what the ordinance requires it's a pretty short little bill from the perspective of phalanges bills. It adds new language to the land use cover pages shorter. It defines a TV ready parking is parking that includes a fully wired circuit again with a 208 240 volt 40 amp outlet or termination point is the illustration on the right of what we mean by that and someone could choose to put in the actual little receptacle if they wanted people be able to plug in right away or they could cover it with a kind of a blank faceplate that made more sense for their for their development and it would require eating Readiness for a certain portion of parking spaces at 4 better associate with new development that provide off-street parking for it with new buildings. And so that is kind of depending on the type of land use type of development as well as the size and design of the parking facilities as well. And then again because of the variety of different types of development that as CCI through permits every year. We wanted to make sure that we had a pathway for flexibility for residential development. We're just adding e d plugs to their project would be the thing that would kind of tip them over into providing much more expensive infrastructure. And so wanting to be a conscious about as well. So there's a table with the basic requirements and I'll talk to you a couple examples scenarios that I think help illustrate this but at the most fundamental level if you're building a single-family house or townhouse that has a garage in it. You just need to put a 40 amp power outlet in that garage with her at the one-car garage door a four-car garage and making sure that every new residence of a private parking facility has that and for multifamily development has shared parking in a parking garage at wish I could be most commonly apartment buildings and then you need to have one outlet for every five spaces to 20% of spaces. We need to be ready and again that reflects opportunity for technology to stretched out those Outlets to serve the full garage if you have their shared surface parking lot in multifamily it sort of scales up from one outlet for space. Smaller projects like like townhouse or house projects and then as if you were to do a very large Hamilton on your project lasheriffparking then surface parking, then you could get two at 20% So I'm trying to be mindful of development types and what makes no sense for this uses for non-residential development, but it seemed like a missed opportunity to hang in there for non-residential at all. And so which is pretty consistent with what other cities have done what we put in a 20 or sorry. I'd rather at 10% requirement for non-residential. So essentially with the load management opportunities, you could get by about half of the spaces in that garage door for sale. I'll walk through a couple couple examples here. Again. This is just a house with a private garage. It appears to have about two parking spaces in the garage maybe and so there's one blood required that would be just wired into the house has electrical panel and and part of their monthly power bill at a couple examples one where it's wired and there's an outlet and if you can plug into and another option was just the wires at the panel there but not hooked up to an actual receptacle. So if that is it required that at the other end at the wires actually hooked into the panel or at least is it just there and ready to be hooked into a new circuit breaker and there's room in the panel for it would have to be built out as if the receptacle was there for the wires have all the juice. From the Eevee Community was one of the most expensive things went on the most variable cost is sizing the Transformers from the kind of conversation to citylight. You can't do that appropriately really unless you actually wire everything all the way to the very end point for every stall and it's ready to go on the other end whether you see the receptacle or not that that's a ten minute change to do that. And it's for a house like this. The cost of the infrastructure would be pretty minimal a couple hundred dollars. We think that stuff another example is this is hypothetical for unit and real house project that has done. We've seen have shared surface parking facilities off of a lie or on the corner and and sewing a scenario each of the four parking spaces. We need to have their own Evy ready by Outlet there and be up to the developer to decide how to wire it all but it would probably make the most sense in this scenario for them just to tighten teach units panel themselves, so And then here is an example of the 20% requirement for an apartment building that's in a parking garage. You can see that there are two parking spaces in the two outlets there with the possibility of there's enough kind of power coming through those two outlets two potentially charged cars in alternative spaces. So this would be a fully electrified garage. Do we do specify where the outlets need to be located? Cuz I look at that layout of know. It's just a schematic that if there is a special hose that's got five different nozzles on the other end to Hagan and five cars the cars that are on the other side, but have to drag the wires across and I'm just wondering if there's any layout configuration we want to think about or if it's we think the technology is flexible enough to come to future-proof for me. At least. We kind of focus to make sure the capacity was there cuz that's really the limiting factor and really was going to kind of break the bank. If you don't have it the nominal cost to kind of run more conduit later when that's needed is very minimal compared to thank you. We look forward to the day when that is the with that 10% of spaces TV, right? You can Electrify potentially have two spaces in the garage. So still ensuring that thirst accessing those facilities. I realize that this will the world run V's is evolving rapidly. But are we seeing that most people that have TVs are doing most of charging at home? So we may drive to work at the grocery store and maybe if they're a little of the top up at 50% of the places are covered that that feels pretty good and pretty future-proof even in the world when there's a hundred percent of these out there. I'm yes, cuz we hope people don't drive to work and they take transit. Also, I think it says I'm showing that people are more likely to buy an Eevee if they're charging at their house and so being able to charge it work as great. If you have an employer that offers that that's a great benefit but jobs change and so, you know, we wanted to kind of meet them halfway. A couple other small details for those of us who like to get into the Weeds on this stuff and a type of multifamily development called Unit lot subdivision. Maybe it's a way of kind of dividing land up after the permitting process typically have shared parking areas that have legal agreements protecting the rights of the people who own a townhouse in that unit lot to Jack's at those are is what we made sure that we had a language that when you're going to make it recorded and everything when they doing their subdivision that day, it's very clear that the people who have access to the parking spaces also have access to the infrastructure there. So there is no awkward situation in this you should buy condo. Are you my kind of bee and an even let me park my TV in there? Also in terms of accessibility very common and new development for there to be building code requirements for Ada parking spaces. And so we make sure that if someone is going to be putting an idiot spaces and putting in these faces that at least one of those 80s bases has a plug at it so that that that space would be more easily able to serve on TV and then in that off chance that someone designs a surface parking facility really far from a building. We have some design criteria for protecting that in having followers or whatever it is to make that work. So at the end of the day the goal of this bill is that all new residential off-street parking is is electrified right? Is it that it can the facilities can be fully served by the power coming in that project and half of new non residential street parking is electrified and then we think you know permitting values changed and out of parking that we build and firm in the city every year changes, but We think of this will lead to thousands of new already spaces each year. So it's really supports a broader climate Transportation electrification framework under dry clean Seattle, and I personally wouldn't mind if we didn't build any more parking in the city. I just wanted to take a moment to talk about some of the other efforts that that's also a underdrive clean Seattle. So easy cro is the EV charging in the right-of-way permit pilot. That is managed by S. We're also installing 20 public fast Chargers and a home charging pilot. That's headed up by Seattle City light's osc is working to Electrify fleets such as Uber Lyft Freight and goods movement and just to kind of take a step back yuno from a climate in livability perspective walking biking and Transit is absolutely the number one priority for personal Mobility. Anything else that moves people goods and services and needs to be electrified using Seattle City light's carbon-free electricity. This ordinance ensures that new development with parking will support the transition to an electrified transportation system that we critically need to reach our climate goals improve air quality Foster Local Economic Development and cut our dependence on dirty fossil fuels. So, thank you so much. 211 thing I'd like to look into is Prince Vault crate work. I really appreciate the through Outreach. Who did I haven't yet heard from a lot of stakeholders which could be a couple indications but based on the list. I imagine that they feel like their needs have been addressed in it at that's great. I think the policy seems very thoughtful to so really excited about that world in which everyone has access to charging is grayed most of the new construction in question. Obviously the affordable housing Polk City building new construction. Will the new build parking will have V's after this which is great but a lot of lower-income folks were living in existing structure is because those are typically more affordable until something I'd love to think about as we learn from this and go forward his opportunities in a certain scale of remodel to require retrofit. I'm for folks and obviously we'll hopefully technology will evolve to so it'll be easier and more affordable fix people to do that. So we can really have true accessibility and I think these you highlighted on Street charging opportunities that were trying to Pile in a few places. Hopefully I can be helpful too. So thanks for not along those lines that would be interested in working with you all on kind of a report back. How many are getting installed what we're seeing you talked about some flexibility and of the code if it if you know that extra one extra spot triggers a really expensive new Transformer, we can adjust that to see how often that's being used. And then with the time frame makes sense. I know you're lying if you thought that I dunno 6 months is probably too soon because now the project will that be done five years seems too long. So somewhere in between there. Initially talked about a couple years. We're looking into just the kind of business practices and Technology changes for how we would do that and still no council member Brian that your heart burns hotter for this topic than mine. I think you've got it covered. Thank you all for your work on this and I believe the plan is it back in two weeks and so will look forward to hearing from anybody else in the public eye. Imagine maybe public comment will be a little bit different than two weeks. And so if folks have some questions or concerns about this way to strengthen interests things, let me know. But I really really pleased with the legislation. I really think all your hard work on this very thorough. All right doesn't want to read the last two items into the agenda. Johnson got a couple more minutes. Denied in three and four appointments or 01280 and appointment 01281 appointment of Brian Estes and Joseph laubach as members. Love you to move Seattle oversight committee for a term to December 31st 2022. Could you give me twice today? Gel, it's exciting. When we start with introductions. Let me to move Seattle oversight committee. Do you want to give us a quick overview of what these people do? Joe is here. Brian couldn't be here appointments. We don't ask you to be here. But grateful you are being reappointed to a second term through 2022 Joe lives in West Seattle and the high point neighborhood is a bike commuter and a registered CPA. What time your Amex food press you can spell and is a retired King County auditor and work for the government accountability office on Joe. I really appreciated your comments today. I've appreciated your comments at the oversight committees in an able to attend and I'll see you a little bit later tonight, but if you want to take a few minutes to talk about your vision or anything. Working on it. It's been a long meeting. So I'll keep it brief. I just want to say thank you for the opportunity to serve again. The Levee oversight. The reset was was quite an adventure, but I think we're in a better place than we were before and I also really wanted to thank you. I'll council member of Brian and you know, you've really given us a lot of vision and an input in in making our committee more meaningful more thoughtful and I know it's been a lot of long days for you. So I just personally want to thank you for all the work you've done and making the committee successful as quick as we've been. So angry. I have a chance to work with Brian a lot and he's amazingly detail-oriented and not afraid to speak up and I you know, I look at someone like Brian is a great voice to have on the committee to sew and I've got me kind of frustrated. Brian's frustrated. It's great. It's kind of a role model for me, I guess. So anyways, thanks so much for that there still a council appointments for this position and your little light on district for representation many district for residence in public comments today cool would be worthwhile for your consideration. Also sitting next to a district for a resident who will be available for this in a couple days, but they may be grateful. I will keep that in mind. Thank you. I will go ahead and move appointment 01280 and 01281 I'm saying hi. Hi. Hi. Thanks for being here in about 5 days. How to say goodbye to you so I will keep it brief but I just it's been a pleasure working with you and I don't know exactly how we will be interacting in the future but I am confident that we will be interacting in the future to sell into old age. Thank you. The feeling is mutual. Cancel Monroe Brian at you know, though there is the honest elections rules about contacts to the city. I'm told that though. I can't make phone calls proactively to people I can receive them. So if you have ways in which you think I can be of service some happy to receive those phone calls though. I will be of course following the 365 day. No contact rule that is part of the honest elections price point. I appreciate that a chance to serve with your videos last three and a quarter years on this committee and I I I hope for the remainder of this year that you were able to take the energy that we saw today and really translated into real infrastructure. Will make the lives of people better in the city. I'm grateful to for that vision and that leadership has been I think a lifelong passion of yours and it's wonderful to be able to serve alongside somebody who really understands gets and wants to see a better sitting so I'm grateful that you're going to still be here a shepherding through this Vision over the next eight months. With that we are adjourned. Thank you. Stay with us. Briganti old is first on the list free. Thanks for sticking around 6 reminder. I have about 10 other folks signed up, but when we just let people line up behind Bri so I don't have some time, name so I can breathe you up 2 minutes. Feminist, I'm one of the things I wanted to say is something a lot of people already addressed which is that green ways were never intended to be the cheaper cousin of protected bike lanes that they're separate infrastructure types that serve different purposes and we need them both and that the trend has been any time things get a little politically hot to just say that it's too hard to protected bike Lanes on an arterial and you know, if I can just go over there somewhere but the thing that I didn't hear anybody else talk about is the fact that our Greenways themselves are becoming less safe. We got apps like Waze that send drivers down residential streets and we're hearing more and more about road rage on the Greenways drivers playing chickens with people bicycling and harassing them on our streets. And what I would really like to see is more maintenance of our Greenways more evaluation of our Greenways and mitigation where they are becoming hazardous and uncomfortable for people and a lot of times with that means is installing diverters Which acid has been really hesitant. Do but if we're committed to making those safe Pathways for people biking and walking, we really need to ensure that they are low traffic volume streets and that obviously people need to have local access, but they should be three ways. We have arterioles for those so that was the big thing. But then I also thought I'd take the opportunity to thank Rob Johnson for his work and let you know how much we're going to miss you and obviously Mike O'Brien as well hear fantastic, but we're not losing you yet. So I'm not saying goodbye and the EV charging station was was great and I am thrilled about the new ordinance requiring even ready installations. I did want to make a comment very briefly since I have the opportunity about EV charging stations in the right-of-way. We just had a very drawn-out conversation about Broadway and Denny which was an inappropriate place to put an EV charging station. And I don't think we need EV charging stations in the right of way because when I talked with somebody from to be lied about it, and I said, what about supermarket I made moves in there and he's an older already doing that. Then why do we need the right away if they're already starting to be installing the public spaces. So just throw that in there. Thank you both for a Long Afternoon of being here. And I'm sorry I almost skipped you go ahead. Ingrid I'm kind of a typical in that I guess all I can put this on you. I just have one load sheet, but I wrote it down so I wouldn't forget but there's two things. I want to make sure I say when I'm a cyclist and the biggest thing that comes to mind when I think of riding my bike apart from the fact that I really like to is that I'm scared. I'm really scared they're saying is I just want to add this cuz she touched down that was that weighs puts me on Greenways all the time all the time and so unfortunately, so whatever it was thanks for being here. Thank you for the work that you do want to add right now actually live on the east side, but I've been into spending moving over to Seattle, but I since I ride my bike. I'm kind of all over the place, but I'm a long distance Runner 2. And so This is what I wrote down. I wanted to say a top reason why women don't ride bikes because they don't feel safe. Many of my friends have told me this is why they won't ride. I am a newer cyclist. That means I've been writing for 2 years. I means I bought my first bike two years ago and I had to learn everything like how to clip in how to everything solely. That's why I joined team drives and all women's team cuz I wanted to race but I am too scared to ride on the roads. To get better. So that's the number one reason. I've been injured my arm, but it sounds a bit because I've been too scared. I'm a very considerate respectful law-abiding cyclist, but I've had to follow my bicycle too closely drive right behind me blowing their horns for Miles simply because I'm a cyclist. I have had to call the cops, but it's terrifying when that happens by drivers intentionally. Try to make me crash. I'm also a long distance Runner and I regularly run on neighborhood Greenways cars speed down these wide streets and accelerate when they see me instead of slowing down. People blow the crosswalks on these neighborhood Greenways all the time when I have already been in the crosswalk. I wear neon clothing when I run because I like the colors so they can't say that I have been in the middle of a crosswalk and had a police officer who didn't have lights or sirens on no emergency. Just not paying attention the cross walk with me in the motocross bike to feet away from him. If I had not stopped I would have been in the hospital. This is why I now avoid Greenways when I run if I can. Stay on the narrow roads. These are a few examples of my experiences. Please do not tell me that green ways are safe because they are not the only way to protect cyclists from Cars is to actually protect them and give them protected Lanes. I came here because I saw a social media post about this meeting by Cascade Bicycle Club asking us if we cared about this issue to come because I do not think that green ways are a solution for protected bike lanes and when I read what came out last week, I was really really upset. Please do not say otherwise because projected because you are not safe for cyclist. I asked you to listen to my voice as a woman. I am not an activist or not. I've never been to anything like this in the past average member of your public and I'm a bad cyclist with slow reflexes on the bike, which means if a car does something I can't respond fast enough to save my life. I asked you to listen to my voice as a woman that I do not feel safe on the roads without protected bike Lanes. Please help and please give me protection Center Nelson wants to fight public, today. Great. Thank you so much for being here for the work you do with that. We are now attract.", "end_time": 7849.8}]}