{"format": "raw", "annotations": [], "confidence": 0.9517350087188324, "data": [{"start_time": 0, "text": "Good morning. Everyone. Today is Thursday, June 6th, 2019 energy and workers rights. It is 9:33. I'm Teresa mosquito chair of the committee joined by my counsel calling councilmember bagshot. Thank you so much for being here and councilmember warrants will be joining us about Midway through would you have a pact agenda today? So we are going to roll through the items and we'll have timers for each section that we hope we have allocated each section appropriate time. We have 12 items the first account appointment to the Seattle City Light review panel. The second is three appointment to the Joint Apprenticeship Apprenticeship Training committee an appointment at the Capitol Hill housing Improvement program governing Council are briefing and possible vote on the one-year prohibition on red wedding briefing impossible vote on Fort Lawton rezoning and Redevelopment plan, which includes three pieces of legislation, which I'm told you do have to vote on separately and introduce separately. So they're all three together items. And the we will vote on them separately will have a chance to hear about the entire package together. We will also have a briefing on city is notice of intent to sell legislation that was passed a few years ago by councilmember Burgess and councilmember Clark and finally a breathing on the housing Levi Administration and finance plan with the consent of my Council colleagues. I'd like to switch the last two items 11 and 12 so that we have the housing Levi administrative and financial plan first, which is item number 12 and then go to item number 11, which is comfortable one 19537 modify Necessities notice of intent to sell legislation with that if there's no objection, I will approve today's agenda at this time and where one minute early even though we started 3 minutes late. We are going to get into a public comment for those who signed up for public comment will give you two minutes to speak. Please introduce yourself and for Council. Please do keep your comments limited items that do appear on today's agenda or within the purview of this committee. And if you haven't had a chance to sign up and want to there's still time the first two people that we have are Marvis Emmett and Rosalie Linton. Hi welcome. Your time is starting. Right here on this is a city council meeting right in the right place. And there's no city council members of an this is a Committee hearing not a full committee today. There's two and as I said councilmember Juarez is joining us Midway. Well, I'm here to speak against the development of Fort Lawton. I believe that is going to be a grave mistake for the city of Seattle. It is known in their studies made that more open space serve the city in environmental concerns. It'll clean the air it'll filter rainwater it all guard against more pollution in Puget Sound it'll guard against preventing. nesting birds like the great grey Heron from passing over the proposed development where they can continue to bring their nesting materials from the existing Discovery Park to the locks where they now have a heron Reserve preserve and also the bald eagles there are so many reasons why the city of Seattle should purchase Fort Lawton for Park One of the major reasons is because it is contiguous to existing Discovery Park. This doesn't happen often. In fact, this will never happen again. So for all the people of Seattle all the tourists who come to visit the very popular Discovery Park, please expand Discovery Park use that acreage for more trees more Trails, so that more people can enjoy the beauty of what the natural open space of Seattle has to offer. Thank you very much. The next person is Rosalind tan followed by James McIntosh. Welcome. Good morning. I'm here on behalf of my husband and myself. So if he was here, this is what he would say. I feel it's inappropriate to take a neighborhood with its own quiet character and drop 600 more people and their cars into a very small residential space. I hear council member O'Brien on NPR recently as founding the virtue of absorbing to allow for accessory dwelling units by your Cottages as a way to increase density without greatly impacting the character of the neighborhood. Why isn't this same philosophy being applied hear your plan would greatly changed the area and they were nowhere near places employment shopping transportation for the people you hope to house here and for myself my comment is this for a project that will cause almost 90 million dollars. I haven't heard of this budget. See you only 2 months ago. So public feedback is largely try to that part public feedback is largely based on emotions rather than cost-benefit. So if this What's your money? Would you decide to spend based on your emotions 90 million dollars? So does that may be free but developing it is not cost effective due to the location of where it is Trucking and materials in and out of my house. Magnolia is not cost-effective. So surely there is a more cost-effective location like somewhere near like 15th. So, please scratch the surface when you look at the budget lastly, it'll take eight years to finish this budget at this project. So how would it help the homeless and affordable crisis that we are facing today. So I I ought to just look at the budgets are really and see no other cost-benefit. What are the I know we are so late into the game now, but that's you time. Thank you very much and thank you for sharing your husband says money as well. I know it's hard to be here. Sometimes at 9:30 on a weekday. I'm the last person that we have signed signed up to testify as James McIntosh. Yes, I am James McIntosh and I spoke earlier at the other public hearing on this just for a minute reasons, but one aspect of this open space potential open space is that it's accessible to all its earned and but you can get to Discovery Park area by public transportation and many of us just don't have the opportunity to drive up to the mountains are out to Wilderness to convene with the Wilderness that this is fair to everyone that this space. Once it becomes Parks space is open to everyone it's open to all I just write about this earlier and just going to add a few things that being on the outer fringes of the park. This area could be used for a little more active uses such as picnicking Heritage Orchard comes to mind just a little more active you but there are many concerned that this whole area is is kind of interrelated with the Heron habitat, which is in the The Corner Store Ravine all this area North Magnolia is there's a green belt. It's it's cooling off the planet. It's it's trees. It's open space and that's what we need and a city of seven tune to be seven hundred fifty thousand people that three-quarters of a million people in more. We just need the open space. So missing out on this opportunity. It's just a once-in-a-lifetime opportunity. Once it's gone. It's gone and there are other places that portable housing and I favor affordable housing and Housing for those in you know that you know that I'll come to mind. Thank you. See you again. And if there's anybody else who would like to testify, please go ahead and make your way up and we put the sign up sheet up there so you can sign it after your name for the record and we'll get you in the beaches The Meadows in the forest of Seattle's largest and most beloved park at the time of its Inception in 1974 large amounts of federally owned in Holdings remain which fragment in the park in limited its full potential. It its original master plan city leaders urge that all lands remaining is Fort Lawton be returned to the park sadly despite the best efforts of all Discovery Park supporters. This does not appear to be the course the council Like to take decisions such as this are always difficult and we recognize the many overlapping and conflicting interest is body. Mist adjudicate none the less we urge you to consider one last time this decision which cannot be reversed. It will change the landscape of Discovery Park forever. The park represents many decades of hard work and advocacy by friends and many other groups. We ask that you remain committed to the ideals as first put forth by Senator Henry Jackson Bernie Whitebear judged on Voorhees. And of course Bob killed all created protect. This place that is free from the noise in the clamor the city to provide its citizens a place of Refuge in solitude. Not only is this parcel adjacent to the park. It is also located within a few hundred feet to the right. Zone of Salmon Creek and Kiwanis Ravine or a small band of great blue herons has been living in testing for literally thousands of years. They too are stakeholders in this decision, and we ask that you consider their fate friends of Discovery Park would like to thank to recent Mesquite. Set for her diligent efforts to provide a small portion of the proposed parks department maintenance yard for demolition Andre forestation. Although only a few Acres. This will potentially large the very limited forested land that represents their ancestral home as decisions regarding the development of this last remaining Fort Lawton parcel proceed. We ask you to remember that play fields are not habitat paid services are not open space. We asked you commit to provide as much real habitat for these animals as we can by creating as much forested canopy as possible for both of humans that will be living in Recreation here and the great blue herons that have called this place home for Millennia. Thank you as well. We look forward to talking about the Amendments that we worked on and the future opportunities that are presented with some of the language that's been drafted. So thank you all for being here to share your perspective and I think later today. Hear more about some of the possible changes that are coming to the four-line plan anybody else here to testify great seeing none that will close or we're going to have a Leah barreca from Seattle City Light and I believe Mikhail Gonzales is not available. But if you could come on up to this has been an issue long in the waiting. We know that we have had a vacancy on the Seattle City Light review panel for a while. So excited to have you attend to item one appointment of Michaela Gonzales as a member of cities City Light review panel for a term to April 11 2024 briefing discussion impossible. Vote. Welcome. Thank you for being here Leah. Do you want to introduce yourself and a little bit about the Seattle City Light? City Light review panel was established in 2010 and provides oversight to the utility on matters such a strategic planning and City Light rates as well as Financial policies. The panel is comprised of 9 individuals. They're all volunteers five are appointed by the mayor's office and for by city council position is meant to represent a different sector of City Lights customer classes a commercial customers residential customers low-income. Advocacy Etc. The position that Miss Gonzalez will be filling is position number 2 Which is our financial analyst. And would you like to speak a little bit about Miss Gonzalez? I sure would miss Gonzalez has led the access solar Network at spark Northwest since January of 2017 while mastering the business side of solar energy development. She has cultivated Partnerships with a range of public private and nonprofit organizations. She also supports solar plus State energy strategy work across Oregon and Washington and is driven to find Energy Solutions that work for local communities. So given both her energy experience as well as her learning the business side of that organization. She'll be a great candidate of grape addition to the panel in the role of financial analyst. Thank you so much. And we usually do ask the individuals who are being appointed for the first time to come to the table. We know as I said earlier, it's hard to come in the middle of the day sometimes so we'd like to make an exception. Dan appreciate your presenting this we do have her appointment packet as well in front of us a customer back shock. I just I wanted to acknowledge how much work this particular panel does and sent their uncompensated. We really appreciate all the work and I just want to extend my thanks to her for being willing to participate with her backgrounds going to be a real asset and we'd like to thank you for finalizing this appointment. We will now with this appointment have a full panel and we're looking forward to working with Miss Gonzalez going forward or credentials are qualifications and the diversity that she is also going to help bring to the panel, which is something I think we're all very interested in. I want to Echo council member bagshaw's appreciation for the panel and for City Light. We know we put a lot on their plate and we'll be hearing back from them earlier this summer about the work that they've been doing regarding the rate design review. Going to be critical as we think about next year and rolling out potential new rates for our residents and business owners. And I'd like to move the committee recommends confirmation and Michaela Gonzales as a member of Seattle City Light review panel. I know it's unanimous, please communicate our thanks and appreciation Dennis Gonzales as well. And the motion has carried. We will bring this forward to the June 10th full Council committee where you will see all of the Committee Member are council members to the diocese up here. And that's next Monday. We will be inviting her to our June 25th. Excellent. We're also working with your staff to include you on our July 16th agenda to be there. I can do that. Two items to through five on the agenda. Mm in 30 days. You could read those items into the record while she's doing that. If I could. Please be joined by Todd Snider and the appointees that includes Kellan Bulman Michael Starks and Shawn weeks, and these are our Joint Apprenticeship Training committee new appointees, and Todd is with the chair of the JATC agenda items at 2 to 5 appointment of Kellan Bulman starts Shawn weeks and Thomas Kelly afford to be members of The Joint Apprenticeship Training committee for a term December 31st 2021 for briefing discussion of possible vote Thomas Heights, Wonderful. Thank you for jumping up here to start a really great name for the JATC city of Seattle, Washington. Joint Apprenticeship and training committee don't have a fancy kind of acronym for it. Well, let's begin with introductions and Todd if you could brief us on an update on with the days he see is up to and then we'll have each person talk a little bit about themselves and what their interests and being on this Apprenticeship Training committee Logan. My name is Todd Snider. I'm Seattle Public Utilities apprenticeship program manager and the current chair of the JATC under wac. 296 - 05 the Washington State apprenticeship and training Council has recognized the city of Seattle Washington's Joint Apprenticeship and training committee with the authority and responsibility for administering all registered apprenticeship programs sponsored by the city of Seattle currently. That is f a s s p u n City Light. Our committee is represented by both labor and management. Great. Well, thank you. Why don't we go ahead and go down and we'll have those to introduce themselves their name and their background and a little bit about why you're interested in serving and then we'll ask a few questions and get into the details. And if you just want to pull this up real close as long as that green lights on at the bottom of a we can hear you 11 years now, I've been in the trade since 2005 and currently a line through crew chief for them. I also teach the second-year night school for the line apprentices. I want to be on the JVC. Can I get back to the apprenticeship and maintain the Integrity of the apprenticeship and take pride in my work in my trade? I want to see that continue. How many Mission weeks work for the FAS Department specifically now? I am the apprenticeship manager over the mechanics apprenticeship program. I've been with the city of Seattle for 12 years. I've worked as a mechanic and a senior mechanic and recently too, this new role. The reason why I would like to be on this JTC committee is so that I can use my abilities and skills to help lead the apprenticeships throughout the city and help better each and every one of them. Thank you. Hello, my name is Michiko Starks. I'm the manager for Seattle City Light apprenticeship program. I've been with Seattle City Light now just about four years a prior to that. I worked as the interim training director and assistant trainee director for local 46 electrical apprenticeship hour prior to that. I was a journey work or electrician and then Apprentice prior to that and a lot more than I won't mention but I was at I want to participate and be on the JATC is you know to work with my peers and be involved in the decision-making process, and I you know how that impacts the apprentices. So that's basically it excellent. Thank you. Hi, I'm Tom Kelly my been with the sea shell Fleet some facilities for 21 years for 20 years of work for the princes on the job. I've been on our local committee oversees our shop for couple different stints. But the PC is is help represent. The apprentices. My union asked me to join it seeing how I work with almond and I like to make a difference. Local machinist, I guess. I am a 21 C represent by 21c. But that has nothing to do with the apprentices think that this is why I'm one of the issues that I'm really passionate about coming from the Washington State labor Council AFL-CIO job opportunities union jobs are really one way to make sure that we maintain the middle class. We treat opportunities out of generational poverty that we can lift up workers and make sure that there is self-determination self-direction in the careers that they want to choose really excited that you all want to serve on this committee. I'm one of the things that I'm really interested in and I think we've had a chance to talk about this last year when we were doing some appointments one of the things I would love for you all to think about it if you have thoughts right now, I'd love to hear I think there's opportunities for us to build train folks in the apprenticeship program. But placement have been something that I've heard especially from some of the folks at Seattle City Light Within IBEW that there is not a clear pipeline into some of the job. Sometimes we do a good job training folks and then we don't necessarily have all of the openings that we would want ways in which we may want to try to facilitate the placement or hiring is something that I'm really interested in. So going from apprenticeship to placement. I'm feel free to comment on that as well. If that's something that you guys are working on scaling up or half. Son. Would love to hear more about that and just want to make that plug as you think about all the work in front of you as well. Yes, and I just want to be clear on as far as when you're referencing placement. One of the things that limits the amount of people that we can bring into the program is that we have a ratio that we work under under the guidelines for the state. So that is a large impact is because there might be a limited number of pockets available and it's in some cases, you know, there might be a demand that's higher than for what even we can offer as far as the work for. So for example, if you increase the pockets that increases the amount of people that we can bring in because then our journeyman to Apprentice ratio key all we can work without exceeding that and the reason the ratio exists is for it's for the safety of The Apprentice, you know as they gradually learn more about their craft, you know, the more that they learn the more they're able to Work independently, but you know, it takes years for them to learn their craft and in a construction environment. There's a lot of considerations for safety and you want them to be a skilled craftsperson at the end to so that's why we we can't have too many apprentices who would ensure that they the ratios maintained knowledge and I'm very thankful that the four of you are interested in participating in this 10 years ago. When I was first on Council and learning about this particular program, we were really trying to expand opportunities and be able to reach back whether it's into the the Union's now or into our high schools local colleges as well to make sure that they knew that this program was available to any of your name Todd. Maybe this is a question for you. How have we expanded our Outreach? Will each of the Departments does their own Outreach when they recruit a class there's been other activities party hire office is reaching around with pre-apprenticeship programs to link different populations to registered apprenticeship. I think in some ways outreaches Leslie issue though, especially when you talk about City Light apprenticeship swirl apprenticeship is in the state of Washington is hitting record numbers that we've never seen before because the economy and I think that's because of the heart incentives the brake on prevailing wage and a project utilization requirements is encouraging and gives a sense of urgency to businesses to participate in the training of the next Generations Workforce. We obviously don't have those incentives Suffer City employment. So if you want to expand apprenticeship within the city to different departments, which I've seen they come before the agency is a struggle to pray these programs for their own departments is it takes leadership policymakers like yourselves and if I think is with your encouragement and you holding our City Apartments feet to the fire you will see the city itself break more apprenticeship opportunities. When I'm actually with the friendship that I oversee I were working on expanding it right now and trying to get approval for more pockets and more fun. You said we can actually I'm planning on quadrupling the size that we are currently doing and I've been doing a lot of outrage for the local high schools and making connections with the automotive shops that you know, it's really funny when you go to high school and you asked the students ago. All right who in here can tell me what apprenticeship is most of them don't even have a clue what that really means. There's there's such a focus on getting the four-year degree in going to college dorm College won college there. So talk to do nowadays. I knew I was a kid that was on the cusp of not graduating high school and then in turn I wouldn't got my bachelor's degree in teaching. So, you know, I spent a lot of my time educating the students in high schools on a twerking with different principles and the Seattle School District area that have trade programs in their schools. I'm a little disappointed frankly to hear that that is what you are running into because for years now, I've been working with the school board members and they have they have changed the phraseology rather than being prepared for a 4-year for your next steps. It's it's called your career and really hitting the fact that not everybody wants to go to college in or do they need to go to college and they're getting the kind of training the apprenticeships are offering. So if there's anything any clues you want to give us after this meeting or anything you think that we can do to help just keep that message and the drumbeat going. Seattle Public Schools Which is zargar closest connection It just strikes me that we're missing the bone if we're not getting into the high schools and really providing these alternative Outreach and you know, if they don't know this exists, I don't even know if it's a possibility for him. And that's why I don't want to think that a lot of us have been trying to do a different career fairs and things we've all been working on independently. Thank you. So what are the top two items that are in front of the Apprenticeship Training committee at this point? What are what are our friends going to be working on? But we've been certainly our day-to-day responsibilities are making sure that all the apprentices are treated actually on the job that they give me proper training and the proper way to dance with us. What we do on a day-to-day basis when we go out with me monthly we've been trying to encourage expand opportunities within the city. There's a couple of other departments at a protest in the last two years struggling to do this. We've I know some of our departments have struggled and turning internally with classification issues with pocket issues. And again in the private sector of the urgency of the brake on prevailing wage in the utilization forces that through and I think without that hard incentives, that's the struggle that we we have was trying to expand this opportunity. Expanding pockets. Is there anything that you need from us? Is that budget Authority is it don't even I don't know what kind of pushed back that you're getting from the budget officer. The executive is anything you can offer. No, I don't think I have a strong of handle on on all the pocket issues involved that I'm be happy to help facilitate that conversation with you later. So what I would love to do or doing a little bit of sausage making up here in the public policy world. What I'd love to do is I'm check back in with all of you in September we decide would love to work with you on certain what the reporter report out looks like but on these issues of Outreach, especially to a schools, especially reaching our younger kiddos, maybe 9th and 10th grade so that people see there's opportunities on the horizon that you know what I think there's a lot of pressure especially sophomore junior year in high school. People are asking what you going to do. What you going to do. We want people to know about these good union. Next jobs in the trades in various sectors that they might not have on their radar want them to know about the apprenticeship training programs at the city provides. I think we spend a lot of time thinking about and worrying about grace of our Workforce and there's a lot of folks. I can't remember the exact statistic right now who are going to be retiring soon and we really want to make sure that people have the opportunity to get into those jobs. And also for a retiree is that there's a stable Workforce of people continue to pay into their pension. It was a very selfish filling prophecy when we get soaks into these jobs. We can continue to I generate both good living wage jobs for the individuals and also generate the needed pension contributions for fuel for our pass workers. Would love to have you over report back to us in September drinking is as you come onto the training apprenticeship a Joint Apprenticeship Training committee. If you can think through with us what it looks like to do that recruitment piece, we talked a lot this last year about access to free community college, but one of the things that was included in the Seattle promise program was access to Apprenticeship Training programs as well and wanting to make sure that people knew that that was an opportunity on many of our Union Apprenticeship Training programs are free to the participants who are wanting to answer but we also want them to know about all the work that you all are doing and that the cost should not be a barrier anymore. If it ever was so outreaches you talked about the pockets as you talked about and greater diversity. We love become more on those three topics. So maybe we can brainstorm some more so we're not doing this on the spot, but I think that that's really exciting all the items you talked about. Let's do this committee recommends a confirmation of Kellan Bulman. All those in favor say hi. Nobody will bring you all forward on June 10th. That's next Monday to the full Council committee are the full Council agenda, and you don't have to be there if you want to be there, but we'll go ahead and vote and still get a strong recommendation from all of us. So, thank you. All right, let's go ahead and move onto item number 6 and it while we're waiting item six into the agenda. agenda item 6 appointment of Rachael Steward as member of the Capitol Hill housing Improvement program governing Council for a term of March 31st, 2024 brief discussion festival, and then we'll go back to Kenny Pittman, I'll stay in a government relations executive assistant and board liaison at Capitol Hill housing Rachel Steward on coming board member Capitol Hill housing. Excellent and Sarah. Sorry, I didn't call you up. I'm happy you're here as well. Kenny and Rachel. I'm sorry Kenny and Sarah. Why don't you guys give us a quick overview of some of the work the Capitol Hill housing Improvement project has been doing and then we will turn it over to you to help yourself Housing and Community Development. Are we currently own or manage almost 50 building throughout the Seattle area and since 1976. We have helped low-to-moderate-income folks around Seattle. How many people do serve in those buildings I do not know the exact number off the top of my head. I think we have a couple thousand residents antenna everything else about the work that do you like to come in on from a why are the role that technical assistance to them? And so I have communications with with Sarah and also Christopher and whenever they have any questions and also helping them when they are having their board appointment is coming before the city council. You so much are we have a full pack in front of us including your resume which is very comprehensive and really excited that you were interested in this position. Can you tell us a little bit more and why you're interested in serving on this benefited from the community Assets in Seattle since I was a young woman, so it's wonderful to be able to be able to come back and serve in a volunteer capacity at Campbell Hill housing. I also work at Seattle Housing Authority and prior to that at Seattle University and in every capacity always wanting to be able to bring resources forward in such a way that it really ensures that people have access to the resources in our community to be able to meet the goals that they have for themselves and their families. I'm always looking for different ways to remove barriers that might impede that that progress towards goals and to be really creative about how we do that. So my my interest. Capitol Hill housing is kind of carry forward a conversation. I had with Chris person's executive director some years ago about capitulo housing finding a way to be a leader and Equitable Community Development Across our country. So being I'm Really Brave and courageous and thinking about how we prevent displacement how we develop housing that serves the people who have live in communities historically as well as finding ways to get along with people who are coming newly to our community and ensuring that we all kind of Rise together and that work. Oh boy. That was our campaign. That is why I tell you what I'm rising together is just said is that is a thing that we have for the year, but really ensuring that I'm for folks who live in Seattle that we do rise together as we're learning together and living together. So excited to bring my leadership. You are absolutely singing Our Song no question about it. You talking about creative ways of adding more housing and being inclusive tell me some of your creative ways that you are thinking about that. We have not yet thought about or have not engaged in that we are beginning to do that work. I think the example of the Liberty Bank building development is a really good and and recent one on the work that Capitol Hill housing did with the black community impact alliance with africatown with Byrd Barr place are examples and and with Kathy Catholic community housing are examples of being able to utilize the assets the collective genius that exist in our communities to think about what development looks like in this transition time that the city of Seattle is in I'm in that really required as having difficult conversations with one another over and over and over again and not expecting one conversation to resolve all of the years of us missing one another. I'm in doing the work that it takes to rebuild Trust. And recognize that that is going to also take time because I have to learn how to be different. I love that. I have so many. Meeting that I now want you and now that I've met you. That is a leader in the agenda. I'm in terms of how we bring in that it was just a collective Collective genius and how we improve public policy which is part of what will be discussing in the administration of Finance plan later today and how we really not just building units, but build community as they were building housing that is, you know, recognizing the need for small women and minority-owned businesses and childcare and senior centers and community space on the 1st and 2nd floor outside and public space in Plaza. I mean green space so that you have given us a new vocabulary and I'm really excited about that. One of the do you want to talk about any of the big challenges that you're looking forward to helping to address? Well on let's let me count the ways, why did some of the some of the big challenges are recognizing that We have history that tells us that we shouldn't always trust one another right and we can't ignore that. I think part of part of our challenge is is doing the really hard work with folks like you all to change what the rules are for us to be able to have Housing and Community that recognizes that iversity that's in our community and that diversity is also historic diversity, right? It's not just a superficial diversity of what we look like. So I think part of it is Is finding ways for us to ensure that people are also building their assets and their wealth for their families wear those opportunities have been taken from us in the past. So a lot of the development that's happening in the city is rental development. And I understand that that pencils out best and at the same time, it does not necessarily help communities that have not had access to resources to actually be able to accumulate wealth and that goes for a small business owners as well. So when we're looking at and I'm spaces for them to lease those are still leases and oftentimes, it creates significant that those retailers have to absorb and find ways to pay out and they are not able to accumulate wealth and asset for their families in the ways that we like to imagine that they will and the same is true for young families who are renting we want to be able to find ways for people to have equity and to take it. If them and pass it down for communities of color that has been a Challenge Generation over generation of a generation and that was intentional and so if we're going to change that we have to be very intentional courageous Brave creative in doing so and and we have to start right now. Michelle Hepburn somebody you've worked with no I didn't work with her closely. We were I think in the same orbit, I don't want to do this because you got so much else to do Sound Transit has a lot of little Parcels of property particularly a wrong lane every Beach and on Martin Luther King way and my understanding is that they are considered too small to really develop but I'm wondering if you're looking at something new some ideas whether or not we could consider whether there was space maybe four in a few small businesses in the lower floors. Like we have been talking about that could be in a 400 square feet not 4000 square feet and with some spaces on top strikes me that maybe there's some prototype opportunities here that we've overlooked and I'd love to see if it's something we could do. Wonderful. Thank you and say hello to all of our friends at Seattle Housing. Appreciate them. I'll do that cuz I think we'd like to move to appoint you I I love that you talk about changing the dialogue and changing the narrative meaning of the conversations in the communities of color have explicitly excluded and intentionally try to divide our communities through segregationist race is redlining policies and that the Legacy still continues. I've given that housing I was a relatively new topic to me about two years ago as I started to enter more and more into the world. I realize that in the housing world we use alphabet soup to the nth degree Paula m h a i z e f a r m i n a we could keep going on and on and when we use words and we don't create an inclusive dialogue, I think too many. Square Transit planning and I should say Transportation Planning specific the highway creation and housing policies in the past where they've been harmful to communities in the past when we don't use dialogue of this inclusive and bring people to the table to talk about how this can correct historic wrong and I think the first people the first thing that people think is this is going to harm my community and if we don't have folks who are directly affected at the table, so I'm just love that you were talking about breaking down that dialogue and creating a more inclusive conversation specifically around housing because I think it is one of those areas where now we are trying to change that corner, correct those wrongs and we have to create a table and a narrative that is inclusive as well. If you're running into something and you don't feel that the community is coming together in a way that you're feeling comfortable with both of us would really welcome a call to our office with and talk about it and don't assume we know because oftentimes we But if you will actually reach out and tell us what the issues are or what you're seeing or concerned about then we can get engaged as well. So please know that that at least is committee in particular is very interested in doing that with you. Thank you. Thank you very much. I just wanted to finish by saying that Rachel has actually served on one of our committees as an on board member for almost three years now and as you can see she is intelligent and thoughtful and has already been really engaged and a wonderful addition and we're just really excited and honored to have her officially join our board to solicitous officially on I'd like to move the committee recommend the confirmation of Rachael Steward as a member of the Capitol Hill housing Improvement project. I will bring your nomination forward to the full Council June 10th and recommend the passage of your appointment as well as you do not have to be there to be there but we Everybody has busy schedule. So I think of her being here today. I'm very excited. Thank you. Thank you both forget. I got some words for you so much if you could read into the record item number 7. Tasha I don't have to teach me how I'm sorry from Central staff at the table. Thank you for joining us Asha and go ahead 59507 an ordinance relating to fair housing establishing a one-year provision on use of rental housing building platforms for briefing discussion impossible vote and thank you for joining us at the table today really excited. How do you end if you could give us a quick overview in a quick second here? Oh seven reminder for folks. This is really exciting for me. This is one of the issues that we worked on last year in March. We created a one-year prohibition on the use of the rent bidding Technologies in order to provide time to determine whether these platforms is online platform soda, like eBay for parental units are in violation of our fair housing laws and analyze how they may impact our housing cost. Or has been equities and access to housing or other potential disproportionate impact in our community and over the last year the office of housing in coordination with the office of civil rights and the department of construction and inspections has been working to study and understand how this new technology impacts our commitment to Equitable access to housing and what long-term regulations may be necessary and I feel like we're constantly responding to the new technology. And this was one that got put on our radar especially where the students at the University of Washington so kudos to them for engaging in public policy making in appreciate their them reaching out to you sat with the new technologies are emerging and becoming ingrained into our system. We wanted to slow down just a little bit and take a look at this technology to see if it had implications on our rental housing market and to be able to make informed decisions about how the city could respond to protecting our population and uphold our fair housing laws. So the report is still in the process of being completed and we anticipate our friends of the office of housing will be able Submit the report in July of this year until we have the report and we wanted to make time sure that we had time to decide what to do with the information and make sure that we had our Protections in place has the city. So the prohibition of the rent bidding Technologies did expire at the end of April. That's why we're back here talkin about this ordinance without which Asha will talk to us about and the possibility of another 6 months extension think Sasha from here. I feel like I think you covered most of it at this point this prohibition if if it is voted on by Council would go into effect for another year rather than 6 months just to provide time for Council tool review the report and then to decide if and how to regulate these platforms moving forward because of the timing of this the original prohibition expired at the end of April as you mentioned and if this does move forward the prohibition, the new prohibition would go into effect probably about mid July so that we've said a two and a half months Gap approximately of these landlords and potential tenants being able to use run fitting platforms, but we haven't heard anything. I'm in that interim time to to note that that that uses really been as bike since the last prohibition ended so You know how other cities are addressing this has San Francisco in particular put a similar moratorium on this platform. Do you know sure if anywhere else has done a Prohibition on these I know that there have been concerns coming from various cities so that there have been news reports about The concerns that the various cities have about how these platforms may impact equity and housing prices. Just wondering whether our people learning from us. Are we learning from other cities are we sharing information? My my instances of people are learning from us some of the at the studies that come up when the u-dub students first brought this to council's attention were studies that had happened overseas for the most part. And so I don't think there are a lot of studies that have happened within the United States or in this region about how red wedding has affected housing prices or equity. And I will also know if there's a been a number of cities that have reached out to our office interested in this our ordinances specifically because they have seen an impact on the market. I also think that we got additional attention. I don't know if you want to talk a little bit more about it. It's covered in the the memo but shortly after the passage of our original ordinance. We did we did hear that there was individuals who felt that this was an interference with the their freedom of speech on March 15th of this year 2019 the US District for the Western District of Washington ruled in favor of us the city of Seattle and this is I think something that is going to continue to get attention from other cities and especially because of that we got to make sure that we get the policy, right and I'm so appreciate the clarification. This will be for another year. We will hear back from the office of housing which gives us ample time to consider public policies. I just that the last thing I would add is that the plaintiffs in this did file an appeal. And so depending on when the results of that litigation are completed it may or may not affect the timing was Prohibition but until until that goes through it's it's beautiful process. We just won't know one thing and I don't expect you to know the answer here today, but I'd love it. If you would follow up is also we continue to hear about the first and Time Rental policies and I've heard from some students as well saying, you know, it's really that's not fair either and I know that there was unintended consequences we were trying to do the right thing to make sure that nobody was intentionally excluded what I'm hearing people say as well, you know, if you're sitting in front of your computer and you've got the time to do that and you can push that button and get your name on will then you've got a leg up those of us there in classes are people who are have jobs away from computers feel that they're their disadvantage buy that policy so As we're moving forward with this, I'd also just like us to keep an eye on that other. That's the way that that that bill is it currently also in litigation on appeal and so I believe oral argument was this month so we should find out what that looks like at the earliest I thinking next January. I think their comments. Okay, thank you so much for doing this. I'll just want to reiterate for the viewing public. We did have ample conversations. I believe it was at least two and perhaps three public hearings on this last time with the students from the University of Washington providing a comprehensive presentation data set that they pulled together appreciate that and we're from Central staff appreciate that last year as well. If anybody wants to look that up, it was ordinance went to 5551 and given that comprehensive analysis. I would love to be able to move this legislation forward today as if the committee recommends passage of 507 that's 9507 regarding the prohibition on platforms all those in favor, please what I sow the motion carries and we will bring this forward to our full council meeting. On June 10th are so thanks again for your work on this and for getting us caught up to speed a year ago and for your Speedy work this year to make sure that we had policies in place so we can have some time to consider public policies. Really appreciate your work. Thank you great. So we are going to move on to the items on our agenda related to Fort Lawton. And what I'm going to have a free day for us to do is read into the record items 8 9 and 10. I'm an ass. She's doing that if we can please be joined at the table by Emily Alvarado from the office of intergovernmental relations Max Jacob from the Department of Parks and Recreation Tracy Restless. Thank you for being up here and Central staff. Thank you all for being here and just as for the record just a reminder for each one of these separate. Agenda item 8 resolution 31887 a resolution adopting and approving an application for Surplus Federal property at Fort Lawton for briefing discussion and possible vote agenda item 9 castle built one 19510 and Ordnance related to land-use and Zoning amending page 52 of the office land use map for breaking discussion impossible for an agenda item 10 Council Bill one 19535 an ordinance rules relating to the Fort Lawton road development plan application for briefing discussion impossible foe. Great will we have a full table today? I do have a few comments just because this is a really exciting day. It is after 15 years and today will be the fifth committee meeting on the Fort Lawton a consideration on this is a chance for us to have a final committee discussion and possible vote on all aspects of the Fort Lawton Redevelopment plan, including the proposed reason, I rezone legislation and the legislation that adopts and approves the city's application for Surplus Federal property at Fort Lawton. We have really an interesting conversation in front of us to talk about not just the preservation of public space and green spaces we heard about this morning, but also the ability to do that on public property that is nearly zero cost of the city as we preserve about 60% of this land for open public spaces and green spaces for play and enjoyment. We're also creating over City of homes that will be very much needed to our region including homes for seniors and Veterans who were previously experiencing homelessness affordable rental homes for families and individuals affordable homeownership opportunities, which we just heard the bells from Capitol Hill housing. I talked about the importance of creating opportunities, especially for a lowest-income virus and folks have been priced out before and it didn't want to reiterate that over 60% on this site will be used for parks and Open Spaces. One of the biggest challenges I have about adding a new affordable-housing throughout our city is that many times we hear from nonprofit developers that it is cost-prohibitive to acquire land in the city and that it's very expensive to build in this competitive market with the opportunity that presents itself at Fort Lawton. We have a unique chance to gain ownership over a significant portion of the property from the federal government at no cost if it is used to build affordable housing, so I don't think that's an important caveat. It's the public property is used to build affordable housing then it is Cost of the city and we know that we're on housing crisis and this is desperately needed housing as well as public spaces we talked about as we create new affordable housing units will get the chance to enjoy our public spaces parks and open space as if it were their backyard and then we went also preserve up opportunities for public space just as much as we want to do at 8 expedited process to create affordable housing just a few notes about the process so far. I don't need to tell all of you because many of you have been involved in this intimately, but I want to make sure that folks know for the public record on May 1st. We held a special evening public hearing a to listen to the public on all aspects of the plan including the proposed rezoning legislation legislation that adopts and improves the cities application for Surplus Federal property at Fort Lawton. We heard a number of individuals from Neighbors Advocates community members on a both the need for housing and public space and I want to thank everyone who came in and wait On May 21st followed and extensive public engagement process over many years including just over the last year and a half since I've been here and evening public hearing at the environmental impact statement. That was in January 2018. That was only two months after I got appointed or elected. So that was an exciting public hearing to join and then again, he hadn't even on the draft Redevelopment plan the 2019 update in March of 2019 and the multiple housing Health Energy and workers rights committee meetings in April and May there were four of those. So we have heard several presentations a discussions and committee on this legislation. Again, April 16th, May 2nd, May 16th, and the public hearing on May 21st to make it V public Hearing in case anybody wants to see any of those records They are online very briefly. There's a few items that I know our priority for this Council. I want to be receptive to many of the comments and ideas that we've heard some of the things that we've heard where the desire as we've heard this morning for more space for our wildlife and habitat one that we've had is to make sure that we're looking at not just the parking needs a Parks and Recreation that we want to make sure you all have on those needs met but that to the extent that we have Surplus. Surface parking lot. We don't want to preserve that concrete. We want to create a new space for wildlife especially for Blue Heron and appreciate you working with us at the park city of Parks and Recreation to reduce the Parks and Recreation Department's maintenance facility reduce the size of the parking lot to make sure that there's more green space for the habitat and working with you. We have some language that Tracy will walk us through which will help us. I'd direct Parks and Recreation to reduce the parking lot size by at least a third at least 30% and to work with the community groups many of whom have testified from this morning to make sure that the habitat for herons and other Wildlife is part of the planning as we reduce the parking lot size to thank you for that. We've also heard that there's a desire for more homes on site. That was something that came up in the evening meeting and I think those council member O'Brien and someone who are there and I expressed interest in that. We all know that we need more. We want to be clear that on this site given the constraints of the environmental impact study. We have really looked at the maximum amount of housing that we can create also recognizing that is not the units. It's the quality of those units wanted to create family-size units is critical and we confirm that our presentation on May 21st that on May 21st that we are indeed maximizing the number of homes allowable under the is for this legislation. So, yes, we hear that call and we will continue to push for additional housing and other places around the city. Heard on the desire for more buses and school capacity. This is something I know both of us are very interested in as public transit Riders on the ability to increase the frequency at which those buses stop in the area is something that our friends at s. And I would say Metro have heard via that conversation and we also heard it from schools Seattle public schools that there is a process for the starting this additional capacity and they will be working with us to assess has needs as a project moves forward. So today is not the end of those conversations and the issue still resonate and will be working with those partners and finally heard was there is a need to move forward. We should not delay any further. This has been the happening this conversation's have been happening for nearly 15 years and many of the Community Partners Advocates and I would say all of you staff involved here have been working on this proposal since the very beginning. So I want to say thank you to the Friends who've come and test. No matter your position on this issue. We've tried to incorporate many of these ideas. I want to say thank you to specially to Tracy Radcliffe on Central staff has been here since the beginning and thank you for your ongoing work to provide us with analysis. Also want to say a special. Thank you to Kenny Pittman understand that you will be retiring very soon. I E this week, is that correct? My official retirement date is August. Okay is June 11th Okay, Tire and get some R&R and that this will be a great way to celebrate your tenure at the city so good, you know as as you all have been working on this for a very long time as you do your presentation today, let us know how long you been involved. So that folks in the community really have a chance to understand the length and the width The depth in which you've engaged in this project keeps thank you. No matter how many years you been here. But especially to our friends have been working on this for a very long time really appreciate all of you. So with that I'd love to hear more from our friends the city housing Max Jacobs parks department cable Freeman Castle Central staff. We are ready to vote. If you are already to vote we have not heard. I have not heard any comments or questions from other council members your colleagues. So we are actually ready to walk you through each piece of legislation that is in front of you. There's three. I'm only one has an amendment. It is the amendment that you had mentioned that regarding the parks maintenance facility. So if you'd like we can go ahead and begin to walk through the legislation. It's so let me say thanks in advance, but a couple of questions came up from earlier and public comment. And I know we've heard from many people over the years, but I'm wondering if just collectively you could answer the questions. First of all is Discovery Park preserved? Are we eating into the realm of Discovery Park in this project? Secondly, if we did not go through this I go forward with this. What is the federal government do it? Because one of the issues that we've all talked about is an especially for the last fifteen years that the federal government has said these properties to be used for affordable housing or houses in particular and that if we didn't do it, what's the fall back and I'd love to make sure that that's real clear on the record and then at the end of the day when particularly if this goes through that will allow us to put more trees on the asphalt. Adaria that Parks owns now and it what is the net gain in terms of acreage Parks acreage and Lastly we can talk about the school district because my my good friend council member Miss K2 talked about her last year-and-a-half goodness knows the number of public meetings. All of us have attended prior to her being here. And one of the things that I've heard over and over again from the Magnolia Community is why can't we use this for a school? So I've got a couple of answers there. But as far as the athletic fields that we've negotiated with the school district making sure that that is moving forward to one. If you could just speak to that briefly and then we'll dive into the amendment. Why she talks for our lease with the federal government and your discussion to pick up Kenny has really been our Point person in disgust discussions with the federal government about this property. As you're aware that this probably became available to us in 2005. And since that time the federal government has basically been wanting us to move forward with it. I would say about three or four years ago. They expressed a real frustration about nothing happening with it. And at that time they were looking at basically getting an adverse determination, which would then allow them to take the property make it available to the public to be sold under their General Services Administration process. We entered into the lease with them so that we can continue to preserve our rights. And so that we can continue to do what you have before you right now with affordable housing open space at the site and in park and parks department facility there. So if we had not moved and they had issued that adverse determination we would have lost an opportunity to develop this site and I think we saw some of the preliminary plans that were out there looking and they weren't affordable housing and they were a lot More housing in areas that might not have been as sensitive as what we have are developing here as far as preserving some of the some of the original the original plans that were done in 2005 to 2007. It was more of a mixed-income community. So you you had approximately the same amount of total units, but you did not have the number of affordable units that you have now. So one of the biggest changes that you have with the plan is that is more focused on affordable units versus basically market-rate housing. I think the other piece of that is that in the event that the federal government sold the land to the on the market while we can't with certainty predict what the market would do with that. It's possible that they would be developed under existing zoning as single family homes on 7200 sqft lot status so part of the access as the local Redevelopment Authority is that we get to produce a plan that delivers this site for multiple public benefits, including new park spaces. And our lease agreement that we entered into which expires in December of 2021. We actually have some performance measures that we have to hit one of which is that by January wanted 2020. We will have had to apply through this legislation for the the the property and to begin the process of actually negotiating a conveyance of that property. So if we don't meet some of these requirements the federal government could in fact still decide to move forward and to sell the property on the market, so we have a timeline here by which we have to if we want to preserve it for the purposes that the plan articulates. And if I may I'll Circle back to the first question counselor Bagshaw. We're adding to the park. We're not we're not cutting into or adding approximately 13 acres of recreation land. So this is a great win for the community. In addition to that needed housing facilities to be able to address the questions that came out today and just have it all on the record in one place. We last time we had the conversation. We did have a slide up there that showed where this parcel is an adjacent to the existing Discovery Park on and I think sometimes there is a misperception that somehow the housing has been carved out of the existing Park. This would be actually an ad to when we had 60% of the Fort Lyon land then it would be adjacent to the existing public parks you can think of is it as an add-on? Okay, great. I'm so I think the last question from council member back. So I was about the schools. So, you know, we at as I mentioned to this committee previously, we heard a lot of community advocacy to identify a portion of the site that could accommodate schools. We've worked closely with Seattle Public Schools would they have said to us is that they have an educational need for open space? They have an educational need for athletic fields. They have a shortage of athletic fields. And so the partnership of producing athletic fields that were studied under the FBI. And allowing that to be a parcel that is acquired directly by Seattle public school is a win-win between the jurisdictions as well. And I want to underscore what you just said is that this is followed up first of all with a with public request that we have more athletic fields with the school district's request that we do that and I want to acknowledge to on the school board president Leslie Harris that we signed an agreement with them in November of 2017 and I just want to underscore and thank the fact that staff reached out and was working with the school district and we are standing up to our end of the bargain. Wonderful. Thank you so much for those questions and the clarification that you all have provided. Did you want to walk through some of the major components? Sure, I'd be happy to start working us through the legislation. I probably should correct one statement that was made about the fact that we're going to get all this land for free for the housing. We actually are going to get the land for the homeless housing for free the other pieces. We will have to go into a negotiated sale with the with the federal government. So like they have to pay more than zero for that property for some a whole lot less than full price others were hoping to do. I just want to be clear about that. No, just a breakdown specifically. So the homeless housing land is ineligible conveyance under the federal government. It will be for free on self-help the homeownership component that we grew under this plan as compared to the last plan is up to 80% We have an opportunity to actually access that at 100% as well through a petition to the Federal. 80% and 100% of what we could get it up two free. It's not necessarily free, but we will negotiate and make a case as to why it should be free and it is an eligible conveyance from the federal government for the general affordable housing the affordable rental housing. We will through go through a negotiated sale with the federal government for that piece, but it was a critical component to ensure that we were building a mixed-income community with housing opportunities for people at all incomes. The better part of the last 20 years. Is that the mixed income so that we don't end up having an area where people feel like well that really isn't inclusive that's not a community. We want to live in address the budget question and I was the one of the public commenters was saying well, it's way too high we're spending way too much money in contrast to frankly what it looks like and what we can get for it. But I can say is just echoing the comments made by councilmember Mascota is that accessing reduced cost or free land is one of the key ways that we can actually reduce overall cost of affordable housing development. We have a really strong track record of building and investing in efficient high quality affordable housing our city investment to get leveraged by a significant amount of private financing and other public dollars as well. So it is something that our city has pursued for over 30 years and there is nothing about this community that makes it significantly more expensive to develop in we will have some infrastructure issues to deal with that's something that we deal with in our investments across the city and we look forward to not only looking at Cost but remembering that this is really a fair. Housing issue and that cost can't be our only driver for determining where we invest in affordable housing. We have a federal obligation to affirmatively further fair housing by providing housing opportunities in communities that have previously been closed off to low-income people and communities of color. And so part of our Equity consideration is balancing cost in some instances with broader public policy and legal goals statement. I appreciate that and last thing I want to add to this as I have received many calls from constituents in Magnolia, but they why do you have to put that here? Why can't you move it somewhere else and I want to say that as recently as yesterday. I received a call and said this isn't an either-or. It's an and we have to use every possible place in our city to allow us to build this kind of housing to make it as a place where people can go that has up the Vitality of parks. Chester transportation and in that quarter, there's going to be with I hope many many opportunities for us to be able to build more affordable housing especially as Light Rail is coming through so I might just want to acknowledge that we heard I'm really trying to balance but the fact of the matter is there are lots of places and we need a lot more housing thousands and thousands of units to address of people that are already here. Let alone people that want to come in as I've said to people this is not these are bad people are coming. There are kids doing grandkids that want to come back and live excited here Lucian 31887 adopt and approving an application for Surplus Federal property at Fort Lawton including a Redevelopment plan. And this is the piece of legislation that has a man that I've had it out to you. It is almost identical to the amendment that was discussed at our previous committee meeting with a slight change. Language as a relates to a reduction in the parking area and we change the language from saying that the person would reduce it by approximately 30% to a minimum of 30% And that is the only change that this language in on this is ready for you to move cuz we don't have it on the screen so that our community aniline analyzed the feasibility of reducing the Park area for the maintenance building and converting this to open space new language based on usage requirements at other similar facilities Seattle Parks and Recreation determine that it can reduce the parking area by a minimum of 30% The intent is to convert the northern portion of the parking lot to open space approximately 100 feet, but the exact configuration will be determined by circulate by circulation and drainage constraints Seattle Parks and Recreation will consult with Community Partners. Open space at this location that we were able to work with our Community Partners in again. This was one of the ideas that came up at the Seattle channel the beat and happy to have been working with Phil and friends as we got to help two things for this effort to add to that. Okay, let's do that. Let's go ahead and move a minute to resolution 31887 as presented on the proposed amendment that was distributed to members and just because it's an amendment to the attachment one. Okay. All those in favor say aye and nobody so it has been amended. Would you like to have us move this? Yes, I can see now moves. Now. You want to move the substitute attachment 1 attachment 1 of resolution 31887 by substituting version 3 4 version 2 unless you have other apartments that you'd like to share with us. I'd like to go ahead and move final committee vote on resolution 31887 as amended. All those indifferent Novia post excellent. The motion has carried the committee recommends passage and Adoption of resolution 31887 as amended and this will be sent to our full Council on June 10th at for the city council's Final consideration. Great. We should move on to 9510 which is item number 9 on our agenda this bill this bill would rezone approximately a third of the Redevelopment plan area from single-family 7202 low-rise to M1 on that would facilitate Redevelopment of a portion of that area to a multi-family housing will rise to as its own the accommodates a variety of different multi-family housing types, including walk-up apartments and granulated housing like townhouses. So that's pretty much what it does. It's pretty basic bill just by way of reminder Council took action on the under I'm policy here. I'm so years ago. There is in the comprehensive plan a document called the few that the future land use map. And that's essentially the policy map that the zoning map is based on on that policy map shows multi-family zoning at this area currently. Great, are there any other questions about this? Okay, we've done the briefing on all three of these items together repeatedly other questions. Thank you very much. I'd like to move the committee recommends passage of council Bill one 19510 related to the land-use and Zoning amending Pages 52 of the official land use map to rezone property at the Fort Lawton Army Reserve Center. Are there any other comments seeing none all of those in favor of passage of counsel Bill 1 19510 Vaught eye. Sono the motion passes unanimously the motion carries in the full committee will recommend passage of this at our full council meeting on June 10th with this committee's recommendation. Let's move on to the final when this is going to be Council bill when 19535 which is item number 10 on our agenda. And this would authorize the memorandum of agreement between a city and the Seattle School District regarding the development of the multi-purpose athletic fields at Fort Lawton. Appreciate your clarification regarding Tom Plummer backshots questions earlier so that we could all be clear both in this Council on this committee and in community about the process by which we have moved forward with the use of the public spaces to play Fields per recommendation of the Seattle school district. And again, I want to underscore our appreciation for the school district ongoing engagement with us and the community as they continue to hear or see or analyze the need for additional School space. We look forward to working with them. I asked education, especially early learning as a huge priority of all of ours we want to make sure that could always have access to high-quality education from birth through graduation and also for our seniors that will be their ongoing adult education programs as well. As I will be part of I think what the community and visions and some of the community spaces create itself. Thank you for the clarification. Give me the questions on this. A huge thing says I'm coming back. So I'd like to move to Fort Lawton Redevelopment plan application authorizing a memorandum of an agreement setting for the terms of collaboration between the Seattle the city of Seattle and the Seattle School District number one and the Redevelopment of the former Fort Lawton Army Reserve Center any other comments all of those in favor of passage of council Bill 11953 5 or by anybody of this motion carries unanimously and the committee will recommend passage at the full council meeting on June 10th. That concludes our Fort Lawton section of the agenda today and I already said Thank you to your incredible 10-year on Kenny Pittman. Thank you for being here with us and this through this council is Tracy from the beginning cattle. Thank you for your essential staff work on this and for how long I'm pretty new to only 3 years only 3 years. Nearest 15 things to you and your entire team at the office of housing. I've been there with you late nights and the community meetings appreciate all of the engagement that you've done on this issue analysis and the tenacity to keep responding to the newest iteration of EverQuest and changes and engagement with our federal Partners as well. I think this is a great opportunity for us to show what it looks like to put the public space to the best public use parting words on your behalf. I've been on it for over 12 years, but also I want to say that there are a lot of people who are not sitting at this table that got to this point, and I want to express my appreciation to them and my appreciation working with Tracy me to go back to our days on that beat and thank you and I'm looking forward to this. Actually happening. Thank you. I also want to acknowledge the city attorney's office. It's here and they have provided us with excellent advice litigation Support over the years and I'm glad we've gotten it to this point from the office of housing in the audience. Thank you directly. Thank you to you if I was your leadership of the office of Housing and for the incredible team very excited to be working with all of you. So we will see many of you I believe in full council chambers on June 10th. That's just a Monday coming up again. There's three pieces of legislation that we will be a dancing for the full council's consideration and congratulations on all your work. I want to think one more person and that would be Aaron house who has stepped into work with us on to get this over the final passage appreciate all of her work on behalf of our office and the Council of the whole. So, thank you all. I would apply but let you know we got to keep moving. So let's go ahead and move to items. Please read into the record item 12. Item 12. Cancel Bill one 19531 an ordinance relating to housing for low-income households for briefing the send discussion time. I think the microphone may have been off. Okay. So I just just to reiterate if her folks who I think they could hear on Seattle Channel just for folks in here is item 12 related Administration and finance plan for the office of housing which has a longer name. I'm just going to refer to this as our guiding document our moral compass for the office of housing spending that again to turn off the read blinker. Thank you. Yes, we're going to go ahead and add some time. How much time are we giving this item for today? Where to get this item 30 minutes as a reminder to folks we've extended this committee meeting up until 12 today because we have two more of a meeting topics to cover. Thank you so much for joining us here at the council Central staff Emily Alvarado off spazzing Iceland. So very very excited about this isn't something that I've been hearing about for over a year and people have been really thrilled that we have done some tremendous work on city council. For example by making sure that more public land is available for public use to stop selling public property to plug budget hold. Instead preserve got land for building affordable housing. And as we've done that many of our Community Partners have said to us, that's great. But we also need Revenue. We also need policy direction to help make sure that we're building affordable Housing and Community assets at the same time that we're putting forward to the front of our priority list how we're helping to create affordable housing, especially for those at most risk for this place and that we're doing so in a way that builds Community into the housing creation not just reading units, but truly creating Community. This is the second conversation in our committee on the administration and finance plan or the a&f plan. And again, I'd like to just call us Seattle Housing is moral compass document. This is up. This is an update that happens every two years isn't it is an opportunity for us to recalibrate how we administer the city is affordable housing dollars based on housing needs in our community. This is a proposal that is updating the 2019 and 2020. Is housing program your priorities this plan really helps us dictate how we as a city or going to be using housing Levy funds and sent the zoning payments mandatory housing affordability payments as well as other funding sources the city administrators for the creation of affordable housing. My office has heard from a number of community organizations non-profit Partners who actually been engaged in building affordable housing on the ground level organizations rooted in and led by Community is most impacted by housing unaffordability and displacement in Seattle as well as our labor Partners who build housing in Seattle and have I have had extensive conversations with them and based on those conversations. We're really excited to be rolling out. Not just the proposal as it came down, which was great. Thank you Emily and all of your work that you guys did a leading up to this point, but also include the number of key provision based on those conversations that our office has had with Community. I'm just going to flag four of them. I know there's any in almost 20 I want to give huge credit to the Community Partners to come to our office and Aaron house at who's been engaged in creating amendments and thinking through what that would look like with our friends are Tracy Restless here. Thank you and Emily both been great on engaging with us the first supporting Community Driven development and harmonizing the policies with our Surplus land disposition policies that I mentioned we passed last year making sure that we prioritize community-driven project for city-owned Surplus land the second one. I'm excited to highlight here is an ongoing effort from that office of housing, but we're really elevating it in this proposal and giving it a little bit more meat. I think is related to the community preference policy and informative marketing policy that is proposing to update our current practices and prioritize community members through holistic lens looking at historic ties the neighborhood as we create new affordable housing in areas with the highest risk of displacement. For acquisition and when is the acquisition we've talked about this before acquiring existing buildings is being seen more and more as a affordable way for us to get new affordable housing online quicker. We've heard from our housing developers and partners that often the high cost of land and construction can be prohibitive. And sometimes it's more cost-effective to acquire existing buildings. And that's something we're highlighting hear him. And finally we're making sure that we're working towards a comprehensive strategy to advance lever equity in our housing investments customer herbold and I think have some shared interest on that which will be talking about later. I really appreciate the office of Housing and working closely with our office as we've thought through some of these amendments to the proposal and when we talked about investments in a portable housing we often talk about the price. I only mentioned this earlier today. I really want us to focus on not just what the cost is, but how much dollars are leveraged when we build affordable housing federal dollars County dollars and not to focus on the number of you Created for the number of individuals and families that were housing as we think about the cost of housing. It is not 300 or 350 thousand for each of these units of something that's not the amount coming from the city is much much less than that. And I think at a previous committee here and you said around 30,000 or so 30 to 40,000 was coming from the city's portion. But thank you vote on the legislation on the 13th will have a substitute bill that includes as many of the Amendments as we can and will then if we are able to pass it out on the 13th for consideration of potential vote in full Council on I believe June 24th. I am excited about the opportunity to work with all of you on these so Tracy, how would you like to do this you gave us You can walk through if that's helpful for you to do or what would prefer. Sorry a very lengthy memo that I sent you earlier this week. It is attached to the agenda for the public to take a look at it includes issues an option that have been identified by the council members as a result of public comment and Central staff and put it does not include I believe even some late-breaking issues in options that today's discussion. If you would like I can just start to walk through the various issues and I can be as brief. I'm going to be mindful of the 30 minutes I talk fast, but I don't want to talk so fast that you aren't understanding what it is. I'm trying to tell you so you need to let me know if I'm going too slow to fast for you just to remind you. We do have a couple of documents that are in front of you. We have they ordinance that would adopt both the anaplan the 2016 Levi ain't a plan, which actually they anaplan really is kind of includes the funding for the various programs covered by the Levee kind of a brief description and then the seven years old so it's kind of a brief. Document the real I need I think of the policies is in the exhibit B, which is the housing funding policy. So you really have those three documents in front of you and the issues and proposed amendments and options really you will see kind of apply to one of those three documents. So starting off. I'm looking at the first issue which has to do with capacity-building for community-based organizations has expressed interest in so the housing lending policies. Do you commit to working with Community Based non-profit organizations that are culturally relevant and historically rooted in their communities in the development affordable housing and particularly in areas of high risk of displacement in those areas. Just remind folks Rainier Beach a fellow Bitter Lake West Bend Highland. How are some organizations don't have the capacity currently to undertake the work of the building and operating housing that's quite a specific type of activity and specific skills and abilities that are needed. So the first option would be to add language to the proposed ordinance that recognizes the need for capacity-building for these community-based organizations so that we can assist these organizations to become developers and operators of affordable housing. So the first option is to include that language really in the ordinance. So that is the first option that second option would be to not add that language. It's over anybody who's watching this very exciting here right now at home. I hope they are we are following along with the central staff Memo from June 4th at rebuilding for community-based organization bold and I believe are so far to have suggested potential options. I eat amendments. So as we go through each one, I'll have each of us to those in and then folks who have questions or ideas, please chime in as well. I'll just chimed in on this to add really this stems from our conversation with community-based organizations in reviewing the And talking about past work. I'm in talking about how we can best access the Surplus property that was made available through the disposition policies. We passed last year. We constantly heard an interest among organizations particularly and those in neighborhoods experiencing high levels of displacement that they like to get more involved in Housing Development. This is really great. I think when you think about self-determination and Direction and the type of housing that can be created when people have site control I often use El Centro as an example because of the intricate part that's on the outside of the buildings encompassing the plaza. This is truly a place for community and created a public space. So this is amendment hear that is outlined in option A is an effort for us to expand Housing Development recognizing that there is a need for capacity-building acknowledges that this is a tie in with our existing Equitable development initiative, which is tailored towards capacity building for Community groups. the front line of anti displacement work Gray, and how do we just keep going and going to keep your questions or comments? I appreciate it very much. How do we make the decision? I made it. Just what are we thinking in terms of who gets the money? Will that be flushed out later on? How do we do this? Cuz that's only going to be aware as in the legislation that is not going to be committing any funds at this point, We have an upcoming budget process that might allow for that if the council members had a desire to follow it up with actual budget proposal, but it is not that is not included in this. Thank you, and I would like to make sure is brought back into this conversation because the guy and how we spend the money and something is very interested in and we are going to have in my finance committee next week conversation around this. Just want to make sure that it's been coordinated. Thanks. As a recital on the council Bill though. It is underscoring the commitment that already exists in the housing policy. So theoretically it does not it would be up to the office of housing to make a recommendation under its housing funding policy housing could propose something to fulfill but with its commitment as well as The recital well as an executive request in the budget process. I don't think that's what we expect the need for they could theoretically it's might also like so just to be clear about that. Thank you for to make this actionable. This is not a lofty goal that we should put out there and maybe if it revisits four years from now, this is something that is a huge priority for us and I think is shared by the council. So looking forward to working with all of you and don't forget to pull this little cluster. I'm thank you. I I do I do appreciate that and will look forward to working with off the housing and our partners on the 7th floor to see if we can get something in the budget that reflects is priority. Moving station number to so this has to do with funding affirmative marketing and Community preferences policies as we just heard there is a more specific requirements as it relates to from the marketing plans as well as the new ability to impose a committee preference policy in new city funding projects, the successful implementation of an affirmative action plan does involve providing information and a variety of formats to committee members regarding new housing and also instructions on how to actually submit applications for that housing. So existing community-based organizations can be strong connections to the community and can actually help nonprofit housing developers and that process of reaching communities about that new housing. So additional funding could assist these housing providers to more effectively implement the marketing and Kenny Perkins policies. So this option A would add language to the proposed ordinance stating the council's intention to provide funding in the 2020 budget to implement the form of the market and we need preference Palace. I'll just speak to this very quickly. This is an area where we've heard a tremendous amount of interest to make sure that those who are in areas where we see a new development occurring are able to benefit from that development is we think about for example the work that we've done to create more affordable units and fixed-income units think about some of the wonderful places like yesler Terrace and others throughout the city that are now next to the beautiful new parks and Transit will also want to make sure that the folks have been previously there have a chance to really have a chance to come back. This is a little bit unique and how they were able to get folks back in but the concept is very similar. If you were affirmative Lee Market or you provide a community preference, especially in areas where our community organizations are able to work with the community who has historically been there. This is a great opportunity for us to make sure we're not losing community and that people who've been there for Generations are able to stay in place. Again, that's for cset acknowledges that we need to identify funding hopefully in our 2020 budget in the states of Our intention to do so and to really build relationships with communities were experiencing this displacement. So that is seen as a positive and I just would like to add as you're cranky Finance chair that this is we have a 2020 budget we are in the will be in the second year of a budget that we have already passed. So we're going to have to find additional money to do this or we're going to have to discipline ourselves which we aren't really good at. I'm going back and saying there's some other things that maybe we don't want to spend the money on that we want to put here and I do appreciate that and I know you have a challenging task ahead what we all do in the upcoming Finance. She also underscored interested in the press conference that you attended councilmember herbold in terms of our friends and affirmative marketing and I'm looking forward to that partnership and perhaps some of her was playing earlier. There's a chance that this could be potentially rolled in no promises. I'm not and I'm not putting any more and that's that's exactly what we want because if the mayor recognizes and we're signaling to her that this is really important to the council. I know it's important to her as well. So I have her as when she's developing her budget to include this for us to say thank you for working with us exactly as member Herbalife just a little closer as it relates to the funding piece. Can you talk a little bit about how you would see funding specifically for the Any preference policies being used by nonprofit housing providers how I recall that some of the analysis that we've seen demonstrates that the committee preferences would be different in different parts of the city dependent on a sense of space analysis with some of the funding be used to help them do that so that they can design the preference policy. So first of all, executive order demonstrated her commitment to advancing these policies and part of that work is that over the next few months were going to be building guidelines to help flush out what community preference might look like as community-based developers proposed putting Community preference in their development part of that guideline process will really be looking at what is necessary from an implementation perspective to get this right and so through that we Learn more about what community organizations would need to implement this effectively. I could hypothesize for example that people will put additional attention both on the marketing side and the preference side that could look like targeted marketing towards communities that have been displaced targeted Outreach and a work collaboration with community-based organizations who already work with Community who reside there or have been displaced thinking of Social Service organizations or faith-based organizations and figuring out what it looks like to have Partnerships between housing developers and those Community organizations to let people know about the Housing Opportunity and get them prepared to apply when the preference is put in place. So I think that kind of Outreach marketing and partnership hope to be How to do significant data work internally to support communities with internal analysis about what kinds of sideboard City's going to be providing the kind of work. We will do through the guideline process in our hope is that the guidelines get to a place where we really lowered significantly the barriers and work that needs to be done by agencies to implement these policies that's helpful to understand. And then also I've asked this question before I know if I've asked if I just want to get it out there my understanding that preferences can be use not only by nonprofits who are building affordable housing with City dolls dollars, but it can also be used by market rate developers who are have mha set aside performance set aside and MST, is that correct? I think anything's possible, but I think it's probably and you may want to talk to the City attorney on this one, but it's probably an issue of risk and risk assessment. Again, we are really trying to carefully balanced working within the confines of the fair housing act to the extent that there are opportunities to partner with private developers and see how we would launch something like that. I think that's worth in Exploration 3 has to do with the affirmative marketing many preference policies and this actually would just simply as Ben 10 language and this was some of that came from the community that just wanted to lift up the fact that the waist does have a commitment to a family from Italy furthering fair housing to address past discriminatory policies and practices that included government actions. And so this proposal would be just Some of that until I twitch at the very beginning of that section of the affirmative marketing and Community provinces policies is an add-on. Is that what you do and just from that, because I think to a point or earlier does matter right in our Community Partners have identified that is important for us to reiterate why we're doing this. I keep I keep referencing the color of law book that talks about how public policies were really the vehicle that put into place race is redlining race restrictive covenants and exclusionary zoning says we think about what we're trying to do today to public policy its to do that task behavior. And undo that passed law that was created by policymakers of pasta makers. Now we want to fix that. So that's part of what we really want to underscore. Moving to issue number for advancing Equitable development goals and addressing displacement. So the proposed policies for the rental housing and Housing Development on publicly owned sites programs prioritize housing projects that advanced Ecuador development goals and address the potential displacement of tenants for projects proposed in areas at high risk for displacement. There is interest in modifying this language to prioritize projects that are sponsored by local community-based organizations that are culturally relevant and historically rooted and to also give a attic consideration to projects that are receiving EDI funding. So the option in the floor before you wouldn't act add that language into the rental housing and Housing Development on publicly owned sites program policies. Great. So this is an amendment that supports our Community Driven development and harmonizes the policy with the Surplus land disposition policy. As we passed last year recognizing that obtain is a major hurdle to creating community-driven housing Kool-Aid and colocation services like child care and health care and this amendment is intended to strengthen the city's commitment to supporting these projects by prioritizing city-owned land when available the existing language talks about the what advancing Equitable development goals and what you're adding is the who I just want to say for the record. I'm going to keep saying every single project the city has the ability to touch fund or promote should also be included in child care and that is something that works every single time. But thank you for helping. Pepper or those commitments throughout the document Universal Design for seniors. Programming program funding limits. So just remind folks the current and a plan authorizes the used a lot for 30 million dollars in existing Levi resource program funds for short-term loans for the Strategic acquisition of land and buildings for low income housing development or preservation things that he has proposed legislation would actually remove that $39 cap and allow wage to provide up a 30 million dollars in outstanding loans at any one time and the cons of here was as soon as those loans begin to be repaid always will be able to again Loadout up to another 30 million dollars of funding there are several upcoming opportunity to acquire existing occupied buildings, which has better with subsidies that are attached to them that cover the rent for low-income households living in such buildings. The acquisition of occupied buildings is a priority for the acquisition and preservation program and acquiring these buildings will result in the preservation of this housing and in Retention of the federal rental subsidies always has requested that we modify the language and they are positioned preservation program funding to provide loans for this limited vac of acquisition that may arise that would not be permitted due to funding limits for the opposition and preservation program. So the option in front of you would actually add some language to this program to authorize a witch to make loans for the acquisition of one or more buildings with a federal rental assistance contract and to exclude such loans from the 30 million dollar cap for their program. Good idea. Thank you. So we've heard from affordable housing developers that acquisition of existing buildings is an increasingly cost-effective way to increase affordable housing and I think the as you just give us greater flexibility. It was a great thing that I think we got the move this to a rolling amount in the first place and this just enhances that commitment for great specific purpose moving to a new location of community and public services with affordable housing and specific to counselor mosquitoes request for child care and Health and Social Services, which is not mentioned in the current program policies for the rental housing nor the Housing Development on publicly owned sites. It does talk about facilities that include community and public services for low-income families and the council member would like Add specifically in child care and health and human services in the bad language and thank you very much and Human Services obviously includes our friends who are in the Aging and Disability Services world. So as we think about some of the really exciting housing that office of housing has been engaged in do you think of community space adult education classrooms intergenerational programs and really emphasizing where we spend a lot of time which is focusing on child care and access to health services on this is also something that I've heard from some of our federally qualified health centers that they would love to be more co-located where their Community is and it's increase Access to Health Services education and Senior Services seem like a great thing for us to underscore. I know it's every single time we can do a firm what we want to do no matter who's at the stable in the future. This is going to be helpful document the physical design of this is really important. And as we talked about Services really critical as access to the building so that if someone is in a wheelchair if inadvertent design has a 6in threshold and it is just something that we just need to be really intentional about is the thinking if I am Mobility challenged, how do I get in? So if we could as we're thinking about this the services are critical, but I'm also more and more aware of the need to have good Universal Design to four people for strollers Walkers and wheelchairs think you can great number 6 number 7. Yes moving on to the housing first approach for rental housing here a little bit about what the afnf policies and our housing funding policy says they're generally about our funding priorities for house. for aging populations So I'm we have three population priorities for our housing funds and those are seniors and people with disabilities homeless individuals and families and low-wage working people in their families and it is obvious that those are broad categories and there is not much more specificity about particular subpopulations among those groups really what happens is projects that support particular subpopulations come out through the funding round. And so there is a bit of nuance between the policy guidance and then the awarding of funds in the partnership with our community organizations in order to make investments. And so if you look back on a several year. I think you see a balance of Add a mix of project serving various populations in only the last few years. We've made several investments in senior affordable housing at North Haven Filipino Community Village in southeast Seattle serving various populations, and we know even among our intents to apply right now. There is a project that would serve lgbtq seniors in Capitol Hill. There's an intent to apply from a senior housing project sponsored by Ethiopian Community Services in southeast. So we continue to work with Community for them to bring their own community-driven projects which serve multiple populations, but the NF plan is more Broad in its approach expressed to the providers that Surveying are aging populations of priority, but our ability to fund those projects is really driven by those applications that we received and we are leaving it to them to determine what the priority projects are that are are for the broader Community to bring forward to us. If we ever look to see whether or not we're getting the right mix and then maybe do something to try and encourage more of a type of project because I'm I'm I'm hearing that we should be finding more senior projects basically and I'm an in if we're And I trust our nonprofit providers have their finger on the pulse. Oh and what the need is for for housing production, but if we ever find that we're not getting the applications for what we as a city is policy-makers determine is the needs is there a way for us to sort of way in and get more of the kind of projects that we want. Absolutely. So a few responses to that question. First of all, I think our community organizations do have a pulse on the need. I also admit that sometimes applications that come to us change based on what kind of resources are available. So the Federal divestment in affordable housing federal government used to spend a lot of focus on seniors that senior money comes and goes when it comes we are particularly directed with our partners to help produce senior projects because we know what we'd have the specific resources for them. Is true for veterans when we see an uptick in veteran resources available. Then we're able to communicate with our partners come bring some projects that serve veterans. So that's one piece. I think the second piece is that we're also able to direct priorities through our all recipes and strategic acquisition and example. I always bring back the case type but using an application in an RFP there we were able to dictate a population priority around homeless formerly homeless folks a colocation priority around Arts. I can see that similarly happening with various populations including seniors for example, and it helps us be more strategic with geography. Another thing that we can balance both what we know exists in our Pipeline and where we want to be in places like in Magnolia, for example, then we have our nofa and we're all be always able to through our nofa to elevate additional priorities. As well, but it typically takes us working with our nonprofits in our for profits and more of us a collegial way to get to the point where then something elevated in the no-phone could have a response to it. So it happens in all of those multiple ways. Just want to underscore the importance of this issue a thing for us. If we won great example as the senior housing that we all want for the lgbtq community on Capitol Hill and that's something that's been in the works for a while. So, you know as we look at the document if there's other ways that we want underscore that open to having those conversations over the next week. I appreciate your answer Emily in the flexibility and the ways in which you prioritize the especially our Senior & disability population quick Public Service Announcement. I'm going to ask our Council colleagues if it is, okay, if I hold item 11 on our agenda, which is our notice of intent to sell legislation for next week when meeting again on the 13th of June and we do have time on the agenda for it. So we're going to go ahead and continue with the next half an hour on this topic since we are halfway through our suggested items / amendments so we can keep doing issue identification and to the general public issue identification basically means the Amendments would like to add to the piece of legislation. So we are on item number 7 and customer hurled. This is one of the first items that we have to thank you. And this has to do with the housing first approach for rental housing. So the rental housing program includes as we just heard housing for homeless persons and households has one of the several priorities housing first is philosophy or an approach that prioritizes moving people who are homeless in to lower no barrier housing as soon as possible to end their homelessness and then to allow the individuals to focus on other personal goals and issues such as obtaining employment tending to substance use disorders mental health or physical illnesses and other issues that will actually enable them than to remain Stapley house the existing policies for the rent housing program. Do you require providers to provide appropriate levels of support services for the populations that they will serve but did not specifically reference housing first principles as they expected approach hazard lights providing that housing. So option A would actually add some language in the rental housing program. Reference to housing first principles as expected approach to providing housing for homeless populations and would also add a definition of housing first in the definitions section of the housing lending policies. Yes, thank you recognize evidence based practice that recognize is housing stability for people with Behavioral Health disabilities. I recognize that depends on the inclusion of services for their needs without preconditions are barriers and reducing the barriers of our of our own housing that we fund with housing Levi dollars and other public dollars is a recommendation of the bar poppy report and part of our Pathways Home Plan. And so I hear sometimes from folks that people Describe their their housing is housing first, but that they may cut up play fast and loose with some of the principles of housing for so I think just having a good definition for our Community Partners. I think is if it's useful for Saul but there are barriers as opposed to roof a barriers barriers to screening entering into housing and Berry. Thank you for bringing this forward. I think it is important as we said earlier to be intentional about the language that we use and to have clear definition. So I just want to indicate my support for having this be part of our a comprehensive package as we move forward 4 she bring it. Especially thankful for the clarity around the definition. I don't think there is a one of us at this table that wouldn't stand up and say it's it's has sound data behind it. We've have heard so many times from people saying people need housing and that they are readier than you might think they are and if we had barriers like you're saying it becomes more more difficult. So if we can move this whole concept for Incorporated, I think it's very valuable Force. We got Issue Number 8 criminal background checks, which is also tell her her bold. So cities adopt legislation prohibiting landlords from requiring criminal background checks as part of the tenant application process for rental housing unless required by federal law housing providers who receive federal funds are required to conduct such background checks and they are prohibited from providing housing to individuals who are convicted of murder and felony in production or have a conviction that has resulted in a lifetime Sex Offender Registration requirement the policies for the rental housing program require project owners to submit a management plan 200h for approval prior to completion and opening of the housing that they develop the executives proposal Deathstrike references to the use of criminal background checks that's included in the management plan section, but it does not explicitly state that does background checks are prohibited except as required by federal law. So this option would simply add that language in that makes it clear that those background checks are prohibited except as required by federal law. Thank you. So the office of housing prior to passage of the Fairchance housing legislation to done a lot of really really good work with our nonprofit providers to some crates in standard expectations around screening practices. And so that's why the previous language was in in the policies and in the plan we have now since legislated our expectations are related to screening and so this language is simply makes our expectations for our nonprofit providers consistent with that of Thank you for that again. Want to indicate my support for having this be part of our comprehensive package of amendments as we potentially move forward next week. I think it is important to call it out and to be really intentional about that commitment from the council's and cities perspective. We got Issue Number Nine, which is mutual termination agreement policy sell property manager and a tenant can tin can enter into an agreement to mutually terminate a rental agreement prior to the formal and the other rental agreement such agreements may be pursued for a variety of reasons. One of which is to rent the the need for landlord to actually instigator formal eviction proceeding when there have been challenges with the tendency of a resident formal eviction proceedings can cause difficulty for a tenant and impact your ability to secure housing in the future. There is a concern that nonprofit housing providers use Mutual termination agreement without legal justification for evicting a tenant as is required under the city's just cause eviction ordinance requiring that nonprofit providers who use such agreements have a written policy that allows the use of these agreements only when conditions for legal eviction are present address this concern. So the option before you would add language in the management plan section of the middle housing program requiring provider to use Mutual tenant termination agreement to have a written policy. Allows the user agreements only when conditions for eviction might otherwise be active on. I really appreciate the time that Central staff and others have taken to work through this issue with me. It's a complex. This is one of the issues that was raised in the same home report from the Seattle women's commission that sometimes mutual termination grievance are used in a way that's arbitrary and not consistent with the the rule of law and we in no way want to stop these of termination agreement when appropriate because as Tracy has has mentioned being able to usually agree to terminate a tenancy can have benefits both for the landlord as well as tenant and not have a a record of eviction to follow the tenant and the cost associated with the eviction for the nonprofit provider, but we do need to be very careful that again that these agreements aren't being Yes in a way that's arbitrary and that is being used to get rid of a tenant who you know me not be actually in violation of any terms of their rental agreement but is something you know, maybe there's a situation where there's a, you know, a bad relationship between a manager and a tenant and so again, these are not supposed to be used in a way that is abusive and makes already vulnerable tenants more vulnerable. So this would simply require that our providers have a policy for how they use it. Thank you for the office of housing be working to help create template language that can be used in such a written statement issue exactly like on the issue about criminal histories before part of our work at the office of housing is to understand the existing conditions survey and bring together our providers to see what's actually happening with mutual terminations and we would be committed to bringing them together and identifying really what their practices are. What we shared Community believe Falls in that realm of appropriate because I don't think it is clearly defined at this point and it was a successful model that we used on the criminal record working think that by bringing folks together and really understanding more fully the way in which Mutual terminations are used across agencies and maybe even across buildings. So we get a sense of whether there's a Fire Behavior or whether there's shirt agreement on what counts as appropriate. So that's a little bit of a preview of the next amendment that will talk about which will help to study and I understand we don't totally know what the universe is of how many people were landlords are using this. But so that said he will occur and then I think my hope is that sat assist folks and having template language based on those conversations, then we will be able to potentially fulfill the suggested text here in a minute number 9 in a conversation at our next committee meeting on this we can have further conversation for sure. It is specially in just a second. We can have another conversation about amendment 10 which will help us outline. What potential information off of the following will be looking at as a pool together with the study of how frequently this is used. And what type of language might be. A common or desired as this goes forward and maybe not at the next committee meeting, but I would love to talk to you further about criminal background checks at something has come to my attention to different lawyers including the prosecuting attorney of something that's going on for the Washington State Patrol. Is of deep concern to me that the people are being set up convicted and I'm I'd like to talk about this with you just to give you more facts. It's a it's a major concern and I haven't been able to get through to people to say, how is this working? Because when you have a sex offender record that is following you around for the rest of your life it is you know, what's a Beyond Les Miserables sort of situation. So I would love to be able to see what we can do and just to alert you to this and that conversation would be related to criminal background checks more broadly. Not just specific the housing policy. Okay, great. That's helpful for me. A big huge impact on housing. Absolutely. Okay. Thank you. I think council member must get it to your point about a template on the issue of mutual termination. It seems that prior to asking through a management plan people to tell us what they do right is more useful to understand what the best practice is and to drive people to implement towards that. That would be our hope in the way in which we collaboratively guide our partners into a best outcomes can move to item number 1010 has to do with the use of payment plans and mutual termination agreement. So long can tenants that fall behind on rent payments are at risk of being evicted. It's not clear to what extent providers of City funded housing offer payment plans that allow a tenant become current on such payments. So collecting information regarding the extent to which providers are using payment plans could inform future policy development. This area in addition as we just heard collecting some more information about the use of mutual termination agreement. So maybe some best practices are being used by providers if they're using them and the conditions around that could also help to guide for their policy development of maybe template language for folks to use. So this option would add a new section to the proposed ordinance that request oh2 collect information on the use of mutual termination agreement and payment plans by providers A city-funded housing and to provide a report with recommendations to the council by April 30th of 2022 that was raised in the losing home report by the Seattle women's Commission on eviction reform. We do have wonderful new. Game-changing Legend eviction form legislation that was passed in the state legislature that will hopefully result in judges exercising new authority to allow 10 to go into payment plans before facing eviction, but it would be great to see and learn more about what are nonprofit providers are doing to provide and allow for payment plans before a tenant gets into the eviction process to avoid that altogether. So that's the intent of collecting this information. I appreciate absolutely an hour understanding is that the majority of our nonprofits do in fact offer payment plans as a matter of practice and so we would be happy to go through a process to understand more fully how that is operationalized or how that's in incorporated into policy for these organizations and drive to Best Buy, Kansas. Okay, moving on to issue number 11, which has to do with for becoming a policy. So the existing rental housing program policies allow the away stretcher to forward command up to 30% or 8.6 million dollars of the following Year's 2016 Levi rental production and preservation funding to project supplying and for funds in the fall. I notice of pending availability process Daniel know the process does include other fun sources such as cdbg home incentive zoning or mandatory housing affordability funds availability of these funds vs. I can vary from year to year based on federal Appropriations and real estate development activity the current policy for for a commitment only applies 2016 Levy funds and not to these other fun Source has given the potential volatility of these other fun sources including the energy Nova the council could include such sources in the maximum forward commitment amount of 8.6 million dollars council could also consider the possibility of bumping that up a little bit from the 8.6 million dollars that might Plow for a reasonable amount of forward committing of these funds. So the option before he would beat up revise the language as it relates to the forward commitment to include those other funds horses and that 8.6 million dollars maximum amount or Elijah a higher amount. Thank you. So I want and also knowledge that Aaron house is at the table with us and Erin's been working on this plan with us and also hosting or calling our community housing round tables. And is you heard many of these ideas came from our discussions Reckless Community Arizona acknowledge all your work and see if you have anything else you want to comment on specifics of this item. I think for this one just recognizing is Tracy said that some of these funding sources are not as reliable as the Levee and making sure that we just aren't drawing from the next year to find priorities in any given year and create some consistency around that. The station did this we would set up by like a fund a pool a it just like a smoothing know it actually just said sure can actually pull forward from next year's nofa allocation to fund projects in the current. Nova reason of Candlelight has that there have been some for commitments made by the office of housing in 20 million in 2018 and 15 million in 2017. So we know that they have the ability to go up to 8.6 and so they went beyond that was some of these other funding sources and as I thought about this, I was actually the one to raise this to say this makes me a little uncomfortable because these other sources may not always be there to the levels that they are and so is there some reason to maybe put up a bit of cap to clear those other funds horses again, I think you could go a little bit about the 826 and we can talk with office of housing to not preclude them from taking. have some opportunities they might have that just compels them to want to impact you those for the commitments about that 8.69 dollars, but I just think it's prudent policy, especially as we may be looking at a change in the market don't have as many dollars coming in from mha or goodness knows what the federal Appropriations and that situation so Is that you have identified as having already occurred that result in us having fewer funds for this year's Nova and Captain Rex has a question after that to correct. So last year, we made forward commitments to chew projects two of which included a permanent Supportive Housing component to it and our intent was to help both of those more complicated projects a line other kinds of financing that was going to take a longer. Of time. So that means that of the nofo will award this year 20 million. I was taken off the top because it has been previously awarded. However, the units will be counted as having been delivered as part of this year's award. Play we are only going to have about 40 million in the air without that 20. So we're watching the numbers come in still. It's a moving Target. I think it's at this point about 50 and that includes the 20 million. So I'm going to have to excuse myself to get to a 12 meeting. I want to say thank you. One of my favorite phrases of the day was for the community genius. We are coming together. Thank you for all your good work and going back and thank you for your leadership on this council member Miss Kate at council member herbold. I appreciate your however many two decades now, but more more of housing experience. Just one last thing. I'd like to discuss on the acquisition and preservation program funding limit. I'm all in we talked about unreinforced masonry buildings and what we can do to working with our Emergency Management. For the policy say put forward if we can I think that's been identified and the neighborhood of seven hundred buildings that are unreinforced in the city and there's a very strategic number they're focused on but what's up? Yeah, and I heard 63 at any rate there. There are some numbers that we can really be preserving. These buildings are critical. We know that I'm making them affordable to people is important to and working with the ownership. I just like to make sure we don't lose sight of that see how we can work together. But thank you so much for an excellent meeting. I think you have any other questions in the meantime, we will be bringing this back to the committee next Thursday with the help of our discussion and possible vote. I want to just circle back to the questions that were asked about the the why behind this I think this is precisely why I think in the ideal world and hopefully with this year's budget and potential actions, maybe we will be able to Bond against existing sources and identify additional dollars for Capital construction projects and additional housing so that were not in this sort of deficit mentality or scraping for the dollars that we need to build the affordable housing that is ready to go online the list of no fair projects that we see every year is comprehensive. These folks are ready to go. They have Liam they have interest they have Community commitments and what we love to do is make sure you have all the funding possible. So we totally understand why dollars are being looked at for future years to apply to existing list for current years and the two projects that I know have been identified for funding from next year are incredibly important. We also want to make sure that if we do hit a downturn that we're not in a place where we can't respond in so thank you stop at the housing for your willingness to work with us on this amendment and we just seeing you will be working with you all as we think about. National Revenue, so that we're not in that situation very concerning though to see the amount of dollars go from around 95 million in 2017 to 70 million in 2018, and then to potentially hear about the smaller amount of 50 million next year. So I know it's a concern of your all's and were interested in working with you. Thank you for your consideration on this amendment 2. Okay, trying to finish up here quickly. I'm number twelve I'll have to do with the mix of unit sizes and amenities for homeownership project. This really is just adding a language to the Home Ownership program that would promote the development of new home ownership units that includes a mix of unit sizes and amenities for families including large family. So just be adding some additional in 10 language as obviously this is something that weighs a ton of the desire for more 2 3 and 1 day for more four bedrooms. You did a great presentation that showed us how many three and four bedrooms you already have as we think about creating the opportunity from our families to live in the city thinking also inclusively about multi-generational families that are were more likely to see larger nuclear family is from immigrant Refugee families, and this just underscores that commitment that you all have been working on in Concord size is it Moving to issue number 13, which has to do with the Max on the unit cost for homeownership units on publicly owned sites. So the existing policies for the home ownership program just broadly allow ways to fund development of long-term affordable homeownership units always can provide up to $70,000 per unit for one or two bedroom units at $90,000 per unit for three or more bedroom units always has proposed policies for the Housing Development on publicly on sites program would allow a ways to fund the development of long-term homeownership units on such sites that exceeds these maximum amount per unit and does not set a maximum amount. This would be permitted if it increases the number of affordable homes by reducing the number of market rate units needed to subsidize a project or the facilitators faster completion of the project always does not anticipate providing funding in excess of $120,000 per unit historically. We have had a maximum amount for the home ownership program. And so the option before you would be too. In fact, I'll propose that there be a maximum amount of $120,000. Unit for specific way it's a long-term homeownership units that would be developed on Top 40 on sites. And this makes our investments in homeownership. Basically, we want all units in a project to be affordable rather than having to include market rate units in order to make a project pencil out. I think this is a big deal and it also doesn't move us a window from our desire to create mixed-income housing which we also known as a great Community benefit as well. But when we Living outside and I have a not highlighted in the memo. Look forward to talking to you more between now and the next meeting. I might have an interest in doing something similar as it relates to a family-size units of three or more units not specific to the the publicly owned properties, but I am interested in looking at increasing the limit for permanently affordable Housing Home Ownership opportunities serving 80% and below from 90% which is what is that now to a hundred thousand again, only for three bedroom or larger units as we know a family of four currently needs a household income of 110% to afford a mortgage on a $500,000 home. Even with City down payment assistance household income of 90% Is actually necessary to sustain that monthly that monthly mortgage. And so this would make it possible for homeowners at 80% Am I to access funding necessary in those larger family size comes to be able to more likely access the the city's the city funds in order to buy this homes. Thank you customer herbold. I think you and I share a vision on this issue like the underscore for all of my Council colleagues. We do want a deadline of noon on Friday. That's tomorrow with some 24 hours from now if we can work with you on that language that be great so that we have ample time to look for the language to get into law and have a chance to chat. Thank you in advance for the heads up on that and for complimenting our Amendment here. Some of them to I never 14 which has to do with priorities for the Housing Development on pubg on sites. So the current Housing Development coincides program allow weights toward funding from the rental housing program or the home ownership program for site-specific development of publicly owned property these policies that being the rental housing program in the home ownership program. Do you include objectives for projects funded these objectives including the resident population priorities are not reflected explicitly in the Housing Development on pubg on side policies. And so this option would actually revise the housing development of publicly owned side the program to references resident population priorities that exist in the rent in the rental housing program objectives for Resident population priorities in a rental housing program and include these priorities in are publicly owned site projects, you know, just Bears repeating that part of our priority pass. Include homeless families and individuals seniors people with disabilities and low-wage working families and individuals are emphasized that we're emphasizing it. I'll look forward to in the final issue in the memo has to do with Fair Contracting practices and Wendy ululation reporting. So the existing housing funny policies are required housing developers to comply with the city's Fair Contracting policies and are encouraged to increase opportunities for women and minority-owned businesses 14% of the total construction and other contractors Services contracts applies to all rental housing projects that are funded with the city of dollars on the current housing policies also encourage additional efforts to increase women's participation, including mentoring programs and participation and apprenticeship and other training opportunities housing developers are currently required to report on there with the outcomes. Option before you would add language to the housing funding policies to acquire and and report from the Austin housing on the housing developers and their General Contractors that participated in mentoring programs apprenticeship programs and other training programs for the city funded housing projects. And the number of workers served by each of the programs for you to go see Finding housing projects. Mexican purple so this amendment addresses some of the issues that we are hearing from our partners and labor around their hopes for office of housing projects. I think it starts to move us in a good direction just to get a better sense of where at on those projects. I'm further interested in potentially some other reporting requirements that again between now and noon tomorrow, we'll we'll figure out but much like we did prior to creating the priority hire program for Public Works projects. We created a set of data that really pointed to the needs that set of data in 2014 show that less than 5% of these construction jobs were going to Construction workers in the city and we found that out because we required reporting on on that. So I'm interested in beginning to collect some of that information and I don't think the onus would be on the office of housing to collect the information but it was simply be the recipient of the information that the contractors would provide around the some of the demographic information around the workforce on on these projects. So I thank you, And I think this is another area where I'm conceptually you and I have a shared interest especially in every chance. We can lifting up labor standards. I know you would share the effort on worker protections and labor in the past and I'm honored to have the Baton to ask for the labor committee. I'm now and that's why I think it's no surprise that we have a joint interest in this issue for the next 24 hours. Let's work together on this. There's some language that we've been working on as well an amendment that would that would look more broadly. I think signal our efforts to want to look comprehend strategies to Advanced labor equity and our commitment to infusing good living wage job than union jobs in to affordable housing of creation part of this effort. I think we should include a reflection based on the language that we got one. We did the case. I project the kids the city has just awarded that to Plymouth and as we look forward to building Housing we're also looking forward toward building the stronger labor protections into the city funded projects that we are interested in working on would basically direct office of Housing and FAS to do an evaluation of strategies to advance lever and Equity outcomes on affordable housing sites in Seattle, including what we can learn from the case. I project so that there's can be kind of an apples-to-apples comparison of various projects insides and lifted some language from keysight. And you might remember that we included some language in the stands for but it's building Energy Efficiency standards for many of our buildings at City Light. And that was some great languages are some of the Buildings Construction trades so would love to but if there's a way for us to think about the comprehensive analysis that both of our offices with like so that in the future Our office of housing has a report guidelines and evaluation that can help us search strategically advance in our housing projects. We're going to be working with ohsas to determine a time frame on when the data will be available from the case. I twitch I think it's worth coming this summer. More coming soon the report on the probably won't be till the end of the project is not going to be even beginning construction until 2020. So we're working right now is to really figure out what kind of analytical tool is necessary to do kind of data work to figure out what the k site will produce both in terms of benefits to workers and potential costs. And how do we assess those as compared to other Investments were making at the same time and will be working with the trades on that assessment tool and they can be coming to you in 20 20 more when the project is under construction to talk about it since it's already been identified as a pilot project. Also, look at all the other projects that are being built with City dollars Beyond sort of the limited scope. You reference some of it part of what we're interested in is apprenticeship utilisation apprentice apprentice preference preferred entry. Sorry Apprentice preferred entry priority work and utilization women and people of color. So I didn't very similar goals. Let's see if we can kind of harmonize some of our language and see what we can do in the next 24 on some of the Wimpy utilization that we have that's really strong right now far exceeding our existing goals and the work that we've done with our affordable housing developers to make improvements in labor Equity all the time. Will that comes with the 15 amendment that we've heard of so far? I don't have any others. I don't I don't know. If either one of you had any others that you wanted to talk about today ideas and suggestions that you're putting forward an amendment will look forward to working with you for the next 24 hours to get those amendments together as a reminder to the public. We will bring this back on June 13th at our 9:30 meeting. I know right? Okay to be a discussion and possible vote on the administration and finance land and housing funding policies and we will bring back item number 11 from today's agenda, which was the notice of intent to sell legislation for discussion and possible though. It will also have a meeting on June 20th. I'm sorry our next regular meeting on June 20th, and it has been canceled. That's why we're meeting on the 13th. Just a reminder to folks TSA before we go don't leave everybody because we were really exciting special committee meeting is a work session on human service provider inflationary adjustment needs the ways in which we can stabilize the workforce are organizations with the rising cost of property and other For us to stabilize the workforce at 1:30 here in council chambers. Hope you all join us. And with that the meeting is adjourned. Thank you all so much for the housing full-day. Appreciate it.", "end_time": 9300.7}]}