{"format": "raw", "annotations": [], "confidence": 0.9459273726931547, "data": [{"start_time": 0, "text": "Who won today is August 1st 2019 the housing Health Energy and workers rights committee will come to order its 9:03 and I'm Teresa Mosqueda chair of the committee. We are going to be doing today. I'm sure by council members Bagshaw and council members Juarez and probably at the last half of our meeting on the hotel worker legislation was co-sponsor councilmember Gonzalez and perhaps other so thank you all for being here. I just by way of reminder. We do have to sort of sections of public comment today. I know I saw a lot of folks lined up we tried to get you up here as soon as possible. Sorry for folks for waiting in line, but for the hotel worker legislation, that will be the last half of the part of our agenda. So we do have folks who are still walking in make sure you did get a chance to sign up outside. We have to table tents that show the first portions of our agenda today, which our focus on to housing items. It will be a briefing and discussion on the multifamily tax exemption, which is our mfte program and a briefing discussion. Possible vote on the resolution and ordinance that relate to the city's intent to impose a 0.014 6% sales tax and use tax to fund affordable housing and Supportive Housing and this is related to House Bill 1406 which we really appreciate our state partners for passing to make it more possible for us to build the housing that is needed in our city. Those will be the first two components of our agenda will take public comment on those two first. If you don't hear anyone call and you're interested in testifying on the hotel legislation, that will be the third item on our agenda. We will have public testimony right before that. So it gives folks a little bit extra time to get here. And I know that many people have been already waiting in line. So thank you for waiting, but did want to make sure that that was clear. We will have the second part of our agenda on the hotel worker legislation and will do public comment right before we begin that. Okay. Well, those are three items on the agenda. If there is no opposition to our today's oppose agenda so adopted We will go ahead and go into our first item of business which is a public comment and I have two people signed up. I believe there's more folks and potentially signed up that had just come in on housing items that have come in from the outside. So we'll grab those items as well before we close the hearing on this topic the first two people that we have on mfte or 1406 legislation is patience. Melava and Laura Lowe Bernstein. citations Good morning, Madam chair. Thank you for the opportunity to provide comments today as mentions. My name is patience. My lava. I am the policy manager at the Housing Development Consortium of Seattle King County Association of 280 diverse member organizations with each day to ensure that old people have access to affordable safe healthy housing within communities of opportunity and I'm here to speak in support of a implementing House Bill 1406 and the renewal of mmtp. Waysider to see the city move forward the state legislature gave you a tool to begin to recapture portion of yourself text and invested in affordable housing for the next 20. Yes, and we're excited to see the city put the pedal to the metal and really demonstrate the sense of urgency that they prices of affordable housing 2 months as you know, it's one thing to produce the units and it's another to keep the lights. We appreciate that you re solution of intent is geared towards doing both and we support that effort. We AG today to adopt a resolution of intent to use the revenue and the boy name of thority for affordable and Supportive Housing and we also stand ready to work with you and finalizing the ordinance. In speaking in support of the mfte program renewal, we believe that those who work in Seattle those that we rely on everyday must be able to leave in the city as you can see the potential amendments. We encourage you to do a thorough Finance financial analysis of actual development that use the program and ensure a carefully calibrated to the balances public benefit and incentivizes production so that these tool can continue to successfully made the growing need for affordable housing. Thank you. Thank you very much and I'd love to have a copy of your written comments if you can get the chance cuz I think that is our goal. Thank you for coming back. I can feel free to come on over to this microphone if you feel too far away, and I think we have a few more folks buddy. They who signed in for the section as well. So I'm here. We share the cities were an all-volunteer organizing Collective. We advocate for regional Solutions and we will be engaging in Grassroots organizing to support House Bill 1406 in Seattle and Beyond. First wanted to thank you for allocating this money to Supportive Housing and to the operation operating costs. Just like we make sure we allocate money to maintain our bridges. We have to maintain or Supportive Housing stock housing is a right and a public good and we need to treat it that way the allocation of this money will hopefully Inspire other cities across our state to find creative ways to work together to make the best use of these funds other cities will have to do that. They will have to work together. They won't be able to just take advantage of this really by themselves. We really want to emphasize that housing should be a human right and that means long-term public Investments like this one. Additionally we want to thank you for renewing mfte. But we also hope that the city's lobbyist can work in Olympia to extend msee so much longer time frame instead of 12 years, maybe 20 or 30 years. 12 years is not enough time and contributes to housing and security. I know the city can't make this change on its own but the electives here can use their voices and Olympia to explain how the short time on it is hurting our residents. It can be extremely confusing for tenants many of these MST tenants or balancing multiple low-wage jobs and raising children. The way that is calculated the way that they are notified and the way that they have to advocate for themselves leads to convictions and a lot of housing emotional insecurity. Once again, I'm wearing all volunteer group and we're going to be out of heating on both these issues. Thank you so much. Thank you Laura. And if you'd like to share on the mfte and 1406 section of our agenda, this is the housing portion of our public testimony Billy Hetherington and Dale bright from Laguna to 42. Thank you so much for being here bright and early really appreciate it. I welcome Billy. Thank you council member mosquito. Thank you for giving me a time to speak on the issue affordable housing. We all know that this is a hot issue in Seattle in the decisions account. So make some issue with shaped the way the city looks in the future Seattle mfte program makes up a significant portion of the overall State program knowing that the city is bounded standards of the state legislator legislature has established Reed ask the city join join a lobbyist and pushing for language in the state's program to increase labor standards apprenticeship language and wages for the workers on these projects. I wish I was important that these those individuals that build out our city skyline has the opportunity to live and enjoy all it has to offer we are not recreating the wheel when it comes to this notion of high-quality labor standards on MST projects see such as New York and Leia built programs for a win-win for developers and skilled Craftsmen on these projects lastly. We we like the opportunity that you're looking at the sales tax revenue source and using those for Teacher housing. Thank you. We have communicated the desire to add this item to our legislative agenda with our friend Lily. Wilson could a guy who's running? Why are welcomed and always good to see you next see the committee this morning and an asset and it should include prevailing wage in apprenticeship language should mention that people live in Seattle should afford to should be able to live here with people build these projects should be able to live in Seattle also be training the workforce of tomorrow on these projects. We should be trying to access the middle-class careers in the Building Trades on these projects. I'd like to see you that added into these mft programs and I buy should remember the best social program is a job in the middle way middle class career bank account number. So much. Is there anybody else who like to speak on 1406 legislation or the NFC legislation? Welcome. Thanks for being here and just state your name for the record will get you signed in like your plan vs. Plymouth Housing. I mean speak on behalf of myself. And Danny Malone is headed ESC and Company this morning. So we're here to support House Bill 1406. I have a couple of things that we want to add to the discussion in the fact that I'm both of us organizations the two largest organization providing permanent Supportive Housing two people are chronically homeless on our streets and we have a crisis going on. We each have several projects under different Park different stages of development that are going to be coming on board were really excited about that. You won't even do more and so as far as House Bill 1406, we want the council to look at both the capital needs that we have run housing, but also the operating and service needs and if they're just find a balance between those two, that would be most effective. I think you're not involving a soft board. Thank you. I think that's all we need cuz I know how to reach you. Was there anybody else on the housing Fortune? Welcome to go ahead and state your name for the record and I'll send cash right here. The mft program does provides thousands of units of affordable housing within city of Seattle as such should be expanded and protected. There are few issues. I see what the program name ladies rents are rather high and it current MST units 1500 for a one-bedroom is not exactly a fordable is rent runs can increase substantially year-to-year leaving tenants out on the Lurch. There is no like centralized City database of what mft units are available. There's only up 1 PDF print out. And overall the 10-year limitation on the mft program leaves units unsubsidized and I think the overall Sunset. Should be expanded to maybe 20. Thanks. Thank you very much. Okay, thank you all for your comments on mspe, the multifamily tax exemption and a house bill 1406 today will be a briefing in discussion first on those topics first for mft. There will not be a vote today. So your comments are very timely a frost includes some of the ideas that you talked about and then the ideal time frame would be to make a vote on August 15th 8. So please do send your come and see if you haven't already I'm I captured many of these and Aaron house will be back in touch with many of you on some language. So with that sing, no other people jumping up on housing though. I know you all support it. We will move. To our first item of business but it is you could read into the record. And for anybody who is just joining us there is still time to testify on the hotel worker legislation, which will be our third item on the agenda and we will take public testimony just before we get there. I hope my intent was to make sure that people didn't have to get up too early to come sign in for that portion. If you were here for that. I know a lot of people did so I appreciate that and want to be also respectful of your time to get folks out of here on time. We're going to go ahead and move on with our house and Portion and then we'll get to the hotel worker legislation. Welcome everybody at the table and if you can bring them to the agenda item number one, and then we'll do introductions agenda item 1A multifamily housing property tax extension program for roofing in discussion. Well, the brick office of housing Emily Alvarado office passing Wonderful. Thank you. So I Tracy would you like to kick us off here or we'll just very briefly just to introduce the off of the housing that is here today to in fact, I presented the marriage proposal for renewal of the nfte that program does expire at the end of this year. So action is required by the council to Extended should we choose to do so and housing will now talk about the marriage proposal and also get to see the background for folks who aren't familiar with the program. Okay, great rate and Emily. Do you want to thank you very much. So a few days ago, one of the key elements most immediately coming out of that announcement was to renew our multifamily tax exemption program, which you'll learn from Jennifer is one of the highest production affordable housing programs in the city. I'm and we're excited to talk to you about its outcomes and about the proposal. Excellent. I want to say thank you for joining us this morning. Talk to housing elements on the agenda. Good morning. Thank you for having us here. So as mentioned we are here today to talk about the multifamily tax exemption program. We will Begin by providing an overview of the program and current including the results and then go on to talk about the proposed legislation for renewal in general. The proposal for Renewal proposal is renewing the program as is with a few changes to improve it. A quick a little bit of background on the multifamily tax exemption program. It provides a tax exemption on the residential improvements portion of the building for up to twelve years. The city of had the program since 1998 and renewed it four times on the State statue authorizing the program does set some minimum requirements including a set of side of at least 20% on but local municipalities. Do you have a lot of discretion to set other conditions and terms? Overall, this is as Emily mentioned. This has been a high production program. We have a little over two hundred buildings participating in the program for a total of 21684 units of those twenty one thousand units 4455 are affordable to income-qualified households with another 1300 in the pipeline. And I do want to take a moment to note here that the numbers showed on the slide are for projects in market-rate buildings that don't have any other affordability restriction. So there are sometimes projects that use mfte that have other affordability restrictions on these are really for projects that wouldn't have affordable units. If not for the mfte program. In general this program is successfully serving. I low and middle-income households with almost all of the units Irving households between 65 to 90% Ami and not surprisingly most of the production is studios and one-bedrooms is which is what we're seeing in the market overall at one point. Was it between 60 and 80% Ami as that shifted. I know that the the income limits for the program have changed over different iterations of the program. I'm turning to Emily for 2nd May. For the past few years the program has largely been set at Studios one bedrooms and two bedrooms at 6575 and 85% Ami the households have to be below that level. So typically you'll see that for a 65% Ami unit. The person might be hovering, you know around 60 to 63% Ami and this 90% Ami here is for 3 bedrooms, and we have not produced them any three bedrooms. So most production is serving households between that 65 to 85% Thank you for the participation rate for the program is around 44% And that's calculated by taking the number of completed multi-family units number of multi-family units that have completed in the last 3 years and comparing that to the those total number of units that are taking advantage that are receiving tax exemption through the MF to eat program. Great. So in the current program, we require a 25% of the units to be affordable to income eligible household if the building provides a minimum number of two bedrooms than the set aside percentage is 20% and generally that minimum number is around 4% of the total units. And then the affordability levels are very from 40% Ami to for Sea-Doo. So we just talked about this 65% Ami for Studios 75. Am I for one bedrooms and 85% Ami for two-bedroom. If there are questions about what those on income limits are we will get to that in just a couple of slides. This program has been very successful and providing affordable units throughout the city. So we have seen participation in almost all Urban Villages. I the program is available in anywhere that multifamily is allowed. And again, we've seen participation really wherever multifamily development is happening and not surprisingly are the highest level of participation is also where receive the highest levels of multifamily development racial Equity analysis on the program itself to try to assess how well we are matching this opportunity, especially in areas where we see the most need for affordable housing. We have not done that analysis our focus on racial Equity tool kit that was completed about four years ago was specific to how tenants were able to access the unit. So there was a comment earlier about centralized database we did do it to a kid. About affirmative marketing and ensuring that units were accessible to communities of color and other marginalized communities, but not more broadly on program geography. Could you share that with us the for your report from 4 years ago and I don't feel like to see this PDF mentioned. I know it's one of the things I've been asking for is a online interactive tools. So you can find where these mfte units are online, but I haven't seen that yet so you can share whatever you do have with us will do. So this slide shows on market rate rent as compared to affordable rent as well as income limits. I do want to note that this site is using 2017 information both for market-rate rent data, and I'm in command rent levels and the reason we chose to use 2017 information is because that's when we had the best data available on market rate rent. That was the last time to pray and Scott produce their their reports for those of you familiar with mfte income limits. Those are you watching at home? This is going to be different than what the 2019 rent and income limits are so I just want to fly back for folks and we're happy to provide that the updated information. I in general rent by down is $600 for a studio 750 for a one-bedroom in almost 784 a two-bedroom. Again that comparing what market rate rent is. I'm in 2017 versus what the affordable rent was assuming that the tenant paid all of their utilities. So over all this program is producing many benefits. We have affordable rent as you saw it typically hundreds of dollars less than what would be available. I'm in a comprable unit on the market 2 / 4,400 low and middle-income households were providing affordable units and private buildings throughout the city and units are secured for income qualify tenants or tenants. Do you have to show that their income qualified in order to receive one of these units and provide documentation? I want to take a moment to talk about the costs associated with the program. So it's we talked about a property that's participating in this program is receiving a full exemption and the residential improvements portion of their building for 12 years. And there are two different way impacts regarding those cost a portion of those unpaid taxes are shifted onto other taxpayers for a median price Seattle home. The impact of that shift is about $22 a year on the annual property tax bill. Another portion. Another impact is a portion of the taxes are just simply not collected at all on that meaning that they are for gone and in 2019. We thought that there is about for the city experience about 7.25 million and foregone Revenue. Is it $22 an increase over or is that what it is for the meeting Spice House? You said whatever I wish that was our property taxes. So as we considered program renewal our overall assessment was at this is a valuable tool in the toolbox for creating affordable housing. We have a high production affordable housing program that is successfully creating housing affordable apartments for Middle low and middle-income households on between 16 80% Ami and there's a healthy participation rate among private market rate buildings. As a result in our renewal legislation, we really proposed maintaining the program as is so that I can continue to produce those same benefits 25% of the units are required to be affordable to income-eligible households. I'm in again having the same structure where that set aside percentage drops to 20% If a minimum number of two bedrooms are provided. I'm essentially 4% of the total number of units with the same affordability levels. We also propose a few changes to improve the program. One of them is adding a moderator for years where area medium increases area median income increases the amount on the moderator will change the program so that income and rent limits will not increase by more than 4.5% per year or decrease in cases. Where am I would decrease we added requirements regarding affirmative marketing and equal access to amenities which is similar to requirements and other incentive programs like, mha and what we just did in our Administration and we provided flexibility to the program to the deadline for this program used to be issuance of a building permits, which meant that developer would have to decide very early on whether or not they wanted to put We've extended the deadline now to be six months prior to issuance of temporary certificate of occupancy, which really just provides the developer more time. Sometimes several years more to decide whether or not they want to opt into the program and then we made a number of other small changes just to enhance readability. I'm in Clarity and streamline program Administration. Questions not so much of a question, but just recognizing as we had talked the other day that this problem this particular program alone is not going to solve our affordable housing me but it is that you've mentioned multiple times a tool in the toolbox. We want to continue doing it and the sooner the better and the longer the better. I feel like that's a good every time we talk about a housing program. A lot of folks. They will houses going to solve the housing crisis and I think with each one of these tools that were putting in the toolbox or each piece of the puzzle were helping the creator of a broader portfolio. I would agree. This is an important aspect of the entire portfolio that are office of housing has at its fingertips to help and encourage and incentivize the creation of more affordable units, especially as you just saw for middle-income units. I do appreciate the three things. I want to call out. Thank you to the folks in the mayor's office office of housing. App for the language that you included around the moderator the median income moderator. I think we've seen at a mi or the the average median income in our city really be skewed by potentially more folks coming in being able to earn a higher waves. It's great that they're able to earn a higher wage. However, I don't know that is reflective completely of how much it actually cost to rent a unit in the city, especially for middle and low-income folks. So I think that moderator and a cap up 4.5% regardless of the am I increase in those areas is going to be really important and I think that recognizes our growing city which we are excited about but we also need to make sure that it's affordable and to match that growth with an increase in development capacity. So I just want to say thank you for the inclusion of that. I also appreciate the extension of the application deadlines are we know that often developers are telling us that they need more time to apply for mfte and many of our partners would More able to participate if that extension was allowed. So I think that's a good addition as well. Obviously, I'm a huge fan of affirmative marketing and Community preference language. So we're excited to see those components in there as well. Thank you so much and welcome to come to my room. Where as thanks for being here. We're just on the first item, which is mfte and we got a briefing on it just for the our community our community and committee colleagues and I want to flag a few things of interest to me and again my intended to bring this back on August 15th. If we do not have the ability to do a vote on amendments on the same day. I'm happy to look at I'm in September as well. But there's the three main issues. I think I really want to flag for our car our Council partners. And then for the community-at-large when was brought up by our friends at Leona the laborers 242. I think we need to take every opportunity as we have done with each piece of housing legislation. That's come before this Committee in the last year-and-a-half to incorporate. Labor standards, especially since we have an example out of a New York that we can draw from New York recently passed policy which incorporates prevailing wage requirements for a large multi-family residential buildings along side of affordability requirements in exchange for those tax exemption. So we're doing some modeling right now and I'm really excited about looking at that language and strengthening it as you said from former partners in New York at the same time. I think that there is an opportunity for us to look at affordability levels for different sized units to see whether or not we need to make any adjustments. So I'll be doing some research to see for instance. If for some of our developers or Builders a small accessory dwelling units if there is a requirement that the stand-alone buildings, let me say that again we've heard from Builders of a small accessory dwelling units the mft requirements me be such that it's not possible to create stand-alone building with 100% These types of these unit type and we also know that there may be an opportunity to lower the affordability threshold for some unit sizes such as Studios and one-bedroom. I also would love to do more to incentivize the creation of three bedrooms and let's be so bold as to think about 4, but definitely three bedrooms so that we can create more opportunities for families to live here. And with that I think there's some of that, so we've heard today from the Community Partners as well who testified will be looking at some of those ways to strengthen and I think everybody recognizes this is an important tool and we all benefit when we can strengthen it and really direct that public benefit back to the public and ensure. They're also incentivizing development at the same time. So she's trying to strike that right balance, So. Justin from the next steps counseling Brewer's alley member on this project and I will be working with you in the next week. I really probably want to get together with you in the next week to hear of any other issues options. You want to bring up for conversation at the August 15th meeting we do not anticipate actually having a follow the pieces together that we might need to actually a draft amendments on the 15. So I think we are looking at a September date and we'll try to work with you as quickly as we can. Obviously we have for recess in the middle of their Provide some challenges but we will work as quickly as we can to identify the desired amendments on so that for sure in September will be ready to take a vote. And then for August 15th to said we would get to you quickly and hear from you quickly about issues in options. You want to raise up for your colleagues at that meeting excellent. And in order for you to have sufficient time and for us to have a deadline can we give ourselves a deadline of August 8th, that's a week from now for any ideas that we have on mspe to be shared with Tracy and feel free to come to me as well. But obviously if you want to work with Central staff to draft those up, that's the most important thing so that we can then brainstorm before coming back to this discussion on August 15th. She rocks in the road that we haven't discussed today. Is there anything that we need to address frogs? Staff, we always have you no ideas. So we but I don't think any major Retz or things that would give us pause. For example related to the marriage proposal. I think that there are some potential little tweaks that could be done and I will be discussing some of which have been mentioned today and some of the things that we've identified. So I think that my clothes are MSU section. I do want to say thanks again to the executive for her work with this through the office of Housing and for continuing to forward this policy on to council so that we can move forward with this additional to Linn R2 kit and to sharpen it as we move forward to construct to get these pens that I'm making to construct more housing. But that I had one more about the foundation of building house, but I'm going to just leave it there. Thank you so much for being here and we'll move on to item number two. Agenda item number to my solution at 31893 a resolution relating to taxation stating an intent to adopt legislation imposing a local sales in a local sales and use tax at the maximum rate out the rights to fund Investments and affordable an affordable and Supportive Housing for briefings question possible vote. Can we also do two and three together? Did you read those? Agenda item number three cancel Bill one 19590 an ordinance relating to taxation for briefing discussion of possible project discussion about the resolution and the ordinance to implement House Bill 1406. Let's do introductions again, Leslie. Did you want to argue? Kick ass off for Tracy? Are you kicking us out? All right, I will go ahead I will save my excitement and my comments about this for after we got you the presentation but this is really really great opportunity. And as the mayor said that her press conference, this is a way for Seattle to lead the state in implementing this new tool that has been offered to us through 1406. So let's get this kicked off. Wonderful. So now you have done a good job of mentioning the legislation that was passed by the state legislatures this past session that authorized Cessna Revenue Source, we're tickled to have that Authority the legislation that the legislature adopted does require us to both adopt a resolution that states are intent to impose a tax and then an ordinance actually authorizes the sales tax in what you have in front of you today are both those pieces of legislation that we would have to act on as I've been talking about this. I've been reminding folks that this is not a new tax. This is the taxes already been collected. Can you miscarriage symptoms of the revenue how this will get operationalize as we understand it is that we will collect this tax essentially from the state who will essentially not collect a portion of what they have authorized to collect. So the language is very odd and look at this piece of legislation could have been done a little bit clearer. So but it is not in fact, one of the attacks if the consumers will pay it is an existing tax the stable just back off from Collection of their peace and give the remedy to us know because I we do really appreciate the authority to be able to access these dollars. But this is not a new tax that consumers will need to pay exactly if we approve legislation. We would actually plan to begin collecting the tax on October 1st 2019. The amount that we can collect will be based on the amount of taxable retail sales that are generated in the city and fiscal fiscal year 2018 right now we anticipate that might be about 4.5 million dollars a year the tax expires 20 years from the date. It is authorized by the city again, as was stated earlier. The revenue can be used to for the development of affordable housing in that can include the acquisition Rehabilitation or new construction affordable housing and it can also be used. The operations and maintenance cost of new units of affordable and Supportive Housing the housing and services must serve people under 60% of Ami the Steve say legislation and our legislation as well stay our ability to use the revenue to bond against if we choose to do so so that it will be an option that the city has as relates to our going to specifically spend the money. We will in fact continue conversations with them and we expect in the 2020 budget is where we will actually allocate the resources that are authorized by these two pieces of legislation. Sure. I just want to thank you come to my room must get up your partnership on this and the urgency on it blinks sing this as fast as we can get access to this new revenue and also think but the folks in the room come to my rescue. I know you and councilmember Gonzalez for essential for advocating in Olympia our leadership in Olympia with representative. Jim Robinson call mcaree speaker prank shop Senator David frockt, I think four years. We've been talking about wanting to partner better with the state and increasing resources, especially to address the crisis of homelessness and we are now in that space. Where are some of that hard work has paid off and I think that while this tool is available for housing under 60% Ami, this is a very important to a toolkit for the mayor with regards to her commitment to serving those folks most in need to really thinking about this as a source for permanent Supportive Housing with building and operating units if that's Overland and just thinking about what it takes to really make a difference for our neighbors experiencing homelessness. Customer thank you. Very focused on permanent Supportive Housing here or zero 2:30 a m i r have we decided how it's going to be spent. I think the conversation so far have been around permanent Supportive Housing in extreme need for that especially as we as we look around and we know that it's successful. We know that works and we know that we need to build more of it. So again, we do have an ordinance and a resolution in front of us any other comments. I see Emily reaching for a microphone. Thanks for being here again for this portion Emily. Thank you. Just one thing to notice is that part of the history of this bill in the state legislature is that it was in part rewarding local jurisdictions who have already taken action on affordable housing. So part of the reason why our city would be able to access a higher rate of Revenue through this proposal is because we have what's considered a qualifying tax and for us that's our Seattle Housing Levy. It has been a tried-and-true way to deliver affordable housing in the city for nearly forty years. And so we in taking action quickly on this proposal as well are leading in that second way of saying we're going to do the most weekend locally and then we're going to take advantage of new state resources that are rewarding us for taking that local action. Right now just to elaborate on that a little bit and I have a number of things that I want to also Echo before we get to a potential vote today, but I'm really excited about the opportunity for us to move forward today with the intent to work closely with the mayor's office and the office of housing to create a spending plan for this Revenue. We have absolutely as you and I and the entire Council has underscored almost every meeting the need for additional dollars to build housing and as you've heard from our partners at DSC and Plymouth, we also know that as a permanent Supportive Housing there has to be that support of element of it. So I think that there is a general interest in that figuring out what that right balance is and I think there's also an emphasis in recognized and we also need to move forward with construction as fast as possible given the need so fix the finding that right balance of both the support of element and Expediting the construction site as I think where we have a lot of shared interest operating costs as well. Because it's it's pretty fine and people feel great about building the new structure and we don't have identified. LOL today art sorry for viewing audience, which we know is real best and very excited about watching Seattle Channel at 9:30. We are going to continue we were just saying some closing remarks on D House Bill 1406 legislation, which is constable 119590 and resolution 31893 and Hausman bagshot you were in the middle of saying something before that. We lost electricity operating costs. I just want to make sure that as we're going forward that we don't just build and assume that things can continue unless we've got solid operating money and I also want to acknowledge that what you're doing here is a complete concurrence in alignment with what I'm hearing from our Mary court or Superior Court judge that they need to be able in all of the diversion programs that were trying they need to have places where they can have people go with a roof over their head in the sports that they need and without that people write back on. The street so amen and thanks for moving forward on this. Thank you for your leadership on this as well. And your past leadership on bonding $4. I thanks for joining us this morning before we get to vote. Do you have some comments? You liked the sure I would I would just like to express my hope. This may have been addressed before I walked in but expressed my hope that we can look at using this bonding Authority this year. I understand we can't actually Use it until next year but we can do like we've done in the past and basically committed by name generator from The Authority this year is is part part of this year's know. If as part of like a interfund loan so we can increase the dollars that we get out to our nonprofit developers who are ready to build. Excellent any comments on that little bit absolutely. I think he admires committed to urgency and making sure that we put this to work as soon as possible. So I do want to say a few thank yous for folks because we have been talking a lot about this legislation prior to this committee meeting up on the die has in the house committee as well. There's been a lot of our comments that we put out in our public Communications around our an immense amount of appreciation for the state legislators who advances bill and I want to thank the office of intergovernmental relations lead by Lily Wilson code egg on her incredible team and our lobbyists in Olympia who worked hand-in-glove with the co-sponsors specifically wanted to thank you are a representative democracy and representative June Robinson who were the two prime sponsors on this knowledge the leadership of Senator frog Tazewell who really landed a ton of support from the Senate and two Speaker speaker from chop for his work on getting this through as a one of the last item that he did do as a speaker. We've appreciated his leadership on housing as well. So I want to applaud him and also congratulate in the same breath our new speaker Lori Jenkins who got a point of yesterday really excited to continue to work with those State Partners as we advance our joint interest in addressing the housing crisis. So this is a huge opportunity for us to move forward and I appreciate the council's willingness to consider this legislation both the ordinance and the resolution together. We do need to pass the legislation by September 1st to authorize the executive to give a 30-day notice to the Department of Revenue and according to the state statute. We also need to pass the resolution before we do the ordinance. So what we're going to do today with our Council colleagues Grace will be to pass to get resolution first and then we'll do the ordinance and given that we have an upcoming recess which we all really need and we believe in rest and recovery and time off for being with family. Just to take some time for herself. But we're going to do is ideally pass it today. We will hold it for a week as we continue to have conversations with our partners at King County as well. This is an important partnership that we maintain with them as we think about how to access these dollars for our region and recognizing the need that Seattle has to act with urgency and lead by example and given the housing crisis that is largely in the city of Seattle, but recognizing it as a bigger piece of the concerns that the county has we're going to have some ongoing conversations with them over the next week and a half and then ideally we will bring it to full Council on August 12th. So if you want to mark your calendars for that, yes, I am come that and as you said about the county and our regional Partners, I wanted to extend special thanks to Claudia Balducci who is been leading in the affordable housing committee over there. And I know that you have been deeply involved in all that we got some request from her to be as we're moving forward with our own resolution to consider. Also the support for sound cities in couraging them to be able to coordinator perhaps pool the resources. Maybe there's something that we can contribute to that. I'm not sure what that looks like, but her point to was considered directly funding the highest need so she was focused on you know 0 to 30% Ami or at in / 0 to 50% to make sure that we get things spell congested as council member her bolts been pushing. We know we need more in the time that 44000 units every how many years Five years and that's what's a number that Claudia came up with recognizing that that's just a dent and I want to appreciate the Eco Northwest and we saw an individual who just walked in the door that was supportive of the Eco Northwest study for a hundred and seventy-five thousand units over our Tri-County area below what we need that 175000 units to just to come up to level right now with the jobs that are here so we know this is the right direction and having the support that we've had from the business Community to acknowledge that yes, we need a ton more house and we're going to figure out how to pay for it, but this is a good start. Yeah, excellent, excellent. So thank you all so much for all your work on this. We will as a council member Bagshaw has mentioned in council member Herbalife has a little too. We will continue to work with the executive office on the spending plan the right balance in terms of how much were bonding and how much can go into Capital versus operation and maintenance and I think we're all really excited to move this forward. We also know that if we move forward today we can begin to work toward the October 1st date to serve really pull together that's been planning that will be essential. So ever any other comments on House Bill 1406, or otherwise, I should probably read into the record the actual time title for our committee here Starbucks in Milford on the revolution. I like to move the committee recommends passage of resolution 31893 How many additional comments? C9 all those in favor of Revolution 3 1 1 8 9 3 bow tie and raise your hand and you post them just make sure that I have the number, correct. Can you read into the record for me 31893 and to be sent to full Council again on August 12th for a final consideration after we continue our discussions with our County partner. Let's see if we can do that again because we have that the full ordinance the path. I'd like to move the passage of council. The one 19590 are there any other comments all those in favor of the committee the passage of constable 11950 please with I and raise your hand and you post it is unanimous that bill will be sent along with a resolution to a committee for Council on August 12th. We thank you for your expedited work on this both Central staff myself Aaron house and all of the art appreciation to the mayor of the exact 15 and the office of housing. I know this is really exciting day for you as well. So let's get you some more money. Thank you so much. Council colleagues we do have about an hour and a half for this last section on our agenda and we will will I I will be here till noon and I know some folks have to leave at 11:30, which is are normally scheduled departure time. So we are going to go ahead and move into public comment on the hotel worker legislation like we did last time we're going to do a minute and a half for folks. We do recognize that a lot of the issues that a folks are here to talk about potentially will be addressed with some amendments that the the committee is considering today and just by way of reminder. We also have a number of other meetings coming up. So we will have a briefing and discussion today on the other two items that we haven't yet talked much about really related to safety procedures and Healthcare in the future room. Just do a briefing on those first. We will they have a conversation on I really need ancillary business retention items and one of my better. I know I'm forgetting. I don't never want to drink and so we're going to have the discussion over time think you will have discussion today will have a discussion on the 15th of August and then we will have discussion again on September 5th. So there will be plenty of time for public testimony and plenty of time for discussion of amendments over the next three meetings and over the next six weeks. I just want to say thank you again for everybody coming. We know a lot of folks. Oh, not again. What all life has been waiting for very long time so we will get going as soon as we can. I'm a good okay, so I'm not sure what's going on with the Seattle Channel, but since you can hear me Hello. All right. Okay, it says recording in process again. My apologies for the technical difficulties haven't had that happen before so we really apologize. Let's go ahead and get started again. Let's do public testimony. This is a public testimony related to items on the agenda that are that are related to our hotel worker legislation. So we have items for to seven that are related to the hotel worker legislation. I believe I have all of the sheets in front of me and we will do a minute and a half for each person. Please come forward Elizabeth Salgado and Carmen Lopez. Oh, that's okay. You said if I don't cheat? That's okay. Did you did that? I miss you before. Did you want to talk about housing? Okay. Okay. I apologize. Add an Austin and Mike Burnett. Welcome. Thanks for letting sweet today. I'm here representing the West Seattle Chamber of Commerce. We have concerns of the ancillary businesses being added into the legislation. We do have hopes of a hotel a larger Hotel coming into West Seattle at some point with the light rail in the Redevelopment of the triangle, and we'd like to see that filled with an expanding local business or two and with the current expensive whatever $1,600 a month for part-time employees that will literally not allow that to happen. I have to restaurants myself. If one of my Westell restaurant was in a hotel it would actually take the profitability of both of my restaurants and negative just from that Healthcare requirement. So I would really love to see you guys remove the ancillary business aspect from this legislation Mike Barnett followed by Rick Keller. Good morning. Council members has Mike Barnett's Hotel industry since I was 16 years old started out as a front desk agents became a room attendant at banquet server basically any operational area in the hotel till you're considering amendments on to Ordnance is and I'd like to highlight just a couple of items. If I made the conversation that is happening within our community that hotel companies do not care about employees safety and well-being is simply false. We have always regulated work rules to protect employees from injury. It's important to identify exactly what we're talking about penalizing workers who want to work for more hours by forcing companies to paint entire day's work for 1 square foot more than is regulated by lawn. I really urge you to rewrite this section of the lot so that your intent is to protect workers from unintended injury does Jess. Additionally in a couple weeks will be discussing medical references and I respectfully ask you to considering the following Health. Care is an extremely personal matter. But I fear that by dictating employers to provide an amount for a collie your unintended consequences of not get it will result in not getting quality access to care and will actually result in worse coverage for all of us in this room today and not better. Thank you. Thank you. Hello by Rick Keller I am the here on behalf of the West Hill Chamber of Commerce I am the chair of the government advocacy Committee of the slovenly known as Gak West Seattle Chamber of Commerce is the leading advocate for the business Community spanning the greater West Seattle Peninsula. We got Nucor in the port Salty's in the Kenny, but most of our hundreds of members are small mom-and-pop businesses collectively employing thousands. We support the initial intent of council Bill to protect and improve the working conditions of hotel workers, but we objected additional regulations on small family-owned businesses that aspire to lease space in the hotel's Lobby the ancillary Hotel businesses in compliance with the ACA. As a small business person in District, 1 as West Seattle Chamber you the city council Seattle or make you not just regulations, but culture to propose a bill that says it was there to protect hotel workers something that everyone supports and then include language that stifles the Ambitions of small business is either duplicitous owner s or simply bad governance, please don't do this. Please remove ancillary businesses from the bill Hale and then Delano keyboard keyboard roach. Hi. Good morning council members that my name is Jeremiah cell. A. Sorry. I've been in Food Service until about nine years old my uncle owned a small bakery in town. I grew up in I've been working in Seattle for about 15 years in restaurants and the banquet industry helped put myself through college working restaurants and banquets. I got back into the industry shortly after my first daughter was born I could be a daytime father to her at times. I work four jobs to maintain my night and weekend schedule and even though I can work 40 to 60 hours a week. I'd still not be eligible at any specific property for health insurance, which could be trying times when my kid's mom was in between jobs. Army at one point Fresno water hotel. I've been there 13 years number years ago. I also work the deck hotel, which is owned by the same Corporation. They released the restaurant to a smaller company benefits offered to pay everything was drastically different between the nice union job at a hotel and hotel that we stay out there restaurant and I just I want to say that hotel restaurants are key part of attracting guess whether they're operated by the hotel or its management company. Workers meet Healthcare, excluding some pants on subcontracted workers from protection and Health Care requirements. You will encourage Outsourcing which lowers the standards for everybody. Meanwhile hotel are still make, profits off the work provided by the people who work there full Hirsch. Welcome. Good morning. City Council in my name Isabel. Lahela, I wanted to the Edgewater Hotel housekeeping. My question is everything whatever I come is about my panic button because that's why I need it because I'm a salted with a hotel with a her hotel gas. So I'll still look in my shoulder all the time whenever I walk the whole way or I want the home, especially when I'm working at night time. So still there waiting to the court to decided what to give us or not. Give us but this is all I will say is I need this one or house. What can a woman's we need it? This one is because I understand Wonder Hotel manager or hotel. Because the reason we're doing this is because we making good money for the hotel, but we need our protection to so everybody be going good to everybody. This is perfect. We doing good job, and that would give us discount I-24 is I hope the court has been decided for Arsenal. Thank you very much. illiano Juliano he brought. Okay. Let's move to Michael Hirsch Roma. How Roland and then Kimberly spice Welcome Michael. Thank you. My name is Michael Hirsch. And I represent the ownership family of 13 Coins and the ownership group of The Lodge Bar and Grill. We have two impacted properties potentially with the ancillary language. We've absorbed a number of City LED initiatives in our industry that have not that we've not supplied any comment for we've done what we needed to do. We have different margins than Hotel business. We never intended to be in hotel business is hard enough to just being restaurant business. We would like to continue to do that the impacts for us just for our city of Seattle number of employees about a hundred and fifty of the financial impact is going to be about a hundred and fifty thousand to 250,000 if it's left in all all of the initiatives that is mentioned. We would ask that you would consider removing it. We would like to continue. How to serve chicken parmesan at 3 a.m. Most of you have been there for that. We also serve it at 3 a.m. As well as 3 p.m. So, you know come all of those times appreciate our partnership with the city of Seattle, and if we really want to get into the conversation about investment and safety, we would welcome a conversation with City controlled property in Pioneer Square in the safety of our employees as they move around that area. There's a lot of opportunities. Thank you. Thank you very much. Roma Rowland followed by Kimberly spice followed by ending Hi there. Good morning. Good morning councilmembers. My name is Roma Rowland and human resources for over 20 years. The reason I have been doing this profession for over two decades is because I care about people the actions I take every day or for the well-being of our colleagues. I'm here today because I'm very passionate about what you're proposing and I'm very concerned for his consequences. I'm asking you today to please listen to the industry experts who have come before you today and work towards a more reasonable resolution and Q. Thank you very much. Kimberly spice hi welcome. We've seen you. Good morning. Welcome back. Thank you. Alex restart the time, but either thank you. My name is Kimberly spice and I am the owner of biscuit bitch a restaurant with three locations downtown Seattle one of them in the Belltown Inn, and like I said, the last time I was here, I totally believe in taking care of my employees, and I also believe in protections for housekeepers. I stand with the housekeepers and hotel workers and want them to have their protections and Healthcare. I personally provide an excellent benefits package to my staff that includes Insurance retirement plan paid vacations and profit sharing and I'm here to ask you to consider rewriting this legislation to get non Hotel employees and small businesses like mine the ancillary businesses out of it, or at the very least allowing us credit for what we already provide and the autonomy to structure our benefits package to fit our unique industry. Thank you. Thank you very much. Welcome Yen Yen Jing Hong Kong SAR Zhang. And then Stephan Moritz Christian. Good morning. Everyone. Good morning. I'm here today is talking about the loss. We are not asking the money without asking please get us the hell tea because a lot of housekeeping Gatling injury. We are asking though. What time will roll. My family is really asking for it makes the men's management style not pushed a smoking a lot longer by the day by a hour because of weed I heart last stop hurting. So one of the managers say I woke up. I would like to all the times you lied Monifah windy to our healthy is very important because Money is important also, but what about our healthy and safety because it's the work of push that alarm to walking War. They cannot be a life safety because they would need to work faster and more long is not going to be healthy. Please keep this lot don't change that. We really needed protecting for it. Thank you. Thank you so much. Welcome back good to see you again too. And as everybody knows and recognizes a house or a car is a white-hot job and the other everyday we lit like having my kids wipe the bathroom. So we could either calculus times a day it cost the different parts of her body page with all of our housekeeper and the debacle old is very important for our housekeeper and the one day the whole day or time is now the something about the money because of Mount room to give to ask the more pain and a higher risk of Israel. I'll have to press will be a crime in our workplace. So compared to the our health and the money if you to ask the order of all day or type is not in proportion and The law of a 24 actually is a love care and respect the hotel came to our workers. Thank you. Thank you very much. Followed by Jeremy Rowland's and Jenny race-high chiffon. I want to address some of the possible amendments that that are being discussed today on the ancillary businesses work. We're concerned by the new language that we've seen that too many people that really need protections are going to be left out with this amendment and I would say that we're committed to continue working with you and having these conversations to make sure that we we get these definitions right because they are I think a key but you're not really important. I'm going to affect a lot of people on housekeeping safety. I think as you've heard from the folks here today, we're concerned about health and safety and the long-term health of workers and What's the amendment is proposed today? We seem slower that bar and we don't support it. And you know, we we really want to see the protections kept in place the way that the way they are proposed So, yeah, thank you for continuing to work on this and and being engaged in this conversation and and we are looking forward to continuing that but you know, we really want to keep the intent of the initiative right that was supported by 77% of Seattle voters in attack in in intact because that's what the folks in Seattle voted on and abs to send a message if that's what they want. Okay. Thank you. Thank you very much. Should amendments that are available also on our website for anybody watching online. And any of the Amendments that are coming in that are being walked in today are available on the diocese that correct over there funny that there's a pile. Okay. So are there are their handouts available for people? Okay, so, please feel free to take a hand out. If you have not already received that I work for a week Jeremy Rowland's Jenny Reyes and then Amanda Parson welcome. Hello. My name is Jeremy Rowland's. I'm the area engineering and security manager for the Marriott Residence Inn in Moxy hotels downtown Seattle. I work in the hotel industry for 15 years. If you're trying to protect whole hotel workers, and you should protect all hotel workers. If you cannot protect all employees than this legislation is not good for hotel employees must be re-written to be inclusive for all employees legislation sloppy written to single out one Department over another it is unfair to the boat sets time and effort trying to protect one group of workers while ignoring others engineering and security Hotel employees are rightfully upset that you purposely exclude them from your Ordnance. You are creating division amongst co-workers and deciding unfairly that one group deserves considerations. While others do not until ordinances can be written fairly without excluding employees than these ordinances should be put into effect fairness for all employees should be the focus employees that I manage an engineering and security are worried that these ordinances discriminate against them and I agree. Please start over and make ordinances fare for all departments or did I make ordinances at all if you were really concerned about hotel workers say You would have dressed a homeless drug addict problem that my engineering and security staff has to deal with daily. Thank you very much. Welcome back Mase. And then Amanda Parsons. Good morning, and I am that you're pregnant at the Residence Inn center today want to share my experience and specifically to healthcare and workload ordinances. We support this legislation interpretation of our Associates, even before this ordinance our hotel already have guidelines regarding the amount of rooms. And so she can clean giving them more than what they can handle this runner beans servings. According to Brandon Sanderson as a result happiest. No gas coming back mean no business to run. We are aware that give you more than what they can handle will have an impact in their health and safety and as a result, I'm lost no business is one that we take care of our association. They can take care of our guest. There are times more business that you need s Jeanette. Needed extra time and nobody's supposed to do that at our hotel. But if you do you get to pay over time and where Happy to do that but required to pay entire shift overtime, even if an employee gets it the meaning of the word road bike 1 square foot needs to be revised to be equal. In other Industries Healthcare requirements our hotel offer benefits options that are competitive with the market in the portion of the premiums paid by the employer is more than fair and sometimes about what others do Industries offer. Why is the hotel industry the only one being forced to go for the gold standard for Associates in play additional compensation? I suggest that the focus Beach if the towers the type of coverage Welcome back Amanda. Good morning. Thank you. My name is Amanda Parsons, and I'm here to discuss our joint efforts to protect our hotel team members from injury the definition of a strenuous room cleaning includes a change for stay over a room that has not received room cleaning for more than 24 hours to be defined as a strenuous room. I'm asking you to consider amending the time to 48 hours. This would avoid an issue of the actual time. The room is clean. If a room is clean on Monday not Tuesday, but again on Wednesday, it doesn't necessarily matter the time that was cleaned on that day. So as long as it is served I wish to avoid a squabble over the time of day and focus more on the intent of this proposal. I believe a 48-hour amendment to this piece of The Proposal would satisfy that in ten many hotels have different check-in and check-out times which effect this in addition hotels have groups that check in and pre-registered meaning we check them in and have their keys ready for a group arrival in these type of a The check-in time in the system or computer is not necessarily the time the guest occupies the room if a group rewrite the Stars on a Monday night for Tuesday morning early check-in, but the room was clean on Monday, and I occupied until Tuesday you see how all these pieces can cause a lot of unintended work around simply trying to be fair to the team servicing the room again 48 hours in my opinion allows enough. What's ability to alleviate most of these concerns and upholds the intent with all this being said my invitation still stands. I'd love for you to come join me for a detailed tour of how our business works. Thank you. The next person is going to be a Braxton Myers Sean Vic and Joe Orford. Hi, welcome back. Good morning cast members. Once again here representing a first-generation Korean family that owns the Quality Inn and Suites at downtown, Seattle. What I want to discuss today is is basically, you know, what question as to why this industry and why specifically this position is being called out in this type of legislation. It doesn't quite make a lot of sense to to try to force an industry to manage a business in an equitable and and and responsible manner by calling out one specific position within higher City. No one in this room will dispute the fact that housekeeping is in a very very very difficult job. I've been in this industry since I was 17 years old. I've never done anything else in my life. It is a very very difficult industry. No one absolutely no one disputes that however at the same time I have to wonder how and why a city council would consider legislation like this without also extending it to their own employees. Why don't we put pedometers on police officers? And as soon as they walk one step over 20,000 and a day, let's pay them for an entire day's worth of overtime. Why don't we put in? Nation that we feel is going to be effective to manage businesses within the city. Why don't we allow everyone within the city itself to have these types of ordinances and and have these types of restrictions on their employment. It doesn't help an employee. It doesn't help a business. It certainly doesn't help small businesses within the city and I can once again remind you folks that not all the hotels are owned by multinational corporations. We are a small family-owned businesses here in the city as well trying to survive just like everyone else's Welcome and then Joe or Ford if you could line up as well. Good morning, it's Sean work. I'm at the Romeo's Pizza again. I want to talk about this answer right thing. You guys keep bringing this in B work hard for like ghetto everyday and now all the sudden we are the answer a business Romeo's Pizza used to be on Halo location. Lots of people it was there for 37 years until the city ran and eminent domain on us or public good and then end up putting a 27 story building privatized it and try to sell it. So and then for the displacement we have to move up one block up and now I invested every single thing all the sudden you guys are asking us to pay $1,680 to each employee at the cash benefit and putting it on Healthcare and how all the sudden this Healthcare is our job. I mean I have hard time getting health care for myself. We work hard for it. I mean it adds up to around 200 and I think $28,000 for Are my business that's not even the profit I make for a long time. I mean everybody talks about you know, everybody needs Healthcare. That's understandable. So the bigger question is for small business is the model used to be 30 30 30 and 10. So that means 30 and labor 30 in cost and 30 in Lee's and 10% We could do that essentially means if we do million dollars in sales, you get to take hundred thousand dollars home pre-tax just to let you know. Thank you, but you just just to wrap it up you guys change the minimum wage, you know that bright star thing at 40 if you guys want to go ahead and keep doing this. I'm not sure what the city is doing for a small businesses and you run two faces one face. You say you want to help us on the other side. You just going to destroy us I hear you. Thank you very much. Hi, Joe, following Joe is going to be Samir Nassar and Terry welcome back and see you there Terry and then Sean Burke morning. Thank you for the opportunity. I'm unsure Ford Wreckers. The Hyatt Regency Seattle. I've only been hospitalized for less than a year. I've got 20 years in law enforcement last six years had to honor and pleasure serving the police chief. I'm sure speak specifically about 1426 070 section B, which is requiring the hotel's do the investigations of these criminal acts. I think it's the wrong idea. You're not facing that burn on the hotel her to do this with untrained professionals to do these investigations of criminal Acts. And determine the finding as a former officer and chief. I feel responsible. You should stay in the hands of the police department. They have the trained professionals. You guys got a very well trained and professional staffing see how to see the Seattle Police Department what this says the victim enough to investigate an interview with victim has been alleged assault now. She has to go back and get interviewed again, and we lived that traumatic. I didn't see that happen to her if we just take us out of it and leave them has Law Enforcement date of the one interviewer that bake them. They don't get repeatedly violated when I go to tell her story over again, so I think you should reconsider that part of it. Thank you. Sammy or Sumner High welcome. My name is Samir Nassar. I own a hair salon at the Renaissance Seattle over 35 years and I'm here just to say we need you guys to keep my eyes open not to close businesses. So we need all the help we can get if you keep adding little here a little there closest town. That's all. Thank you very much. Terry welcome back Thank you. Good morning. Good morning. My name is Terry. What Euro I have the restaurant in the Sheraton Grand. The only thing I have any correlation with the Sheraton is I ever lease. I've nothing to do with a worker they probably don't even know who I am and I will cuz I'm not going to do the Sheraton we would have separate entity and I'm here to talk about the ancillary wording. Can you have in the legislation? It is not well written you need to remove that the way it's written and I just got to hand out to the new legislation that you wrote and it still not exactly pretty much the same in terms of what we are concerned about. If this nation station goes through the insurance program, you're proposing will kill us just going to set up and you might want to think about how you write these things down remove. Ancillary have nothing to do with the Sheraton except. I'm in the same building, but it's the business. So please reconsider. This gentleman just said if you want to keep us in business. You have to think about praising these differently. Thank you so much for my employees. You have a 58 employee with about 14 employee. No way in the world that can satisfy the ld50 I could fire 8 but I still would be over the ledge. So thank you. Thank you, by the way. I've been doing business in Seattle for 30 years you making it really hard. 2 steel ball put my heart into this. Do we have a Charlie from Renaissance Here Charlie? Okay, or maybe I said the name wrong. Is there somebody from resin? Residence Inn, please come forward if you're interested in speaking or if you don't want to that's okay, too. I didn't mean to call anybody up that might not want to and just state your name for the record. What's my name council member in good morning. Everyone. Thank you for having me here to speak freely on behalf of housekeeping when it's a Seattle Hotel on my name is Maurice and Simon and I'm working there for 25 years. And the reason I'm working there because I've been treated equally for housekeeping cannot make overtime. I think it's like it better than for them. If you guys if with all due respect if you guys want to help you guys need to help everybody the one who doesn't want to make with a time in the one who does because they want to know what to make with that. I'm complaining the crying because they need more money to pay bills to buy food on the table. So since Days Inn, you lost said they cannot make overtime the come to me as a supervisor. A stomach overtime secretly. I can't because I can we please listen to the people the one who doesn't so let that be an open choice for whoever want to make overtime if we can make it the one who doesn't want to make it a choice not to make overtime. That's all I want to say. Thank you very much. Apologies for meeting reading the handwriting wrong. It definitely says Marie, so I apologize for that Don blankney. You're a last person if there's anybody else to did want to testify full free to line up behind on if there's anybody who didn't get a chance to sign in please do sign up and down. Thanks for waiting course. Thank you. Good morning Town Seattle association association of businesses nonprofits and residents about 1,600 different members and we've been hearing concerns about this since Larry business legislation. We have the largest concentration of hotels in the region in downtown Seattle hotels. Have you been hearing today all have small businesses that will be affected by this and we think that those businesses are the lifeblood of the vibrancy of for downtown and we'd like to see if you consider taking that part of the legislation because it doesn't really seem to get at the heart of what that legislation was set up to do so New amendments coming forward, but I don't think that they are also, thank you. Before we close. Hello, Is there anybody else who would like to testify go ahead and come on up and introduce yourself and I'll write your name down here for the record. Hi, good morning. How are you? My name is Jonas how and I have a couple points to make number one? We heard the argument that hotel housekeepers are not worth protecting because not all workers in the city are being protected and we and it's right for the city to protect housekeepers because housekeepers are disproportionately affected by Hotel work and cleaning rooms. And that is why it is the right thing for the city to do to protect just housekeepers in this case and number two to talk about the argument that ancillary businesses are the ones that owned businesses and make the profits off of ancillary businesses and the workers that do the work inside those businesses. And therefore it is a responsibility of the big hotel corporations to provide health care for these workers because I'm going to prop it up with them. Thank you so much. Thank you very much. Okay. We just took public comments on item four through seven on today's agenda. We're going to take these one bill at a time, I think because we do have a lot of content to them after folks in the audience. Again, there's some amendments that comes numbers have locked in this morning that are sitting on the desk there and as Freddy, they did mention to me. They're going to be posted immediately after chlamydia when I welcomed council members want council member staying here comes number herbo concert while we're at Saint Casimir bagshawe, and we'll come to the table dance. I do they could you read an agenda item number 4 for the record, please agenda number item for cancel 11955 for an ordinance relating to employment in Seattle requiring certain employees to limit room cleaning work clothes for streaming employees for roofing in discussion. Wonderful and Dan Heder from Central staff. Thank you for being here with us and working with all the council members on various amendments and for prepping us on two items that will come before us again on August 15th. Just want to confirm in terms of Says are you good with us during one piece of the organs that a time or should we read into the record all seven. I mean 43711 9554 related to protecting employees from injury. And then why don't we have you go ahead and give us an overview before you do that. I will mention this is the seventh time that we're sharing the hotel worker legislation in this committee. I want to think and a bun from the restaurant on Lyons and Seattle Hotel Alliance and Stefan from Unite Here Local 8 and all of your members who've been writing into us and engaging with us as we've been thinking about potential legislative changes. Danny Dan from Central staff has been tremendous to work with and has spent an immense amount of time working with us as we wrestle through some of the suggested policy changes that are coming from community and coming through council members two weeks ago. We had issue ID with possum. Solutions for issues related to workload, which is Council bill 11955 for and also related to work a retention which is one 19556. So today as a reminder, we will go through those possible amendments on those two pieces of legislation. And today we're beginning with 11955 for which is related to work loads and when we do have a sack come back, we will try to get the items that are being considered for a minute on the screens. Everybody can see it and there won't be any confusion. All right, go ahead and Amazon might be helpful to start with a very brief encapsulation of what the bill as introduced would do and then that can queue up a discussion about amendments that comes members may be interested in moving. So in brief the protecting Hotel employees from injury Council bill 11955 for would require qualifying Hotel. Cost to provide employees with extra pay when employee cleans more than an established maximum floor space in any one shift maximum floor space is a defined term. It means 5000 square feet in a in a shift. This amount is reduced in proportion to the number of hours many shift that's less than 8 hours. It's also reduced by 500 square feet. 4 hour shifts that involve 10 or more room cleanings that are considered to be a strenuous room cleaning sand that also is a defined term the the extra pay that is required for any employee who has such a chef with an assignment of more than the maximum amount of floor space is 1.5 times. The employee's regular rate of pay for all the hours worked in a shift. The legislation allows employees to opt-in or opt-out of assignments with more than the maximum floor space. So it's it's up to the employee to decide whether he or she wants to accept Section assignment and the extra pay that would go along with that assignment. It also allows hotels to divide the maximum floor space evenly among multiple employees who are signed in a team cleaning Arrangement. It also allows employees to opt in or out of Team Cleaning assignments. As the chair mentioned at the July 18th committee meeting council members discussed issues that members were interested in seeing worked out as amendments and flowing from that conversation. There are several amendments that were posted to your committee agenda. And then I'd be happy to turn it over to sponsors who want to discuss their Amendment or I can introduce it. However, temperature like here on Council bill 11955 for as just described by and Dan Heder. We do have three amendments and I think we'll just take one of my men at a time. My interest is in having a discussion and then a possible vote on those amendments individually so that we can keep clear what the issues are, but you will see as I Dan mention. I almost said councilmember either again that we are we are intending to try to provide various Paul. Changes to this overall component to protect workers from strenuous situations where they have exposure to work workplace injury and are more likely to have long-term Health complications by wave reminder in this industry. We know that there are higher rates of back injury injury in hotel work than there are for coal miners and construction workers. And so this is really not as we said before I think every council member up here I said, this is not about how do we get additional dollars per hour for workers? This is how do we create a disincentive to work overtime before we begin with the Amendments counselor Gonzalez as a co-sponsor of the Beast legislation. Do you have any other comments on the legislation before we begin only that I think the Amendments that are before us are I think partially responsible to some of the concerns that we've heard, but also I think continue to And work hard towards making sure that we're centering the exact point that you just made around making sure that ultimately the goal here similar to what we didn't secure scheduling is about prioritizing the health and safety of this class of workers that is currently working in this industry with very little protections. So I am excited to have a conversation about these in to hear what our colleagues think. Thank you. Thank you. Are there any other comments from our Council colleagues before we start with them and my discussion? Go ahead, just to once again command and time the workers in the hotel industry who have testified repeatedly and also described eloquently the conditions that they face and I also wanted to thank you notes your local Aid which has done tremendous work over years to bring us to this point. Excellent. Thank you. So thank you for today for getting the Amendments on the screen and for folks who are in the audience. I think that there are still some handouts available, but we will look at amendment number one, which is the definition of strenuous cleaning. I will acknowledge. We did hear testimony today from folks asking for a 48 Hours initially when we did have conversations with both the workers and the industry the 36-hour threshold was identified and one of the things we wanted to do was to be responsive to that initial concern that we heard. So we have drafted the Amendments based on that initial feedback and would be put Forward for the council's consideration striking 24 and inserting 36 hours. I think again one of the goals is to make sure that if a room hasn't been cleaned in over a day, it is more likely to be strenuous cleaning and I also think that we recognize that this is in part and an environmental policy as well when we don't have cleaning on for longer periods of time that could potentially save water as well with fewer tells being washed and Sewer cleaning at cleaning happening. So that's a good thing. But we also recognize we have to make up for that in terms of the type of artwork that is being asked of the workers. So this would help us out with our green cleaning goals. And I think also address that there is additional strenuous cleaning happening here. I'm in the number 1 is what I'm referring to and the sponsor by myself and come to my work and Solace Dan. Did you have other items to add to that summary? Wanting to look a little bit further into the number of hours. 36 hours doesn't make sense to me as somebody who if you go into a hotel one night. Let's say you get there late at 10 at night. You don't listen or Monday night and you check out Wednesday. I'm wondering if it makes more sense to look at like the nights stay rather than 36 hours from one point to what point so I'd like us to give that a little bit more consideration. Don't object to the direction. It's going I'm just not sure that we've landed on 36 hours is making sense. And again the legislation the entire base legislation will be before it's on September 5th. So if folks feel comfortable with the direction that we're headed on amendments or inferior the concept of where the changes headed there is an opportunity to vote today and then to continue working with a cup of colleagues and Central staff in the community-at-large to consider additional amendments at specific to these two. Is today at Future meetings I would I will acknowledge that one thing that I'd be interested in looking at as we move forward is the time of entrance into a room that was brought up today piques my interest but at this point I'm still really interested in the 36th. Number given that it came bows from worker Advocates and from the hotel industry. I think it was a nice balance of trying to respond to those initial concern and appreciate you raising that and happy to look into those questions to come from Emma Gonzalez. Thank you for you in terms of the language that we see an amendment 1 and in light of some of the concerns with her during public testimony and they were hearing from customer Bagshaw around the concept of when does the clock start is I'm going to describe it. Is that something that based on how this language is drafted would be subject to rulemaking. the director roles process This is a good question. I am I would guess that the answer is yes, but I don't honestly know with any I can't say definitively the language suggests that it's more than 36 hours from the time of the cleaning that last happened in the room, but it's possible that the director of the office of labor standards could interpret that and provide an explanation to employers about what exactly it means that is slightly different than that. I can say definitively wanted to make sure that they're what I mean. There's going to be rulemaking process for this legislation just like there is four lots of our legislation. Correct is correct. So the question is what are the things within the legislation that are subject to rulemaking that are in need of additional clarification and interpretation by a director, correct? Yes. Okay, so if we wanted to Make sure that the issues related to win that clock starts. We have an opportunity between now and final passage of this legislation to perhaps work on this language to allow for that additional direction to occur. Absolutely whether or not you explicitly call out that an issue is subject to rulemaking. I'm the director of the last 10 issue and will be issuing rules on many of the items that are included legislation. You could decide to explicitly call out that you intend for the director of Alaska to issue rules that clarify when the clock starts on this particular topic. Okay, I would I would suggest that setting aside the question of how we Define the. Of time. I think Dan's point is that the language that says means the cleaning of could be subject to an interpretation of when the room was last cleaned. And so I do think that there's there's an opportunity for us to learn a little bit more about whether that's the appropriate start time of the clock or weather is check in time. For example, that is a more appropriate time to start that that clock on in terms of that 36 hours. That's about it that it's a day-and-a-half effectively and I and I think that setting aside when the room when the person actually got in the room. I do think the 36-hour seems to be a fair compromise between with the base legislation said which was 24 hours. We're hearing today for the first time which is 48 hours. And so this I think it's up. It seems to be a balance between the two but always happy to to take an additional information to learn more about why 36 hours is perhaps not appropriate by the way. Thank you councilman. I would encourage our colleagues to consider voting. Yes on this amendment and I still support the concept of 36 for the reasons that was just articulated by councilman Gonzalez. I also think that as we originally ruled that this legislation we use these green cleaning list as a 24-hour marker, but it was conversations with the hotel manager is in conversations with the workers that we would learn that many times the room may be clean to 10 a.m. Monday and then 8 a.m. The next day or 8 a.m. Monday and 10 a.m. The next day. So we try to figure out the right sort of a window or Grace. Between 24 and 36 hours giving us sufficient time to write to recognize it might not be exactly 24. I'd still like us to consider moving forward and then having these conversations that the council members of articulated whether it's at that point in time a room is occupied or I'm more flexible time frame is to be discussed. But I agree that this is a good balance and wouldn't hurt to yesco other comments on this. Okay, we're moving right along. I'm going to go ahead and make the motion. I'd like to move Amendment 1 19554 with the number one which amends the definition of strenuous room cleaning to include stay over rooms with cleaning for more than 36 hours. Are there any other comments on all those in favor of amendment? Number one, please? William Richard, and I I need to post any of stanchion. Okay, we have four yeses and when abstention thank you very much, and we will go on to amendment number to we have five yeses. I didn't do you mind if I do this again just for the record for all those in favour. Please raise your hand and say i i n e a post and then all those if Danny when we have five yeses and one abstention. Thank you very much, phone numbers. And I will keep working on that question that you answered. I like the direction. I just want to make sure we get some clarification and just for the record here. We had Amanda Parsons talk about this invite us to come and see the hotel and the issues that she was Raising. So I've already got her phone number contact information if anybody wants to join think you do it. Let's move on to remember to thank you for today prayer for projecting that I'm Dandy want to start with some opening comments on this one. Or do you want me to ask a couple members to defer to the council members if they want to talk about it? Otherwise, I'm happy. I'm in the last conversations. We've had publicly their concerns and I completely concur. That we're trying to do two things one is to protect the workers. The other is to make sure that there is a disincentive to tell a worker at the end of the shifter at the end of 5000 square feet. You must continue working. So I'm after having conversations with many people in the industry. What I'm proposing is an opt-in list similar to what we did with the restaurant secure scheduling so that an individual worker can sign up on an opt-in list and this also addresses the issue that what I'd heard previously is that people want to work overtime in some cases their healthy. They want to work they've got bills to pay and so what my objective Where is to have an opt-in list and if there are lots and lots of rooms that need to be cleaned that day because there's a convention that is moving out and we know that there are going to be additional hours worked that they're essentially being all calls saying are there individual who want to work additional hours that day they could be on the list they might be working. But at the end of the 5000 square-foot day that they could continue working at time and what we looking at time and a half for those individual employees that want to continue working. But the employer would be sending out an all call saying we expect that. There's going to be additional needs for additional rooms and that's what I'm trying to accomplish here. So that it doesn't roll back two minute one of their shift great. Thank you very much are backshot. I want to say thank you for thinking through the concerns with her. We also know from past experience that it's important for people to be able to opt out of that off. You never know what's going on with family. You never know if they've if they're back currently hurts if they need to go pick up their kiddos. What have you so we've included a small section to your amendment to make sure that if a worker is on an opt-in list, they don't and they don't want to work overtime on any given day. They can absolutely Decline and there will be no penalty and there will be no intimidation or assumption that they will have to say. Yes, and I incurred are other kinds of callings to comment on this customer Gonzalez and I have signed on to this amendment with that additional language included and if there's any other comments on this and how it relates to pass work that you all have done that be great comes memorable. Thank you. I also would like to sign on to this moment. This is consistent with the approach that we used in Secure scheduling as it relates to the practice that we wished to discourage in Secure scheduling the practice of clopening having people come in after closing closing shift haven't come in. Also open up a retail or restaurant establishment in that case. And so we were listening to the fact that workers wanted the flexibility to on occasion take opening show chefs and listening to the voices of employers in wanting to be able to to offer those chefs similar to what we heard today in public comment, but we still wanted to hold on to the principle that there should be premium pay associated. With that because it was a practice that we even though we understood the employees in the employers desire for flexibility. But but that we shot we thought there should be a premium pay associated with it. So I'm really supportive of of this approach. I appreciate you bringing it forward and just when I Add my name to the sponsor list. Thank you so much. We will definitely add your name any other comments. I was going to say exactly what council member herbel just said, so I appreciate that my co-sponsoring the secure scheduling legislation that we did a couple years ago spoke up on that on that aspect. So I think it's pretty clear with the intent is here. We want to give folks the flexibility to continue to work overtime. I think it was a comment during public testimony that overtime is illegal. And that is absolutely not true. Overtime is not illegal. Is it illegal to not pay people overtime if you're asking them to work more than 40 hours per week, but this bill doesn't make overtime illegal and I think that's reflected by this amendment which allows employers to similar to in the secure scheduling context maintain a voluntary emphasis on voluntary opt-in list and allows employees to opt into that list with also the understanding that we don't want that list to be Leveraged in a inappropriate way when overtime hours are required or requested by employers of employees, which is what lettuce to the additional language to allow employees to refuse to accept those overtime hours and my only other question here because I cannot recall it in my brain right now is whether or not we have a clear anti-retaliation provision in this bill. I believe we do and I will look through it can be on that. We've been focusing on the little granular details, and I neglected to this morning confirm whether or not we haven't anti-retaliation Claus like we do in many of our other Lira standards around these particular component. So for purposes of the standardization, let's confirm that and if it's not in I think it would be important to incorporate it. Thank you. Thank you for flagging that any other comments on this section here. Okay. Well seeing none. I would like to go ahead and see if we can move count number to would you like to move that or would you like I'd like to move amendment number to to counsel Bill 1 19554 Any other comments? Tignon all in favor of amendment number to PLS ringer rehenes AI there are six eyes there are no no, there are no other symptoms and passes unanimously. Thank you very much, so members and thank you for flagging on the work to do on confirming anti-retaliation language is incorporated as well moving right along protection from retaliation a provision in the bill for it is in section 42 in the bill. That would add a new SMC section 14.27 Point 100 that's notice and posting. Wonderful. So we are moving on to our third item related to this specific topic and councilmember Gonzalez myself and back shot again are putting forward with potential change regarding the overtime pay Dan. Do you mind just Briefly summarize impressed with the current legislation says and then we'll talk about what the amendment says as it relates to overtime calculations. The current bill provides that if an employee works for Works in a given shaft and generally speaking cleans more than 5000 square feet. Then they are paid time and a half for the entire shift whether that be 8 or 9 or 7 hours doesn't matter. It's the entire amount of time that they have cleaned in a shift more than 5000 square feet. They get paid 1.5 times the regular rate of pay. But that's that was our current Legend craft. Yes. That's correct. Did you want to elaborate on that comfortable? Thank you for the reminder. Yes. We are not making these things about it than are so then describe to us with the amendment does so we can talk a little bit more about that would make two changes first. It would say that the an employee who cleans more than 5000 square feet. Have a force base is entitled to a extra rate of pay beyond their normal rate of pay for not the entire shift. But instead for the number amount of time that it took to clean the floor space in excess of the maximum Force pay so that if you clean six thousand square feet you get paid for the time. I talked to clean the last thousand square feet. That's the first change that completed the 5000 square feet. And then to continue where they were given an assignment at the front of the chef that was six thousand square feet and they knew going in that it was going to be that kind of a of a day II change would be to change the additional pay that they're entitled to from one and a half times to three times the regular rate of pay. Bed beyond the 5000 just exactly as you said. It's a little bit of context as well around this before we entertain a comments and questions and potential vote. We did have a discussion about this at our June 27th Committee hearing and I just want to reiterate the intent behind this entire section including the original language around overtime pay and this potential new calculation is to really deter bugs from having to work additional Scott clean additional square footage over 5000 square feet. Are we heard in that public testimony a 2010 American Journal of Industrial Medicine study on occupational injuries and the disparities that we see in the industry the hotel industry where we see employees of hotels having higher rates of occupational injury injury and sustained more severe injuries than other service Industries. In fact, we see at 40% increase in injuries in the job in hotel workers as compared to others service sector workers and the city also noted that this was just comparing unionize sectors if it were Look at a non-union dissectors the study indicates that the race will be much higher for non-union eyes work. So again, the goal heater is not to only consider the additional pay but to try to see how we can use this as a policy decision a deterrent from having individuals be overworked and we recognize that sometimes there is situations which people are asked to work extra sometimes our situations. Like we just a dress with a previous Amendment more people do want to take potential additional shift, but given the high rates of injury the real intent here, I think from a policy perspective is how do we include policy Provisions to deter additional work additional comments on this amendment colleagues that the initiative I want 124 originally had one and a half time pay as premium pay that that was I believe for the entire. Chef and not only for the hours this change has it go to three times the pay but only for the number of hours. I mentioned the additional hours over fear the additional hours. Yeah. I mentioned my appreciation that this policy as it related to the office in West in the ability to opt out of that list as well that it mirrored the secure scheduling practice that also sought to discourage the practice of clopening for safety reasons. I'm so that was a one that was a premium pay of one and a half hours only for the additional time. So I'm I think I'm going to I'm staying on this one because I just I just need to get a little bit more information about why we think that the three times the the pay it's the right number really strike that balance that were that were that were trying to hit between an employer not relying on a policy that overtime is detrimental to employees while still allowing employees to on occasion. Do do the additional work when they choose to thank you. Can't remember her old and we have done a little math with our friends both in the industry and the worker side and customer Gonzalez. I don't know if you wanted to talk about some of the calculations if you want me to have a few things. I was well at you and I have been built in the mouth with some of our colleagues. I'm very Briefly summarize this and then perhaps damn can help us out a little bit as well. So the concept here. Okay. The concept here is if on average we know that a hotel worker earns around $20 an hour if the individual working a full day and cleaned 5000 square feet. We know that offer full-day. That's about $160 if however that individual War to work overtime and clean more than the 5000 square foot. And we did the calculation that's currently in the bill and applied it to the end. Verde basically the rate of pay would be closer to around $300 I believe is what we calculated at the current legislation rate, please everybody do not hold me to these numbers but in Concepts ears over. Why don't we know that this is not the intent is not to reach a certain dollar threshold the intended to have this is the deterrent but if we look at the concerns that we're hearing about how do we disincentivize individuals from having to work more than the 5000 square footage amount? And we recognize that sometimes they may be asked to just clean an extra half-hour or sometimes. They may be asked to clean an extra hour Perhaps. It is a more balanced incentive to encourage employers to only allocate the 5000 square foot. If we are applying the overtime pay for the amount that they are working over the 5000 square-foot recognizing that in those situations there should still be a higher threshold of overtime pay. I'm not just time-and-a-half because often people will write that into their calculation. And we hear more and more even at two times the amount many employers are asking folks to stay and work overtime. We need a disincentive that is enough to indicate that our desire is to stay within that 5000 square foot but also are recognizing the concerns that we heard about having that amount applied over the entirety of the day. So it was an attempt to try to get the right a balance between a disincentive for at being folks being asked to work overtime and also recognized in that if they are it should be applied to the extra hours work comes number as to want. Thank you and Dan if I could get your help on this as well. Thank you. Just just do I want to make sure we're on the right track here. We are communicating on this question and you just want some clarification. So Shuffle the basic ideas. We don't want to be wanted disincentivize over time because we know that there's too much occupational injury in this line of work. So given that. The Baseline I believe the current language in without the amendment with the current language of worker who has only one hour of one hour of overtime to who does one hour of overtime would be paid more than a worker. Who would end up doing 3 hours of overtime. This is the current language without the amendment and I believe with the amendment. It actually means that if you do more hours of overtime you end up coming out ahead as opposed to doing fewer hours of word. I'd be another word what I'm trying to say that it depends on how many hours of overtime you do whether or not you can say that the amended language is better than the current language. Am I right is confusing when I think about it as overtime. It's easier for me when I think about it as the split of time devoted to the first 5000 square feet and then the other amount of time to write. Yes. Going to all happen in an 8 hour. So the way I've sort of thought about it is if in an 8 hour. You do 5000 + square feet of cleaning you're entitled to time-and-a-half. That's the equivalent of getting 12 hours of pay. It is 8 * 1 and a half if in and that's that's under the the as introduce bill before an amendment. I've two scenarios for your consideration with the amendment if the same 8-hour shift is split 7 hours cleaning the exactly 5,000 sq ft and 1 hour cleaning more than that. You would get paid regular time for 7 hours. Tonight would be 7 hours of regular time pay and one hour at three times pay so that's 10 hours of pay. So that's going to be less than the original. Which give you 12 hours. If however it took you only 6 hours. To do the 5000 square feet is another scenario and 2 hours of cleaning beyond the 5000 square feet. Now. It's 6 * 1 is 6 hours of work to x 3 for the extra now you have another six hours of work. Now you've broken even as an employee you get to it the same 12 hours a day, and I don't know how frequently it happens that you can clean 5000 square feet in 6 hours or if it always takes more than 8 hours. I'm just saying this is a this is a logic and that I'm just trying to play out on the Fly here. But just going off what you're saying. Would you just laid out then seems to me that. If we want to disincentivize occupational injury to too much work over a given. Of time or trying to squeeze and 5000 square feet or shorter. Of time seems to me that the amended language set of points towards workers if they want to make more. Extra of the unit or anyting over the 5000 they are incentivized to finish the 5000 square feet as soon as they can. We do, you know over 6 hours other than 7 hours because then the whatever you whatever cleaning you do Beyond 07205 thousand square feet, then you get three times pay. So in other words if our goal is to disincentivize working too hard because you are already prone to stress and injury, then I'm not cleared the amendment help Stewart. Thank you so much for asking that question the other kind of comparison that I'm hoping we can craft either on the Fly here with Dan or maybe a one-pager is to compare to the existing language because I'm what I'm concerned with is that the existing language also provides that Des that incentive for those who may need additional cash to field. Pressure to clean more than the 5000 square foot in a day the way that I had initially calculated it and I see Dan doing the math over here is that if we keep it at one and a half times for anything in the day over 5000 square foot and we apply that to the full hour's worth. Let's say it's a seven-hour day or something like that. If you apply it to the full day the way that I was reading it is that it is an unintended incentive right now for workers to try to get through that and we keep talking about with the worker may want to do I also want to acknowledge that the other policy goal here is to have a disincentive for the employer to require at so I would love to see the math on the current language as well. And I know you have one more comments and let me be before Dan goes into it. You have another, my questions about the amended language does not necessarily imply something to 100% paid in the current language because there are complications that but that's my word. That I don't want to rush into it not knowing which is better and I would also I would prefer to have some guidance from the union and the workers on this and I think the complication your is precisely what Dan said because the metric we're using is not the hours is the floor space anything beyond 5000 and that's where all these variables come in because then it's a question of is a worker of feeling pressure to quickly finish the 5000 square feet and then in fact, but the pace of the word adversely impacting their health.. Because that's much more of a complicated variable than the number of hours. I feel like I'm not clear which way to go if you getting at this moment, I would prefer to abstain. Okay. Thank you handsome I burned and did you have a response to that particular a couple other scenarios, but I don't know if it's I'm 2 2 walkthrough. Then let's go ahead on the one that you canceled out. And then what I would ask is for you to take that document and apply it to us, number. Someone has suggested apply it to square footage potentially as well as the hour calculation you've done so that we can maybe more accurately see the square footage and then for us and then have that comparison document in the future will be helpful before we move on though. Can I just acknowledge our friends from the Magnolia Montessori School? Hi guys. And this is that Magnolia Montessori school, is that correct? Excellent, but we really appreciate you coming by we're working on legislation to protect hotel workers and try to incorporate some amendments that we perform our friends both in the industry and workers the thank you guys so much for coming to get them on TV. Do you see them? How old are you guys? Two-and-a-half to five-and-a-half. Will thank you for coming by by your for very nice. Thank you guys for coming by I appreciate you being here Saturday and interrupt the line of thinking I do appreciate that. And if it doesn't move forward and you're saying I absolutely agree with you will we will do some additional work to run numbers and scenarios by folks who are stakeholders. And did you have anything else on this scenario that I walked through was a couple of different looks at an eight at how an 8 hour day in might be split if if an employee was working a 10-hour day because this is another another way to think about it and employees working a 10-hour day and cleans more than 5,000 square feet. 10 times 1 1/2 times the rate of pay in the end introduced legislation means they would get 15 hours of pay under the amendment if it took eight hours to clean the first 5000 square feet and the next 2 hours the remainder of the 10-hour shift were spent cleaning the however much additional square feet. That would be 8 times under the amendment would be 8 * 1 the regular rate of pay for the first 8 hours or 8 hours of pay and two times three times the regular rate of pay. So that's another 6 hours of pay. So there it's 14 14 hours of pay. So it's it's it's not exactly the same but if it gets to be closer and closer So Cosmo Gonzalez suggest that as we continue to refine this particular policy issue and he would be helpful to have the scenarios. You just laid out in a chart for us to consider. I know that at least a couple of those numbers have indicated that they're likely going to abstain if we decide to advances I think we should have been through it so that it's on the table and we can continue to work through it and and I just and I think there's a couple different policy questions really a play and maybe it's really three with a points that council members want it just brought up and serve as I think about this issue I think about you know, the first policy question being that we don't want to completely Prive policy that will result in zero use of overtime. What we want to do is create a non non Reliance on overtime as a sort of the go to mechanism because we know that that is harmful to the health and safety of workers. And so so I think that's one policy issue. The question is, how do we get there? And I think what we're trying to balance here is how do we create a rubric in terms of the mechanism that is available to us, which is overtime to to to discourage that heavy Reliance on the usage of overtime hours for purposes of getting additional work on time and hours and production from workers in this in this sector. So and I think the other Avenue is is around the that is being flagged by councillors want it started the question around the maximum floor space. And the level that that has been set at and whether that needs to or maybe you're not saying I was hearing a lot of stuff about the maximum floor size is so maybe it's more of a question. Like what are you thinking in terms of the maximum floor size the baby bear using to the maximum floor space? What I was saying is that part of the reason why it's not very clear which is what are the current language is better than the amended language or vice versa is that the metric we're using is not how many hours over a certain number of hours but how many hours over the first 5000 square footage and that's where it's at. I was saying we can we can map out of various scenarios to either of you show. The current language is better or their many language. You can pull out all kinds of scenarios. The question is which is the most typical scenario. Everything we would be advised by workers and the union and if there is any statistical data on them, thank you in advance is today recognizing abstentions mean more questions need to be answered for folks before it comes forward. I would love to entertain a vote on this council member backshots a co-sponsor any final come and have that is so thank you for that. But we've been talking about being advised by the workers. I also want us to be advised by the hotel industry. So we have a better understanding about it does 8 hours equal 5000 square feet. Otherwise, it seems to me there's somebody could actually get done in 6 hours which I find amazingly that somebody could do that. But what happens next and then I also want us to spend a little bit more time for somebody who is opting in on overtime. What does that look like? So if at the beginning of the shift, you know, you want to make some more money you said? Yes, what is that? And we haven't gotten that nailed down yet? So what I'm hearing is some folks who are interested in having a vote and then people who will continue to do work with us. This is a point in time Amendment indicate that we are going to continue to do work on this and that there's questions to be asked about the workers and Industry. My intent is to move forward on a minute. I'm seeing not so I would like to remove amendment 3 which adds additional amendments to the overtime pay requirements for employees who perform room clearing beyond the maximum floor space Second Son second Dead. Are there any other comments all is in favor vote? Aye aye aye post. Abstentions. Okay, great. This amendment has been hung with three abstentions. And with that we will commit to working with all of you and all of you as we look at on the additional calculations Dan. Thank you so much. We have one other a bill that has potential amendments on it. And I know council member runs has a hard stop as well. And we want to make sure to hear from you and comes around back shot before you guys leave. So let's go ahead and introduce for the record item number 510-711-9556 number 5 5 5 6 and Ordnance relating to employment in Seattle Seattle adding a new chapter of 14.29 to the Seattle municipal code for everything and discussion. Excellent. Thank you to that section. If you don't mind grabbing that and then do you have any other opening comments for us on this section? I can provide a brief overview of what the bill would do is to set the table for your consideration of an amendment to the bill would require. Are the qualifying hotels and qualifying? Ancillary Hotel business has a defined term. I create a preferential hiring list of existing employees when the ownership of the business change. Ancillary Hotel business is defined as a business that has a physical Presence at the hotel and either of the following other additional attributes. Either one. It is connected to or operated in conjunction with the hotel is purpose or second one is that it provides services at the building, but in either event, it has to have a physical Presence at the hotel. The bill exempts ancillary Hotel businesses that have fewer than 20 employees worldwide incoming owners must hire from the preferential hiring list for. 180 days starting upon the transfer of ownership. And finally the incoming owner must retain for at least 90 days all employees that were hired from the preferential hiring list during this 90-day transitional. The incoming owner May discharge employees hired from the preference preferential hiring list only when the employer either determines that fewer employees are required or for Just Cause. That's hard and that I cut you off to okay Council colleagues. I want to say thank you to all of you for your feedback on various ideas for policy. I know cuz Norma Gonzalez and I have heard from a number of you and also have been working directly with Community Partners as we try to think about how to strike the right balance and Timmy the right balance means making sure that we're incorporating businesses who truly do provide a service to the hotel gas and recognizing some of those businesses that happened to be adjacent to the the building might not be providing a service to those gas and wanted to hit the right balance of how do we Define ancillary business? So with that in mind, we have crafted legislation, sorry amendments to the legislation and look forward to having a robust discussion about that council member more as I know that you have some general comments on this topic. So I'd love to turn to you first given your tight timeline, and then we'll open it up for additional comments. Thank you. Crystal thanks for accommodating my schedule and let him share we've been going with the domestic Bill of Rights that you pass under your leadership and I have to say that you and Cassandra Gonzalez have the most energetic women that are going to have babies that I've ever seen. So you're certainly making us keep us keep up. So with that there's some general comments. I want to make and then as you know me, I want to be a little bit more in the weeds. Um, I will be abstaining instead of voting. No because I think there's room here to talk more about from the discussions that we've had with labor and the discussions that we've had that the hotel industry everyone. I believe to my knowledge believes in hotel worker safety protection and we want to acknowledge their hard work and we want to honor to work that they do my concern is about the word ancillary Hotel business and I should add that. We've come a long way from the very first definition and certainly what we looked at under the prior legislation or prior other Hotel definitions. Axillary a mess. You know, when you look just the definition means providing necessary support to the primary activities or operation of an organization institution industry of system the development of ancillary services to support its products. And what we know is that a hotel's product is its lodging so I want a definition that I'm in we need a definition that recognizes only the safety of the worker of all workers. What about business common sense and how it's applied fairly and that's been my main concern since we've gone around and around about this particular definition. So when and thank you again for being into the record the actual definition there certain verbs in here that concern me and I'm going to pull a few out and then I'm going to talk in general one thing that concerns me is that when we talked about operator my physical location that is within a hotel as direct interior access to the hotel or both abuts the hotel and is an amenity to the hotel guests. So when I see the word of But I'm guessing that means that that businesses outside the physical for walls of the of the hotel. The other issue is on be a businesses that contract with the hotel first core function of providing guest lodging not all businesses that provide amenities to the hotel contracts with them for guests for obviously the bottom ones housekeeping room service laundry parking that makes sense to me other services concerns me. Does that include the shoe store? Does that include the chocolate candy store? Does that include the hair salon now? This is why I get concerned. We did in the voters overwhelmingly passed I want to for back in November which I supported. We know that it's been through Four Courts now and now it's pending in the Washington state supreme court. And so there's some issues that are going to have that we're going to have to be a dressing down the road. I would just want to add two people listening that this is a very complex and nuanced piece of legislation, but it needs to happen. No uncertain terms. I want today's actions. I believe that some of today's actions are bit premature. I think they're premature and purpose intent an application and how we raise forward. We are looking at pieces of legislation where the base legislation has not been passed. And so what I'm concerned about when I talk about the word premature is this definition is going to be used to encapsulate to make sure the other pieces of legislation that we're going to look at further down the road that these heaux other hotels are other business. Ancillary Hotel businesses are subject to that final piece of legislation. So this isn't just a definition for definition sake it's a definition to capture other businesses as the definition defines and I feel that that's overbroad. I feel that it's Overreaching in to some degree a bit arbitrary. Let me just go back to an example. I've been beating was Labor. I mean with Hotel owners and small businesses and people that would be would be affected by this law. There's a hope there's a couple hotels that own a hotel they own a restaurant but the restaurant is not connected to the hotel and that's a couple of them one is in the same area one is across the street. That means that hotel owner and the fact that they own that restaurant would be subject to this law but the five other restaurants that also provide services not under contract would be subject to this law and that I in good conscience does not make sense. And that's what the Supreme Court I believe would be addressing to I've been finding all of these kind of scenarios Back Bay scenarios where it doesn't make sense and we all know and I would know we have a couple lawyers up here in a council member Gonzalez will catch this as well bad la mama makes bad bad facts make bad law and that's what my concern is not addressing this particular issue though. It is addressing the seven pieces of I-12 for A single subject matter is it is it is that is factually incorrect. Okay, thank you is only addressing whether or not the single subject price you not getting to the Mariner of the substance of the issues that we are legislated currently currently sections about I went to for inner wrist is pending in the other court. You're right. So let me just go back here. I just want to clarify that this there's multiple times you've said that the Supreme Court is going to address the merits of the initiative and that is not what they are addressing. They are addressing whether or not the single subject rule under the Constitution was violated or not. There's corn that is different than whether or not the Supreme Court is going to dig into the details of the merits of the substance of issues that appeared in the complaint filed by industry against the city. You're correct. I'm sorry. What I should have said and I stand corrected is that I want you for was looked at by King County Superior Court the Washington state supreme court the US District Court on the Arista issues and is also the wash State Court of Appeals so you're right. They are not going to address this specific issue, but in general what I'm concerned about is when we raise these issues that this in the hotel industry will come back and I want to make sure that we are not and using these terms arbitrary and capricious in over-reaching that we have something that withstands that kind of purview. So this good legislation moves forward and is applied fairly. That is the point I'm making so thank you. So I feel that this definition is for a larger purpose than just a simple definition. I feel that it's a way it's on its way. This law is on his way to becoming more encompassing piece of pending legislation. That's took to come where we are going to look at applying here other responsibilities and liabilities and costs to businesses that were not required to perform and be responsible for these tasks before I'm concerned about some of the businesses that have brick-and-mortar that are outside of the Is the location of the hotel or simply provides an amenity or a complimentary services does that does not have a contract with the hotel? And I know that there are a few more additions in a menace to come that we will wear that we will be discussing. So I want to thank the chair for giving us room tabs these discussions. So for me I want to abstain because I believe that there's more work to be done but not a whole lot of War my work on the purpose the intent as it's applied to all those that work in the hotel industry and I want to ensure that this definition in this proposed ordinance is not over-reaching arbitrary and unlike the I 124 which is being addressed on the single subject rule in the Washington state supreme court that we don't have it hung up in the court system that we do it right and that is my point Thank you. Thank you cuz memorize and I know you do have to go customer back to also has to go I will have some clarification hear about how these businesses were actually included in the sheet of 124. Begin with I from Dan in a minute and I just want to remind folks we do have in the current legislation a different employees threshold, even though the basis of the definition for ancillary business would continue to apply believe we can continue to look at the difference in employees in various sections. So that's what we currently have but will continue to take your comments into consideration for the next minute. I I want to acknowledge. This is the toughest one and having talked with a number of folks in the industry both workers and the people that are managing and owning the hotels that it is not in any way Our intention to impact Romeo's Pizza. Romeo's Pizza happens to be on the same block. We would not consider that to be a main food or beverage provider to the hotel. It's not my intention anyway to suggest that storyville coffee that leases space at the Hotel would be included in this they simply lease the however many thousand square feet that they have that they're not providing Direct Services to the hotel guests are there for the whole but the public as a whole I want to exclude retail more clearly so that again using the Alexis hotel as an example. The perfumery there would not be in my mind be covered by this, but if we're getting into a restaurant that is inside the hotel are connected directly with Hotel not a door that people walk in and out of but that's clearly part of the hotel that makes sense to me if there are providing room services, and they're doing what would actually be part of a hotel service that said, I think we've got a lot more conversation that needs to happen around here. I felt we came up with a compromise that dealt with many of the things that I've heard, but I also think we've got more work to do here. Thank you and thank you for Working with us on this own language. Thank you for flagging your concerns, even though you have to go and we will continue this conversation. I had council members to the fact that I think my instincts here, although I need to look into it further and talked to additional people is that as it's drafted if it feels over brought to me, I I am supportive his counselor bag shall said of including businesses that they are clearly part of the hotel and is an amenity to the hotel guests, but it looks to me like the sections a i and a small double I go beyond that wear as a triple eye looks looks good as well as well as be so I appreciate What is work on this? I think we're getting close, but I think there might be a little bit more to do. Thank you for articulating. The goal is Gonzales or so. Why is your microphone on council member point of process or are we voting on this? I would like to Google the address again is that we get these two pieces of legislation out in an amended format so that if there are amendments to these two pieces and we will bring them back on September 5th along with the other two pieces of legislation so we can consider any final amendments as a as a amended package, but that's not to indicate a council members one and two other colleagues who had some questions that there wouldn't be the opportunity for additional amendments on this going forward. I think really the intent of the Amendments is to show that there is additional work that needed to be done. We heard clear concerns with the base language that came for Bored and wanted to clarify and at least indicate that there was interest in working on it. So I understand that we have more to say go ahead. So I'm just just maybe just ate some basic facts in basic points as far as my position is concerned because I think My concerns may be quite different than the concerns that that were stated. I I think that I mean obviously all workers deserve all the workplace benefits that the best workplace benefits are available to some workers. So another words don't remember Juarez is correct. Yes. This is not just a definition of a definition Sig. This is a definition in order to clarify in the law. Which of the workers are going to be eligible for Better Health Care benefits and and things that are related to workplace benefits. That is absolutely true. And I don't think that it doesn't he serves any purpose to to present this as just a definition. Obviously. It is a question of what what actually the Lord will say in terms of what workers gain and to remind everybody that 77% of Seattle voters said that all work. Who are you know any way connected to the hotel industry which means retail food and beverage outlets in within the hotel premises should be eligible for all the benefits of a talking about but principally among them that they were concerned about his health care obviously and just for the for the for the businesses who have been you already know what you're still complaining about $15 an hour and also saying that I'm a restaurant why should I pay honestly no, no business has any god-given right to exploit workers? No workers should be exploited all workers should get high-quality benefits and a living wage. And so from that standpoint of any business feels like they should not be paying Healthcare. Then I urge you to join me and fighting for Medicare for all but short of that right now Health Care is going to come from the employer and we will fight for the best possible benefits from employer send it. I don't like that. Let's join together fighting for Medicare for all because that will actually enable workers to get health care to a public service rather than depending on employers but having said that I I actually like that there is an expansive definition of Indus of what businesses were talking about in terms of whether they're operating from a physical location that is within a hotel. So that's Point number of small. I Roman numeral one and then to have direct access to the hotel and then three both about the hotel and motel guests all of this I think is very good clarification and I don't actually agree with the substance of some of the objections that I come up from the from some of the other hotels in Salzburg from restaurant and retail speakers who have been here who say that what I'm not the hotel Lima eligible, but your complete for Cheval just the base. It is all workers deserve the best Ultra and also no business has any god-given right to exploit any work or so. Itself and needs to be set out the door, but outside of that. If you are a business on a hotel premises you are getting business because customers are coming to the hotel so I don't see I don't understand what the logic is of being absorbed from that because clearly or benefiting from being inside the hotel or around the hotel and you're getting the business that the hotel is bringing because their people are coming to stay there. So I actually have no objection to having an expansive definition on clarifying all of that. My specific concern comes from the fact that this amendment says and maybe Dan could shed some light on this And there's a pending question for you, No problem. I just want to clarify that in this amendment verse saying food and food or beverage business, which means retail would be excluded from this where has this is my question. I'm not I'm not making a statement. I'm asking question. Whereas in the initiative that was passed by voters. It didn't say which business is which means all the businesses on the hotel premises would be would have to be eligible for that. Is that is that accurate? Thank you for staying up that question cuz that's exactly what I was trying to orchestrate with Dan to we have that chart that shows what was including the initiative and then what we're proposing and then we'll also would Long Beach and Oakland have considered so perhaps we could walk through that customers want because I think you're getting to the point that I was thinking of as well. How does this compare to the original initiative which Which was us I think broader than people remember to attachment or what was labeled attachment a comparison chart for hotel employees safety protections. This chart is provided as a link to your agenda under Council Bill 11955 sex and it walks through a comparison of how the initiative 124 treated each of a series of policy questions. And then how the introduced at the First Column under eye 124th and under proposed Seattle is on the introduced Bill. How did it deal with it? And then we compare against Long Beach and Oakland, California who have some similar provisions. can you pull up a text with attachment be a and it should be titled comparison chart ancillary Hotel, Arizona. And I've reorganize all my stuff, so I don't know what it's on the timing behind you. Thank you. Thank you. The good news is that it has the same squares that I wanted to talk to you. So I think that's why I was confused. My apologies to the initiative. Define Hotel. Broccoli, it didn't have the term. Ancillary Hotel business. The definition for hotel included the same words that we are now using for a Define term. Ancillary Hotel business just about so you can see that it is any contract at least or sublet premises that is either connected to or operated in conjunction with a building's purpose or providing or provide services at the building that proposed legislation defines an ancillary Hotel business to be that Sam subset of a definition that in the initial applied to a hotel the one minor in my mind, but maybe not on your distinction is that where is the initiative said the building's purpose because it was talking about a hotel. We now say the hotel is purpose because we have a separate entity the ancillary Hotel. Can service want me just to clarify to everybody's listening. So you are saying that the existing language in the bill that the council is considering is very similar to the language was passed by voters except for that building Spurs versus hotels purpose and I I don't want to speak for the sponsor is but I believe the intent of the amendment was to provide some clarification and limiting not further broadening the application of what an ancillary businesses and to provide a little more Direction about who qualifies and under what conditions And as one of the co-sponsors, I think that's an accurate description of the purpose of the the the purpose is to create a clear Nexus between the types of ancillary businesses that are located within a hotel or or served as I've described it on the property footprint of the hotel that are truly an amenity to the guests that are staying there. So it's building on the concept that we recognize and we've heard from from many folks that hotels Hotel owners design their property and they have control over how they designed those properties including whether or not there's going to be doors in certain places. And what we want to be able to do is recognize that hotels and hotel owners and management still are making the decisions as to how they Places are designed for what purpose of the spaces are designed and who ultimately they're going to rent that Space 2 and that's a direct benefit to the hotel owners into the guess that will be staying at the hotel all for the purpose of encouraging more people to become gas at those Hotel. So he's going to websites for hotel, which I've been doing a little bit of myself lately is you will always almost always find a section that says dining for example, and that is on the hotel website and even though that you might have to walk out of the main entrance of the hotel and down the street a little bit it is still on the same in the same building effectively and it is still being built as an amenity to the people who stay at the hotel so that I think the intent is to capture those types of ancillary businesses that are clearly intended. To prove to be an amenity to the people who are staying at the hotel and her being characterized as such and and that amenities being facilitated by deliberate decisions be made by designers of hotels and owners of hotels to create those kind of spaces as a sort of the evolution of this business model. That's what I have personally experienced in staying at a lot of hotels what I have heard from Folks at Unite Here both here and in Long Beach around how a lot of these facilities are or actually designed, and then hope that we can close up this discussion Sunday today. It's not a debate and we're just discussing one of the goals that I'd like to underscore for our Council colleagues is the business model that we've seen more and more of Contracting out what had originally been considered kind of a core service a core service of either a bar or coffee shop or restaurant that had otherwise always been part of a hotel. I'm simply trying to put up maybe a wall up between the entrance is what the amended legislation it acknowledges as well. We don't want to facilitate or encourage people to put a wall up between what was otherwise an entrance into a coffee shop or a bar and recognized it sent in some cases not all but in some cases that type of business model could potentially be used if it's an actual benefit to the hotel if it had otherwise been Incorporated and if it has historically kind of been seen as an amenity to the hotel, I think it's important as you said to acknowledge that we we do recognize the benefit to the gas and also the importance of incorporating those workers, but potentially a place like biscuit bitch and this coffee shop that come from her. So I mention I'm were never really part of the Hotel amenities but this this is trying to recognize a shifting business Market where we do want to include as those individuals as as much as And so I'll just leave it at that. I think you get my point. As I said, I don't have any specific at this moment. Anyway, I would let you know. This is something I want to check with Unite Here on on the explanation that exists you're mainly about you know, what is defined as United of geographical location. What is ancillary that is a diet clarified our day that is not by my question lies. My question is about which workers would be excluded and in the existing language, it says and tillary hotel businesses means any contract at least or sublet premises connected to or operated in conjunction Junction. Az purpose of providing Services of the building and I have this amendment said and tillary hotel businesses means any business with and then with the one Roman numeral want you to be that you have your then I wouldn't have a quibble with that. All the problem is not with the extended. Earlier today and it's have enough for the third time calling. Can I continue there's a microphone? All right. We're good to go. Please Seattle Channel. Help us fix this in the future. Thank you so much. I can't remember to want you were in the middle of saying something. So I want to turn back to you and apologize for the interruption the more detail Geographic description of what counts as an antelope versus my concern is that the amendment says food or beverage business which in my dance record me if I'm wrong, but which implies that retail businesses that are located in any of those, you know, one two, three Roman numeral definition of location will the workers in the retail businesses that fit that description will not be eligible for the benefits that the food or beverage businesses will be eligible for Punch in contrast with the existing language, which is in line with the Border initiative language where it all the businesses that fed the geographic location of workers in all those businesses will be eligible for benefits. Think I'm alright, probably speaking. Correct. There is some question about the second half of the definition refers to all businesses. But then modify is that to say so long as they contract with a hotel to further. The hotel is core function and it provides a description of what the hotel is core function is that has one open-ended item and none of them to say retail services, but I do say other services. So it's that would be a subject for a director's rule to clarify which other services. I think it went really well taken on the question about retail businesses and how folks would be affected. I want to look into that a little bit more but I do think that we heard from folks as the real interest was including food and beverage establishments. And that's where we really focus on making sure that those entities are included also just want to reiterate I think everybody knows this here, but the gift shop For example, that is a hotel employees. Those folks would be included because they're already Hotel employees and your question is still valid though about the contracted workers that are employed by another incorporated business, but would not be included here. And then thank you for mentioning that the the original all the existing language also has some I don't know. I don't know how much I mean, I'm not a legal expert. I don't know what that the language that you read out implies to me. However, and I and I and I would like you to comment on that but to me, however, the amended language makes it very clear that only food and food or beverage businesses would be eligible not retail. So so in that sense, it seems like it is. Mende language would exclude retail and as there's no there's no ambiguity in what I'm what I'm what I think it is in section A it is exclusive to food or beverage but in section B, it's more expensive, right? It would be up to a direct role determine whether other services would include Things that are not listed there already which unit could be retail if if if that business is Contracting with a hotel for the hotel's core function, you know, if it was a gift shop that was inside the hotel or a budding the hotel but I wasn't owned by the hotel chain and they have a contract of some sort to have exclusive ability to provide those services to their gas prison said, yes, instead of buying a teddy bear at a gift shop with cash. You could just sign your room number because the gets tarnished will charge it to the room through a contract understanding if they have with a hotel that would be a covered potentially another other services that are covered under Part B of A. Sorry, if I cut you off that's that's perfect your questions and your point is well taken and I appreciate you raising them. So I think what we would ask our friends at Central staff to do is I'll give us maybe some scenarios if that's okay. And I think to your point is well though, and I was just honest with our viewing public anal. Really I was looking in that first part at the food and beverage establishment recognizing that's why I've heard the most concern but let's take another look at this move forward. My hope is that it would still move forward and that we could continue to ask a question around how do these other types of business establishment fit into this roof rack? Why I agree that job you've heard a lot of concerns about the ball. So hard repeatedly workers and Union saying no, they don't want any work. I should be excluded know so I don't think we should meet them to say that we shouldn't want any workers to be excluded. So I feel that in that sense. This amendment is not seems to be saying again. I agree with them to my horrible that there's a delay and the bee I'm not sure whether DeSoto How many clearly explodes retail button does does the beclaws imply that okay, then he doesn't apply for all the businesses that contract with the hotel will. Be liable for all the benefits that the workers in the hotel would get I'm not I'm not clear on that as it seems to me that the existing languages. What I would say, I understand that a lot of things would have to be ironed out to directors Rule and and have no I've no quibble with that. But I feel that the direction that the more General language that is presently existing legislation gives a much better direction for where to go in. The direction. I want to go is all workers in the hotel premises being eligible for a variety of this amendment isn't is it becomes part of the legislation language of the direction that is given to the style that will be formulating. The directors rules is to exclude retails, and I think that it just gets Bobby Marquis as opposed to just keeping it very clear all businesses on the hotel premises which is which would my preference of you feel compelled to vote. No on this. Yeah. I have a question or maybe not a question or a statement as it relates to the threshold. I know that the Mariners small business advisory commission has been doing a lot of work on the what the definition is of a small business and we have so different definition sprinkled throughout different pieces of legislation throughout the city and I just think it's really important to think about this proposed 20-employee threshold to see whether or not it's the right one, you know some of the comments that I heard today about the intention of the city to support small businesses and in doing so we have we have historically treated small businesses differently in many of our labor laws from paid, sick and safe leave to to secure scheduling to minimum wage and you know in all of those policies we Define small business a little differently. So this is just an error that I'd like to get a little bit more granularity and and also talked to sbac about their thinking about where they're going with it definition for small business. Thank you very much. I'm sorry. I just forgot to mention one thing if you I mean if the amendment is moved as is and they said I have to vote. No, but if you were open to just striking out the words food or beverage than I'm totally fine with the rest of the amendment and I actually like the car if acacian that exists in terms of defining the geographical location. So just wanted to throw that out there. Thank you for offering that. Customer Gonzalez any comments or questions from you? I think both of our colleagues have raised important issues. I was just having a sidebar conversation with kids number herbold around the employee threshold question. And I know that when we originally proposed the threshold word that we understood that that was in an opportunity for further conversation and we just don't have it represented in front of us. And I think that's probably an issue that we should have identified for purposes of being able to have a conversation at the table and I would be interested in continuing those conversations as it relates to whether or not to strike the language of food or beverage business again, I was heard of operating under the assumption that that's what we needed to prioritize and that first section. Is why I supported it but having it there with the understanding that when we layer subsection be on top of that. We are capturing other businesses that may maybe sort of facilitating the Contracting out of services that we've heard is a real concern to some of the workers and so I was at I was operating under the assumption that the a section was really sort of getting at the Crux of the main concern in terms of the types of businesses that are generally more likely to be located within a hotel space or adjacent to a hotel space for purposes of being an amenity to discuss while focusing Beyond those types of businesses. They may be utilized to contract out services that would ordinarily stay in-house for in existing Hotel employ. To be able to leverage. So I felt like we were striking a good balance to try to catch her reasonably capture those types and classes of businesses that we can expect to be engaging in those types of amenity relationships with hotels for purposes of delivering better service to guess so I I would need to think a little bit more about whether or not to strike that food and beverage aspect. Otherwise, I think if we strike food or beverage AMD, I think potentially become one in the same. not necessarily a thing because they're I think they're taking into account various types of characteristics that would make a business finance salary business under the definitions. I don't see any remote food or beverage. That would be my strong recommendation. Thank you for suggesting that and also for your comments around how the current language compares to who's covered, especially in retail under the existing ordinance and initiative 124. I at this point I'm not going to support striking food and beverage and but I will definitely want to work with you with the folks that Unite Here at the folks in the industry to think about the various scenarios in there who's covered, especially as we heard from I believe the folks that is socially and Unite Here about the concern around food and beverage versus a retail. Would love to engage in those discussions with you. I totally understand that we have a little bit more time on this and the questions have I had definitely been raised and thank you. For helping us look into this. I would like to go ahead and move this amendment as is with the commitment to continuing to work with our Council colleagues and the and the stakeholders on some scenarios and potentially coming back to this on September 5th if needed but do one underscore my understanding for where each person has raised concerns and will work with you if that sounds okay. I'd like to go ahead and since we're a few minutes over go ahead and move the passage of amendment number three. I'm sorry. I'm amendment number one to count the bill one. 19556. Okay, all those in favor say aye aye to all those opposed when any abstentions one. Okay. So with a votive to 2121 it does appear that this amendment will move forward again 1 underscore appreciation for the concerns that have been raised but also for the ongoing Dialogue on this that is going to signal to us that this bill these two pieces of legislation that we've been mended today will stay in committee. We will bring those back on September 5th. And then also for our Council colleagues in the stakeholders at large. I'm going to hold over items number six and seven witches Council the wind 19557 which is protecting employees from workplace violence and harassment and counsel Bill 1 1 9 5 5 5 which is an improving employee access to Medical. Are those two items were slated for briefing today? Thank you for the memos on that. We will have those briefings and I'm possible discussion on amendments in August 15th date with the desire to bring forward all four pieces of legislation on September 5th and comments for the good of the record 15 pairing. Thank you. So we do recognize that there is a need to work with Central staff on some of the details on this. I'm going to give folks the same deadline that I gave her earlier, which is a week from now if that's okay with both, but I'd like to make it early in the morning at 7:09 on Thursday, August. Somebody something with math over here so nice. Thank you from now. If we could try to have those in the morning that will give us Thursday and Friday and prior to that the coming week Thursday, August 8th by no later than 12 p.m. Schedule looking at me. Is it 9:30 a.m. Or what? I can respond to have him ride. You just wanted to say I might miss the August 15th meeting because of family obligations. Just want to let you know. I'll try my best to make it but I'm not sure I can edit. We really appreciate you coming to every one of these meetings to so thank you for your presence here. Any other, I would just say that I will actually not be here on August 15th, cuz I have at work trip out of the country. But but will be working closely with you as a co-sponsor on this full package to look at the various amendments that might need to come forward on the 15th of August. Excellent. Thank you before we adjourn can I just confirm I'm looking at our staff on Central staff. What is the deadline that you prefer for amendments on the two sections that are forthcoming? August 8th at noon. Thank you for the record. That's very helpful. So August 8th at noon is where we will have our moments do but we will also make sure to push out the our Communications are the central staff members that have been provided on these two sections with that. I want to thank especially our team had Brianna and sajal have been working with Central staff. Thank you Danny Tanner for your work on these amendments with us 30 day. Thank you for your flexibility and hosting as today really appreciate it for the folks who are still here. Thank you for continuing to engage in this. I want to remind people. I'm at the next meeting. We will again have the hotel legislation on the second part of the agenda. So if people don't feel like they don't feel like you have to come right at 9 or trying to bump up our start time to 9 so that we can include are two pieces of Seattle City Light legislation and potential mfte discussion again, I am happy to also hold over the vote on the mfte discussion to give us More time on Hotel worker legislation since that was cut short today and we will include in the first part of the agenda mfte discussion and possible review of amendments this new solar program that we're working on in addition to the Seattle City Light Western Energy imbalance Authority ordinances or two pieces of legislation that help us to fill our goal around the green New Deal and then we will get into the heart of this last two pieces of legislation Council Irma Gonzalez. Thank you for being here and we wish you the best of safe travels on your trip excited that you are able to do that and again on September 5th. We will have the chance to review all the legislation. So your presence will be still felt on the 15th. And thank you and your team for working with us in advance of those upcoming meetings. Thank you all and with that today's getting is adjourned.", "end_time": 10821.4}]}