{"format": "raw", "annotations": [], "confidence": 0.9498375955224038, "data": [{"start_time": 0, "text": "Good morning. Today is Wednesday, July 10th, 2019 and it is 9:30 a.m. This is our regularly scheduled meeting of the gender Equity safe communities and education committee chair and vice-chair councilmember Teresa Mosqueda. Thank you for being here. If there is no objection the agenda for today's meeting will be adopted. Scene reaction today's agenda is adopted. There are two items on today's agenda first. They're going to receive a presentation for the office of immigrant and Refugee Affairs regarding challenges to citizenship particularly as it relates to how the federal government is undermining. The citizenship application process will receive an update on the emphasis patrols program from various City departments, including the mayor's office Seattle Police Department. Seattle Department of Transportation Department of neighborhoods the Seattle office of Economic Development and Seattle Parks and Recreation So before we go see items of business on our agenda public comment. So this is the opportunity for members of the public to join us in committee to give us public testimony for up to two minutes on items on the agenda. For today's committee has handed me the public, sign-in sheet and nobody has signed up for public comment today. So we will not have an opportunity to hear from folks is is there anyone in the audience who wanted to sign up for public comment but didn't have an opportunity to do so. Okay seen no. I'm not we will go ahead and close out public comments just for purposes of folks in attendance here at the table and for those in the audience and watching we're going to speak slowly at the committee table because we have visitors from Belarus in the audience. So welcome to all of you for joining us today. It's good to have you here and we do have live translation happening in the audience. And so to allow that spontaneous interpretation to occur at live. I'm just going to ask us all to slow our speech down and that'll be particularly difficult for you and I are a council member. We are fast talkers. So excited to have you all join us to take an opportunity to see how here at City of Seattle at the at the local government level we engage in democracy and do the people's business and a very open and transparent way and we actually have several media outlets in the audience to do our journalists from Belarus. So really excited to have you all join us and looking forward to having you observe our business today. We have a really exciting agenda and I'm looking forward to digging into it and hopefully it will be a productive session for all of us Roxana. Why don't you go ahead and read the first agenda item into the record and while you do that, I would invite presenters for agenda item 1A to join us at the table. Agenda item 1 challenges to sit in citizenship presentation for breathing and discussion. Good morning. Council members. Good morning. Thank you for being with us. So you all were in the audience when I was asking the folks slow your speech down a little bit to allow the translators some some Grace to catch up with translating what we're saying. So if you could please keep that that be great. I know several of the table are also fast talker, please. Let's do a round of introductions and then I will go ahead and hand it over to you all for the presentation. I'm too boo. I'm the director of the office of immigrant Refugee Affairs on Christina Grimmie policy and program specialist. Megyn Kelly Stallings citizenship program and policy specialist So we adopted a good place to start as just a describe why we do not play stations in the city. It's been a long program and why we're here today. Fruit for folks in the idea to have less context and familiarity with the issues naturalization is one of those things that happens in an immigrant's life that you will remember forever. And for me, I remember when I applied to become a citizen this was back in the 90s when it was only $90 to apply. I was a graduate student time in New York City and flew home to Seattle and on the day of my swearing-in ceremony with still ins immigration Naturalization Service. I wrote them a letter of my application is so please. Can you schedule this during my winter break cuz I can't afford to travel back as a graduate student and they did and it felt like wow somebody is really listening to me that's feeling less and less the case these days so the Naturalization Ceremony was happened to be the same day that the government closed in honor of Richard Nixon's death on it. How ironic I'm actually here in this country partly because of him and it would be tragic if I could not take my oath ceremony also today because of him, but it turned out. Government was closed but the oath ceremony appointments were the only things that were happening that day so wouldn't would normally be a very long day. I was in and out in 20 minutes. So thanks to Richard Nixon in different ways and I'm here and it was a very efficient process. So a lot has changed since then. And we want to talk a little bit about what some of those changes have taken place in and not only from the time that I did which was predated the the creation of US citizenship and Immigration Services USCIS recall. There were three new agencies created under Department of Homeland Security as a result of the Homeland Security Act in 2003. And that was a reaction to the tragedies of 911. And so the functions of what was ins now got transferred to this new agency called USCIS. And since that time there's been a lot of the mission statement was largely the same even under a Republican president that time who made those changes President Bush but today under President Trump USCIS USCIS, his mission has changed and so we thought there would be a good place to start just to give you a sense of what USCIS was created to do and it and its stated mission statement. And now it has pivoted towards so prior to Trump USCIS focused on services and benefits and from its mission statement, as you can see here and the text that's highlighted in red. It's to secure America's promise as a nation of immigrants so that acknowledgement of our history and the function of granting immigration and citizenship benefits promoting awareness and understanding of citizenship. and today among the many things that President Trump has done including those early executive orders in 2017 that very early on cast his intention to beef up enforcement and some of that then cascaded not only in terms of border security agent a heightened Focus now on interior enforcement browse of shipping u n c i a sportomotive enforcement and so you use see some of that language reflected. They took out that mention of the us as a nation of immigrants that no longer exist in USA USCIS, its mission statement and rather most of the language that has been changed and it talks about adjudicating request while protecting Americans securing the Homeland so very much towards enforcement framework and that's where our Story begins So we're going to turn it over to Megan and Christina to give you more detail about what has happened both in policy and practice over the last 2 years. The first of all just a brief overview of what office does when as it relates to citizenship. The new citizen campaign was launched in 2016 as an effort to really increase the number of Seattle area lawful permanent residents who seek naturalization the campaign surrounds at Outreach and education, but also a lot of the focus has been on group processing events where volunteer attorneys assist applicants in applying for the N400 citizenship application. So as you may recall we had a series of very large events or workshops where we assisted anywhere from 200 people in one day all the way up to a thousand participants in one day this year has been a bit of a shift in 2019. We've only done citizenship clinics as we call them and these are smaller events that are focused on serving only 25 to 50 applicants in a day and we offer these monthly there are nonprofit partners. It's been a bit of a shift on our end in terms of a large flash events. And now we're focusing on smaller settings where people can really get a lot of one-on-one attention through a collaboration of nonprofit partners. Are other than ship assistance program is the new citizen program a new system program has been around for over 20 years. It was formerly housed in the human services department and came over to Ira in 2015 and its 12 local partner agencies to provide Case Management Services from clients from until usually the day they take the oath ceremony you get the microphone closer to you can pull it closer to you so you don't have to and including preparation for the citizenship test. And in many cases their representative attends the citizenship interview with them. Minion CP clients have disabilities that prevent them from becoming English proficient and passing the Civics exam and and TV providers help them obtain the relevant waivers of those requirements that would allow them to become citizens. Seattle invest more than 1 million dollars a year in citizenship and that represents one of the largest Municipal investments in citizenship anywhere in the nation. We work with both with your citizen campaign and the new citizen program. We work with 20 local partner agencies. Many of them have been our partners for well over a decade some since the beginning of the beginning of the new citizen program in 1998. Okay. So one of the things were going to talk about today is the changes that have affected to citizenship application process since Trump came into office and a few of them are changes that have been implemented from the policy level. So coming down from USCIS leadership. And these are already been implemented in these changes to kind of some of them some of them up. They greatly increase the risks of applying for citizenship previously. If someone apply for citizenship didn't meet in a requirement or maybe didn't pass the exam during their interview, they could be rejected or maybe they would apply again a few years later. But the actual risk of them applying what's really minimal according to official USCIS policy. Now if the denial of their case revealed any potential ground of removal the government will now is she would call the notice to appear that basically enters them into removal proceedings that was not previously policy. And now that really raises the stakes a lot for people who are applying because before, you know, there was some risk to not exceeding you could say but the risks weren't nearly as significant in terms of potential removal. There are several potential changes that are being made through the administrative realm and Christina will speak more about this in a little while. But today our office has submitted eight public comments related to administrative proposed administrative rule changes, that would negatively impact immigrants. So you'll see that these are you know appear to be changes to forms related to the citizenship process. But these are administrative changes that have a major effect. These changes make the forms more complex. They make the process harder for both applicants and their legal Representatives some of these changes especially those related to public charge in again public charges a designation that immigration makes that determines that certain people who receive benefits are dependent on those benefits and therefore may not be eligible for certain types of immigration status. Those proposed changes have had a real chilling effect. They've affected immigrants ability to live healthy lives because they choose to disenroll from benefits that they may need and you know are eligible for Our partners are Community Partners have asked us to be involved in pushing back on these proposed rule changes to Advocate against these changes that will really make their work harder and they're already seeing is making things more, you know, making their clients more fearful and nervous about entering the citizenship application process. mosquito thank you so much for helping us understand the way that these policy changes even the proposed ones have had a real impact on whether or not people are applying for services that are eligible for hear about that happening here as it relates to eligibility for healthcare. Even Healthcare that undocumented kiddos are eligible for obviously lawful permanent residents as well are eligible for Medicaid expansion and Wondering what it looks like you was said that the Advocates have asked you to weigh in. What does that look like? What's what's the current status of how can we help and are there issues that you're also helping with at the state level to try to make sure people are do do know there are opportunities their rights to apply for state and local programs as well. I can speak to that briefly but DSHS who we partner with on the little closer DSHS their office of refugee and immigrant assistance who we partner with the new citizen program, you know, babe, I think are trying to constantly inform people that they are they they remain eligible for benefits that you know even I need a public charge changes haven't even taken effect yet. They haven't even been approved. But there's just so much concern and so much fear around it. So I think they try to share information that's accurate and kind of dispel rumors around that but in terms of what we see, I mean from our providers we hear that people are afraid to be on public benefits. They will disenroll from public benefits. They are nervous that being on public benefits will prevent them from becoming a citizen which is not the case at all. But they're in a position where they make really hard choices about what if they stay on public benefits vs pursuing immigration benefit in that it's a so unfortunate that that that's out there. I was just sad that it is a bit difficult for our advocates in for our office to create some kind of campaign or public education or awareness campaign surrounding public charge specifically because even currently for people who are applying for US citizenship and there are potential risks to receiving public benefits. If they're applying for a family member of broad there public benefits are being considered currently. It's a very complex issue in terms of spreading awareness because it's really an individual consultation that needs to be had without a legal professional to determine whether that person really should be receiving public benefits because even now even though the public charge that's listed on that previous chart is not that policy has not taken a fact there is a foreign affairs manual policy that's already in place. And so some of these things the reason why we've lifted really long list of the things that have changed is that it's very complex to Spread the word about these things because there is no easy answer until we would love to do a public awareness campaign and let people know it's okay to stay enrolled in benefits, but for some people it's actually not great right now. I'm in so we we have to be very careful about how we spread the message that yes, it is. Okay for the majority of people applying for citizenship, but there's a small caveat. And so in addition to the National policy changes, we've seen a lot of changes that are our local offices in terms of how USCIS officers are adjudicating pieces. One of the biggest local impacts that we see is also a national issue and it's something that the council has taken action on at something we called the second last time. Are you all passed a resolution supporting the the effort to bring down the second wall as we call it which is a backlog of cases specifically for citizenship, but really for all types of immigration benefits this backlog currently in Seattle is over 16 months. So that means in the past somebody might apply for citizenship and receive their interview with in three or four months now the minimum is 16 months. So this is a real deterrent for people as they're deciding on whether to apply for citizenship. I won't go into all the the items listed there, but suffice it to say that the different ways that the officers are are handling cases in the office has also extend did the time necessary to go through the interview friend since they're asking every single question on the 20 Page form which didn't used to be the case this takes up a lot more time. They're interviewing cases that are they never used to interview for it. So that takes away from time that they should be interviewing for citizenship applications. And one of the most difficult changes that we've seen just recently and we will be implemented next week is that the local Seattle office is now sending pieces from the Seattle area to Portland and Yakima for their interviews. So our nonprofit Partners right now are basically in a panic trying to figure out how they will get their clients who are elderly and firm who are oftentimes disable to don't own a car. How will they get to Portland for a 7:30 a.m. Interview and how will they accompany them for That interview when they have 12 other cases that are having interviews that same day both in Seattle and Portland I meant so this is a big change that we just seen recently and we're kind of scrambling to to figure out what to do about it. But this is a type of example of what we're seeing pretty much on a regular basis over the last two years and he's our Caesar. procedure and policy changes that are specifically designed to I created this incentive for people to want to participate in the process. I would say disincentive for hardship to participate in the process used for the interviews is that they're trying to lower the backlog because there's lots of a backlog in Yakima and in Portland, but we don't we don't see it. That way. We see it as the potential that yeah if it might decrease tobacco because so many people will be unable to attend and they'll be denied. And so guess it made apriso backlog but they've been out of unable to go to any specifics about how many people are going to these different office says how long this policy will be in place Etc. So you all given any thought to how the city of Seattle might be able to support an effort to mitigate some of these hardships. Christian you want to talk about the flyer that we just created? Yes, share we've been again basically scrambling over the last couple weeks to try and figure this out. We're looking to find a ride share applications are carpooling applications on the people might use to connect connect me of a large pool of volunteers for instance who really would potentially want to help with this car pulling people to Portland area, until we're looking into that but it's it's been a little bit difficult to coordinate in terms of insurance and we're looking for a non-profit partner that might be better able to take that on one of our local Partners Asian counseling and referral service is looking into whether or not they can use their van to take people back and forth which could be sustainable If This Were a month-long policy but we're pretty sure it's going to be a year or more that they're implementing this so we're we're Crying right now. I mean we're trying to coordinate with our partners and actually reaching out to that companies to to see if they could help to create kind of a matching type Rideshare applications for our volunteers and our clients and participants. So it's a work-in-progress right now, but we're trying to figure out the best way to do so that will not place any liability issues on our partners on the city currently the folks who are being sent to Portland and Yakima are mostly surrounding the city of Seattle. So sometimes actually further north than us, but it could be that Seattle actual Seattle residents are sent to Portland in Yakima soon as well. So we are we're trying and we're trying to figure out what the best role of the city is. I don't know if sorry to mention we have actually a resource sheet to as well that offers information on bolt buses and Greyhound. Amtrak trains and the cheapest hotels in those areas and then so it's kind of disappointing to discuss because I wish we could be doing more right now and would welcome any ideas for how we could be more support support of our participants on our partners in Portland. There are quite a few in the Portland area that work in the space and it would it would be interesting to see if there is a way that we can create a connection between our community-based organizations. And those that are in Portland who that's that's a great idea for a collection great. Thank you. I appreciate the connection that you're making and the Outreach that you're doing for potential opportunities to carpool. But what is the legal requirement of the federal government to make a hearing accessible? Is there not a legal challenge that can be brought? We weave I think the Ala attorneys or can have it looking at this right now. And as far as we know based on precedent that there is no requirement for Megan. Do you have a different point of view and asking for accommodations to be made to assist in the weather is telephonic appearances by attorneys and USCIS is one willing to make any accommodations policy statue that says here's your requirement is the federal government. I unfortunately this type of policy and terms of relocating interviews has happened. I'm not saying there's not a legal basis to fight it but it's there's a long history of this happening in Seattle previously, but I mean Christina can speak to when it happened in New York, and I'm hoping that you know, the right legal Minds can come up with some sort of see that the government isn't so selling at this point. What's it what's different about this now? Is it in rural communities where people were far away from USCIS Regional Offices that would be the responsibility on the applicant to get him and herself to an interview and oath ceremony. And sometimes it would be you know, a few hours drive is different now is that we actually have a regional office in Seattle in this area and people are being asked to go hours outside of where an office already exists. And that that infrastructure for transportation the responsibility on the person to pay out of their own pocket also to do this and with you or your union background that's lost wages for many folks and then you kind of combine that with what we're going to talk about in a little bit is the threat of elimination of a fee waiver another means-tested methods to make naturalization more affordable. So it's becoming with all these barriers more and more like a pay-to-play system that punishes poor people. Something that we wanted to tell about the impact of kind of the shift within USCIS policy is something that occurred a few months ago Chinese information service center is both an MTC new citizen campaign and new citizen program partner, and they had a client who they had represented from start to finish as a participant and nutrition program this client had Pastor citizenship interview, including the Civics and English exams, and she was invited to attend an oath ceremony a few days later. She was checking in for her oath ceremony and the officer she spoke to just when you know turning in a form Dean's that her English was not in fact good enough and turned her away. Thankfully she had an accredited representative that cisc and she told him right away and he took action right away other Advocates within your citizen program and even in the broader immigration attorney community. No one had ever heard of anything like this happening initially. It was like some interaction in an elevator or something wasn't it was submitted form that you checked all these boxes. There was no issue with how she had filled out the form but there was some sort of miscommunication background noise and she according to the officer did not appear to understand or respond in proficient English despite the fact that that has nothing to do with the fact she's already been approved. So official stood behind what the officer done and what it happened and issued a letter stating that the case has been reopened. for re-examination in revaluation, but after this client Advocate NCIS, he's responded with a comprehensive we go argument and we are office facilitated some intervention from Senator Murray's office that motion to reopen was rescinded and the client was rescheduled for an entry car for an oath ceremony, and she successfully took the oath But she was traumatized and what if she hadn't had a legal representative? The situation is really indicative of a cultural shift within USCIS that is emboldened officers to go beyond the rules. Go beyond, you know their role in certain circumstances to make it that much harder to get US citizenship even in this case for someone who would know every single requirement. So, this is Abdi Jama. He is a partner virus through the news. They attend campaign and new citizen program. They have been apart of ours to the larger workshops and they have led or cold at 6 clinics in the last three years and they have seen an an increase in a difficulty of the kind of cases that are walking through the doors at the clinics. I think this has been a trend not only for Clinic participants but also for NCP clients that people with the amount of fear and they are the amount of negative rhetoric surrounding immigration in general in the country. People are now turning out to naturalize who have been permanent residents for 20 25 30 years or more in 2017. And 2018 are clinics saw an increase in the number of years that are participants have been lprs. So what this means along with the increased difficulty of the cases The increased questioning and interrogations. The interviews this means that we have to be a lot more careful with the types of cases that we let through and a lot of our Clinic clients end up having to go through a Freedom of Information Act request to receive a copy of their files that we can feel safer about actually sending in their applications to this means that the work for our partners both in the clinic setting and then the one on one case management setting has increased it's gotten more difficult in the clinic setting we've responded by we're working on much longer screening form. One of the Farms used by one of our partners is 17 pages long to this means a lot more time for our participants spent in the clinic setting but it is something that we're trying to implement to make people safer or feel safer going through this process and we can feel confident that they're okay and I think the only other thing I'm going to say about that is that a lot more of the cases are also not being pushed through in the Clinic's better. Sleeping referred back to our Community Partners for one-on-one services or also to private attorneys as necessary. I just want to do a quick time. Check me about 4 minutes left. I think we're getting to the end here. This is actually what we most wanted to talk about. I will try not to speed up my speech but changes to the fee waiver form have been something on our radar since last year September while we were in the middle of the public charge debates and public comment saying session USCIS produced a changed form i-912 that went under the radar essentially when someone is applying for US citizenship, the fee currently is 7 $725 people are eligible for a fee waiver if they are low income or receive means-tested benefits. Generally, it's for people who are under 150% of the federal poverty line. The change to the Forum has is intended to eliminate the use of a public benefits letter as proof that somebody is low-income the vast majority of the cases that we see the for folks applying for a few River. Do you use that public benefits form? Because it's the easiest proof of low income status. So this elimination is pretty much eminent. We just submitted our third public comment on this issue last week, but we believe that that change to the Forum can happen at any time which will very much affect our services. So it has the potential to be devastating to the NCP program and very much hinder the the new citizen can pain clinics. What's even more worrisome is that we have heard through a national partners and Advocates that there are changes coming to the fee schedule and also the potential elimination of the fee waiver all together. The USCIS is going through as fee schedule review currently, which is supposedly set. To be released in August and what we believe will be announced is that the fee for citizenship will increase by 83% which would put us at over $1,250 for citizenship and that simultaneously They will announce the elimination of the fee waiver. So this means that anyone who is it all the way in, or even middle-income would be unable to apply for citizenship so that we wanted to put that on your radar because this is something we are really really nervous about this would devastate our programs. If there was an elimination of the fee waiver and the fee went up at the same time. Just the changes to the few waiver form, which dimension are pretty much eminent that's going to very much hinder our ability to do our work and our partners ability to do the work but the elimination of the few ever all together is going to be devastating and so we are working to fight against these changes, but we wanted to put on your radar that are partners are doing a lot more work currently and the setting that were sitting in front of us means that they will have to respond yet again and really adapt to this new environment that they actually may not be able to adapt to I'm going to quickly go through the next couple of slides. This year is numbers based on Research from our national partner of the National Partnership for new Americans and it has data for Washington and the US that this so-called second wall there about 20,000 28 people in the state of Washington who are waiting for judication. If they're at their application and across the country almost three-quarters of a million people who are waiting and we believe that half to two-thirds of that 20,000 or in the Seattle King County area. Just to put that 753000 number into perspective. That's approximately the population of the city of Seattle. It's right. Yep, and the impact on service providers. I think the main thing here Christina talked about is that the cases are harder. It takes longer to search client. It takes more legal expertise for individual cases the threat to the program that we provide is very real and then I think for me at it. There's a there's a what what is The end impact I think at an individual level it is a person's dream. It was always my dream to become naturalized and but they're also economic benefits. As soon as you recall people who are Naturalizer learned more than they're not Natural Life counterparts have a sense of belonging. When will you take those things away is really taking away their ability of invasion of a better future for themselves and their families and data at a national level. The impact is our country. It gets to the soul of who we are we have never been a country that then based on how is weather that you can afford naturalization because you're a high earner that is never been the case for us, but now we are on the precipice of of that becoming a reality. So there's a lot at stake here. I'm working hard every day. Thank you for your support and we follow up with you in the the Outreach to Yakima and Portland and will get back to you with more details. That's great. Thank you so much for taking the time to put pull this presentation together with a lot of Rich information. I see several opportunities here for the city of Seattle to enhance the work that we're doing in this space and look forward to having conversations with you during our regular check-in, which I think is happening next week about how we might be able to advance some of those opportunities but really appreciate the work that you're doing. I think you articulated it very well that this is a this is an example of how this president has utilized his executive power and authority to undermine one of the fundamental values of America, which is time to welcome immigrants and refugees and to be a place of sanctuary for people who are making very difficult decisions to leave their home country for Very legitimate reasonable reasons and I think that cities like Seattle play a really important role in creating systems of resilience that allow immigrants and refugees and their families to fully integrate into our society in our communities here and I've been really proud of the work we've been able to do together to invest in those resiliency programs everything from the new citizenship program to our legal defense fund that provides free lawyers to immigrants and refugees who are at risk of deportation and so many other things that we do that you all do every day in your office a really appreciate the hard work that you're doing in a space that is constantly evolving and not in a in a way that makes us proud as Americans. So I really appreciate all the work that you're doing colleagues any other comments or questions. I'm just very briefly. There was an individual who came two weeks ago and are full committee and the public safety and what the city has done and I was hoping that you can also, and I believe in Civil Disobedience, especially when we see kids in cages and directed that are livable and unhealthy situations for are immigrants and refugees that are trying to come to the United States. But the individual who was speaking of the city that we do more to prevent ice from arresting people for example at public places like quartz, and we didn't have the chance to have a dialogue of that conversation. But do you mind very really slow just for the record talking about what this? Seattle currently has in place to protect individuals who are especially going in for their Court hearings for citizenship issues from being detained by ice. So that that's clear and we clear up that record. Alright, I know that your staff had reached out to our office. So we had responded. There's a couple of key things one is there was a mayoral directive that went out in early 2017 and inspecting City departments not to share information about personal information about City residents unless there was a warrant for that information. And so that has cascaded down to the staff level. The other is we partner with Community organizations that washes in solidarity Network for example of following an incident at the courthouse where I did arrest somebody who had shown up at the courthouse for it for hearing and Conducted their enforcement the arrested him outside in the public area the sidewalks. We can't regulate that area because of her public spaces, but we did reach out to the court the Seattle Municipal Court. They have since put up know your rights Flyers with a toll-free number and information about what to do if such an incident should happen to them. I would just add to that that you know, we just heard it or so. I resent reported enough you all read the reports this morning or yesterday that King County has shared information can County jails in particular has shared information with ice related to individuals who are in detention who have immigration status complications or issues that is in contravention of a law that was actually passing is on the books at King County and there is a lot of concern obviously related to how that information sharing occurred and why officers correctional officers were capturing information in the first place. And so I think there are there is an opportunity for us because we recognize that there are Seattle residents who are in detention at King County. I think there's a What you need for us to engage the county and getting a better understanding and sense of how the law that was passed. I believe in 2017 was that 2016 is just last year in 2018 that was actually being implemented and how the training is occurring with officers to ensure that the type of information sharing isn't occurring. And so this is on the tail of also the news that ice was utilizing King County that are filled to a transport immigrants and refugees who were being deported from the country. And so again that part of the reason why I really pushed the prior Administration Maryland ministration around at creating this executive order was precisely because I was worried that implementation of our laws that provide Sanctuary to undocumented immigrants and refugees were not being appropriately or fully implement. And that our own staff. Our own house was wasn't unaware of how to actually Implement policies and laws that were implemented and passed by city council and supported by Mayors year after year after year. And so I think they could order one along way. I do think given the recent examples. It would be a good opportunity to send to have the mayor send a refresher to staff and to all of the Departments within the executive to once again reaffirmed that this is the policy this is how you deal with it. But to your point around what can we do to protect people who are coming into public spaces to receive public benefits. Unfortunately, the answer is there not a ton. We cannot prevent ice from having a footprint in the city and I am a willing agent enforcement activity which is why I've been really clear in my messaging as somebody who came An immigrant Justice Rights Movement is to make really clear defoe's that even though we're Century City that does not mean that ice does not exist in the city of Seattle and there are still risks associated with moving about even in the city of Seattle and the county and King County and the Station Washington. There are risk moving around in public spaces so long as ice exist, and there is very little that we can do to prevent that other than educate folks about what their rights are if they do have contact with an ice officer. Thank you. And if I can ever be a service during my time, please let me know. Thank you. Thank you so much for the appreciate that I apologize for being a little late to our second panel. So I couldn't read agenda item to into the record. If you were here to present on the second panel. I'd invite you to make your way to the table as this item is being read agenda item to Seattle Police Department emphasis patrols update and evaluation for breathing and discussion. And its members of the media would like to move there cameras behind the house. You're welcome to do so. Distracted okay. It is a full panel this morning. We managed to wrap around the table. I really appreciate your all's willingness to join us for what is a third conversation around to provide us an update on the progress of this work. Of course. This was an announcement that was made by executive additional enforcement plus resources pushed out into specific neighborhoods days in order to address sign at crime and disorder livability concerns in those specific neighborhoods after we had our last Committee hearing that we learned in our office that the Timeline of how long the emphasis patrols would exist would be extended for a longer. Of time. And so that brings us to today which gives us an opportunity to as council members hear directly from the various departments who have been engaged in this work to provide us with an update. And I know that you all have a very in-depth data Rich detailed presentation. And then the last I have asked several questions that I feel that have still been unanswered from the initial letter that I sent to the executive and the police department in in May, so I will be pressing for answers in those faces and I'm not going to let you go until I hear what I want to hear. I just want like that really clear. All right. Let's do introductions and then I will hand it over for presentation. Green light has to be on Julie Julie Cline from the mayor's office Eric Greening Seattle Police Department's on the cooperation that was involved in this effort this summer and and the mayor's apartment as we kind of get started on the report out up to that to date. Anyway wants to make sure that we're thinking from the bottom of our hearts all the Departments for the the surf extraordinary Li hard work and cooperation during this entire project. The number of hours in the effort was really above and beyond from all of the different city departments in this case. And so we wanted to make sure that the council knows how much cooperation Occurred during this emphasis project and I know the council is familiar with the sort of how this got started and why I got started but I'm sorry my Tia from Don is here and he's going to kind of give a little bit of an overview before we go in to sort of the overall Seattle Police Department Trends and then into specifics and individual neighborhoods. And as it makes sense, if council members want to raise questions that scrape through various of the many of these slides and then turning to my colleagues when there needs to be more specific with with the assistance of Bobby Lee from Led, but I want to just Echo quickly the staff recognition many not just officers, but many of the staff from all of us across the Village People at this table, but others really Coming together in a way that really showed a new level of collaboration to have service delivery. And so as you all know this was an emphasis Patrol program that we saw an opportunity to take it Beyond just a typical typical SPD LED efforts around emphasis patrols. We saw it as an opportunity to bring a variety of departments to the table to really Center on how do we improve that Community relationship in that Community feedback around what the community what is business what business owners want to see happen in their neighborhood business districts and along the streets in Detroit temps and will go into that towards the end of the presentation once we go over some of the basics, but it really showed us that this model can be effective and is effective when we're breaking down. Styles of government and saying okay what what are we hearing directly from the community and how do we address that in the timely manner nurse office Spectrum awkwardly close to your face in order for it to actually pick up your voice. You want a Time coordinating this effort and I just want to recognize of course the mayor and then Senior Deputy Mayor Fang Julie Cline shirts and Grove KY let Blair Maritza Rivera Sabrina below these folks have really worked extremely extremely hard to make sure we have a rapper on approach to solving problems at the street level and have rapid response back to at the neighborhood level with real problem solving. That's what that allowed you I do want to recognize them. These role in this is specifically to raise the voice of our many of our neighborhood small businesses a many are owned by People of color and immigrant population integral part of our economy collectively. There are the the contributor to our local economy. But also they can chew it back as a real-time feedback to our city departments about the health of our neighborhoods. So there are a great partner to our community policing to Neighborhood design streetscapes to land use planning. They provide a real feedback real-time feedback to our city departments that are great Partners. So not only collectively are they to drivers are economy that but they're the backbone or a Civic engagement and a partner in that field and so my role in this is to make sure that their voices again many owned by people of color American population have a say in how we solve real-time problems at the neighborhood level. But that they were going to get into it. We have about 40 slides to get through. So we're going to try to be intentional with our time here. So happy to see all of your faces. I guess. I'm a little confused though about why this is getting so much attention for being a unique and I think you said body that has gone above and beyond is this not the type of group that you have pulled together to address homelessness overall at I know we've had multiple conversations at the select committee talking about what other cities have done notably. The city of Los Angeles has had a task force that gets together. I believe if not daily at least weekly. I had the chance to sit in on one of those briefings. I know that many folks from the mayor's office also in downtown Los Angeles city and had the chance to talk to folks. They're about the coordinated effort. I would assume that a body like this comes together to talk about not just how to offer citations and in Actions and book folks in jail, but also talks about how you can coordinate efforts to get folks inside now. I think that's challenging given that on an average night recently the numbers show that there's only six enhance shelter beds overnight so I can see where there's a challenge and actually offering people a place to stay if we're not building housing and opening more shelters, but does a body like this exist for helping people get inside vs. Citations and switching sucks. So thank you for that point. I think I think there's a couple things you highlighted their specific to happen to housing that unsheltered and working with our shelter system, which is definitely part of this but what I'm talking about in terms of collaboration, is that even if that taskforce existed, this is an opportunity for a kind of almost every city Department coming together in meeting the needs of the community whether they be around housing unsheltered weather be in business support weather being I needed law enforcement response whether it be something along those lines are we going to get To something like that has the details around that so that as we continue to build this out SPD will still be at the table, but it will be a broader collaboration of of departments including HST including our folks are my thing is that are that are pitching into the into the solutions HST in the mayor's office is constantly competing around homeless coordination for sure. Julie wanted to put a fine point on the line of questioning being posed by cancer was it really does come back to the initial question that I asked back in May which is what is the theory of change? What are we doing here? And why are we doing it and that is still very much unclear and in my mind has not yet been answered by the executive. In terms of why are we doing this in the first place? So I get it and this is patrols are not a new tool. It's something that Seattle Police Department is used for a long time. And it's just fancy talk for we're going to put more cops in a particular area do proactive policing to prevent crime and disorder from occurring right? But is haven't had a clear understanding it. I do not have a clear understanding yet of what is it that we are. What are the outcomes? What are we trying to achieve through this effort that is being referred to as emphasis areas. We're going to get through that today towards the end of the presentation but I will say that even though this isn't emphasis Patrol report and emphasis areas. When I'm trying to tell you to kind of articulate here is that it is a broader effort to bring City departments outside of City Hall and meet Community where they're at and inference their needs some of those needs are related. A lot of them as we go through it as we went through some of these walks. I really nothing to do with SPD they had to do with some improvements to ask Donny to do as a relates to sidewalks. It says release the crosswalks parks is here. We'll talk about a lot of improvements that happened in South Park that were Park related and you know, I activation cleanups in terms of Park cleanups. And so that's the opportunity as we see it is is City Hall getting out of City Hall going into community on a regular basis so that we continue to improve relationship. And so that's what's exciting to me as Department of neighborhoods as we are building the infrastructure that we can really add on. 2 as we are seeing what some of the concerns are from community so cuz I don't think that's the theory of changes here. We can go to the PowerPoint we can we can get a little bit more at the end of the day. What is the purpose? What are the outcomes? What are the deliverables because people are expecting to see sustained long-term change as a result of additional taxpayer dollar investments in this space and we're going to continue to get questions about why are we doing this while we are also not feeling a difference in our communities in and our neighbor has as a result of these Investments. And so I feel like it's really important for us to to have that question posed and have that question answered directly. Go to the next slide. There is there is an element here that I think we can start getting into that. So I'm turn it over the next 2 slides. I'm going to turn it over to SPD. Thank you. Wanted to kick off an overview for some contacts how the city is looking year-to-date on crime and noticed one little typo here. So at the top it says citibike Ryan year-to-date is down 13% that was meant to be in June. It was down 13% year-to-date through July 9th Moon full this data as you can see on the table. It was down 11% in May as its own month May 2019 compared to May 2018 was down 10% June 2019 compared to June 2018 was down 13% And when you look at the chart at the bottom so far every month this year reported major crime has been down every month. And the we're the only major categories where there is an increase of a while small every increase is not Acceptable we have an uptick in rape the department and other sexual assaults that the department is tracking and constantly discussing an RC stat. Meaning of the Special Victims Unit has assessed all those there's no pattern they don't see any evidence of anything from a Serial nature. That's a concern there some known relationship issues and that there and their aggravated assaults as usual are occurring around nightlife and some an individual's in either a drug or mental health in Jesus Christ his moments. That's where we see a large part of those skill-wise 13 and 14 increases percent wise 9% increase in sexual assault rape and 1% aggravated assault all other categories be such a sort of setting the contact Citywide. Obviously, this is looking at 7 neighborhoods. Make sure that I recognize this chart shows us Which means that it's average if you will for all neighborhood all precincts all crime data and what we have seen in Pryor presentations from the police department is an acknowledgement that these numbers don't accurately reflect what is happening in specific precincts and neighborhoods when you really drill into the data and so, you know, those these numbers change pretty drastically when you start really digging into micro communities and really look at that crime data, and I think that's important because even though here it shows that aggravated assaults are up 1% year-to-date and that rape is up 9% Year-to-date that again those those numbers may be significantly higher in specific neighborhoods based on what is happening in those in those neighborhoods and it can't remember her old is he? Or she would say that that is that is a reflection of what we are hearing from people in neighborhoods who are concerned about additional criminal activity occurring in their neighborhoods. That is of a violent nature. Not Petty property Fest property crimes, but serious high-level violent offenses that need to be immediately addressed in order to keep victims and potential victim safe, but also to keep cir of the social fabric together in those neighborhoods if we will talk about that for these specific neighborhoods that are part of this initiative at the moment, but we also routinely I'm often when I explain the folks in other departments how we use our my community policing plan. I really stress it. I think more so than what I've seen other department when we talk about crime and Transit cease Dad. We're not talking most of our conversations around neighborhood. Bubble trans, we're not talking about sectors and beats we're talking about what's happening in the different neighborhoods and who's up and who's down so I do think the department tries to address that and we'll get into that a little bit here. But this was just a set the broader context for how's the city doing in the midst of this? And so this is a little bit metal chair to speak to your question about theory of change about what we were looking to do here. And so I can we're happy to provide to counsel robust list of the research that we can solve in terms of how we design this but the brand that is 0 in is on. Dr. David weisburd of George Mason University who is black a better phrase that the father of place based policing and understanding how crime concentrates in neighborhoods and locations and street blocks and why mostly did a lot of his initial research here in Seattle or the one of his first big initial findings with Seattle has around 23,000 or 24000 Block Street faces about 1% of those blocks account for 23% of the crime that happens in Seattle has a little bit more so I would say super concentrated than in other cities what he further found in what drove the design of this work was when you lay on On top of that on those street blocks the social factors and terms of measures about complaints around weeds garbage litter graffiti the crime and those factors vary our participation all sorts of measures that you can get from senses another Community survey data with his team. Did this work as much as crime varies from block to block those issues the scale of them varies from block to block but what they found was that an increase in those measures be it led to an increase in crime and an increase in lack of feelings of safety. So the theory of change here was if we can address not just people wanting to see officers on the street, but get rid of the factors that research has shown both lead to feelings of not feeling safe and support crime research done here in Seattle. That's why all these other departments are there if we can address to kassidi address the overgrown bushes improve the lighting make everyone feel Call the neighborhood has some sense of sort of social cohesion. And that the city has a grip on what's Happening that neighborhood research has shown that it leads to increased feelings of safety and defrizz low-level crime. The other research in the area of points did that this sort of soft enforcement where the focus was not for the officers to make arrest the focus was to be out there to make referrals to give warnings. If there was significant crime happening. They did the arrest that use their discretion as they always do but the research also shows that for this word level feelings of unsafety that this approach joined with problem-solving from other departments. That's the best way to get there without this the consequences that can come from ramping up formal uses of sanctions. And so that was how we sort of set this up and I think we in two months we've seen some good results. I think we have to see how this in terms of your system and we need to see how that plays out and that's where we're monitoring it be monitored every two weeks or every day really with her dad. And if this team is looking at it pretty routinely but that's really sort of how we got there where the design was. It in terms of this at remind me. What is the name of the person? You're Weisberg w e i s b u r d y is it so he's not familiar with this particular researcher. Can you tell me more about who he is. He really is the credentials. So he's a PhD to to the George Mason and University in Israel. I believe Tel Aviv University. And I mean, I think I could produce three or four pages of his published research sightings. Almost all of them on how do you do police scene by Place? How does crime and other Behavior concentrate by place? And how do you do it in a way that doesn't a lot of his recent research has been how do you do play space or hot spot policing in a way that increases legitimacy? He's done this work recently in Tucson and some other cities. We were in conversations with him to do it here because of the Nature of our Urban environment a lot of his work required to having to do surveys of people living in the hot spots and a lot more a lot of our fortunately sort of the the fun secret of Seattle is why we have a lot of for us hotspots compared to a lot of cities are blocks that have a lot of crime do not compare two blocks that have a lot of crime in other cities. So the places where their data was able to show them they should do surveys for places that had apartment buildings and they couldn't get into the apartment buildings to do the survey so they decided not to do the research here, but we were interested in learning that same thing specifically to Seattle. But if you talk to researchers around the country in terms of the the start of the network of those who are experts on how you think about crime and place they most of them studied under dr. Weisberg or they are they studied under his initial we have cohort of phds that he produced he really is. I think the old standards of how you do play Space research about what what How environment impacts crime and how police scene and other problem-solving efforts can address these issues sounds very similar to broken windows kind of approaches. How is this different or similar to that? . Maybe you want to describe the theory so that folks were watching know when I'm talking to different people have different interpretations of broken windows. I think the original Theory involve working with the community to address those broken windows. I think some departments some other researchers are practitioners took it to being Zero Tolerance that that was not how George Kelling who's her pointed. But but why is bird very much did the research of does focusing on those places work? Kellen's theory was when a neighborhood looks like no one's in control. It is a facilitates criminal behavior. That was the broken windows Theory the operationalization what you do about that has differed. So why is bird really focused on what are the things you can do from a fleeting perspective in those locations that reduces crime does focusing police resources on a hotspot of crime. Does it reduce crime? Do you have to Fusion of benefits do you do? Splice the crime that's a sort of work that he did but broken windows is really wasn't a strategy. It was a theory about General disorder sends a message that any behavior is tolerated and then other people ran with that all sorts of different directions. But so then what do you do in response to that at Kelly's original thoughts were you involved the community? You can't fix these problems without the communities some places didn't involve the community and they just decided that means we're going to arrest everyone for everything but that wasn't the intention of broken windows. If you recently passed if you talk to dr. Kelly and that was his intent was to involve the community and fixing those problems follow up on your question, September 5th, 2012, the city auditor's office deliver to report to council about the research conducted by George Mason University on this topic. So there is literature on the our City website right now from the auditor's office that can provide you some background on it and just to speak to what he's saying about broken windows from a cop's point of view and a street that's you cite someone for littering site someone for a walking against the light every single thing you address what we're talking about here play Space you put an officer in that hot spot where that block as presents and just the presents alone can have an effect on calls for service and feeling of disorder. So it's more just be there. We don't have to stop every single person for everything and he just needs to be there and that in itself will have an effect so But in this but in this case, I just want be really clear there have been citations and arrests made as a result. We we gave no specific orders that officer had to have any type of numbers to reach anything like that that was their discretion whether or not to take action to give warnings on certain issues. Right? And I think we're going to get into this a little further into the presentation. So I don't want to take us down that so quickly, but I just wanted to be clear that there have been some unforeseen consequences as a results of the proactive policing in the presents and some of these hot spots of is what the citation for for weather warnings were for and with the jail bookings were I don't have granular detail on each of these categories which Quite time consuming but we've been keeping that data and we've been in archiving it for that exact question. And I'm sure we can supply to you after this that we have been tracking over 300 as a result of this over 300 maintenance related issues as part of the IDT. I described earlier. And so just we've hit on some of this but just too quickly sat to catch up on some time here. So overall I'm Citywide indicators are positive overall. We talked about it in June across the city not just his neighborhood officer productivity was up 9-1-1 calls were down and major crime was down in the emphasis neighborhoods. They had over 8800 on views in May and June are cats compared to about 6,600 in 2018. So that's an increase of officers proactively addressing an issue log in that they got out and talk to somebody of 33% This work has been supported both by straight time of officers on patrol where the assistant chief and the precinct captains have directed them to these neighborhoods when they're not responding to calls and our overtime emphasis hours of about a 3800 emphasis hours across the seven neighborhoods for these two months and then There's all the stuff the other departments have done. So just said we're going to go through to eat in detail by neighborhood vet just some of the significant maintenance and sea Dept work in Ballard a lot of activity in a lot of lighting improvements in Ballard, instead. Christopher Williams will talk about in the bed in Fremont some improvements on the bike lane in crosswalks Kiosk Staffing in downtown reconfiguration in Pioneer Square of King Street, landscaping and soda water sign age and illegal dumping attention specifically in SouthPark some improvements to the skatepark in South Park. We also saw a lot of community concerns with some vacant properties and so is especially as a relates to trash and debris that's real that's associated with his vacant properties in a council member Herbalife who was part of that tour that was an issue for her as well. And then in Georgetown some additional a street light in science repairs in total. These are some highlights put in toilet Dimensions around 300 a little bit more than 300. Now we'll start going into the individual neighborhoods and have different departments addressing what they've done in each neighborhood. So sure if you want to give us a quick overview of just what was going on in Ballard as far as hot spots before we go into each specific neighborhood on the last time. We had a chance to discuss this in committee. I asked I don't know why I keep dragging this. I'm sorry to everybody the last time we had the chance to listen to have this conversation. I asked for data about why these specific neighborhoods were chosen and I believe the answer that I got from you was that it was both a combination of data on potential crime and concerns and calls and complains that Jen were generated from Neighbors to me. That's not quantitative way to Define why we're going to certain neighborhoods specifically in a way I've had conversations with folks in the central districts and they really talked about the need for more lighting and you know, that was one of the stated goals that you just mentioned a second ago. There's a desire to see more curb Cuts. I looked at you for lighting but this is directly related to Transportation. They wanted to slow down some traffic in certain areas. Wanted to make sure that there was some clear signage and lighting available. That's something that I feel like would be a great way for us to respond to community concerns, but I still haven't seen the data. So I'm wondering has the date of introduced to specifically show us as council member Gonzalez mention the slide 3 data shows the cumulative decreases in crime, but if you're using this data to dictate where these emphasis patrols are occurring have you've given us the data specific to these neighborhoods. They don't see it in this specific presentation. SPD talk about the data specifics, but in terms of central are we ended up? In fact, I think you could help number in Dallas around the public hearing that was held captive report out on some of those improvements around lighting specifically York or traffic-calming but as we go through this one also balance the Tactical kind of specific improvements with also programmatic approaches. And so that's what a lot of what the Central Area conversation was about that. We know that it's not just fixing the lighting or trimming the tree those are important but it's also investment and a Strategic investment in space programs in business stabilization. And so that's as we kind of go into next steps around that that's what we're hoping to kind of merge this into a little bit more but I'll turn it over to a speedy around the data questions. Yes. I got the number. So in the presentation we had prior. I think we tried maybe we need to present for providing in a different way. We tried to present that some of these neighborhoods, especially that Fremont was one of them was our hottest neighborhood at the end of 2018 the beginning in 2019 in terms of increase in our report a crime and calls for service. And so that they will sort of that the clear winner we're going to do this anywhere. Where do we do it and then we try to assess both Precinct capacity. If a lot of this work is being done by on Duty Officers when they're not responding to calls we couldn't do but so much in each individual Precinct, but we also had to look at with what we were asking them to do and what we were able to join up with other departments. Where were there other neighborhoods where we saw calls for service that were up where we saw a crime that was up unusually the over there with the spiked. We were addressing it. I don't think that the the thought wasn't some of these we were going to be solving long-term problems. Just the scope of what we were investing. It was addressing. Why was why was there all day and all the sudden increase in calls and crime and complaints? Do to address something before sort of got to be a much larger issue. There were some neighborhoods where it was not a they were not in the top 7, but in terms of what came up from Community meetings from meetings that many members around the stable went to with bi A's and other Gatherings. We're hearing about really specific complaints and a brother. I think that also factored into the broader, you know, where do we start this the idea was on the 07 and done and we're never in addressing the other neighborhoods. There was we have to start somewhere and where where were the places that seemed the most hot are the most in need of an immediate thing that could be addressed through officer deployment on emphasis time and through the conversation with the other departments and then see how this worked, It is a theory it is worked in other places, but we need to see you know, how this works here. What outcomes we get here before we also it says how do we do this work in these neighborhoods for their problem? So we were trying to address so that we can present that data in a different way if it makes a little bit clearer about what each neighborhood had but we try to do that in that last presentation. I don't have anything new today said it has worked in other places. You're not talking about New York or New Jersey. Are you? Anime important places in New Jersey, but I'm not referencing New York City. There are cities around the country that have done this sort of collaborative problem-solving increase officer presidents with addressing sort of environmental issues to drive down feelings of unsafe for a few examples. What cities would you cite as where it has work looking through the stuff there places where the work has been done and it was found effective. I am right now. I can't recall the name and when I reference New Jersey, it's in reference to the documentary that PBS did on the broken window strategy in Newark. So I'm just making sure we're not referencing to work clearly not a place that we want a model or policy initiatives around the South Park. Task force in the Georgetown Public Safety task force in a loudest to kind of bring some level of implementation to some of their recommendations and those were the diction of those two neighborhoods was was part of partially also based on community feedback that we were hearing consistently through our our investments at that level. So we're going to quickly if there's no keep going in Ballard some of the participants along along the walk this quickly through the Nordic Museum The Ballad of lions. St. Luke's was also talking about the impacts of their presence along Ballard comments and some of the relationships they were having with the Ballard Alliance as it relates to reach and actually providing services to on house as well as the Ballard Food Bank you could see here around the route. I'm not going to go too much into detail around it and see if specific question. Some of the specific concerns that we heard next slide were around Ballard Commons park but also throughout the the the business district around replacing signage adding bathroom capacity. I'll turn it over quickly to destroying some parks to talk about that point great. So I'd like to start out by thinking and acknowledging councilmember Gonzalez last year, you put under $30,000 in the Park apartment budget for enhance programming and activation at Ballard Commons park and this really helped us a lot our theory of change approach to really any park is we know that increased activation and enhance maintenance make a difference in a park. The third rail of that stool is as Safety and Security so we work closely with SPD when we need to do that, but by far activation and just taking care of the way the park looks makes a big difference. You all are taking some cues from some programming that his and some models that have been done in San Francisco specifically as it relates to what aspect of activation of the park which is a safe and healthy restroom that is publicly accessible. And so I just want to appreciate the work of your staff at looking at those models in San Francisco that I think have been really effective and well-received and R are good examples of how cities can meet the hygiene needs of everyone in a public space regardless of their house to status or on how status thank you and that's exactly right. We started ground or either we have broken ground on the installation of a Portland loo and that has been years in the making and we expect to have the Portland loo up and running by September weave install a temporary Santa can so that people can have access Public restroom during construction. We have also leveraged the construction around the programming an activation happening in the park. We will ramp up to 7 days a week programming an activation on August 1st. I want to acknowledge that our goal for the Greensheet was to have that done by July 1st, but we had a staffing and ramp up issues. So we are doing Friday Saturday and Sunday programming an activation. In fact this weekend. There's a kids carnival in the park. We are leveraging activation with the Ballard Seafood Festival this weekend. We are also increased our level of Park cleaning to three cleanings per day and this includes things like paying attention to benches removing graffiti in 24 hours. We treat single tents and encampments like Standalone abstractions and we'll have those removed immediately for the most part and we are working with the Ballard Alliance to redevelop the play area and Ballard Commons park opening questions on this one over to see him and talk about some of the crosswalk in vegetation maintenance in that picture. We were able to address a lot of the basic maintenance issues out there in the in the streets. I think in terms of how this this was helpful and it for us as well. We were able to identify some things that just our own inspections might have missed. So there was like an alley pothole that was leading to trash, you know, trash and debris collecting in an alley that we might have eventually found an end the draft but getting that information directly from people and how it affected multiple things from trash collection to just perceptions of Order in the alley. We want to fill that pothole the day of the Walk So able to get out very quickly in and deal with things that are coming from Community concerns. So this is quickly as in the photos, but in terms of the results of the emphasis patrols, turn it back over to a speedy. Thank you. So I'm in South Ballard rmcp neighborhood named South Ballard. Both months saw an increase in the that are similar month from 2018. So in May there was a 40% increase and in June there's a 52% increase and 9-1-1 calls for service from the community were flat almost exactly the same when you look at the major crime. We actually in 2019 at 3 additional then we had in the same time. In 2018. So distinctly flat. Then we might we matched. We you can see in the graph the sorry it's hard to turn and look and talk to you can see that the views which in 2019 which are the green line have been going up since February. We were we were already working there and then they really ramped up in May and June when this started and then July 8th Just for future slide at the partial month compared to the full month in 2018. So that's why that's just a. So we've used since beginning of May through June / 675 emphasis hours across Ballard and Fremont tracking those their combined in the budget code and then our teams made over a hundred and eighty contacts in South Ballard include 24 bookings into jail, 96 warnings Witcher both oral and written some of those we could as as earlier. I think we can get what the warning was in reference to but some of them Not be the whole the whole point is heard of an oral warning is that there's not much of an official record referrals and connections to services including 13 referrals to lead. Can you so I have some questions about these referrals that so there isn't a lot of texture in the presentation about what we're referring people to or for what so are these for homelessness services are these for what are we referring people to? From the data that are opposites were tracking for this. It's at the others crisis referrals where they're going to people connect to a Services. There's referrals through hsd to get them connected to other services that they might need. We can try to dig into that more to see exactly what was the problem that led to it. But also by the officers were doing this we weren't trying to have them overly document want to know what are you doing? When you're out there not fully diagnosing. What was the problem? So in terms of what they tracked but we we can provide a little bit more as you use the word texture and if we were also just running out of space in this present 40. It's it's really important for us to have this information and I can appreciate that. We don't want to create a burdensome structure for officers and then you should document these items, but I do think that it's Pointfest have at least a general sense and idea of what what are these referrals to and and answer of who is receiving those referrals in and part of the reason why this is important to me is because in other rooms were having conversations about at repeat offenders and high barrier individuals and actively evaluating what kind of strategies the city can utilize to be able to address that particular population. And one of the things that we are saying in the data is that we are very good at referring people and people are very good at following up on referrals. But the quality of the continued engagement is an open question. And so I think this is an important piece of data for us to continue to collect in. I know that the Seattle Police Department has been very helpful in that other contacts and providing us with a lot of really rich data to give the elected to her part of that. workgroup an opportunity to dig in and get a better understanding of who the population is who these individuals are and what their unique needs might be and I don't want to miss an opportunity to collect data that could further our efforts to really address those individuals who may need something other than a law enforcement strategy and intervention to prevent negative activity and communities so I would find it really helpful to have those referrals and I also would want to know not decide who they refer to, you know, these folks who are living in cars are there folks who are living in RVs are there folks who are living in tents and adults a little unfair to me whether these are just These these referrals are being made from contacts as part of the navigation team that are getting lumped into this or if these are independent from navigation team contacts. So this is most Patrol they could doctors could have made a referral over to the hsd side of SPD collaboration with hsd referring people for services to those officers that are part of the hsd team also we could have referred citizens just two other City Department, which I spoke to before when I was first here on trying to do an education piece to the community as well as the authors on how to promote city services in direct people to the exact Department that they're supposed to go to to ask the proper questions so we can dig that out. I've been on my Captain's now for several months on documenting a lots of information and we can pull that out. And I appreciate that and I really appreciated your comments at our last Committee hearing on this topic which you clearly indicated that in some instances members in the community officers to arrest people for things that are just not arrestables offenses. And there is I think of a greater important effort by the police department and make sure that officers who are doing Patrol understand how to articulate that Nuance in their contacts with individuals who want to see some in some instances individuals arrested for reasons that don't Merit an arrest. Thank you. I appreciate the inquiry from our chair and would also add to that in addition to understanding where these individuals are coming from with other individuals living in RVs outside on shelter information on the demographics in terms of race, ethnicity gender. I don't know that you collect income metaphor talking about crossing the street and not at a crosswalk if we're talking about littering as the two examples that were given these are going to fall into potential areas where people are going to be more likely to experience getting a citation and infraction potentially just by the fact that they're outside more often, so it'd be great to have some of that additional demographic data on the type of individuals that are potentially getting both referrals and I would also extend that request to the jail bookings infraction citations and warnings. I don't see a ton of information in here. Type of fractions in citations and specifically the jail booking content that led them to that situation. That would be helpful to have have it's pretty layered and we have we been manually recording this information as you know, our robust accountability system in the eye Pro collects the Terry stop information. So there's a couple different ways we can extract that information to get it to you that there is a reference to the fact that there were a hundred and eighty contacts in Ballard in particular and of those 180 contacts. There were 13 referrals to leave which seems low to me and just wanted to get a better understanding of Of an explanation of why they were only thirteen and maybe it's not low. So, you know how help me understand exact referral cover sheet. So the North Precinct is second-highest and referrals to lead now, we're talkin about this one micro community and there's certain criteria why or that a person must fit to be referred. So without looking at the exact referral sheets, I wouldn't be able to speak to why they were or referred or if they were a social contact referral or an arrest diversionary referral so we can we also have that information that we can pull out. Thank you. So next weekend to turn over to Bobby to go through Fremont that right there a question. We started at 10:20 and we awarded 60 minutes. But but our committee is scheduled to end at 11:30. So we technically have until 11:30 and I have extensive notes on what we collected from the neighborhood, but we don't have time to go through all of them, but I'll be happy to turn them over at any time. But things are. Yes is pavement marking on a 35th Avenue Fort. I think it's been already resolved vegetation issues. And of course there's some there is this one Street. Penny street avenue. Has been a point of discussion extensively with that neighborhood because it has his kind of narrow is a bike lane Freight access is an issue for the restaurant since there's some problem solving there and then curved cuts and then passenger loading zones. And so this is this is mostly it was related to Transportation design related issues. So to speak to the work in Fremont from the emphasis perspective, so we did see in met a hundred 61% increase compared to 2018 and proactive policing than 118% in June at overall for those two months in Fremont on 9-1-1 calls directly down 8% of the teams made 35 contacts since the beginning of may include in a mate 7 bookings in for service referrals major crime was down 42% then with property Prime down 58 incidents. I think we we see a lot of this and in the end of last year and up until right about when this started there been a large influx of individuals around the trolls Knoll area that was addressed and we've seen sort of the neighborhood stabilized and then I think with this other work, we saw some further decreases and activities in Fremont that had been a very busy neighborhood at the end of 2018 and began in 2019. any questions So before I begin my questions, there was yesterday and unfortunate incident that happened in the U District and nausea person who lost her life yesterday my in the previous presentation and are following councilmember mosquitoes point about how they neighborhoods are selected. I had asked a question about why do U District was not included giving that it's perceived crime. It's real crime data was highest among the highest and North Seattle the quite know that the points are made where you know as from SPD this morning has been you know, where we start North Precinct has the second-highest lead referrals lead expanded into the U District, which I appreciate. There is also a number of concerns that I've heard from Joey D's point from businesses there. I've made overtures to your various departments about the need for and assuming that this is done as a collaborative effort among various departments to focus our investments strategically in our city departments at the council member Gonzalez point of being getting bureaucrats out of City Hall the u-district continues to be ignored and that to me is very alarming because the investment and division isn't very forward-thinking and it's concerning because I get to be the Department's the front line of defense for my district. So I hear that time and time and time again. And I want to make something very very clear while I'm here in the interim basis. I am not here to be an interim punching bag for your department. It is very frustrating. So I'm curious to know what are you all going to do collaboratively to focus on the u-district because those are very much more durable communities spd's Point hate crime data is highest among the highest in the U District. We continue to neglect that area of Seattle. We have we made multibillion-dollar investments in Lightroom. We have a light rail station in open up. So the number of businesses that are there or minority and women-owned businesses. What focus and what priority is this Administration going to focus on because I brought it up in conversations. So I'm really just kind of asking collectively what this body is going to do. I can if you want to talk about that from the emphasis crime perspective. I'll go first couple things from the Department standpoint Department. Doesn't ignore any neighborhood in the city of Seattle. So when we talk about emphasis we're talking about. Play Space directed patrols were on duty resources. We're always there for on duty resources. And I think maybe what you're referring to for us is have we supplemented with overtime officers in that area. At this time what's happened is we meet every two weeks and sees that and we're always looking at her number. So we're always looking to readjust so is the numbers continue to plummet in South Ballard Fremont. It's very clear. I think to anyone that now we have areas that are warming up. One of those areas is University District and the Aurora Corridor which historically every summer starts to warm up. So we are currently in the process of readjusting. We taking our bicycle Squad out of the rotation in Fremont in South Ballard. We were moving them to University way that neighborhood the CPT officers have been directed to go that way so we can update you on more changes. We're coordinating. We're going to follow our lead on the homicide as you know, we had a homicide last night on the Aurora Corridor we have for this year. Corridor one of you a it's concerning to me I live in the North End so I see things as I'm coming and going back and forth from work, so It's there and we will just like we always do. But going forward will readjust resources and level things out where the data tells us to go cuz that makes sense. So earlier point and emphasis patrols would not have prevented the incident that happened yesterday on U District. What I still am concerned about is we went to do the emphasis patrols specifically in North Seattle in the areas were we when it was said earlier and Anna Anna prior committee was we receive number of complaints from from find it fix it. Well again following the logic of we use data to really go we're going to do focus our emphasis with regards to police a crime data data of of where Percy Prime real crime is highest in the U District in North Seattle. We ignored it following the and assuming everyone hear collectively with the best of intentions. Coordinating is not just police recording city services. If that's the case, why are we not and 2 director Madea's point? Focusing more where we're focusing our as a community collectively are investments in light rail or Investments are and where we're going to have new growth in terms of population with the up something happened in the U District so that to me is focusing for thinking collectively of what we're going to be doing, but we've missed the mark on this. So Cal flyer, I appreciate your point in as we kind of take this to next steps and as we've been through this a felt kind of a collaboration infrastructure if you will amongst Apartments to do this type of effort, I'm talking Owl City Service Coordination certainly as we look into the U District as you look up in like city as we look into Beacon Hill and other areas down south you are going to try to take this mop model to scale and so that's at the end of the presentation as we talked about next steps, we're really excited as a kind of effort to try to do exactly where you talk about going to the U District and and do an assessment of services as we've done in some of these areas as well, so I'm from a city Service Coordination side. That's absolutely the case. All right. Well, I want to thank cuz we're in Pacheco for his advocacy for the University District. I agree. I've spent a fair amount of time. They're not just as an elected but previous Ted being an elected office and you certainly see The Complex public safety infrastructure issues that exist within the U District that have been ongoing for a long time and I I think that the population and the people who live in the U District are unique in terms of the entire city. We have a mix of small business owners major institution students from around the world and and then just you know Legacy residents who've been there for a long time. We also have a large and shelter population primarily youth unsheltered a population and that part of town and that does include unfortunately. Students are attending the University of Washington who are who continue to experience housing instability as well. So do you think it's important for us to have an answer to the questions that council member Pacheco has posed that are holistic and give us as a council in him is that District 4 representative a better understanding of how the city is meaning those unique needs of of that neighborhood within District Force. I appreciate that the line of questioning in The Advocates either chair, but I'm sure we would love to work with you all your micro. Neighborhoods are larger neighborhoods with share District student to attend to Move move on. 8 minutes I'm going to go quickly through Pioneer Square, but some of the improvements we saw there around the cleanup Adventures repaint Adventures restriped crosswalks. A lot of distribution of sharp containers is something that the business is really asked us and then a big concern was around that was there and we were able to remove that and then also improve the benches under the part of leather in Pioneer Square results of the emphasis area. Go to the next slide here speeding So in Pioneer Square, there was a significant increase 78% in Mays 31% in June overall. 9-1-1 calls were down 15% We made over a hundred contacts in selenium a for jail bookings 22 citations and multiple oral mornings and park warnings in June. It was updated sentence for the word monitoring that there was some is the chief convention meet in June start to shift more from from Pioneer Square to Pike Pine and so were assessing how that shift worked. We did take a lot of Narcotics and Firearms as a result of the work in Pioneer Square and their mom has been 750s hours spent in Pioneer Square since the beginning of a Bobby downtown streetlight with a street light issues in downtown. I think that's been fixed already set the seat of the street and sidewalk washing and I actually learned extensively about the continuous washing at goes on in downtown area does actually it District that does weekly washing on the weekends the landscape maintenance the news newspaper boxes, which was an interesting issue in downtown is that is attracting nuisance these empty boxes and then dealing with 3rd Avenue kiosk and so I'll just leave it there for now again, I have extensive notes if you would like us to turn it over. So then in downtown which is a little more amorphous for us to design in terms of pulling data exam to go down to the reporting area to get there's no neighborhood. That's exclusively sort of the pike-pine corridor. But in the how we were able to pull the data we did see that officer on views were actually down in May and June on this cuz there's always consistently a lot of work going on there. But we did as mentioned in June start to shift some of that work that have been going on in Pioneer Square up to Pike Pine. They made over by the be down compared to 18. They have made over a hundred contacts including eight bookings 45 in fractions, 11, oral and Parks warnings and one service referral crime is down 61% in May and June and it was down the three incidents and over 700 emphasis hours since the beginning of May. Okay, well going to Sotto Sotto is a pretty Dynamic place the first soda Bia dad made considerable Investments and their services Devon. I think a million dollars just last year including homeless Outreach and enhance Services major issues are parking signs vegetation maintenance RV trash removal and RV issues in general and including during sports events and the public health consideration for 4 again RV related issues and I'll just leave it there. I have extensive notes if you need them. The format both months and overall 9-1-1 calls were down and Soto officers made over a hundred and twenty contacts and speaking anime including 4626 bookings to service referrals and wine including sorry not and including one referral to lead property crime, which was the major concern is with down 9% in the past twenty-eight days over 1500 Fitness hours not split between Soto and Georgetown just because of the budgeting code but a lot of work being done in soda. Can I just much more thing? Because it includes Industrial Area the workers and bus services was also an issue. So quickly through in Georgetown again, thank you to the Georgetown Merchants Association of Public Safety task force about this coordinate. The tour in there was a lot of requests for sign repairs the vegetation me an example here as well as some Piedmont markings that we attended to So again in both Mohnton views were up at the lot in June 916 percent for oral warnings to citations in one jail booking overall crime was down and incident in May and up three incident in June but 60 or property crimes in June a lot of work around RVs in this neighborhood. We have here a lot of calls for that calls for help cost for ask for help the 9-1-1 calls of people asking to address RVs in the neighborhood and again that split the 1500 hours. South Park, I just want to again thank yous Court, Martinez Paulina Lopez been clean of Coalition really helping us put that together as well as the merchants in South Park. There was a lot of work that was done by a parks in s. So, I'm going to go and turn it over to Christopher and then Sam great. Thank you. So seamar owns the skatepark in South Park and we are currently working seamar to develop and mou that would allow us to engage him continuing maintenance of the skatepark. Are there a few images there that show before and afters are Cruise did enhanced Fleming up a Francis to create sight lines to the park from the street. So SPD can drive by and see into the park. We remove lots of vegetation litter and garbage waste and I continue to partner with seam are the local community to do graffiti removal and to really take care of the things that really I think emphasize that Broken Window Theory the quicker we can clean it up. Then the more that gives a message to the community that this is a kare-kare cared for a lot of space in the communities and Street at that way another area of emphasis. As you know where Concord Elementary School is placed in and a lot of our South Park families are regularly using trails and the bridge and access to that and lighting around that is always been a concern and so a lot of s. Hours of paid attention to that to to make sure the data that uses and kiddos work. We're safe and accessing that trail and so turn over to Sam Parks and Rec were able to do Benefits of coordinating these efforts are that we're both doing those things at the same time. So it's not it's not going out one week and then Parks going out the next week to do similar or 6 months later do similar things worked out of concentrating and focusing all those things right at the same time. Just no cancel. Amber Heard is not here, but I know she would bring this up as if she was the issues around vacant properties and was also something we heard very consistently not just in terms of one that was particularly of concern that burned down a couple years ago. That sdci has been working with the property owner to to do some cleanup but then along 14th specifically and Cloverdale some properties that have been brought up if I eventually become projects but in the meantime are fairly accumulating litter trash and so SDC, I did go and work with this property owners in significant clean up those areas. What's important there is a similarly it's it's 14th on one side and a very useful Muse Trail on the other Valley. I guess on the other side that has access into the business court or so a lot of business to the South Park retail business Side Merchants Association was very concerned with that as well as a community members there. Government that that reminds me of the article I saw this morning. It was originally published in Greece, but given that much of The Dumping illegal dumping that's occurring appears to actually be generated from those Warehouse not those who are houseless. I think that's an important element as we think about who's being start of Target in may be the wrong word who's the who's being pointed to as the culprits for the garbage? I apologize Council should I do have to leave a little early? I just want to say I appreciate the the information and to the point that were made earlier by a speedy. I did go back and look at the maze presentation and do see the date. I'm sorry for that. I overlooked some of those data points in the past. I think he's still really well taken. How does that data compared to other areas in the city. I also continue to be interested in the demographics that we talked about and overall. I think that will help inform our future analysis of this I think right now my biggest question is how does this comport with our City's commitment to raise in Social Justice are rsji efforts and I believe to cancel Amber Gonzalez is point to our commitment to Diversion work and getting more folks than to leave. Those are some of the big questions that I still have and I'm concerned that the hotspots Focus. Get us away from some of those rsji and diversion principles without a total analysis of how we're getting folks into Services versus citations and jail. So appreciate the presentation and I do apologize for having to go early. Thank you for attending appreciate it looks good. We have a few more so we'll both months by a lot and then one calls were down almost 14% And South Park. They made 15in jail bookings since the beginning of May and June report a crime was down 11% which is 4 incidents against fortunately not I shoot number but still every decreases a good one and / 285 and paces hours have been used since the beginning of May. Let's just start an overview of SPD takeaways, which I don't know if you want to expand on that at all, or if we can move on to the feedback loop. So I had mentioned actually as soon as we know this this approach. We actually did hear from a lot of communities asking if you know, why aren't you here or we want we want this type of coordination including the University District that also this is working in terms of what I'm talking about. I'm kind of City Department collaboration and delivery of service and at the very basic level is just communities access to department leaders and decision-makers at so that they feel that they have that connection into city government which for Department of neighborhoods is a core part of our mission is to lower the barriers to participation and information city government. So we been doing a lot of thinking about how do we continue this collaboration now that we built up this kind of infrastructure if you well, so just quickly as I mentioned we have three we through this process filled 305. Maintenance and Service issues, we are doing regular updates to the community through either to screenshot here that Community walk updates to this is an example of the one that went to Soto that shows some of the improvements that were made and then also a link of a live links to resources and information for additional support. So whether it be the Community Service Officer is whether it be the find Fix-It to a Weatherby other resources in the community. So we'll continue to update that with some regularity the next slide there is how do we take this start to take this little bit more to scale? So I mentioned the community walk updates at the mayor's direction. We are forming under the leadership of senior Deputy Mayor Fung but also director Lee and myself a neighborhood community solution team, which is essentially how we take this into other other communities and I'm tired talking again the coordination of City departments. So as we look at that and as we look at potentially monthly director-level or Keystaff tour similar to that. Then with Community round table so that we continue to establish this community feedback loop, too often. What we're seeing is that folks don't know how to access information that they need or access it in a timely manner. So we see that this model is working. We see that there's a there's a demand for it. And so we're waiting to feel that the man but we know that it can't just be the walks. It has to be paired with programmatic investment as well. And so we've been doing some thinking around and similarly in central area has the tallest to the public hearing and some of that bridge that we working on that is really tearing this with an affordability and anti displacement dialogue that talks about all the Investments that are happening around affordability. I weather to be threw a curveball development initiative whether it be through the various executive orders that The Mirror Has assigned as a really stay inside displacement are housing choices Weatherby opportunity zones, and how do we That all together in a relevant way that not talks to the Community Values and and informed by community. So we see this is kind of a central to that though is a find it. It's better find it fix it departmental coordination and there's a technology solution that we need to integrate and working with the csb and FAS on that portion is going to be essential to us being successful. So this is kind of how we move into the next steps on the neighborhood and Community Solutions team as I mentioned. It's going to be me to continue a relationship building with Community as I mentioned again did building Brigham City Hall out to the community Through walks in community round tables. It's an opportunity to identify the challenges improvements in and other opportunities for to say to address of community concern by saying hey we hear you but you know, we can't do this for whatever reason right now, but we're logging in. And then this existing beyond the areas that were already doing it. So diversifying areas beyond that. This is walks. So that's all right sensation any questions or additional comments? I appreciate the presentation for today. It was very detailed and I appreciate that again. I think they're Yeah, I really wanted to sort of emphasize around the theory of change that my questions are not designed to to send a signal that I'm trying to undermine this effort. It really is rooted in a sincere desire to have a clear understanding of what we are expecting to see as results and and I take that responsibility as a council member with oversight responsibilities very seriously and so for me when I asked those questions and I don't ask them casually and I'm not trying to be flippant. I am I am very sincere as the chair of the Public Safety Committee and understanding why we are allocating resources in a particular way and for what purpose and what will the outcomes be that our constituents can expect to see and that's an important part of transparency. An important part of accountability and it's an important part of just getting back to basics and delivering city services in an equitable Fair manner to communities who feel that they have been not been seen these types of Investments occurring in their neighborhoods that are contributing to livability issues that will ultimately exacerbate and compromise some of the good work that we're doing and other spaces and another in another areas of a programmatic work for the city of Seattle. And so I appreciate getting a little bit more texture around what that the theory of change is here at I think we have some clear follow-up in terms of the questions that council member of us Kate opposed the line of questioning the customer Pacheco made around Avenue District in particular, but also some of them some of them work Wrangler detail around referrals including to lead and And and some additional details around what kind of citations are we giving? What kind of social contacts are we having with individuals? I recognize that there are some instances in which people will behave in a certain manner that is not acceptable and that that will require a public safety law enforcement consequential consequence approach. I acknowledge and recognize that that is sometimes the reality. I also at the same time acknowledge that there are opportunities were law enforcement may not be the appropriate tool to intervene and to you and to prevent that behavior from occurring in the future and that's when we want to really focus on those diversion aspects to make sure that we are not taking a few no broken windows approach that is really just focused on zero tolerance and funneling people into into into punitive jail systems that are extremely expensive and Ultimately not going to yield the behavioral change that we actually are seeking to achieve. So I appreciate again the opportunity to hear more directly from you all about what it is. We're trying to accomplish in a more holistic way and address your point around making sure that as a follow-up in it and a feedback loop. We are really focusing on Upstream holistic approaches that will ultimately also create a huge impact might not be immediate but just because it's not immediate doesn't mean that we should do it. We should be so tempted by the Quick Fix to just abandon some of those long-term sensible solutions that we know will work to address many of the livability issues that that individuals are expressing concerns with today. Thank you madam chair and I appreciate the committee's attention to this issue. Thank you so much for being with us.", "end_time": 7805.7}]}