{"format": "raw", "annotations": [], "confidence": 0.9345424908238489, "data": [{"start_time": 0, "text": "Good afternoon to the regularly scheduled meeting of the Human Services Equitable development inventor side comedy. The time is 2 or 2 p.m. And we are in city council chambers on July 23rd. And I'm joined by a council member worst. Thank you in today's meeting. We have just one item should be a quick meeting. We will discuss with Representatives about their out-of-school out of school time meals programs during the school year as we know many Seattle students depend on free and reduced lunches and during the summer of that nutritional support is often not available in this program. We do have people at the table before that we had Public, do we have any buddies Dead version? I can do it. Well, please. Do one sentence introduction for the record and then you're free to take it away. Good afternoon, Jason Johnson with human services department. Wells payment services department Natalie Thompson Human Services Department Youth and Family empowerment division senior planner I may be going from Council Central staff. pepper down from your eyes All right, so I'm going to go ahead and kick ass off today. We want to talk about and have a discussion about hsts out-of-school time meal programs. This will really be an opportunity to outline hsd's food meal portfolio with a specific focus on after school meal programs in summer food service programs together we call that out as the out-of-school time meal programs, but we weren't going to talk about both together because they're at a really important element of how we maintain nutrition and health for students who may otherwise supplement their food inside of school. But given that school is is out. It's important that programming is in place to make sure that they have the same level of access to That important midday meal programs and what do we mean by time use if you can explain that? I I assumed it was I ready. Out-of-school time. Do you see what I'm saying? What were the wartime say? Yes, we're going to go into level of detail about both and what you'll see is it is it summer meal program? So that's a time when school is not normally in session. There's also after school time program. So that's meal nutritional support out of school hours. So we'll go into the details of programmatically what we mean when we talk about time and we talked about that level of access. So I am first just want to highlight that you know off and I feel like I'm at this table to talk about homelessness and housing stability, but there are many other bodies of work within the human services department with that are extraordinarily important. This is really highly qualified a 200 of experts to superstars from Our Youth and Family empowerment division that division, you know, we want it's through Investments and the work of Education that we want to ensure that young people are safe that they're thriving the families have the support that they need to continue to grow and successfully become a contributing adults. We do that through food Investments most of the food investments in the department live inside of the Wi-Fi Investment Portfolio. Not all of them. There are some very specific or tailored food Investments that help support people who are experiencing homelessness that we have in in HSI, and we have quite a substantial food and meal investment in our Aging and Disability Services Division 2 support older adults, but most of our hunger strategy and those Investments to combat hunger live within the Youth and Family empowerment Division, and I'm excited to be here at the table with two of that divisions best. Thank you Jason. So as you know, the human services department funds arranged of food access and food Security Programs from Seattle's emergency feeding system, which comprises I'm which is comprised of food banks and meal programs to freshbooks to go and Arlo barrier food access opportunity fund all programs as a slide States tries to ensure all people in Seattle have self-determined access to healthy affordable culturally appropriate food. So as Jason mentioned the majority of the contracts for food access and food Security Programs are administered through the Youth and Family and Parma division, or at least a large portion of them are and today as mentioned. We will focus on the Youth and Family Department divisions out-of-school time program and to your question council members who want when we talked about out-of-school time, it's really Any part of the day that is not when children are not in school. So we could be before school after school school breaks Summer and the like so we provide meals at all those times a day. And weekends to sew a few food security data points, which are important to reiterate today from the healthy food availability and food bank Network report, which I know you're very familiar with but we just feel it's again important to highlight roughly 13% of Seattle adults report experiencing food insecurity with Seattle families with children experiencing even higher rates of food insecurity of those families with children 22% of families with young children and up to 51% families with low income children report food insecurity. So in 2017 over 13,000 Seattle residents experience food insecurity yet. Their incomes were too high to qualify for foot is assistance benefits, and we consider those families in the food security Gap so our food investment. Focus on any Seattle resident at risk of food insecurity including those in the food security cap. So next side are out of school time meals program has a particular focus on children. So the out-of-school time meals program is nestled in our child and youth nutrition program the child and youth nutrition program is a strong lineup of three programs childcare nutrition focused on children and meals and family child care settings. And of course is mentioned our after-school meals program as well as our summer food service program together are are are the out-of-school time meals program which path will talk about for so all of these programs and Shore access to meals where children are at licensed childcare community centers cultural organizations Parks Community Center and the like so they're offered year-round including weekends to ensure that children and youth who rely on free and reduced meals during the school year have continued access to meals during out-of-school-time. They're funded by both the state and the city while the office is superintendent of Public Instruction is a primary funder. They manage Federal what USDA dollars would get tossed food to us. So we must ensure that our guidelines meat USDA regulations and guidelines as well in terms of meal patterns and Go ahead and also dead. Do you have a question you seem like a guy cuz my voice Adidas chart yet. I'll tell you the problem that I have an icy charge like this is there's no numbers attached. Yes. So we have numbers. Are you? Okay good because we were going back on the when we were looking at the the food for children before school after school and on Summers and then we were trying to parse out as we're moving forward on some of these issues how much was coming from the feds and then stayed and then I'm sorry that the general fund and then the sugar tax and I know that you're going to come up on those numbers soon. So you can come visit. This is 2018 several racked 8.18.18 in writing. So for the after-school meals program. This is - staff costs will just the cost that get sort of passed through to the community and the cost. The program again - staff cost 193751 for that first bar after school meals program. The child care nutrition program is 1112837. And the summer food service program is 590-7274. So just shy of 600,000 and we can provide those in writing to get yeah, and then the sweetened beverage tax just to know that has really paid played an important role in improving the meal quality for really all of these programs. So I have got those numbers cats how much the question that I was going to ask because two of these three bars the middle bar in terms of attack quantity is 10 times as much as the first bar and write correct and that's really because the after-school meals program was just newly launched late last year. So we anticipate that that program will continue to grow. And then the summer meals program is like five times as much as the first bar right? That's correct. Improved. You saw the quality of food in this made by me and be off base here, but did it improve the quality of how delivery and service? Yes. So all of the above. Yeah, that's a great question. So just some concrete anecdotes to that. So last year we added a hummus the spicy hummus and regular hummus dish at the request of the youth and did. Yeah, I should be ashamed to loosen bolts over that and I don't like Haley there. So I'm just going to put it out there. Know how bad is it? Okay, if I tell you that you'd enjoy the spicy how much they didn't enjoy the regular so much and so we kept that they did improve the quality but also to increase some of the efficiencies with route planning and delivery. That's what I was going to say. Thank you so much. Improved because there were extra funds to be able to use it primarily. So what those extra funds did was to allow us to hire a year-round out-of-school time meals coordinator, and that was huge because what Alexis was able to do number one is entitled talk a little bit about the start Outreach much earlier for the summer food program and also do much more systems and planning work before staff even started as you know, we have seasonal staff for the summer food service program, but to be able to do that systems planning around routes and deliveries was also very huge on low-income lunch and where the food banks were already putting together backpacks for children over the weekend, which was phenomenal for North helpline. So thank you so much for that. All that's great to hear you. Am I on a real quick before we move on DUI. Do you have a sense of in terms of that out reaching up helps get more people who qualify and should be part of the program into a to get a sense of how many families in Seattle that should be participating in or could could or should be participating in the program. Do you know a lot of these a lot of programs like this many people who are eligible don't wind up taking advantage of red you have a sense of how much I guess for me it is I can tell you how people qualify for the program and what we're doing to outreach bad. We really for that number for example for the summer food service program is based on the free and reduced lunch participants at the different neighborhood schools. And so we know that all the children that are eligible for that the free Android Lunch program don't necessarily take to take advantage of the summer meal program for a variety of different reasons. So we would have to do some research to say Seattle Public Schools. Will you please tell us how many years are actually and even they have admitted that even though their use that are eligible for free and they don't sign up they don't want the families don't want to provide the paperwork. So it's it's we can give you we could do research and find the number but I don't know that we would know the hard exact number but we are doing all the couch that we possibly can to make sure that every family that wants to participate can. Thank you. All right. So I'm going to start with our child care nutrition program and we are serving 130 family child care home program in our nutrition program. We provide no reimbursement for these so that they healthy meals that they provide to their to the children in their care. We offer ongoing support for these and home small businesses owners for serving low-income families with tools for best practice record-keeping menu planning a sound business practices the family home child care provider servant average of 6 to 12 children are per week. The family child care providers receive ongoing education to increase quality and variety of foods through one-on-one visits and workshops by the child care nutrition staff and because we receive funding from ospi the program still, okay. Not only in Seattle, but throughout King County. As now we set before our after-school X Program includes both the after-school meals and the summer food service program in 2010. The healthy hunger-free kids Act was passed which made it possible for us to get no reimbursement for throughout in all states. So we added the after-school meals program in 2018 to provide meals at after-school programs and during the school breaks throughout the school year so examples of the after-school programs with you tutoring cultural enrichment and that those kinds of activities and we and I just say that the summer food service program is a pillar and wifey's food program portfolio that Natalie talked about earlier. An HSE has been operating the summer food service program since 1977. So even though I have a gray hair for you before me. All right. So as I said before the after-school program was launched in 20 in October of 2018, and we were able to recruit five sides and low-income neighborhoods around Seattle. And in the spring we serve school-age children everywhere from kindergarten to high school for participating in tutoring programs as well as cultural enrichment activities after school and on your brakes this school year 2018-19 school year we serve approximately 10664 meals and decide the fights average 20 to 25 children and use per we going to these locations. Are all even though we only had five this year. They were diverse populations are Partners were East African Community Services Refugee Women's Alliance and three neighborhood library, South Park High Point and Broadview. Four of the five of the school size Also Serve summer meals, so it's a continuous. comprehensive service This program is got off to a strong start and we're playing to increase the number of sites and fall 2019 as now we said we've hired a full-time out-of-school time coordinator and they're working on recruiting more sites for R Us start in September 2019. Okay. SAR summer food service program the city of Seattle is the largest summer food service program sponsor in the stage. And in the summer, we have a hundred twenty sites across Seattle, which is a significant increase from previous three years and you'll see that in the next slide and last year. We served 202 629 else over 5,000 use a just went through 18 and we provide meals and neighborhoods with a high percentage of free and reduced lunch participants as determined by their neighbor neighbor schools without talked about earlier. That's how we know whether or not at a place spot can be a service. This is a low barrier program application is required at the open sites like the parks and places like that because the eligibility of space on the neighborhood School. However, our clothes sites must provide income information verifying that at least 50% of the participants are low income. Sweet beverage tax funding is add more vegetables at their lunches and Priests the whole grains of snacks and replace juices with fresh fruit at breakfast. We partner with United Way of King County which provides roughly Thirty America or quotes about volunteers to serve food and provide enrichment activities at the parks on Library sites. We contract with Seattle public schools which provides the meals and snacks. Next light so now we get into Earth satistics. I'm as you can see. I'm real site meals and sites have been decreasing in to from 200 FM 2016 to 2018. So I know you want to know why so I processes is that due to the changing demographics apart income levels in Seattle neighborhoods to your area to meet the free and reduced lunch at Newport schools to qualify for this service. In addition in recent years are funder. The office of superintendent of Public Instruction has been encouraging more community-based ethnically focus and Grassroots organizations to become a sponsor stem cells to contract directly with OSBI what we think that's a good idea. So we're also Focus are recruiting at simply focus and Grassroots organizations that really aren't prepared to deal with the administrative burdens of paper. Ospi and I can tell you it's a lot. Can I ask just a real quick question if the graph on the left goes to 2018 in the graph on the right which has the bigs at which has a bunch of extra sites that's in 2019. Is there going to be what's going to happen to the number of meals once you get the 2019 and also why we think there's going to decrease so we are hoping that some of these factors will not be in this text this year. So We've been criticized 220 the summer and 50 or brand new to Summer Food Service program. So it's working I think and then the meals are provided in the library's Parks low income housing community centers country-specific Child Care Centers Seattle Public School summer programs Community organizations and to Tukwila public school. So other factors for which will address some of what you're asking for reduced meals. Is that even though we partner with the Seattle public school and we provide meals to their jumpstart and summer staircase Summers staircase program. They have reduced the number of hours they offer those programs. So if Is a summer school for example for teenagers? It's the program ends at 12. So I'm not going to wait around for a lunch. They're going to go down to McDonald's or something like that. So and then to jumpstart Jumpstart program is only for one week, but we we do provide meals so and then and I've been working on summer programs for years. The weather is a big factor. I don't know in Seattle weather wimps, and I think that goes on to our children. So it was too hot they don't come out if it's too cold. They don't come out no matter how wonderful the activity years. And then last year. We had a smoke from the fires in Canada. So we had to close outdoor sites for safety. And so I'm hopefully there won't be any fires from Canada and the weather will be modern enough for children will want to come out and come to the size. Oh, yeah, well, maybe to come later. Yes, so that ends my presentation and for further information. We have a website free summer meals. Org or we're getting into the centuries V 21st century. We can text food to 877-8772. Your two sites is being used by people. We haven't tracked it yet. But all of our monitors, we we test it out this morning just to make sure it's working even be if you live in Federal Way, you would use a text in your zip code and then they will tell you the ones that are close to you on the previous slide. I was just curious to see that the number of meal sides remain fairly constant. I mean, obviously very close to each other between 2016 and 2018 and yet the Dusseldorf significantly lower in the Years 2017 28 soaking of the word more or less the sites were kept. The weather going to take that one I can speak to that because I'm so the number of meals served is actually fairly nuanced as you probably can guess and so for example, we're very encouraged that we've increased by 20 sights. The number of of sites that we have enrolled this year. But we also know Seattle Public Schools due to weather extended it's cool here by a week, which meant our program started a week later which could mean again Lower meal count. So together with the number of kids served the number of sites enrolled as well as meal sites. These are data points that we look at together so that we can get a better picture of really what's happening. Find me the week extending from the school presumably they were then receiving the after-school meals, which is called it separately. Yes. Yes. Hopefully though that again is still in startup. So we have a lot of those. Yeah, that's true. In what way is RR out-of-school time programming programs coordinated with or if they are with other cities in King County with the county itself the question you want me to take sorry. So I can take that question too. So we are part of what's called that after school meals task force, which actually is a Statewide provider network of out-of-school time meals. So we sent our supervisor Tina skilton sits on that task force along with United Way of King County some other counties providing meals as well as large food banks who are also out-of-school time meals provided that's all we share information coordinator learn from each other that Wright-Patt anything else you want to add to that. Okay? Yeah, so we do do Compare amount of coordination and at least info sharing so I don't want to speak a little bit to Ted's question about enrollment and participation and we know that Nationwide participation and is it's fairly low for the summer meals program at the out-of-school time meals programs in general compared to the number of Children and Youth that receive free and reduced lunch in school. And we think that's due to a number of factors. But what we really like to focus on in our out-of-school time programs in sweats within our span of control. So in 2016, we had a graduate student intern cohort that really looked at strengths and barriers to participation and they identify key factors that we really can work on including hiring a year-round coordinator so that we can get more sites and increase access point. So we've been really trying to I'm happy to provide that reports with quite extensive. They went out and surveyed 58 of our then hundred programs in asked really pointed questions about participation. And so we know that actually Quality of meals matters having a year-round person so that we can start Recruitment and Outreach and engagement matters which we have done. And so we're really trying to increase participation through the things that are within the span of our control. So summer school length of time Less in our control, but other programmatic factors certainly in our control and I would also add that especially for summer food service program are the primary food provider is Seattle Public Schools, but they have to prepare meals for a large numbers. And so when we start negotiating with them back in April, they are we give them are protected number projected number of meals that will be providing. Will they go ahead and buy and purchase that that food ahead of time they provided menu. We approve it until one of the things we're always working with them as to get a more appealing menu, but Play makeup this only so much flexibility. They have since they're preparing the meals there are going to food in advance and then having to pair prepare the meals for a large number such a large number of of views during the summer and I would also have to one of our recruitment strategies for the upcoming out-of-school time program is that we have a number of Youth Development contracts where we actually fun after school activities. And so trying to work more closely with those organizations that I would be it would be appropriate to also provide meals better better meals than chips as a snack or participating. So that's another one. I just want to go back to one of the slides just cuz it's stuff like this is my question is this so he said Seattle has the largest in the state for this program. And so does that mean that were the first to do this or there other cities within King County that are doing it cuz we know food scarcity is obviously everywhere. So Patricia traditionally its program is offered by School District. I believe there's also a mandate that if that school districts have to provide meals for purchase at a participating in their their programs and so since 1977, we've been in partnership with the school district. That's why there are because technically they should be providing the service but by the city are sitting at providing this we're broadening our reach so around the state there would might be just the school district like for example School District Food Service Genesis shame that Seattle is the largest and doing all of this. So I was wondering what the other 38 cities were doing. So well, I've seen signs for summer food service program. That's why if you text 877-877-1040 code if it's outside of Seattle, they would give you another location. Like I know when we tested it this morning to make sure it works before I came out this number. Will I be put in a Federal Way ZIP code and we got location to Federal Way, which we don't provide counseling persillade will understand. This is well as if you should have on on Seattle City council. You also have to serve ice 1/2 to 2 King County boards, and we also serve I serve on the Board of Health customer was wanting I also serve on the Puget Sound Regional Council from different cities like Auburn. Federal Way Kenmore what we're doing that? We're not just a bunch of crazy radical seattleites that we actually have broke. And so I know that you don't have that with you, but at some point if you could share if if there is other information about what other cities are doing, this is something that I think we would like to go to bring up a King County. Yes UPS nnn promoting the the reality that these are programs in the interest of all low-income people regardless of City boundaries its units for old all the kids and there's a lot of families. Unfortunately that are in grave need and as you agree that Natalie the the work of show that these programs because there are it is they are underlined or I will say to one thing that we hear from our national colleagues that we are so very appreciative of within the city of Seattle is that is very rare to have this blending of, federal funding as well as City General fun at an arcade sweetened beverage tax fun to supplement the operations of the program. So many other cities just rely on the federal pass through which means that I'd have no city funding which means it's a very bare-bones we get to you no have hummus and Mediterranean pasta, and that's all I'm going to say. I'm sorry doesn't agree with you. So that doesn't go in over our heads the funding from the city makeup. So very important point and we definitely a point to be made at the regional policy committee that interviews programs are greatly an answer until he's also supplement the funds exactly substantial. How much for your time just give me Services Department Summer Youth Employment Program. I know dead and mouses have been urging you to make a presentation. But I think would be hard from the Department is that the mayor is making some adjustments about the program. I'm just curious I presume so the programs are in action now, that is correct. So, hopefully we can have an update email update. Absolutely. I think we have to coordinate the timing of such an update but happy to come back and and and provide that. Soon going to be heading to August break be greater than you can coordinate in terms of getting an email update because it's these programs are of great interest to a lot of people but especially given that a lot of these after-school program summer programs both in terms of Millsboro to activities and Richmond activities are so relevant in the discussions about what how do we bring down youth involvement in? Activities that are not going to be good for their future and how do we make sure they're enrolled in productive programs? So You know just how far us as an office to have information about that is extremely useful so it'll be great just quickly. This is for the United Way this isn't this is your programming. Here it is. So I see you have lawyers helping hungry children has a d v t shirt on. Thank you. Thank you so much. Thank you both.", "end_time": 2317.9}]}