{"format": "raw", "annotations": [], "confidence": 0.9296694977415932, "data": [{"start_time": 0, "text": "Good afternoon, everyone and welcome to the finance a neighborhood committee. Today is July 31st. It's 2 p.m. I am Sally Bagshaw chair of this committee financing neighborhood bank accounts member Pacheco for joining us. Thank you Allison. Forgetting is organized. This is a special meeting today. And first order of business is to approve the agenda. And if there is no objection, the agenda will be adopted. No objection. The agenda is adopted items on our agenda today. The first is a briefing discussion and possible vote for a human resources ordinance that's related to City employment. And then after that we're going to begin our supplemental budget review and I appreciate that is here will be back. Thank you so much for being here. There's no vote on this but we're going to be talking about 5 supplemental items and the exceptions ordinance the carry-forward ordinance. Supplemental budget ordinance the CIP abandonment ordinance and the grand acceptance ordinance is my hope today that we're going to get through all of these items and fact I'm going to insist that we get through all of these items so that we can bring them forward and we will deal with the votes in the Amendments on August 9th. So right now we're going to open it for public comment. Seeing nobody who is signed up or interested in this and don't take that personally. I know that budget is an exciting time for everybody. So since we have no one here today, we're going to move right on in and Allison if you'd be so kind as to read in the first item of business for certain job titles. Very good. Thank you, Dan. Do you want to start introductions? And it can we turn this down a little bit Allison. It just sounds like we're at going in here. Thank you. Dan Heder cancel Central staff Sarah Butler St. HR policy and legislation advisor relations to go see are sign of cellulite station would raise the wages of two types of hydro maintenance workers at Seattle City Light. I'm going to summarize the central staff memo that is attached to your agenda and by Rafi Roofing some background and then I'll describe the physical impacts of legislation its own terms of encapsulation of some of the background Hydro maintenance workers at Cityline are covered by a collective bargaining agreement that permits the union to request it weighed review of job titles and also authorizes a weed Review Committee at study light to rule on wage increases subject to final approval by the city council. In August of 2018 the union IBEW Local 77 requested a wage review of the top step of the wage progression for two positions Hydro maintenance worker 1 and hydro maintenance worker 2 in October of 2018. The City Light wage Review Committee took action supporting a wage increase siding several factors. Proposed wage increases applicable only to the top step and wage progression would be based on a certain percentage of a baseline wage. That is the establish wage for a more experienced journey level position. The proposed legislation would do the following. It would establish a new so-called Baseline wage at $47.51 per hour for a hydro maintenance worker 1 that legislation would increase the top step to 75% of this Baseline wage resulting in a wage increase to $35.63 per hour for a hydro maintenance worker to the increase to the top step would be up to eight would go up to 80% of the Baseline wage and that would result in an increase up to $37.83 per hour. In terms of the physical impacts the proposed at wage increases would change the wages for 9 existing possessions and this increase would start in the pay. Following the effective date of the proposed proposed legislation legislation would not authorize any retro pay and executive estimates that the proposed wage increases without a total of $77,000 annually and City Light plants to absorb these extra cost without requesting additional budget Authority if there are any questions, I can answer them or perhaps. I'm focusing on the Baseline wage. That's for the entire bargaining unit. That's helpful. Thank you. Anything else you'd like to add Seattle City Light. Sample of the really collaborative process. We approach to swing gauged and discussions right away. I think the meetings were professional there was agreement pretty early on then this is legitimate ask and I miss him something we had been radio on for a while just because the accretion of Duties with this particular classification overtime and the relationship of the work that they do with their Journey workers out there. So really good process in general and it's nice to see it come to fruition. Very good counsel any questions All right. I think if there are no further questions and without further Ado, I'm just going to move approval cancelled bill. Just hold on. One moment. Cancel bell one 19579. We have second all those in favor. Say aye aye no extensions. Thank you. One last thing for Seattle City Light. Thank you for the excellent event that you had and participated in at the Denny substation. It was a delightful day wonderful project, but I also want to acknowledge how much good work that we had done bringing in apprentices and they've at The Apprentice program pre Apprentice program and I had a good time talking with a number of people there that were in the program starts on its own and thank you very much for your participation as well and how it was. It was a wonderful day. So it's a good thing. We've worked a long long and hard on that project to think so much. Okay, very good appreciate that. So the next five items were not going to be voting on these but they these are all important. So as Allison's reading this in and then I'm going to invite you and anybody else Eric time to come up and join us. Would you like me to read all of them next item number to cancel the one 19572 an ordinance and then in the morning, it's 1 to 5493 which invented the 2018 budget including the CIP item number three counts of 0119575 an ordinance ordinance 12572 for which adopted the 2019 budget including the 2019-2020 for CIP a number for an organism in an ordinance 12572 for which adopted the 2019 budget including the 2019-2020 for Capital Improvement program. I remember five counts of 0119576 an organism any ordinance 12572 for Witch Doctor the 2019 budget including the 2019 and 2024 CIP and finally I can smell woman 9574 North and South rising in 2019 acceptance of funding from non City sources. Are you going to discussion for all five? Very good. Thank you so much for you or Tom going to introduce this. How do you want to proceed? So I just wanted to make a quick are rather ask a question, which is are you comfortable having the five ordinances sort of presented as a body of legislation and kind of want to go or would you prefer to have them separated for not voting the distinction isn't quite a substantial analysis read them all and so I think at the point where you're shifting if we just make it really clear that we're shifting so that the record is obvious for anybody who is interested the agenda item number and the order that it's listed in Tums memo are different. Can you just like what the bills respectable bills are. Thank you and welcome, Tom. As you are introduced we have five separate pieces of legislation. So together they comprise the 1st supplemental adjustment package for the 2019 budget and is Allison indicated. The agenda is slightly mismatched with the way the memo was written, but I can point out the road map to to link two together. I'm so kind of starting from the first so if you refer to the memo, the first bill is Council Bill 11957 to and this is the informally or perhaps finally trimmed the exceptions ordinance and what this does is well by law. City departments can't spend beyond the amount allocated in the BCL at the PCL level. I'm however there are none. Can I just make sure that as we're going to this that we try to avoid acronym so at least once we talk about budget control level at Henceforth PCL just to make it clear control level is the legal level of control and it has happened from time to time. There are instances where the actual level expenditures exceeds the PCL and and it's it's appropriate for the name because this is the exception rather than the rule and in most cases that does not happen, But there are a few items on Taco Bell 11957 to totals $13,000 13 million 13.7 billion dollars worth of this type of change impact conveniently. The bulk of that amount is in one item, which is to increase the FAS customer request a tenant improvements program on budget. So what the what's it's in formerly referred to a security program does is it provides FAS with the expenditure authority to complete work that's been requested by City departments and it's it's the Actually, I'm just passed through budget Authority. So the original cash comes from the apartments and it flows through FAS who does the work and the intent and I've kept made this adjustment in the fourth quarter supplemental for 2018. However, I'm due to an error in the process that would that did not happen. So this is correct for that. I'm so that is the bulk of the 13.79 dollar change. OfficeMax will Nation a separate go with us. If you will. What I wanted to say about the exceptions is that at some to have this year in front of you at all? Our goal is to produce a budget and to administer it without any exceptions at the end of the year. I said the same thing last year and I'm here again. So I we have not perfected this in our defense is 259 to is something we are at the new accounting system is something we are still working through and this was the first year we did the first time through your end under the new system and there were some things that were missed. I don't want none of this is that were expended in ways. I don't think. Reported or I can just in case of fas appropriated the department and they spend that money by by giving it to FAS what we hadn't done this to tell you that you need to give SAS the authority to spend the money to get into the department. So I got was the 99% of what not. That's not an excuse. I just want you to understand it's not material and we need to be better and we are continuing to work on that. Thank you. And I know that I asked you this specific question. Do we have money to pay this and it is funny that you appropriated in fact, so that's really more of an egg and an accounting at a time in Peace Department saying all you know. Why would just give you a sense of how we're going to manage to it to avoid these? I'm so so that concludes my comments on that bill, which was that gender item to and so with the mission out move to agenda item for which would be want to come back to three. So this would be Council Council Bill one 19573. And this is the 2019 carry-forward ordinance, which I'm in effect carries forward unspent Appropriations from the last fiscal year into this fiscal year to complete the work that those are Appropriations were originally given for I'm so there are number of number of increases in this the council Bill. The total is 90.3 million dollars 36.2 of that is in the general fund. I just guessing in terms of the good news is that this is not a new money in terms of effect on the fund balance because the original thought was that these Appropriations would be spent last year. So while we're just doing his is moving that Authority forward to 22092 fiscal year just asked about I'm looking at Tally's here and on page 12 of 14 on 573. I noticed that we've got a total of 88 million here and then a 1.7 million. Does that add up to the 90.3? I'm just one points. Looks to me like it's a little short. Nope fine. Thank you. The one on page 12 for 88.5 and the one on page 13 from 1.7 that equals the number that you just specify about 19.3 million. Thank you. Not so I'll just run through highlights. So this contract spell the memo at a very high level sewing terms of the general fund. There is a 13.6 million dollars in the office of development opcd. I'm so this represent sounds for unspent portion of an inter-fund loan on for the Equitable development initiative. And the the original origin of these monies was the sale of the Civic Square property. And so so this is Angeline interfund loan that's in place until those proceeds come in to backfill alone. Intuit on how does this work? I know last week when we had gone through several weeks worth of conversation around the sweetened beverage tax and EDI. They were companion bills. How did those compare and how much money is coming in to pay off this 13.6 or they just hand and glove now or is one ahead of the other as far as money coming in? I got to this point. It's okay. This this is this 13-6 is what's left of it original 15 million-dollar appropriation to EDI that is backed by the proceeds. I'm going to I'm pointing the safety audience to a piece of property across the street from City Hall. That was formerly the location of a public safety building. So the city is going to be paid 15 million dollars at in and receive some of their compensation as well for the parcel. The those monies are dedicated to the development initiative. Text set the timing on when does the Landfill close at this point but we've known for some time that it was going to close and we need to eat some of the EDI projects needed funding immediately. So what we did was to say to do in a van loan. So take some cities checking account 15 million dollars and make it available to to open an office of policy. If you needed all of them careful of my acronyms to to administer into funding DIY projects and so what but they haven't expended that money in any given year and it was everything at 10 today that they would so what we're doing is carrying forward that appropriation is already so so opcd will it snow. About 13 and 1/2, they've been giving small grants to individuals in a variety of things so Will continue to carry this forward until it's all from Italy expended but that was a one-time allocation more exciting news about the Apple development initiative is that part of the short term rental tax that has been imposed Statewide hotel motel tax to things like Airbnb without 5 million has been dedicated on an ongoing basis to to the actual development initiative, which very quickly will be the only compliment this as well. So so easy I know has an ongoing funding source 5 million dollars a year. So in our next increase, I would highlight is 1.7 million dollars that scary forward to the Department of Education and early learning post-secondary program for the 13th year promise a portion of this is funded from unspent sugar sweetened beverage tax revenues from 2018 about 1.4 million, 1.4 million dollars and the remaining 349 from the tent cities general fund. There are a couple of other sweetened beverage tax funded items that I'll disconnect take an order. I want is a million-dollar in Creech and Kris nhsd for food and nutrition program contracts an additional $769,000. I'm going to the office of the city auditor to perform valuations of sweetened beverage tax programs. Also at kind of a larger category I'm Finance General. So this is where we set aside Monies to me to an intended Council purpose. There are a number of these these individual back at the money that were not spent in 2018. So we're just carrying them forward with that that identical purpose into the new fiscal year. There's no point in 1.3 million for safe consumption side reserve $590,000 for Equitable development loan interest 233,000 for insurance premium payments hundred thousand for Lambert house. Remind me to Lambert houses if I recall it is, I'm sorry. Just checking I LGBT youth Support Facility. safe consumption sites Reserve notes the God we have when we have a plan, but in the meantime, it doesn't seem to move forward with the general space as has been described him actually exploring Alternatives as we speak about waste address on the underlying issues, but maybe in a different way over the next few weeks before the budget rather than just holding on to the safe consumption site money and having it sit there in a bank account to look at ways that we can Is it further Behavioral Health needs so I'm just as in the early alert. I think that's something that I personally am going to be very interested in. Thanks, Tom. Sorry I keep interrupting you quite. All right, that's why we're here. So. I just ran that out. There is still money left for Seattle retirement Savings Plan study under 60. Mm. And then $500,000 each for a sweet beverage tax job retraining reserve and Youth Opportunity project. I so now I'm moving to kind of the other Fun Zone on general fund and creases there's about just shy of 30 million dollars in the Seattle it department. And so this is similar to the FAS increase that we that I let off with where there is an appropriation amount in in the IT department what that does is gives it staff the ability to spend money transmitted to them from other departments to complete projects on that have to have those departments. And so this amount is carrying forward at work that was begun in 2018 for those other departments including the city of light and STC. I wear I think major I'm trunks at that money. I make that money forward to the day complete that work. Some of this is a result of IT project out the door on the time I said, it had been originally identified. So new director is working hard to streamline project delivery and to make sure but we're also changing departments the building structure. So in the past apartments for the work based on cost estimate and collected the revenues on and put them into satellite. He's checking account if you will, and then they were spent down as a project move forward moving more towards arrangements, so they won't be having to carry for the budget Authority and sisterly they will we will meet out the budget Authority as needed overtime. So Special ways to just as well. And for now what you have here in this item is sort of the opposite of the tenant improvements item in the exceptions ordinance, which was where they should be a project got out ahead of its technical Authority in here at the technical but the project still haven't kept pace. Next Mex large item might I just wanted to highlight is a 7.3 million dollar increase from the 2018 multi-purpose so ltgo, so that's a limited tax General obligation bond fund. And so these are monies from a bond that are for affordable housing loans and the affordable housing loans have been awarded. However, they could not actually be encumbered in the financial system until the loan is closed. So that should carry is that going forward until that process is complete. Thank you. We have a two 2.8 $9 increase in the and if they ask for Seattle Municipal Tower land lease and so FAS the city owns the Seattle Municipal Tower. However said he does not own the land underneath the state of Washington does so this this particular lease and technically expired in 2017 were in the process of renegotiating the the actual annual lease rate is going to go up. We we know that and I understand that the budget is sized eventually to make those payments on however until the ink is dry and we actually have it finalized. We are we're still paying the old lease amount and so this reserves the authority to pay kind of those retroactive true of payments once we sign the lease going forward. So next item is a tattoo million-dollar increased hsd for childcare facility construction funding with childcare bonus. And then a 1.7 million dollar increase to complete the Central Library Materials Handling system facility Capital tonight at the top of my head. I can't tell you what they are, but we could get backs areas of the city that could be eligible for the release of documents. I think it's the narrative here as if they were project identified in 2018 and Appropriations made in the to work at them for the description work not complete, but we'll get to the details on the project the upcoming budget. So thank you for highlighting this So I thank you. I will move off move to the next item and sorry for the questions. I saw this is actually a agenda item 6, which relates to counsel Bill one 19574. This is the comprehensive first comprehensive Grande acceptance ordinance. And so this actually has it in her relationship with the with the supplemental or not. They will discuss and I'm soon on the agenda. What this does is it when an ex when a third party wants to give the city money to do a thing. We actually have to go to the formal process of accepting that money. So that's what this word means does. It has 3.7 million dollars worth of grants that are coming in from variety of their parties that I just want to quickly so that the trick is that this doesn't actually spend the money this just accept the grants the supplemental budget coordinates. So I'm highlights. There's 2 million dollars from the State Recreation concert conservation office to the park fund for a number of projects including a million dollars for Southwest Irina 155000 for construction work on a floating Boardwalk Trail and Foster Island 200,000 to complete final vinyl designs for Shoreline restoration at Lowman Beach Park. $773,000 from the state Heritage Capital project Grant. I'm going to citylight for concrete restoration at the Georgetown Steam Plant. $250,000 from the federal Justice assistance grant program. And so this goes to spd2 fun three existing crime prevention coordinators. Honda 200 to 500 $770,000 from to Grant programs in state parks going to SPD Department Marine patrols and board of education classes. $150,000 from King County Youth and amateur sports going to the Parks and Recreation van for Ballard playground Synthetic Turf and Smith Cove Mayfield Construction. There's 25000 from King County Conservation District being given to office of sustainability in an environment for fresh box program and and round it out $21,000 from one question sociation of sheriffs and police Chiefs. I'm going to a speedy for on scanners and printers to be used by the harbor and traffic units. Total is 3.7 million of Grants is correct. It seems like a pretty straightforward when it's all of the actual Appropriations will be covered in and actually the next one we talked about. Okay. So now what time will be talkin attend item 3? Just happy that things are moving along in such a nice way. Thank you. And so this is actually the largest piece of legislation they were going to talk about today and it's Council Del-One 19575, which is the the first actual supplemental budget adjustment for 2019. So where are the exceptions and I carry for words sort of where they linkage between 2018 and 2019. This is just pure net new ads for the 2019 budget. The total increase stats Khan covered by this legislation is 72 million dollars 6.9 of witches in the general fund. And again to kind of hearken back to that the last time Bill 3.7 million dollars of that is actually grants that we can accept and spend a little shy of half a million of that is in the general fund. I'm of the proposed total 72 million-dollar increase 19.5 is backed by new Revenue. So noon on Grant revenues these include an inter-fund transfer some reimbursements and fee Revenue. and honestly, I just want to highlight and it's not obvious here and show my math, but Photo budget process in Stratford Apartments to keep their request for new general fund supports the new New Year's Eve existing general fund to an absolute minimum. It's consistent with our message at The 20/20 indoors budget is the budget we intend in large part to deliver to the council because of revenues picture has not changed significantly at this point. They were waiting at new weather forecast for next month. But so I'll go there is so annoying Dollar General fun most of it all but about a half a million dollars is backed by some reserves that we had. We had stored of our money is being transferred from other other City departments in a light. So we have really the overall net Edition here again is in order of a half a million dollars of general fund that had that had not previously been committed that with that would be enough but those specific the specific assets are but we were from with Apartments about the need to preserve The Preserve those resources to address 2020 issues. So hot. So now I'll just walk to similar to Prior bills. So I'm just the highlights covering those kind of know where the items start with h for probably mid all the way through. CH4 I'm so I'll start with the general fund adjustments. So we have a $622,000 increase. I'm going to the Department of neighborhoods. So this will find out region engagement collaboration with a stop looking at 9 S. Capital projects. It's a pilot program. As a $520,000 increase in the Law Department dealing with Key Arena negotiations, and this will be funded actually with reimbursement from the Opium group. Are there are a few items covered under with sweetened beverage tax revenue. So they either Revenue coming in higher than forecast including 1.2 million dollar in Creech increase in the human services department for food banks LD improvements. I 693 from the general fund your there was some unused resources previous years of the sweetened beverage tax. As you know, one of its uses is access to food and there have been Investments and food banks weeks. But we are spending yours is unanticipated revenues from previous year so I can sometimes they're really there one time that we didn't expect during the week and we had these one-time resources and then we would have been approached by several food banks who had some one-time Capital needs. So there was a really good match your between one-time resource that is dedicated to among other things to access and some requests from our long-standing partners in the food distribution business if you will, so there's some direct allocation is to Specific food banks, but then also a sum of money that would be made available to two others to apply for so we can just want to provide funding to those of that recognize any others might have needs as well. As long as there are one-time Capital needs at the convention tenant improvements. Maybe you can perhaps a vehicle purchase something like that. They would do it also be eligible 1.2 million. I think it's a lot 400,000 is unallocated. If I recall I think I can get the details organizations will come in and be asking for that money. So that's putting it together. That's put in a centrally a reserve or so. I'm food banks and others to come in and we will be providing a contract with to make it clear what's available in the types of opportunities that there are thank you. So continuing a lot along the along that thread of the sweetened beverage tax revenue on their $680,000 to the office of sustainability and environment for to Chris utilization of fresh box. And also going to ose is 480489004 pilot efforts to expand eligibility for freshbooks. So what I'm hearing you say is that the money is being from sweetened beverage tax is being used on things that we we specifically said we were going to invest in Food Bazaar new and expanded programs agree with any more detail more popular than we had thought it would be the resources available and given what we see about increasing revenues going forward and sweetened beverage tax fundraiser. So I'll move now to just another product. I'm set of adjustments and these would-be increases to the Seattle Police Department to provide a services for government agencies, including $81,000 from a Marine Patrol for Hunts Point and Medina. $100,000 for Traffic Control at the Coleman Ferry Terminal terminal and then $232,000 for Traffic Control associated with the Alaska way Viaduct product project. So I don't want to get too deep in this but I can anticipate that others of my colleagues are going to want to know more about the Hunts Point and Madonna payment. So, can you explain that? What what's the quid pro quo for this. So we're in agreement and pin get compensated get I mean, I could provide additional details that have to defy. The research is going to respond when calls come in from other than just the the limit city limits of Seattle but in exchange for that a willingness, we have contractual arrangement. And Hunts Point is providing $81,000 to the city of Seattle for the services that are being provided to them and their own staff boats. Will you going to have the boat out there? Anyway help us defray the cost. Auto Grammarly an item but also in the general fund is $775,000 to the Seattle today Court by the Municipal Court. This is using money is from the the state Administrative Office of the courts trial court Improvement account on which funds Improvement efforts. Concert so this these are mine is that are that are distributed from the the state A administrative office for the court to local courts, and we have accumulated and amount totaling $725,000 that is now being directed towards rsji training at the court request from the municipal court itself. We are in large part passing through you an opportunity to review it as well a little more detail training $250,000 to do strategic planning and community outreach. So there in response to Concerns about probationary services and other issues. They would be out in the community in and get a better sense of recording other music could work better for the community and then $5,000 to do an evaluation of probationary Services specifically and then also 3 and fifty thousand dollars to do some space reconfiguration at the courthouse at those are the individual items within that 775 and give you more details as well as we can we talk to you more about that. Thank you. ISO next increase to note is a $250,000 increase in the law department. So this relates to a budget reduction that was that was scheduled for this year, This relates to it was supposed to be at a salary savings cut. However, a lot apartment reports that they don't have sufficient vacancies to meet the salary savings cut. So so that provides them the resources to pay the salary for the year and not make the cut. This is a story about a half a $9 at Rulli new expenditures. This is a share of that. So this is indeed new money we are but I don't think it's it's realistic. The 250,000 is going back to 4 how many positions are we having more than one position? But it's not it's just trying to manage overall compensation structure within within their office. So they are not looking for a position of authority by performers as an example or what's the plan would be the best source for the for that kind of philosophical approach to effectively a reduction put into the budget for this year last year and if that is left in place, then they'll just going to have less money for all purposes and and what they've indicated isn't being organization of the kind. They are the most logical place. I can go with salaries and so unless They actually were forced to make the reductions. It will not necessarily be clear what it is that they would do out to City attorney homes about this going forward. But if you have any more specifics between now and when we vote it would be helpful course. Not so just let me down the list. There's a $219,000 increase to the office of Economic Development. I'm so what this does give them the ability. Well if there was an audit in the in the community development block grant Prague program in 2017 that found that money that was spent from that from the cdbg Grant on the only in Seattle program didn't meet the requirements for the cdbg money. And so that had to be repaid by OED which they did so however that leaves a hole and their budget for 2019. Then this this back feels them that payment. For for our office of Economic Development has been backed up. One of the first times that I'd seen this it was almost a wholesale request for people especially nonprofits that were looking for money that they asked not to be given cdbg money because the Community Development block grant had very is strings attached to it whether it was reporting requirements or how they got the money and they were real request like don't do that to us. So I hope that going forward we can get the different one in that the colors of programs and one is projects and the programmatic spending is is more constrained. We use it a good deal on the Human Services area. And so what happened here is if we'd we had thought that the money that OED was spending was appropriate characterized as a project rather than a service XTS differences project and service program. So we did that we've been attributed to the project side of the community and black ran the audit to fix this and then we are actually going to need now considering a Ouija was using Community Development block grant monies for what are now characterized by the government services in the number of areas that we can't use it that's funding source for those programs in that way anymore. So we're looking at both other alternative ways of funding and are there alternative ways to structure the program to meet the federal requirements. Addition just so there is construction project. Even if you are probably characterizes a project in receiving the number of complications potentially prevailing wages and bidding requirements in the like that make it do my money's tricky to use critical. If you're pretty far into a project if you know about the the restrictions the outside they're easier to work with than if your part way through Alright, okay. So now I'm actually move to some other fun. So we want the general fund and there's a fairly sizable adjustment, which is 30 million dollar increase in the office of housing to the housing Support Program fund. And so what this is is this is money that was from the 2018 sale of the convention center and I will need you to direct me back to your to the memo cuz I'm on page seven of nine at the end of your cdbg so far. Telephone number it is an attachment a five of the attachment on the memo. going back doctor I'm so this so that were there awards given for how to sport program in 2018 of however, the monies weren't actually dispersed in that year that money will be disbursed this year. So this just provides the a corporation authority to do that. Their number of public benefits payments they were associated with Convention Center so that actually these housing dollars 30 million thousand dollars or any other items in the highlights at the convention center agreement was just asked for that. I don't have a number of improvements related to the streetscape as well. And I have Elsewhere on these ordinances. There is a probation acceptance appropriation of some of those dollars as well accept. This project is move forward and his son SF convention centers moving forward, but we have the 1.5 that was allocated for the lid I-5 design and then the work Nothing was 10 million dollars for our freeway Park. Those things are making a big difference downtown. So that means well we can call it a thing earlier. But anyway, just to get it in a sense that there's a number of elements associated with the convention center. Go back to page 5 with weather and home repair in sync with the memo. So there's 1.64 1.6 million for housing support program on this is technical corrections to the off the housing program. So this is funded with them previously received Grant Revenue. There's 225000 in the office of housing for the multifamily tax exemption program. So this is actually working with the technology dealing with them as hell didn't use up data and the applications for the program. So this is funded with the program fees. Are there is a large chunk of Seattle. It increases in the initiatives program. So this is similar to the FAS program on the pasta with authority and EMT earlier path of authority that I that I touched on. So these there's a set of projects that's covered in the memo that are on the behalf of of departments that I teased working. So this provides the authority to do those Is it part of this? If it is coming in. Okay. Sorry, I just okay. I just wanted to highlight that there's another Grant of $300,000. That we don't have to accept those grants. They went directly to lead the wave Grand. So we're not accepting that so they've got the money but there's going to be some additional it request to help Implement that Grant which is part of the lead program because part of what we have been struggling with for years is around this data sharing and making sure we got the right data that we are working with King County Employee Program on so I think that's going to be an amendment that we just discussed so we will come back to that. But I just want to highlight that Seattle it isn't done yet. I think they will probably be discussing the bulk of the Amendments on next Friday the 9th, but it's always good to have a preview when possible. Thank you coming soon new one wants to highlight amendments at the end of TOMS thing. We can do that and if they want to wait then that's fine, too. So now I move to Page 6 of the memo and so touch real quickly on on customer requested tenant Improvement program. So this is kind of the whereas previously we were talking about in the exceptions ordinance the kind of chewing things up with what happened last year. This is actually adding stuff that's being requested for 2019 to as a 5.4 million dollar increase in FAS to to do that work. And again, the funny that is inappropriate to the individual departments as part of the 2019 budget. We just wait till at least he is able to do an increase or authority as if they're ready to move on if it work. Authors a three and a half billion dollar increase in the transportation fund that's included which sports Construction in two projects than North 34th Street protected bike lane and the Melrose protected bike lane and neighborhood Greenway. So these are both funded by federal grants. There's actually something going in the opposite direction and it's the $721,000 reduction in the SPD body-worn camera project. And so I'm actually in the 19 through 21 budget Capital Improvement program. There was a shift of this amount from I was intended to be from body-worn camera to in car video. So the in-car video project received a $721,000 increase. However, the body weren't video program did not get decreased at that time. So this just proves those two things two sides of that transfer up. Thank you. Welcome cast member Gonzalez. I apologize for my tardiness. You got a few other things on your plate today? Okay. Thank you. I'm and just to give you a heads up before we are we are on Page 6 of Tom's good memo and we are looking at item number for 5. Thank you. So I've actually talked about this at several of the things on I-26 of these words some of the general fund increases. So if you move to page 7 halfway through the page. For so that'll catch us up. So there's a 16 are 6.9 $9 apologize increase in the 2002 Levi multi-purpose fund. So this goes to the office of housing support new creation of housing units for first time buyers the funding for this is actually from unspent balances from prior years. There is a $425,000 increase in the Seattle Center Key Arena fund what this is is to repay amounts owed to Seattle University and University of Washington for the lack of use of the Key Arena while it's being worked on her plans to have Seattle U games basketball games and I hope that you were pretty clear on that. Can I go back to 6.9 million on the subsidies to create affordable units for first-time home buyers. Is this 6.9 million going to o h to be spent in 2020 29th set off metal follow Square 9 Homes at the Yakima townhouses 16 homes in Lake City and then they're going to look the purchase two properties from city lights that are total of eight homes. They would then make available. So is his low income home ownership program and coming to fruition on their funding historically and opportunities to deploy the resources. Thank you. So we're on the home stretch. There are a number of NetZero. So there's no fish fiscal impact on transfers, but I chose to highlight if you have them for you. I'm as they touch on finance General. Also, there's a $500,000 going to eat human services department to support Broadway Youth Opportunity project. And they're $250,000 also going to hsd for an RFQ process to start a pilot program dealing with resettling indigenous people to their communities after incarceration. Also in the area of a net zero transfers, there's $488,000 that is transferred from the city auditor to hsd so this is some sweetened beverage tax money that is housed in the city auditor's office right now. However portion of that evaluation work is going to be done by the programs receiving the money until I put this represents. And so those are the the appropriation changes. There are number position changes 26 new full-time supposition, correct? So half of them, I'm right off the top or I'm Department of construction and inspections to do to work on the high level of construction activity and master permitting processes. I believe the intent is to Sunset those positions in 2022 as stated in the in the legislation budget Authority on the understanding that there is a shared interest in keeping the permits moving that the uses permit dollars Sunset the positions so that it is and when was only when volume declines what will we can move the positions off? I'm off the books appropriate. This is a responsibility to move permits. So assist of the crime against internet crimes against children unit the volume of work there to request for two positions related to public disclosure request SPD receives a huge volume of public disclosure request. They've been meeting this need with temporary staff, but it is it is a real in an ongoing need well more than half of the total Public Schools request to come to the city. Go to go to SPD is also a physician. Take it take it back. It's labeled sdhr, 11.8 civilianization of the position in the in the police department at some of the weed negotiated if I recall so so eat your complaints to be handled that way and then a couple positions in department of human resources related to the new investigations a units that I'm going to take on the responsibility for workplace investigations for the city overall. I'm sure this is not the office of the on bed. This is correct. That is not fast. So these are so you may recall that they were yeah employee protections and against Case investigations that were made in the 2019 budget one was the creation of the office of the employee on but we owe if you will allow that is designed to be a unit that is independent of sdhr place to go have a safe conversation and get it and get advice for themselves. That office is just is not open. And actually I'm at my house just this week or late last in addition the the budget provided for a shift of workplace investigations conducted by City personnel in the past. Personnel functions in in the past individual departments had potentially been doing their investigations within their own ranks. If you will buy what you did in the budget was to centralize and to find a function that in sdhr so we can centralize HR units that would take on that role So to avoid any concern about conflict on the investigation being conducted by Department within the department have those done outside. We look into whether we can be transferring staff from other departments to do that. But we discover that is in large part that we're not dedicated staff and other departments to do that. They did it occasionally on a one-off faces or had been hiring outside expertise. So it in the end it make sense to quit a couple positions if we're going to stay true to the effort and the goal of having a decentralized investigate functional conflict error lesson issue. Anything further on this 26th new full-time positions actually have a increase in the expenditure. So in a mini cases the budget Authority already exists. So this just creates a pocket to feel silly have money is reserved. We had been providing the funds are being spied on by temporary staff and we built that funding into the budgets. So it was recognizes and potentially ongoing bodies of work at something we're realizing what had what we may have hoped to be temporary is actually on going so prisons to PDR Stafford SPD work. So well, thanks for joining us. I wanted to return something in this attachment a under the section 3 and that is item 1.5 and 1.6 and Allison had a, Yeah, they didn't make it into the memo and they're smaller amounts. But I think they both have critical purposes. I'm glad to see that we're finding them 1.5 is homeless child care programs and 1.6 is gender-based violence prevention in the North Bend. You wanted to take some time to highlight the good work. They were going to appropriate ads from the hip or proposing on the gender-based violence side. We received requests from Goonies based organizations and with limited resources limited amount but as described the goal is to provide programming and capacity-building for using and young adult prevention programming and then Deal with childcare programs that ran to the middle of the year and we didn't have a population to 4 for the full year. So we're correcting that funding for this is from the families and I love you. So it's not a not a not a call in general fun. But rather a use of those those dedicated resources. Are the gender based violence? I thought it was fantastic that there's a shortfall there. Thank you. All right. Well, let's move onto item number 59576 Yeah, okay. Actually can I eat it since we I came in late before we move on to the next item. I want to speak to to potential amendments. We certainly can I had also thought we could do that at the end of the present at work. But if you want to do it if that's what your plan was. We've gotten this far this last piece I think will be fairly quick. There's not a whole lot going on with that. Damn. What this is is its agenda item v on its Council be the one 19576 and this is the abandonments on Capital ink and Grant abandonment on what this does is it it reduces the the 2019 budget for non lapse in Appropriations Authority or appropriation Authority that we otherwise don't need appropriation is and where it comes from. One of the city's budget is a quote-unquote lapse in Appropriations. So it only lasts for the the fiscal year for which it's granted which is why earlier in the meeting weed. We did things like this got scary forwards and so we're using that lapsing single year appropriation Authority and take the ticket in future years capital and Grant Appropriations in some cases are unique in that they do not laughs they so they either get full of used up or they they persist until actions taken them to defuse them so to speak and so that's what this does is it it looks at areas in the budget where there is found perhaps money or authority to spend money that we no longer need and it reduces that authority to to True up our our projected need with with them. What would like the stations are so just in the kind of in the framework of looking at the big stuff as an example of this type of thing is a 14.6 million dollars in the Trap. 2018 limited tax General obligation Bond attachment. And so this is there were going to be bonds issued in 2018 for the Elliott Bay Seawall project. However, they re-evaluated their needs and they don't anticipate an issue those bonds. And so they were requesting to reduce the appropriation to chew up with what they expected need is and so I mean, there are a number of individual items in the legislation that that's just an example of the type of thing that we're doing. So it's really kind of a technical cleanup so is 14.5 79618 as we receive in 2.7 is up money that they had planned on they were going to go to the bond market to get that 14 million or do they have the 14 million in their hand? Play no cash. It's it's the extent that the former it's we expected. We were going to issue bonds and expand now the plans have changed. We're not going to shoot bonds don't need the authority to give you a sense of how that would have been resolved as if we have sold on them discover. We don't need them in their full amount. The standard thing to do would be to reprogram them that we tend to go buy and sell every year. So we have 20 million left over from last year that we didn't need it has to be used for Capital purpose. So we were planning we're playing issue 60 million this year and I'm not really need issue 40. So that's generally how that would happen. So what we're doing is taking away the appropriation Authority in part because departments have the administrative authority to shift some of their existing appropriation. So when we pull that back then that they can't do that without checking in within with out of you or me depending on the level of which they wanted wanted. What it is, but also this case there's a 2018 LT geobond finding those not going to continue to be proceeds going into the 2018 LT Joe Bond Fund because why does zombie appropriation that 15 years later still on the books many of us were looking at 14.5 thinking available. So we didn't get the cash if you had they would have been restricted in any case though. So that that completes comments on that bill, I really appreciate it. Okay. Well that is the end of the five items of business we had here. So now I'm going to open it up the council member herbold. This will be sort of a an early trailer of Coming Attractions. And what will be asking for in supplemental, please go ahead. I have items that are both parts related items and they are addressing a shared issue as it relates to how the department of neighborhoods has recently changed its maximum award for the neighborhood matching fund and so one is funding for the AIDS Memorial project 8th Memorial project recently presented to a joint committee of My committee and councilmember Wars his committee. And this is a project that the council has supported in the past has developed hats passed resolution to ask executive to pull together and ID that I done great work in it at this lunch and learn a couple weeks ago. We learned about the work of the IDT and and the progress of the of the the its moral project and The shortfall that they have now is because of they were anticipating a the ability to to apply to the neighborhood matching fund for $100,000 as they had the previous year and the limit this year for that fund is $25,000 in the second quarter, right? They see you still could come back and ask for $25,000 more multiple times a year. I think that is the case but the issue is the timing of the money and the ability of the project to move forward without having to do that poorly application. And so this particular funding would be focused on the narratives a project part of the of the plan where there's a work of art of Storytelling where the consultant has gathered self-determined personal narratives related to HIV and AIDS from survivors and family members of people who have passed Phase 2 of the project will continue Gathering those narratives broaden inclusivity, and I apply learned narrative Gathering behaviors and will also work to Specifically to reach out to people who self ascribe as emigres Refugee living with disabilities transgender queer youth people living with HIV AIDS and others from from without the LGBT community and then the idea is also about trying to have a way of working with a local institution in ensuring that those narratives live somewhere. They have some other various ideas about how to integrate those narratives in with the arts project itself self guided tours that you can have listening devices as you're walking through the pathways is one item that there that they're exploring. The other amendment is for the Seattle rep specifically for their Public Works initiative. This is their second year of doing Public Works Peter. It's modeled on New York City's Public Works theater and its when working with professional actors. They're working with people who come from various communities and people who have not had an experience with theater with a theater production. They've worked with groups like Mary's place and a lot of the the the trying to integrate people's lived experiences with the experience of theater gives folks the opportunity to not only take classes at 10 performance in advance. But again join in the creation of participatory theater building community Through long-term and mutually beneficial arts and Kate Schmidt Partnerships with local. And they also last year at the culmination of their their Public Works production while they're their preparation before they went live. I'm also presented in my committee last year for their inaugural Public Works theater program, and they also apply to Department of neighborhoods ride, and they got 25,000 but they were expecting and hoping for a hundred and you're just advocating for this because you think they're doing important work for the community of the Department of neighborhoods policies funding policy. Thank you, and I have to also that I just like to bring forward and one is for an evening nurse at the downtown Emergency Services Center. One of the things that we have learned over the years is When the nurse is on site that there are much fewer dramatically fewer calls for our emergency services for the First Responders and we've got data to demonstrate that in terms of discharge that have been created by the hold that place by rhe Scoggins and crew. So we're going to step up because we believe that this is going to save our fire department in our First Responders is significant amount of money and it's a much better outcome for the individuals are there so that half of an annual salary for this is about $70,000 were working with Harborview just to be able to say we want to build on this and I think that is a good expenditure and and I also want to say thanks to the mayor of when I talked to her about this. She actually as my understanding isn't intending to include this in her budget, but expanding the program she recognizes the value of this. So that's our first request for that half of the year. And the other is our lead program a lot of law enforcement assisted diversion. That was huge. Thanks to lead and to Dan satterberg are prosecuting attorney's office. They I asked for and received a $300,000 Grant from Microsoft to provide them with software than the software that will come that will actually help them with the data sharing platform that they need great. That is why it's wonderful news because part of what the program has been struggling with but also people on this end up in frustrated by this was not been able to have the collective data that stalking to the other programs so that we know who the individuals are that we actually come follow the outcomes have some measurable data and then determine whether or not we are reaching success. This software is going to help us do that. But in order for Our IT department to help there's a request to find a half time project manager and a half times. Does analyst for approximately eight months to assist with getting this LEAP program implemented? We do not want to delay this it would be a ridiculous waste of this software. If we can't get it effectively incorporated into the bigger process cuz this is this is what we've all been asking for is to divert people to what we have to know who are diverting how they're being used. How are they were being connected with their case managers and where they're going where the housing is and how they're doing. So I will come back with more information but those are my two and do we have a third or this is okay. Okay. What council member herbo? Thank you for bringing it Forward come to my work and Solace. Did you have something? Okay. Thank you very much for all your help Tamir memo was terrific. Agenda items to three and four Highland Park roundabout. We created a CIP page for them of that project in the budget process last year but in doing so we didn't capture the full commitment that I start. His dinner was generously made to the project. So this particular moment does two things. It captures the the full $500,000 commitment to the project the adopted CIP that we added this page last year. I'm only listed 200,000 of the the 300,000 but it also adjust the total price of the of the project and allows. Or an increase in the estimated cost for a roundabout in the potential in the description for a stoplight at a lower cost the same same location and S. Is been consulted and is aware and support of them this update Will Smith allocated Telco. This is this is a future allocation for The Rampage there's actually two pages associated with this one. So future location for 2020 and again. I should add that the 300,000 is contingent on us receiving funding from the state because it is considered to it is considered to be a match to a state grant that start will be applying for art. So is that something that Eric? You can incorporate and Tom in CIP information for coming forward to the full Council? What's what is going to need to happen here? So you project page the process for that is much like any other remember to the supplemental but would it would do is basically add an attachment forth with the revised page to the ordinance. So to the something in the ordinance so we can facilitate that technically and that's good. Very good. Thank you for that colleagues. Thank you for participating. Thank you for going through this with Fine tooth comb and appreciate the briefings that you provided me an advance very helpful. Okay, nothing else for the good of the order.", "end_time": 4832.7}]}