{"format": "raw", "annotations": [], "confidence": 0.9409327548994145, "data": [{"start_time": 0, "text": "Hello, how are you? Go ratings and welcome its 9:36 a.m. And this is the Civil Rights utilities Economic Development Arts committee. It is July 23rd, and I am the chair of the committee Lisa herbold as well as council member representing District 1 West Seattle and South Park just real quickly going over the agenda. We will start off our our morning with cultural Spotlight, which is a monthly Edition spotlighting some local culture and in arts in it in the in the in the region will follow that with public comment and then we'll move on to the atoms of business for the day including a report from Seattle public utilities on Seattle bag ban compliance. We will hear a brief thing on an ordinance that we refer to as the harmonization bill with State legislation that was recently passed to accomplish some really important eviction reform. Will hear from the office of Economic Development on their race and social justice report and we will then hear another ordinance related to a Proviso left for some funding that the council provided for Town Hall to finish Capital project and then finally will will wrap up the morning with a social impact of the Arts study from Arts Banda and the office of arts and culture. So if there are no objections to this agenda, the agenda will be approved and we will call the meeting to order and move right into cultural Spotlight. We're joined today by BJ bowler who has a really fantastic film that she's been working on two preview for us and without further Ado all and it right over to to be a baller. Well, thank you Lisa. I'd like to show too short clips from my film. The film is called Space Needle a hidden history and it's a really good example of what filmmakers and artists can do to refract their perceptions and give it back to the community in a slightly different form. So before before showing I also just want to let you know that you know, I'm a dual-career filmmaker and the sense that like many filmmakers. I have another job and my job is to be a professor at Antioch University. So here we go. I'd like you to just take a look at this one. The wonderful thing about architecture is it symbolism is deeply part of it. The Styles the influences and the Expressions come from different cultures different eras architecture Builds on itself. The unique shape of the Space Needle has made it three paying interest until today. I mean, even though they might think of Starbucks and Microsoft. It's the Space Needle. That's what everyone wants to know about when they come to Seattle. The spacing of hands is beautiful Grace. It is lady. Like it's a ballerina. It's something of substance and it's a great Beauty. And why is that? How did we get there? This is a building or is a piece of sculpture. A building service a function as a sculpture is just a sculpture and I think it's a little bit of both. Why does that form combine art and architecture what was inspired by Art in the first place? So that was the opening of the film and it starts off kind of like a conventional duct good luck documentary, but it certainly doesn't end up that way because as I started reimagining the Space Needle is gendered it introduced all sorts of new collaborative elements including poetry dance and new voices. So I'd like to show you the second look short clip and then tell you a little bit more about it if assuming there's time In 2012, we're getting ready to celebrate our fiftieth anniversary of the Space Needle and we looked back to our archives and tried to let you know we're putting a book together and trying to find interesting facts and and a directions of people were leading in and so we came across a reference to the feminine one in Victor steinbrueck. So he tells the story and a directions to people on and we look back to our archives and try to let you know. We're putting a book together and trying to find interesting facts and a directions of people were leaving and so we came across a reference to the feminine one in Victor steinbrueck Sophos and a journal that I have that he wrote In The Summer of 1960 a handwritten Journal. Feeling that I needed to try for some fresh ideas without the pressure of producing something with the forms that Grande light in the office. I started to work at home looking for ideas. And Victor took that summer and just you know worked alone just kept coming up with ideas. And at one point he looked across his Table and there he had a beautiful wood sculpture and suddenly it dawned on the desk beautiful sculpture really represented how he wanted to go in and use that as his Guiding Light. So one evening, I thought of and put down on paper the essential concept that has become the needle when I had drawn the idea in my office I came out and told Elaine that I got it. I got it the idea that they'll take for the tower. The source of the idea is the wooden sculpture of David lemons that we had had for about 10 years. Dave calls it the feminine one and he had that sitting at the end of his desk when he was working daily on the design a new design and outside the box design of the Space Needle. That's where this idea came from. Meet so that is a slow reveal. The rest of the the film goes into exploring more about the gendered identity of the Space Needle, but I'd like to leave you with a thought which is what would it look like in your daily life. If you start envisioning this this icon of our region as having a female gaze. Something that you know an entity that would be looking out at the world not from a masculine warlike image. I know realize that's a bit stereotypical but more as a welcoming empowering figure. So if anybody wants to learn more about it, the film's going to be shown at Bumbershoot, and also we're having a special showing With some of the artist who made the film possible at of the Seattle Public Library on October 22nd at 7. And at that time The Poets & the dancers and the musicians all women from our community will be present as well. So thank you. Absolutely. Thank you for joining us and just a shout out to some of the other folks that were involved that sounds like people have a chance to Timmy Jordan Imani Keith former sick poet poet here for Seattle as well as I believe so there's there's dance and and music also and also we have the joy of of Nia Amina minor who dances with Spectrum. Thank you so much for this really imaginative and challenging imagery and Using sort of Seattle's iconography to really think about the history of our city and how we want to how we want to Envision it moving forward and it's fun to have the The Familiar voice of our former council member Peter steinbrueck in the chambers again. Thanks for joining us. Thank you. right So for public comment, Alex will be taking time and you'll have two minutes to speak and he'll let you know when you have a minute left 30 seconds left in when your time is up. I'm going to read two names together. And if you don't mind coming up to the mic though, there are three mics, but if you could come up to the two separate platforms and that way it just move little bit more quickly. So we'll start off with Carolyn Malone followed by Mackenzie guy. Okay, thank you. My issue is a continuance a civil rights issue with the Seattle Police corrupt retaliating cops on July 1st my 74th birthday. My driver's license of 55 years was illegally cancelled because I filed too many Opa Opa complaints against police for harassment and other crimes and so offices John engstrom Jason Bender Philip Haskins & B Conway suspended my license I can. No longer fly. I don't have a valid photo ID, even though I retain my driver's license, but the removal of suspension cancellation on my record prevents me from doing many things that I had the opportunity to do for a 55 unimpeded trouble-free years. I now have housing after 5 years of homelessness created by police and in my house and because I file a lawsuit against these offices body suspension. I'm pregnant after 3 months with the eviction and housing and so I'm a fighter. I'm a Survivor and I intend to continue to fight on but this is a photo of my driver's license. I have my license. I never surrendered my license because they suspension and ultimate can Elation is illegal. Thank you. Mackenzie guy will be followed by I believe it is. Jordan somebody with a C. Hello. Hello, my name is Mackenzie guy. I am a Seattle resident and a used all inclusive resorts an advocate at the Seattle Aquarium. I'm here in support of plastic bag bans in Seattle. I've lived in Seattle my whole life and my family has been in the Pacific Northwest for four generations. I care a lot about our local environment because I've been incredibly lucky to grow up next to an amazing body of water. That is giving me so much joy. My first memory is actually seeing a pot of our local Southern resident killer whales I hold on to this memory and other memories that I've gotten from my local environment, very close to my heart. We live in such a rich and diverse area and many people don't get to experience the joys of living in the Pacific Northwest and all it has to offer as seattleites. We are incredibly lucky to live next to an amazing body of water that is home to an immense amount of marine life as well as amazing ecosystem. We need to help protect. It plastic is greatly harming the Earth and on its lands and its oceans plastic never truly breaks down into nothing. It just puts up into smaller and smaller pieces to a certain species of fish and other organisms microplastics look a lot like Plankton once those fish or organisms eat those microplastics. It won't get out of their bodies. Those microplastics are They carried on to whatever eat those fish like bigger marine animals or humans. This means that we too can eat plastic. It is now estimated. That humans are consuming 39,000 to 550. Mm. Microplastic particles a year. As other cities states and even countries are signed to enact more bands on Plastics Seattle needs to continue our work to protect our local environment as well as the whole ocean by having more bans on single-use Plastics in Seattle. So our local ecosystems and animals Thrive instead of deteriorate. Thank you for your time. Thank you Jordan. We followed by Kelsea ballerini as Hi, my name is Jordan and I am also in support of the plastic then. I am from the Seattle Aquarium as well make use ocean Advocate as well. Since I was 4 years old 4th Avenue Spokane to still in Washington and I I thought their water as long as I can remember like my water the water is just something I love I take care of but in as much as Rosa Vino in 2020 estimated to be 50 million pounds of plastic in our ocean and. Is devastating we are just putting things into the ocean. What I think people don't recognize like MacKenzie said is that the fish eat the plastic and then be the fish so it's not just a fishing if I do this also is being affected and that's why I think it's a bigger cause and what people recognize I also think that we are doing good job by banning plastic spending we consume more in our community and I And I saw you also change. I would like to ask of you guys just to make my guppies like kind of like in Seattle because they are a really big problem. I guess. That's the number one thing I talked about the Seattle Aquarium is microbeast. Oh my gosh, my car reads So, yeah. Thank you. And Kelsey about us. We followed by David Garcia. And I'm part of the duwamish Valley youth corpse and I live in South Park in the past few months me and my coworkers have been cleaning up all around our community and then finding a lot of trash and pollution and plastic we have measured and weigh them and we have filled up at least 30 to 40 buckets of plastic and trash. Plastic was the most Quantified item in our litter assessment. I feel that I feel very disappointed from my community because many people see us walking in the streets and picking up and like just cleaning but then at the end of the two weeks we go out again, and there's many trashed so I feel very disappointing because they see is working very hard to pressure our goals, but then they just ruin it by just littering and like leaving their stuff in the in the streets. David Garcia be filed by Alexis storm Hi everyone. My name is David Garcia and I'm part of the duwamish value score today. I'll be talking about our experience going to Recology, which is a facility of recycling. I don't check their we saw that there was a lot of plastic and I was really shocked to see how much passing the community waste and Novena a shock me the most was that most of the recycling was mixed with trash that other materials that made it not able to be recycled and they're really shocked me and really made me think a lot because a lot of people recycle, but if people don't put the right things inside of it, it just really doesn't make no sense like you don't You can't you can't do anything about it if people don't go in and do the right thing. So I would like people to like recycle and think about what the recycling and find out what goes in and what doesn't go in. Thank you. falling Alexus whilby respite Good morning, everyone. My name is Alexa storm. And I am part of the duwamish values course. Also, I live near an area called Boulevard Park which is right between Burien White Center and South Park recently. Our group has learned a lot about plastic pollution and its effects upon our current world. We learned that the production of plastics has been on high rise since the 80s everywhere. We look almost everything that we purchased turns out to be made of plastic. Unfortunately a majority of the plastic such as water bottles and the general plastic packaging is single-use the revelation of these facts in that plastic is not only becoming even more popular and used but also that is becoming even more wasteful in space consuming in our world has made us the youth realize that is becoming a huge problem that must be dealt with immediately. With the increased time and increase use and waste of plastic. Although it is a great shame. It must it still must be said that there is an obvious problem revolving around this particular material. And so once again, it is in the interest of our world environment our loved ones or loved ones you and I had this concern of plastic pollution be confronted with you. Falling Bruce. We have Daniel klinker. Good morning. My name is Bruce paid and the director of environment Washington a Statewide membership-based environmental. Advocacy organization representing thousands of members here in the city of Seattle. I look forward to hearing the report on Plastics, but wanted to share a few quick thoughts about additional steps. The city of Seattle could take to address plastic pollution first. We appreciate the city of Seattle's leadership on reducing plastic pollution and hope that you will consider doing more as we are seeing cities and states across the country take increasing actions to reduce plastic pollution. Nothing we use for a few minutes should be allowed to pollute our rivers and oceans for hundreds of years, especially when we don't really need it scientist have found plastic fragments and literally hundreds of species including 86% of all sea turtle species 44% of all sea bird species and 43% of all Marine Mammal species and jephte nice fragments is often fatal and Skinstar when the ingest too much plastic that they can't digest when animals in Jeff plastic waste a can block their digestive tracts and as a result, they starve toxic chemicals in plastic can harm Animals help and people can ingest these chemicals as well as they make their way up the food chain and their 2017 microplastic distribution of Puget Sound report to get soundkeeper Alliance down 93% of the 44 samples taken contained at least one microplastic Plastics a major problem as I think we all know in Puget Sound aggressive action by cities and governments throughout the region can help turn the tide and reduce the impact of plastics are having on Puget Sound. Our water is generally Marine wildlife and human health. Ultimately, our goal is to reduce and eliminate plastic pollution to that end in varmint Washington would be eager to work with you to take additional steps to address plastic plastic pollution here in Seattle. Thank you very much. And following Daniel is Heather trim. Hello, my name is Daniel klinkner. I'm in environmentally concerned citizen living in District 3 and I wanted to come here today to advocate for every other week trash pickup instead of weekly trash pickup. I've been passionate about recycling since I was a teenager back in highschool. I ran a shift of the recycling team at my high school because the janitorial contracts in my hometown didn't permit for the collection of recycling as I learned a lot about how recycling works and how best to maximize it as a way of reducing waste and I believe that by weekly trash pickup would be an excellent means of doing that besides the obvious benefit to both air and noise pollution of having Fewer trucks on the road. It also has been shown in the cities of Tacoma Portland and Olympia specifically to actually decrease. The amount of waste is being sent to the dump rather than to designated recycling center. He's ultimately reducing the amount of disposable plastic and similar materials that we generate is Paramount. That's the ideal end game as many people here today have discussed. But in the meantime while we do continue to create and use disposable packaging in disposable Plastics. We should do everything in our power to make sure that we're disposing of those things responsibly, so, please consider switching trash pickup from weekly to bi-weekly. Thank you. Good morning Council persons. My name is Heather trim. I'm executive director of zero waste Washington. Our goal is to make Trash obsolete in the state of Washington. But we do see Seattle as a major leader in helping do new and Innovative things last night the city count the County Council in Kitsap. The commission was supposed to vote on the 30th bag ordinance in Washington. They decided to put on their consent agenda for August 12th. Instead of actually taking the vote, but it looks like it's going very well there. So on Seattle was part of the first wave of ordinances for plastic bags in Washington, which has now as you know, swept the country and we like to see more of that in Washington and other cities in NY to see you take the next step here and we're looking forward to today's presentation on the way up here from our office. Salt found this plastic bag is a small T-shirt bag a straw and a plastic lid all within a few feet right below City Hall. So we definitely have a ways to go here event in Seattle. The issue of food service. Where is a tough issue on we when we passed the first ordinance here in Seattle in 2008. It was the strongest in the country, but things have changed. We have a recycling crisis. We have new products that are coming from manufacturers things have gotten very tough. And so it does seem like there's an opportunity for Seattle to now take some more leadership steps on addressing Plastics in a wide range of areas. So, thank you. Look forward to hearing your presentation today and look forward to working with you in the future. I thank you. Great. Thank you everybody for taking time out of your morning to come and speak with us today special. Thanks to the folks from his car as well as the used from the Seattle Aquarium and recognition to council member Bryan who's joined us today and also for his leadership in these issues and really responsible for the report that we're going to get to the hay in in in many many ways. So with that I think we'll just jump right into item one on the agenda. item 1 2019 report on Seattle bag ban compliance Thank you. Quick introductions and then Brian few kick us off after those instructions. Ferris was spu. I'm the director of planning and program management for a solid waste line of business. Thank you. So in 2011, plastic bags at retail establishments five years later Council made a few revisions to the bag ban regulations and requested that spu provide an annual evaluation of the bag ban program. So today's presentation does mission for the 2019 updates and also contains some opportunities for improvements want to bring to your attention in your pockets as a memo that does provide kind of a background in some high level summary of the key takeaways and recommendations from the report of the final section of the memo briefly describes a few issues related to the bag ban and two other Solid Waste issues. That counts Mercury bulb is currently investigating or pursuing. So those are listed at the end of the report. Thank you and just for the the viewing public in for folks who spoke in public testimony as it relates. Likely to one of the items referenced in the memo that mister goodnite just talked about there is a mention of our interest in looking at every other week garbage collection. That is something that we will be discussing in our next committee meeting last committee meeting. We had a presentation of the 2012 pilot of every other week garbage collection, we heard from the executive about the Lessons Learned in that pilot and we identified some follow-up questions that we wanted spu in the executive to answer will be hearing them at our next meeting with that kick off on the thank you very much. We appreciate the opportunity to be here today. I'm thank you for the time to talk about the bag ban update as Brian said this is an annual thing that we've done for the last three years and It basically this year Builds on last year's report. We highlight notable developments and then talk about next steps. What are big focus on with the ordinances is environmental health and safety concerns of our customers and our residence and then the report basically we cover for different things we cover for different things that we're focusing on is the the litter reduction benefits the strategies to increase I'm compliance the effectiveness of the ordinance in reducing the contamination in our organic stream and then also strategies to address impacts of the loose bags at the curbside. So that's where our big focus is for the report and I'm without I'm going to hand it off to Sicko who's going going to go into the detail and then we're both available to answer questions. The data that we use in the surveys that will be reporting on is a largely conducted by Evans school student consultants in the sbu green business team. The Evans school has just been tremendously helpful to us. I thought it might be useful to do a really quick overview of the existing ordinances and what's required. So plastic carry out shopping bags or band large paper shopping bags are allowed they have to have 40% post-consumer recycled content and they also have to have a minimum pass-through charge of $0.05 and that $0.05 is kept by the retailer to help offset. The cost of smaller plastic paper bags are allowed and they are loud and they can be free clear plastic bags that are for walking food or produce. Those are also allowed and free and then once abandoned this is more recent will talk about a little bit more in the presentation is green plastic bags, like green produce bags are now banned in terms of the tinting color. They can't be tempted green or brown. So a couple other elements is that 2.25 mil thicker. Bags plastic film bags are allowed their considered reusable in the current ordinance. There is no requirement for the past due fee this do not apply to carry-out bags for take-out food. In fact, we don't use the term carry out for takeout food. So that is one thing I want to point out to you and then compostable bags are not allowed to be carryout bags, but they would be allowed to be used for takeout food that's not, but I'll go over there in a little bit more in a moment too. And then compostable bags that are allowed for produce have to be 10 and green or brown. And I'm on the $0.05 charge just making a note that that was intended by the I think the original legislation to Sunset, but then we passed legislation lifting the sunset. I think that might be there might be a recommendation related to that charge as well. That will hear about later. All right, so we pack a lot of information in the report and has built on other reports including last year's report. So I'm not going to go over all that detail really stick to the high points and and some updates about I do want to tell you there's a lot in there including last year's report that has a lot of detail. So option Seattle has really that's really important leadership role relay the bags bag bans and there are now we just heard one more has been added since this PowerPoint was put together Southern l-29 not 28 local bag bans in the state and that would be 10:00 since 2018 including three more that are near Seattle Darien Lake Forest Park in Kenmore. The reason we point this out. It's one of the source of bags coming into the city or from our Shoppers to go other places and bring the bags back in in the more consistent. These bag ban can be around us the better. Have you for us? There's also stayed bag ban legislation introduced in 2019 made it very far through the process did not pass. It will be back in 2020. That was a must be 5323 a couple things I want to highlight on. That is that definitely goes some next steps that are very positive beyond what the Seattle existing ordinance does a but it doesn't do everything that might be good to do on the future and it does preempt all local legislation includes Seattle's ordinance. So that is something to be aware of and then all this works together to really reduce the amount of plastic bags in the way stream hand in letter, but we don't have a really good measurements for a while. We are seeing and litter right now and zero waste Washington is piloting a way to quantify litter in public places and we want to learn from what they discover and see what we can do with that. I think the do Amish Youth Corps is probably involved with that. In terms of compliance. The overall compliance rate is now 85% There's a mistake on the slide that I found when prepping for the day that should be 227 businesses surveyed with 193 compliant. So that was from a previous year report during the expansion. The back bands are going to continue to increase compliance and we now have Outreach materials that are in 18 languages and too. Well what has been transported into Chinese and one is in process being translated trance created in the Spanish. What does chart showing you is by the type of store the number of stores that were surveyed and a blue is compliance and then the other colors show how they were not compliant. I realized it would have been helpful to provide. The actual percentage is here too. So may just do that really quick. Before you small retail is 93% compliant large retail 94% ethnic grocery 60% medium groceries 84% and large groceries 94% of the large groceries originally in the work that was done leading up to the original band and thereafter were identified as the biggest source of plastic carryout bags in the city. So they're 94% complaints really significant. Talk a little bit about the use of plastic bags in ethnic groceries. And I understand that your Outreach materials are in many different languages. I think 18. I'm wondering whether or not spu staff or are fluent in commute in communicating verbally as well as about the ordinance. I mean just any any insight as to above and beyond what you know about the high use of plastic bags in a couple things. So I would say no we're not flowing but our Consultants are so we have ecos and some other consultancies that we work with that I go out and work with businesses in language. And and that's where those translated documents are very helpful to the feedback the weekend. From surveying. I'm the one we've been told is I can't remember the percent but it's like 30 40% are not aware of the legislation. We also here and I think there's a language barrier situation dinner of the other thing that we hear is that there are some groups with our customers are pretty aggressive about really wanting plastic bag. So there is a cultural change near the kind needs to be and work with at the customer level and I think those are really the primary things and in this is one of those areas where it seems to be steadily increasing in terms of compliance, but there's always a lot more work to do. Thank you. Use the terms surveyed on this is that like someone gets on the phone calls up a grocery store and ask for these are what are some surveys in person? And then I am I know that when we pass the legislation in 2011, there's a lot of work done by both the city and committee members on Outreach to grocery stores and we recognize that that was a particular challenge. There's a lot of effort to give distribute some free reusable bags of folks think it goes to their customers in different ways, but I'm a little stunned it eight years later. We still have this and that the majority of the people that are out of compliance sounds like they're just not even aware of it. And so I'm curious what it is. What is happened in the intervening eight years and what efforts have we done to to get into compliance? When we have the ongoing Outreach that I described in terms of any form of enforcement. We've actually not done enforcement on the bagging legislation and date. It is all been when there's a complaint or when we serve a place or see that there's not one way survey when we are doing site visits and we see pump then there is a technical assistance. It's applied there can be warning letters. Are we go through a fair bit of work to not actually do a financial enforcement and I think that we're having some internal discussions about is a time to shift on that because I think there is a growing awareness by everyone plastic pollution problems in a much more awareness round plastic bags to sew I think you're probably ready for the ship and just need a notch. I'm still a little confused if she looks like she's are out of compliance because they are using plastic bags and majority of those just don't even know that this there three think that they're the self-reporting on unawareness is maybe not accurate or do we think they really just don't know despite all of our efforts to be like over 8 years. We should be able to communicate clearly with every grocery store in Seattle that this is the law and a visit and then if repeat visit and say, okay, we're told you twice in the last year you clearly know this and you're now you're disregarding it or or the people that really haven't had a touch in eight years and it just finding out about this. I don't know that I honestly know the answer to that. I do know we need to do more work. I know that we're working very hard at this there's more to be done. I was in conversation this morning different subject, but there's a possibility to do some work to figure out how to even talk about bags and some of these different communities so that you're not just talking to a business owner but the community itself to why this is important in my is my personal observation that I think sometimes people have not been invited into making these Behavior changes as effectively as we could and we've just got to figure out how to do that and I don't think we've got a Magic Bullet I would as we get moving the budget this year. If it's a resource issue would love to Think Through how we can make sure that your team has the resources it needs to have those conversations what I recall in 2000. Imagine it's even more true. Today was was two things one that talking to some of the ethnic groceries and restaurants just for them. It was often like we're just barely hanging on we're trying to survive in the system and every change you make is really hard for us. Oh how we do that and communicate with them. You know, we I thought at the time were very generous like you can work through all the plastic things you've already bought and they don't have to throw those out the other conversation. We had we heard from people was because a lot of these ethnic grocery stores the countries, they originally come from are bearing the brunt of the plastic pollution both both International plastic pollution the washed up on the shore and domestics pollution that it's this really pulling in their waterways. And so some of them were the most resistant and some of them were also some of the immigrants refugees to Seattle for the most supportive saying I've seen How destructive plastic can be and I want to make sure that we are not contributing to a problem. That's that's made the country that the dryer my parents came from a really bad. So I think there is challenges but also great but it does require resources and if the reality is it's it's simply a complaint base system. Then we probably need to be putting some more resources into that. And so it's something we can think through the budget. I just quickly add the sum of these countries are banning plastic bags of themselves. And I think that will make a difference culturally as well have a little bit more granular information after this meeting about the follow up after the surveys. It looks like a hundred seventy-seven businesses were surveyed. Do you do sort of an equal sampling across these categories or do you have a deeper survey sample in the types of stores in last year's report that were identified as needing more more reaching better compliance raids and and If so, what did you do after the survey with those particular? I mean to Broad broad brush described it but it just seems like some deep education with those instead of just a touch but some deep education with the folks that you've already surveyed would be helpful. If there is a follow-up technical assistance provided I think a couple years ago when I was before you asked, you know, when you find someone's out of compliance to you in surveying to you and Forest we don't when we going to do the survey and we really want to get the information and Okay other areas are compliances again more recently. There's been a requirement the plastic bags be tempted the nun compostable plastic bags cannot beat a green or brown and that the compostable plastic bags must be tinted green or brown and I would say that about before but this is Kratom Market Chef. We had a problem with maggots like this that are not compostable being tempted green like compostable bags and people are saying that their food scraps and there's no setting up in the compost in the compost facilities. Here's an example of Market shift where Crown poly came out with at least what they've described to me as their Seattle blue produce bag and this is there Green Tinted compostable bags. So that's a very major shift in the marketplace that That that is complaining. Let's complain because it's not green, but it's also not compostable. And that is correct. Okay. So now the last nerve and we've done which is 63 grocery surveyed only six of them still had non-compliant plastic green-tinted bags and I'll show you some other stuff here in a minute, but that's that's pretty quick change. All right, so I can have a nation impacts the curbside we talk to you about before about this and in brought this forward in the previous report, but the plastic bags have had a tremendous impact when they are in the curbside system and go to the material recovery facility and when they are included in Chrome siding 2009 that was with all good intention, but it really has not worked in his not work for a lot of different reasons. I'll keep it short but clogs up the Machinery the Merv it's extremely expensive. It's dangerous for the Murph workers have to get in the hand cut with box knives the plastic from the equipment. Somerset's down twice a day to the clean out the plastic bags that causes missed sorting of valuable recyclables like paper and then that film that it is actually Recovered and put into a bell there's no domestic market for its dirty. It's gritty as contaminated and has all been shipped off to Southeast Asia typically to China and as you know, what the the Chinese blue skies initiative that has stopped but now that those materials are going to other parts of Southeast Asia. This doesn't really mean or expectations of what responsible recycling is so we have worked a regionally with others and are taking plastic bags out of the curbside system. It's a phased approach. That should be complete by and quarter 1 of 2020. 2 maybe a little more than that. I've noticed in our household discussion about which plastic bags should go in or not. And I've noticed it on the the newer sticker on my garbage bag. My cat doesn't plastic bag under it doesn't say it's not allowed. It doesn't say it is allowed. My assumption is bended at this point. Bunch of straw pasta bakes. Why am I standing? Let's not have any plastic bags to throw away be the best option but to tell me what are the phase and what that means? Yes or materials are stage throughout the year. So single family comes out one time of the year multifamily comes out another time. So as we're staging things were stripping out the plastic bag instructions the bag them and put them in curbside and then towards the end of the year in beginning of next year will be a campaign and and lot more information going out about don't put them in there. So that's part of the phasing. I'm going to speak to you right now about about your correct that is better for it to go into the garbage then ago in the curbside recycling, but for those retailers that provide retail take back those materials don't go through them. Are there kept separate from those materials. So it's a clean material is a dozen crate. Problems. There are domestic Market still dirty during a little bit right now for that material so that in those existing retailer programs. We are working with an industry-led group to stabilize improve in hopefully expand the number of retailers that take bags back and that is with support from a stable packaging Coalition recycling partnership Association plastic recyclers in American chemistry Council your toilet paper or other kinds of things as often wrapped in lots of plastic and that's something that we haven't really targeted specifically much but we will with this new campaign to Target that type of plastic film be put with the plastic bags and be able to be taken back to these drop off locations. And clean and take him back yet the Costco or Safeway and whatever and hoping that they can expand it to the other types of films feels the same. Can I just recycle it the kind of green wishing or whatever you call it their optimistic recycling. So I'm moving on to some future opportunities and we've served a really important leadership role and in the world has kind of moved along and while So there are new next steps. That would be good to be taken in other cities or taking those the state legislation included some of those but not completely so some items that we've tagged in terms of future potential work includes the following extending the requirements of the existing ordinances to cover take out a meal delivery service bags. Also cuz remember those are not covered in the ordinance right now. They're allowed to have a plastic bags to allow compostable bags for take-out food if they include messaging to use the bag for food scraps compost and I want you to see these two bags. These are two companies have that kind of messaging other bag. So the bag becomes a tool for removing the food scraps into the compost system, which is tremendously important then wait for our recycling rape more important for climate reasons a greenhouse gases. And be dumped in the compost exactly and should be applied to those to like other bags of that would open up an opportunity. Increase in the past due fee to $0.10 per bag something to consider and then the reusable plastic film bags. We discussed the 2.25 mil bags that is still showing up in next up ordinances, but there's been a shift to trying to get the mill bigger. So Oregon just passed its law Statewide. I require formal bags and that's what we would suggest a formal bag. If you're going to allow a film bags to continue to be considered and reusable and that would also help encourage customers to actually use them in and bring their own bag really instead of currently right now. If a retailer is using the 2.25 mail that is a free plastic bag, but it's considered reusable that they're giving away. They don't have to charge for that. Correct. They don't have to charge some do and I imagine to five And some point we start to get two more and more incentives where you know, the retailers are going to have a pretty large incentive to encourage people to reuse those and bring the ground or whatever it is. It supposed to just kind of loophole to get around it. That concludes the presentation. I'm happy to see that many of the next. Identified as recommendations for her follow-up legislative follow-up are aligned with some of the things that we've highlighted were highlighted working with Wiz Khalifa on important reforms and improvements that we can as as was said in public testimony continue to leave the way in Seattle for for the rest of the state. So I look forward to continued work with you and development of legislation to address the they need for an increase pass pass pass through charge for carryout bags. And also looking at the requirement for pasta compostable take-out or to-go containers, and there's a couple of other things that did not come out of this report that I think will be useful to talk about including My pastor charged for to-go cups. I think it's be useful to have a discussion about that. I'm not something we're looking into haven't made a decision about whether or not we want to bring something like that for if I think it's definitely worth consideration and then discussion around prohibiting travel size plastic containers at lodging hotels and motels and whatnot. That's another example of single-use plastics. I think we should take a look at in lodging establishments. But we can talk more about what what steps and what a timeline would look like for for follow-up and I know Brian will be continuing to work on this is well. Thank you very much. When we first pass this ordinance back in 2011. I can't remember the numbers but this was Seattle or Statewide. But how many times you know, Safeco Field would be filled with bags. And how many bags were in the waste stream in the time. Do we have numbers now from annual or biannual recycling or waste stream analysis of the reduction of plastic is happened. So we don't have current information. We actually looked yesterday to see if I could bring that information. We haven't done always composition. Recently, we know that Plastics in our recycling stream. All Plastics is about 5% but we don't know what plastic bags but we did do a rough back-of-the-napkin analysis and based on, you know, kind of our best judgment and pulling Hans Van Dusen into that conversation to that. It was it's probably the plastic bags makeup if we pull them out and everything it would reduce our recycling rate probably by 300 of a percentage point. So it's .03 on percentage of the overall what's in the recycling next right now is but that's again a little back-of-the-napkin rough calculation not based on total. You know, how recent are waste composition study also like on a four-year cycle. I think it's the This year's report we noted how we're going to have to change some categories for those sorts that actually really get to the real numbers and then there was such a proliferation of other plastic film and wrap happening that it starts getting difficult to pull out. What's a bag and what's a wrap and so would be good to just get a sense and maybe even help over State legislation. There's a pretty good numbers. I don't know exactly where they came from. But how many bags are being used in the city back in 2010/2011 and it'd be interesting to see another sense was that the grocery store is the Home Depot's were a major source of that and when we still have exceptions for takeout food that we were given a new teaching about to be interesting to see if that showed up in the waste stream. That weather is recycling or garbage that there's a lot of your bags. It sounds like somebody's being offset by increase using other Plastics. Also, what we've also been working is with our regional partners because we are very cognizant of the fact that people who live in Seattle often work outside Seattle and people who were live outside Seattle or live outside Seattle work in Seattle. And so if our neighbors don't have bag bans or don't have similar legislation to ours, then we get bags that migrated into our system from outside. So we've been working regionally to try to encourage that across the region because as as you expand as they go showed, you know, there's 29 now. I'm not all of those were just in our region, but three just recently that neighbor us have passed backgrounds. It means less migration into our system so we can do everything we can within Seattle, but if we're not stopping those bags at the border You might say then that creates problems. So but we as we also do our ways composition study serves not only the waist composition studies but there's also studies we could do though. They're not in my budget right now where we actually do neighborhood sorts where we actually go through a neighborhood and we do, you know random houses and we see what's in an actual household as opposed to a large truck that's coming to the transfer station does so there's ways to tell down and then you can extrapolate based on the numbers eat pull out of that as to how many bags are still in in a residential customers. When was the last waste composition study done. So we do we do them every year but we do them over different sectors. So the last residential I don't know off the top of my head, but it was a 15 years ago how many sectors so we have so we have five sectors that feed into the municipal solid waste. And then we had the construction and demolition debris over the last five years. The entire city would have been done. Yes Central recycling. It's Organics probably commercial has gone to every five years is cuz our data is so rich over the last 20 plus years so that it meant we could spread them out a little bit further. Last thing I've ever done this is more for the audience. But I'd love your feedback everything through this that you mentioned that the state legislation would both make it consistent Statewide policy would be outstanding but would also preempt us and so seems like Seattle Bellingham was actually the one who went before us and we copied their legislation. So I want to give credit to Bellingham for being a leader on this but having cities have flexibility to Pilot things helps Advanced State legislation. Of course, if you look at the map, there's a bunch of white areas to show up where the cities like Bellevue. I haven't half the bag ban and so State legislation would help that I see Heather trim nodding back there really curious from an Advocates perspective what a trade-off of the state let this legislation would be that would make sense. You know, there's a place where I imagine we can't quite go as far as Seattle wants to go but if the whole state goes there were better off, but I don't know how far that is and what type of preemption we could live with. What type of things like no, we continue to need to Pilot things like, you know compostable bags that can be reused on the countertop for other services in the state doesn't allow us to do that. It's not worth it. And so has a lead into next legislative session and I imagine that this will be a topic that will be a primary concern for the community and hopefully we get a lot of traction. We want to be really thoughtful about getting a ride and hopefully carving out places where cities like Seattle or Bellingham or other leaders on this amendment was an early adopter could come out and continue to be innovators and try new things. As soon as we heard from the youth here today this plastic crisis. Unfortunately, you all are going to inherit this problem and have to solve it and if local jurisdictions if your local city council with at Seattle, someone else can't be trying new things. I fear that we will not do enough to prevent the catastrophe that's coming. And you got there always tradeoffs with preemption. So yeah, it's awesome. And I think it's important to take our lead from The Advocates community on on how much we want to go up. And yeah for sure. Thank you. I really appreciate it. This is a great presentation before the continue to follow up next item 11958 for an ordinance relating to residential rental properties conforming to the Seattle Municipal Code with changes in state law mending section 7 point 2402072403022820208002220681602220618022482, 10.030 and 2290 to 120 of the Seattle municipal code. Introductions Faith Lumsden with the Seattle Department of construction and inspections programs manager for sdci. This is the first of I think I will be hopefully a short series of of visits to get this past show you what I give us a little bit of background about how we got here. So if you're comfortable 11958 for essentially what this pill is doing is aligning changes that happened at the state legislative session this year that were in Senate Bill 5600 and how to spell 1440 and so it made three major changes that we are now going to be incorporating into city code. It changed the the provisions around eviction for nonpayment of rent from 3 days to 14 days provide a definition of the term rent, which we hadn't had before and it also increase the amount of notice. When was required to give to a tenant if there's going to be a rent increase from 30 to 60 days? So those are the general changes that will be in this legislation and I'll turn it over to you in before you leave. I just want to give a shout out to Seattle women's commission and Kentucky bar and forget the name of the or other organization that work together to put Washington can yes, I was thinking the other legal organization but nevertheless the report that we commissioned together identified a lot of recommendations that were successful in getting past missed a legislative session is Council last year passed resolution or this earlier this year past resolution 31861 and highlighted a number of these items as high priority items for the state or the city if the state didn't act until we're really pleased to see that the state was successful in their efforts. I'm on eviction form. So as you said we really were delighted with the actions at the state level there. I think will be a continued push next year for some things but we were thrilled to see the change for the pay or vacate notice which gives us more time and to respond to tenants and also gives tenants more time, which we see frequently is is all that they need the bill 5600 did much more than just these couple of changes that we're incorporating into our just cause eviction the end our rental agreement regulations, but those are changes that mostly related to allowing courts a lot more discretion in their action. When they're dealing with unlawful detainer my group The Code Compliance group in sdci works with tenants before they're in court. So these are lovely extra time periods that we can use when we're working with tenants who are at the beginning of the process and maybe not quite to court so really important there. I'll see and Jeff will can walk you through but these changes especially on the definition of rent that attracts a lot of infect almost exactly how we defined rent or housing cost before the state picked it up. So that was that was in some nice validation of how we've tried to set our system up. And of course the 60-day notice of rent increase understand there's some discussion about is even 60 days enough, but great for us to have that confirmed regardless of whether it's a Small less than 10% increase or a bigger more than 10% increase. So I'm just going to ask Jeff to give you a short walk through of where these changes are going and then we can answer questions. So first everywhere, where are codes reference a 3-day notice. We're not referencing of 14 day notice and that's in several places throughout. All right into this changing the city definition of housing costs to the new state definition of rant is face said this was that this was an important step for the state. They caught up with us the city that we're bringing our ordinances into alignment without the state described the rent and I think for the viewing public just confirmation of my understanding of why this is important on the ground for tenants. Is this relates to Prior enforcement that sec. I used for the 60-day notice for rent increase has to include housing costs now that we're going to have a 60-day notice. And it's not tied to a 10% How is the definition of housing costs are definition beat the the the use of our definition for housing cost going to be important for the definition of friend. I think so cousin cos it's just a little bit more broader definition than just maybe York or rent payments housing cost is all periodic payments that are identified on the lease. So if there's parking fees, I'm utility sometimes are fixed rate identified on the lease. So any change in any of those storage, we need 60 days notice that's super helpful. How does this intersect with? I believe one of the changes in state law says that you can only for for non-payment of rent. It restricts it to rent now if rent is now broader and includes other costs and wondering how state law actually I was under the impression that Statewide narrow the ability to be evicted for nonpayment to non-payment of rent. So, you know non-payment of late fees for instance is no longer his mind dance. That's right. And most of those charges parking storage some utility fee. They would get wrapped into rent. But late fees was a very big issue and we would see some landlords if late fees were owing would apply your payment first to the late fee. And so you would have these rolling late payments that still created a lot of challenges and could send 1 down into an unlawful detainer action. So so we're really happy to see rent gets covered first and getting you you would not be facing an eviction action for a late fee City require uniforms. As there is a exception for affordable housing providers on that 60-day notice and those will be affordable housing providers that are doing income-based rent. So if a tenant's income went up and per maybe the federal program that was funding them. They were obligated to raise the rent on those tenants. They can give a shorter notice 30 days. And then finally I'd state fake just touched touched on them requiring payments to First be applied to rent weed. We did before that. This is another example of where the state has caught up with us, but we're changing the way we describe it to match the states that description and what about some of the changes in state law. Maybe we don't need to make them in our legislation. I'm just curious their extensive requirements around What should be on a 14 day pay or vacate notices notifying the tenant of what resources might be out there for their assistance. Is that is that not something that will be doing here? That's another thing. We had to change that some and idea were exploring about taking that into possibly enhancing that state requirement in our current ordinances to match the new state law actually like that idea. So we're we're including that in a proposal as you said, we probably have another couple of opportunities come and talk to you and and the other council members. That's the one other piece of this is his implementation. So these are some big changes and they affect landlords and tenants. So we're at we've already done some work to get the word out and we're going to be doing quite a bit more as this goes into effect in the end of this week or early next week. So we did some early notice and information on are renting in Seattle website is kind of featured right there as you come in early information to our mailing list of landlords that are registered with the real programs. That's a 19,000 landlord or property managers that we can reach and then we've been starting to fold listen to landlord trainings and then coming up he is more information going out on the email list the landlord's to reinforce the earlier message materials in the website or being updated to reflect these changes is to be integrated into the future landlord curriculum is an obligation and landlords going forward and it's highlighted in the infographics in the trails were using in community outreach including some of our grant partners that were funding and I'd love to I know a little bit more about the use of the Rio database that is so you've already had Outreach to folks about the proposed changes in state line when they go into effect and what the city is doing to harmonize. Is that a resource that might be that we might talk about using to notify landlords of some of the other pieces of legislation that we're going to be bringing forward as a relates specifically to the obligation of a domestic violence Survivor to pay for damage damage is done by by her or his attacker and other items related to the right of a tenant's to have a family member or roommate live with them. Human resource from the real program in landlord seem to appreciate it very much to we've been doing about quarterly updates the landlord's with changes and city law some tips and best practices resources. They might want to beware of we we try and partner with other departments like office of housing or even the utilities to fold in some of the messaging that they want to get to multifamily Property Owners. So yes, I think every every time something new comes along will make sure to include something in there. If you want to just mentioned the the specific landlord trainings that we do for trainings there usually a hundred fifty to two hundred people that we try and do a pre-registration for them and they've been consistently sold out. We've been rotating them around the city sometimes on weekends to try and reach more landlords that it's been it's been very successful and we get very good reviews and feedback from the landlord's with it. I think that's it as as I she said pretty and and Jeff pretty straightforward. So we're we're delighted to be able to get this one to you and have it take effect, you know as soon as it can we will be enforcing these changes when they take effect with his July 28th for the for the for the state changes. They will be a lot easier for us when we adopt second city laws. Well public information as well. Short sew for I think we'll probably plan on another committee meeting for this bill in combination with talking about the bill you mentioned around the protections for spouse is domestic violence damages, and then we'll also be talking about the last one you mentioned about the right to live with family members or another occupant Earth synonym or another occupant in the next video meaning and of the committee meeting after that and so the intent is to hopefully get this late of bills out of committee before budget fantastic and I'm just trying to pull up my next committee meeting. Is it stuff for August 13th? Thank you so much Alex. All right. Well with that thank you so much. The presentation will appreciate it excited about this work and we'll move on to item three. item number three office of Economic Development race and social justice 2018 report I'm running late. greetings that start with a quick round of introductions Medallion oed's finance and operations manager and change one of our change team leads. OED Jonas a fool office of Economic Development and I'm also a small business Advocates and also cold lead on the change team as well. Ken Takahashi with the only in Seattle business district team Alex Rose office of film and music creative economy Advocate and I'm also a change team member. garbage youth employment advisor at OED great Dracula. Do you like to kiss huh? Well, first of all, I'm so impressed. You have this type of feedback on a regular basis here in city of Seattle. It really shows a commitment towards diversity and inclusion. So thank you very much. I'm just really impressed. I haven't experienced this another city. So it says a lot about the city of Seattle. I'll just keep it short because we have we're running out of time, but I just want to share with you two data points that I think it was traits really a compelling narrative here in Seattle. The Brookings did a study and essentially in terms of inclusion by our economy. And and if you look at the scale on the bottom, the best-performing city would be ranked 1 and so it'll be an inclusive economy if you will and then hundred would be the worst. And so the city of Seattle by Brookings is ranked 67 give you a perspective and you got to understand 2007 to 2017. So that gives you a broad perspective about our inclusiveness and the regional so just keep that in mind as well. And then in terms of I just sent you. When I sent you was relatively poverty and then terms of earnings. Just give you a perspective. Both of these data points will show that really over all since 2007 things have not improved. It has gotten worse and that's just give you a perspective of how our economy is behaving and the overall conclusion is that in a long which economy knowledge here here in in Seattle test to be exclusive is not as inclusive and we'll talk about that during my process. But so this is nothing new to you. So the question is what does my department do about it? And so let me just share with you. What I think is really important data Too Faced where were where were failing. So I think you can you bet and so the question is what do we do about it? And somebody department is going through an internal discussion and rearrangement frankly about how we can better address this Growing in a collision Seattle and I won't belabor you with all the details but basically four different areas is Workforce Development Small Business technical assistance industry cluster development and neighborhood development. So those are the four organizing principles and our core competencies laid on the second part of that layer and our brand new vision statement is building a closed economy. Great. We'll talk more about this in detail down the road, but these folks here at the table have been working really hard before I got here to address this issue as well. And so I just want to go ahead and allow them to do the presentation, please. Thank you. You can just put it in your saliva. Racing social justice initiative across the city has variety of different Equity areas where we can focus our time in order to increase racial equity and there are three Equity areas that office of Economic Development Office of film and music are touching and that we're really looking at those different those three areas through the way that we Implement our programs in the projects that were implementing in order to implement them in a way that reduces racial an equity and as well looking for ways to build into our policies Equity so that from the get-go the way that we approach our work in the way that we are operating is bringing Equity of the four and then lastly is through our Partnerships with external and really diverse Community organizations. So I will turn it over to Ken Hi to racial Equity is a big part of our only in Seattle program serving business districts, and we have provided funding and staff support for 11 organizations that serve communities of color. We've supported their actions that really helped better engage with communities of color and business owners of color through things such as and working closely with the Department of neighborhood community Liaisons. Make sure the Outreach has done and done. Well, we've supported at racial Equity training for the managers in the business district organizations to make sure there are better informed about them how to serve communities of color. We have also supported their efforts to compile race and gender data of businesses in their District. So they have a very good understanding of the folks if they are serving in there. Tricks and we have also provided direct financial support to business owners in in those districts Houston Community Development block grants, and we have a small grant program that we provided funds 225 Wimpy's last year. I'm so this is our small business team and we provide and connect new and existing businesses to Financial Resources management education and help them navigate to government processes and painting permits and licenses and all these services are available to all Seattle small businesses, but we particularly focus on low-income communities particularly in support of minorities in an immigrant own businesses that small businesses are seeking from you and helping them understand their leases and what they could do with in the confined a contract that they've signed other things we were doing currently Into the construction impacts that are happening around the city and how do you help people help businesses as it relates to Construction in packs that is that is something that we hear a lot about you and so we will you collaborate with the SD card and making sure that the the businesses know about the impact that are coming and so actually helping them at navigate and tons of providing them that marketing tools so they could reach businesses that are outside of that area or Delivery Services for food businesses that varies based on in particular neighborhoods, and we have in some neighborhoods had a business stabilization. Funding pilot to help address the needs Associated or mini that are created when some of these kinds of construction projects occur. Sometimes they impact a business's ability to draw in customers and we've experimented with that before I think we've had some good successes. Can you talk a little bit about potential plans to make something like that permanent in the neighborhood in talking to the businesses? What kind of help they need. We're looking at maybe a funding some of the changes that they need to make with her no business in order to adapt and so we we don't have conclusions yet, but we're still in the process of we just started a few weeks ago. Well, as you know because through your leadership is the cdbg money has some restrictions in the state of Washington Constitution, and I'm learning a lot here. And so we support small businesses and but cdbg money comes with some restrictions but the $200,000 that was allocated as a one-time pilot. We have application process going on now so far as I understand it by today. I just checked in we have for businesses that actually fold out the form in the pipeline. Some of the folks are from your community. And so so there is a process in which to apply and does the committee structure to evaluate job application and and so on so forth and I'll be happy to share more details couple months ago and you didn't have a green light yet. fantastic next Lawton. Okay, what about these teams is focused on supporting entrepreneurship and Industry in particular industry sectors and there are three different samples that I want to highlight here as it relates to our work with our sj1 is the work of our startup business Advocate who has really sought to make connections between technology industry and young adults of color. So doing that by making connections with technology training with that would that audience and connections with technology training and with the industry familiarization as well as support in job next job networking opportunities. And this particular position has really sought to be out in community and is really focus on making sure that at least 50% of his time is spent with individuals of either women or minority individuals second is our restaurant success program, which is a program that is created to help ensure that folks that are interested in either starting a restaurant or expanding a restaurant or a food truck can can do that and understand what the regulations in the requirements are and that person's really gone out and sought collaborations with Community Partners and brought kind of a Roadshow to variety of our Seattle public libraries really targeted in our communities of color so that that information is easily assessable. And then lastly we have our envirostars program, which is a green business recognition program. It's actually a regional effort that we partner with from. Golly, I think it's like Snohomish County to the east side and King County in any event. That program is aimed at supporting small businesses to Green out their operations last year. We engage the racial Equity toolkit with that program and highlighted the need to have some in language business assistance. So we were able to get some egg additional funding this year and have lunch that work. Poopy, I really helpful to get some data about the numbers attached with these three bullets for each techhire and tactile the two business Outreach and support and the enviros cars similar to like what you do on the slide that we're moving forward to just get a sense of the scale of the program sure. And yes, we can follow up with that if it's not already in our report glossing over on that, but I will look before following up. How about I want to make work for him looking if it's not there I can provide some more detail. Thank you. So the Workforce Development team we know in our region that there's too many of our community members that are not benefiting from our economy. And there's even fewer Federal Workforce dollars that are flowing into our region are latest employment unemployment numbers. We know you was the unemployment rate in our Region 5. Your estimates is about 22% for 16 to 19 year olds and 4 youth 2224 to about 8% We don't have data on both youth youth employment and our age and race, but we also know that African American unemployment rate is about 11% native Hawaiian and Pacific Islanders. Also about 11% Where was white alone is about 3 a little 3 to 4 % and for all of these percentages, this is the percentage of the demographic population that is seeking work. Strategies to really Target both low income and communities of color. We primarily do that through our contracts with our nonprofit providers darker connected learning Grant people talk about in a second and our Partnerships with the community colleges. They're all aimed at building up these pipelines not just helping folks eat their first job, but really find Pathways to employment that gets to the economy that our director has been talking about so that they really can thrive in our local economy. All right, ladies finance and operations team overseas, obviously the general operations of the office and we look for ways to build racial Equity into our department policies as well as are responsible for tracking over these Investments and expenditures as specifically we track our annual wimpy spending when you look at our. That's tracked through the city's Financial system. You would see for last year. We had to 11.5% spend with Wendy vendors. One of the challenges that face is that a lot of our money that is discretionary goes to nonprofit organizations that are serving communities of color. And also what I would call quasi-governmental organizations like Seattle colleges or the Port of Seattle. And those expenditures are not eligible to be flagged as windy. So they don't contribute to our Wendy spending when you back out those types of expenditures. You actually would find that about 77% of our discretionary budget goes to support Wendy vendors. So we're proud of that and then one example of how we would build equity into our department policies you may or may not remember seeing legislation come in through over the past couple of years for money for OBD2 help do Redevelopment of our space, but we've been building out space and making it the new seven by seven workstations with adjustable desks and what not and as we've been going through that process staff have been reorganized. Two new work stations and we're almost to the end of that process and I ended up under taking out racial Equity toolkit to look at as I release the space planning. How are we doing and actually found that a disproportionate number of our staff of color actually have more interior office space and I think I had we not done that okay with you have perfectly logical explanations about why things play out the way that we do, but I think we know where the implicit bias There's an opportunity to question some of those assumptions. And so with the completion of this space planning effort by the end of this year. We should be able to address a little bit of that. I really appreciate that analysis is great. And so it's just a small example of the how things show up that impact our ability to sustain a really robust Workforce. It included the range of prospective we want there and thank you for acknowledging that here. the I can make you trying to make a rhyme but I'm going to just leave it and appreciate that. This analysis has given us the tools to do so. Yeah, and so this is one of the examples of our Partnerships with the small business support organizations. We have a contract with Venture and what we do is we actually try to really be specific in terms of the neighborhoods that we go into and we try to make sure that there are programs that they come up with and collaboration with us or time-sensitive for small businesses to make sure to Taylor that are program to be To be convenient for them the location a lot of businesses don't want to go too far away from where their businesses are. So we tell her that and also in collaboration with a g o n lays ons we actually do language translation on the spot as we do some of the education Leaf counseling for small businesses to be able to interpret the limits and opportunities within their leases. I want one of these I've heard throwing around a little bit is that there's actually a need for not just training on doing a new lease negotiation, but perhaps somebody to not do the negotiation with the property of but to go get with them and we looked at whether or not those Services could be part of the the toolkit talk about that. We did a red on and so let me go to the weather. All right down the music. So as you have all mention data is important and so we have been trying to get better data that will tell us how can we better serve the constituencies that make up the creative economy. So we've undergone a Night Life Equity study. We did a music ecosystem study that began last year and ended beginning of the year. So really trying to identify where are the gaps that where our office can either directly better serve our filming music Industries and other creative Industries. And also what are the blind spots that we have? We have identified that the people of color have greater barriers to accessing capital of professional development opportunities and networking opportunities. So this is an example of how we can use data to better. Program that provide better programming from our office. I would also like to mention as the city's liaison to the Seattle music commission the commission's commitment to racial Equity has really blossomed over the last couple years. One of the examples is with the city of music career day. We have done much more intentional Outreach to high schools that have higher numbers of black and brown students so that we can make sure they're also getting the opportunity to network with music professionals who look like them representation matters. So we've also been making sure to diversify the panelists and speakers that are part of a music career day. We have also been working with these directly to hear from them and making sure that we are inviting young leaders of color to be at the table with the music commission to help inform how we do our Programs like career day, but also, you know looking at maybe some internship opportunities are other ways that young people can get connected with work opportunities in Creative Industries. I just want to call out some of the findings are one fighting for several demographic groups in the creative economies report female workers were underrepresented and Stephanie 10 largest creative occupations. American Indian or Alaska native workers are underrepresented in 9 of 10 largest breed of occupations black and African American workers were represented all so under-represented in 9 and 10 Hispanic Latina workers up under representative 8 of 10 and native Hawaiian or other Pacific Islander Opera under-represented in 10 of 10 largest creative occupations. So, it's clear. I know again highlighting where we're missing. The mark is really important to identify in the gaps and coming up with strategies to address them. So thank you for that. I'm so done a very set racial Equity to a kids and these are the four that we're going to talk about until we have actually to the two of them were going to talk about today. When is the youth employment career awareness and Sasha will tell you all know more about that? And then as you talked earlier about the commercial lease education, can I tell you a little more about that? Okay, I'll go first with commercial lease education. This is something that came up in Chinatown ID as we were seeing a lot of development activity going on in the neighborhood and wanted to make sure the businesses would be prepared to take advantage of those opportunities and that we work closely with our Community Partners there including skipped and they also had a consultant that did a lot of Outreach to businesses to understand what kind of support would be really valued by those businesses and that really helping forms of a program. We put together a workshop series that focused on so it will be called a commercial lease hold a workshop series that really looked at all of the parts of the leasehold process starting from before you even talk to a landlord. What do you need? Prepare to talk to the landlord with financial information your business plan that kind of thing and then we drove into standards of a commercial lease. We had help of way find an attorney that help too with flag the key terms of a lease and help to find what some of these terms meant. And and so we provided a sort of a checklist on Reese's and then we look to organize a design Workshop. So once you have to release negotiation going on what kind of design would your space look like in in in the location we had a day where we brought an Architecture Firm to help the one-on-ones with small businesses and they actually came out of that session with a sketch of the new potential space and they I went through what what would the design need to be for their business and and they walked out of there with a sketch of those are examples of workshops that we did in the neighborhood and it had a real tangible benefit to those businesses that we've been seeing that businesses that participated in those workshops are now getting Reese's for example in that Luis Hotel building every development in Chinatown ID3 tenants participated in the workshops in the type in building pnom Penh just faded into workshops. So we know that help get them prepared to release their space. It's also helping to prepare prepare them to apply for funding we have a pilot tenant Improvement fund going on 10:00 is one of the first word he's of those funds and we know that because they received all that training before and they really understood the steps that need to Go through due diligence. That would be evaluated by all the parties. Who would we were pleased that it it really helps him the business so far. Is it currently exists in Chinatown International District new just relocating to a newer space and makes them to a neighborhood. So they're coming back and then another is a Mobile Food business. That's kind of going into the next step of getting so I think it's important to understand or at least it is for me how we are defining our outcomes. I don't know necessarily that somebody who was going to be on a lease take it took the the workshops that you guys offer and then ended up being on lease, but that in itself is a way to Measure the success of the program. I think the way to measure the success of the program is taking a look at the lease at the edges of signing and how it aligns with an evaluation of what a model good commercial lease is so I'm wondering whether or not that sort of After the fact work is being done, you know just I don't know that you can do a before-and-after butt just it it would be helpful. I think to be able to check our assumptions that the result of these trainings is actually the the the outcome is no better leases that are less likely to take advantage of communities that don't have a lot of experience in the in this area. So I don't know we're doing to look at the laces after they've been signed. That's really good point and something to keep in mind. We are seeing at least with some of the businesses you are applying for the tenant Improvement funding that the lease is are not just standard, but they are actually to the benefit of the businesses with reasonable sort of lease terms are the rates generous rid of options to extend and sort of the the initial concessions on rent and triple 9. Charges that were saying that that is being built in and because we're at the table with pilot funding, it really does help the business and our business this organization doing incentive licenses in that instance because for make sure we're helping to fund improvements to the to the property so that I think that sort of partnership definitely lends itself to good outcomes for everybody. So in previous years LED managed are major Youth Employment Program, which is traditionally just massive internships and progress program to spend excess youth of color. We still found we did last year. We still found that use of color continue to have less access to employment opportunities and often are less successful in those larger internship programs. I'm use of color have multiple and institutional barriers to accessing these programs and need a lot more targeted approach has and wraparound services. So I'm building off that right we did last year in 2019. We developed a crook natural learning Continuum with other departments that includes a kind of a tear or kind of job Readiness Continuum, which is kind of attention to have meeting youth where they are. We built this approach to let the community tell us what would best serve serve their their young people. So this is the first year. That we've instituted a career connected learning Grant based off of what we heard from our previous Rhett grantees submitted to us along that development continue. I'm a myriad of different approaches from queer in his activities Social Capital like Alex talked about meeting professionals that look like them all the way up to internships and even use apprenticeship this approach also required our community partner to partner with employer keeping in mind the work force component that we want to make sure that we're preparing and people for this economy. But really this this new approach that we developed was to better serve those that are traditionally left out of these of these programs. We recognize that internship programs are one of the best ways to prepare young people for for the future and we still need to build those programs, but we know that not everybody can access them and we need to do a lot more support kind of Upstream to make sure that young people are prepared for those internship opportunities when when they get there. So this this approach we're doing it. 80 on on this approach this year to see how this works to make sure that we really are surveying use of color immigrant and Refugee communities and really letting the communities work with us to design those programs that best serve their needs. One of the issues that has been flagged for me among youth in SouthPark is the fact that many of our city operated internship programs or programs that provide a stipend have built-in barrier for undocumented youth are there ways that we could deal with that or is that just something that bridge we can't cross the traditional internship program that's always a barrier especially if they're on employer payroll but through opportunities like these Grant young people are are able to be paid a stipend for their time. why we actually are funding a group in South Park this year through the Vietnamese friendship Association David Consortium of Partners who are doing job Readiness training internships through stipends training entrepreneurship kind of been in a cohort model, so it would be great if We could check in with other City departments that provide use this type in model because I don't know that everybody all the Departments are using the stipend model are using it in a way that reduces those barriers friend for undocumented youth hyper. I think I've heard that the parks department has it has a stipend but it's still not documented Uther still not able to that that again I'm repeating third-hand what I'm hearing from other folks who are experts at that and can find creative ways is one of the ways that we know we can address that problem. So we'll make sure to include that in Iraq for this weekend. I'm so just quickly and summary some of the challenges that we have encountered and engaging and racism social justice work. I think being intentional takes time and requires you to slow down and often that can be seen as a luxury cuz we want to get it going. We want to get it out. We want to engage the community. And so that sense of urgency is something that needs to be interrupted and the tool kits are definitely a way to help us to slow down and also opportunities. We've talked about the importance of representation and who's in the room and who are we serving? And who are we talking to so that also take some time and change in the way that we normally have done our work requires us to reach out requires budget and additional staff time. So that has been something that is important and also has has presented a challenge and I think it just in general having a a culture of learning not only for staff to get trained up in to attend to rsj trainings, but also for our partners, I think we've seen real success with the music commission engaging our estate training with the only in Seattle program, but that also takes capacity and dollars and also a certain amount of Readiness and buying from Community, which is something that we can push but hasn't been standard and everything that we do. And I think we talked a lot about data and collecting data so that we know that we're getting where we want to go. Well, this is important and also can be sensitive figuring out the right way to ask for a data. So that people's identities are respected and protected is also a bit of a challenge. So you want to know who you're starving, but you also don't want to put people in a in a bad position. I think those are the those are the main the main things. I think I'll just sit and tax of working in a political landscape particularly now with districts and council members really interested in wanting to serve their District sometimes from the doing our state work. We can see that as potentially diffusing our efforts to really Target our work toward the most wonderful. I appreciate that recognition for sure as District Council Members. We have an obligation to promote the interests of our district as a city. We have to walk the talk of the musing erase and social justice and Equity lens to make sure that we are spending our limited public resources in a way that benefits the communities that have been neglected the longest where the greatest needs are. So I appreciate you guys walking that walk and and and also sort of being being understanding of the line there as well in the balance. Thank you as well for also lifting up that the rsji work really helps us develop in the city of learning culture. I think really that's that's we don't talk about that a lot. I think by identifying these gaps it pushes us and in order to push ourselves. We have to learn about the gaps and learn about the impacts to get committed to addressing them. So I really see this Citywide initiative is always having great potential to keep pushing us forward together cuz we're Brian. Yeah, I appreciate those comments comes from her Bolden appreciate that recognition as a district representative council member in Isreal. I think one of the things that's really helpful is when I'm departments with the city's a whole can kind of layout of a symmetrical Clarity how we're going to prioritize things and sell them for instance parks department has been a gap analysis that shows where the areas where people are you don't live within a certain distance of a park and so on my constituents come to me and say hey, we really love your help, park. It said that's great. I love to help you. Let's take a look at where you fit in the Gap analysis. And if the reality is like, oh actually your neighborhood has an opportunity, but it would take that opportunity. That means that an area that's not well-served. We will miss out and sometimes that the responses frustration but often times people really understand. Turn us. And I'll say well, you know, we think that there should be the Gap and Elsa being bigger the great. Let's work together to fill all the gaps and then talk about how we how we even more inclusive communities. And and and that means that your project may have to wait for a while. And so the analysis the the you all are doing I'm in the work you're doing is is it outstanding and I really appreciate this report and I think helping us figure out how to prioritize it in some kind of assistant systemic way or whether it's napping or other things that we can use his tools to look at and say yeah this neighborhood could use some help but it's definitely way ahead of some other business districts and those going to be prioritized and here's where we doing that and I recognize that made this those may not be in my district, but I'm committed to Racin social justice. I'm work at the city and that means that sometimes we have to take a backseat to allow other places to catch up and I think that's great. No, I'm I'm right with you. And so we are doing massive data analysis, and we have been quite a bit of work around geography education level and also race and cutting those data into pieces so we can make sense of what's going on. Today's economy. But one of the interesting perspective in and thank you so much cuz you just you just paraphrase what I was going to say. When I presented to business associations about our new inclusive economy Vision, some folks will say you're turning into a Social Service Agency. But then when I present the data and the trends then they understand and so it's about making sure that this community understands why we're doing it and in a macro data perspective if he's laid out that way and people do understand is to your point. I appreciate your your opening comments Bobby about how we're doing here at the city's is unique in your experience with the city's thank you. It's doing great work. And but they can only do that work if it's intentional and in you ever will the play and you know, we talked about this privately but to create space for that the day today or does he have all the stuff we all need to do is really important. And I know that often for change teams. It's it's a commitment to do on top of your other expectations. But making sure that the head of the department in the whole city week Ariane space in between prioritizing and valuing it. So the team he can he do that amazing work is really important. So the so it's a 20% rule that I have applied in other departments and that is 20% of set aside for learning opportunities not just for us but our service providers as well. So we do that type of analysis. Make sure that we can do that. Sometimes it means that admin cost will go up a little bit but from studies if you want to really create an anti-racist organization you have to do it. And so that's the type of analysis that we will go through not just for ourselves for partners as well. Thank you so much for that. No. Thanks, I appreciate you taking time. Great customer herbold. I have an 11:30 meeting you in the fun place of voting moving and secondary emotion. Items for Council Bell 11958 3in ordinance relating to preparation for the office of arts and culture meaning ordinance 12572 for which adopted the 2019 budget and lifting a Proviso proposed on the office of arts and cultures cultural space budget control Levy level by Seattle City. Council Greensheet 25 b 1 2019 Again, and we just made off camera decision to hold the last item on the agenda for the next meeting on August 13th. Thank you so much for your patience bugs. Cancel Central staff. So we're talking about possible one 19583 and this bill is actually this lift the Proviso on funds that were allocated in the 2019 budget last year for $150,000 to assist town hall with their Renovations during last year's budget that hundred fifty thousand dollars allocated in Green Sheet to 5 ft 1 and its funds in admission tax to go to the office of arts and culture. The the Proviso basically stated that until Council was able to see a negotiated benefits public benefits that we're coming through we can hold that funding after negotiating this month benefits in conjunction with your office and the office of arts and culture. We have a negotiated agreement that would create another set of public benefits in exchange 250. The reason for I'm having to negotiate those benefits is a limitation in the Washington State Constitution that prevents the city from gifting public funds organizations. So the historic practice generally Citywide and through the office of arts and culture is to negotiate a set of benefits that would benefit the the the city more broadly. And so this funding is the last of three sets of funding to three sets of budget actions that provided funding to town hall. We did $500,000 in 2016 $350,000 in 2017 and in as I mentioned in the 2019 an additional $150,000 and so the benefits negotiated for this $150,000 are to have Town Hall continue its focus on raising Equity by providing 50 hours per year of free use of their reading room by City. Community-based organizations and other community groups and it's all for programming specifically related to race and Equity. So Town Hall plans to advertise this this offers through their normal Communications platforms public announcements to manatees at the regional Equity facilitators other City Department see the other organizations and All City departments. And so passage of this bill will lift the Proviso allowing the contract to be executed and the phones to be released fantastic. That's very helpful for folks will be watching along. I think it's important to the Highlight. You went through a number of different Appropriations. The underlying principle though is that for each of the times that we have funded the cost associated with the town hall. Capital project we have had public benefit requirements and it's important to recognize that those public benefit requirements are unique to each funding decision. They are not weird. We do not overlap so you don't get for the funding that we provided in last year's budget. You're not getting credit for the public benefit you provided in you being Town Hall that town hall provided in 2016 or 2017. There was a new public benefit requirement that is distinct and unique from the public benefit requirement. The previous two years. It would be helpful to understand. What's the term the number of years that this public benefit is required. So for these I see that it says 50 hours per year, but I don't know how many years I will have to follow up on that piece. I'm not quite sure for how long I know in previous another 2017 public benefit. It was for five years. I believe in that was a public benefit to require arts and culture event series free of charge to people under 22. But yeah again that was that was a five-year-old legation be helpful to know I'm in and also what the plan is that town hall has to get the word out that the reading room has this 50 hours of availability by nachas City departments, but community-based organizations. I think I remember former council member Licata did analysis of the use of public benefit agreements by the organizations that were obligated to follow them and what we what he found at the time is that there are a lot of Pull-Ups. Set out there that the community could be taking advantage of that. They're not because they don't know about them. Absolutely. So in terms of their advertisements, so they'll do them through their regular announcement. But also they'll be targeting communities that are underrepresented of marginalized as they have in the past because this is specifically about respect what he work for example last in the benefits agreement when they were providing programming to conduct Outreach to those communities, it was specifically invited those communities to take advantage of those tickets that that opportunity and so my understanding is that that approaches going to be similar. So they're going to reach out specifically to community is doing race and Equity work City departments are generally aware that that opportunity exists, but in recent months there's I think there's been a little bit more of a push to make people aware of what that's about what does opportunity Do we typically require any sort of a report a report back on the 6th, as fat as funded organization has in fulfilling its open if I don't believe that there's a report that comes to counsel. But my impression is that Arts tracks all of the different organizations what kinds of opportunities they have and then when those get when they get fulfilled that would be I'd love to know or to have that confirm that it's tracked because I do recall recall that went under the cot of did the audit it was pretty it wasn't being tracked. So it was pretty inexpensive job to compile all the public benefit agreements and figure out which ones had sort of exhausted their offerings to the community actually and I don't know that that's for all departments that attract so closely. I know that for Arts at the traffic cards. Yeah. Yeah, for example are on our lives have changed team Retreat this year was done that yet at Hugo. That's because we were going to take advantage of all right? Well, I have no further questions and given the time and the address of council members. I'm going to move Council Bill 1195 83. I'm going to Second Council Bill 1195 83 and I'm going to vote in favor of council 1195 83 and nobody is standing and nobody is opposing and till this whole move on to full Council on Monday. And with that meeting is adjourned. Thank you.", "end_time": 7702.1}]}