{"format": "raw", "annotations": [], "confidence": 0.9432131477764675, "data": [{"start_time": 0, "text": "Thank you for being here this morning for our governance equity and Technology committee. We haven't I rather short agenda. So we have some appointments and so I'm going to dispense with the The any reported at to give at the beginning I will say that there's no objection would approve of the agenda. I don't like an object to myself so approve of the agenda and we don't have any public, So I'm going to ask anyone associate with any of the appointment for reappointment to come on forward to the table as Miss Samuels reads it into the record. Appointment 013733201375 appointments Andre appointments for Rene J Peters Jr. Torgie Madison and Stephen maheshwary as members of the Community Technology Advisory board for a term to December 31 2020. Morning. All right, let's take advantage of the the informality of the situation. Just start with introduction have a quick discussion. Please have Tracy Cantrell Seattle it executive advisor. But I'm turkey medicine. I am Tobias chair of C Tab and co-chair of the sea tabs privacy and cybersecurity committee. I am Stephen maheshwary on the chair of the Community Technology, Advisory Board. My name is Renee Peters. Some newly appointed member of the board. Co chairs are at Leeds FC. Tabitha has been involved as soon as usual wanted to talk about. Thanks for being part of the group in and showing leadership in there. I'll stay up with you. Tell me a little bit about yourself. I read your background, but tell me why you're interested in joining a seat. And I know you've been active in this far already. So very excited to see that there was a form where people could you know come and talk about issues that matter to them as far as technology and how it impacts Our Lives. It's something that I've really seen a lot of different points in my career and educational life. I started at MIT as a chemical engineer. I worked in manufacturing for Procter & Gamble before going to business school and now I work as a Senco marketer for Microsoft working in artificial intelligence and through you know, the manufacturing lens through the tech lens through in a study in chemical engineering and just thinking about technology as a whole you really get to thinking about how it can impact people's lives for the better in a lot of different systems, you know, this country affect people's lives and Technology really had the opportunity to improve their situations in many different ways through Equity through access-to-information and you know what I got here and saw the discussions Betsy tab was having really excited just how open they were as a member of the public I was able to actually just hop on, you know, do a question. I asked one of the sessions they invited me to come in and collaborate with them on one of their efforts regarding the wi. 2040 initiative and you know people really make their voice heard and it is just very open accessible and very human and I appreciate that song. To get to work and I'm honored to be part of this. Well, I looked at your background in this may seem stuck with this is actually my excited face to have you so very pleased that you're back on his indeed impressive. One thing. I do want to mention is that as I recall, I don't have it right in front of me, but there was some talk in your back or what smart cities initiative or some smart cities working. So I think within maybe five for five years ago, we'd start started a smart cities initiative put some some Investments behind it and some Personnel it's her more into a different kind of initiative for the city, but I actually have this week meetings with your employer in in some team members on revisiting how we were doing a lot of smart City work now just not calling in as such trying to look at how we could do better because there are some of the Cities I think that her way further along than I do what I like to do. It's not confused rolls if your employer but will at least let you know about these meetings and who the people are you probably would recognize some of the names. This is actually second meeting having with them. So and I'm doing this purposely before our budget deliberations. And so I will keep you in the loop on that work to work doing we're focusing on predictive policing in AI management of infrastructure so I can definitely leave that in to Microsoft in the hard way. Okay, we are we're meeting Thursday. I know that much and so I'll make sure again I know the protocols over there so I don't want you to be here so but a lot but they probably would walk them in and put in this way. We have sodium in it and existing infrastructure Lucy tab on what we're trying to do from the business side of things. And so okay. So what else what other weather thoughts should we talk about a seat at what's going on whether they had issues. I know some of you looking at the surveillance work. Doing and that's becomes very challenging because we're trying to get out at least with some of us think we are good technology and effect of technology in particular in Public Safety in other areas, but then again, we no privacy concerns are legitimately very intense and they should be because of the lack of the breach of privacy. So we're trying to muddle through it ourselves, but maybe you guys could talk a little about the dishes at eat a beer compared with Galaxy Tab just to provide some transparency over at least my time with the with the board over the last 2 years. So thank you today for your time and for your consideration for not to smile reappointment, but all of our appointment and reappointments to the Community Technology Advisory Board, I am proud to be a member and chair of the Community Technology Advisory Board, which is An active board that has been present in our community for 24 years, which actually surprised me and we'll be celebrating its 25th anniversary next year and though I've been a resident for of Seattle for six years were the last two years with C tab as truly help me connect with the broader Seattle Community. And as a board one thing I've noticed is that we are truly dedicated to emphasizing the community in our board named constantly advocating for the rights of those disadvantaged by a lack of access to broadband or technology for those whose rights may be infringed upon by potentially over-reaching cyber security Technologies, and for community-based organizations that can benefit from City resources where when it comes to improving or creating digital literacy digital literacy programs or access to technology and I just briefly like to highlight some of our accomplishments to provide visibility into her boards efforts in 2018. We hosted many public panel. Sessions on topics of AI automation impact of labor on the tech for good public-private Partnerships Broadband accessibility for low-income residents with members of wave in Comcast. We collaborated with the organization such as Urban League the mayor of Mercer Island Bellevue city council Microsoft Deloitte lime executive team does organizations and More in addition. We have monthly presentations from various nonprofit leaders and members of city government present to on the latest issues and initiatives this year. We've really stepped up our focus on in the Tech Community overall in the tech for good sort of community. We've co-organized a series of tech4good hackathons hosted by democracy lab along with organizations such as code for America open Seattle and the Washington technology industry Association, and this is a series of solution-driven hackathons work. Unity volunteers come together to work on Tech projects that impact issues ranging from housing in Seattle School violence providing greater transparency to government data education research on orca whales and More in addition. We have partnered with the Seattle public libraries to co-sponsor and emerging Technology Series where the public can learn about emerging Technologies ranging from virtual reality and augmented reality to privacy Technologies. And recently we've hosted discussions on areas at the Nexus of tech and social impact including low low income housing. We recently had a presentation from Bellwether housing on their new crowdfunding campaign on transportation and supporting the solution-driven tech4good community. I've been more relevant it to the to the committee is that we've issued a number of advisory comments and policy reviews. Torgie Madison who is here as well has been incredibly active and stalwart contributor to issues of Cyprus. Security and privacy and code leads our committee with Smithy Chandra shekar. We've been inactive contributor and reviewer of surveillance Technologies and have been in meetings around these Technologies over the last two years including those outline and surveillance Hornets some of the other highlights include our official statement to the SEC on net neutrality are advisory, non-public benefits during the way franchise renew our comprehensive review of the WSDOT, 2040 and Beyond Transportation plan that Renee mentioned our recent surveillance Ordnance group to public comment and more. I'd like to pass along to comments that we recently approved to provide the city council and one one is regarding an analysis of the recent technology access an adoption survey the kind of highlight the sum of the Findings that we get around digital Equity that we found through the sort of data set that was collected as well as another letter in support of the critically needed digitally Equity act legislation proposed by Senator, right alongside that other digital Equity efforts include making official recommendations on the technology matching fund for the last several years. One thing I'd like to highlight is a tar board membership is significantly limited compared to other boards and commissions as we only have six members and three vacancies of which were waiting to be filled my Merrill appointments if three numbers are missing for some reason we would not be able to vote or approve or make progress during board meetings, which would hinder you know, the that momentum in an energy from our volunteers. But even though we are volunteer board, we are also lucky to have the active participation of many members of the public and providing valuable policy insight and review organizing events writing. Papers and more are subcommittees that Renee is on is also an entirely by non-board members in the last round of applicants interested in our three vacancies that were open. We receive 31 applications from many who have been part of C tab longer than myself. I am grateful for the support and energy from not just our board members, but from the public as well and I hope city council takes note of our vigilance our productivity and Community interest and could consider an official expansion of our board to a proposed 15 members, which would bring us a parody would not just the road map of things that we want to accomplish this year. But with parody with many of the other boards and commissions that have a Community Focus in Seattle. We are seeking to have a balance board in terms of geographic gender race, ethnicity and Technology expertise and it helps us achieve our goals and meet the demand and growing interest of the community to step up and become even more civically engaged this would allow us to Greater contributors to current and upcoming legislation including for the surveillance ornaments. And so while I'm here humbly for you to consider my reappointment ihope this also provides visibility into a car progress and her needs to be a better board to serve your committee city council and the public at Large. Thank you. Thank you very much. Steven responds a lot of what you said, but thank you very much is very impressive presentation, Troy. Did you want to chime in and cosine that unreasonable request not just go ahead of sea tab a chance to read that so kind of deferred to him real quickly there, but I completely completely agree with that statement and Mike comedian particular has quite a bit of work cut out for it. As you mentioned the surveillance ordinances kind of a long history with city council and I was actually involved with the Advisory Group from the very start that was put together by Ginger armbrister and was Aware of it and participating in that well before I was ever in a leadership position with the privacy and cybersecurity committee. And so in that Spirit when the group two technologies were available for public comment the Kennedy sourced volunteer effort from active members of C Tab and also the members of the community who weren't even necessarily attending the board meetings and put together an advisory statement. It was submitted the wrong with the surveillance impact reports. And so I think that to Stevens Point there's a lot of work that needs to be done in the privacy and cybersecurity sector and Stephen mentioned that the survey for technology access to adoption. We have a summary there in front of you and 80% of the respondents in that survey mentioned that the Safety and Security of their information was one of the top concerns they had when considering the technology has on their devices, and so I just wanted to reiterate Stevens Point. Thank you. Thank you for your leadership to so let me respond to some become a special. I think I would agree with you that. I rely on CTF for a lot of work over the years of the last 12 years and we cut down on a lot of the commission's during some tougher times in our budget analysis, but I think that you're well within your rights to suggest we get more members and so and this is not new to this was not a surprise. By the way. I was we're very where your request so thanks for sharing that publicly. So the public understands with your passion to do the work and ask for more resources in my receptacles toward it. So that's fine. So we'll just work offline about looking at those numbers. I have to admit that I was I didn't realize you had as many vacancies as possible and just for the record they are all on the mayor side of house all three of your city counseling appointment and I want to come in my staff with Miss and Missus and Mister vinh Tang for they take their Outreach and finding seat at memories particularly not only talented folks. But trying to reach Diversey and under underrepresented groups as well and they take it very seriously and they do an outstanding job. So Tracy maybe can help me out a little bit to tell me why we have so many vacancies on the other side of the house and see what's going on there. I don't have a specific reason to articulate today, but I can follow up with the mayor's office and find out. What is the stemming the current round of vacancies this have you all. I don't mean to we could have had a talk before this but you are aware of the vacancy said you did you make any enquiries about them or are you come here for three appointees realizing that you're sick? So I think he has seven actually said six with my notes and has had one one member term off. Okay, so we have four total. Yeah, 1 cancel Premier. I think Renee is taking are at the city council appointment. And then we have three where the interviewers were finished recommendations have been made to the mayor's office. And now we're just waiting for the mayor to make a final decision on the three candidates. So it looks like we will have all ten here pretty shortly is what I'm understanding. Okay, but through that process the three. The four slots that are open now should be filled in the next 3 or 4 weeks assuming that the People Meet the scrutiny that'll be launched upon them. I suppose I didn't realize myself by the way that that there's I don't like once he's so many vacancies in so that's all of our jobs to come here. So I didn't understand. Okay, so we're actually trying to meet the it seems a little crazy for us to go up to 15 only have 10 and we have so many vacancies seem to be our first word of it should be fill fill the vacancies which sounds like we're doing. I will say that in previous times. We've made this request we've had as much as 9 and found or 9 or as much as 11:00 and I found that our workload greatly exceeded the capacity of our existing membership, which is why we do draw on a lot of renown on outside members of the public to not just be an active part, but also just lead are subcommittees. And I think I don't recall off the top of my head but it's what was the high number of seat at one point. We they were chartered to have many more. It was the 15 or 20 or something. So we thought it was necessary to do so so so so I hear you loud like so we'll talk off record about what we have their in and double down on our recruiting efforts to get some good talent like Renee hair. So okay message received two things. I'd like to share with you one is one of the with the Innovation advisory Council one of the chore one of the ideas that we've had as a city or try to see with our with the issue of homelessness and housing how we can best use technology more effectively to help with the problems and there's one particular technology known as The Samaritan app or Samaritan Medallion if you will it's a device a beacon and So we've had the I think the founder of the the company meet with us and display his his product and actually brought homeless people that experienced almost to do no longer there really sell some incredible successful stories on that the software how it's used. So when I met very briefly with our Human Services Group, I'm not they get a lot of ideas probably weekly on how to solve homelessness. Right but just says you and your respective companies have a pretty smart evaluative process for new products or Services New asking and it took this process in another life. I played a role in that to it a company. I'm not sure they are equipped to do that. I mean we traditionally zarf peas and we say here's the need and people respond to it. But in terms of some of these ideas and I'm not sure we have the right process and perhaps you can play a role than looking at that particular Samaritan did race misuse of privacy did raise some issues about potential for sex trafficking. I think you know how it works is that it's a it's a beacon that can activate through Bluetooth and it allows a person in the public to understand who this person was and who they were before. They are experiencing homelessness and what their personal story is molasses person to track. $4 to this person through one of our agencies like Mary's place. And so this person can receive the credit the month check right and go there and try to cash it in if you will, so it's not paneling then associated with that process is a mentoring and a social service aspect to it. So we're getting this person that only some financial help wish they'd need but the other types of wraparound Services social communication in and so many people that might be willing to help now having a portal by which they can help even to a complete stranger to the raises some issues. And so perhaps one of the ideas I has perhaps you guys would be so kind as to have the the the the app demonstrated to you and come up with a recommendation. It's a little different for the council to budget this item without it going through the department that are experts in this area. Show my process is to anticipate any objections to the I particularly liked it. And I think that he was on a shoestring budget and I think it's cutting-edge technology and it and I don't think it could hurt things and I think you can dress them proof things. We saw a real life example. So this is an example of where the issues you're concerned about privacy and security that kind of thing could help for this Samaritan technology. So I may send them your way in a few of you been forewarned actually had Samaritan present at Sea Tab and we had a similar experience with you mentioned and we also can afford by the app. I believe the Thunders Jonathan Kamar. Yes, very good-tempered. And so yeah, we're aware of it. And if there is some sort of way that we can give a advisory statement that be great cancel. Do you sew a nice weather and I think seat Abbas. I don't think you all are politically motivated. Anyway, it's not like you're sitting on someone and you had your your you have this political agenda. I think he has a pretty pure to the technology in and have good hearts and what you trying to do. So I think coming from you all it's less politically charged just hears the issues. He was working to hear the technology. She sounded like a check your background and Technology truly. You guys are such a fan experts and so some kind of statement from you if I don't have it so that me to me and Human Services and to the to the executive because I'm really interested in trying to deploy this and some kind of trial basis this year and but a little just like how I wasn't body cameras when starting 2010 now we have them deployed, but it's a little jarring for some folks. So he hasn't got a bet you were either endorse. Mary did not endorse Meridian. She's you see that we should be careful about if we But I'm really anxious and trying to find that this year and that was actually the last one I was going to make was that the to me that you are chiming in on certain issues particular with technology. I think again strikes right balance because you're not seeing as what I call out politically-charged group here seeing as some of the neutral on these issues but coming in just as such a bad actress on technology. That's why I think adding people to this great group makes sense to me at least until Okay, any other comments Tracy if you want to close out? Thrilled that this is a new area of responsibility for me in this has been a long-standing group and there aren't many organizations for the stood the test of time and so it just you see division hard work and dedication and I think that's wonderful and just so you know the way the budget works on. These are things any kind of even smaller budget and packed it comes to the man comes to us. And so I'm hope hopeful that you take is not just a council ride. You guys could come and propose it in the budget and all I do is endorse. Yes, so I get to 22 groups here you go across the street to the judicial side and tell them to but there's no litigation and fuck off. So I'm going to move the appointment of Rene Peters and the reappointment of torgie Madison and Stephen maheshwary probably Slaughter. That's even I apologize. Okay. I will second at all those in favor. Say aye aye. There's no one opposed Shoppers at this to the full Council. I'll most likely also when I presented the full Council Monday at 2 articulate this conversation about the concerns we've had in about additional members because the work they're doing thank you again for your leadership. And I would do The Blind Side on the vacancies part. So I don't like seeing that it's on my watching something. Thanks for help. They're okay with that. Thank you gentleman. I will stand adjourned.", "end_time": 1586.2}]}