{"format": "raw", "annotations": [], "confidence": 0.9257030284581923, "data": [{"start_time": 0, "text": "Good afternoon, everybody. Thank you for being here at City Hall the April 17th, 2019 special meeting of the Seattle City council will come to order its 5:37 p.m. On Bruce Herald president of the Council of Kirk. Please call the roll. O'Brien Salon Juarez president Harold a present agenda will be adopted. Jenna was properly noted and posted an email to everyone that cared about it. So if there's no objection today's agenda will be adopted. Introductory remarks first well thank all of you for being here and think those for listening on Seattle Channel as the public is aware and certainly the applicants or where the city council has a vacancy due to the council member Rob Johnson resignation. I wish you was effective April 5th and the city Charter gives the city council 20 days to fill a vacant position such as the one we have now received 15 applications by the deadline of April 5th at 5 p.m. And of those 15 to do not meet the eligibility requirements as determined by the clerk in the human resource department and the two additional applicants that two additional applicants have with Drew have withdrawn and so we stand at 11 qualified applicants and thank you very much for being here. The city clerk's office has verified all applicants eligibility requirements for serving as an appointed elected official. The application materials can be found online at the city clerk's website. Hard copies are also available at the reception areas on the second and third floors here at City Hall. As many of you know the path the council passed ordinance 12547 9 in November of 2017 that established new procedures for filling Council vacancies in one of those requirements was a public forum for the community to engage with applicants and ask questions. And on Monday, April 15th. A public forum was held in the council it reached out to approximately thirty-five to forty organizations to develop the form and 15, new organization submitted 68 questions, and approximately fourteen Community organization participate at the money's form overall overall that we heard some very good feedback on social media saying the Forum was productive and I wanted to publicly come in the moderator Bryan Callen. Yeah, Callahan types are about their Brian. Callanan spells his name Callahan those who did a great job. Sorry about that. I know he is watching right now to see what I said about him on Seattle Channel's website again for doing an outstanding job applicant must participate in that public forum in appear before the council at this April 17th, 2019 being to be eligible for the appointment messenger are our code So today we're meeting to hear 3 a 3 minute presentation up to 3 minutes. You have to use it for 3 minutes from the candidates and followed by counsel questions, and at the conclusion of the presentation counts of questions will hear public comment from the members would like to give public comment. And there's a sign-up sheet and if they will put it back out there if we need to to make sure that we hear from you as well. On Monday April 28th to 22nd the city council will convene in regular session at 2 p.m. In council chambers to deliberate and devote to fill the vacancy in again. Finally before we begin the applicants presentations. I would just like to thank all of you who applied we know that community service and serving this the city in this region is important to you until we thank you for going through this process. Are we believe this is a great opportunity to add some Ben strength. And so we look forward to that to the person and that will be eventually selected. Okay. If any of you are nervous rest assured I am too because we don't do this a lot. So we'll try to have fun with it and we look forward to hearing from you. So we're going to begin with presentations from the applicants and right when I do that were going to call them out in alphabetical order, but I didn't want to share with the public just some of the desired qualifications do we stated publicly an individual qualified to chair the planning land-use and zoning committee and a quote-unquote caretaker agrees not to seek election to the council this year and I was a thoughtful policy directive that the council I wanted to make sure it's the same place are there legal prohibitions and we can and can't can't ask for but we certainly can make our expectations very clear in this regard an individual who has an understanding of Seattle City council government operations budgeting and legislative process. He's demonstrated knowledge of the public policy issues associated with potential committee assignment. Demonstrate a commitment to social justice and the ability to communicate and collaborate effectively across cultures and with diverse populations. So that's your of a general description of what we expect and with that. I'm going to relinquish the microphone. I'll call you up one at a time and what a task after the person speaks to take your seat there back in the back in the audience section, then after all 11 or finish will all bring you to the table and will also give the logistics of that point. So please 3 minutes Center Mike. Take your seat and I'll just start calling out the the names when they want any questions or colleagues or or any comments open, struan to my colleagues, or should we just idea or make sure I gave her one enough to show Brooke brought you our first and you'll be followed by Darby to call. Alright, thank you counsel for the opportunity to stay tonight and what it takes to be affected in this office a combination of knowledge skills and most importantly the values of moded me motivated me to submit my application when it comes to policy. I have a long history of advocacy on the key issues that I will face in this appointment. I bring a depth of knowledge on m h a m s t e a d use the design review process bike infrastructure public transportation education and more. I have a track record of digging into the details and data to bring concrete proposals to cancel. I've been through many legislative cycles and no one knows what it takes to turn right policy idea into law. You have to be ready to collaborate with agency staff and listen to public you have to be flexible and ready to adapt to unforeseen circumstances and you have to understand that passing a law is only the first step and that's successful implementation. Requires resources oversight and accountability and I'm prepared to bring those skills to the table having been part of the process of passing local hospital support struggling students and other budget wins. I also understand how complex the budgeting process is. I would look to make sure that we are investing in the programs at work ensuring that money that's intended for things. Like Liam's actually goes to bike lanes and with new Revenue coming in from mha and hopefully anti displacement programs like the Equitable development initiative and homelessness diversion programs, like rental assistance. I also recognize the responsibility. This person has two years of community engagement experience has prepared me to be a voice for all residents of the for homeowners and renters and those without homes seniors and students small business owners and workers. Cyclist and yes even drivers. I want to share with you the values that led me to see if this appointment on my face for addition. We talked about the idea of tikkun Olam repair in the world, and we are taught that it may not be your responsibility to finish the work you're not free to desist from it either. And so when I spend time with people experiencing homelessness, and when I hear the stories of my friends were struggling to pay rent or get buy or when I see the precarious state of our planet, or see how systemic racism is preventing people from realizing their full potential. I feel really call to step up and do my part to secure a better and more just world. I want to thank you for this opportunity to thank all the other applicants for their willingness to step up and I thank everybody in this room who's doing their part to repair the world. Thank you. Derby decor Hello, my name is Darby do, and I want to thank everybody who made this meeting tonight success. It's going to be I know I've lived in District for for 25 years 5 years in Eastlake and 20 years in Wedgewood. I'm a mom dog attachment about governance social equity and bringing our district and City forward. I have work for the city of Seattle for over 17 years and I loved my time and said the government this work included 10 years and land-use and 11 years navigating the city budget process. I support MHL affordable housing Transit. Excuse me, and maintaining balance in our neighborhoods as the city grows. I also remain steadfast to my commitment to Racin social justice. I'm a formal public defender. I was an environmental citizen suit activist. I taught institutional racism to a number of different audiences. I participated on the state task force for racing the criminal justice system. And in 2012 won the race in social justice excellence in management award from my City piers and later your support for the city attorney's pre-filing diversion program. I heard a number of things coming out of the community meeting about what you're looking for in District for residents businesses and others are looking for someone who can provide open transparent responsive and meaningful representation on the short-term and long-term issues facing our district in our city. They're looking for someone to collaborate with community and the district candidates on the budget priorities. They're looking to fix sound transit's flawed Street. Plans for Brooklyn Avenue Northeast to provide a bus real connection that is easy and safe and move forward on key land use committee items while protecting our most vulnerable residents and businesses in the University District. I am committed to these activities and all other Council city council assignments. I'm here to work with you collaboratively and I support you as much as I can. I'm here to learn from you build on our relationships and get things done. We have worked on a lot of important things together. Mha affordable housing up zones JK Swift for the Salem Police Department completing the sr-99 contracts with wash. Passing clean up your act and funding children's literacy attribute our success to working together as a team. And because we don't shy away from Harding debate. I'm going to bring the work ethic and the collaboration skills needed during this transition. To support you the district and the city as a whole also equally important have the city hall budget and land-use experience needed for this temporary position. I promised to hit the ground running and keep running until November 26th and Beyond. Thank you. Thank you. Catherine Gardot Hi. Thanks so much to everybody who's here. And also thank you to the council members for being here tonight. My name is Katherine Gardot. I have lived in the district for more than 30 years. I shop and Recreation in the district. I come to my Pioneer Square where I work and then I obviously visit plenty of the other parts of the city to but district for is my home. I am a registered professional civil engineer and I have a master's degree from the University of Washington. And I think would text me to part is that I'm a very curious person. I love to ask questions. I love to figure things out my love to find final Solutions consider myself a problem solver. I'm a data-driven decision maker. So I'm a deliberate decision maker not just a decision maker. That just makes something decisions on the Fly. I have more than 30 years of land use experience. Zoning and Engineering experience in various cities in and County several counties in the Puget Sound region. One of my previous positions was working for a law firm here in downtown Seattle. I worked there for five years earlier in my career and I was involved in very significant land use policy decisions on projects that we worked on land use projects in East King County and the City of Snoqualmie. I recently worked on a development project in South Seattle to support various housing affordability concerns and levels and to create an East African women's cooperative and just because of the financing of it. It didn't come together, but I learned a lot through that process and also perhaps how to make some improvements to that help those types of projects go forward in my neighborhood. I survived the burke-gilman public Development Authority board. I've served on PCC Community Markets Ford and ringed PCC Farmland trust in been part of the Washington State Public Works board all involved in budgets. I've been schooled by The People's Institute on undoing institutionalized racism. I've lobbied in DC to maintain the federal estate tax and support the current work being done in the legislature capital gains tax. So I have many other Price of values that that are important in the city and I think I have two children both adopted from South Korea. They're amazing young people and let me tell you when you have kids. They keep your honest and especially around issues on thinking about race and all that stuff there either. Do you think they are on me on that? So I hope that you'll make the best choice for the being on the council and looking forward to working with all you and I'm looking forward to receiving. Thanks so much. Thank you David Goldberg. Good evening. Thank you for this opportunity and thanks for your hard work on behalf of Seattle. I grew up in Macon Georgia a poor kid attending majority-black schools. My brother and I were supported by a single mom. I vividly remember one awful day when I was called to the front of the class to collect my free lunch ticket as I approached the deaf The Rubberband to cut my shoe together broke. I tripped the whole class burst into laughter. I did my best to turn that humiliation into motivation to do well enough to get out of that town senior year. I scrape together $50 to apply early decision to Dartmouth College Place. I'd heard about from a friend's father to my shock I got in and I got out of town. This is not a self-made Man story advantage of some of my friends did not have I had the privilege that comes of being a white male and I had a lot of help I survived was able to pay for school because my fellow Americans invested in me through multiple government program food stamps free and reduced lunch. My deceased father's veterans benefits kept us from being homeless federal college grants subsidized loans in Moore. I'm attracted this opportunity because I believe good Government policies can help ensure the people survive and have the chance to thrive. They can make cities more livable just and Equitable as they grow. As a national advocate in the early 2000s a coin the term complete streets and I advocated for it as a measure of justice for people who've been forced to live around busy dangerous roads. I was driven by and I hope to get national attention for stories like Raquel Nelson's Raquel was a single African-American mom when they was returning home by bus for their kids from a shopping trip the bus put them off at a stop Cross by busy Lanes from their apartment in some adults raced across the road during the break-in traffic her four-year-old followed a driver hit and killed him Raquel was later convicted of manslaughter for failing to prevent the tragedy only National outrage got the conviction overturned but the guilty parties who created that lethal situation would never brought to Justice. I believe Vision zero is part of delivering that Justice and I'm proud Seattle and signed on. I surely stores because I think my motivations are at least as important as my qualifications. I do have the technical qualifications of expertise and long and long experience in planning land use and transportation to make myself useful on Rock Johnson's former committees. I've served on to planning commission's and the zoning board the 20 review board an earlier Life as a journalist covering Urban issues. I learned to read a budget of City budget attract local Politics as an editorial writer. I had to be a quick study and go deep on city government issues as a national advocate for Equitable growth and transportation. I advised cities on Innovative policies these days I focus on Local transportation having served on The Pedestrian Advisory Board and that was for cheer for Seattle neighborhood Greenways by strongest skills are people skills and the capacity to work collaboratively as the state's first Ombudsman for a transportation Mega project. I use those strengths as I work with people have different views to find a way forward together on the on the Planning Commission. I put many hours into helping to write neighborhoods for all I hope it helps start a discussion about how to get more people more housing options in War of the city while keeping the character. Of this neighborhoods that we enjoy Seattle to serve and I promise to represent. Everyone is fairly as I possibly can in District for thank you. Thank you. Jordan Goldberg Hi, my name is Jordan goldwire and I would like to begin by thanking all of you for your service to the city especially during this time. When our Civic discourse is turning angry and raw and also for your commitment to a transparent process for filling the sea. You've all had a chance to review my application materials and learn about my background and qualifications. I like to use my time today to outline some of the priorities that I would have if I were to join you as a colleague for the next 7 months. As we look ahead to the short appointment that will culminate with budget season. We must see our budget as the moral document that it is and it's important to ask what kind of city do we want to be in the years ahead during this time of widening inequality. Do we want to be a city that privileges some residents or do we want to be a city that works for all residents? I believe there is only one moral answer to this question. Well, I strongly support Transit education climate Justice and a variety of other issues. I want to focus here on the issue that is truly creating a moral crisis for our city housing affordability and homelessness. In addressing affordability. I look forward to helping push the atu.edu legislation across the Finish Line working to adopt Auntie displacement legislation that Center is racial equity and also exploring options to fund methods of increasing affordable housing like Community Land Trust. For the related crisis of homelessness. We are now at a point where we have reliable data about what is working in our response and we know that we need additional investment and things like program coordination enhance shelters permanent Supportive Housing and engaging people experiencing homelessness in helping to find additional Solutions. Given the intersections between homelessness addiction and mental health. It's also critical that we expand the hugely successful lead program and work to open a safe injection site despite the many obstacles that will entail as an immigrant's and as a gay man. I have seen firsthand how Community suffer when we don't stand up for each other and I have learned how various struggles for justice are all interconnected. I see it as a moral imperative to work as an ally and co-conspirator to support all vulnerable communities in my work. I have aimed to amplify the power and sensor the voices of Youth immigrants American Muslims Palestinians and other communities I would bring the same approach the council and work to support those in our city struggling to secure the basic right of housing. I've seen how powerful we can be when we come together to listen learn and act in our common interests. I'm proud of the work that city council has done to make our city a model for Progressive legislation, and I would be honored to join you and continuing that work. Thank you. Thank you. Sheree miselis I apologize if I didn't pronounce it correctly. Trailer sales, but that works too in true Millennial fashion. Albireo my phone also I ran out of printer ink, so this is actually daunting and terrifying to be I want to talk about why I'm here I am here is because the members of my community asked me to be people that want to be at the table that don't feel like they have the right to be there. The other voices have not been heard before and it might not be her going forward or the reason that I have come up here because of Saw strippers are workers and the dozens of erotic service providers that were brave enough to organize an advocate for themselves under threat of losing their income and facing the locations for being open about their experience in further stigmatized. HB 1756 just passed the Senate. I'm very proud of them and I'm proud of the work I did with them. And it will soon be a lot and proved the Highlight in the voice of the stakeholders while crafting legislation to govern them is vital. How am I here very important? There's only one answer perseverance. The inaccessibility of this process and all public policy process is needs to be addressed while I appreciate the focus on efficiency the 20-day deadline to fill up the vacancy is really daunting and does not allow for the majority of the community participate in meaningful way and further limits the most vulnerable stakeholders to applying for the position. I work multiple jobs to support myself and my advocacy work is fading in this process and pursuing this appointment has put my current employment risk. I'm determined to complete this process as best. I can to limited resources I have as is my moral imperative to persevere on behalf of the members of my communities that could not participate for themselves and have the courage me and believe in me and believe that I am individual that will best represent their interest. There seems to be a consensus among the elected officials in this room as well as the applicants applicants for this appointment that equity and justice for social minorities is Paramount in securing a better future for District 4 in the city of Seattle as a whole has a queer non-binary person of color and almost nine year renter and District 4 as well as someone who relies on Transit because I don't drive and not really accessible for me. Anyway, I have also experience homelessness State housing and employment security to overcome the trials and stigma of mental illness and I have been affected by the struggles and stigma of drug use throughout my community of you and my friends and family and my friends and people's harm reduction Alliance who struggle every single day to fight for those people. So I feel like I am uniquely qualified as a peer and Advocates facilitate communication between the city council in the community affected most by these pressing issues in our city and concentrated in the search for I am a stakeholder. Referencing your commitment to inclusivity with only will only Garner a finite amount of faith and trust in this governing body act upon it create space in a literal seat at the table for someone who represents the community you have pledged to advocate for I will strive to make Community involvement accessible especially in regard to land use planning to Fund Solutions for those experiencing homelessness or at risk of homelessness solutions that recognize the intersection of mental illness drug use homelessness race and gender Equity population density in District 4. I have a track record of using my skills resources in positions of power limited power to directly benefit my community. I've held space in my home for individuals who seek shelter detox and want to disband their issues and I would do the same in a position on this Council. Thank you. Thank you. Jay lazerowitz last words My name is Jay lazerowitz. The wife not politically involved. I have made him try to make a difference over the last four Decades of my life as an adult. I'm Guided by my mother's Civic commitments for service as a civil rights activist or running campaigns for Richard Hatcher first African American mayor of Gary, Indiana. I saw a close race issue string up. For the forever guided me and my understanding for race and social justice. I'm a visual artist and architect strong focus on Sustainable Building practices stewardship. I've been a 35 year residents of the Roosevelt neighborhood devoted my privilege into Civic volunteerism over the past 30 years locally including time on the Seattle Arts commission the light rail review panel go finding an Arts nonprofit focusing on artist affordability. I probably develop an artist studio building Ballard Works taking on the multi-faceted responsibilities to make this successful. The past 10 years have been directly involved with the Roosevelt neighborhood association for five years sharing the land-use panel. I've helped develop Community engagement workshops educational opportunities inviting people from surrounding communities to join us as well. Orlandi's Academy Events Center on planning and land use including the recent mha up zoning. I also got the neighborhood. Advocacy for deep affordability development the Roosevelt Light Rail site enlarging a number of community minded people involved in the process are partnering with Sound Transit introducing the well-regarded community principles that have died in the project proposals. You have a recently published case study, which is a guide to other groups for self-directed efforts important. We strive to consider the needs of the 30% That is the 0 to 30% of income earners as the city continues to grow. I see the seat as an opportunity to work with Council on important and multifaceted issues. I see a Confluence of affordable housing commercial displacement all of which need a balanced attention. Issues regarding future growth and also tree preservation and opportunities for education and urban forestry as well as some focus on middle of the missing middle housing exploring new ownership for affordability. I have a deep knowledge of detailed zoning and long-range planning and most importantly Community engagement. I welcome the opportunity to engage in the conversation center on homelessness understand stakeholder needs and helping to guide the regional oversight. I have the background to step right into planning land use sustainability transportation and devote the next seven months to be a collaborative partner on city council. Thank you. Thank you. Abel Pacheco Jr. Thank you counsel for allowing me to speak tonight. My name is Abel Pacheco. And I am seeking to be the representative for the District 4 on Seattle City council nearly a decade ago. I drove into District 4 with the things in my car as I sought to pursue my educational drained at the uw's Evans School of public policy and governance in the time since I've been able to serve my community and make an impact through my work at the Seattle Foundation leading community-based initiative to improve the lives of low-income families at the Seattle Police Foundation Building Community Partnerships for the very best work of policing that we never often hear about or read about And currently at the University of Washington's office of minority Affairs in diversity leading the legislative strategies for the Mesa program. The state's largest in pathway program for students of color young girls. I am proud of the work in a collaborative Spirit by which I bled it is. My family's Journey that has shaped me and crowded my values. My mother would always tell me your father to the man that made you it's Amanda raise you raise you and my dad is black man from Compton and my mom's a Mexican woman from Mexico City like somebody working parents both sacrificed so much to give me and my siblings the Austin the best they could and often times. It was not enough. I so remember waiting and food lines with my mom helping my mom vacuum and hotels always so that she can finish her shift early and a family of 6 living in a one-bedroom apartment. I still rent balance student loans and shipping out my parents. I know what it's like to work so hard yet feel like you yet you have so far to go. These experiences have shaped my desire to give back. I was taught that the Fulfillment in life comes from service to others and that we have a responsibility to look out for each other. So I volunteer my time with causes organizations that can engage in activities activate others in the community. I was on the founding young professionals group for Plymouth Housing group. And young United Way of King County's emergent leaders group. I've been able to serve district for a community land use issues with my service on the Hall of focus group and the Wallingford community council with my background in public policy at commitment to affordable housing and land-use experience Rudy and district for I can share the land use planning and zoning committee. I can step in his chair the sustainability and transportation committee with a unique perspective as a multi-modal Seattle light not owning a car and a member of the last generation that can do something about climate change. My mentor students of color through the uw's Husky leadership initiative and it Washington State opportunity scholarship the word for educational programs that I benefited from and try to be a voice rank of encouragement for young people in my district additionally as it has been documented. I have been the victim of a wrongful arrest and can be the bridge where are most difficult and nuanced issues in criminal justice to drive meaningful change an impact on the gender equity and Safe Community safe communities new Americans in education committee. I'm seeking the opportunity to represent the values of District 4 as I am the proud son of District 4 on the neighborhood that shape me Wedgewood, Wallingford and Ravenna. To the education institution that provided me with the tools and Pathway to success district for the people and institutions of District 4 had given me so much and provided me the opportunity to rise up in a decade since I first drove to Seattle. I realize that home isn't about location. It's about people and district for is my home. Thank you. Thank you. Marjorie press Call for me. Council members and hello district for residents. I'm Marge press and I'm pleased to have the opportunity to be with you tonight at the community Forum on Monday. I highlighted defining moments that have brought me here. Most of those moments were shaped by my choice to be a city planner creating livable and accessible communities for all and an upbringing focused on to Coon Alum making the world a better place to rest for Hap's is my good fortune moments include projects like Link light rail and SR 520 coming to life private foundations first 1 billion in Grants and scholarships investing in the Seattle small business. A my appointment to the Seattle Planning Commission by Twenty Years working and planning include multiple dozens of projects here in Seattle and across the u.s. All these projects involve working with communities public agencies in elected officials as a planner. My job is always to be open and transparent and provide the best planning solution possible at the Seattle planning commissioner. I participate in the major update of the compline Seattle 2035 multiple annual comp plan Amendment Cycles land use and transportation committee and presented the commission Commission on the light rail review panel, my social justice and Equity work or a long-term commitment. Social Equity is a defining issue of our time and a long-term investment. As a board member of American Planning Association, I'm proud to say we recently adopted a social Equity policy guide that will insure a cheating equable and inclusive communities. I'm mindful of this commitment everyday. My experience with volunteer boards and as a project manager includes the development of plans and budgets and an understanding of the fiduciary responsibility and stewardship of budget oversight currently is your oversight of a 21 and 1/2 million dollar budget my work in volunteer experiences, which often requires working with the Virgin perspectives and goals will allow me to work with the council district for residents to stay the course. It also recognized that sometimes it's important to change direction do the new information changing needs or other factors. If a point to the district for caretaker, I'll bring my experience has hard work commitment and passion to bear. I believe I possess the skills and experiences. The council is seeking and I share your goal to make Seattle a wonderful place for everyone to live work and play it would be an absolute honor and a privilege to be the district for caretaker. Thank you for your time. Thank you. Maritza Rivera Hi, I'm Maritza Rivera. Thank you for the opportunity to speak with you today. I'm speaking the interim appointment on the city council because I believe that the decisions we make over the next 6 months will have a lasting impact in ensuring Seattle Remains the city for everyone. I'm a mother of two girls and a daughter of Puerto Rican parents who moved to the mainland and search of a better life. I grew up in the inner city and are low income neighborhood, or I saw people working hard every day to raise their families and get a piece of the American dream. My dad was a hard-working welder in a factory and a member of the local carpenter's union work not for the union. My parents would not have been able to enjoy a retirement later in life. My parents worked hard so that my brother and I could have opportunities. They didn't one of the proudest moments for my dad was to get to see me walk across the stage at my Law School graduation. Unfortunately, not everyone is getting to Sharon this American Dream Seattle is currently A Tale of Two Cities are growing. Well where we will we see growing Prosperity from many but too many people are being left behind. I will be a voice for building more affordable housing expanding short-term housing and services to those experiencing homelessness expanding Transit and keeping our neighborhood safe and our parts opening themes for families to enjoy as chair of the planning and zoning committee committee. The party ends from representative must be to ensure that Seattle's land use policies help families Thrive and robust ever-growing neighborhoods. As someone who grew up in an apartment in his currently resides in the single-family home. I know from experience that families can do well in all kinds of housing situation. I strongly support building more affordable housing across Seattle because that's the best way for us to address our affordability crisis. Those would be the values. I would bring to the committee. I've spent my career listening to diverse communities and building coalitions from my time working at the White House where I work to ensure the president's policies were informed by the needs of the Latino Community to work here in Seattle with councilmember Tom Rasmussen and at the county to highlight the needs of our most vulnerable populations in each of these positions. I use my personal experience and independent voice to help create positive change for people in my community. Finally as the Trump rhetoric becomes more Reckless and dangerous. I'll be a strong candidate for making everyone feel welcome in Seattle. Just as I did working for the ACLU right after September 11th, helping to protect the constitutional rights of Seattle's Muslim American Community. If appointed I commit to working collaboratively with you to move forward on our shared Progressive value. Thank you. Thank you. In our last applicant is Luke Akron wigren. Close in a ballpark. Okay. Thank you. Hello, my name is well. Thank you for Syfy. Hello, my name is Luke and I am a musician and filmmaker assistant High School swim coach and Decatur at the Seattle Aquarium as well. As soon as we substitute teacher in the Renton School District. See where I grew up. And in the words that end in double words of my favorite hip-hop group. We are all alive from occupied Guam a territory of the Blue Scholars. I think we should remember that for the past week since this process began is when what been one burning reason that I've been coming and that I submit an application that I've been coming to these things and that's affordable housing and to distill what I said on Monday at having studied the the damage that unchecked in equality can have on a society. I know and I see hear the and seeing that in a quality here in our access to housing. I know that there is much damage being done. It's very evident in the city. I believe that it is vital that we said about to getting a hundred thousand units of affordable housing that are City runs City managed and that we had filled those things so that we have them for the future. I did not know I would be speaking tonight. So I came back and I asked myself more questions about why I'm here and I think the number one reason obviously like all applicants everyone in this room. I would I would venture to Guess that I care for the city we care for the city care for the people here. I care for the region and I care to know about the history here. What I think is important to remember is that there's a fighting spirit in this town and I believe it it's that you know saved many of the things that we hold dearest and it attracts people here whether it's the labor rights that we fight for tracing back to from the general strike of 1919 to the fight for fifteen that some of you had a hand in passing. Or the the name Seattle and the symbol in the bottom of the screen as these things probably would not have come about if the coastal Salish people are not fighting for recognition as they still are also Jimi Hendrix and Bruce Lee and African American and the Chinese American whowhatwear unapologetically themselves and in a society at that point and I mean, I guess I still believe it is but at that point viciously segregated so much. So in that city of ninety 95% white miss the entire populations of minorities were confined in 5 square miles and I'm glad that we decide to return those things. We need to do more I have much more to say unfortunately. I can't say it right now. There's a lot of greed and self-interest. I feel that this process unfortunately is is indicative that with some of the Maneuvers that have been going on in the city and past. Thank you. So that concludes that 3 minute presentations and I want to take all of you for 11 outstanding presentations. And again just to remind you in the public. We are actually complying with our Charter which is not an ordinance, but it's actually rooted in our Charter. This process said that at this time I'm going to ask the council applicants to move to the committee table and take any seat you like. And once you get situated, I'll explain some Logistics from there. Okay, and if the clerk or Stafford be so kind as to bring a chair to the head of the table, we will collect Lee refer to that as the hot seat and way this will work is you'll have that we're going to just start a ad-lib this part and the council will ask you questions. I'm going to literally I asked the clerk to pull the name out of a hat. So we'll just go through a random order. And then what we're asking that you do is take the hot seat as are referred to it. That way you could talk to the office and talk to the Council on your responses. The 7 minutes will just be your answers. It will not be our questions until a little word of advice if you want to shorten your aunt's a little bit you probably get more questions because one question takes 7 minutes and then you just responded to one question. So I learned that the hard way by the way, so so unless there's any other instructive instructions that need to be given out we're going to move forward so the clerk will pull it and she will read your name. If your name just go to the hot seat. Marjorie press you drew the Short Straw. And customers I'll just recognize you as you would like to proceed and enes Kanter prepare their questions and you get situated Marjorie. Is it okay to ask questions? I mean I try to inform Eliza little bit. My goal is just make sure I went has an opportunity to explain their questions. And so I am not going to be so strict is in in how we perceive. I really do want to sort of enjoy the process that we can communicate. So council members who would like to ask our first applicant some questions and Thank you president what's your title? Long as I don't screw up today, I'll be whatever you to call me. Whenever you want. Some chili for others is as follows. The city of Seattle is is currently operating in compliance with the 2012 consent decree for the Seattle police department since then we have worked diligently to implement reforms that both lower uses a force on community members eliminate bias policing and build Bridges between officers and members of the community these reforms have resulted in an 84% reduction in use-of-force divide still exists between Patrol officers and community and there is still a disproportionate number of people of color experiencing use-of-force at the hands of Seattle Police Department officers. What steps would you take to create stronger connections between the residents and businesses of District 4 and the officers serving in the North Precinct. Thank you for the question as a planner. My go-to place is to gather data to talk to the community to talk to the police officer find out how these arrests are occurring where they're occurring why they're occurring. It's for me. It's all about communication and understanding the information from the neighborhoods and the folks being affected by the disproportionate amount of arrests as well as getting the police perspective and trying to find a way to mitigate what's happening. It's encouraging that there is a 84% decline in in this type of activity. That's not 100% But for me, the first thing I would do would gather data review the day to make sure I Understand what's happening and then ask the right questions speak with the right people and come up with a collaborative solution. Q Cuz my back show. Thank you very much for being a an applicant here and for your concern for the city. So my question is around more housing affordable housing and we know from three studies that have been conducted over the last year the McKenzie study the Eco Northwest study and then the work that Claudia Claudia Balducci's committee did at the county that hundred at least a hundred thousand units. That's what we are going to need to build and Claudius study suggested that we do that over the next 20 years. So in your mind, what kind of Revenue sources might be available, what would you do and how would you bring the community together and a Tri-County way to see what we can accomplish quickly? Okay about the logs by the way, so just something housing. I know that there's been a lot underway. Mha and the upcoming implementation. I would want to see how that would play out as far as a Multi County or Regional approach that would require some fair share discussions and commitment from all involved as far as financing. I would have to do some more research on that. Not of a finance person. But again, this all has to do with Gathering data figuring out how to make the the tools that we have work. I'm excited to see how mha will work when it's implemented and what other things we can do like a dude a do and other jurisdictions for what they've done. I'm in the Columbus Ohio a far smaller city has done some fantastic things around affordable housing. So that's what I would do. Thank you. Cuz remember consalus I was pointing to council member. She's playing that with counselor mosquito. Would you like to have a question? You don't have a few filibuster questions. If no one has always had to follow what I'm hearing from you is identifying a set number of policies related to affordable housing, but I'm not hearing a direct response to customer bagshaw's question, which was more about revenue and I think for me the fundamental question that I have for you is whether you believe that the city has enough Revenue existing Revenue to address the scale of the affordable housing problem or whether you believe that there are additional Revenue sources that are needed to meet the scale of the affordable housing problem and You believe that there is additional Revenue required to meet the scale of the affordable housing needs of our community. What Revenue sources do you have in mind that you might support or not support during the upcoming budget? Building 100,000 units over the next 20 years will require a good bit of money. I would have to take a look at the budget as it exists to see what we have in place. And go from there at As a caretaker for the district. I would do my dead level best to to make sure that the budget we adopt covers moving forward in the in the housing Arena. I don't know enough about Revenue financing to identify a particular program that said I would learn it right quick. Should I be the caretaker? Thank you can swim or brand each other? In your comments you talked about a commitment to a race and social justice and also about your background as a city planner. I'm curious as chair the land use committee what type of other ways that you can use land use zoning planning tools to address racial disparities in our city. Yes, I think we are our history of of redlining. Is is a staying on on who we are but yes, we can look at. Even the options and and and in urban Villages and allowing more people to Access housing. There are lots of tools we can use and Zoning in amending the future land use map amending the zoning code and using tools and allowing a doodad doing other things to increase access for more people. very good Are there any additional questions from for Miss Marjorie press? We good. Well, I'll ask I'll ask another question will also be a member of my committee the gender Equity safe communities new Americans and education committee which has oversight of as indicated by the title of Denver Equity, but also issues related to Public Safety Police Department Seattle Fire Department office of emergency management Etc issues related to immigrants and refugees and of course education policy related issues. So what aspects of the at work on my committee most interest you and what would you want to work on if you were selected and ended up serving on my committee? I've spent a good many years working on equity and social justice challenges so I would have a an interest in working on that on your Committee of Public Safety immigrants and refugees and and writing access to programs and finding ways to to level the playing field and and Make things accessible here. Downey specific examples of Any of what you just said? Any any specific examples of programs or services that you believe would make our city more Equitable and accessible to women children immigrants refugees Etc. I think our Housing Programs could be more accessible. I think Public Safety and related to your previous question about a police intervention would be an important issue to to tackle access for for immigrant immigrants and refugees to the services. We provide. That's where I'd start. customer back shots Thank you again for the work. You've been doing with our Planning Commission. Can you talk a little bit about our bicycle Network and safety for pedestrians as well? We have a new Third Avenue vision and I'm sure you've been involved in that are engaged and maybe you could talk a little bit about your experience and how we can move forward and encourage s. To have that bicycle network-connected downtown. Bicycles are an important alternative mode Transportation. They give folks an opportunity to get out of their cars a connected and and seamless network is important to to those who commute by bike. The safety of those routes is important in terms of interaction with cars buses pedestrians having been on the planning commission's land use and transportation committee. I've worked with s. On similar issues. So Talking with them about how to implement a safer bike routes and the bike plan would be my first step in. implementing safer routes very good. I think we have exhausted our questions for you and great job. I'm going to tell you a great job when you're finished. So those are my last drink or think I'm playing favorites your thank you very much. Okay, so we're going to pull the next. Name out of the hat and circle reading that person. Please take the hot seat again. It's Katherine gardo. No. Okay, who would like to start off as Moscato few questions? Cover Masala chicken need my gold. You're my go-to person during I can tell that now so I'm so excited. Okay. All right. So I think I I want to continue I'm hearing from these candidates these applicants their positions on the issues related to affordable housing. I think that's a really important issue for us as a city. And so I'd like to frame up the symbol same question that I framed up form is process, which is do you believe that we have enough Revenue currently to address the affordable housing needs for members of our community. And if not, what are the revenue sources that you believe would be appropriate to to address the need of additional affordable housing construction and development within our community. So perhaps I can pick apart the question a little bit to understand it a little bit better. I know that there was a proposal and the spring or last fall. I can't remember exactly when forehead attacks and that was the intent to use that for affordable housing and I don't know exactly how that money was going to be used. Is there a plan that the city is prepared on what they would like to do specifically with affordable housing cuz I know that we have planning and land use pieces that you know, what is the Adu and the dad do legislation that are out there to bring in more affordable or potentially help with you fordable housing project problem, but I'm a little bit. I'd like a little more information on what you're thinking. I'd like more information on what you're thinking by which is why I asked the question. Well, I I don't know if there's another source of funding that has been part of one of the things that has happened over the last I guess about 10 years. We've had a pretty amazing. Of growth in our city and a lot of sales tax revenue. I have not studied the budget so I'm not totally clear on where the money is going. We may be coming a. Of time where we will not have as much sales tax revenue just because I know what I saw in the newspaper that Amazon is not hiring as quickly as for example, so they may not be needing as much space. I am a person who believes in progressive taxation. I'm not sure I had text is the way to go. I'm kind of excited with the legislature is doing down at Olympia right now. You're very much customers who want? I might just follow up on that question and I would agree with that. American dollars. I would like to hear what you're thinking. So you said you just said that you believed in progressive taxation. So you must be aware that Washington State and Seattle with in Washington state has the most regressive tax system in the entire nation and also in terms of what Revenue sources that should be for affordable housing. You must also be aware. And if not, I wanted to mention it is the the the way the politics in the state legislature has have gone the state legislature has strangulated most of the abilities of municipalities that you would typically think we should be available for progressive taxation. And there really isn't much of ailable and the so-called Heretics, which I prefer to call the Amazon tax because I want to buy the tax on big business and not on workers regardless that our movement proposed that. There isn't much else available in terms of legal avenues for progressive taxation of the sea level. So knowing all of that and setting aside a meeting with the city council did or didn't do last year. What is your own view on what does Alicia do given that there is an unprecedented crisis of homelessness and the lack of affordable housing and that we don't need any more studies. We already know we need at least a hundred thousand affordable homes. We know the for-profit market is not building it because you know construct construction boom, but affordable, it has only been reduced. So given all of this would you as a city council member in. Doesn't matter what actually happens the next several months. Would you propose would you support a tax like the Amazon box? Because that is one of the only few progressive rummy options available and because we have an unprecedented crisis Do to build social housing that is to build publicly owned affordable housing. I think it's a conversation that the city has to have if we choose to build more affordable housing with public dollars. I think if that's what the city would like to do that we need to participate in that I do know that we do have other ways to do things to such as the accessory dwelling units have spoken with fellow colleagues about how those units can be built for Dudley in existing homes and be available for people to to rent and I think that's an excellent solution to provide warehousing. I think I'm something such as a head tax or something like that. I think it's really important to have conversations with business and conversations with people in the community. I know that the issue was quite contentious when it came up in part. Cuz it hit smaller businesses hits such as you watch Amaya down in the in the International District. So whenever there whenever there's conversations about taxes, it's very important to have make sure you have the opportunity to talk with folks about it. Thank you for that counts member Bagshaw in your resume to us and said that you were very interested in using the assets of that Park and one of the things you connected was how we were going to use that to address homelessness and I believe they were you were focused on the community center. Can you talk a little bit more about what you thinking that I was listening to council member consalus talk about the immigrants and education. I realized that Magnuson park has a great Community there with a variety of levels of housing. Also the the public Development Authority that I'm on the board of it for Gilman also has a variety of levels of housing a different affordability levels, and I and I know there's also a lot of problems in that are not a lot of problems there have been some Problems in Magnuson park, I think the bean the district council person for that just hurt too important to go into that neighborhood and meet with those residents and learn what their needs are and ask what is important to them. I know there's some new housing coming on board pretty soon with Mercy Housing. I think it's important that the council member of talk less and listen more and figure out what is best for that community. Cast member Brian Catherine your background has some experience in Food Systems. And one of the things that we have one of the many disparities in our city has access to healthy food some neighborhoods like the neighborhood. I live in in Fremont. I have multiple options to walk to to get all sorts of food and other neighborhoods folks we struggle. I'm curious. If you get a pointed in your land use chair. Are there any sort of land use policies you could think of that might help improve access to food or any other expertise around the food systems that you could bring to the council. Wow, we all like good food. That's for sure. And yes, it is not easily accessible in some neighborhoods. I believe in that where the district for its relatively accessible, but in other parts of the Cities, it's not as accessible. And I would need to probably visit those other districts to learn and talk with folks about I know the snap program for example provides vouchers to use it farmers markets, which is an excellent program. I know it was the king Conservation District has done work with communities on expanding those programs and perhaps his finding new communities where those that was vouchers could be used, but they aren't being used right now. cast member store just giving I've asked a question that so one of the really important functions of a district council member is considering services and given that this is a caretaker position you would if selected would not be a person who would be running for re-election or running for election for this. I'd like to hear a little bit about your commitment to consider when Services given and responding to to the constituents of District 4 given the fact that there May not be the the same incentive for you to do. So as somebody who has to run for election. Absolutely. I think it's really important to to meet the neighbors meet the fellow people who live in the district. I would I would commit to attending the different neighborhood Council district meetings and I would also commit to establishing office hours in the district. I think it's really important to listen and learn what people are concerned about and I'll bring it back to the this full body. It's just it's just so critical. You can't live in a vacuum and not pay attention. I actually people have started giving me a list of things. They'd like to see done already. It's very much. Cast members want little follow-up thank-you. I just I just wanted to follow-up from the previous set of questions that it came up come up with a previous Canada also about Revenue sources for building affordable housing and also fully funding homeless Services. I want to bring this up because I also you know, it would be good for other candidates to also waiting on this. So you said that the attacks as you call it Amazon texted as I call it was going to hit small businesses and it was contentious because a business wasn't invited David. I just wanted to make sure we all know what we're talking about at that time. There was a whole process setup to have business way and we had a progressive Revenue task force and there were months at least a month and a half if not longer for business to win and also it's not accurate to say that Small businesses were affected actually a berry a conscious effort was made not to affect small businesses or the tax was going to be in the gym. I mean only businesses only the top 3% of businesses were going to be liable for a mathematically speaking the bottom lights 97% of businesses were not going to have to pay for it and also taking into account the fact that ordinary working people are paying way too much in terms of sales taxes and even middle-class home owners are paying way too much in terms of property taxes. So taking all this into account. What is your view of all this and also all the other points been brought up earlier about the limited options that we have a progressive taking all this into account. What is your viewpoint on what the city should do should should should should or should not try to move forward on a tax on big business like the Amazon jax2 address the absolutely stunning crisis around us. So I want to make sure to let you know that I do know that the average poor person pays 18% of their income in taxes while the average wealthy person pays 3% and it is definitely an equity issue. So I do know this issue and I do follow this issue. I also know that as a taxpayer and whether you are a taxpayer business or a homeowner that there needs to be a plan and what I would like to see the city do is develop a plan for what they would do with the money if they had the money come in. So I totally support the needing a hundred thousand units of affordable housing, but how would that what would be done to implement that plan? I think it's very important to know that ahead of time. Starting to develop tax plans and you do both of them in concert. Very good. Thank you very much. Okay, I think we're good. I'm good. I'm going to use your last 21 seconds up. So I'm going to ask you what do you know about District to convince me? You're going to be good for district 2 District 2 is you'd be a good person for a district to we all care about our city at large 2-week operate out of our district. I am District to UPS. Just joking tried to put together a project to build some a 30 unit apartment building with affordable units and market rate units and put it together and with I Cooperative on the main floor for East African women and we couldn't make it pencil and it's in part because I have to find the name of the the what-is-it the multi-family I can tell me a tea when you have smaller projects. It just doesn't pencil. Thank you very much for your participation. Okay? You're welcome. All right. Maritza Rivera fighting Okay, once you're situated who would like to ask the first question? President so miss you, but I want one of the things that is notable about about you is that you actually currently work at the mayor's office and I think it's important for us to acknowledge that the Seattle City council is an independent branch of government in the city government and that part of our job and important part of our job is oversight of the executive branch and and that includes often times as in asking a bold questions and tough questions to make sure that there is accountability to the priorities that this city council has established the our legislative and budget appropriation Authority. I'd like for you to talk about how this district and the city council can Anticipate your governance style in terms of your independence from the Executive Branch if you are appointed to this position. Thank you for the question. I do work for the mayor's office and I'm proud of the work that I've accomplished there every job that I've had I give a hundred and 10% and I would do the same if I were given the opportunity to join you on the council for these few months to finish out the seat. I am my own person and I would work collaboratively with you all and I have Clarity that my allegiance would be to the constituents of my district and just like I worked for President Clinton and I you know was had my allegiance to him at the time when then I want on to work at the US Hispanic chamber of commerce. I had to work with the bush White House, and I represented my organization. Fully without any conflicts so wherever I work, that's who my allegiances too. And I would do that work 110% like I've always done. Councilmember herbalism follow up key to the question about independence really is whether or not if you were selected for this position whether not you would have a job waiting for you back in the mayor's office after the light to not have a job waiting for me. So if if you were selected you would leave your employment in the mayor's office, correct? Thank you. Very good customer. Mascara. Good evening. I haven't had a chance to say thank you all for applying yet. So before I ask my question, I just want to say thank you to the folks who've already spoke in and of the people for coming. This is not easy having just run over election not too long ago. I know that that's hard. This is going to be extremely difficult. So thank you all for your willingness to do this tonight. I did want to ask a question as specific to district for you know, we talked a lot already about mandatory housing affordability. I had the chance to see the entire. What was it 4 hours of your participation on Monday night and really impressed by the questions of the community members in organizations ass, I heard your comments around mandatory housing affordability already and we all know that this was a unanimous issue that the city council took up in six separate packages of legislation over the course of two years including up zones for over 30 Urban centers in villages across Seattle yet. We also know that this is the tip of the iceberg we call it Citywide and that was only six Percent of the actual land that is still on needs to be in my opinion rezone for residential use. So one of the key issues that's in your District that we have the chance to potentially follow up on is implementation of mandatory housing affordability in the ad in the University of District. We are set to consider a separate piece of legislation this summer. So my question for you is would you support the rezone for mha implementation on the Ave as a district 4 council member? Well first I'd have to say that I'd have to do some Outreach in my community and be very clear about what the community and the residence of the Ave and the rest of district for feels about of zoning in the U District. I think generally speaking we are in a housing crisis and we need to explore all options for addressing this housing crisis. And so ABS owning a in the app is an option that we need to seriously look at but again, we also need to work with our neighborhoods to see what what their feelings are and you know how we can move forward. Pretty good. colleagues customer brought the same question about your experience over District 2 or you can only with it and why would you be asking a question? It's just because we just shipped it to a district set up a few years ago as you well all well. No, but I think a good counselor continues to think about the entire city and you making decisions affect the type of the entire cities. That's why I'm asking just about your your your familiarity with another part of town affected. The part of town has the lowest median income some of the Lord's graduation rates, but this recipe improving now great opportunity, but some of the historical challenges based on historical practices of the city, so can you tell me a little bit about your familiarity of District to do you know, any organizations involved with any volunteer groups? all of the above I have not been involved with volunteer groups and District 2, but I am all too familiar with a lack of access issues and race and Equity issues. And and I agree that while this would be a position for District 4. We have a responsibility to the city to work together on the issues that are faced by the entire city and not just our district. So I would work collaboratively with you on the issues that are important to your constituency. I'm in on disparity issues and the affordable lady issues in your District to see what how we can make improvements to your District into the city in general because we should all Thrive together as a city. Cast member special at King County in the health and human services department. Would you talk a little bit more about your experience there and you were focused on funding gaps at King County. Can you just talk a little bit about that experience and how you could carry that over here. I worked on a special project that can County exec executive run since I was looking at Ewing a ballot measure to fund a human services and so he put together a task force it consisted of elected officials and stakeholders in the community and we project manage that task force. And so we took a year to look at possible. how we would if we were going to bring a levy forward how what we what human services we would find there was a challenge actually because Veterans Services also needed funding and that was not seen as part of that particular Levi package the interesting part 2 subsequently now, we have a veteran and Human Services Levy still they've merged but at the time there was this question and so I worked with those stakeholders and with those elected officials to put together the the plan unfortunately the King County council at the time decided to bring forward to Veterans Levy and so we were not able to bring forward the Human Services Levy that we had intended to bring but I have extensive background and Outreach and I used my Outreach skills in that capacity as well to work with the elected officials and with the Kennedy stakeholders to come together and come to some agreement on the plan that we were going to put forward. If we if we indeed had been able to to put a levy together and those same community building and collaborative Health collaborative skills. I would bring to this position. Thank you a couple weeks ago. The mayor's office in Seattle Department of Transportation released a draft bicycle master plan implementation plan. There was not with General disappointment amongst the transportation after c community especially coming on the heels of a decision by the mayor to back away from protected bike lane on 35th Avenue Northeast. If you're familiar with that implementation, that plan is currently out for public comment. So the rest of this month and then there's an opportunity revise that I'm curious if you're familiar with that plan. Just your thoughts on it. And if you're not familiar with imitation plan lady, can you speak more broadly to your thoughts about the role of bicycles as a transportation mode in the city? So I'm not familiar with the specifics of the plan. I have her I know about the plan in general. I support Transportation options, including bicycles and more buses and the expansion of Light Rail in the city. And I think we we need to work towards looking for more options to get people out of cars and taking public transportation in the city including bicycle. So, I think we need to be really thoughtful about our transportation Master plans and making sure that we really are looking at all the options and supporting the transportation options that are residents want to to move forward with including my bicycling. We need to be supportive of those things. Thank you cancel a memorable. Thank you. You have experience working on civil liberties Union civil liberties issues as a former employee of the ACLU you work specifically on strategies to protect the civil liberties of at-risk immigrant communities post 911 as the chair of the council committee with oversight of civil rights issues. I'd be really interested to hear from you what other important emerging issues you think that the city of Seattle should be focusing on related to civil rights that perhaps we we are I would say not that you're not tending to it, but I just to highlight the importance of in the housing realm the issues related to racial inequity it really I think of all the issues when I think of race and social justice, it's the one that really to me is the one that we really need to tackle. I hate to say first and foremost cuz they're all important issues. But everyone has the right to a home and our communities of color desperately impacted when it comes to housing affordability. And so I think that that is one issue that we really need to address. I know you have been but to continue to address and see what we can do to improve. We just bought exhausted our 7 Minutes of time. I don't think you could get an answer out in 8 seconds. So thank you very much going to move to an ex applicant. Sheree lascelles Okay, nice and situated there which one of my colleagues would like to ask the first question who still sells? Gonzalez I'm the one that's the most shy on the city council. So me to okay, great some of the earlier candidates, which is do you believe that the city has enough Revenue at its disposal to address the scale of the needs for additional affordable housing in our community and Industry for included and if not, what are some additional Revenue sources that the city should be evaluating or other strategies that the city should be evaluating in order to increase the Development and Construction of affordable housing. All ready for a hundred thousand units. No, I don't think we currently have it but first starts we can stop at the sweeps stop with what money is being put into that and redirected immediately into solutions for housing and I say let's try again for the Amazon tax. I was there the day that it had I simply passed got to go to the Vermilion for the after-party and was excited that something was going to be done about big business pushing people out of the city and not being accountable for the changes. They've made I look forward to it actually going through the next time we try and I hope you part of that. Councilmember Bagshaw the first couple of sentences of your letter to as you talk about being an accomplished business developer. I want to say congratulations. Thank you for being part of this and tell us a little bit about your accomplishments as a business developer. I actually applied for my first business license the day I could when I started with an online store and then I moved into creating video content with individuals for my community that needed help doing so after that when I move to Seattle, I started a business consulting firm for Fringe workers and poor people who wanted to be creators in this community and didn't know how to navigate the system of owning your own business doing taxes and kind of marketing themselves. Then I moved on to working as a marketing coordinator for 3r technology and the year after I worked with them. They won Seattle Green. Essence of the year after that I moved onto working as a manager at Full Tilt ice cream in the U District and I Rose from store manager to general manager to CEO building out the Capitol Hill Store make it as an exclusive space as possible as well as implementing practices on hiring a cutie Park trans individuals with mental illnesses and people that were facing or actively experiencing homelessness after that. I guess I just went back to Consulting. I did a operations manager position doing the operations management for the British American project conference here to the transatlantic organization of leaders and have just kind of gone back and forth between every chance I can get to advocate for people with the resources I have and then take another contract to pay my pave My Way Forward on more advocacy. Thank you. Thank you. Thank you. The rights being extended to the dancers and more workers across the state. So thank you for lifting that up at 1 Monday. And then today appreciate your work there. You're really interested in doing this process to continue to lift the voices of those who are have historically and often continue to be marginalized and silence and you've talked about letting of the voices of women and people of color and the lgbtq community. So thank you for continuing to recognize that I think it's something that hours to bring that up so that we recognize that I think it's something that as the chair of the housing committee. One of the issues that we know is that without additional housing the folks who are more likely to experience on housing instability and face housing discrimination. Are women and people of the color and people from the lgbtq community? So as as you can see you were majority people of color are majority women and we now have the opportunity in the next few. I would say months but also years to really talk about where our housing investments are going to go as you've heard from this Council that we have. I think a strong belief that we need to find additional Revenue there is not a revenue currently that we need and happy to engage in that conversation going forward about that the lack of Revenue but there is a little bit of gum dollars coming in especially with the new mandatory housing affordability funds and mha as you know is design with the goal of having 50% of new development projects opting for the performance on-site auction. Meaning housing being developed on site and 50% of the projects are opting to pay in lieu of that on site development and going to the office of housing for much-needed Revenue to build affordable housing. And one of the things I'm interested in is how we going to divide up those dollars and make sure that word Meeting those goals. So what are your ideas for how Maj funds could be invested and what types of pausing Investments housing projects. Should we the council be pursuing with those new dollars recognizing their goal is to start work immediately as well as find more Revenue. I think first and foremost going for the demographics are most currently affected so cute Epoch people or people in those demographics first and foremost because they're the ones who are currently at risk of losing their current housing putting some more money into prevention of homelessness. So people that are on the border of eviction and then preventing the problem getting bigger before it goes any further and then I know that lady is are a great idea, but not everyone that has property he's willing to to help when I I know that from experience incentivizing those people to do that and I'm making it easy for them to do the right thing for their communities and stay in their communities would be what I'd want to put money towards first. I know also that these micro units are great, but they're also still way over priced. So figuring out a way to incentivize the new developers in the area to make them affordable as well as space that is comfortable to live in that's not going to cause you to go a little bit more crazy when you're stuck in a room would be really great more Community spaces in those housing. So I think that there's a great way to compromise with developers to make Community spaces so that if they have small units, you don't feel like you live in a box and I think that'll go a long way for the mental health of people who are in those situations is more Community involvement in what they would like to see for their living conditions. I know that And I know that people want to speak up if she given the chance and I know he will have experiences in taking the housing that have available to them and kind of hearing their bad experiences so we know not to do would be a really good step in that direction. I would like to work on that. a good apples Thank you. So you refer to your experiences with Swap and SWA as experiences and succour swap is the sex workers Outreach project to Seattle prep. SW ways to preserve saw saw strippers are workers and you refer to your experiences with those organizations and this opportunity to serve on the city council is also an opportunity to raise the voices of those those workers. I'd be really interested to know you've done working Olympia. You've lobbied on federal legislation. I've had the pleasure of meeting with you and other members and I do really interested to know what sort of city issues we might expect to hear you Advocate as it relates to the issues that those workers face before any of my colleagues up here. Council members. We Once Upon a Time did have an issue that filled the council's chambers with with dancers advocating on behalf of their interest and I'm wondering if there is another you know, really important pressing issue that is a municipal issue that we should be thinking about. Yes. It comes back to zoning in the industry that want to Advocate themselves are also realizing that they don't have any other options which the reason they don't have any other options because there's not really any space right now for more clubs to open up and Collective of dancers in the city would immediately put their money on the line in order to have a stripper run organization to work for that they could run themselves, but that's not really an option right now. There's not really spaces that are already occupied by the clubs for them to open a new club and that's a big concern because they have a virtual monopoly right now in the city and Statewide. That means that Have no bargaining power against the companies are working for and that's a serious labor issue has gotten worse since that's too fast as you know, it just going to get worse going forward unless the city acts in a way that allows people in that industry to advocate for themselves and actually go into business for themselves other issues that are going on because there's a huge intersectional quality about being a sex worker in general affects, mostly queer and trans people and it also affects mostly females. So will I feel like there's a huge Equity Gap that we can fill by knowing that there's a type of worker that is stigmatized and ignored that it's a lot of the boxes that were trying to check and we should probably work on recognizing that Thank you. Consumers wanted you have a follow-up question. first of all Thank you for all the sex workers Outreach project being part of the Amazon. Struggle and I remember having you all at the Vermilion and I really appreciate that and you said that you love you you support ending the sweeps of homeless people because as you said that's not working and you know, roughly 10 million dollars Millie. I mean, it's actually not even fully accounted for but it's many millions of dollars and also that it would be absolutely correct for the city to go for the Amazon tax again because what else would you do that's almost rational approach, but you saw is used as you said, you know before getting off to fight big business and that's what you were doing a permanent for launching the Summer and Autumn fight back and unfortunately this Council even though it is a majority women majority people of color dead end up bottling to the pressure of big business and they repeal a text which was a historic start back. Can get three cities in California afterwards one similar taxes taxes on big business that same year One taxes on big business to fund affordable housing and homeless Services right now, but Mountain View, which is Google's headquarters, as you know, when the Google Docs it was inspired by the movement here despite the side back here. We were able to win victories there so it to me all so it makes sense that we should be pushing for that. But as our experience shows the as a council member you will come under tremendous pressure to not do the right thing and you will hear a lot about being divisive and and you know that sort of thing and then showed you will be confronted with a question of do you stand with ordinary people and what they need or and do the right thing or would you would you been to the pressures of the moment? So this is one of those hear what your thoughts are on that? I think it's pretty obvious by me being here and not looking like anyone else in this room that I do not Bend. I always will stand up for the people in my community directly or indirectly affected by the same issues as me. It's absolutely terrifying to be in this room. I didn't know if I could do it but the people who were more afraid to come into this room than me ask me to there's no way I wouldn't be here without actually listen to the people that need me here and that would be the same every single day forever because I don't know how to be anyone else other than a champion the people that I care about. I'm okay. Thank you. I appreciate it. I just wonder do I really appreciate that and how clear that responses just want to do because your answer was so impressive. I wanted to ask one more aspect often. When you when you are, you know, being accountable to the people that you talked about the people who want you to represent their interests. You would also come under pressure from colleagues on the council and that will probably be the hardest pressure you would have to overcome. So I want to hear you know, just maybe a few sentences about that. Well, if I were one of your colleagues, that would also make me one of your peers still Millennial still have to deal with peer pressure every single day still have to make the right decisions for myself and my family and I extended circles. Play wrong. I want to be liked but I want to be like for the right reasons and I have to like myself first it's hard every single day because I have to struggle to support myself and my people I do things that I don't necessarily want to do by taking $15 an hour jobs here and they're picking up every shift catering for Microsoft and Amazon. I can so that when I get called to come to something like this or go to Olympia at the drop of a hat I can. Nothing's going to change. Still going to be me. Thank you for that testimony. Are there any more questions of this African? When I took this afternoon, thank you very much for the living testimony. Okay or next applicant? Alright jail as our wits. Casa Maria Gonzales the council president so I would ask the same question of you and that is related to affordable housing couch this on this occasion of the context of one of the important roles of whoever fills the sea will be to get on the Steep learning curve and ride that curve of understanding the budget and one of the most significant issues that we have to struggle with as a city council is identifying at what priorities to fund it during the budget process and so given the scale of the need of affordable housing issues within our city the question for me Still Remains as to whether you as an applicant in this position believe that there are enough resources. To meet the scale of the need of the affordable housing issues in District 4 & Beyond and if not what Revenue sources you believe are necessary or appropriate to pursue in order to meet the scale of the affordable housing needs of our community are great. And there is we do not have the money to support a hundred thousand new units are even 50,000 of units. We have to look at at all possible sources. We have some reports we had some potential in the Roosevelt neighborhood hooking up with Sound Transit and using some of their monies that were in Balance. Once we decided that we will they decided we push for a hundred percent of for debility. They were able to sell mostly give the property way for below-market. So I think investigating what other options we have throughout City related to Sound Transit sites is one one place need to do I was seen making some changes in the long-term the state level in terms of revising the charger so the city could require. Units, you know the great European model or two. If you're going to build a building you're going to build a certain number of affordable you and so we can't do that. So I think looking at progressive taxation is really the only solution for that. It's it's the head tax or income tax for people who work in the city. We need we desperately need more monies. I'm a strong supporter of long-term nonprofit develops affordable housing. I think the mission of those organizations holds those properties for much longer than any current requirement like the nfte which has up to me a very short sun set of 12 years. I think looking at extending that term is important as well. But that's only a that's a big Band-Aid. I think we need more money within housing. So that's a priority. I could catch my metro. A nice to meet u j and thanks to you for being here with us tonight. I want it to combine two thoughts here. One is in 1992. You were on the Allied Arts board in about 10 years later. I joined that Ford and the Waterfront for all was created from that. One of the issues has been very important to me is all ages and abilities were and that means Universal Design in the case of the Waterfront of how can we make the design on the waterfront something that's welcoming for everyone. Wonder if you could just talk from your experience what you might like to see on the waterfront. A little bit of everything. I'd like to see a very robust pedestrian character for one strong believer in robust Landscaping as well throughout the city. I think every block should be pedestrian-friendly having areas that are family-focused is really critical having some other social service type uses along the Waterfront as well to welcome people who don't have money to to go to the aquarium in to do different things something inside. I think having a lot of Engagement between our Avenue send and the Waterfront both for views, I think. For better or worse than the viaduct was built at a time and it restrained development. And now that it's come down. I think we have much better ideas to how to treat public spaces and I think a combination of minimizing Transportation along they're making it more Transit friendly and also a multi-modal kind of a Green Street for pedestrians specially and also for bicyclists Please follow up with extra going on right now provides us with a connection and also a conflict between civil rights and what some of the businesses consider to be harassing behavior on the waterfront and an example recently are CD sellers that they will approach individuals on the waterfront surround them offer them the CDs some people believe that it's a good way for musicians and artists to demonstrate what they've done others believe it's hostile and character and we're trying to find that sweet spot. How would you approach this? I think the idea of having some spaces that are devoted to some some Enterprises like that. I'm a strong believer in having business incubators throughout the city, especially in areas of high risk and and high displacement over there's a lot of businesses business owners of color and I think having his place at the waterfront and all public areas. We have some areas around the market. We're obviously there's people there were there were busting and not all sanctioned. I think trying to change the conversation that these are people who have been in this in this area that need a home to then home on the street. That's safe. very good more questions a customer both. Thank you. Been talkin about our shoes. They might have neighborhood or District Court impacts, but I'm wondering if you could we don't have the advantage of having council member former. Councilman, Rob Johnson here who really knows the District 4 issues better than any of us up here wondering if you could just identify what you see as some of the most important District 4 challenges and then hygiene and safety are issues that I've seen and heard there's a lot of social concerns that way I think a lot of it. A lot of the role of the The District 4 council person would be in terms of Education going out and in talking to the constituents and educating them about this issue with a city is doing and has future plans for I think another big issue in regard to the Ave zoning is commercial displacement and there's some very big concerns over all I'm a supporter of the mha zoning there because I've seen so much development go be vested in advance of the mha wish we had mha 10 years ago coming out of the recession, but we're forgetting to that now but I think commercial displacement where we have a lot of small businesses on the app that are owned by people of color as well. So talk to me. It's it's not a book a vocal issue within the constituents, but it's a It's an underlying issue. Text Miami schedule to follow up. I thank you for bringing up the economic displacement and also small business displacement as we look to implement. Mha especially along the Ave. What are some ideas that you have specifically to address that concern that you just brought up? to Italian the mha some additional bonus is potentially for commercial and send it to to get reduced rent as well working with the office of Economic Development to Relocate some those businesses going to LeapFrog some businesses. We got very lucky in the Roosevelt neighborhood partially by my talking to a developer and concerned about taking storefront that was offered for used to the the association. I said, no, we need an active storefront. He was able to talk to the owners of the sunlight Cafe would been there for 35 years and relocated them in that building. So I think it's going out with the LED and also the OPD and trying to understand both the character of the app aesthetic point of view as well as providing smaller scale of retail businesses that are appropriate for that use and unfortunately, they're going to be expensive spaces but having a great some incentives to make it happen. It's critical to to support these businesses that have been there many cases for some decades some even Daughter, but if we're going to help incubate those in a neighborhood and then change the neighborhood, I think we have we're providing into service. Very good, very good at following have unfortunately in District for some of the highest rates of both overdose and death in the University District. Obviously, we are dealing with it across the city and in the downtown Corridor as well as we continue to try to strive for evidence-based Solutions and recognized that overdose prevention sides are and evidence-based solution to a Public Health crisis of addiction and the opioid crisis that was pushed Honest by big Pharma. One of the big issues that we potentially have to talk about this year is how we as a community will come together to advance overdose prevention size and not have to wait for 30 years that it took us to get a needle exchange has to be recognized as a strong Public Health harm reduction strategy. Hydro district has a needle exchange which is currently needing a new home along the Avenue. What are some ideas that you might have to both address the opioid crisis addiction crisis and specifically would you be willing to work with us to implement the creation of an overdose prevention site with incomplete doesn't have to be specifically in District for but as we look at it, I'm trying to test a site. What are your thoughts on that? I think with the with a need in this in the district and especially in the u-district. I think it's appropriate to develop a new site safe consumption side somehow working through the laws of what we can do critically at this point and what we can do down the road as well and what they have. Not sure if it's they could be consecutive with an existing social service or low income housing facility or needs to be a holy separate site, you know combining Services might make it more effective to get more people in and reduce some of the stigma as well. Thank you very much. Okay. We're going to move to the next applicant. picture of a Goldberg Cooper kupp Kay would like to ask this applicant first line of questions. council member Gonzalez All right. I'll ask you the same question. I've been asking everybody for consistency purposes. So again with regard to affordable housing in the needs of affordable housing in District 4 and I'm in other parts of the city throughout the city. What are your views in terms of the sufficiency of Revenue available to the city to continue to support the development and increase of the development of affordable housing through adversity and if you don't believe that there is enough Revenue, what are some viable Revenue options or strategies that the city council should pursue that you might be interested in working on if appointed to the seat. I do not believe the city has enough Revenue to provide the level of affordable housing this required. I'm not sure that the city alone is ever going to have those resources. I'm afraid we're going to have to find partners with the state and with the council that said I would not shrink from discussion of head tax with Amazon tax is sound like to call it. I would not be eager to to repeat the same situation as last summer. I would think that we would want to very carefully structure a plan that we can communicate well and have a good Outreach plan and build political support before we before we do it. One other thing that occurred to me was if our business friends don't like the idea of the head tax, perhaps they can help us with lobbying for some change and whitened in Olympia to allow us to implement a more progressive tax regime here. So I mean Six months, but I would love to have it strategic discussion about how we move forward and what we can leverage that. We not been able to do before with things. We tried before getting away from revenue for a second. I think we've done some things to speed permitting and and allow projects that are in some in the right place with the right complement of a features to get through permitting faster. I think we could do even more to that would make it cheaper and quicker to get the the housing out there. I do think that land banking is really important. I think the idea of a particularly looking ahead at around Light Rail stations and making sure that we are able to provide affordable housing in those places. I don't think it's too soon to start thinking about st3 and what we're going to do with for with finding sites and making sure that does equitably develop is Tod and not you know, not not high-priced units, but I also think that I don't know the answers, but I I want us to get more creative about two and three-bedroom and I'll be incentivize that I think maybe there's a way to look at it mfte and see ways that we could even send it by some larger units, but I think you're one of the big problems is there aren't enough affordable spaces for people who have kids and I worry that we're going to become, you know, not just a monochromatic City by the city that increasingly has only rich kids. council member O'Brien David you and Marge actually both its members of the Planning Commission had a role to play in a report that the Planning Commission published recently one of the the data points that stood out as talking about housing in our city that stood out to me was that about 75% of the land where residential uses are allowed is zoned single-family and when you look at the growth it's happened in about the last decade only 5% of the growth has happened in those single-family zones. Where is 95% of the growth has happened and then concentrated in the other 25% of residentially zoned land and that's by Design we have for decades had this kind of Urban Village strategy that said he want to concentrate growth of your thoughts on where you think we are today and what future growth should look like specifically is that the right strategy or do we shift? And if we do shift what that Shifty would look like, right and then some of those single-family zoning areas that you talked about lost population time so I don't want to sell it at Soundset set off alarm Bells across the city with this with this discussion. I think that we talked about the missing middle and the opportunity to go back to the tradition traditional patterns that we had in awhile in from where I live where you have just within blocks of me. We've got duplexes triplexes Courtyard Apartments small-scale many of these units for homes. Look just like single family homes. I just happen to be divided up. So I do think there's an opportunity without without throwing completely out the sword and scale that were used to in some of our traditional neighborhoods. I think there's a lot there a lot of ways we can open things up for more housing. I know that it in my neighborhood. Anyway, a lot of the initial backlash reactions. Mha in part was what happened to Neighborhood planning. We did neighborhood planning in the 90 days in a row when we were bringing in the Urban Village strategy and and like good memories of having been involved in that planet. Now, we know that that the end result today is that it's it's not getting us where we need to go in terms of access for four people feel so much that the single hammock single-family areas. They are there where you have access to park there were a lot of the schools are so wouldn't when we don't allow more people live there than where we're actually excluding them from the lot of those Community assets. And so we have to find a way to open that up. But I I I think that there might be a way to gradually introduce this concept and involve people in talking about involve people in planning things. Look we're not We're not preserving what we have in Amber. It's not it's nothing. We can't tell you. Nothing is going to change cuz we know something's going to change but let's work together to accommodate this much housing this many people in an exchange these places that will change will get better Transit service will get some upgrades and streetscapes. I don't know what the things are the community might want. But I think there's enough to do this in six months on the council, but I do think that there is a way to start a conversation about a provisioning of a neighborhood planning they could bring people into the conversation and maybe maybe find a way forward. It's not totally acrimonious. Thank you cousin by badshah. Thank you. I really appreciate what you're saying about reviewing the neighborhood planning. We hear that a lot that people feel like way. We did all this work 12 years ago. What happened to it? Alan Turing wrote something called unlocking home about I don't know for 5 years ago and he had some pretty good ideas. Are you familiar with that particular piece? Pretty sure of cilantro and stuff. I'm pretty sure I saw it, but I'm not totally just wondering if you could build on some of the things that he was suggesting there and including allowing for more roommates allowing for homes to be divided. And again, like you said you'd want to send off set off alarm Bells, but would like to know if you've got any additional thoughts for that kind of housing for the hundreds of thousands of more people that we've seen coming that have come in that want to come. I think we need to open ourselves to some experimentation. I think one thing that has upset lot of people as we've tried a lot of new things Citywide and they're certainly suggest if that's what that's what we should do. But why don't we why don't you do what kind of but they did when they initially introduced the idea of bike lanes and taking some Street space for a new public space in in New York where they just said, look let's just put it out there and see how people use it. And let's see if the stuff that people might be afraid of really happens. So could we incentivize an area of town to be the volunteers to say? All right will loosen loosen it up for a time and we'll see we'll see what happens and I think we need to take a cue from some of our Tech startup friends here and you know and be adventurous and be willing to fail but move fast. I know it's hard for city government. I'd like to see you try some of that sort of thing. very good customer Gonzalez I'm so one of the things that we haven't spent a lot of time asking questions about quite yet is the issue around people experiencing homelessness in so I want to have an opportunity to ask you a question in the space. And I think I'll preface it by saying that you know as council members. We receive a lot of communications from people across the city and and and when we're out in community we get approached by a lot of people who have concerns Sometimes some offered Solutions are recommendations for how the city could do better in the space of addressing the issues that people experiencing homelessness face everyday, and and I I am In some cases very saddened about where we're at as a city as it relates to this issue and I say that with a very heavy heart because I believe that we are still a city that values compassion and humanity and that we're all motivated by a desire to the really painful experience of homelessness that people are experiencing our streets right now. Unfortunately, it is become a situation now where some folks are frustrated with the ongoing situation and and the ongoing realities in the space and have as a result begun to suggest policies such as Law enforcement policies to address issues related to homelessness and I'd like to get a understanding from you about how you intend to navigate that space if you're appointed to this seat and and really ultimately what is your values and your set of values and ideals around viewing investments in the space of homelessness and a strategies in the space of homelessness and whether you support harm reduction approaches or punitive law enforcement approaches to addressing the issues related to people experiencing homelessness. Awright is very it's a very hard issue. I am not in the camp trying to arrest our way out of the problem. I just don't I don't see that as the solution. I think the the night circuit's decision recently suggest that we can't just kick people out of places where they are trying to sleep if we have nowhere for them to go so that suggests the first the first step for us is to have more places for people to go and I think that's probably enhance 24-hour shelters in a text and clearly that needs to be or you or whatever do Revenue Source clearly. That's the sort of thing that we need to invest in. I think the harm reduction approach is is to be desired. I at the end to happen, but I I understand people's frustration with what I hear is the filth the nastiness that they stiff they see and I wonder if we need the navigation audit report recently mentioned the the woeful shortage of Courage of toilet facilities in of hygiene facilities. And I think that would it would be helpful if we could find a way to deploy more more of those things more parts of the city. I think if we can clean up without sweeping we can find a way to deliver sanitation services in some of these places where people are moved out and then come back and then moved out and then come back. I just we could figure out a way to I probably sound really naive but but if we could give him the same questions, but if we if we could do that I think time run out of time. So I just I think that would take some of the next off I think a lot. I think you're right Seattle is a very compassionate said he's one of the things that Drew me here and keeps me here. I think we can appeal that compassionate again. Okay, I next applicant Brooke fry. Okay, I need to raise to see that can really see Bradshaw so short. Okay, I would like to ask for next applicant the first question. Package not started yet. Okay housing. There is an ongoing needed to increase the amount of a fordable housing available in the city and would be interested in hearing from you about your read on existing Revenue available to meet the scale of the affordable housing issues. And at what other Solutions in the revenue column, we could or should be pursuing it as a city council as we enter into our budget cycle. So as everyone has said right we definitely do not have enough revenue and you know, our state is terrible at dealing with the revenue question that said You think we're going to have a couple of important revenue streams hopefully coming to us. So number one is the mha fees and I know in one year. We just had it in six neighborhood speed up tokens 13 million dollars. And so we should be drastically increasing that money. So I think number one is looking at that kind of categorical spending and how does that help us pre-op General send money using on more flexible ways to Pilot things like mobile pit stops or hygiene related things. So I think that's an important part. I think also having sat through many hearings. I know there is a lot of concern about to be set the fees correctly. And so I think we do need to make sure that we're really having a process for monitoring the appropriate level of the fees and if we don't feel that we're getting the right performance and pay balance to adjust those and that Bringing additional Revenue. I'm also particularly hopeful that Olympia will pass the progressive real estate excise tax and again giving that money to the city will help us. I'm free app. Hopefully more flexible funds in the general fund and also hopefully be able and he will also give us the opportunity to hold back some of our sales taxes the state sales taxes for affordable housing. I'm so I think those are some really important revenue streams that we should be thinking about and think about how we that kind of categorical spending can free up more flexible spending in the general fund. Forget customer back Shaw and your introductory remarks, by the way, thank you for being here this evening. You talked about having budgeting experience. Will you talk a little bit more about that? So I would say personal budgeting myself, but certainly having been part of a lot of legislative cycles in which you are addressing budget issues. So I think one of the key things was having a front seat for past several years around the McCleary decision in Olympia and figuring out how you find Revenue to meet our constitutional obligation to fully fund basic education. So understanding, I think a like how you really how difficult it is to address Revenue questions where you find budget money. I think that's some stuff to experience that I have. So if I can just do a quick follow-up dive into that a little bit deeper. So you said that you didn't have hands on budgeting experience on this Council in 5 months we will So I'd like to know what role you see yourself playing and how you can bring your experience to Bear Deep dive into the budget. And also just I think understand some of the ways in which we balance pools of Revenue understand the many revenue streams for their levies where it whether it's state funding whether it's Housing Trust funding and also I think really understand how you use the budget Proviso process. I'm and to adjust the ways you're using again, like categorical spending versus more flexible General funding spending. Thank you. Thank you. I appreciated your sharing with us your answers to the community submitted questions and in particular I was Drawn to your answer regarding the Ave. And mha and your recognition that it is the only commercial strip major commercials that is not part of the mha episodes, which means now that mha has passed throughout the city makes the Ave especially attractive to developers who might want to avoid the mha requirements and you know, I was a supporter and a person when we were going through the Ave. Mha are the University District. Mha discussions who supported the community and hitting pause on those up zones, and I've also engage with the community sense then to explain this phenomenon that of the the value of the UPS owns become being a deterrent to development and some places in that they have me Play attract more development and potentially more displacement. I'm just I'm curious to know how you think you can advance those conversations with some really terrible business owners on the app. So I think I think one thing I can bring to that conversation is a great deal of experience and empathy I think for those business owner. So, you know, I basically grew up, you know mother and stepfather rented a house on 55th and Brooklyn. I remember when there was a Nordstrom on the spot records at our records to approach those business owners with that kind of sense of history and understanding how many changes the Ave has gone through. I think it will help give me credibility in those conversations. I think they also just need to hear actual Solutions which is why I'm really interested in exploring whether the mayor's proposal on a community preference policy can be extended to small businesses. I think that's really important and We need to be asking more of the u-dub. They are one of the major land holders their frankly. I'm pretty disappointed with their master plan and everything. It doesn't do around housing for students in their Workforce. And you know, I think the city council particular, you know, all they don't have legislative purview over you know that you dub they do how old some leveraging with the permits and I think you know encouraging them using that leverage to have them sign a community benefits agreement that particularly set aside, um commercial space for small business owners is one also solution and I think would be interesting to start the conversation on in a very short. Of time. Thank you. I appreciate it. We could catch a mosquito. Again for your answer specifically on the mha of Zone, you know clearly have a extensive knowledge on the type of funds that are available, but I think one of the things that were dealing with here in the city is that even the sources that go into creating the city's no Fastsigns the funds that we that office of housing is able to do a blowout for how is Matt Forte fordable housing with nonprofit developers, they're coming from they're already coming from things like the housing property sale proceeds and leveraging against state and federal sources and even with the quote Citywide upselling we're really talking about very small editions. I believe that are coming to the fore and the trend that we seen since 2017 and 2017 Nissan 94 million dollars go into the no funds from the office of housing last year that drop to 70. Six million dollars this year at best at this point. It sounds like we're only going to have around 60 million dollars on with the scale of housing as we talked about before in this region as estimated by the King County Regional affordable housing task force. We know that Seattle needs around 156000 affordable units just to meet today's needs. So I guess it's a follow-up question from the first question the council member Gonzalez ass. I know we are all interested in being good partners at the state level and coming from working at the state level. There's a lot of opportunity continue to top how much could you talk a little bit more specifically about City level Revenue resources that you might be willing to consider that don't require us to wait for another legislative session with this trend in decreased funding for the offer for the office of housing for affordable housing. There are limited opportunities to actually raise funds just given how hamstrung we are from Olympia and you know, I think a conversation around an employee hours tax is completely warranted Andrade and I know these conversations are difficult, you know, I took, you know, well over five years has really to get to mha it took a year to get to a hollow agreement. Anyway, I think you know vesting our time in doing that. I mean, you know, I think two months was, you know, just knowing how controversial a topic it is. I think you know, we're going to probably need to devote even more time to that and just because something is difficult or unpopular doesn't mean you shouldn't have a talk. You should be willing to talk about it and ask people to pay their fair share. Good. Okay, cuz when I get jealous. Customer and you have a question. Okay, councilman Brian the city is committed to a vision zero which is our commitment to eliminate all fatality and serious injuries in the transportation sector by the year 2030. Going to be easy to do we seen some challenges in the last few weeks and mentioned earlier. I'm backing away from a bike Safety project on 35th. And also just the original reality that it's expensive to build other projects in the bike master plan and we saw a proposal it's cutting back on that love your thoughts on Vision zero in general but also pragmatically how we going to do this in the next 11 years did not fortunately have a serious injuries. So I think you know, I have a lot of empathy around Vision zero and have friends who have been hospitalized. Add serious injuries, I'm due to collisions with Automobiles and I think too often in our conversation around this. It's sort of like ours are bikes versus pedestrians in the conversation really shouldn't be that because we know that there's plenty of data that shows that adding bike Lanes just calms traffic overall for everybody. So I think that you know for reframing the conversation is something that can I think begin now and then short. I mean I also think as I mentioned some of my answers, right, you know, we know also in the limited funds that go to buy clients often some of that money gets siphoned off for non bike lane purposes. So I think also really protecting bike lane money for actual bike Lanes by Clans is how we can at least move slightly faster and forward on I think what's a challenging problem Thank you very much. I think that will clue that section A couple seconds left. I think we're good. Thank you very much. Great job. intermex applicants Jordan goldwire right Okay. So now that you're settled calcium Reagan solace. Thank you. Let's see an entertaining the idea mixing it up a little bit right via that the body has spoken and they want me to be consistent. So I asked you the same question. I've been asking everybody else is around available revenue for the scale of the need for affordable housing. Do we have enough if we don't how do we get there in terms of Revenue or other strategies available at the City municipal level that could assist in the collective goal of developing additional affordable housing sure from previous answers that this is a very challenging issue. But for me personally, I would definitely be supportive of another attempt to add to my head tax or an Amazon tax. There's no question to me that the scale of some of the large businesses in our city and the disruption I've been creating in terms of housing affordability needs to be addressed in part by them. And it really seems to be one of the only options that's that's available to us. And so I think we really need to think hard about strategy to how to how to do that in a in an effective way. They will actually know I have broad public support. But that seems to be one of one of the only option is that we have beyond that. I mean thinking still about business in the private sector. I mean I tend to be reluctant when it comes to proposals that are being led by business, but I am intrigued by the recent Announcement by Microsoft and their investment loans, you know, whatever format is actually going to come out to be but you know, it does seem like an intriguing proposal to improve the stock of affordable housing on the east side and I would definitely would be curious to explore a similar type of arrangement with companies here in Seattle. Are good cuts for Bagshaw? Thank you for that answer nice to see you this evening. You mentioned in your opening remarks that phrase that we hear frequently, which is the budget is a moral document. Can you talk a little bit about your experience in that and how with a finite budget we have to balance our budget do we address the things you're talking about weathers housing and homelessness or Parks or better public health or more more firefighters. How do you look at that? How do you make decisions both on the side and the revenue side? And so he has some things that maybe haven't been talked about tonight yet as far as reducing expenditures Exeter. There was no one comment earlier about eliminating sweeps and the expense that comes from that with really really very little benefit and only further trauma to the to the people who are who are causing it. Are the people who are selected similarly? I think I would want to take a really hard to look at our community safety and and policing budgets and determine the extent to which those funds are being used appropriately and if there's if there's reduction is that could be made there to invest more in things like going to have shelters and and permanent Supportive Housing for people experiencing homelessness. And so a quick follow-up what happens when the police department tells you that's absolutely impossible. Yeah, that's where the opportunity for dialogue comes in and he has the ability to have difficult and honest conversations in good faith about what is actually necessary and trying to find creative Alternatives that can help save money. Customer O'Brien and you have a lot of experience with youth and I have a question about climate change as it relates to young people. I know that as I get older, I struggled more more change and I tried to resist that in my life, but it's harder and one of the challenges around climate change is it is required for going to successfully address. This is require a lot of change and I think that's my generation is largely failed us on that and I think that I have a lot more helping the youth for a variety of reasons, but I'm curious any ideas about that and in general, how do we get young people more engaged and he's important policy decisions that they're going to have to kind of inherit our work on the specially if we fail it. Sure. I mean I see in my in my previous work both as a teacher and at the nonprofit that I worked at kids 4-Piece everyday kids getting really engaged on all kinds of issues from climate change to police violence to immigration to anti-Semitism and islamophobia from my perspective. Is there is this in Herrin energy that you have and it really is a question of just channeling and harnessing that energy and pens are providing mentorship and support to be able to have them exercise at and so, you know, I I wished for example that we had our Civics education in our schools so that you'd actually had more opportunities to see how to put their energy into action and and to be able to exercise exercise leadership. So I have a huge amount of hope that you guys can help to guide us to a lot of the solutions to these problems. I think one of the issues is that we often don't provide the platforms to them and we don't listen. Discount their opinions because we think that they're just kids and 7 reality. I think the more we provide opportunities for youth to speak out about issues the more we realized both the incredible amount of intelligence and hard work that they bring to researching these issues and to finding Solutions and if we can get over our own addled he goes and and listen to them. There's a lot of solutions that pay down there. very good My colleagues have any other questions of customer mosquito? We're going to have a few options as it relates to a few more dollars coming in the door related to mha what are your ideas for how mha funds should be invested and what types of projects should be prioritized sure that any of those Investments are done with a racial Equity lens, which I think is important to the city. And so I think you know prioritizing the use of those funds and areas that are predominantly white neighborhoods are people of color live in that have been historically people of color neighborhoods. That's a really important first step. I think there's an opportunity to use that money to expand the tenant relocation assistance. To help people find new housing in cases of economic evictions, which out of program currently doesn't does not support and then I'm also really intrigued by the Community Land Trust model and one of the challenges there is just the cost of acquiring land to put into trust and so it makes a finding can be used to help with that that also seems like a productive then you for creating more affordable housing. Gonzalez thank you. The things that you'll have an opportunity to do is serve as a member on my committee and you might have heard me say earlier the committee oversees the safety and education issues and I think at least a few of those hit some bells that you've been talking about it and that you've also highlighted in your written materials including resume from you about what kind of legislative priorities you would have as a member of my committee or what you're hoping to be able to accomplish sure. We have somebody who is recently a new American. I became a citizen in just about 2 years ago. I think I did thank you. I think that supporting citizenship clinics. Opportunities for green card holders to become citizens is really really critical especially given the increase roadblocks and the increased processing times that the federal Administration has put on people applying for citizenship of that. I think we really need to continue to make sure that Seattle stays Sanctuary City status and I continue to support immigrants who were here. I'd love to see opportunity more opportunities for economic development for immigrants. There was a proposal not too long ago to create an international market at King Street Station that would be a center for immigrant own restaurants and food businesses that sort of Economic Development. I think we really powerful and I'm in terms of immigrants are welcome here, but also that they comprise here. Very good history in a track record. I should save building strong teams run a shared Vision. Can you talk a little bit about building constituencies or building teams? Perhaps when the vision is different sure. They probably the best example for this is my work with kids for peace, which is an international nonprofit that works with Muslim Jewish and Christian teenagers both here in the United States and also in Israel and Palestine. So Interfaith relationships can be fraught under the best of times but the israeli-palestinian conflict in particular, you're really insects Interfaith relationships here in the United States particularly between Muslim and Jewish communities. And so I think I have a couple of examples We every year for Martin Luther King jr. Weekend. We would host a youth advocacy Workshop focused on responding to islamophobia and anti-Semitism and other forms of discrimination and we were able to bring together a community groups like The Jewish Federation of Greater Seattle and the Council on american-islamic relations groups that typically do not cooperate with each other and often have diversion interest and yet we're able to come together because of the trust and relationships that we had built and because they could see that there was a common purpose that was worth putting aside whatever differences they had. Thank you. Thank you very much. We are out of time for this African. So please read the next name. Luke wigren Okay. Good night in Crash were there. Thanks for your patience, and we're going to lean on Caspar Gonzalez for her go to question to start us off. Oh my gosh. Okay housing Revenue. Do we have enough? I'm assuming you're going to say no. The first time you asked the question was like 3 minutes long does it to me by the presiding officer? Is it by shorten up the question? So I am heating that advice in large part cuz I've only had a bag of goldfish today crackers and 4 crackers Revenue around housing. What is your view around current availability of a revenue to develop additional fordable housing to meet the scale of the need and you've heard already talked about that sir that the ongoing decline in available dollars in her budget through the office of Housing and what other mechanisms could we utilize to generate additional revenue or incentivize additional development of affordable housing? I believe we don't have the revenue at the moment in which was why when council member hair is tally this and Michael Brian put together the head tax in that very short 51 days to years ago. It was so important and I do feel contrary to I think some people's beliefs that that we really were able to see where we stood as a city and I think that it was it was an incredibly valuable debate and also just to see who's on her side and we need that Revenue the top 3% of businesses should pay and we should also make sure that we are going out and looking at discretionary spending addressing whether it's necessary that the budget hiring August 4th many more police officers. I'm not sure is the most important thing to do right now property crime has has dropped significantly since the 80s and we need to address, you know, crazy situations which are what police officers respond to I feel like most in different ways with the LG there a symptom of other issues going on. So definitely we need to tax big business who also I believe like David that we should go to the the state and the federal government even this is a humanitarian crisis and in my perspective and We need to sort of I believe the leverage. I think we need to begin to pass rent Control Ordinance here in the city and pushed the state to also just give us an earmark money just like they've done for the Waterfront tunnel. Just like they've done in the past for the bus tunnel and many other Public Works projects. I think that we need a large Works project for housing. Cricket customer back, so sorry about that. And again, thank you for being part of this tonight. You just mentioned that property crime rates have gone down the statistics that we see fly that and in District 4 in particular of the last the last year that there was an increase in robbery aggravated assault but one thinks we've heard a lot is from the University Bookstore and shoplifting at least had the worst shoplifting is at 10 in the morning when they open their doors and what we know from a lot of our studies is that people pick something up walk across the street sell it for pennies on the dollar walk up the street to the Jack in the Box where they buy drugs then moved across the street where they shoot up. So they can talk about a little bit on the shoplifting what you know and think and what do you think about the idea of having our Public Health places where people are allowed to go in and get Alternatives like buprenorphine. Those are crimes of of desperation and and I believe that yeah, there are many other opportunities to sort of circumvent them in and help people get those options. I know that there is a big discussion in this District about what to do with the area around the the light rail is coming there at the Ave. I believe that if the city practically begins to with the land dressed like Teresa Mosqueda has as set forth in the mayor or nothing, but if we begin to buy some of these pieces of land property with that money and invest in the future knowing that we will eventually get money from the state and federal government that we should have protect those areas and in Be able to figure out how you know by keeping the neighborhood character in those areas that we can develop on that. I'm them keeping current businesses. And then also opening up services for the people in those areas like safe injection sites or food banks. I love the food bank and you just checked by the way. I think that is it's nestled perfectly in a in a building that has housing little above much housing and and the service is blow. Cast member O'Brien. Did you have a question? Thanks appreciate on your resume that you have a degree in race and ethnicity. I think of Seattle is a very Progressive City and I'm really proud of the values we hold in our city and yet have you been in this job now for nearly 10 years and seeing the data over and over again. I forgot the values below by the reality of racial disparities in our city and how often you know comparing us to political jurisdictions around the country that we scoff at its not being Progressive are outcomes are actually worse. I'd be curious to hear just a few moments of your thoughts with your background on where we are in the city when it comes to racial disparities and things, you know a couple things that you think what you could have dressed as a council member we should have Drax short-term or longer-term to make the city more equitable. It's a lot of things to be done what we definitely cannot go back to Seattle. That was 95% white at one point and is severely red line. But now we see that the line stretching to the far reaches of the city and pushing people out altogether. There's areas that are resistant to wait. Will you blow me to call desegregation like Wallingford like Fremont like that like Laurelhurst is a lot of the neighborhoods in this city that have always been in a white Enclave. So I guess it's sort of server urbanized. I I think that has a lot to do with the wealthiest seattleites and and the historical generational wealth. I think they knew what I was hearing is that in a while. We are creating this massive push towards a photo portable housing. We should also supplement that with ways that lower low income earners marginalized people people that are being displaced going to have ways of ownership in the city because that's how you know, white families have created wealth historically and kept that wealth and we need to create those me and of opportunity. I love the person way. I just read about this over the last several like several months, but Nick Licata he started I got some Everett Licata former council member. He started communism up on Capitol Hill when when when houses are cheaper in Rensselaer cheaper, and we need to start adding a city Department that is facilitating those sorts of things whether we're taking I don't want to go too much. I have a lot of ideas on this but I think that we need to figure out ways that owners can maybe eventually vest their homes while getting paid back from individuals for the end of the wealth of Dave, you know, I guess I learned on their home over the years and and allow other people to move when the baby communally in a communal structure. I think there will be added there are people that in Seattle. That would be no back up their words with that action. Cricket customer mosquito one of the big questions that I asked a few folks. The comments on was what your position would be as we think about the final piece of mha implementation on the Ave. I recognized in some of the unique characteristics both of the Ave and of our friends who want to make sure don't get that feeling displaced but also recognized in this is one of the areas where we have both students and artist and activist and future teachers and current postdocs who are deaf in desperate need of Housing and we don't have the density especially around this Transit that's coming in with the light rail to accommodate the housing that we need and this people continue to get place at pushed out of the area. So it is a balance I understand but what is your position and what are your Thoughts about CMHA implementation on the Avenue as a district 4 council member. Do you have a position on the Ave and up Sonia it? Yeah it one of my favorite I believe that I could definitely definitely say that my favorite song of all time. Is that have by the Blue Scholars and to keep that character I think would be very important. I think that that zone in one way or another should be sound similar to the way that in the fight that the community put for. I don't know if the pain of Community Support is behind it, but I'm in similar ways to forward former council member at Wing Luke. He held a discussion of protecting the Pike Place Market and now we see an amazing that like thriving community in my opinion that has hasn't been touched by rampant speculation and development but has you know still maintained its like sense of Home and Community. I I do support up zoning. I do think maybe in this case the city should get out ahead of it and just you know by that land and somehow maybe use the the money that we are the universe small amount that we're making at this moment to build that Land Trust in Preservation District also the International District and you know, I don't know there's other places too in every single District. a good any other questions of the county just had a few seconds of thank you very much. Appreciate your thoughts. Okay going to go to the next afternoon. Darby ducomb Okay, now that you're settled. Casa Maria Gonzales same question Revenue portable housing do we have enough? If not, how do we get more? Do not have enough Revenue to buy our way out of our housing affordability crisis. No, we do not and I don't know that wheel ever single-handedly at the city government be able to achieve that I'm always reminded that it was the defunding of affordable housing by the federal government over the past several decades. It's really push this issue down onto the cities and made it their responsibility. That being said, I do think support income tax reform. I think that's the one of the biggest things in our state in our locality is we need not to have such a regressive tax system in our community. I also think though that when it comes to producing housing affordable housing, we have a large menu of options available to us. I'd like to see I love the land banking idea and when we own the land we can Get into deals with tax investors and tax credit investors and we can build our own in portable housing. That's how affordable housing is being produced today through tax credit investments in large part. There are HUD contracts expiring that we could maybe purchase we could work with the Seattle Housing Authority to ask ourselves. How do we as a city keep buying and buying and buying Section 8 vouchers that might be expiring with other folks so that we own the public housing and then I think also we need to find a way to stimulate the private development of affordable housing affordable housing is rowhouses affordable housing is low rise housing, it's Wood Construction that's less than five stories tall five stories tall and when we put together that middle housing strategy. I think we will see a lot of benefit to that because right now the apartments the micro-apartments, you know, they're not serving families and if we're not going to be able to incentivize family size house Can Apartments we've got to find a way to produce family-size housing through row houses townhouses and low-rise doning in Northeast Seattle and in District for we have enormous opportunities to convert single-family lands into low-rise zones in lots of areas are arterioles were watching developers right now build a 1.5 million dollar single family homes on an arterial when we can have three families in there are four families in there in a 300-400 $500,000 home it bad. That's making me cry right now in my own name. Has been back so great to have you back here and nice to see you after all the years you worked on what city attorney's office has questions for you and both involve Lids. I'm not talking about marijuana Here Local improvement district and also the lead over I-5 and I know someone mentioned about Al and make that when we make land we can put affordable housing on it more capacity would like your thoughts about the lid I-5 work we're doing and then also I understand that even though it might not be you personally. Your Law Firm is suing the city around our local improvement district on the waterfront. So can you address those Farmers contesting his Lida assessment if appointed to this position, I would recuse myself from All Things having to do with the Waterfront LED, which I think is pretty much to rest right now. A lot of the work is done. So that should Be a big issue when it comes to letting I v. I think that's a great idea. It's a great opportunity. We've done that and other communities / I-90. I think our Interstate corridors are having Norma's potential not just for reforesting our community, but for providing open space public space and housing. So I've I'm in favor of that. cast member O'Brien cast member scada I think you very much mr. President. I'm just teasing you. Thank you for your answer to the first question. I think you know the answer that you provided around greater density looking at opportunities, especially in D for not being shy about how do We crave duplexes triplexes quads and recognizing as as one of the earlier remember said that was the fabric of our city in the past and this should not be something that's scary and we'll use the term don't raise alarm Bells. It should be an alarm to us the lack of affordable housing that's currently happening the amount of displacement that's happening from the city. And I've said before we're losing our neighbors because they're getting pushed out. We're also losing lives because people are being pushed into the streets and often I think in Seattle, but there was a disconnect between the lack of affordable housing and the growing number of folks who are experiencing homelessness. And so as we think about the long-term goal that you articulated which I appreciate. I'm also urgently pushing for us to think of What is the short-term solutions that we can be investing in whether it is creating additional shelters or additional in a small housing units cuz he says I don't know what else to say because there's various types. We're not just talking about tiny houses were talking about the kind that could be pallet Orwell to put together stuff that can be throwing up very quickly. So people have a roof and a door and a lock and window and they can be with their family not be separated. This is critical right now in the city of Seattle in November. We heard that there was only 3 3 enhanced shelter beds open per night in the heart of going into winter last month. I heard there was only eight and had shelter beds open per night on average and yet the city continues to engage in moving people from corner to corner without adequate. I'm shelter spay. So first, can you comment on what we're seeing in terms of the movement of people and the lack of shelter to place them in quite literally we do not have the shelter with And if people can have stability and Tents and we know where we can go to reach them and get them into case management that is a better solution Than re-traumatizing People by pushing them from corner to corner. Can you comment on those that are otherwise I don't call the sweeps and what your position is and then other ideas that you have for how we address the lack of shelter as we push for those Housing Solutions that you talked about that are longer-term. I think short-term looking for shelter space emergency overnight shelter space. I would give some thought to all the vacant commercial space that we see in a lot of areas. I imagine you might be able to lease some spaces from commercial owners that I know that that's so frustrating element for the folks on the app is that there's so much empty commercial space around them in the new buildings. I think also the big issue is the throughput housing. So we Getting people into shelters and then we we we might even do a good job and getting him into emergency transitional housing, but then we don't have a good stock of the low income housing where they can really permanently land and I think that's the body of housing that we should really be putting our energy into when it comes to our unauthorised encampments and people living outdoor. I believe we need to keep up zeroing in on our investments in terms of trauma-informed care. I think anyone working with the homeless population needs to be using trauma-informed practices and to be very delicate and what they're doing and how they're talking to people in building those relationships. I also think that we need to invest in the mobile health and hygiene facilities the report from the navigation team audit to me was just heartbreaking just absolutely heartbreaking. I think we need more hygiene facilities for folks. And I'm a firm believer and Outreach Outreach Outreach and clean the camps. I mean, it's not it's not a big secret. I cleaned. It was very controversial. It's always controversial but we have to keep the camps clean for the campers and we have to keep the camps clean for our neighborhood. I get on the freeway and it's basically a drive down I-5 where it's one can comment after another and garbage piles everywhere and then I get to work and Soto and it's it's it's crazy in soda what's going on right now and my hope for my city is that we can clean it and we can keep it clean and when our cities clean people aren't really too upset about the fact that people are intense and they're not too upset about the fact that people are camping out in places, but I think we've got to get our city clean. When you say clean the camps that could sound like an endorsement of sweeps. But what I heard you say was clean the cans and terms and make sure that people have hygiene services and garbage pickup. Can you distinguish for me between those two? Which one Yuri mean? When you say clean we have to do the cleanup rights and generally people depending on the situation in the particular encampment might have to move across the street or wait on the corner with their personal belongings that they want to protect and then try not to get so freaked out that they moved back right when I was training city workers on how to clean it and can't make it was super frustrating for them. They felt like they were the hotel maid and I am I would say to them. That's right. You're the hotel maid. We have a City full of encampments and it's our job to keep the encampments clean. If this was the Motel 6, the maid would come through three times a week if it was the holiday in the maid would come through every day of the week. we just have to be okay with cleaning the encampments and then there are going to be situations and locations where we should not have encampment mall for a small amount of zero tolerance policies whether it's our Parks lands or someplace are Highway infrastructure makes me very nervous, but that's a very complicated issue because it provides Shelter From the weather some very good. I think we've exhausted the time for this this applicant. Thank you very much. We think you very much and let's guess who's our last album. I would be able Pacheco almost going to do it by alphabetical order on a first-name basis and you have been number one, but unfortunately we went random. So who would like to ask Michelle Pacheco his first question? I'll go before you do that. It's been is fairly clear. You're trying to be disruptive in your making several body gestures to do that. You're being warned that your behavior is being just okay. I just let you know you've been warned already that your behavior sister aptive that will suffice as though the warning peace council member Gonzalez the same question that I've been asking all of the applicants I would like to ask of you is issues related to revenue as it relates to continuing our commitment to developing affordable housing throughout the city. I do we have enough revenue and if not, where do we find the revenue and what other strategies should the city council be considering in order to meet the scaled need as it relates to affordable housing knock on some of the doors with him some of the red District 4 and do your point customer Gonzalez? The city is still empathetic compassionate and wanting to deal with the issue. But then I kind of like this issue and how this issue came to be the federal government in the eighties were sold. One of the greatest sold us as a as a people which was the federal government is in the solution government is the problem this issue that would like to impact on state budgets as well as local budgets. And so while there is I think the opportunity for us to see what have the final say budget is developed here in Washington over the next few weeks. It would potentially provide any resources for us the local on the more local side of how are you dressing tissue looking for a I think some of the solutions have already been presented by some of the council members here in his body already, which is looking at Unearned income tax as a city. I also think it's an opportunity for us to look into countywide Solutions as well these issues and I'm pushing our County and our regional Partners Regional counties to do more as well. They counties the issue of homelessness issue housing affordability as we made investments in st3 is something that as we keep the focus on transgender development. How do we build more housing as the online as the light rail becomes online? Cricket customer both thank you. So we've been talking a lot about revenue for affordable housing. So building housing. That is Affordable to folks in the city. We've also been talking a lot about mha exchanging zoning capacity for requirements of first contribute to affordable housing things that we haven't talked much about is a preservation of existing affordable housing and using the University District as an example the council Central staff did a review of pending demolitions and found that in less than a year and a half since passage of mha to University District there about 96 unit slated for demolition. This city had estimated that over 20 years there would be 4260 units slated for demolition. So are our estimates of What were tearing down in order to add capacity are are off the mark and so this is something I feel really strongly that we need to do something about and we have up there that we have a bell that's gone on the information and referral calendars been referred to the pledge committee. I've been working with our Law Department as well as some outside legal counsel to address that issue highlighting the fact that displacement has disparate impact on communities of color perpetuating segregation in our city pushing people out of the city, So this bill with use Arciba thority to mitigate those disparate impact on communities of color and if if you were to be selected, I just want to know that that this bill would be something that you would be willing to have on the Plaza genda as the chair of that committee. Yes, but I will say this to we have policy tools available to us with regards to displacement that they'd be able to provide more support for immigrant or some the small businesses. Cuz I hear those concerns to within the U District and I think we have cities like San Antonio who have set up a mitigation funds for displacement is something that I think Bryce is we're going to have to look at explore further in having said that too. I think we have an opportunity to really think about how we put more development the first the largest expense that any individual or family has is housing. The second largest is transportation. And if we're serious about getting more people out of cars in addition to being able to provide more support for families 2 Think about how they can be able to afford living in Seattle. We have to think about how we can up Zone app. Think about the new development that happens within a transit-oriented st3 system. Does beer affect show? Thank you for being here. Appreciate it. And I know it's been a long night for everybody. Talk to us a little bit about your Mesa program in the work you've done there and how you might coordinate what you're doing with the efforts that are public school district is doing sure young girls and kids are color week have a teen centers across the state. I've been able to help expand our community college program from the 12 centers that we had to 18 with regards to what we have as we have a Seattle Central College Mesa program in District 3. We have a Asiana Mesa program focus on Middle School and High School youth in South Seattle as well as West Seattle. Intrinsic coordination one of the challenges that we've had as a program. Is that while we've been in existence through 35 years. We have not received as a program additional say funny and since our K-12 program funding has flatlined when adjusted for inflation since 1992, and I think one of the opportunities as we see an economic boom here in Seattle with regards to the number of stem jobs. It's an opportunity for us as a city to really think about how we're providing those stem education opportunity specifically focused on young kids of color and young girl. So that way we're on the Forefront of how we create the new face of stem on leading it with regards to the diversity of our Workforce. Tell quick follow-up on that call my house for Innovative high school. So I went down and saw one of the stem schools. Last May. Can you talk about that kind of an Innovative program and out the city of Seattle can work closely with our school district to promote that one of the things that we do is provide professional development for teachers and so being able to leverage our curriculum and professional development for teachers would be something that I think the Mesa program through the district for can be able to provide leadership on with regards to some of the enrichment activities that we do for kids and and being able to engage them and field trips to companies like Amazon or Microsoft running those additional support resources after school and school is something that I think we can have a opportunity to partner and strengthen it with regards to both the same the Mesa program itself and also with regards to what we do I from the University to the city. Thank you. Thank you. So some of the positions you took released one specific position. You took at the community Forum on Monday, and I appreciate you sent me an email earlier today to clarify one of your answers at The Forum or one of the perceived answers that uniform though. It was reported that when the question around overdose prevention centers that was asked you you gave a thumbs-down indicating that you were not supportive of that public health reduction model to address heroin and opioid and just substance use dots and so I want to get it a clear sense for Today what your position is on overdose prevention centers or safe consumption sites, as some folks, I think it's a disservice to do buying a complex public policy questions in binary responses. But as it's you, we all know that's probably more often Willie. What I was trying to outline is that I am supportive of safe consumption sites. What I would like to see is that it's more coordinated approach with regards to so that when someone is ready for Rick for support that there are nonprofit Partners as well as a public health Partnerships nearby co-located so that someone when they look and seek recovery or seek Rehabilitation that are able to find those resources quickly on a personal level I had lost friends to drug addiction and so that being able to provide I look at this issue is very much more so about being able to buy the access to opportunity for recovery for housing for economic assistance for they can find jobs or potential education opportunity. So that those Pathways to opportunity are provided appreciate the response to the clarification there and just want to make sure that you're aware. That's exactly the model that the city council has been supporting and advancing through multiple budget sessions already and it is our vision that this would be a opportunity for us to one first and foremost prevent otherwise preventable deaths from drug overdose, but secondly also be a place of resources and support and wraparound services for individuals who are ready to enter into a. Of sobriety and and all the challenges that come with that so that would include Mental Health Services. I counseling drug rehabilitation. and all of those wraparound services that you've described in and in being a council member or former council member Johnson was a major major Advocate and Champion for this particular issue in large part because it is it is an issue that uniquely impacts District 4 in particular given it's very diverse population in terms of agent, excetera and it's really important I think for me to find somebody in this position who who is going to be of the same vision as former councillor, Wisconsin as it relates to this particular issue, I I I agree. I apologize that you'd want these morons have gone. He's a bird. He's got a little bit longer. So I'm one admit a mistake that I made and so I should have clarified and that's why I clarified immediately. As soon as I became aware of it unfortunately was not tag on it on Twitter. So I became aware a couple days later. And so I've clarified that position. So I apologize for the data point that about 75% of our residential land is zoned for single-family about 25% for multifamily in about 95% of the growth has happened in those multifamily zones because of our Urban Village strategy has Seattle continues to take a lot of growth. I most certainly in the coming decade or two to think that that's what how would you like to see us grow continuing that policy or shift and maybe some Sunday? In 42 seconds, I think is his what everyone is kind of outline, which is the policy needs to change what I think and what I've heard is that they were just be like to be more engagement through the process. However, it is much engagement ultimately as we have I think the values of being inclusive and being more specific providing more sustainability around how we grow as a city and something that we have to be keenly aware of an anytime that we stray away from those guys. It's something that I think this city needs to and especially our leadership needs to be able to push back on as well. Thanks very much. And that will conclude this section of the agenda not ask that you just stay seated. I'd like to say a few closing words, then we'll invite public comment. I personally want to thank all 11 of you for I would say giving us gifts gifts of your your wisdom and your your passion for the city and I don't say that in a token wait all that. I've learned from each of you in terms of your commitments. This is not easy what you're going through and I think you only were motivated by really positive intention. So for that I thank you personally is is the present the council a lot of what I heard you quite can we just can't fake. It's nothing artificial about it. So I think that was real talk though until we will evaluate and hope to make a good decision. So thank you for your participation and I Ask her to stay while we listen to public comment. We have about 14 people that have signed up and we are going to open public comment now in the order with which you signed up and we'll start with Mark fultz if he's here and then Josh Cooper. You speak rap 2 minutes. Hello. Cancel, thank you for bringing this process to inviting me up tonight. I'd like to speak a little bit about the qualifications of I'm sorry. I'm sorry. I don't know if your mic is on just one sixer. Okay, so thank thank you for being here tonight and posting this process. I wanted to speak about some of the qualifications for Brooke among all the other candidates but really stands out to me as her track record of being effective at generating policy both the state of the local level. You might be aware former materials that she wrote a very detailed proposal about trading more family size rental units during the u-district up soon. I'm sure I wrote a long Five Points proposal on ways. We could incentivize or family size rental units which were not being produced by the market at the time and not a form of that proposal was eventually adopted into the mha legislation and eventually made its way city wide as well. Another thing that kind of came up during the questioning tonight cuz you're looking for someone who's willing to put in the work to really generate very detailed and thoughtful policy proposals. That seems some of you have the chance to review her responses to the 70 + Community questions. How much I think had a lot of very detailed, you know, thoughtful responses that reflect both our values are specific ideas ever knowledge and background and connections to the district for Community. I'm finally Beyond just her qualifications and skills and Intelligence on she cares about people and that's why she's seeking this role as a member of the Northlake Community advisory Council. I'm sure organize a Thanksgiving dinner that brought together the residence the providers that work at the the Northlake tiny host house Village and neighbors to come together to share a meal. I'm to have a moment that I really connected the neighborhood together for all these reasons. I think she would be a great choice to serve at The District 4 represent District 4 council member in the center of position and encourage you to make that choice. Thank you very much. Thank you. Josh Cooper's our next speaker calling Josh's Erica is s a letter l a r Thank you so much for the opportunity to speak of this evening, Just wanted to say a few words about Maritza Rivera. I think she's an excellent choice to represent Seattle's 4th District where I've lived for over a decade. I've been lucky enough to know her for the past 20 years. She's honest personable level-headed. She has great listening skills. She's an independent thinker she's extremely bright and she knows how to work on a team is a long-standing resident of District 4 who also has two children in the Seattle Public Schools. I think she really understands the key issues the face our city and our district in particular. She truly has the Seattle district for a community's best interest at heart. A lot of Greek up with a track record of diligent work as a public servant including her past experience as was mentioned tonight, but working in the white house and our current position in the mayor's office here in Seattle. I think make her the really one of the best choices to fill the city council position. Thank you. Thank you. Is are Erica's will be followed by Alicia Patrick than Sean Moore Coalition. I'm here tonight to support candidates who support Community LED Solutions and for transparent Seattle infamy. Those candidates are Jordan goldwire and trailer sells Canada strata Nash real shame that they have a real understanding of Mark demands sweeps safety budget instead of wassailing on spending millions of dollars on projects that harm human lives have shown that they support what most of the council supports but many of these applicants showed that they don't support those things things like making self safe injection sites reality securing funding is referred a progressive taxation and ensuring the community ownership models are prioritized over private Developers. Over and over. I think the public hears city council says it wants to invest in Solutions, but I think this very process shows us that applicants. Don't get equal Access Urgent timeline on the demands on might be able to otherwise apply or show up to support numbers that you apply make major sacrifices to do. So. I hope that's something on the council will consider as they make their decision support sweeping her unsheltered neighbors or further bloating are Public Safety budget and in particular, I would call Abel Pacheco and thank you. Following Erica's Alyssa is Alyssa here at least relieved Patrick. Okay. How about Sean Moore? and following Sean Morris kehlani Sito Hi, my name is Sean Moore. I'm a student u-dub and a resident of District 4 and I would like to speak in favor of Abel Pacheco to fill the vacancy in District for I believe you can bring several unique qualities that could help this word for Thrivent student population. I believe he understands which is very much at the heart of district for Community. I believe to understand the needs of students at u-dub and a district for has a depth of technical knowledge as a graduate of the Evans School of public policy at u-dub. I believe that this technical knowledge will be an asset to district for is it deals with high rents homelessness and development of displacement. Elsa Polly videos of Fletcher vision of how to smartly develop District 4 in a way that can accommodate a new residence while also preventing the displacement of current residents. Overall. Abel has a strong understanding capability and vision of how to register for through these times of change and would make a great addition to the council. Thank you. Thank you. My name is Kalani Seto. I'm a colleague of Abel and the Mesa program. I moved here 10 years ago about the same time Abel move to Seattle to I ain't that time. I was only intended to be a transient workers work here for two years and maybe move back but I ended up staying longer having found community in my program the Mesa program the same thing to being a student at u-dub and I have only come across a table. Maybe say 3 years ago and have been having connected with Abel over this time. He's taught me that I am in District for he's also got me to vote registertovote. Who sings about really taken advantage of? The privileged that I have being a citizen. I acquired my citizenship. I'm not naturally a citizen I gain before my parents. And I think in talking with Abel over time, I realized that we found Community or even though we're from different places in the world are from a Pacific island tables from Los Angeles, but I've been to other places in California in and on the east coast and I don't see the same community that we have here. So that that's very precious when you very you need to Seattle. And I think that's worth protecting and I think we've lived in the community long enough to see that. what makes Seattle special especially when we come from very diverse neighborhoods that in itself are special to and I'd like to see that Community Thrive even more here, even though we have a giant neighbor that seems to be bouncing are Littlest neighbor out of the neighborhood. Thank you. Connect to speakers or Maddox star followed by Joanna to sorrow. Is Maddox Maddox here and then Joanna to sorrow? then Nicole Gates Mannix Joanna Nicole Gates Hello, my name is Maddox. Cherie has often been referred to as Mama by co-workers and Friends alike because she has been known to take people under her Wing. I have seen her genuinely helped many people over the almost two years. I've known her including myself. She helps and inspires people to get back on their feet. She offers sound advice, but she also holds them accountable for their actions is brutally honest in any given situation which I find to be quite refreshing. I've seen her help people from all walks of life in various ways time and time again, there's no doubt that charade touches people's lives and makes friends everywhere. She goes, I believe she was born to be a politician and she already is in many senses. She's charismatic tenacious strategic and finding Solutions and she cares deeply for this community. She will and already does prioritize and stand up for the most vulnerable whose voice is off and go unheard Shreya has been a resident for nearly a decade a zinc and she's extremely knowledgeable about the issues affect. Community I know through experience that she is extremely Innovative at finding not only solutions, but great Solutions thanks to her values. I had the courage to come out as trans at the workplace as a manager. She showed me support in countless ways. There's not enough time for me to extrapolate and thanks to her. I'm a member of this community as well. So thank you sharae for inspiring me to find the courage to tell the world my name and for helping me become a Community member of such a wonderful City, and as a member of the University District as well as a member of the lgbti community. I would be proud to have Sheree lascelles serve as the interim District 4 council member. Thank you. Joanna Nicole and then Connor Bronson brunsdon So is Joanna here? Okay, so I'm going to move from Joanna to Nicole Gates. And Nicole, okay, and then Connor will follow you. I did a little research. I don't know how long I'm mostly here because I believe in whatever she believes and if she says she say if she says yes, I say yes to so I did a little bit of research and some information says the city of Seattle's counselor a doesn't have the best reputation. It kind of has a intimidating and discouraging Factor. But I mean if you see both sides of it does it mean that the city council has a problem where do the people have a problem because it just mostly seems like that's fear-based with the people not necessarily the structure of what you're doing what you're doing is important and it's set that way for a reason cuz you hold space you hold the space and you're here and you're giving time to people for just afraid. To get what they have is an opportunity in front of them. My perception of the collective is it as an individual is there just disconnected then lost and I think before the council could ever give the city what they need or the city vice versa. Then I think we need to acknowledge and recognize that we have an ever-growing gap of Separation that needs a bridge. Are bridges here and she's right there and that's sure a we don't need to just another Advocate who contributes some great value to the bridge being built or set in place. Not a person with money or academic achievement or a donor of materials or accomplishments of notoriety. Our bridge is built. So we just need permission to set it in place. She definitely will spend the Gap y'all walk on this bridge because it was made by humility is protected by confidence and passion and it floats on Integrity. Sheree is a gift that only knows contribution to the greater good she invest in it. Sorry about that. I just want to say she is the voice to be heard by the ears that needs listen to and her heart beats with a conviction that amplifies the voice. So it is heard by Making Waves not swallowed by them. Thank you. Connor is here in the same last name, right? Okay. So Connor we followed by Ed Brown still having the opportunity to ask expensive questions of all of the tenants. I thought I was incredibly excellent to have that opportunity like hear more about that. I'm so thank you for the council for instituting that made it clear. We have a bevy of intelligent capable and accomplished candidates, but I want to speak with chocolate to Abel. I've known table for 7 years. Time. He's demonstrated to me that you want. So I think you need to have a member has lived experience young men of color and also being publicly arrested and wrongfully so he's got that experience for what we need a public safety. And I also think it's really important that we have someone who understands and knows the district have lived there for a long time but no one else in this room has ran for that seat. As knocked on thousands of doors both in 2015 and this year and I just wrecked has engagement uniforms before this week talking people in The District 4 and I think that's a fantastic ass that he's going to bring the table and be able to go in there just as all of you did and know the people at District really well and have that knowledge of what they need. I think that'll give him a huge advantage in making the most of the short time in the council. Thank you. Calling Ed will be Shelly precise. I know able because of my son Connor bronston, but I'm at bronston. I've lived in Seattle almost all my life born in Seattle Meriden Seattle. I've worked in District for for 15 years. I live in District 5 for 33 years, but my comments actually for the 11 of you not so much for the council, which is thank you for stepping up because I listened and I thought to myself we're going to be better off if anyone of you steps if any one of you is elected in that role and I'm here to speak for the person I know best and that's able and one of the reasons that I appreciate able personally is because he does look at things and say, you know, I misspoke there. I want to clarify my remarks and I want to make sure people know where I'm coming from on that. He responds in a way with intellect. Councilmember O'Brien spoke and said to an issue paraphrasing here. What would you do to involve youth in some of these issues that we're dealing with? And one of the ways you could do that would be to elect a council member for the next 6 months Who is younger than you and yet still has the community experience that we need to be successful in this role. So they have that intellect to have a social Equity understanding that comes from living at his entire life. And to have the ambition to want to serve which all 11 of you do. Thank you. But I'm here to speak for able and I hope you will choose him and good luck in those deliberations cuz it's after 9, and you folks are stepping in for a tough role here. Thank you very much. Thank you. Shelly and falling Shelly is Rachel work. Hi there. I'm Shelly precise. I am I live in District 4 I've lived there for 15 years and I've worked there for about 7. I'm here tonight to support Maritza Rivera for about a hundred reasons, but I'm in interest of time. I'm going to share 3 that I think it will be most important to the council and to Seattle. So where's that has vast relevant experience representing citizens and fighting for equality. You know what she's done she has She's just really qualified for this role. And I think that her experience and her diverse experience is really going to be important for a district for and how diverse it is music deeply cares about health racial and economic equity for the entire Seattle. So she cares a lot about our district, but she also understands how that fits into all Seattle and number three. She follows a lot to a t she's honest and independent which is a fierce mix and I think that the council could really use it. I think Maritza is the team player that you need to fill this hole in the city council and fill in where Rob Johnson can't so, thank you. So I'm sure you were you are Rachel. Yes, Rachel, so I was getting forced out. Okay, Rachel and following you will be Alex Zimmerman. So I'm Rachel rohrer, I lived in Seattle all my life. I run the women shift at the people's harm reduction Alliance in the U District and I'm here in favor of stray apologize for interrupting your Rhythm. So I'm here in favor of Sheree LaSalle's. She is somebody who has like the unique ability to meet people where they're at by networking within the community that she lives in like me. She doesn't drive a car until I feel like she'll represent somebody in my demographic. I also work for An organization that does work with opioid use houselessness crisis. I can't mention and media kind of circumstances, but I can say that I know that sure I will do the work within the communities to bring like harm reduction approaches and critical thinking that it that it takes to solve work with the homelessness crisis. Yeah, I think that I'm her work with saw and her work with swap shows there. Sorry their commitment to this kind of work also as a parent of a trans teenager their non-binary lgbtq Latin so they will bring to this work would greatly affect. the rights of those individuals and so I just really think that trailer sells is the most Sort of progressive candidate for this position. Alright, thank you very much in spin a really late night. I really appreciate everybody staying here to to hear me out. Alex Zimmerman is Christian Huber. Dirty garbage Rats from animal Animal Farm 30 + year, this has become so I'm going to require five. It's a Dyson fortunately for the special meeting. Thank you very much counseling back show. We know you're not a clear room serso, but unfortunately, I need five. Just register how offended I am by this man coming and speaking to us day after day with insults. So I will listen to you and just for the record you have been on notice one time as required by the rules. So please proceed resume clock. Thank you very much. So I seized it still goes with his clone for 30 year include 6. My6 My Personal Collection. Yes, he's controlling by Progressive Nazi Social Democratic everyday 2200 time to us right now to see children Lake Gonzales bail a constitutional lawyer open public meeting at five times. Speaking about an item that is not on the agenda, which is a violation of city council rules speak to the agenda. The special meeting is for cookie. I wanted you to know that we're going to be removed from the chambers cir so speaks specifically to the Gin on councilman Gonzalez is not on the agenda. So absolutely so you've been warned and I'm listening to every word you say and as soon as you deviate you were going to be immediately removed, please proceed sir. 12 people I give you a very simple question. Is this question exactly. What is a talk about his concert? You know, what is mean? What is forgot about Gonzalez? You're not about what's going once the individual has deviated from items on the agenda. He is needing he does need to be removed at Aspera point of order and ask this gentleman to be removed. And that was the stretch a task. This individual to be removed has to be removed. He's been holed to deviate and be disruptive. So you are excused sir. Please security escort them out. Yes, sir our necks. I think our last two speakers were. I hope we don't lose any of your 11 applicants for sale. I'm signing up for that Kristen Huber and and Shelly speaking to someone else want to speak. Please receive thank you for patience to I'm here tonight because of 10 years and I first met Sheree you're working together and But I was just also like immediately like I can't wait to see this woman 10 years from now and what she's going to become and so it's absolutely awesome to witness her becoming and really quick. I want to express my beliefs and abilities or should I eat for a district for I've lived in District for the past eight years. I've worked in District 4 for 10 years during this time of rain. Right. She's always been fighting a cause she's giving a home to otherwise homeless. She currently has a partition in her living room with someone who'd otherwise be homeless living there. So I think that's awesome that she stands in the solution like that. Otherwise be homeless. Otherwise be unemployable. She's doing for those that couldn't find their voice. She's done this all my struggling with her own burdens. She is a fierce listener and incredibly hard worker is with owls has lived and worked in the neighborhood and has a passion for her community. She can identify problems. She has ability to come up with solutions to problems and execute them. She is the advocate for those that are under resep under-represented. She has a deep empathy for the social minority. She has used her own resources to help. Leading to housing employee living a listening ear even in the face of her own adversity to help others struggle and lift them up and getting them into a place where they are functional members of society. I've seen her do this time and time again over the last 10 years. Please consider Sheree to represent just for she's fiercely committed to social dusted her community and the capability to collaborate with others working as a team to get jobs done. Thank every time I missed anyone and I don't think that I did. Thank you again applicants for your patience. And will that will stand adjourned? Thank you all.", "end_time": 13207.1}]}