{"format": "raw", "annotations": [], "confidence": 0.9270166787382674, "data": [{"start_time": 0, "text": "Good afternoon, everyone and Welcome to our financing neighborhood committee. Today is March 13th, 2019. Glad to have you all here today. So we have a number of items on our agenda first. I want to start by making a clarification on the record from something that came out of last finance a neighborhood committee meeting on February 27th. We heard a report from University of Washington School. The researchers are helping us with healthy food and a food bank Network at our David Jones from our auditors office was here and in that study. I know that you all have this memorized it was presented and listed on our agenda and on page 88 of that report. There was an estimate of the number of people who are experiencing food insecurity, but made more money than would qualify for snap. And the number that we had was 10442. And the number on page 88 should read 13420 and that number didn't change. It was we were identifying how many people were meeting to 300% or the 400% threshold as far as poverty level. So again, if you are reading report page 88 the number for those who qualify or have make too much to qualify for snap should say 13422. We have four items on our budget today are on our agenda today to budget ordinances and one budget resolution that corrects or a men's Summit small errors and coding from the 2019 adopted budget and updating our 2019-2020 for adopted CIP. So we are going to have one of our very favorite Council Central staff members here to go through this and look at changes that we made in our quarter for supplemental budget. We are going to end by having a briefing impossible vote on the hilt Licata ordinance which pertains to Pike Place Market and it's an agreement between the vendors. It'll be a 10-year agreement on what is going to be allowed and who's going to be allowed in the Pike Place Market PDA in the new section. That is actually west of Western. Thank you very much for coming councilmember cuz I also appreciate it. So before we get into this, we have one person signed up for public comment. So I'm going to ask Alex Zimmerman. You're welcome to come out and you'll have 2 minutes. Hide my console get my name Alexandra and I want speak about with agenda number to about Seattle Badgers 20/20 about emission and error. I sent this as budget is totally explain to a couple to couple points. But this make me absolutely sick. Not only me probably a couple hundred thousand people number one give every homeless what is we have probably 12000. What is cost approximately 10000 per year to spend this right now my new for accomplished approximately 200 million dollar spot. It's a big header number to what is I cannot understand? Why we don't stop an Amazon Amazon for example surprises forever since you'll be go down go down 50% of people right now. We don't talk about food bank right now. He talking about people could die because it's poor safety percentage people in Seattle right now. So she have right now only for Amazonian Aristocrat. It's number two number three. I don't understand why we spend a billion dollar salary for as government employee, but my investigation totally understand because now she's assistant computer update don't do nothing so we can keep this 1 billion dollars in his pocket you could doing everything. And I don't understand why you spend, 350 million dollars for support nonprofit organization why we support nonprofit organization y107 unit profit organization four hundred million dollars Austin. See you at the vineyard consideration, but it's all criminal right now all of it. Your friend lightning as I am going to proceed with Council Bill one 19478 and thank you so much allicin for organizing us and also for reading in this next ordinance 12572 for which adopted the 2019 budget including the 2019 to 2024 Capital Improvement program. Sure. I'm Katie's has free from the city budget office office. 1 + 2 + 3 item number to resolution 31869 resolution revising resolution 31849 which endorsed the budget for the city of Seattle for 2020 as well as item. Number three cancel the 1 1 9 4 7 9 and Ordnance and many more dance 12572 for which adopted the 2019 budget. I saw you going to start. Yes, ma'am, please. Thank you. Thank you. This ordinance the council Villa 19478 would primarily reconcile the Departments and the CBS Financial systems as CBO launches the new questica system. Maybe you could slow down a second time and just make sure we're not voting acronym. So if you could that would be so this would be reconciling the budgets that the Department's have with the city budget office's Financial system. And City budget office is launching a new software or Hardware system software system uncle questica, and so this is an opportunity for us to make sure everything Alliance. Thank you. Of the organs would also increase Appropriations for the 2019 budget by 2073000 dollars. This is consistent with the council's actions. These are technical Corrections. So most of that is the temperature million dollars that corrects the council's Greensheet adoption of the Lake City Community Center project. There was a two-million-dollar state grant that was acknowledged in the Greensheet the council adopted when the budget was being prepared and that just didn't make it into the actual legislation that got adopted. So we had the council had authorized this the appropriation. It just didn't make it into the paperwork. So this is a technical Corrections or two million of this. Is that technical correction. That's great and we just want to make sure that since I'm sure councilmember Juarez is listening is that her two million dollars for the Lake City Community Center is there and that it will be used in this at that Capital Money. It was double money and Katie may be able to Listen with councils Greensheet 10881. It just adds the appropriation to the project so that the parks department can spend it as soon as I get that Grant, okay. The balance of the the appropriation increase it which is about $73,000 is the net of two other changes. When is a timer called accounting correction, you may have heard the phrase double appropriation. That's when it's an accounting exercise where money is appropriate to the general fund and then appropriate again out to the apparent appropriate Department, correct? So that was one issue for the arts and culture fund. So that was $75,000 of the correcting that double appropriation. And then there was a $2,000 decrease from the parks and Park District Financial swap. That was and I can Katie may be able to speak to the office. A little bit more but it's really that was a very complicated series of swaps that we're done and in the executive proposed budget in this basically great thing about paperwork right to there is no additional money is coming in from any other source. This is an internal auditing or accounting. Restoration so that what we have now is now correcting the 2019 to 2024 C IP Appropriations are capital project appropriation and also with in the budget control levels to make sure that it's all cleaned up its amending attachment so that it was designed to make sure that the the code for the budget control level is consistent with the code that we have in our financial system so that we can track all the activity that departments are are expending. And did you have anything else you wanted to add? either of you I just have a general question. It seems like this is continuing to happen and and last time the city budget office director. But no but was here. He assured us it wouldn't continue to happen. So I'm a little concerned as to why this continues to be an issue. Part of the problem historically that were hoping this new Financial budgeting system that Lisa mentioned is that we have two different systems. And so things like coding can either can be a mismatch, especially when towards the end of budget season things are moving fast and furious. So having one system were hoping will reconcile things so that there isn't isn't even a possibility of getting two different codes. That system will be if I canceled too. So I thought we we were effectively just using one system. Now. We still have two systems. We will be using it starting in the 2025. So you're you're beginning the conversion correct? And it's not like flip a switch or something that takes some time to move over. So you're continuing to do this. I would I would just also acknowledge the fact that we had three items that we had identified as contrasted to my recollection is in the past we've had dozens of sometimes of things. We were correcting. So the fact that we were down to three struck me as being not yet. Perfect, but I'm moving the right direction. We are trying to think it would be helpful. If we were able to receive an update for my city budget office in terms of the progress made it with a transition again, I continue to be concerned that we keep hearing that it's not going to happen anymore. And then it does so yes the volume of these incidents are significantly less than the last time. We were here having this discussion. I just want to make sure that the system is actually in the migration is healthy because this is we have we have had experiences in the past were there has been what appeared to be technical corrections, but later on turned out to be much more sensitive than that that had real fiscal impact to the city's budget and said he would be helpful just to touch base to see how it's how it's how it's going. Could request anything else with this that you want to speak to okay with then I will move adoption of council Bill 11947 8,000 favor. Say aye aye post. So that will move forward and passed out of committee into will take it up on Monday in front of full Council so next week in resolution. Yes, this is resolution 31869 and this is basically the same thing that the ordinance did but since it's for the endorsed but it's a resolution not an ordinance. So this would substitute new attachment a that has a revised 2020 Appropriations to align with correct, but it's Emory level. So it's going to make two technical changes in the same lines as what we just discussed. One of them is the double budget Budget Inn correction, and the second is 7 $175,000 reduction in the fix-it-first budget summary level again, that was part of the Funding swap in and throwing up those numbers. So this is different than the first three so that we just talked about so you've got the general fund to the art and culture fund this not this one is is different from the 75,000 in the first so you're looking at my stuff report their on at the top of the page there that the table one guess you are right hand call him. I don't want this is for 2020. It's $50,000. That was the same Finance General but one for 2019 ones for 2020 and then with 75,000 fix it first. Is different than these three. It's the same so you'll see the $2,000 funding swap was true. For 2019 and the amount it true that up in 2020 was 175000. production and so how does Parks handle that? Is $175,000 reductions strikes me as much more significant than the 2002. What are they going to do about the swap? So the funding came from was taken out of drawing them from the parks District financial plan to the memo shows how attachment a to the proposed resolution should be modified. This is really These were a number of very minor changes and in most cases renaming the budget summary levels to be consistent with what we're using. Now write anything else not for me know of any concerns from a budget office. So I was given any further questions. I will move I guess we just have to move adoption of resolution 31869 and I understand this next one slightly more complicated because you've got some amendments. Is that correct? Yes, and they are amendments that are not again. A substance of a nature they were just things that we were able to clean up before we introduced legislation and Caleb is your point person on here, but I'll give you a brief overview. Okay on these this this ordinance is basically going to be reconciling adopt a budget with the fourth quarter supplemental for 2018 that you adopted just to make sure that that new information the fourth quarter supplemental budget appropriately as you mentioned there are two technical amendments and neither of them to Verge from council's intent. Give me both of these different than what do I have? Is this the same as okay, but we've got the underlined packet here. So amendment number one is going to substitute attachment a basically a summary of the project allocation changes that were made by the fourth quarter supplemental and then incorporated into the 2019-2020 budget, so we found five technical corrections to make to citylight project allocations. Just again, very small number changes to True up the numbers. Okay, and then the more significant one was that there was a when the council transmitted the CIP project for customer requested tenant Improvement programs in FAS of the mayor had requested 3 million dollars and when supposed to have inquired further as to what that project list was we found it the list wasn't quite that robust and so the council chose to reduce that money to two million dollars. That figure hasn't been reflected yet in in the documents that were transmitted here. So the event of these see there is going to just make sure that we have the 2 million dollar figure. Not the three 3 million dollar man that number one. Yes. Yes. Okay. And so what's making the five City Light small changes? Yes, and then at the end of the f a s change to make sure it's $2000000 which was consistent with what the council adopted. Let's just be clear here. We've got allocation adjustments in the The thousands so are all these numbers in cuz you've got revenue allocation adjusted with thousands. Your meaning. The top line is to going from 3 million to 2 million, correct? And the other ones cuz you're not talking about Broad Street going from 96 million. 270 see what I'm saying? That would be my are okay, but that's what we're talking or so you got going from so the city light issues are in. Those are not in thousands those I'll just get rid of those zeros and then just add zeros to the FAS numbers I could. But just make sure that that that that is correct. Okay, and so you will make a change to this before it comes to the full committee artichoke. I'm am ending this now do we have we've got two amendments? Let me just correct. One thing actually councilmember. This is an effect statement. So the ordinance itself or the amendment itself that you would pass doesn't change doesn't include this table. It has the correct table. It's the big long table that this getting. Change so I will change the effect statement if that is something that gets conveyed to full Council, but I don't believe that goes forward to for counsel. The amendment itself will still be valid today because the amendment does not adopt my stuff table it adopts table. And so all of the the numbers are here if I pulled over maybe you can if I can just ask you to point out on this attachment a where everything is here in your one so I'm clear that the craft. I kind of have kids. Just give me a line number. It should be the third project on the first page customer request attend an improvement program in the 2018 revised column. Point out to me where we are. what is the song I don't know what I what I have what I have here is not the same as For what? It's worth councilmember bags. I am also struggling following conversation and that was in there in the first place. We don't want to go in and correct. There was an error you got it. Okay, so we've got your 3500 here and where does the mm under are the number show up the two is right below it was a 3.5 million but we we corrected it to the two not showing that on my sheet the far right column No, but I'm saying my my numbers aren't the same mine safe 3.5 not 2 million. I don't know. I think this was a printing error on my fault on my part for which I apologize. It says within the system. This is the right one and she doesn't have this. 3.5 tree services Okay. Well, it looks like it's right in the system. Whatever you handed me was incorrect for it. So we've got one Amendment. Yeah, thank you. And we have a second amendment you want to on the Second Amendment just follows up on that and basically correct the CIP project page that corresponds to the FAS change. So it looks like this. Is there anything in here that we need to know that does not appear on this front page the same change? It's just that attachment ordinance was all of the pot CIP project Pages. Tell it what I want to do to go through underlined bill. But before Monday I want would like to have you come into my office. I will dwell completely clean. I will clarified piso. Can I do Amendment 1 an amendment to and then the entire Bill? Okay. So I'm going to force of all move adoption of Amendment 1 which corrects attachment a Any other questions comments? Okay, so we will now move forward on to move adoption of Amendment 1 say I supposed so Amendment 1 is passed amendment to correct attachment B&S to the 2018 Q4 supplemental budget ordinance. So I will move adoption of any further comments. Okay. So now we will move for Council Bill one 19479 as amended those in favor. Say aye aye. So we've got one and two as amended we have gender line bill passed as a mended and then you would come to my office sometime before next Monday, and we'll have something clean and sharp. Thank you for that. I thank you budget office for coming down CBO. We're always happy to see you. Great. All right is still have numbers but it's Pike Place Market. So about 11974 9476 Northern dancer Lane to Pike Place Market authorizing a renewal of the agreement with Pike Place Market preservation and Development Authority commonly known as a hit LeConte agreement for a term of 10 years is a nice. Thank you very much as you are yourself settled in. List, you want to start sure wish Whitson cancel Central staff at the market. Thank you Haley, Mary Beck real executive director the Pike Place Market nice here. So I'm especially happy to have you here for a couple of reasons one. Is it the hill Takata agreement is named after two of my very favorite people Michael Hilt who is past now his widow is a very good friend of mine. And I appreciate that Karen Gates Hill has been long involved in this and of course Nick Licata has been on this Council for close to two decades and we really appreciate all the work that all of you have done. So let's do you want to just jump in I've got some comments here, but I think that we We'll just move in because we all love the market Mary. Congratulations. I know you've been there for about a year-and-a-half now over a year, but it's running. Well, it's beautiful vendors. Thank you so much for you know, everything that you do for our city because it is the number one tourist attraction in our state, but also for those of us who live just a few blocks away. You are a grocery store and everything else. So many. Thanks. So the hilt Licata agreement is an agreement that guides the public development authorities management of the day stall areas and busking at the market this legislation would renew the agreement for 10 more years and would incorporate the marketfront building into the agreement and are the PDA is going to talk about how they came up with the recommendations to include the marketfront building in the process. They went through to come up with this updated agreement appreciate that. It's been since 1983 and originated as a way to ensure the consistency of the rules and regulations for crafts farmers and Busters and the meat for meat the producer tradition of the market. I have been told by I'm actually I need a number of other crafts people as they look at this as their Bill of Rights. So we were really excited to get into this this past year and move forward with it. So this is a review process from 2018 and I won't go through every single thing that we had done every date, but we had in the beginning from May 5th to the end of August. I'm through the whole process. We had three Community meetings large community means we had a couple of smaller meetings also and we had three different deadlines for public comment for both our recommendations and from our community. So there was ample time to give us feedback on the recommendations and to have discussion and to come to agreement. So our original time line was supposed to end on August 30th. And actually we've we organize this to give us the month of September to work through with this was due to your office in October and we thought you know, there might be a hiccup. So I'm what happened is we had a a over zealous councilmember decide at the end of all of it that they wanted to go out and talk to people and and see what they get more ideas and we were like, okay, we'll change the time line till the end of September. There were a few Anonymous comments that came in through the council member that were exactly what we were working through but we hadn't presented yet. And so we got through that there wasn't anything new and on September 10th. We presented the redline version which we promise to do to our community so they could see the red line version what was changed and what was not to our community and we had a community meeting on that and then we presented the final version to our Council on September 27th, and it was voted unanimously. Great. Congratulations. Thank you. I know of much that is unanimously recommended because we've got a lot of people a lot of ideas. Yes, we do. Thank you though, but actually makes the market great. I love your smile progression of recommendations the original and may we had 9 after four of the public meetings for presentations that was adding the others in September. We got down to one recommendation, which we are here today to talk about. So it was mostly all about the marketfront as you probably know our new market friend that opened in June of 2017 the first step in the Waterfront and in our Market front, we have 40 a low income apartments seven-letter artist Studios and apartments. We also have 300 parking spaces and the the main part of the mark of Fred has four places for retail, but the big Pavilion is for the south pavilion is for priority day stall which is farms and crafts and Busters and the north part is I usually we're using it with our crafts, but we is also there in case we want to do events or demonstrations or something like that. So it is spectacular. It is a beautiful. I've been there a numerable times for various events. Most recently when the viaduct was closed. It could not have been more fun. I think 3/4 of the city was out there and I'm just I really congratulate you both on the design of the operation the activities and it's it's going really well. Thank you. We had some great for my programming though. Just we wanted to show our community our Council and your Council here that it was as though the one change that we may or actually was an addition not a change. It was a constant theme from 2015 to 2017 when they were talking about the marketfront. So the main South Pavilion primary use for day stall and crafts priority option for special events in the evening such as fundraisers and private events. We've done we did a few when it first opened. But what really we use and then the south pavilion without with cramps after hours is pretty much for the foundation when they do their sunsets. Or something that they want to set up their butt during the day. It's it's 4 days to all the North Pavilion was deemed for Community activation seasonal events crafts and food demonstrations local producers in private event rentals. We have done mostly crafts and food demonstrations out there involving the craft Community which has been will show you some pictures in a minute which has been very very amazing and supportive to to show their demonstrations and show off their skills. So here's some recent programs and events in the Pavilion the first big one that you see with the lady in the red hat. That was our holiday market that we had at Christmas in September and I'm not sure it was October but we had three called painters Potter's and printers but we had our painters there demonstrating painting. We had our Potter's they're doing Pottery obviously in our printers doing printing all of these are around showing off and building Community with our days doll, but showing off what they can do to our local community and we have been Doings if you see the next picture that is our Harvest / Halloween where we're actually pressing cider there. So we do them through different themes. Our biggest one right now. Is Magic in the market and a lot of that started with our craft community. The comments in the public, things that we went through and we heard continuously when we were doing our working through the hilt Licata. This year is the stability of the hilt Licata agreement which we all agree on that. It needs to be there a seniority which is all based on which we heard very loud and clear and it stays their appreciation for the programming featuring or arts and crafts community and that because it was about the marketfront Pavilion that any use the marketfront Pavilion should be consistent compatible and non-competitive with existing principles and operations of the Pike Place Market. We also have concerns about capacity. So we keep our eye on that too. Describe what you mean by that the idea of capacity is the number of people who are in there at the same time number Avenger number two or number of events. We need to make sure that what the market is we need to continue to do that. So we don't come to do we don't go off base and something about capacity and getting different type of groups there. Whatever that might not in a jail with what we're doing there. And so this is the conclusion and it was one we renew the hill ricotta for another 10 years, but insert a new sentence under the use of Market space sections three that reads the marketfront Pavilion. She'll be used for programs in advance which further the purposes of the Pike Place Market pdh a charter the primary use of the south pavilion will be as craft priority date day tables and that's where we are and I would like to actually think our community and our staff that works really hard together to get to the point and thank you for having us hear your involvement protesting it. But anyway, you like it now. Why did you not like it then well, Why I like it now, I'll focus on that first. The process has been very inclusive this time. There's been a from the beginning of this particular process of the last year. The PDA has made it clear that they want our input. They are listening to the recommendations that we make and they try to fold those in and as the charts their demonstrated there were initially 9 changes proposed eventually there was one and that was based on the fact that there was feedback from within the community to say. Well we want stability in this way or we don't we see this as maybe being problematic. So I think for a lot of our community the avocado is it as far as Mary said represents a Bill of Rights the market Charters our Constitution and send it along with the baseball rules, but that's as our Bill of Rights and So having this and feeling like it's a stable and reliable doesn't change every 10 years is something I think helps people not only think about how the market operates and how their business can can be there and be consistent but just how things move in the future in the end giving more status to the to the agreement over time to in this is I think we're in 235 years now and so, you know, that's that's a lot of longevity. Anyway, it was a good process this year and we felt like we were listen to and there was a good two-way street to all of that and there were plenty of times to express ourselves in both public meetings in person in writing and to meet with both PDA and with our Council so, you know, that's very thorough and that's appreciated. Appreciate it. Thank you for that. Just glad to be here working as you've done in an inclusive way. It shows once again, it may go slower on the front end but it goes faster on the tail end when people like Helio step forward and say we were part of the process when we were heard. Well done Kenny to have anything else you'd like to add on this and she came in and grab it immediately. And I remember the phone call is what is this and until we work through the process and it was a joy working with her. Thank you for that answer, It's good. It's the best move can spare one 19476 all those in favor. Say aye I thank you for that. The hill plicata agreement renewal for 2019 is passed out of committee. It will go to our full committee on Monday or full Council and I think you can anticipate that it will go through with flying colors if you want to come. You're welcome if you don't then you did. So thanks for being here. Thank you so much. It was great to have you anything else. All right. Well Allison, thank you very much for organizing us anything else counselor with adults and bright. Thank you. This meeting is adjourned.", "end_time": 2275.8}]}