{"format": "raw", "annotations": [], "confidence": 0.9500363940343807, "data": [{"start_time": 0, "text": "Good morning. Today is Wednesday, April 24th. 2018 and it is 9:32 a.m. This is a regularly scheduled meeting of a gender Equity safe communities new Americans and education committee on Council Road and I17 chair of this committee. Join me at the table are my colleagues councilmember three symbols and our newest addition to the Seattle City council council member able to thank you for being with us. This is your first Committee hearing. Yes. We're going to make it really hard for you. Thank you for being here really excited that have you join us as a member of this committee and looking forward to your contributions to the full city council, but of course to the committee as well, you have quickly ascended to becoming the vice-chair of this committee know you're the best you're better watch out. There are five items on today's agenda for a vote on two appointments and one appointment to the consideration of those appointments will hear a report from the office of police accountability as they present their 2018 annual report that is simply for a briefing and a discussion. Nothing to go down there. We we will hear from the Seattle information technology department the Seattle Police Department and the public defender's Association. Excuse me about the law enforcement assisted diversion program and in particular the response to Sly 382 A1A which is related to a technology need of the lead Department. Excuse me, believe program again, that one is simply for briefing and discussion on that particular item before we continue we will begin our meeting with public, as usual. We are thankful for those members of the public who join us at for public comment again, as a reminder public, is an opportunity for members of the public to provide the members of this committee at up to two minutes of their public testimony on an item on the agenda. This is not unfortunately an opportunity or a venue where we engage in conversation as members of the committee with members who are giving public testimony. It is simply an opportunity for us to listen to How to show up and offered a testimony each individual have up to two minutes to provide us with their at public testimony at the end of the two minutes the timer will turn from green to red and the microphone will be turned off and I'll ask you to kindly wrap your comments up. So the one and only person we have signed up for public, today is David Haynes is your hands. Good morning. Good morning, 2012 police reform was sabotaged by attorney general now mayor durkan when she added and unconstitutional sentence exempting drug pushers from jail this resulted in the cops refusing to go after in jail low-life criminals, which resulted in a proliferation of chunky thieves. Safe communities does it mean exempting low-level drug pushers safe communities does it mean race is cowards in Seattle Police Department refusing to go after nefarious junkie thieves in their crack meth heroin pushers and enablers what conducting a war on the poor safe communities doesn't mean giving millions of dollars to a non-profit who only helps drug pushers including illegal aliens Latinos and Africans conducting an uncivil war on innocent community and they get to stay out of jail. The city council needs to Wisin up to the facts Seattle is dying of seat of societal implosion due to trees in his policies and unconstitutional agenda to prioritize housing and service for more creepy predatory low-level drug pushers and the junkie thieves who are not nonstop getting away with raping homeless white women forsaken to the streets denied housing do the racist incompetence within the social welfare industry. I still have admiration for Lisa daugaard in her efforts to help us out during WTO 99. The thing is the public defender should focus on reforming the prisons cruel and unusual punishments starting at the written Justice Center's above-ground dungeons. Seattle Council must realize there is no police accountability when the community police commission who is supposed to be independent and maintain the Integrity of the police department is the same person getting billions of dollars helping evil as innocent suffer. Okay. Is there anyone else in Chambers who wanted to provide us with a poet testimony but didn't have an opportunity to sign up. See no one we will go ahead and close out the. Of public comment and we will begin the items of business on our agenda. If you are here to present to the committee on agenda items 1333 Witcher Community police commission appointments and reappointment eyelid invite you to join us at the table and Roxana are clerk will read agenda items 133 into the record. Adam Adam the items one through three appointments 1309 through 1311 appointments of Asha Mohamed as member Seattle Community police commission for a term to December 31st, 2019 R&B Goodman as member Seattle Community police commission for a term to December 31 20/20 and reappointment of Harriett Walden as member Seattle Community police commission for a term to December 31st 2021 for breathing discussion impossible. Vote. Good morning to you all. Thank you so much for being with us at the table today. So we will go ahead and do a quick round of introductions just your first and last name and any affiliation it should you wish to share it and then we will hand it over to walk us through a presentation. Good morning, Aaron Goodman. I'm the executive director of the SoDo business Improvement area. Good morning. Good morning. My name is Asha Mohamed exacted are Somali Youth and Family Club. Thank you. Good morning. Please take this morning to present the mayor's nominees to the community police commission. Should I just do all three at the same time? I think that's nice so are served as the executive director of DeSoto of business Improvement area that representing business interests at the heart of Seattle's industrial Community since its founding in 2014 and her role includes cultivating collaborations collaborative Partnerships between businesses a property owner is elected officials the city of Seattle and Community organizations, Aaron currently serves as the chair of the South Precinct advisory Council and is focused on Building Bridges between the South Precinct and the communities they serve and helping to Create a cohesive Community voice. I am excited to have Erin agreed to be part of the community police commission. I think we'll bring a valuable perspective from the community on that. The second or nomination is also a bee Muhammad Muhammad. Muhammad is small Youth and Family Club Asha is in Seattle for 20 years and is just a regular fixture in the community and has built a multi-ethnic multicultural and multilingual spaces and she's a fierce advocate for Reproductive Justice and then a life lgbtq rights what you may not know is that a dog has mom is police officer and also Asha being the mother of a black sons and the wife black man in Black man has a hazard that unique perspective of being a certified in that space where there are challenges working with law enforcement and will bring that incredible voice to the community police commission our final reappointment and she's not here but needs no introduction is Reverend Harriett Walden Walden has been Community police commission ever since its founding and and we are pleased to renominate her to continue to serve on the police commission. Great. Thank you so much. I really appreciate that presentation and just for the viewing public and for the benefit of cast member at the chetco, usually with reappointment the nominees for being reappointed to Be present at the community table for reappointment but our two new appointees up for consideration are with us. And this is an opportunity for us to ask him questions about both their interest and and intense in terms of what they would like to accomplish as a member of the community police commission. So so I'll go ahead and start the questions and then if there are any fall left handed over to my colleagues to be able to ask them of those follow up. So thank you both for your willingness to be here with us this morning. And then of course for your willingness to participate on the community police commission, which has a really vital important part of our overall efforts to ensure that the voices of a diverse set of community members and representatives are present within the accountability system as a whole which is increasingly becoming more civilianized. So I would like to just provide Opportunity to introduce yourselves to us in your own words and to fracture with us a little bit about why you are interested in serving on the community police commission. And if you have a sense of what you'd like to work as well. So are you well, I am a South Seattle native. I've grown up in Seattle and now have the opportunity to represent a South Seattle neighborhood and the process that I've seen in growing up as a fracturing between relationships and in Soto Public Safety is our number one concern we discuss this on numerous occasions, and I truly believe in the mission of the community police commission that community and SPD aligned towards common goals and that we can have good strong constitutional policing that's also ensuring Public Safety. So when the opportunity came to be a part of this commission and to provide of business voice and understanding of what the businesses that employ the people that are in the South Precinct and the share that in this conversation, it seems like an important thing to do. Coming into this this commission is going to be very different when we sit down and when it's you know, start sits down in May and so understanding the roles of what is worked on but I think that building the relationship building so that we can have a good strong police force that is aligned with Community Values has but I'd like to be working on any other any questions for Miss Goodman before we move on or would you like to why don't we go through the full presentation and then we'll do some follow-up questions. So why you want to be a police commission because I was really mad as I can remember was a couple months ago. I just received this random email from from the CPC Community Police Commission in was regarding about the Police contract negotiation. I consider myself to be a pretty intelligent person and really understand the ins-and-outs of system and how they are. But in that meeting it felt that was my interpretation. There were elders and things were just happening just fast. It was no integration of we were not part of the process and when I say we are talking about people that English is not their first language and so I decided to do something about it. That's why I'm here. What I would like to accomplish is actually to be part of the conversation at a community level on most of the time whenever there is a relationship with SPD or anything is when a tragedy happens when conflict is happening or we have these photo-ops where elected official day, and it's like yeah, you know the usual folks, but for me, I think it's more about the Integrity. I also hear that to you know, for most immigrants refugees experience has been the police were corrupt. Actually. My mother was a police officer her brother was murdered by a police officer music Still chose to become a police officer because she truly believes that people that don't have the means needed protection and needed to be served and I think that to my core. And sell anyone that is wearing a uniform is not going to see me just as I wanna but we do part of a community. And making sure that I provide that boo bernis to take the police to the community in the community to the police. So that's what I'm trying to achieve great. Thank you so much. I had an opportunity to work with both of you in the past. I think the last time we really had an opportunity to work together was as members of the search committee for the for the new chief of police and of course made it up with the chief Carmen fast. So if had an opportunity to really see how both of you at work in a larger group setting and appreciate that the balance that I think you bring into conversations around sort of recognizing how to send her the the priorities are round equity in the importance of constitutional policing and making sure that when officers do violate policy that that we have the best systems in place to make sure that those officers are held accountable, but I think both of you also have expressed. A perspective around making sure that we're also supporting law enforcement that is doing a good job and making sure that we are sharing those stories within Community. Is it is it is it brighter set of community to make sure that there is a good fluidity in terms of information sharing and that we continue to work on building those relationships. So I've had a lot of chance to work with these two fine nominees. And of course, we've all read their materials, but wanted to open up the opportunity for my colleagues to ask any full of questions. Thank you. Welcome a good to see you both. Don't ask you the same question that we asked the table at last time. We were doing the nomination process. I'd love to hear more about what accountability to you and whose are accountable to Accountability is when your words match your actions in a transparent way and that holds true whether it's for an individual or for an organization in my role in my life. I'm accountable to my family. I'm accountable to my community and I'm accountable to the people of Soto and Soto is so unique Beast. We don't have residents. So are elected representation is very split and so to some respects I serve and not elected as this sort of coalescing voice for the people who are everyday they're working who are not big business who are not we have that too. I'm not but for the majority of the folks who don't have time to deal with navigating government and and all of that. That's why I sit here today is to amplify their voices. I think accountability personally for me it sympathy the negative or positive the ability to measure what is the impact that has been done on the intentionality of the process. And in that intentionality what impact has had good or bad and taking accountability for that? Thank you, Mandy fellow. Absolutely. Okay, thank you so much for that. It's kind of a hard question. And I think that really speaks to both of you your answers and the previous panels as well. You don't think that the CPC is going to be filled with incredible body on to ensure that we have both accountability to our elect our our our elected individuals as who are trying to ensure that there's accountability of a community and accountability for officers to meet our new requirements you mentioned soda and we've had a chance to hear directly from you have sent a lot of time instead of these last few days going to Home Depot as we're trying to get ready for our first four times in one day in fact, and so for the last two months or so happy to come down and chat with you more but you mentioned soda specifically. Do you mind elaborating just a little bit more with Community specifically in Seattle. Do you can see yourself held accountable to I think that's actually why I really want this position because I I think there is a full falsehood of saying that I will be held accountable by a community. I think I am held accountable by the Sea PCB board of the the body that I am part of that if we want to talk about it's a necessity or groups that I could tap into the Staffing and Community particularly the Somali American Community the canyon Community I speak about seven languages. I'm very confident in for but I'm proud of all those Community you're such an underachiever. And this whole culture of bragging is really uncomfortable and my community is the folks that are experiencing homelessness. That's my community and funding off. My office is in Soto. Works Newark Center any other questions? Okay. Just want to say thank you both for appreciate it. Thank you for your willingness to sir. Thank you. So one of the questions that were interested in is how has your previous worked informed the type of work or your approach to work on that you would pursue on the CPC. So for you with the Somali Youth and Family Club, how has been informed the change you hope to make it to CPC and then obviously the work that you've done for the Soto Bia be interested in hearing what you have learned in those experiences and how you hope to bring some of that the CDC. I just became days I stood there at about 4 months ago will like to talk about Lyft experience when I came to this country. I had a nationality as I lived in the United States. I became a color than my face became another label. So I carry a lot of labels in that sense and it was quite a learning curve to carry all of those label and be a person at the same time. But what informs my work is my Lyft experience. I was hired at the King County as a project manager for the first three months. The security guard was carting me to show that I actually worked in the building on in my neighborhood in West Seattle the Target that I ghost that I go to every now and then, you know, the police will actually pull over and just stick a random track at my place or whatever. So those are the things that inform me. So when I have community members or people that are experiencing trauma, you know interacting with the least I can relate to not as severe as a person that is experiencing homelessness. Not a severe someone that is having a mental episode. Not a severe somebody that is experiencing domestic violence notice severe someone that is undocumented themselves that they need help not too bad accident, but I can relate. Akasha So in my rolling Soto I am often the first call and so that means that I am on the ground with a business owner when they are dealing with a crisis when their employees and there have been a number of the we've worked on even in the last year of a woman who was mauled by a dog and love that. So we work closely with the businesses, but we also work closely with SPD and so I bring the opportunity to share the inside of not the police but of David and Mark and Kevin and how we work together to help the people that are in our neighborhoods, but then also understand that as we see each other both sides as human beings and people the entire is stronger and so I'm coming from so do I have a pretty much daily interaction with SPD? While I am very conscious of the way I look and present my family is different than that. And we so I have the experience through a window into another experience while so I'll bring that as well. It's okay. I really want to thank you both for being with us this morning again. I really appreciate your willingness to share with a little bit more about yourself personally and some of the experiences. I think you'll bring here and I think you know, when we look at the community police commission, it's important for us to make sure that we are true to what we're trying to accomplish their which is having a really diverse set of voices to make sure that again at the root of it. Everybody understands that first and foremost. The first priority is to maintain Fidelity to the consent decree and the obligations of the CPC to the components of the consent decree that are that are directly related to making sure that there is there is an intentional deliberate intent to reduce the use of force particularly as it relates to use of force on communities of color and so obviously there's She's related to buy as pleasing as well. Those are components that I think you need to continue to drive a community police commission, but there's a whole host of other and getting to a larger scale. There are other areas of really important interests that still are very important towards continuing to build public trust in law enforcement. And of course that includes the discipline system, which we spend a lot of time talking about but there are also other components that help to promote and build I will trust in that includes in my mind issues related to Public Safety how the police department and gauges in response to the most vulnerable members of our community including people experiencing homelessness time. And and I think that those are all perspectives that both of you are going to bring to this particular room that are really important. I know there are several members of the community police commission. I mean it going back to its Inception. They've been really focused on on not forgetting about the how Public Safety and the delivery of constitutional Public Safety is a fundamental building block to to continuing to build and restore trust between communities and and the police I really appreciate your willingness to serve it is going to be a lot of time and I hope that you all are ready to spend all that time. I will tell you from from my perspective and I think that the CBC with Echo this is that they're very interested and having a full commission because of the work is so important and so critical and it and we're at a really important juncture, but that also means showing up at 110% and making sure that that you're there to engage fully with the work of the CPC cuz it is so important to the city so really appreciate your all's Molina's to sign up for the Any other comments before I close? All right, we are going to move to advance fees appointment as I find the words that I'm supposed to say. All right. So I move the committee recommend the city council confirm appointments 1309 through 1311 to the Seattle Community police commission. Is there any news? Okay, the committee recommends that the city council confirm appointment 1309 at 3:13 eleven with a with a unanimous vote. The appointments will be the appointments and reappointment will be considered by the council at its meeting on Monday April 29th at 2 p.m. You are not required to attend full Council on the 29th of April. Of course, you're always welcome to join us. So I suspect that it will. Be fine. Thank you both for joining us. And thank you Debbie mayor for being with us as well. two weeks in a row Alright, so we are going to move into agenda item for which is a report from the office of police accountability on their 2018 annual reports. I'm going to ask that those folks join us at the table and our clerk Roxana is going to read this item into the record agenda item for office of police accountability 2018 annual report for briefing in discussion. Okay, so I think there's a pre do you all have a presentation? There it is. We will go ahead and begin as we usually do with a round of introductions. So tell us who you are and then Andrew you want to hear going to kick us off director of The Office of police accountability Management systems analyst thank you all so much for being with us and director. Myerberg. You've done a fantastic job of hiring a hit all of the most amazing women in the cities. Thank you for having us here. And hopefully you had a chance to read the report or what we're going to do today is to go through some of what we think or feel or the high points. Obviously any questions you have only to answer anything and please interrupt us at any time before I get going. I just wanted to ask you a question, okay? Questions are on emails and I've had to reach out to you and just ask about the process and timeline immediately sent us an email box truck all the issues and the timelines Associated but as our community gets used to having a police accountability office and I'm really excited. They're both reaching out to you and the response in which you have provided to our office at him up on that. You know, one of the things we've done in response to some of those emails is now we've instituted a 48-hour responsible. So I mean for us, you know how to respond as quickly as we can but just for Staffing, you know, like I said to you we have 500 investigations a year, so it's hard to have proactive updates. But I think now what I passed the Sergeant's and the others to do in the office as if some is emailing us really need to get back to them within 48 Hours, even if just to say we're moving forward and we have no updates. I think that's the right thing to do. So, I appreciate that and of course. So I just wanted to say whole thing before we get going know from our perspective. This has been a really significant year for us at OPA. We've been focused on building both internal and external trust and confidence and Men talked about this a little bit later in the presentation. And I think what that's been looking like is is understanding that there's a lot of confusion about the work that we do understanding that, you know, a lot of people don't trust that the accountability system works and when I see a lot of people I mean both police officers themselves and committee members, I think we hear a lot. I've never gone to roll calls in a ride-along send spoken to as many options as I can I think will be seen as historically they don't believe that okay Works, they believe that it's by us just like I think sometimes in the people in the community feel like you know, how good is ever work for us as part of a system. So we really been focused on trying to break down some of those walls and to build up those trust levels and again animal talk about what we've been practically doing cuz I know that sounds good. But we have to try to do something. So I will talk a little bit about that later. We've also been trying to improve literally everything that we do from top to bottom. This report is really good example, you know, I think we look at this report is is certainly the best report that we've done since in and I have been an Opa and I think probably one of the best reports that we've done at OPA it's just our dad is cleaner and ethics ordinance to which is having his look at data and different ways. It's been really helpful. So I think this is a really good report it to to show what we're doing and how we're doing it. So and it again that's great work Brian Monique in an ant's heart to say thank you to staff. You know, as you all know where a hybrid organization we have both civilian staff and sworn staff here. We have civilians, but really we're a team and we all work together as part of the ordinance were required to Signal a nice all of our supervisors and I think it was 18 months from effective date. The ordinance the one we had to do it and that's coming up. So I May 31st. We will certainly Nuys finally all of our supervisors. It'll be Bittersweet. You know, I think the two supervisors we have Yvonne Underwood use are acting captain and Tom opens. Our Lieutenant have been really wonderful components and parts of okay. I'm so it can be sad to say goodbye to them. But but it's a change that's coming in and we're excited for the future. So without further Ado show the first slide that we have it shows that our complaints are down 11% from last year to this year. So when we say complaints it's a term of art will be mean is an actual allegation of misconduct on the part of a police officer. So we receive other things like, you know, people make contact us looking for an arrest report or they may contact us saying do you know I want, you know to give accommodation to an officer. We logged as a contact, but it's not a complaint against an officer. So looking at Act Complaints we're down about you know about a hundred and change from 2017. I don't know that there's any statistical validity or any Merit to that I think, you know our complaints to ebb and flow, but you know, just what we're seeing this year. What we see our that about 55% come for the external sources meaning the community and this really can be anyone out. There could be a Committee Member could also be you know, the mayor's office other City agencies other law enforcement agencies, the city's customer service bureau, but that's 55% 45% which is a really interesting statistic are from SPD. So internal referrals and this is up from last year last year. We use 33% So we're up 12% which is pretty significant U2 a tribute why there was such an increase you set a 12% increase have a sense as to why I mean that is a significant increase. I mean that the other thing is we don't know about reporting an STD. If you see something say something in SPD, you know this pretty strict requirements for reporting misconduct, but that wouldn't necessarily explain the 12% increase the policies those policies haven't necessarily changed. So we don't know but also the data is not perfectly clean going past going back past 2017. So I don't know that we would know if 2016 for example, it was closer to 45% Really. All we have is the 2017 data to compare to make sense the data point around a 45%. 45% of complaints initiated by or forwarded from the Seattle Police Department to Opa. How does that compare to pre consent decree? That's that's a good point. We don't know the data but it's not as clean but in general it shows that it's an increased significantly with the consent decree because of the consent decrees requirements that and then and if requirements at more than all misconduct be forwarded to Opa not just you and I think so, that's a good point. I mean, I think what we saw suppose consent decree really what happened was everything flipped were all misconduct that reported to Opa. So things that were handled with line investigations in the past were no longer handled with line investigations in line investigations me just means that the chain of command that supervisors at the officers were doing the work out the case in the investigation of the case because it's easy for us to really focus on that just technical pieces around like the you know, the statistics in percentage. From you based on collectively from all of the work that you've been doing in this phase what this statistic is actually telling us. What is this matter? Yeah, I think it matters. It's a good question. You know what we're going to talk about a little bit later calculator or certificates later is that 72% of the cases that we actually investigated are these 45% if that makes sense? So outside number of our investigations come from those referral? You know, I don't I don't know. I don't really know what it means. I think what it means is that Sergeant's and supervisors are taking their responsibilities seriously under policy, right? And sometimes I think that they may be taking it too seriously and what I mean by that is that there may be some over referrals in that there are matters that could have been handled by the chain of command that were sent to Opa. We're maybe they should have been handled at the end. I don't know that is a positive or negative number. I think certainly it is good that all biosol force all search and seizure violations. All serious misconduct is being referred to Opa, but but I don't know that there's a qualitative, you know conclusion that I can reach as as far as this number goes. I think it's important for the public to know that this many complaints are being referred. I think off in the public may think that you know misconduct is happening in the field is is being hidden or or kept their when in fact the opposite is true and they're referring A lot of misconduct or potential policy violations that may not even be policy violations to Opa. So it's I think it's a good thing for the public to understand that there is quite a system of accountability here. There's a page on in the reports page 10 of the report that breaks down the demographics of the complainants and it's a little unclear to me and I and I didn't admittedly did not read the footnote. So perhaps there is exclamation in the footnotes that I have missed. But in that figure 5 that talks about the complainant is a percent of total known races were all complaints. I'm assuming that that includes both internal and external complainants. Yes, that's what it means Opa is mandated for the ordinance in hand Seattle municipal code to report on the voluntarily provided races that are complaining. So that's why we present two different figures. So on page 10, it's showing all known races of complainants weather has received internally, which would be forwarded through rsvd supervisors or if it's external AC like web Complaint Form phone calls in office complaints. So so in tracking the information about the complainants, do you also have some more granular detail that separates the internal from the external? As far as the races of complaining of police force and so I'm I am curious about what the racial distribution of the complainants looks like. When we segregate the internal complaints from the complaints that we're receiving from the public. Cedar Point, your point is you've included police officers in this demographic data point I want to see this datapoint songs police officers or anybody else's internal so complaints that originated internally. So if somebody is complaining during the rest of I mean any allegation biosource, we are seeing that the complaints the complainant races that are voluntarily provided are more likely to be white weather if they're doing it online. So external complaints. There's a higher proportion of white complainants as opposed to internal complaints that are forwarded through SPD. It's 36% African American Compared to externally it was 18% Obviously that you've identified is is why I mean, so I think that's something we can do is to look at the Y, you know, we this was this was a two charts and slides that we discussed it at length internally and it's certainly interesting. I mean if you look at figure 5, I mean the the percentage or black and African-American is significantly higher than in the population in Seattle in the question is we don't really know the why but certainly we can look at it. And if this is something that you're interested and we can get back to you with the with the what is occurring is it would be much more effective in educating members of communities that have historically experienced a more negative interaction. Enforcement how to actually Lodge a complaint that's a good result. But if there is some other kind of disproportionality that we're not seeing because we're not asking the questions about the why why are we seeing this sort of demographic split? I think it would be important for Opa to I to be asking those questions to identify whether this is a result of better education and and and a better access to the resources people need to know when that there could be a violation and where they go when there is one versus well, we're seeing an uptick in complaints from this particular demographic because they're being subjected to more Miss more alleged misconduct. That's definitely something that's hard to to prove to her or to draw a concrete conclusion, but it's something we can dig into a little further perhaps In a Special Report or some sort of issue analysis. I have a high level of confidence in each of your intellect. So I trust you'll be able to Rigorous policy analysis around my question cuz I apologize. Thank you so much in the frame that you heat up a moment to go around the number of complaints coming from were originating within SPD the comment that some of these complaints potentially could have been dealt with a by the chain of command does that we extrapolated what that means is that there hasn't been enough training or two that maybe there's not enough trust. Can you tell us more about yourself? One thing we working on it as far as Innovation goes and building internal accountability is to the starting power supervised to start empowering supervisors to handle minor misconduct SPD right now is working with the you know, working with the doj in the modern team on reworking some of the policies to make clear that supervisors can handle my name is contacting what I mean by my name is Khan. It's it's not use of force. It's not biased but it's you know, whenever we stop someone on the street, right we need to do is call to Terry template right? It's just a document that talks through the basis for the stop the weather. You know, what you saw what they were wearing and so on so forth Frank, sometimes we have officers that forget to do them, right those cases have been sent to Opa, right? So we're doing a full investigation on whether or not someone to the appropriate paperwork from my perspective at OPA. And certainly I think this perspective is shared, you know across the accountability spectrum is that those matters are better left for a supervisor. Supervisor can deal with it at day one to talk to the officer to counsel the officer to say remember you need to do this to teach Mentor Council supposed to discipline. We've seen that can be more effective and I think that with the right training and with the rights support from both Opa in the system that that could be a huge benefit resource wise to us putting us focus on more serious cases, but while maintaining accountability world still have eyes on all these things certainly will you know, all these cheetah cam reviews were going to see in the back end and Inspector General will be auditing them as well. We've asked them to make a part of their work plan. So but I think our system needs to move in my opinion towards that ye cannot be the crutch for the cat for the police department have to own their own assistant have to own their own accountability supervisors have to be responsible for their people. Certainly for this. My name is Khan. So, I guess that's what I'm what I'm saying is I don't think it's a lack of training and I think the the sergeants are doing exactly what they're trying to do, right? They're sending everything to us. What we were saying to them is that you know, let's train you to think about a little bit differently, right? Let's train you to to teach better the council better to to be more critical about evaluating what was actually alleged to work things up more in your reviews before you sent it to us. Like don't just send things to Opa and expect that we're going to do your work for you you do the work will help you, you know, what will support you will offer you advice on how I can do it better but they need to do the work and I wanted to sound like we're advocating responsibility. We're not we're still coming investigating a high number of cases and certainly every allegation serious misconduct that we get we're going to look at right but one of the things we've seen in and spending the news, you know is you know officer morale and officer. Resilience, you know, it is a fact that there is a high number of opa complaints right now. It's a fact and I think some of it is an unintended consequence of of the really strict report, right? You know, everybody has every Force, you know is reported. We have to buy our ordinance by operating manual to investigate then writes what it ends up doing is you have officers that can receive 10 complaints in a 12 or 15 month. It's a lot to take these cases very seriously ways on them. You know, they they they still let you know what with the balance we're trying to figure out how to do it better in and that's what I was saying about Innovation, right like the system like we have one of the best systems in the country. Like I firmly believe that right, but it can be better and I think some of the nuances what is what we're trying to work out now and I think the supervisor misconduct is a big one for us and that'll be a huge piece of a 2019 work. You know, what animal talk about a little later is that we we did about How many hours is 300 hours of charge in training this year where you know I went to and with and without errors went and met with all the Sergeant's to talk them through exactly. This is it this is what the resource we can be for you it okay. If this is how we can support you this how we can make you better and I think they've seen that it has made them better. So I hope that answers your slides to go through so I'll quickly run through some of these other side. So here this is interesting from our perspective because it shows that and I think this is what we knew Anatole but it shows that officers between 1 to 4 years or officers with Lisa class experience had the most complaints and we think this is due to a couple reasons first Dave just gotten off of their field training and probationary periods that are there alone. Usually they're working High action ships like a third watch West there watch Easter watch North so they just seem or they're more active. So that's they get more. Plaints what we saw in public in 2/3 what they called watches First Watch is basically from 4 a.m. Until around 11. The next shift is from 11 to 7 or 11 to 8 in the Nexus from 8 to 4 2/3 watches from 8 p.m. To 4 a.m. In and it's probably not a surprise that a lot of the a lot of use-of-force Pius V call-outs all of her fourth mitigation team Call Saul occur during that. Of time what we've also seen though. I don't remember last year. We saw that there was a peach from your 729. There's just blip for officers receiving more complaints and I think what we realize in this is I think good work on Laurens part was that it also correlates the hiring so from that 70 to nine year. Now 8 to 10, see if followed Is that we had a hiring surge at a speedy simerly this this huge Peak here from around here to correlates to a 2016 hiring Peak. So I think we've tracked it down which now makes sense, but we didn't know quite why that was the case before. So again, probably not a surprise. This is where we're seeing the most complaints originating from, you know, West and North Precinct to get the highest West I think because of how dense it is and how many people are in and out of that area on any given day North just because of sheer size. So and if you look in the downtown core, that's really the the the highest concentration of our complaints. The most common allegations of misconduct in this is pretty consistent from year to year are Force bias and professionalism force and bias or mandatory reports and we were talking to this little bit earlier sergeants and supervisor and frankly even officers have to report to supervisor and then to Opa any allegation of excessive force and bites policing professionalism is interesting because it's much more of a subjective allegation. I would say in a goalie professionalism is one that without Opa generally ads when we review the case if we were view video we might see things that we think we're inappropriate. And those are things like rudeness or rudeness things said that we think under minded trust in the department those types of things. So cases that we classify / investigation so our investigations increased 10% from 2017 to 2018. So last year, we investigated 519 cases, which was I think by far the highest amount that we've investigated in recent years. I think this is largely attributed to that. We're classified plus cases for contact logs. So contact logs when we get a complaint and we close it out really without any further action. So it's either, you know, we don't think there's a plausible allegation misconduct or there's some other reason why we're not going to conduct a full investigation when I joined Opa. This was a big criticism of both and Levinson and up Tito Rodriguez both. Okay Auditors, they felt that okay with Miss using contact logs and that they were over using it. So that was a shift that I put in right when I started was that we stopped doing that. So I think what you've seen though is that it's it's ended up in more investigations, which I don't think is negative. I think it's a positive and the next highest level. So after contact log, which is still fairly High. The next size is a supervisor action where we send the case back to the supervisors because it's a minor performance issue and say please address this matter performance Edition issue, but we don't do a full investigation. But we go back real quick. And sorry and what else like number for the 72% So are those investigations 72% came from those internal SPG referral scam, but that's not surprising at the same time because the most serious allegations are going to come through those supervisor interview that it's for the supervisor. So it's not it's actually not that surprising that that's the case for my work on that statistic around mediation in 7 that's under the old system. Not the new system damn thing our meeting until we met with your staff. We've met with the CDC and really we could have met with whoever we can meet with to try to make this better. If you want to just get you a quick overview of what we're trying to do. To strengthen and institutionalized the current mediation program. So we've done a bit of research on best practices. We've done an assessment of opioids program of the last two years and we've graded the program so that we know the areas that we need to strengthen. We as Andrew has mentioned we have been presenting this to all of our stakeholders and at some point I think around you we will create a new revised program at guideline and roll this out appropriately and share for another commentary. In argolis. Certainly that 7 is too low, you know, what a mediation I think what we've seen is mediations and incredible tool obviously is it has to be voluntary you need the complainant and the officers to both agree, but you know, really I think we created ourselves and we give ourselves some low grades and some areas, but we need to do a better job at at making it off sir. So where you know where they're working with the unions are working with Command Staff, you know, we To sell this program to make officers want to do it. And we will make sure that once once we have a better sense of where the program is going to be will make sure to invite you all back to have a conversation about the revamped call for the mediation program. I do agree that it is a potentially powerful tool that could really be restorative for everybody involved and I'm looking forward to seeing it be successful Opa recommended one or more sustained findings. That means that we said that it and also had violated policy. So that is lower than 2017 where I think the percentage was 20% And now we're but it's it's in line with past years. So this number again will fluctuate they really I don't know if there's any qualitative information to provide you but it depends on the cases that that's what we're saying and your office has sustained findings of Investigations. So of the sole bright justify in 2017 was 18% of the whole Darlow what it is. I think if you look at other agencies across the country, we've done anecdotal looks it's it's it's probably on the higher end. And another thing that's on the higher end is, you know, we obviously we recommend findings. We can't compel findings. I recommend them to the chief of police and the chief decides finally whether or not to agree with my recommendation. The chief has reverse me, I think in 2018 three times, which is really low compared to lie, you know, most of their jurisdictions is significantly higher I think in the 15:17 20% range selling that's another positive system and show in the system is working in my mind. So as you all may be aware, we are governed by 180 day timeline for investigations that comes from the collective bargaining agreements. There's a lot of exceptions N Roses when it runs from but you know, generally it runs wheat with the way we look at is we have 180 days from the date of the incident to when we issue are are recommended findings. That's this cuz this is a 2018 report. So this is reflective of the on-time statistics is reflective of the one at a time as it existed in the previous collective bargaining agreement mean it just you know, in order to ensure that we can maintain discipline for recommending sustained findings. Be largely run it from the date of the incident just to be careful. So Really important number for us in a one of the things when I first came in to Opa with the 180-day was was only really applied for sustained cases. So if they thought they were going to be sustained finally got it done within the 180-day but almost all other cases were done outside of the 180-day. And I knew that is problematic because you know, I'm suggesting complaining and officer on both sides of that case. It's important to get things done in a timely fashion. So now every case is done within the 180-day. So no matter whether to stain or not to say and it's done within the 180-day, you know, obviously, we're not perfect. We're still going for a hundred percent. 94% is good. It's really a tribute to the sergeant in the supervisors and all that. 94% is imported to know that that the 6% that were not timely first. There was only one that case which would have been sustained that case though. The reason it was not the same width because of the statue of limitations. It was done within the 180 days just to contact occurred more than three years ago. So I said it was not the same time limits for that reason the butt of that 6% Some of these are also cases that were still finishing up from the past administration. So there's some cases from 2016-2017 that were where we want to get everything done. But that goes into that 6% So I think we're going to be significantly higher next year. I think probably 96-97 90% so which is where we want to be. Practice management actions are a tool that that Andrew has on issuing findings where there are perhaps I'm gaps or ambiguities are other problems with SPD policy. So basically means that Andrew is not holding the officer accountable for the actions, but rather is holding the policy accountable perhaps the policy was was poorly written or was unclear. So in that in those cases and you can issue a management action recommendation in 2018, we issued 30 mins reaction recommendations on unique topics and 75 total management action recommendations just for my colleagues have the report in front of them. That's those management action recommendations are reflected in appendix a horse of the 30 unique topics 13 of them were implemented completely or partially by aspd. 2018 and 33% they declined action 23% are still in progress. A lot of these take quite a while to implement in their policy changes that take that take awhile. So a lot of them are I have not yet been able to be addressed. Yes council member must thank you so much for putting this out. So I was thinking as you mentioned that every case we have to investigate that's very similar to labor standards violation at the state level. You know, we have a lot at says every single waves that can play it has to be investigated but really there's patterns, right? And so we really push the department there to do director initiate an investigation by way of the m a r as you really are already doing these director and initiated investigation based on patterns that you cease to push policy change that after I think that's what we do. And I think also what we were one of the things that will get a case right in something they have gone wrong, right but it went wrong because there was a gap in policy where there's no training, right? And that's what we try to do too. I mean purpose of what we're trying to do is let me correct it right. How do we ensure that something doesn't happen again and I think we use like you were saying we use imagine actions and those policy recommendations to affirmatively do that. Maybe it's the depart. Issue, not the officers why hold the officer accountable if they're not being supported by a policy or training? So that's that's our philosophy and I am really a valuable tool and you could almost a crosswalk list Independence Day with the chart on page 15 of the allegations that to see where your recommendations correspond with the highest that the violence that they were always happy to give you. You know, we can provide recommendations to you if you want to see them and and talk you through whatever you go down the rabbit hole every single time when you see these patterns that that's great. And if this is a really important concept and I want to thank the community police commission in particular Lisa daugaard who really hammered me in the police accountability legislation. Process that this really needed to be legislated and included as part of the overall police accountability ordinance as opposed to just leaving it in policy for you. And and it's it's a really important tool for procedural Justice for officers who you feel like they didn't have the tools necessary to actually comply with whatever the rule was or that the rule was in the US on its face and they thought they were complying with the rules but then they turns out maybe weren't and so we really want to be fair in those processes to make sure that there is legitimacy to the work that okay is doing I think it's funny now, you know officers will you know say you know, can you do a management action on the X or action? So I think they also see you as a way, you know, sometimes I think you know, how do we make this change? How do we affect rate in a c o p a x a tool to effectuate? Changes, so as you may be aware any serious and deadly use-of-force right now bypass be policy is called a Type 3 use of force and for all those type three uses of force the force investigation team, which is a Department investigation team is required to respond to the scene when they respond to the scene, they notify Opa and we respond as well. So we responded this year to 100% of type three incidents. Generally, I will go and with a supervisor and multiple sergeants as I sent me know as with the use of force is generally occur at 3 in the morning on a weekend, which is not always the greatest time to go out at night but we put our staff is really Vigilant and where they're not only to be taking part in the interviews and to be monitoring the interviews but also to be monitoring the overall investigation, you know for an officer-involved shooting had the officers been separated, you know, what evidence being secured, you know, making sure that things are going to ride him being that community. Eye on what's Happening? So this leg cramps a lot of what we've been doing that Andrew set out at the beginning of the presentation into one. We've been exponentially growing our community and stakeholder engagement mention to this committee late last year. We participated in 12 roll calls at different precincts. And this is really being used to build rapport with officers trying to understand the perspective of officers get out there and engage with which police department members. We also gave us nine Sergeant skills training. These are two and a half our presentations at Amanda Sargent skills presentation. I'm sorry Sergeant skills training schools. We talked to them about a procedural Justice about Opa practices and procedures and help make sure that there was some understanding of what we were doing and how we were hoping to engage with him in the future we heard in those instances that there was a lack of Engagement with Opa in the past. So that's something we've been trying to focus on as making sure that were approachable and accessible. And they were open to a dialogue with officers. We hired three Community engagement specialist in 2018. They started at the end of October. So while this community participation in community events number may actually seem low. It's increased greatly from the previous year and we're hoping to increase it even more next year. So they were just getting started learning about Opa and they've been I'm doing a great job getting out in the community and increasing awareness and understanding in the community of what opiate does so that people can make a complaint when necessary and just have to trust that the police department has some oversight. We also have an email newsletter that goes out to almost 300 people now and those are mostly sworn officers and it's an opportunity for us to explain certain decisions that Andrew makes and policies that are that are going on that affect the day-to-day work of officers. So weird using that as another means of communicating and getting out in front of Officer so that there is some understanding of our work and finally Andrew or myself presents at every post Leah class that comes through so after officers new officers go through the academy, there's a post Academy class that focuses on FB specific policies, and we try to get in there to every class and make sure that as soon as officers are starting their Journey with the department. They understand what Opa is and we can test out expectations at the Forefront. That's all we have. Thank you so much and I'll be going to look it over but there's any questions or happy to drive from now, but otherwise anything that comes up obviously will will provide for the report is appendix B and it lists appeals and grievances. Just tell me a little bit more about what this is. What information what is this as part of it as part of the ordinance ordinance. We are required to report out just on what appeals are currently pending status of those it feels so basically what these all ours, these are all the appeals of sustained findings that are currently exists there different levels of pendency, you know some you can see are from 2014 some are still going to the drve which was eliminated as part of the contract, but it's obviously their grandfathered in for these past cases on summer going to arbitration really if you Down the ones from 2017 are really the ones that are under my watch. Most of these are just past the feels. It's a lot and I think this is obviously something that I know that you thought a lot about councilmember. I really appreciate having the list and and I think it's important for my colleagues in the public to know that that does not want a detail in terms of what the actual thing is that's being appealed her or Serta particular is around the facts of the case is you investigated it, but I do want to be really transparent that there are several of these appeals and grievances that are in the disciplinary review board at context. We we worked really hard to get rid of the drv in the new contract negotiations because because of the RB was certainly waited in large favor to to the officer in those cases and still there is High likelihood that we may see an outcome out of these cases that are listed in appendix B that is not one that we we would necessarily see under the new collective bargaining agreement and the new arbitration process and also probably result said that some of us may not be very pleased with in terms of the outcome of of those Grievances and appeals process is I just want to be really transparent with a view of course. I know that you all share the same same concern and value in terms of understanding and appreciating that because these cases are grandfathered in it also means that we may see outcomes from these cases that would be outliers in comparison to what the current process is and may not necessarily a line with where we want to be one of them could do better and something we can focus on this upcoming year would be communicating more with complaining so they're aware when they're This is going through the appeal process. You know, we do do bass like medication but getting more information cuz I think it is definitely feel something for people that it goes into this black hole. You see some of these cases have banana peel for years and that's just a function of is nothing in the arbitrator's so so it's a good point and certainly do I know which one of public concern and in one that's been in there in the news particularly off of late to very brief questions. It was something that was considered as part of the accountability ordinance, but there's no right of a complainant to appeal right now so I can remember cannot appeal their finding of not sustain for example, but it's the officers right to appeal which isn't trying the collective bargaining agreement. It's a right that flows directly from a represented union members right to grieve disciplinary actions. So Because it's connected with a represented employees labor rights the right to appeal flows from that represented employee. Okay, very helpful. And then my last question was when we talked about the number of complaints coming to you and the number coming from SPD and we talked about the various reasons that that might be coming from within the department good thing right that they're coming to you that the trainings happen if people know how do we also make sure that we're forcing it if something's happening and what's the account ability to make sure like that anywhere if you fail to report you can be invested in discipline for that failure. So and that happens, you know, what if you look in the reported that it'll itemize for you different allegations, and there is a And I will talk about you know Force reporting and that's all people that fail to report as an option that fills reporter supervisor that feels report frankly. The biggest mechanism that we have right now is a video, you know body-worn videos are doing an intake into a case, right? We're not just focusing on the allegations that were alleged right? We're reviewing all the body one video the in car video and we're trying to identify, you know, what else went wrong. What are the other problems and we may discover a failure to report their know generally sergeants and supervisors and it's not just because they know their own videos because they want to do the right thing are reporting these things it is it is a culture of reporting which is a good thing. You know, I just think what we're trying to reach now is a balance of you know, what do you want to handle that you're in for sending over to us? You all do actually use your services in mediation specifically trained. So anyway that I can partner to promote that service is something that I'm tremendously helpful and supportive. So question regarding officers with complaints lateral transfers, there's a focus on recruitment of SPD officers do are they trained with regards to just how to open a process at what point of the trained that's a really good question. So when laterals come in they do go through mini Academy. So what were some of post-polio I like the post basic Law Enforcement Academy, they'll go through that same course, so we will speak to them and present to them about what Opa is it again? Like the issue that we're seeing is that that is a 35 minute presentation with all the other stuff they have going on and that's the last we hear of us until they come into our office. So in that message, we are trying to do more work to to a family go out there. Like one thing I'm going to try out starting in May is I don't have a good name for at some point office hours. So I'm going to do a 9 a.m. To 9 p.m. Shift at each Precinct. Throughout the city and just to be there so I'll work remotely in a boxer's want to come in and talk to me whether it's about an old case about you know, one of their cases something I decided that was in the news really anything. I'll be there if they have those conversations and I'm hopeful that that will be sold to them by the chain of command so that they will take advantage of it so I can talk to him about the OPA. I'm in a lot of it is, you know, the emails that we send out. We're just trying to educate people about what we do and why I do not want someone's first appearance of opa being when they walk into their interview because at that point it's too late like you should be comfortable with the process and what it is, but it certainly worked that we could do better. But you know, it's enough hours in the day and it reaching all these officers the laterals Mostly because they have experiences from other departments that may not be good. There may not have been really an accountability system. They are there a tweet. We do do some work. We have initially targeted them specifically, but we could And then my follow-up question with regard to the role calls given that so many planes are coming to internally is told will call sufficient. Yeah. I mean, it's a good point. I mean really what we're doing is we we were trying to go to every single roll call at every watch across every Precinct, right? So there's 5 Precinct 3 watches. So 15 roll calls, we've done 12:15. The only ones I haven't done are the 4 a.m. Real calls, which I'm putting off as long as I can put out. How about I'll go to those but that's why I wanted to do the office hours is because it is tough because people may not be working that day. You know, it might be it off court day for in one shift that I won't see but but you know, what, is it sufficient know? It's not right, but the problem is I'm trying to balance, you know going to these robocalls, you know doing what we do in the community writing up 515 cases a year and everything else that's going on, you know, but but we're getting there and I think it's a goal for I keep doing it and maybe it's not me. Maybe it's and that goes it's our communication folks that go with some of our other sworn that go, you know, it's in perfect. If you have ideas, let us know like it literally were willing to try anything. So let us know we don't we don't but we could but we don't currently a bit because what I want to avoid is, you know Southwest precinct for example in West Seattle, I think often they feel like will no one ever comes to them. So I want to spend as much time there as I'm spending in west or north or east but certainly if we see targeted translate Third Watch West they're saying the most complaints I might go there. I also do targeted. Sometimes I'll have a training issue that I seen a case and I may say to the supervisors instead of me just sending a case back and having you train them. I'm going to come to the roll call with your permission and talk to the officers myself. So I've done that and I may do that more again. It's just resource-based. Well, thank you can thank you. Any other questions or comments? Okay, great. Thank you so much to all of you for being with us this morning and four more importantly the work that you do everyday to keep Soul honest. Appreciate it. Thank you. Alright, so we are going to move to our last agenda item. I want to recognize that has joined us. Thank you so much for being with us. We are going to go ahead and I do our last item of business on the agenda. And I'm going to ask Roxana to read agenda item 5 into the record and if you are here to present on the lead slide, please make your way up to the table agenda item 5 responds to Sly 38 - 2 - a - 1 2018 for briefing and discussion. Thank you Roxana. Okay. Well, thank you everyone for being with us this morning. Thank you for your patience as we work their way through the prior agenda items. It's good to see all of you here. We'll go ahead and do a quick round of introduction so name and your affiliation and then and then I understand that that our agenda will be at that Greg Goss from cancel Central staff will tea up the topic in the issue as a relates to this Sly response. And then at least I think you were going to give us a little bit more contacts and detail regarding lead and just the need for the database in general and then we're going to hand it over to Seattle it and the Seattle Police Department to give us our presentation on the actual content contents of the sly response and then we will have questions and answers and then I can't I know that you were the primaries. Service lie, if you'd like to take a few moments to provide any opening remarks, I'm happy to provide you that opportunity and I know you've been working with lead for us now for I don't know better part of a decade 50 years and at least acknowledged the work and the support that you're getting from the King County prosecuting attorney's office as an example that we know that this is an alternative. So what I'm when we met last year, I think it was October during budget about the need to have this database that what was very clear to me is that the police were asking for it as well that they wanted to have this information that was accessible. We talked about alley Franklin's work that she's doing with 311 and crisis connections. I'd like to hear as we're going through this how this all connects because without the data it's hard to prove that lead is working from the executive's office that they have questions. Weather lead is working. So, you know clearly we have something here that we need to resolve and I would as we're going through this today like to hear from you about can this particular database that were talking about be done what we need to do cuz I know last year you were very frustrated that it was taking as long as it was taking and the police department was frustrated that they weren't getting any resource support and yet everybody was saying we need this so I want to acknowledge that and then I hear how we've come and how far we've come in last 6 months and what we need to do is go forward great. Thank you so much, Why don't we go ahead and do the round of introductions and then we will go in the order that I described. Mark Baer the Chief Operating Officer for the Seattle Police Department Tim Keller on the lead Project Director. I work with Lisa Lisa daugaard. I'm the director of the public defender Association and we are the project manager for the local lead initiative. Thank you so much for being with us. Mr. So why don't you go ahead and kick us off. Thank you. So by way of background the statement of legislative intent 38282 came about as councilman Bagshaw indicated back last October when the budget was being developed by the city council at the same time concurrently. The police department was implementing a records management system, which is a very complicated in and long-term Endeavor and I asked the council is hearing reports back on that implementation it became evident that there would be a day before the law enforcement assisted diversion program to communicate somehow with that database or the other way around so that as officers came into contact with lead clients, they would know that that wasn't Eataly client and they would have information about how to handle that call and there was some dialogue about whether that would be Captured in the police RMS system itself or whether that information would reside in a separate database that we could be queried by they RMS system and it's the latter that that wound up being the best scenario. And so this why I asked that the lead program Seattle I T & S P D come together figure out what a lead database might look like how much it would cost and then specifically how it would interface with the police records management system. So that the police when they were out working the straight would have information about Lee clients and It does all these things and I had the police department and the lead program folks in Seattle like T are going to talk about the response SPD Mark Barrett has asked to provide a few introductory, And so I'll ask if I have any questions on my overview and then tossed it off to him. Any any questions colleagues are comments. Thanks. I just want to take a couple of moments in reiterate a couple of points that the deputy mayor had in his cover memo and Big Sean mentioned. I think the first one which is there is a lot of conversation around analytics and performance metrics as it relates to lead and there just is not quite concerned but there's interest in making sure that a database that gets constructed has the ability to to capture the appropriate information to be able to contribute to creating those performance metrics. And the second is that there are a number of entities around the city that do case management functions. And I think we want to be mindful of how many separate systems may be in existence and whether or not there's the ability to get some additional leverage out of something so that we don't have too many siloed or different or Counter systems follow up quick question. I'm going to ask you to hold your questions because I want to go in the order that outline the end that was slightly out of order, but I will allow of that little introductory remarks. I'm going to head over to Lisa next and have Lisa walk us through from Leeds perspective. Just give us a little bit more texture and context and detail around the need for this database and it just a little bit more texture to why we're having this conversation in the first place and then tells Mirvish Arbor going to hear a deep dive on the actual Sly response from ITN SPD, and I'm sure that will generate a lot more questions Lisa. Thank you so much. I want to say first that this is an incredibly effective and Swift process. Thank you. Cancel, Rebecca Shaffer initiating it with the statement of legislative intent. Thank you Seattle it for doing. Fast excellent work that was incredibly responsive to the needs a really diverse stakeholders. Not just in the private sector the service providers and us as project manager is also King County Prosecutors and law enforcement. This is a truly Regional strategy that has probably the most diverse array of partners that any challenge could be another could be tossed into your life going to make this work for all these people who have distinction. Sometimes very non-aligned legal constraints on information that they can share and Reporting out obligations. You didn't really fast really effectively and it's great and what we have now I think is a report that explains that this can be achieved then we'll get into what this is. This can be achieved and it has a price tag. So whether it moves forward really depends on whether the co-owners of lead one invest in this, it's our hope that the answer is yes. Because not having it is a real impediment to taking this model to scale and to increased efficacy. So what lead is lead stands for law enforcement assisted diversion. It's a strategy by which when it's recognized that quote unquote, we can't arrest our way out of this problem, which is Hino widely view widely embraced when people come at law violations do to behavioral health issues either mental illness or substance use disorder. It's not enough to say we can't arrest our way out of the problem. We do still need to respond to the problem and law enforcement a critical piece of that an arrest may be made and it is a public expectation that there be enforcement action, but that enforcement action doesn't have to lead to jail and prosecution when that is known to be an effective strategy as long as the officers have an alternative. So we provides that alternative it allows officers to directly connect in the field. Highly trained and highly skilled highly effective case managers and Outreach coordinators doing warm handoffs receiving people who have a complex history. It generally have chronic law violations and impacted often trauma driven needs that don't get solved overnight. But that contact is the beginning of a sustained long-term strategy for addressing the part of the what is the driver of the person's chronic law violations and all the while allowing officers to coordinate with case managers and prosecutors so that every additional touch right people. The last time officers are going to see that person in all likelihood. So the next time whether that be tomorrow or in a week or in 3 months or on, the next time that person is encountered it's possible to just rather than it should have been doing all the good work that has been set up by case managers law enforcement. Force that work with it. It doesn't but we participation stock immunity from future enforcement but it does allow officers to coordinate that future responds often without sustaining long-term case management plan. It's very effective people who don't respond well to any other known intervention have been seen to respond very positively to lead engagement. So and last comment about what it is lead almost alone I think is a place where we have figured out how to share information in this is like the Holy Grail right of need to break down silos and transformation but a lot of information that law enforcement holds is protected by the criminal records privacy act against sharing and a lot of information that behavioral health providers. How old is protected by HIPAA and other state and federal laws and regulations against sharing so putting those two systems together is very unusual and overtime. I won't go down that the rabbit hole of how but we have figured out why all these Partners to share information as needed in order to coordinate but it's done by hand at this point. So by email by text by bilateral phone call and that works. Okay, when we were talking about 50 people are a hundred people but lead now has more than 600 active participants. And if the police department could refer everybody that they have identified who would be appropriate for lead. It would be well north of a thousand very rapidly probably had too much further than that. So we're at a point where we cannot efficiently share information nor can we efficiently report out data on what the program is doing? And it's not because they don't exist, but it's just because you know, every request for information is a by hand pole. So y'all are familiar during budget you ask us things and we produce things and we prioritize that and it takes about 24 hours, but often Ali, Any Council or mayoral or King County Executive or King County prosecutor budget analyst or policy analyst to felt like it could get up at 3 a.m. Crack open their lead database and ask them saw ask the questions that they really want to know the answer too and got them back in real time for that to be true the information about how lead participants are being managed and what the plan has the past contacts have been that all needs to live in one place how that relates to SPD. In our on all of our ideal state every sworn officer and for that matter civilian employee of the police department who encountered lead participant could find out that the person is a lead participant and get key updated information about who that person's case manager is if there is kind of time-sensitive information like they have 72 hours to get into housing and if they miss that window there going to slide way back down the last inmate that might not come up for them again for 2 years. They would know that in the field they'd be able to immediately do a smart and effective thing that is an alternative to booking at the jail cuz they just don't have the necessary information to do something responsive and immediate that is different the concept that Greg and Mark alluded to is for us optimal that that encounter in the field triggers. A query to a database and pulls information back that is immediately available by mobile data terminal or smartphone or any other portal 3 wedge and officers getting information or to dispatch that provides just that immediately actionable information that would guide an alternative response. So a database would further, transparency and accountability The Seattle Times editorialized in last couple days that diversion programs need more transparency and accountability we can car not because we're not accountable and transparent because there's like a volume and and time timing issue about providing data to the stakeholders that participate so on demand on demand and not by and I'm allowing governing Partners to have clear view into what we're doing make suggestions for a redirection or Improvement if you think that's you are one of those corners So if you think that's appropriate. That sounds again the governing Partners in lead who include the city council the mayor Seattle Police Department City attorney and their counterparts on the countyside the executives Aiken County prosecutor the sheriff and the King County Council as well as a couple of community civil rights Partners all could have their own access into this full of information run reports answer their own questions and an operational Partners would have real-time access to know what's going on with individuals and also be able to look at case we have this database and it's as rich as we needed to be done as policymakers. We have an opportunity to look at that data to make evidence-based data driven Visions as it relates to the lead program and operationally for those of you who are for those actual users of the system people who are actually on the ground doing the work in lead. it eases the burden on them operationally in terms of being able to track and monitor were the successes and opportunities might be as it relates to deployment of the program that exactly and and optimizes the choices that each partner makes and talk to Aunt to improve the likelihood that the behavior of the person only that they're working with improves and GAP soak to remove all the barriers that occur just through lack of information exchange the the question of other side of Kindred initiatives and whether they also need to know a platform for information-sharing I mean, undoubtedly, this is a known as like, this is the Brass Ring of local policy-making on this issue. I think we are quite a bit further partly because we have the architecture of information-sharing even if it's analog right now that some others have not fully worked out but also and we have a high volume of participants already enrolled but showing that this can be done hopefully will be really motivating and inspiring to others that you know, this is all within our grasp I think because you had lied he did such a great job and they have a pretty good idea what the cost is. No it's not for free, but it's not an achievable and I think this will go a long way toward building confidence that we can deliver. What everyone wants which is responsive transparent accountable an effective response to these problems last week when I acknowledged R.Kelly 10 Candela in the audience who did a lot of the groundwork with satellit to make sure that what was designed is going to actually meet the needs of this diverse array of operational and governing stakeholders. Thanks so much. Thank you so much. Okay. Now we're going to shift gears and we're going to hear from SPD and satellite TV on the substance of their response and incomes number should feel free to ask questions as we're going along. She would like to get a skeleton. Well, I can I can talk about From spd's perspective and I think Lisa did a pretty good job of pointed out that are real interest is being able to provide information to an officer when they encounter somebody who who may say hey, I'm in the lead program or they may wonder if they're in the lead program right now. We don't really have an effective way to find out if that is in fact true. So our interest is in being able to to make a query can of somewhat similar to like of a warrant check on his person and weed and getting back that very type of information that Lisa outline so that an officer can take an appropriate step of the individual that they are encountered. I want to say thank you very much to a speedy and our partners for us in it. We've had a very good relationship and being able to prove this forward our goal in this was to be able to identify what was possible. What would be required to be able to fulfill those and so in generality. We have some understandings and then we have some scope for costing for us to consider as we move forward. So Tim has done most of that leg work and I'd like to have him speak to them. So I want to go so I think we're primarily were to provide PD and LEAP program with the tools that they needed to move forward and their Journey towards a solution for further technology needs our documentation that we provided was based on the principle of being vendor-neutral even though they were engaged with a particular vendor when we began our and you know what time we wanted to make sure that the the documentation we provided was applicable towards either that vendor or moving forward with other individual vendors or moving forward with single solicitation of multiple vendors. So as part of the conversations I had with PDA project managers and representatives and their partner organizations developed a set of business requirements that specify what's needed in the solution. So that those requirements can be taken to any vendor really and they have the building blocks. They need to know we need this and we need that when he does. I also developed some what's called business process flow documentation for their desired future state. it describes what the Libra firl process looks like for both arrested versions and for social contact referrals and describes what the integration with other partner systems might look like so in terms of the actual response to the sly we recommend the lead database be developed based on what's called a customer relationship management platform or CRM. I'm that provides for the database capabilities. The platform should also include workflow processing capability Lisa refer to all the different Communications that they use between partners the different methods and channels to communicate status things like that such a system would provide notifications kind of proactively towards women needed to know and it would help move things through the Inception processing induction process into the program in a measured manner. I will come up with some estimates for requirements of a cost based on the door that we did but also based on the work that the technology did we prepared a couple of different views into those estimations. The first recommendation was for a vendor only implementation without added support of a project delivery team. Implementation support cost for the first three years were estimated at roughly 270,000 to nearly $500,000 for a project with a six to nine-month implementation time frame mean to people on the ground to the police to those of us that are having to make budget decisions. If you did what you just recommended would we have a system that lead could use their partners? When you said 270,000 is that for the acquisition of the software alone? So that would include implementation Services licensing costs associated with the software basically test and production software environments interface and integration and development basic user an administrator training. I've been your travel expenses and all the subscription lights to a hundred seventy thousand dollars. We could have the software people could betray and it would be implemented it would connect with the police. It would talk to the police officers database as well as for the case managers on the ground that the officers are already working in to this lead database to return back the information that they need to make informed decisions. You can pull data from the existing SP database would pull data from the database just in the form of that query to return that immediate information for an officer would not be sucking data into rrms, but it would be getting a return in order that they had that information to to work from at the moment, but it's not required that SPD could actually make referrals in to lead through RMS and then push that to the database that is a TVD. I think it's very clear that that option would be there and we'll consider later or SPD will consider later whether that is the way that makes most sense actually just directly make referrals that It's not a current what we're doing that by hand and we can continue to do that by hand for a while while they get their new records management system up and running should have stabilized in the field everybody trained up and using it but it is possible that referrals could be made using a form with an RMS that we would then get in the date. You're just that was dumped into the database. That's a separate so bad on. Okay. Well, let me just ask this so officer beard finds an individual and talked to somebody in Belltown that he believes would be appropriate for your program. So does he then send a note to you through his record management system that says okay. We got Bob on the ground or we know who Bob is we believe he's appropriate for the system. What do you do with that? What does he do with that. At that point how do you put information into the database is still the the The department is holding on they want to do the first step 1st set up the database where they can pull information to use operationally that comes from the database keep making referrals as we currently do and then consider whether and I hope I'm a little bit sticking out of turn here and Mark correct me if I'm wrong, but my understanding is that the question is held open whether or not they would then want to make referrals through there are a mess that could plug into the database and this is not something they've committed to doing but it's a question that remains open. if I could just have one quick follow-up, so Martha just designated you as officer. So you are outside and you find somebody that what kind of information are you seeking from? The lead database? What do you want to know that you don't have access to now whether or not that individual that I've encountered is in fact in lead. Typically what an officer could hear is be they come in contact with somebody individuals has awesome in lead. We don't have any way to know if in fact that is true if they really do have a case manager if they're really participating in any active way and in so this is closing that gap of if I've made contact for instance with you and you say wine and Lead I can find out if you're in lead. I can find out your case manager I can find out is Lisa pointed out perhaps whether or not you're just about to get some housing and if I make an arrest Choice whether or not that would impact that so I can make an informed choice and and perhaps, you know, the last time you were actively engaged with your case manager and would close it would close that Gap and not being able to know any of that information. All I would all we have right now is somebody saying that there's no way to verify that you guys have fun did North expansion last year if you may remember we asked me about 50 referrals when the data points that is very important to me is is officers law enforcement invested in this program. Are they invested in lead the way you can tell that is if they're referring people into the program program doesn't work and I can refer people right and do something else. So right now we have we asked me to 54 year we have over 200 referrals. We're not at our one-year Mark yet. So that's how invested North Precinct is in terms of lead. So we are also trying to find some individuals that they preferred through social contact. That means it wasn't arrest by virgins. Like I nice to meet you. I think you may be going to program. Let me go talk to my boss about this type of case managers get more information from the prosecutor's office. If you're approved you look at Outreach coordinator. So we have about ninety nine approved referrals. They're not and take their aunt Leigh client the Outreach coordinator the running around or three things, which is not small Precinct am reminded by all the time by law enforcement trying to find these individuals. So then they have sat down and they talk to law enforcement to prioritize those individuals and say who are people that you're encountering. Funny or 40 times in the past two years. So they're having contact with law enforcement all over the precinct. Not everyone is Lee trained only in certain eye Focus areas in North Precinct right now there they've identified 38 people prosecutors are working to see when their court dates are. So maybe his manager is can talk to them and reach out to them there and cuz he's individuals don't even know they're in the lead program yet. Even though they've been there right along with law enforcement try to find these individuals. Everyone's working really hard to get these people taking in the Bikini sees us as a benefit law enforcement seized as a benefit and prosecutors the currently because even though they're having contact with other law enforcement. There's nothing jumping out saying I talk to your case manager or the case managers can't look up just right off they have to search email to see if that person has a court date. If a court date change the prosecutor has an email that case manager to go chase down that individual. So on the ground, those are some of the benefits of the state of is to provide Goodness, very helpful. Thank you. So ask me the benefits that we talked about or the ability to have enhanced reporting capabilities right now the way that things operate today with the disparate list Excel spreadsheets and things of participants in the program that each Precinct that each partner maintain separately. It's really hard to reporter to together data across all that information. I'm so this would provide a centralized database or single source of truth that you could go and then develop reporting capabilities. They are one of the set of requirements that we thought was most important was the flexibility to be able to add new data fields to reports and to create new reports themselves as time goes on there may be different things that people want to know about the program. So that's all kind of built into the system that we design and I just want to clarify that this option that you referred to where you laid out all of the different things that 270 would purchase you did give you did give a range in the sly response of 270 to 495 so I just want to make sure that it chair who is attending a community appreciates about 270 is the low end and it was unclear to me from the response what the variables are that that contribute to these options going from a low end to the higher end and for each one of the options there is a low-end to high-end. So perhaps you can give us a little bit more at Clarity around what does variables are and what is contributing to the spread for there's a built-in a certain amount of variability in costs associated with different bases different vendors may offer we start with a certain set whatever we have information we have available in this case. We we estimated at 25% below the initial estimate to indicate the lower end of the range. We are National basis was dxc Technologies estimate. So their individual estimate was about $300,000 for the first year implementation cost. There quote was also based on the fact that they had a six-month implementation time frame. So you're paying for vendor services for the entire time that they're doing their development worker thinks this upper end of the range also includes the possibility of taking this long is 9 months to implement the project a third party vendor. It's been a server Microsoft. We didn't settle on a single vendor or provider. We want to make clear that we're looking for customer relationship management capabilities are the number of vendors that provide that kind of software. There's a number of standards that satellit maintains related to those types of software question is the underlying software that you're requesting a Microsoft Project product or are there multiple software vendors that can provide the underlying software? I need into the second. So there are there are multiple software vendors that could provide the software that's needed. So the recommendations that are included in the sly or more folk are focused on what the database technology needs are without regard to a specific vendor. So this will provide a full Suite of opportunities and options for for us to consider in a budget process that are attached to a particular vendor, but are more focused on the technological needs of the program is a cracked exactly. What we were looking for was to identify. What capabilities did we need to have much like Lisa's conversation about what we want to start with. What is our current state and where do we want to move forward what capabilities might we need in a future so that as we look to solution selection will have a variety of opportunities and we'll have the underlying core. I'll savor. Permits to make that informed business decision. That's helpful. Thank you so much. I apologize if you've already commented on this but as we look at the various options, I so love with you just said Solutions selection without a problem as we identify the solutions and we move forward with the various off with one of the various options that it's your fault line. And one question I have is is the six to nine months after we put forward in the budget or is it six to nine months beginning now if you started to do do the build-out as soon as they begin their development work on the solution, it would be a 691 time for an estimated. Okay. And what's the timeline that you would need in order to select a vendor assuming that we get all the money that we need cuz it grows on trees and we get it in the budget. It would probably depend largely on the vendor selection process. It's used. If you look towards the end of this response, we've sorted describe three different options of how PDA could proceed in the game. We wanted to make sure that we Court of them in any of those options they can move forward with dxc technology if they feel that they make their knees and if they feel that they are those lines they could also investigate the ability for other additional individual vendors to meet their needs. So they've already had an engagement or two with individual vendors. Sometimes I believe let the first station in sometimes I just didn't end up completing the process, right? The third option would be to submit something like what we call a request for proposal which is a form of solicitation process that allows proposals and cost estimates and induration estimates from multiple vendors at once and it'll allow for the objective evaluation in between those multiple factors. And Lisa have you have you have you formulated an opinion about a preference in terms of the process question related to identifying of thunder. So we work for the lead governing body which the council sits on along with the other stakeholders that I named earlier. This is really the policy coordinating group's decision. What we would recommend to them. I suspect his that first it would be optimal if you know, there's been so much discussion about local local irritated. It companies helping in dealing with issues of homelessness public order a variety of configuration so much that help has been offered Microsoft approached the King County prosecutor's office, which is actually how this one bid should have came into being offering to help and It would be really fantastic an optimal if the public officials who should have Cohen lead where to ask for. This is a really concrete not that enormous way in which a donation could be made that would really speed us down the road and maybe model a way to to build a regional integrated approach these problems that starts to inspire hope and legitimacy. So if that could happen, you know, that's a role for the policy coordinating group and potentially for you all if we're paying if somebody's going to pay then I think it would be our recommendation that we do do an RFP and then identify a possible amount that you're willing to spend that the sort of whoever is funding this is willing to spend and run a competition advised by Seattle it so that you know, you're making a wise and prudent investment. This is well beyond our skills that which is why it was so valuable that you enlisted Seattle it to help us to know we are not Well positioned to assess whether the price is reasonable on the product is going to work and we can't do this twice. So an RFP if not donated and IRP seems like they're pretty Road on your page. Now that at the top of the paragraph for Bae that says for an implementation that includes project management and business analyst resources. In addition to everything noted above cost is estimated between 4 and 34739 thousand talk to me about DNA as budget chair. If this is a priority for us, what am I asking for my asking for to a or t to be so to a assumes the lowest-cost but it also has we believe the least chance of of Effectiveness and success with option b what we had is professional a technical project management in business analysis resources. You can see listed are some of the services that that would provide that could be. From an organization like satellit, it could be from another consultancy firm, but we believe that those services will will greatly enhance the abilities to its success. I would say just to my colleagues. I don't want to even fool around with something that you don't think it's going to be successful. This is way too critical and it's not just lead. I think this is the point that we've been talking about which is lead is a tool and as Lisa said earlier, it does not provide immunity for people but it is a tool and alternative to make people better feel better be better and help get them out of the Criminal Justice System where they actually can be thriving again. I don't want something this half-baked. I don't want something that is going to cost the taxpayers a quarter of a million dollars and not work. I would much rather have us identify what software you recommend or software products and recommend a group of people that could do. Work. This is the work you're looking for and move forward with a rational plan. So I would hope that coming out of your recommendation that we have agreement. What we want is something that is going to promote the best interests of the individuals on the street the taxpayers who are paying for it and a result. That is not good that gets us out of the spin cycle, which is where I feel we've been that makes perfect sense to me and I think what we said is suggesting is that we might be able to be our greatest savings to the taxpayer might be to identify a a public-private partnership with so many of the technology companies that are in a region that might be able to meet the the core functions needed by by the program in order to stand up the database. That would be I think a win-win situation if we can find a path to identifying a public-private partnership that allows us in our budget to use tax. $10 for other aspects of what would be needed to be layered on top of the technology such as I think there was a project manager that was identify. That's an actual real human that isn't funded yet. But you know we can we can utilize our limited resources in a much more strategic way to leverage that technology and I'm happy to be a partner in those conversations for it and and and the PDA if you will find that it is that it would be helpful. I think it's I think it's a matter of us, and perhaps identifying our relationships with folks in some of our local technology companies and and making making a request for a strategic public-private partnership in a program. That is I believe successful and that I believe is actually strongly favored by Members of our community and certainly by folks who are utilizing the program to be diverted from her Criminal Justice System County Sheriff's Office and Seattle PD will be using the same records management system. So building a database that can be queried by Mark 43 kind of instantly accomplishes a unification of strategy between the sheriff's office which uses lead and a speedy. So it's really a good time to make something partner with Mark 43, that's about to be really the original records management system. So County City private kind of matching approach could really be very very well-timed. I'm sure that that will follow up with you offline to find out who the points of contact should be that we should be engaging to have that conversation cuz we're back. Hair that is continuing to work and then Our Place apartment in the sheriff will be coordinating this whole data coordination strikes me as being like one of those absolutely has to be done. So I'm wondering if I'm going to shift back to you cheer. We received a memo from Mike Vaughn dated April 22nd. And one of the sentences here is there is strong interest on the part of the executive to minimize risk of redundancy or Boutique technological solutions in isolation of the broader context of potential it needs. I think we all agree with that don't want to be wasting funds. We don't want things that we have to duplicate, but I'm wondering whether we've got the support of your office of the police department to really work on this coordinated effort. And if so, if we can have a strategy that is done by September 1st. So when we're looking at our budget and we're can work with the executive. To make sure that the money is in her budget, but also if we can do this in a collaborative way, I don't want it to be a council versus executive more it versus the police sort of response. We've got to get this together. So does anybody have any idea about what the executive is looking at here? I will look to the executive departments to provide a long is the idea that some of the other elements that do case management might not be forgotten along the way to whether or not that's consideration for for future enhancements to be able to bring them in or if they're considered along the way but I imagine many of the people that were talking about that are under case management with lead also text some of these other elements that relate to City related case management entities and it would make some sense to have a tentative coordinated place where that case management is done to be able to take a look at not only efficiencies but performance metrics I appreciate that perspective in that long-term strategic goal is I'm hearing it described. I also on the flipside acknowledge that the lead program I think is is is is different than our ordinary. I case management needs and software needs around making sure that we are collecting appropriate data for people who are experiencing homelessness throughout the system. And I think there's a I think there is a risk of conflating this database which is fundamentally about diversion from a criminal justice system with our suite of services that we provide in the area of homelessness. And so while it's true that many of the individuals who Are participants in late may be experiencing homelessness. I I see Valley program is fundamentally different in many ways. So I worry about taking the approach of what we're going to fix the overarching technology needs for homelessness services at the city before we're willing to stand up and meet the what seems to be pretty clear and simple technology needs of a discrete program. I think I worry about taking that approach and it seems to me to be overly judicious and and answered of over complicated and overly bureaucratic approach to what seems to me to be a pretty simple thing for us to do in a very narrow body of work that we're currently engaging in there really relates to the Seattle Police Department. I'm in one small agency appreciate and concur that there's something unique about when when police officers have probable cause to make an arrest and choose not to that's a unique. Crisis Intervention. It's really a pretty unique decision that requires a firm basis Ray that you know where the person is going to have a lot of information about the decision. Sir is able to rely on the divert to what the receiving system prosecutors similarly if you're walking into court and you're advocating for something that is based on information gained from this partnership. You need to have a strong level of a Reliance on that information. And so we are really asking our law enforcement Partners to do things differently because it's more effective in crime reduction. They need information to make those choices. Feel like the ground is not going to fall out from under them because I just didn't know something that's one point and it's not to say that other people don't need information exchange, but the specific needs here are pretty acute. But additionally, I think it would be wise to negotiate a contract with whoever's going to provide this technology that provides for a modular adaptation. So remedy this thing and potentially have a have an ability to procure add-on extensions of this that make sense in the context of another program maybe with doesn't have all the same Partners at buy it. So if this works, well, you know instead of exploring the road in a way that may and Luminate what makes sense for these other two these other Partnerships that finally came to the extent that we were talking about case management and Behavioral Health a population with Behavioral Health needs what we are finding increase. Feeling is that King County is the Behavioral Health Organization 10. CNN care providers can see into a pool of information. That is very useful. We cannot see if that were not behind that firewall law enforcement can't see behind that but our case management Partners can and so they are increasingly sharing information into cast member bags. I was playing about crisis Connections in the building of a single diversion portal. There's a lot of potential to put these pieces together and the lead database will only enhance that because that is giving you know, if our case managers can see all of that then they are talking to law enforcement Partners to get the benefit of all of that. So I think it will increase the intelligence of our whole system to start by having this key partnership be more be more aware of information that they need a critical decision points that you just said was modular add-ons so that I think this is part of the response to know we don't want to duplicate anything. We're not trying to be a booty call by ourselves database. We want something that can be shared and what you were saying about the case managers. It's also comes back to our low-acuity work and I understand that we will be able to move forward this year with the lowest QT project that all of us had work so hard last year to get get online. I think that the public is crying out for this and goodness knows whether you're looking at, or Scott Lindsay's reporter all of the articles that have been written about all of this. We're looking for Solutions. We want we want the city hero set interface. We keep talking about it Criminal Justice Reform, but more housing is needed in more money and be a mental health behavioral health the tools of got to be available to help us coordinate this so I just want to say thank you to all of you have been working on it and just my My fervent hope and desire is that we can get this funded frankly identified before budget starts in October because I keep looking at my keep looking at my watch. You know, I'm talking about another seven months here on Council and I want to see some results in this is one of them. So thank you. Thank you for selling the naming rights of the database the Sally Bagshaw be respectful of everybody's time. But I do want to pick up on a thread that can remember at bagshot put out there which is how I believe that that just like her that the public is really crying out for us to get serious about addressing these issues that are directly related to the work that leads. It is such a important tool for us to be able to really rise to the occasion to meet some of the crime and disorder concerns that folks have while also meeting the needs of people. Who are you are really suffering and our solution to date has been to just funnel people into jail and the criminal justice system that is not a solution and it continues to put us in a situation where we are continue to perpetuate the status quo of criminalizing people who are experiencing homelessness or suffering from addiction. This is a clear solution for us to support that allows us to make a difference in this area. And I believe that people who've elected us are demanding that we rise to the occasion 1/2 is the city council continues to be accused about its lack of willingness to support tools that will allow police officers to do their work and to do it effectively this database I can tell is the tool that officers need to be able to do their work effectively and not be accused of falsely arresting or not doing anything or having their hands tied to being able to not arrest people or divert people off of the streets into the help that they need. This is our opportunity as a city council to clear the record that we are supportive of this tool which will provide a tool directly to officers to be able to make those connections and address the crime and disorder that is occurring on the street while also addressing the human suffering of people who are having these experiences. So I feel very strongly that the city council needs to continue to support this this database tool to allow officers to be able to do the job that they want to do and to move away from that now is a mistake and I don't support moving away from it to the extent that that's going to happen in a little fired up about that. Obviously you do not a prepared script. But thank you. I also want to acknowledge that there has been so much written about how the police the police say their hands are tied. And this is so frustrating to all of us because we know we're trying to do the best we can to both take care of people who are on the street but also to take care of the neighbors were saying man, you just can't let people keep breaking in and stealing stuff and buying drugs. Whatever that conflict is. This is a step forward that supports the program that not only Lisa you've been working on for the better part of your your lifetime it seems but that are King County Prosecuting Attorney. Our City's attorney of our wanting us to do and it's not like it's either or it's an and it's always in and they have options as gives him one more option and one more choice that I think's working. So let's go and turn around like 200 referrals in the North End already made by officers make no mistake. And that is where the referrals come from. They're not going to refer people to a program that they don't believe in that. They don't think it's legitimate clearly. Our officers believe that lead is a legitimate helpful tool to address some of the things that they are encountering everyday in the field and we are dragging her feet on what I think is a pretty simple technological fix to make sure that the program continues to work and that it is meeting the needs of the officers who are going to be primary users of this of this tool. So I made these remarks not as a and not as a insult or criticism of the Seattle information technology department or SPD. I'm actually advocating for school because I really do I mean I think Comments around how disconnected officers are from being able to verify whether the person they're engaging with either in a social context answer otherwise is just not meeting their job that much harder and and at the same time while we're making the job harder for officers were also we're also doing an incredible disservice to the people who could be legitimately engaged in the LEAP program and begin to move on to a better place. So, I hope that we look like we can all continue to work together on this and that we can do that it with a sense of urgency and an end with sort of a anchor in knowing that this is the right direction for us now. So those those are those are all of my sentiments on this issue for now and let's go together. I just want to say what she just said. This is a no way a complaint about you all this is thanking you for the work that you've done in the coordination and for the officers to know that we want to have them we want to have their back. So I just add one more data point which is that we expanded to Soto a couple months ago about a month ago in our first referral was from a captain. That's how dedicated the police department is right now with his program and we have multiple rolling and ever since then so I want to thank all of the officers who see this as a viable to an option and who continue to share their experiences there positive experiences with the program and those are important important data points for us to have as a as members of the Publican is members of the city council. So I really appreciate your all's continued effort in collaboration does bettas come along way. And I think we're in a really positive space right now and we just need to be really serious about keeping up the momentum and the sense of urgency that I continue to hear from officers who feel like they don't have a viable tools at our disposal is real and I believe it's one of the contributing factors to the low morale and the police department and this is one of our tools available to us now to begin to turn the corner there. So that being said, I don't think it does anybody else have anything else to say before we adjourn No, great. Just so this weather lasts agenda item. I just want to remind and the viewing public that we will have a special convening of this committee on this Friday at 1 over the noon hour. It will be a lunch and learn we will be hosting Puget Sound Regional Council and transportation choices Coalition futurewise climate choices and others at the table to hear about the Puget Sound Regional councils Vision 2050, which is a plan around original gross and we're going to hopefully be able to send you the conversation not just on what that regional growth plan is, but but really Center Center that conversation and equity and making sure that those books were for this way from opportunity continue to be part of our region from housing to Transportation still really looking forward to hosting at that lunch and learn conversation here and Chambers. It's noon this Friday April 26th, and we look forward to seeing some of you there. If you are interested with that being said this meeting is adjourned to thank you.", "end_time": 8277.0}]}