{"format": "raw", "annotations": [], "confidence": 0.9460558247777213, "data": [{"start_time": 0, "text": "Good morning. Today is Wednesday, March 27th. 2019. It is 9:34 a.m. At this is our regularly scheduled meeting of the gender Equity safe communities new Americans and education committee. I'm countin overload and I want Silas chair of this committee and joining in the table is my colleague council member Rob Jan Johnson. Thank you for being here. So I don't know how to change your last name in English is so hard for me and there are two items on today's agenda first. We will we will be having another discussion on the 2018 families education preschool and promise and connotation a plan as proposed by mayor. Durkan. This is of course a little package that was really fast with Seattle voters in November 2018. And this committee meeting today. Okay. Yes on issue identification within the proposed implementation and evaluation plan. So I'm as usual we begin. Our meetings with some public, So before we continue into the items of the agenda. Individuals who showed up and Chambers today to provide a public comment on an issue on the agenda. And also each person is provided to two minutes to speak. Each speaker is asked to State their name before the record before they provide us with their public testimony public, is not a. Of time where public commenters and council members just engage in dialogue. This is an opportunity for the public commenters to show up in the morning to provide up to two minutes of public testimony consistent with Council rules and to the extent that the speaker is on topic and on point and compliant with all of council rules. They will not be interrupted if there. An interruption at it is because there is has been a violation of those Council rules and will be corrected. All right, so that being said it we will enter into the public comment. Person has up to two minutes to testify on an item on today's agenda. We only have one on today's agenda and each person will be asked to come up to one of the microphones up here in the front. So the first person is Alex Zimmerman at the second person is Melissa Westbrook followed by Kyle Lackey. A my microphone working why is camera not working? Why would I don't see my face into my agenda. I'm not the garbage. After anti-semite carukin creatina en pure criminal. Broward School lady. I sync School lettuce is good because as children need money or school not so good, but it's not money for school teacher because I see you know, you give you a couple examples why I sent you in school teacher not deserve more money number one because it's a beautiful in the mental. I repeat one Fundamental school teacher in school Union who support is not his Social Democratic. Mafia is his go for many years. Number one and number two. Because I am right now go to to menu school board meeting, you know, what is brainwashed has children to brainwash children thought of you right now not to Social Democratic Mafia such a stupid. I'm not to Social Democratic Mafia you going to go against the principle of American democracy is exactly what you are criminal 5. Can you turn the microphone on your time is up? You are not speaking into an item on the agenda. I meant to ask you to sit down. Next person is Melissa Westbrook followed by Kyle Lackey by Keith steer Van Essen. They should both work Melissa. Hold on just a second. Okay. There we go. Good morning. My name is the most widely read public education blog in Seattle in Washington state never went. Why are Charter Schools included in some funding like school-based but not others like wraparound Services number to why is Seattle schools required to have a signed partnership agreement in order for their High School grads to access promised funds charter schools are not that's page 103 number 3. Why is all the mention of serving homeless Student Center drowned Seattle schools. Well, it's true that Charter Schools serve far fewer homeless e l l and sped students there must be some homeless students in charter schools. Also, I assume this plan is fairly recent and yet I know that I'm page 72 it says SPS Source 2000 homeless students. It's closer to 3004. I do want to point out in the measuring outcomes. It is important to remember that Charter Schools counsels students out and their attrition rates tend to be much higher and therefore their graduation numbers look better. Number 5. Despite the frequent use of the phrase Charter Schools. It is not defined in the glossary charter schools are put in with the phrase under public schools, which they are, but according to the Washington state supreme court. They are not true, in schools under our States Constitution. I would say that definition need some clarification. Lastly to remind you Charter law does not require you to share these funds I along with many voters are asked during the Levee tan paint over and over Charter Schools would get K12 Levi dollars. We will tell the city was waiting for a legal opinion from the attorney Levy pass. I ask the city attorney's office for the legal opinion and was told there is none interesting that after you got the money. It was announced that Charter Schools could access those dollars when the charger law was passed Seattle Itself by wide margin voted. No. I'm surprised they won. The Mayors elected officials did not take that boat into account in deciding this, however when anybody on the council at where the mail runs again, I'll be glad to remind them. Thank you. Thank you. is Kyla Good morning, kind of lucky. I'm the director of postsecondary Readiness at that Puget Sound Educational Service District. We stopped at Puget Sound called in for your network. And as you know students today need post-secondary credentials in order to access to a p.m. This evening jobs, especially in the city of Seattle. I work across Pearson King County's and we know that right now to only 29% of current ninth-graders will be able to actually obtain those post holes within 6 years of graduation of high school. So unless we do something very different we should expect the same results and I'm excited to see the Seattle promise implementation plan and leave at this is something very different that our city is doing to take action on this issue. The Seattle promise is 19 people across different systems working together to Envision and refine support center that we're creating more Equitable opportunities for students in our region. I was part of the design team and saw the group comprised of leaders from Seattle colleges Seattle public schools in the city grapple with complex cross systems issues. The design team persisted through numerous challenges and complex decisions and work hard to refine and deepen a shared vision for how to create more Equitable post-secondary access systems in our region. We work to think outside the box Bridge gaps and utilize the promise as a way to make it easier for students to access their next step. There's excitement in the reason to support and learn from Seattle myteamworks to staff the Puget Sound Coalition for College and Career Readiness, and we're working on a King County promise model. We're excited to learn from it and partner West Seattle to support this access across the entire region. Thank you for your leadership in your commitment to supporting students in accessing their next step and Q and R last person signed up. Good morning. So I'm going to keep starving at 7 and I service a doctoral programs for the college success foundation in Seattle and the Greater King County region. And so and I was privileged to serve like Kyla on the design team in developing some of the recommendations for this implementation plan, and I'm really excited because my vested interest was really supporting the low-income students in our city in transitioning into college with secondary institutions. And so and the last 11 years since I've been in this work, the biggest challenge has been the disconnect between K-12 and post-secondary. And so this implementation plan I think has laser focus on really tying those institutions together and with supports and with funding that will help students transition more effectively enzyme brings people to the table from both those systems more regularly to ensure that that happens and so that's been the biggest rub for me and supporting the hundreds of students in South King County in Seattle. What years has been the fact that these institutions don't talk enough and coordinated enough. And now I think this is a great opportunity. This implementation plan isn't a wonderful step forward and I think it may while imperfect I think it will evolve into something that's going to be really effective to root move the needle for our students going forward. So I appreciate your time and effort in this and I look for your support in this fine. Thank you. Thank you so much. I'll write Keith was the last person who signed up on the sheet. Is there anybody else in Chambers who has not given us public testimony that would like to offer some I saw you walking in Renee perfect timing. It's like that announcement was made for you. Thank you have course. Sorry I'm late. I'm Renee Marie with Youth Development Executives of King County. And I did want to make a couple comments and thank you for the process. We've supported the fan since the beginning and in particular the inclusion of the community and looking at the implementation plan. I think we continue to hope for a little bit worried about how are you know expanded learning opportunities we're reduced but we think that how they're being implemented is wonderful and we appreciate the work. Thank you for thanking me anyone else. Okay. Well, I will go ahead and close out the public comment period want to thank everybody who took the time to show up today and provide us with their thoughts on this particular issue for those folks who can't unfortunately make time out of their busy. I'm scheduled to join us and Chambers at 9:30 a.m. On a Wednesday, which is probably I don't know 95% of the city. You are all welcome that to reach out to my office directly if you have any thoughts or concerns or ideas or just want to generally give us your feedback on the Fab Levi implementation and evaluation plan that you can reach out to my office at 206-684-8802. Or you can email me at Lorena. Gonzalez. That's Gonzalez with a z at the end at Seattle. Govt or you can always Connect with us on our Twitter or Facebook or Instagram accounts. We are accessible and ready to listen to your feedback on some of these issues. All right, so let's move into the agenda and I'm going to invite mr. Goodnight to join us at the table while Roxana reads the first and only agenda item into the record agenda item one families education preschool and promise Levy implementation plan for breathing in discussion. Alright, let's go ahead and start with introductions. Do you have a presentation or is it just turns TV is back on in the chambers. All right, let's do introductions and then we'll head over to your brain. Do you need help with presentations? You got it. There you go. Alright, okay. Thank you. Take it away previous committee meeting on March 13th deal provided education preschool promise implementation and evaluation plan and that's something that was a stripper set the combination plan going forward and it raises at 8 issues for Council consideration. So last June the council approved ordinance 12560 for which the opposition to voters to fund Education Services with property tax generating 619.6 million dollars / 7 year. The composition was approved in November and with support from 69% of the voters at section 7 valuation plan that is approved by ordinance. And it specifies that the plan should include priority criteria and outcomes for Levi funding strategies in the process of schedule for Contracting with partners and the evaluation methodology to evaluate to measure individual Investments and evaluate the overall impact of the ability to one that provided funding guidance from any of the programs and also requested that the executive address specific policies and priorities in the plan. Add to cancel Bill one 19480 Wisconsin on March 5th. And if that's intended to meet the requirements of the organs and also to address the council resolution request the plan maintains the broad investment areas and spending levels from the approved ordinance. And if you're interested at the top of page to end table one now shown on the screen at those are the four broad investment areas and also the funding amounts for them. In addition to printing implication playing the council Bill also a men's the 2019 adopted budget and development deal intended to move to move away from the current practice of collecting preschool tuition from families and then submitting those payments to providers. So they decided against that policy shift and in order to still allow them to collect and then send the payment to Providers. They're asking for it has probation authority authority in the early learning PSL buys $860,000 and the ideas that is entirely backed by tuition Revenue. Says mentioned a moment ago at the council resolution to the levy organs last year which provided some guidance regarding the development of the implementation plan the proposed plan include a reference table that lists the council's priorities and the page numbers where that priority is addressed and some corrections to the stable were needed and so a revised table is attached to the back of this mental Attack One. At the next meeting, members may want to offer an amendment to correct this table and fix any other drafting errors that are identified from the resolution with a few exceptions specifically. There are three areas that are not fully addressed by the plan and that's prioritizing Investments for certain groups expectations for the Family Support Services funding and then the way that resources are prioritize for sale promise that all three of those items are dress by issues that will get you in a moment in the memo. That is attachment one to your memo. It appears that are out buying for technical changes is that an accurate characterization? It's just the references wanting to receive some directions on how to incorporate those into a suite of amendments. I think it's fair to say that we are fine with that advancing as a suite of No Russian from my colleague over here. Thank you. Check that one off your list. Excellent. I like to do that. At so at the last part of this is there three other items that were included in the council's resolution, but aren't a specific work. So the families out of the question to the FTP application to identify family is that might be eligible for the child care assistance program and they've indicated that they will continue to pursue opportunities to streamline the process where that's available. At the second is researching the concept of across subsidized tuition methodology ideal explore the concept but chose not to pursue it due to the concern that increasing tuition levels for higher-income families, May discourage their participation in the program. And this is a concept that will return to you in a moment as well at an issue number 3. And on the final the third one is exploring better coordination with the state preschool program at dealer stated that they will continue to look for opportunities to work with the states and also the city's office of intergovernmental relations on improvements a child care and preschool programs. Any one of these three categories with the exception of potentially number to does the implementation and evaluation plan or in any of your conversations with the Department of Education Early Learning. Has there been any indication as to when we can expect some work product in those categories timeline. I want to know if I win 3 are both are things that are kind of ongoing bodies of work, so we could build in something to that. We can make a request memo. We haven't discussed. Would it be appropriate to include council's expectations around timelines in the implementation evaluation plan as it relates to those two ongoing bodies of work. We absolutely good. Thank you. I would like to do so. Okay, if there aren't any other questions, we can move into the identified issues. Axel the first issue relates to Letty goals and outcomes and the proposed plan contains essentially one of each of those that needed to be expanded to appropriately recognize the Levee activities and then the prioritize groups. So it's quick background data plan includes one goal and many outcomes for each of those for investment areas and also contains the goal and outcome for the Levi overall interested in the proposed plan a complete list can be found on page 10, which is table number two in the implementation plan. At to the person that you require expansion is the proposed outcome for the Levi overall list at so implementation principle. Number one from the levy ordinance. I'm just going to read it here. So I don't get it wrong that states that prioritize Investments to ensure educational equity for historically underserved groups including African American black Hispanic Latino, Native American Pacific Islanders, underserved Asian populations other students of color Refugee and immigrant homeless English language Learners and lgbtq students. Abbreviated listen to love the outcomes omits the final four groups from that list. So Refugee and immigrant homeless English language Learners and lgbtq students also occurs. In other sections of the plan include infections related to the intended recipients for K through 12 Investments, and also the priority prioritization process for the funds. At moving on the 2nd of may need expansion is the proposed goal for the K through 12 school and community-based investment area. The proposed goal as drafted reads Seattle students have access to college and job Readiness experiences that promote High School graduation at this is a rather narrow focus on College and job Readiness experiences and doesn't account for the breath of the wild thyme academic preparation social emotional skill development at those besides things. So with respect to your potential options driving school down at the poor job of keeping this is just to accept the proposed plan. That's always been to be option A where there are other multiple options of do just be to see some combination thereof are of course any other option except for this one specifically left off the list other references in the plan where it's appropriate that also be updated to reflect that complete list and an option C relates to the K to 12 gold more broadly applicable to the levy activities and two younger K through 12 students. Compare Johnson, I think I'm well, it is certainly true that we want to make sure that are high school kids are very focused on College and Career Readiness. I think that the way that the school is run right now is to your point from earlier pretty narrowly defined and form Eve thinking about this for the eighth side of things. I would love for us to talk through option C in a little bit more detail because College and Career Readiness is something that I think even 9th graders can really grasp in concept the bang not even be totally ready for some seniors that I know may not be totally ready and understand that College and Career grade environment thinking about some of these options that you've outlined as part of their goals and objectives weather that's instructional time academic preparedness social emotional health and well-being. Additions to this community-based call. So I'd love for us to talk to her an amendment that would broaden that slightly to think through a little bit more about what some of those K-8 goals could be outside the great. Thank you. I would concur with that. So it sounds like we will advance a version of option C lights at pursue option be as well to make sure that it's the overall Levi outcome is reflective of what cancels intent was in terms of who would be prioritized through these limited resources. That's so it moving on tissue number 2 at the proposed plan as it is drafted contains language that would allow deal to modify elements of the plan throughout the during the term of the lady without Council approval include some resource allocations and eligibility criteria. For example on page 77 related to K through 12 wraparound services at the plain states deal has the authority to reallocate resources over the life of the living as determined by program outcomes student need local funding opportunities demographic changes and district and state policy shifts. There's also another example that's provided in the memo is up on the screen related to the Seattle promise program and this type of modification authority authority is currently scattered throughout the plant in about 17 different sections in the references aren't all the same somebody comfortable delegating some of the Authority for instance at one of them is the ability to issue additional competitive funding process these but you know, it seems in the normal course of business for a deal. Control model for how to handle plan modifications that can be found by looking back at the implementation plan for the Seattle preschool program essentially in the overview section. Listen circumstances where modifications would require Council approve light by ordinance and then a separate section that required written notification to the council for modifications so that I could be a model to follow at in addition in addition to controlling those specific modifications Council may also have reports on Adams address invitation plan. And then also any other things that Council would just like regular reporting on in to be specified at so the options are. I can be used to create a new section or appendix that would specify which modifications required. See, which is could be a complimentary is to have a section that identifies what reporting requirements to have a press to contemplate Brian is the housing Levy's implementation and evaluation planner, or we as a council don't regularly approve that every year. However, would you get regular reports on things like the implementation and acceptance of our multifamily tax exemption credit projects or the construction of new affordable housing units by type for example for us to continue to see from the Department of Education Early Learning that's about enrollment numbers different in different School, Bass. That's about the Partnerships that we might have it after school providers. There's a level of detail there. I think that that is can be overwhelming to be shared with folks which I think it is going to be really great to work on. I want to see the assigned partnership agreements that we may have between the city and the school district as well. Those are gremlins. I presume we would never want to go all the way up to council for Signature. But those kind of partnership Agreements are oftentimes good opportunities for proactive relationship building between the city and District in our partners. And so I'm getting updates about how those partnership Agreements are being signed when they are signed what they're about on those might be I think I'll pay interest to the council as well. So we Understand where we're working proactively together and continue to build off of that good relationship. So not suggesting that we be the ones who have to sign those. That's how I roll our job, but getting updates about what those partner what's inside those partner. And I am in terms of the model here. I think a model that has worked really well in the past and in this specific context of deal in of education related programs is around surf how we have structured. Spp what we lay out his principles or criteria related to when we expect a deal to come back to us and and effectively request a modification. Am I do think it's it's an important part of the council's oversight role to make sure that if there is a fundamental shift away from a council priority, for example, or from a potential aspect of the nuts and bolts of the ordinance that adopt This particular Levi. I think those are those are reasonable spaces for deal to expect to have to come back to the city council as the oversight and 2T to seek permission and request to modify. The program's accordingly. I think where the where the line gets tricky is is trying to make sure that we allow the department to have that the flexibility that they need to be able to continue to innovate and too and to be flexible based on responses that they're hearing from some new programs or emerging programs that they're investing in and I think that is her from my experience and understanding of how it has worked in the SBP contacts that model has been able to achieve both back flexibility, but also the expectation and compliance with councils responsibilities to continue to exert oversight. So I'd be interested in pursuing it as PP model. Thanks. The third issue in the most relates to be proposed. Spp tuition scale and concerned that it would increase subsidies for families at the higher end of the income Spectrum relative to the current tuition. Scale train is PP implementation plan from 2015. The scale charges families with household incomes greater than 300% of the federal poverty level for FPL a percentage of the cost at reminder account both household size and family income and the scale in the plan ensures that household of a similar-sized pay progressively more as their income Rises families swim practice. The scale goes from 301% up to 760% of FPL at which point the tuition subsidy is about $535 per year and I maximum tuition amount that family pays about $10,170 per year. At just in terms of calculating how you know what the subsidy level is essentially. We're comparing the family's total tuition amount compared to the average amount of the city pays directly to providers that for Direct Services and the department refers to this as that bass slot cost at the first is that it increases the free tuition threshold from 300% FPL up to 350% fpl. The second is that it's simple simplifies the administrative complexity of scale by reducing the number of steps. And then the third is the maximum amount of $10,000 and this third changes where the potential issue lies has proposed that the maximum amount that can be charged without encouraging them to see Christmas services outside of the program. Spp at the base lot cost for next year until families at this at the top end of the scale would receive a city of about $1,000 at just in terms of How It's structured in addition to the proposed scale reaches its maximum tuition amount at 711% of FPL rather than going up to 760% like the current model. So the option that identified is course, we can just for families at the top end of the income scale changes to that top income amount could also include revising the number of steps that's contained within the system. And also how far up on the FPL scale we go and increasing that Box, so a couple of thoughts Brian one of which is a part of the goal of having a voter-approved preschool program is to provide some level of subsidies to almost everybody in the program. Obviously. I was one of those folks that pushed in the resolution for us to consider cross subsidized model has prevented a not be a preferred option for us to consider this point in time, but I think the $1,000 steps to do something. I don't need to understand a little bit more about I do believe everybody participate in the program should receive some level of subsidy. But as I'm articulated a disabled many of time I still believe that a 6 hour a day Model 5 days a week for a family at that level. They're getting a heck of a deal. Compared to what? They would be getting on the private Marketplace. No full disclosure for the last time. I was riding a preschool tuition check for 3 days a week for 4 hours per morning. We were paying me $11,000 a year ranged. It was a good school. It was not an spp certified school. It was not a six-hour day model is not 5 days a week. So I think that there are there are a lot of benefits to our program and I think that we should be offering some level of subsidy, but I haven't landed yet on whether $1,000 or not quite subsidizing at 10% but almost a 10% subsidies the right level. I also am curious to understand a little bit more folks in the early learning team continue to contemplate the difference between a Sig Sauer model and a 10-hour model whether or not that affects both this based base. SWAT cost and how much families might be paying intuition as we contemplate reaching out to providers who have suggested it would be more likely to participate in the program. If a 10-hour model was an option for them. So I want to make that up. A1 Amendment discussion because I think it was great to see the scale shrink because of the 850 different options that people could 406 different options that people is really hard but I still think it's worthwhile for having us spend a little more time talking about at that upper tier how much subsidies should those folks get cuz I think we should get some but how much is the right question and then does that change if it is a 10 hours lot model versus a 6 hours on model on what are the impacts of that slot cost and the subsidy associated with it. So sick. Threw the chair may have already thought the role of these things and she's got an answer ready to go. If so, I'm excited to hear it. But if not, I love the chance to think that a little more. I think I agree with that observation. I don't think we have clear answers to how the model is impacted. If we assume 6 our time slots vs 10 hour time slot since I think that's that some work that we would need to to do offline to get a better sense of how this model as proposed would be impacted by longer day or how we can modify the subsidisation levels by ratcheting up the seven 11% for example or ratcheting down the bottom to also and then layer over the number of hours available. I think those are things that we would need to play with and experiment with before we have a clear sense of how How the the model impacts the overall number of slots that we will have available by doing that kind of a modification cuz obviously want to also stay true and committed to our intent to nearly double the number of on preschool units seats available for kids in the city. So Brian is that enough sense to be able to time work on something of the next couple of weeks has been kind of us about how the tuition scale is a scenario was with him would be happy to do that has happened share them with you and crazy kind of platform allow you to also modify the number of hours. Before and after the 6 hours has been through the child care assistance program type of funding which is still provided through the levy but it's in that different program. So how the 10-hour day would would affect that Mia. Let's take a look at all of those variables including the folks from deal in the audience today. So I know that they're listening and taking notes and that will hopefully allow they work with us on on seeing if we can move some of those some of those guys in a way that still meets the ultimate goal of wanting to meaningfully expand the number of preschool slots available for kids in the city while also really staying true to what I think the ultimate switch is to have mixed-income classrooms throughout the city and we know that that that is a model for For a high-quality preschool and is in riches the preschool experience for everybody who's participating in the preschool program. So I hope you have enough direction. If you don't you can you can come and chat with us after we can we can share with you a little bit more about our thoughts on spectrum is to really understand how many of those families we have. So if we have a very small percentage of those families and we can understand that a difference of between $1,000 subsidy and a $500 subsidy creates Let's Pretend five more slots those five more slots. Maybe that may not have been able to access it before. However, we may have other institutional barriers that prevent those five slots from even existing and so if we're going to make that effort To reduce the subsidy from $1,000 to $500 a year to open up five more slots, but that's five more stops can't get filled cuz we don't have providers who can really make the economics of adding five more spots work. Then that's not worth the intellectual or financial exercise in doing so, so that's the kind of interested in is how do we take that very upper echelon and squeak a little bit some of the subsidies that they are receiving and see if that creates more slots and if it does and the slots are real, but I think it's worth considering and if it does but the slots are real it's not and if it doesn't and it it's not then it's definitely not right. So, I think that's just my personal. Thank you. Let's move on. Ask before that she relates to Family Support Services and the uncertainty with how the investment will be utilized after the first year due to the Seattle School District's effort to develop a Coordinated Care plan. That's a dream that 2011 families and education Levy. The city Splendid Family Support Services in essentially two different ways. So the first way is through an agreement with public health seattle-king County and the second way is through Elementary Innovation School Investments at the funniness County Public Health has been passed through to the school district and that's provided for their centralized Family Support Program staff at schools based on the need and in the current school year. So the 2018-19 school year the city spending five family support workers and two administrative positions with those dollars. At the Family Support Services that are funded with Innovation schools are for those schools that receive the school-based Investments and those schools have chosen to find a family support worker as a strategy in order to help them meet their Levi investment outcomes. And in the score in the current school year six schools have used renovation funds in that way. Ideal Protein the contractor directly with Seattle Public Schools as opposed to our family support services at separate from how we had gone through Public Health in the past and the plan states that deal in the district will collaborate to identify which schools will receive services and the funds will be directed generally towards schools with high concentration to students. For example, that aren't meeting grade level standards that aren't scoring or making progress on making progress on state assessments that are experiencing homelessness. Now in considering the fat lady last year, Salida 3.6 million dollars to the Family Support Services area for a total of 14 and 1/2 million dollars over the Levee. This was intended to provide resources sufficient to cover the equivalent of 15 * Port workers and their Associated costs. And according to the old the district has requested flexibility to develop a Coordinated Care plan for family supports in order to maximize the number of students that are receiving services. And then what happened to this plan B involves utilizing different job classifications to provide those services and it's the district's intent to develop is playing over the next year. At so during that year. Deal is going to is intended to provide funding to the district to support family support workers at the elementary schools that have in the past chosen to positions with Innovation funds and then remainder of the money would go to the centralized program beyond the first unclear how many District staff would be provided services within schools. And then also what the job classifications for those workers would be so the options that are laid out in the memo or two, of course just accept the plan is this going to be drafted or to essentially since we don't know what it will be to request periodic status reports from deal during the development of the airplanes are in the district. And then also in advance of actually the deal entering into a budget agreement with the district for the 20 2021 school year on how those services will be Friday increase that information to the council. On this one. So I think the reasonable option here in large part because we don't know what we don't know is that option b in my mind, I will just say that I think really explored investment in this area. And this is one of those areas that we worked really hard to restore some funding to you or protect the funding of to make sure that the city didn't back away from from this particular investment is the bottom line is that these Investments were made. With the intent to to backfill. I mean, I think we had a very strong intent to supplement existing Investments that are happening as it relates to family support workers within the K through 12 system and whatever the Model is and however the district chooses to ultimately administer their program is I think appropriate for the district to determine but I think it's important for the school district to understand that that are our goal. I think our shared goal is that that we will not be back knowing that this is actually intended to supplement existing investments in this space and in our hope is that the school district will continue to partner with us in his face and and and continue to invest at the level that they have been historically investing in this area in order to get these really critically important wraparound services to students who who really needed and I had an opportunity to sit down with a group of family support workers who work in a k through 12 system a couple weeks ago and the the stories of Help that they give to students in the kitchen post system are just really impressive. I'm stories of of people in a driving driving kids to hotels in of driving them to shelters driving them in their family to to immediate Housing Opportunity, you know being that that safe place for them to not only express if you're having housing instability, but then knowing that the person that they're telling it to you is actually ready willing and able to do anything they can to help them find that stability is is so important and we had a great meeting with school board members yesterday here at City Hall and heard from them that they understand that this is an important function that important service that is provided to students and their families in the K through 12 system in my hope. Is it again setting aside how the district chooses to I'm at least manage the program. It's important for the city to take the position that that we're not back selling services. Here. We we we intend for these dollars to be leveraged in equal parts with the district or anything like that that just moved a bunch of challenges. I hope what we are doing with this level of investment is protecting those positions from being on The Chopping Block. So I think that that is your point we need to leave it up to the district to figure out how to administer that but I I would hate to be in the position where a year from now to years from now or with a potential budget downturn that we are back in this place again where we're putting family support worker. The first of the Librarians are other important functions within a school in and of itself. I'd like to think that our investment is going to make Sure, that those family support worker stay there so that they can continue to provide that very valuable resource that you talked about persons. Issue Number 5 released to the Seattle promise program and how the proposed allocations for financial support strategies may need to be reallocated overtime to ensure that equity for the students that are being prioritized the promise program contains two strategies that provide financial support to participants to assist with the cost of attending college. So the first strategy and that's the last dollar scholarship that covers all tuition cost after federal and state supports an individual student scholarships are Applied Nutrition related expenses such as books fees Child Care Transportation, things like that. At the continued resolution adopted in 2018 alongside the Levee ordinance requested that the implementation plan provide an equitable methodology for prioritizing resources to students with the greatest need if necessary the proposed plan on page 102. Does this for the tuition strategy and provide the privatization process for if demand exceeds demand for tuition exceeds Supply between the Christian charity and the equity scholarship. So in general the lowest income to receive federal or state tuition support and they won't need support from the Seattle promise tuition bucket at least likely with a zero expected family contribution EFC and those dudes are eligible for the equity scholarship at students with higher incomes. They might receive not enough for the might receive might not receive any Financial or state aid to attend college. And so therefore they would receive support from the promise program and this those students would not be eligible for the equity scholarship. So essentially the program design Most likely, students would only be receiving financial support through one of the two buckets at the proposed plan allocate $69 for over the 7-year Levi for the tuition strategy and a little more than three point six $9 for the equity scholarship strategy in the program and the demographics of the students that participate the allegations may be entirely sufficient or they may need may need to be reallocated overtime at meet soon. So that the concern is that if there are more students that are eligible for a scholarship and that bucket doesn't have enough money in it if there's access money in the tuition bucket. It may need to be real K between those two. That's the options identified are to accept the planet rafting or to essentially again. This is another situation where we don't really know what the what the uptake is going to be. So refreshed that deal provide detailed reporting for the council during the first years of the program including both the demographic information of the participants and also the expenditures by strategy to ensure that the funding allocations are adequately serving the prioritize group. Seems like we should go with option b on this one. And thanks for leaving that out Brian and it was complicated to to the mapping. So I appreciate appreciate the the clear and concise description in the memo. Just I feel like I need to reiterate that thing that I said on several occasions of the committee, which is I think our goal here is to intend to serve those kids who may not have the same sort of access because of their financial circumstances or other institutional barriers that they have and ensure that the kids who a benefit from A system that encourages them to go to school that it's not those kids who are the first 575 corn cabin in the queue. So I think of this reporting is going to be really important to ensure that the goals that we have are aligned with the students who are participating. Let's make sure that the first 575 kid's arm from Lincoln and Roosevelt and let's make sure that it's the kids who we have intended to be doing a lot of Outreach on and I know that that's the objective of the Departments and I know that that's the objective of the mayor and I know that it's the objective of Seattle colleges and I know it's our objective to but I think having some reporting out to ensure that that is the outcome is going to be more careful and aware of the potential of unintended consequences of well-intentioned well-meaning policy choices. And I think this is one of those spaces where we want to make sure that we are very intentional and deliberate and monitoring what we're actually seen happen in the deployment of these investment investment said to make sure that we don't have those unintended consequences. 666 related to the design of the Seattle promise program and how is targeted towards students were able to attend college on a full-time basis, which could I be effective excluding part-time students that would benefit from the program supports. The program is a cohort model, which is that students who graduate high school and then they would have 10 full time for 2 years or up to 90 credits full-time enrollment credits during the fall winter and spring quarters and then attendance in the summer quarter is optional and the planet design decision by stating that cohort models for higher education have proven to be successful and supporting students through program completion and building a sense of peer support. According to data from the national Center for Education statistics, which is located within the US Department of Education at a 62% of students attending to your institutions in 2016. Attendant part-time tell colleges experiences similar enrollment rates with 64% of those teams this year in rolling on a part-time basis. Now the promise program is built at is designed to just Target first-time college students that have just graduated from high school as we just said so of the total enrollment of the students are those types of students at our first time just out of high school students, even if that group 43% of students attend part-time. So given this large percentage does Mayfield to serve a significant number of the students that could benefit from the program. There's such a two ways that part-time enrollment could be addressed. The first is to allow students to attend part-time on a temporary basis. I'll just a promise program students May appeal to enroll less than full-time on a quarterly basis. And so they actually already doing that but the plan is it doesn't make that any clearer second way would be to address Parkside students would be to open it up two students that want or need to attend part-time on an exclusive basis. So developing the policies and requirements for exclusive part-time attendance would like Include a collaborative effort between the city and Seattle colleges at for example, determine how long a student would get so giving it'll take some work the effort me a line with a racial Equity toolkit process that deal is already intending to complete in 2021 and what its focus on right now is opportunity Youth and to Public Charter School students. I so once again these options aren't mutually exclusive. But so the first option would be to amending on the description section just to clarify that part-time attendance on a temporary basis is already available through an appeal process. And then option C would be to actually amended description of that potential program expansion to include part-time students and public charter schools than to have them. Also. Look at including part-time students in the program. I'll just say that I think this was an issue that that my office flag didn't conversations and offline conversations in meetings with DeLand Seattle colleges and I appreciate Brian your follow-up in with Seattle colleges. I'm getting some more data related to what what is this actual population at look like in terms of full-time attendance vs. Part-time attendance, and I personally was shocked by the numbers. I didn't appreciate until I received the report back from you Brian the high percentage of recent high school graduates who were attending Seattle colleges, but attending in a part-time basis, and and so I think that is really important for us to to meet students where they're at and part of that in my mind includes creating a meaningful pathway for public school students to I want to go into Community the commute the top Community College route to be able to do so and part-time. And so I think well, I appreciate and respect Seattle colleges commitment to wanting to focus resources on those who have high levels of rates of matriculation which tend to be students to go full-time. I don't I don't think it would be wise for us as policymakers to to ignore or or under fund Bonita part-time students to have the same supports and I believe that in doing so we will actually be able to turn the corner on potentially even seen a better matriculation rates from a part-time students in and that to me is an important policy goal. Can I ask if you question can you say a little bit more about the appeals process? It sounds like that that's something that people can do now high school student who is currently enrolled in the our current version of the Seattle promise program could appeal to be a part-time attendee. But what does that process look like to know my understanding is that part of the promise program and the student? I don't think they could apply at currently right for this bill passes to attend exclusively on a part-time basis, but if a student was suspended work with their advisor to to attend the safe spring quarter of their Thirteenth Year. What to do so that's pretty much all the information and I understand about broken right now, but it's it's not explicit. If you just read the text that they drafted it specifically says that it's for a full-time orders order various members of the Seattle colleges sit at the table. They've talked a lot about how important those advisers are to their model and how they believe those advisers are going to be real guideposts for a lot of the students that are going through this I think even going so far as to talk about the limiting valve ratio of students that an individual advisor can advise I'd be interested in somebody to the program. I'm on a part-time basis and how we might be able to give that tool to the advisor a little bit more. Clearly then it sounds like it's being articulated right now that may solve the inherent tension. It sounds like this is an option that does exist, but it is rare and maybe not discussed until someone might come forward proactively and ask for it. There might be an option here that is available to us where we are being very upfront with advisers to say that it, you know, you're working with your students and you know your students best and if you've got somebody she's got a life event going into their 13th year that's going to keep them from a turkey living full-time, but you still think that they are the kind of kid that is going to really benefit from the program. We should be talking with that kid about a part-time option. So understanding a real role to play in that appeals process. I think would be helpful. I just did feels process in of itself and then appealed doesn't sound great to me like I have to appeal to get access to this thing. But instead to think That's just a really viable option for people nomenclature matters. And I think I'd be interested to know a little bit more about how we can change some of that nomenclature to allow for this is more of an option that we promote a time but one that advisers know is available to their students, you know as the number of students returning part-time but also the number of students who are not coming straight from high-school over 4,000 23900 students who are not coming straight from high school. So I think is a select one. So if we can be discreet about that population getting access to this going to the beds going to be an important Pathway to your point timeshare to make sure that we do Encourage access for everybody regardless of your economic circumstance High School recent high school graduates 43% of those are attending part-time that that that is an astonishing number of students. I'm so I think I think creating some path to acknowledge that that that that is that is who we are trying to help is really important and You know, I just feel really strongly that that not paying attention to part-time students is of huge mistake and doesn't feel good to me. Let's make that happen Ryan. Okay, moving on tissue number 7. That's not the March 13th committee meeting, members requested additional information on the satisfactory academic progress or sap eligibility milestone in general sap requirements are determined by individual colleges and are applicable to students that are not covering their education cost independently, so I can be any student that is having state or federal financial aid at the three essential elements are maintaining a minimum cumulative grade-point average percentage of credits relative to the number of credits attempted. And then the third one is making sufficient progress towards completion of the degree or credential. So depending on the funding source, 125% or 150% of the normal program duration. So if you were trying trying to pursue a degree that required 90 credits, they would have to complete it within up to 135 attempted credits that's progress marker. ATS tune performance review both annually and cordially and students can either be in good standing can be put in a probationary status warning status or become ineligible for financial aid students do have the right to appeal an in eligibility status and if they're successful in their place and into a probationary status requirements are required. However, since the day I promise program is designed to provide a variety of wraparound support the students than the city may want to keep an eye on how the sap requirements are affecting different groups of students and that's kind of where the options and I will pull them up where they sent her an option b is to essentially men the plan again, I link to the racial Equity to look at process, but for sale promise of an evaluation of where the apartments are there if they're disproportionately affecting certain groups of students. And then which that makes may suggest that adjustments are needed to the types of supports of the program provides. I think that's a reasonable approach and we have been against spending a lot of time with DeLand Seattle colleges talking about this concept around unintended consequences and there's a very large dream where we can have disproportionate ental disproportionate impact on students that we intend to actually be supporting and helping and I think this is one of one of those areas. So while we while I understand and appreciate that we can't modify the colleges legally mandated satisfactory academic progress. I do think it is. It is reasonable for us at the city as a city that is investing in this space to make sure we have a good clear understanding of how those particular legal requirements may or may not be disproportionately affecting certain groups of students that we have set RB. Pyritized through these Investments and my hope is that that will as you've indicated on shift and be flexible. Last one is she never date for the final issue relates to the types of advisory services that are provided to promise students. So again at the March 13th, students will be informed about and connected to complimentary services or assistance programs that they might be eligible for one of his students actually begins in high school and then continues throughout their thirteenth and fourteenth year as I mentioned a couple months ago during their time, at least there's that hundred to one ratio Johnson reference in addition to providing programming course registration and referring them to other rooms other campus support that may be available at least some of these before but it doesn't really explain. Describe the range of programs and services that may be applicable especially would be to amend the plan to provide additional Direction regarding the types of referral in connection services. That should be provided by there's there's be explicit about that list of programs and then option C would be to request that deal in this kind of a process to report back to the Council on the referral rates of Seattle College advisors, and then also the successful student connections at to the to the programs. I like both of those. Added to matter chair. And again Brian. I think the words here matter. I'm a reference this when we talked to the last Khmer discussion, but you know a question on a form that would ask. Are you eligible to receive low-income fare ORCA card versus a question on the phone that would ask would you be interested in receiving a low-income fare ORCA card that is it was two different pieces of information one, which says I am in an economic circumstance that requires me to get access to this in order to make ends meet the other is wow. I really love that benefited if I'm eligible for it. And so I think even just a framing of how we talked about availability of services really matters here too. So I like the both of these options and would love to understand a little bit about how we're going to be continuing to ask students how they might need additional help. Alright, that's the only item and I wanted to just give folks a quick reminder next week April 2nd related to any additional issues or potential amendments to the information evaluation plan. They are due to cancel Central staff. That's to bring goodnight in a leap energy by close of business on April 2nd. I sent out a email to all of my colleagues yesterday as a reminder of that deadline and so it's my expectation that been any potential amendments for consideration by the committee will be submitted on April 2nd and and it's fair to say that I will be loath to consider any amendments that come to us after April 2nd of 2019. We will have a special. Committee meeting of this committee on April 18th. That's a Thursday at 2 p.m. Here in council chambers to consider all of the amendatory language both Technical and substantive and to consider a possible vote on those on those amendments. If all goes well, we will likely have an amended package available for city council city council consideration on April 22nd of 2018 at 2 p.m. During our regularly scheduled full counsel. So before we adjourn wanted to say thank you to the parent education and early learning for sticking it out with us and for all of your hard work and getting us to this point in this draft of the implementation and evaluation plan really have appreciated working with all of you today. And I'm sure we will continue to work well with you all to make sure that we get this right also. I think the members of the fat Levy oversight committee who did the hard Advance work for several months before the package was transmitted to city council and was really excited to hear that. They didn't the February loc meeting the loc unanimously recommended the advancement of the implementation and evaluation plan. So I really appreciate all of their work in making sure that the issues they care about and the issues that the communities they represent are included in reflected in in the base plan. So really a lot of good stuff here really excited about it and then lastly acknowledge the last Committee hearing in this committee, as a member of this committee have really had a pleasure of having you be one of my colleagues on this. I really enjoyed over the last two years. Is it for two years? Yes, and I really appreciated your thoughtfulness and the fact that you show up and that you are always ready to do the work and that you have been just rid of a really strong Ally for me and championing the needs of our kids and families. And of course we're talking about educational but you've also been there along the way for everything related to Public Safety and gender Equity issues and immigrant and Refugee issues and just really have appreciated the opportunity to serve with you in in this committee and and just want to thank you for all of your service in this committee and Beyond to the people of Seattle, so there are some folks in the audience. So I think we should applaud councilmember Johnson. And if you'd like to give any remarks. He's going to save all his words for April 1st will no longer be on the city council after April 5th. So just want to really acknowledge Republic Service. Thank you. That is the end of our agenda there being no additional business before the committee. We are adjourned.", "end_time": 4405.1}]}