{"format": "raw", "annotations": [], "confidence": 0.930361992481983, "data": [{"start_time": 0, "text": "Good afternoon. Thank you for being here and City Hall the May 13th 2019 city council meeting will come to order. I'm it's two 2 p.m. I'm Bruce Arrow present to cancel the clerk. Please call the roll. Thank you very much this point I'll move to adopt the introduction referral calendar. I do have an amendment. I'd like to make I'd like to amend the proposed introduction afro calendar by amending item to which is Constable 119515 by deleting Council the name War as by adding her bold as a sponsor of the bill. Is there a second the second of two basically, correct a typographical error that was made. Any questions or comments? All those in favor of the amendment say I I opposed the eyes have it. So at this point I will formally move to amend the proposed introduction referral calendar as a minister second all those in favor. Please say I opposed the eyes have it. The calendar is adopted as amended. There's no objections days. Agenda will be adopted. You know Jackson today's agenda is adopted the minutes of the April 22nd and 29th. 2019 City Council meetings have been reviewed and if there's no objection than minutes will be signed. interjection, the minister being signed presentations are not aware of any presentations this afternoon. To move to a public comment on item that appear. Piers on today's agenda the introduction for a calendar or our 2019 work program. I call you out in the order that you signed up will start start off with mr. David Haynes followed by Troy Schroeder. Good afternoon. This is regarding Ordinance one 19509 in order to solve the low Acuity problems. The fire department is faced with the city council is going to have to face the fact that indeed their policies have imploded society and despite the demands of city council to silent police about their hands being tied. The city council has been a supporter of policies that literally exempt the low-level drug pushers who are low dollar amounts listed nonviolent from jail. This little literally has resulted in cops refusing to go after the drug pushers resulting in a societal implosion city council signed off on a sabotage police reform they willingly deceive about Call the fact that low-level drug pushers are Exempted from jail and deportation with malt liquor. That should be prohibited for being an artificially fake beer whose taxes literally pay cops over time has resulted in an open container policy like Society were living in as if we're in Vegas with the added convenience for criminals to sell 3 grams of crack 4 grams of meth and 3 grams of heroin to those saturated Malt Liquor, cuz cops would rather do homeless sweeps and work overtime at sports game or Corral be seeking activists or Worse Moonlight for private Finance overtime protecting bars in Belltown as crack operations. Take over the Catholic Housing Services building at the Keeter Gardens due to cost refusal to address real crime only focusing on revenue-generating and out-of-sight out-of-mind perceptions of a rich and successful City. City council should take a sober look at their policy of appeasement to certain political activists and lobbyists who benefit from a bunch of addicts used by college pukes issuing alternative juul, drugs popping up dilapidated real estate working at a plant off the demise of society and closing because Seattle council is allowing place to get away with a racist agenda in order to make you an integrated system work. You still have to hold that social welfare, and it should be accountable all the six-figure salaries. Thank you. Mr. Haynes sideneck speakers will be Troy Schroeder Fall by Christopher King. Hi, my name is Troy. I'm here today is a volunteer for you and knighted unified Seattle and I'm making the statement today because in no way is enabling an addict to feed their addiction by providing them with needles or shelving someone in a shack without any opportunity for sobriety or stability away for anyone to overcome homelessness or addiction compassion is not making someone move from temporary home to temporary home with no route to permanent housing shelving people in Shacks without any form of treatment or Rehabilitation is not sharing our Humanity compassion is helping homeless individuals. Get back on the right path where they are no longer saying hello to you from the pavement, but from a place as they can call their own home putting someone in a shack without any sort of structure that encourages transition info permanent housing is not going to improve anyone's homeless situation. And compare encampments or any homeless program that's main objective is not translating homeless individuals into permanent housing is a failure bill here from the start the Lake Union failure from the start the Lake Union and Cameron in South Lake Union is an example of that type of failure failure. The encampment is set up in the same structure of it's now closed for seizure. Licton Springs lichten Springs, which has already suco mode to its inevitable failure. The Lake Union and comment will be soon to follow leaving its residents. Once again without any Avenue out of the Vicious Cycle of homelessness. We need realest lucian's not Shack. Thank you, sir. Following Christopher King will be Marguerite Richard. Thank you, everyone. City folks that I trusted the press in this town. I trusted you guys start your time over to your right in the middle of the council. I remember the day that I trusted the press in this town and I trusted you guys on crime and homelessness and helping Seattle homeowners, Nick Licata and Thomas want acknowledge the banks criminal activity against homeowners and I made videos of her first campaign for free. I made a video with Michael Brian in the man who got his ear bitten off at the park. I thought it was an anomaly it's not as some of you with other candidates attended of for my co-hosted with Michelle Darnell and safe, but helping homeowners. My mortgage is because I was a closing attorney. I ran a title company and Michelle is what type of a paralegal we worked on homeowner mediations together. I thought you guys cared well, then there was at Murray but listen Blanca will since then you ignored your own paid consultant about suing mortgage electronic registration. Services and Tim Burgess in my opinion the slimiest politician I've ever met severely shut her down, even though counties in Oregon have successfully sued murderers and I leave the audit and you were slow to produce and I successfully sued you to get the documents. That's why you didn't tumors in the first place and all I got was a bunch of redactions. Okay, and homeless problem continues unabated with homeless folks being shuffled around town back and forth the same spot the occupy the last month. Okay, and are you to being abused sexually some of them use for money or committing crimes themselves? Remember the Volkswagen rape? Yeah. She's a friend of mine and you have no clue or any plan what to do whatsoever. Everywhere we go. We are under siege in this town. You are completely feckless in this whole Endeavor. All right now, I'm at King cast mortgage movies Chris King's first amendment page for those who got TV who can't find me because you won't find me through traditional press cuz they won't talk about these issues. Seattle City council Seattle City council for the homeless situation is not working. Thank you. Mr. King. Thank you for testimony for move to thank you sir, Richard. Yes, good day everyone. I'm I'm here because I'm a person that was born and raised in Seattle. And I feel like my rights are being violated and I think anybody that is familiar with Jim Crow and the things that happened during Jim Crow should have a clear understanding that Jim Crow and his imps are still lingering in our black community. So I'm insulted when I come down here because I feel like you're allowing people to develop inferior inferiority complex, and I'm not inferior. Like I said when your time is up you going right back out to the community before you came down here. So that's why you don't mean anything to me. Okay, because all it is is a title, but it's not a title to infringe on my human rights and my civil rights. You don't have that right? And so we're still way back 10 years, maybe four hundred years or more about the destitute that happened because people such as yourself did not listen to the plight of today and what was happening to humanity then so we speeded it up in this 2019 and then you flipping the script and throwing people out because you want to hear what you want to hear but people are just people and they're going to speak according to what they feel is in their heart to speak. So this stuff is going on up in here. I don't Stand it and I've been begging you and pleading with you to help me to understand it. Okay, cuz we did I was shooting over there and I think I've talked about the Central District but I put it on mr. Wants mine on tomorrow since my time is up for sure or less speaker is The Honorable Michael Fuller Suey Juris. Yes, I'm all about Michael Fuller. I'm devastated with this lying to y'all. I tried to decrease homelessness, but what y'all Democrats do turn around and increase homelessness. And now I'm cooking it already, but you have the audacity and the function to pay in the state of Washington and Seattle, Washington 13003. Sally Bradshaw April 3, 04 can't slow HR 3.03 of freedom from discrimination Tummy control, October 24th 1954 that was signed by President Dwight Eisenhower. Thank you, sir. Thank you. I'm trying to put y'all in here. Thank you very much. Okay, thank you very much. You're so that'll in our public comment section and will move to the payment of the bills section. Please read the title in Clemson or during the payment thereof. Go move to pascals bill 11951 for the bill pass any for the comments. It's not please call the roll on the passage of the bill Gonzalez purple Juarez O'Brien, Jayco. President Harold, please. Read the first item one 19509 relating to a mobile Integrated Health pilot. How many ornaments 1257 24 which adopted the 2018 budget changing for patience to various departments and budget control levels. Look in your Proviso and are fine for me surgeon piroxicam me to recommend someone passes amended and then I will hand it over to a customer bagshot who's the Prime sponsor of this effort? Cancel Bill 19509 immense the 2019 adopted budget by lifting a Proviso on $475,000 held in finance General and appropriating those funds to the Seattle Fire Department for the purpose of implementing the mobile Integrated Health Unit pilot program these funds. Originally Proviso Road and held and finance General Reserve in accordance with Greensheet 13 - 40 - 8 - 3 this Greensheet was sponsored by council member bagshot who's been advocating for the piloting of this program for several years and for that we really want to thank her cousin, her bags are the Greensheet directed The Executive to develop and report back to the Council on the implementation plan for this proposed pilot program and last week on May 8th. My committee received a briefing on that proposed plan. This Council Bill allows at the Seattle Fire Department to operationalize the mobile Integrated Health Unit by the third quarter of this year 2019. The unit will be comprised of two of firefighter EMTs and one social worker or mental health professional the unit will operate primarily in the urban core and is intended to reduce the low Acuity call volume and preserve Preserve at 911 services. Better meeting the needs of 911 colors the executive and the Seattle Fire Department studied similar models and other jurisdictions both locally and nationally and coordinated with the Seattle Police Department of Human Services Department. And the Seattle King County Public Health Agency in developing, the implementation plan for this pilot program. The bill was amended in my committee to add additional layers to data collection and Reporting requirements. The base bill came already with requirements around data collection evaluation and Reporting Advanced through committee a particular amendments that would ensure that the Seattle Fire Department as part of the overall evaluation would develop evaluate additional measures that might help the city determine if the pilot program as we take it to scale should be modified to include not supplant firefighters and EMTs are the social workers are behavioral. Health professionals but to add to those Services by including a registered nurse nurse practitioner or physician's assistant who could provide on-site immediate care I an event that is needed. These measures would evaluate whether a low Acuity patient could have benefited from infield care. If I just mentioned and treatment including suturing of mine are prescribing of pain relief medication and on-site psychosocial assessment this infield to treatment model exist in La as well as Kent Washington and our Central Staffing Lynchburg. Seuss communicate with us jurisdictions regarding their operations at which is why I Advanced that particular moment, it's a wait-and-see study evaluate and see how and if the pilot program it could be modified in the future again not by replacing the firefighter EMTs and the social worker mental health professional that will already be on the unit but to add to the suite of services that those I'm individuals might already be providing. So that is the amended version of the bill that is in front of us for consideration on that committee. And at with I was really excited to have the committee unanimously recommended the city council. Adopt Council Delaware 19509 as amended world. I appreciated your write-up. I saw the email that you had sent and I really want to acknowledge Chief Scoggins and John aronfeld from the downtown local offices of our Seattle Fire Department and recognize what the mayor has done as well pulling together. Not only the fire department but Police Department are human services department and also working closely with public health and of course with our budget office to make sure we stay within budget but this is such an important step in the right direction as council member Gonzalez as stated we reached Other cities not just LA but Mesa Arizona Colorado Springs Colorado to to learn and our own Kent Washington have done projects like this. We know that the kinds of complaints that are firefighters routinely respond to are not the high Acuity ones for which they have been trained such as a fire or a traffic accident or the kinds of things where it requires fast action and a quick decision making many of the complaints. In fact that I believe that the fire chief headset a good 40% of the responses that they are sent out to with ladder trucks. Sometimes two letter truck sometimes to ladder trucks plus and the ambulance medic 1 + police officers are really for people that have perhaps there a minor injury or illness. Like it's really more of a social issue. They're feeling cold or feeling lonely. They're feeling abandoned. They don't have this. Word around if they need but they certainly don't need 12 people responding to a 911 call. So this pilot proposal that's what we started off Collier mobile mobile Integrated Health Unit, and now we're calling it help one. I love that title. Cuz something we all can remember. It does build on National and Regional examples, but it's also capitalizing on our fire departments core strength with having immediate response flexible decision-making will be adaptable on-site. It's really a team base work and it's going to provide improve patient experience for the individuals who are on our sidewalks and calling or inside of a sylheti and needing help but it also will provide some support for a fire department that they're not going to have to respond with 8 people and certainly at the taxpayers are going to have an opportunity to see their money used wisely as well. So I think that this is a triple win. I'm very pleased that we've got in there. I'm glad the way I'd 407 $5,000 that we put in the budget last year, but also we are coordinating with Allie Franklin in our community Connections in Northgate and I also want to acknowledge Sue McLaughlin McLaughlin and the work that her group is doing around healthier hear all this connects and I'm very thankful and appreciative of the amended language. Do I forward you bring other detail of the actual legislation? I failed to mention that one small thing, which is that the Proviso is on $475,000 in our budget at we have heard from the executive committee and and in media reports that the total cost of this initial pilot project is actually $500,000 again only $495,000 is subject to a Proviso. Committee Chief Scoggins mention to us that the Delta of $25,000 is coming from Surplus in the fire department. So there will not be a gap and wanted to make sure the council members understood that that that there is a disparity in terms of the 475 versus the $500,000 cost that has been estimated by the executive but it's our understanding that that $25,000 difference will be achievable for a department without a huge inconvenience to them or the general fund. Any other questions or comments before we vote customer her bowl of resources for the fire department. Generally the need to respond to emergency calls has a big driver of their budget and historically the best practices were that responses to individual units replaced 3500 a year. They would look at adding additional resources or as what we're seeing now is the individual units have four five six seven thousand annual responses for individual units and this again this this effort I think is within the context of trying to address that large volume of emergency responses that they're dealing with. Forgot thanks for the comments. I think we're ready to proceed. Okay. You know for the comments, please call the roll on the passage of the Bill O'Brien born on a post 86 arthritis and Department of Parks and Recreation to enter into an agreement with the Seattle Academy of Arts and Sciences to renovate the South Park Community Center site and develop an ongoing relationship in the South Park Community consistent with the terms of agreement an attachment one recommends a bill pass. Queso counseling herbo. Would you like to mend it first 11 94-96 by substituting version 2 4 version one of the bell and substituting version 3 4 version 2 of the attachment 1 the proposed substitute version 2 as it relates specifically to the the bill adds the following language to page two line 12 to 13. I'm saying that department of parks and rec shall submit the final draft agreement for review to the city council Civic development public assets and Native communities committee. The goal of this amendment is to provide counsel with an opportunity to review the final agreement between parks. And the Seattle Arts and Sciences Academy, and we really appreciate that. They are working together to establish this partnership, but the amendment provides an additional opportunity for Council depth gain, a better understanding of the terms of the agreement before it's signed the second element of the substitute relate specifically to the terms agreement as it relates to the filth fuel programming section and it provides greater Clarity by noting that drop in time is real is is available for community members generally and programming for South Park. What is explicitly noting that a process should be developed Fairfield scheduling at the at the South Park Community Center that prioritizes South Park Community members. So generally Citywide the fields available for drop-in time that does not need to be reserved. But we want to also lift up the ability of South Park residence to reserve the field to take priority over the general communities. Citywide requesting this Clarity is designed specifically to distinguish between the Academy's fall and spring Sports scheduling. So that benefits the South Park's Meat and Embers are explicitly provided in the agreement before turn the Warriors and vote on the Amendments cuss words as you have anything to say about the amendment. Okay any questions, so I'm not sure that we talked about the organization's coming back and approving the additional 25 to 50 hours and so on. So do we have everybody sign off? Yep that we have worked together on 39th. And I just covered the items that I had lifted forward and talk about the others and I'm happy to do that becomes president. So a few things that I looked it up in committee cash with that last week already already around when the when SAS would have priority on scheduling on the field. So I appreciate having an opportunity to work through the parks department with SASS and much things Traci rats Cliff from cancel Central staff on shepherding this through we were able to achieve some clarification on precisely win between August and November and again between March and the rest of us and may we would actually see ours prioritize force a Stoneridge the original Only said fall and spring and we now have to find dates by agreement with SAS that the intended prioritization of the field for SAS would be the last week of August to the second week of November otherwise known as fall and the first week of March the 3rd week in May or spring. So that's one point. The second point is that we also requested that the department of Parks and Recreation provide us an annual report on the use of the new field by the community and by SAS for the first two years after completion of the field so that we can we can better understand if policymakers the demand for the field and where the demand is coming from the second the third component that we were able to receive Clarity on where the number of hours that would be committed to programming and at the South Park Community Center or working with local schools or local nonprofits provided by SAS. So I really want to thank them for wanting to contribute back into community in this in this manner. Originally. They have proposed a minimum of 25 hours. I received correspondence from our folks at SAS after that coming here and saying that that is absolutely a minimum but they hope to be able to accomplish more and give more hours. I proposed 50 hour minimum rather than a 25 hour minimum in the spirit of their verbal commitment that they actually wanted to do more than 25 hours a day the very quickly and graciously agreed to do a 50-hour as a minimum. So that is a consensus proposal there on the minimum number of hours. I also asked them to just include a little bit more texture as to what programming the referring to us as language is pretty at Broad and that's why we seen language that specifically list, but doesn't limit it to things like soccer camps after school student tutoring mentorship program in robotics and arts programs. It's my understanding that I will continue to work with the South Park Community to identify what kind of programming they actually want to see in community as part of a part and parcel of Love flows from this public-private agreements around the athletic field. So and so to answer your question answer your question customer badshah. This has all been agreed to and and I really want to thank the folks that's a Sandy PR for the ongoing partnership and cooperation with me and addressing some of the concerns that I raised in committee last week. Okay, so we're going to vote on just the amendment which was basically a substitution aversion to 4 version 1 and and sosuna version 3 4 version 2 of the attachment on attachment wants any other questions on that all those in favor of the amendment, please go die. I opposed the eyes have it. The bill is amended. I can't remember where is we'd like to speak to the minute Bill. Thank you. I'm going to give a little put this in context for the viewing public even though we all are familiar with District 1 West Seattle. South Park of the neighborhood in Seattle. That isn't just sales District number one south of Georgetown across the duwamish river in North or Tukwila. It's home to the South Park Community Center which serves many families and youth sports from neighboring parts of Seattle including the Seattle Academy of Arts and Sciences school with 6 to 12 grade students that actively participate in the athletic sports. However, the South Park Community has the highest population of any Seattle neighborhood get its residents have about one-tenth of the accessible green space available to the average King County resident a concept design informed by Community input was finalized and spring 2018 to install and relocate a play area and other amenities including Landscaping to mitigate negative Health impacts from Sr State Route 99, which runs next to the Park area. This design is projected to be 9.8 million dollars. The 9.8 million dollars is a combination of for funding sources the majority coming for the Seattle Academy of Arts and Sciences it include 1.2 million from the state and County grants 2.8 million and Park District funding 1.8 million and refunding and of course the for million-dollar donation from Seattle Academy of Arts and Sciences this or this will allow the department of Parks and Recreation to enter into an agreement with the Seattle Academy for the term sheet as listed in attachment 1 and able to see all Academy to begin fundraising for the South Park Community Center site Redevelopment. The bill was heard in the Civic development public assets and Native communities committee, but the pass recommendation with the expectation that members could spend an extra week before castles final vote to clarify aspects of the agreement. The agreement is 25 years long with two five-year extensions. I want to thank councilmember Gonzalez and her boat for strengthen it with our amendments council member Gonzalez's amendments as you as you heard her share focusing on field programming and I'm I want to thank cast member her vote because she focused and I want to buy passions the public benefits piece that is The program expansion and provide greater access for local residents to South Park and their neighborhoods. And with that council president Harold. I would ask that the that the Portage Pass as amended. Okay. If not, please call the roll on the passage of the amended Bill 8 in favour Nana post. Please read items three through eight 8 appointments 1318 through 1323 reappointment of Kristal fiser as member Seattle Freight Advisory board for a term due December 31st, 2018 and appointments and reappointment of Kris debuck Jhene Aiko. Acutanza, Mike Elliott and John Hellman as member Seattle Freight Advisory board for turn to May 30 31st, 2020 an appointment of John persak as member Seattle Freight Advisory board for Trenton May 31st, 2021 the committee recommends all these appointments be confirmed. This mix of appointments and reappointments Greek root folks willing to serve on The Faded by Zhu bored really quickly. Crystal is the director of state affairs for the ups and a Parcel Service to the reappointment. Chris has a new appointment He's a business agent for Teamsters Local 174 previous prior to that. He served his work is 10 years is a package driver for UPS. Genie is a reappointment Founder to Transportation consulting firm makes reappointment and expert and rail safety. He chaired the Washington State legislative board for the Brotherhood of locomotive engineers and trainmen another reappointment. Johan is the Regional VP at Burlington Northern Santa Fe railroad, formerly the executive director of State Governor Affairs at BNSF and finally John persak mean if you know, he is a longshoreman an officer with ILWU Local 19 and lot of expertise on faith movement in and around the port. Thank you catch her and Brian. Sonny's appointments If not those in favor of confirming the appointment, please vote aye aye those opposed vote. No, the motion carries an appointments are confirmed. Please read items 9 and 10. Agenda items 9 and 10:00 appointment at 1324 and 1325 reappointment of Hester serebrin as member Levy to move Seattle oversight committee for a term to December 31st, 2022 an appointment of Inga manskopf as member Levy to move Seattle oversight committee for turn to December 31st, 2018. The committee recommends these appointments be confirmed for your pension. So mean really quickly Hester the policy director at transportation choices Coalition. She's also a member of the Washington State Transportation Commission jobs, a hospital administrator for adolescent medicine at University of Washington School of Medicine recently completed a four-year term is the president of the Ravenna Bryant Community both Hutch's reappointment Ingles the new appointment north of make great additions to the levy oversight committee. Not those in favor of confirming appointments, please vote. I I suppose both know the motion carries appointments are confirmed. Is there any further business coming for the council? I'd like to move to be excused on July 1st. Emergency council member Harrell is a shoes July 1st all those in favor. Say aye if not, we stand adjourned and they won't have a great rest of the afternoon.", "end_time": 2259.5}]}