{"format": "raw", "annotations": [], "confidence": 0.9154178580412498, "data": [{"start_time": 0, "text": "And this is council member of Juarez making trouble here show. This is a regularly scheduled meeting of the Human Services Equitable development and renters rights committee of the Seattle City council. The time is 2:03 p.m. On June 11th. 2019 Hey, Nick. I'm joined by consumer Wireless. Thank you have a short meeting today. The two items on the agenda are both appointments the Seattle renters commission. So we will take them up together. This will be the first time appointment to the Seattle renters commission for both are nominees Dinah braccio and my mac McGregor, although she mention Mac has previously served as the culture of the LGBT commission and we are extremely delighted to have him back in the city of Seattle phone in the renters commission. I also want you to take this opportunity as the chair of the renters rights committee to announce that are Seattle needs rent control petition just over this last weekend has received or 525 signatures from people around the city. Dimensions of the biggest jungle signatures / 325 we got from the volunteer Park pride festival. And so clearly, you know, the question of renting an affordable is a very major one for the lgbtq community. And so I think that's something that somebody might can like mac and also bring it and I'm sure we would love to hear from you about how the question of lgbtq Rights also is related to renters rights. And this is a real demonstration. I think that people are looking for a bold policy Solutions on the questions asked Iraq and Iran and if you're watching this and if you want to send us your story about how French writing has affected your life and what you would like to see please feel free to write to my office. And before we bring our presenters to the table, but we do have public comment Nick Jones on my office is is a staffing the meeting so Nick if you can read the names who are signed up. There is currently no one signed up for public comment. The whole meeting is about it, But as far as you're concerned cast member was you're welcome to speak anytime. So since we don't have anybody signed up real close the public comment, and we will invite our people to the table. So please join us. Do we have a department of neighborhood stuff number? Are you both here, Diane and Mack? Tina even saying it wrong, I'm sorry. It's okay. I think I thought it was Dean as I was checking. This is Deanna cell. So if you could have just one side has introduction from everyone and I'm sure you would like to introduce the topic, but just for the record if you could go around. I meant Gina braccio as an educator and Advocate with the tenants Union. My name is mac McGregor, and I'm an lgbtq activist and diversity educator. Shaquan Smith from the Department of neighborhoods work with your voice initiative Ashley libenu to everything I just found out about the the kindness by like the other day. The guy just kidding, but so do that to the point to use for the Run has commissioned and that's honestly all I know. Thank you for being so I really appreciate you being here from the Department neighborhood and I think that at this point that we would just turn it over to both of you. I know both of you personally and worked with a billboard with body tension in and with Mac on many issues. So maybe you could just talk about what you would bring to the erector commission and also just the issues you're working on related to renters rights. Okay. Yes. I am on the board of lgbtq allyship, which is the only lgbtq nonprofit in the area that focuses on the housing affordability and housing rights for lgbtq people. So I do that work and I've worked with you on moving fees with I was a part of that movement that legislation and it is we know the lgbtq community faces specific obstacles when it comes to this because of the obstacles in employment, especially the transgender and gender-nonconforming part of the community, which has great disparities in employment. And so this in my wife and I are renters in the area and so we definitely understand the challenges and our rent continues to rise every year. So I want to do everything I can to help represent the community and put forth protections for renters because almost 76 / Send of the lgbtq community in in Seattle are renters. So it's very important work. And of course I also want to represent our allies who are not the lgbtq themselves struggling. Yes also struggling. Yeah, so my day my day job I work with the tenants Union and one of my primary job functions is I'm on our renters rights hotline, so I talked with folks most days of the week from Seattle also outside of Seattle about what issues. They aren't they are dealing with in their rental housing and trying to help them navigate these sort of Patchwork of protections that we have between like the city in the state laws and also just It's not a comprehensive tenants rights framework that people are dealing with it having interact with and so it can get confusing. And so that's something I I think a lot about about where those where our laws are falling short. I think a lot about excessive explain it to people when they're not covered. And so I think bringing the two doctors commission is something I'm really excited about and then also, you know, I've just threw that work. I've been spending a lot of time thinking about like, what are what are better ways we could be structuring are Rental housing situation so that people are able to have the Safety and Security that they are entitled to buy being people. May I add something else when I was co-chair of the LGBT commission there was during that time the office of Civil Rights was doing some studies on apartment buildings here and finding out which apartment buildings were discriminating against people that were people of color people with disabilities and they were going to do one up for lgbtq people is well and one of the things I would like to do on this is follow up on that is that was a while ago and see what's been done since and what you know new studies might need to be done to see where we are on those issues. Right, and I'm glad you also mention people with disabilities because it is the an affordable housing is affecting people with disabilities in a particularly sharp way and I think so. I think the renters commissioned lgbtq commission and the commission of people have disabilities. Actually I think are many ways are together and Dina. Would you would you like to share a few things about how the boot camps that we've been doing are going to be organized series of renters rights boot camps throughout the city many of them actually on Capitol Hill and Central District, but also one in West Seattle. And one of them was a Horse Ride Wildrose play the you know done by B Seattle in the tenants Union and in collaboration with novice, but if you would like to share, do you know how what what you learned from renters? And also if Maggie want to add to that I should have had you have not been in D5. We would love to organize a boot camp in decaf make that happen together. And yes, I understand we would like the North End so we actually die Tenants Union actually has a weekly clinic in your District that we operate out of the Northline North helpline. We're actually in your District every week you had up there in the recent past, but we do have a standing appointment. My through doing those two cans and like our other are other Adventures presentations. I think the predominant thing I always take away from in is How people are are always people are always surprised and sometimes it's Pleasant that they are surprised that they're these protections that they were unaware of and sometimes it is less than Pleasant where they are surprised that there is not like better protections and I think it's always curious to see which way that the room will go. I'm with those everyone is Oleo. Everyone is always super excited to like have like been able to like increase their knowledge and that I think people in some ways. It's like a self-loathing group like the people go out to that that are those boot camps are the people who are like interested in learning more and like understand why they want to learn more but I think It's usually pretty pretty positive response. That's nice. I think you know, we addressed a big issue that I people have talked to me about and that my wife and I dealt with the move-in fees which can be astronomical when you're talking first last and a security deposit and a pet deposit in good grief, you know, I think we ended up coming having to come up with something like $7,000 to move into our house. And I remember your public testimony at that time. It was just crazy and we were trying to stay within an area where our son wouldn't have the bus more than an hour to his school and there was really nothing else in about the time and we didn't have that legislation that time so we had to come up with it. So we had to borrow from family and do all kinds of things to come up with that. You know quickly, right? I'm glad we've we've done something to help with that and now, you know, I think we need to work on extending which people are already working on extending of the notice. Where rent is raised because 30 days is definitely not enough for people to arrange in their lives. Right? And and we also I believe we need rent control because it is just out of control right now. So I'm so many people that I know we're having to move to outlying areas around the city and cuz I can't afford the rent within this city and yet they have to drive into work every day and a lot of them as we know where are essential workers like teachers and firemen and you know people that we need to be able to be here and then not not being forced to look for jobs elsewhere because it's too much of a struggle to drive in this traffic to get into work. Yes, please. Yes. I have a question for you. Never to put you on the spot. I was looking at your resume and it seems like you you work for like like 13 volunteer organizations pre mazing step one of the neighbors all who are working with. This is a little bit different than what you're here for dinner on the renter's issue. But one of the things that we've been working with LGBT community is how people have been weaponizing the First Amendment right and people's right to religion and we've been following the cases with the ACLU Ingersoll gender justice league on I'm refusing to provide any kind of medical care including Dental based on their First Amendment right to religion, right and we've been seeing that that has been being held up in court across this country in this Administration is rollback. A lot of those issues. Are you seen any of that dumped a lien with renters issues as well as the other kind of medical issues cuz I'm asking where broader question and what you're here for today cuz of your resume and your experience. I am seeing that not in Seattle exactly, but I am seeing that and other areas and there's a hole and there's a right now. There's a lot of Fear and panic in the community, especially the trans Community because this Administration is specifically targeting us. And so I'm seeing a great deal of fear people worried about where they're going to have Healthcare people worried about what they're going to be refused housing and services due to their identity which you know, we do have Protections in our state. We're very lucky to have that I'm from the south. I wouldn't move back for anything, you know, because I appreciate the protections that we have here. But this is where people need to understand the importance of local politics, right and we just need to keep working to protect the marginalize parts of our community that this Administration seems to be targeting over and over whether it's people of color or Muslims, or we can go on. Disturbed the Washington study and the Canadian study there was a huge portion dedicated to two spirit lgbtq highest level of trans folks being killed that are going unreported unnoticed and nuts in Indian country as well. And that's concerning me too. And that's like another piece of legislation what we're looking at the medical piece, but that's another piece to have more. I don't want to put you on the spot cuz I never hear about renters rights, but obviously you do everything. So we have a large and did indigenous Community here that we need to protect him. Obviously, you know, they they need our protection because they're again like the trans Community a small part of the community, you know that it doesn't have a lot of money and things like that as well to fight for themselves. So we have to fight for them. And so yeah, I think that that is so important and and you know trans what hate crimes on trans. People have been rising around the United States around lgbtq people in general and hear hate crimes have doubled recently, you know around lgbtq issues because of the gym gentrification that it's been going so fast, so, you know, I'm a big believer in education not not more policing around that although we also need to educate the police around these marginalize parts of the community, which I've been a part of I hope to educate SPD on how to handle the new deal with the transgender Community, but we need to educate people we need to make sure that we have protections so that this stuff can't continue because a lot of times these crimes that go unreported because these people in the community, you know, don't they fear the authorities to report them? So we maybe need to think about other ways they can report rather than directly to the police because they're afraid of the police. So there's some work we could do around that. I think we should still be a great idea. I don't agree like a hotline. They can call missing and murdered indigenous women and go to the discussion. And as member, where is his committee about how significantly underreported these these issues are and all the alarming numbers that we do already have of missing and murdered indigenous women actually more than that have gone missing or have faced worse pain right where it will you have the I always hate when people use this word. We're at the intersectionalities of renters and some of the issues were talking about that LGBT people facing nationally and we call it the decolonizing of data. What we don't have is the same thing for the LGBT community in the data. City departments in our Police Department where people can identify as that and then they can be reported because without that and we've learned this the hard way in Indian Country. It isn't enough to just take the word of the police officer or maybe the person that's providing Medical Care in the hospital or maybe the landlord but it's also from that community. That was a big piece. That's why the numbers got of 1200 or higher in the Canadian one because for the first time they start going to those communities and saying you tell us who's missing seen in our wives in aren't you know, but they weren't listening right? So I think I'm kind of seeing the same parallels and LGBT community that that data isn't being collected or being they're not coming to your community insane who is being hurt who's being missing who's being denied. No one's doing that. That's where I'm at. Which of of young people in the streets 25 and under they say 40% of LGBT cue and they are a lot higher risk of sexual assault. So none of that has been counted. Nobody has been coming to the community and asking those questions. So maybe we need to do that ourselves, you know as well. They don't want us to be counted. So we're going to have to take that in her own hands. I think this question but I'm just saying over all cuz you know, that's what gets communities help is those numbers write that down the race question, but they don't have found that it was interesting that they want to know your race. Did you know that there was asked me is it one time two sets of gasoline will I know you're not white cuz he was looking at me. Yeah Usher that to that these all these questions are interrelated and I'm glad that you feel about joining the renters commission Mackay mansion rent control cars as you both know the the commission has already unanimously among themselves voting on the fact that Seattle doesn't even control in fact, the the thing that we have brought forward from my office is exactly what it's a little coincidental it so that you know clearly we were not the only one thinking about it. Even though, there's a state ban actually that you make progress on unit has to have really build momentum to repeal the same and we have to start something you're talking about an ordinance that says of very strong Citywide when control theory of corporate loopholes, but that will go into effect the moment though they ban is lifted and was really just find to see the renters commission said also talking about 180-day notice for eviction and Oh, oh also sorry for rent increases and also the economic assistance meaning if people are forced to move because the arrangement up dramatically then they need some sort of garbage from the Illinois assistance from while there are some relocation. Is it obviously a sew-in in some ways. This is the economic a patient assistance would cover the ground that hasn't been covered a girl's loophole. So to say I don't know that they are loopholes in the law. So basically the Dilaudid were talking about would say that if you are a renter within a certain income limit and your rent went up by more than 10% then then if you were forced to move because of that as opposed to some personal reasons than your landlord owe you three months rent. Kind of lawyer stole illegal even with the rent and roll band. So it again the purpose is to go towards rent control, but to build momentum towards that are you going to be seeing have any more debates on rent control? I will be happy to I'd be happy to yes. I'm just wondering if we won the debate because we know there are questions out there. We want opportunities to clarify. I'm definitely looking for the beta even though I am happy Jeff Bezos are all the CEO of broken or licking in Partners want you to be happy to organize debates invite we gave the portion of rent control a big bump when a former council member Nick Licata and I debated on my radio show any opportunity for now that you have what you say 51% of Interest think about that. I said homeowner then now it's 55%. This is a demographic shift to the right. Will the home prices here. Most of us can't do the American dream thing anymore buy a house here. So, you know, I'm older than you so than ever with the American dream is to be to go to college to buy a house. Now it's true. But a majority of people it's not accessible. I have a 28 and a 25 year old that live in the city that so I understand. I have a son getting ready to graduate from high school and he thinks he's going to be able to save enough money to move out with his friends this summer in my wife and I are going to think that thing to Heidi I guess again, they don't leave move out while you still know everything right? Cuz he's at that age and Maggie were talking about that. You were part of the tenants Union Washington Community Action Network late as usual you are in the committee when we were discussing bad and Education Association do Public School teachers union also was a big part of that is order mention that it was upheld in the King County Superior Court last Autumn. So is this is really quite So if you have no objections, I would like to move appointment. Oh 13684 vote. Thank you all in favor. Say aye and move appointment. 01369. Thank you in favor. Thank you, all of the both appointments the Adena and Mac. Your appointments are moving to city council meeting on Monday. You don't have to attend, but I've no doubt. It will be a prude. And if you have any questions, let me know and call me. If you have any questions. Let me know. What time is it? Thank you both so much for being here, and I'm sorry I won't be there Monday. So hopefully I'll see you again. Hopefully we'll do some kind of boot camp up in D5 with your backup in North helpline with Kelly Brown, and those folks you again. It's good to see you too as well. Thank you. I guess you don't know. It's okay. I appreciated your welcome.", "end_time": 1655.4}]}