{"format": "raw", "annotations": [], "confidence": 0.9452444695127316, "data": [{"start_time": 0, "text": "Good morning, everybody. So welcome to our regularly scheduled Council briefing. Today is Monday March 11th. And the time is 9:35 cancel present Harold's excused from today's Council briefing and city council meeting and its absence. I'll be serving as President Pro Temp counselor treasonous Kate is also excuse today. So with that we're going to move right into our 2019 State legislative session updates and I believe we have our folks you're from oir Office of intergovernmental relations and I will turn it over to them. It looks like we have quite the quite the agenda here. Good morning. Looks like you have what 31 pages and date topics of a bunch of stuff condenser are pages into a a brief 20 minutes for you today. I'm Lily Wilson Co tag office of intergovernmental relations are two major hurdles to the legislative session go to the policy committee cutoff send the physical committee cut-off dates. We are driving quickly towards the fast-approaching Wednesday House of origin cut off where legislation needs to leave the floor of the house that the bill was introduced in and we are working on many priorities that the council has in the areas of responsibility housing and homelessness education environment that will go into more depth about today. But first, we just want to touch base with you about some logistics for our upcoming Lobby day. I believe we landed on the 21st. And for folks who are not able to make that date we do have on a WC has a la b day schedule the next week, and we were thinking that could be a good Avenue and folks have availability then but aren't able to make the 21st. And if that I'm going to turn it over to Karen Cargill to talk a little bit more about I love you dearly just extended up recession overview. We are on day 57 of 105 day session March 21st, we reach that we can we try to pick the day that works for the most folks. I know that last year. We had some challenges that work for once we were hoping that the a little pull would help us help identify the best day for everyone. So how'd it typically works is that we just asked you to kind of holds hold as much of the day as you're able to and we will work on scheduling meetings if legislators down there and have you go with another another council member and talk to legislators with one of our lobbyists are one of the Oar staff. We will organize a lunch time and we will be in communication with your office has to coordinate Transportation often times will try and bring a larger vehicle down to help everyone get down there. But of course, it's welcome to Drive Independence and we can help you know, where to park in all of us think so if you're off as any questions, I know what we've been a little late in communication is as cut off has been rapidly approaching and keeping us quite busy. But we will get all that organized once could have happened to be kind of know what the realm of bills that were working with and what the priorities should be when we go down and we think that you will be most instrumental in helping charge after this year. So I'm just 31 pages of our bulletin in Two Bills. There's a child care higher education. So this is a bill that it had some action last week where I moved out of the house with a vote of 96 on page 1 and 2 at the bottom House Bill 1303. And so for the Working Connections Child Care Program benefits, this would remove some of the folks that are pursuing that benefit if they are enrolled in a Technical and Community College pursuing certain programs that they would be not have to have a work requirement in order to access this access program, which is a really interesting concept that's being explored right now. Like for you this was passed on February 27th out of the Senate on page 3 this is engrossed substitute Senate bill 5395. And that's the comprehensive sexual health education Bill and that makes it a requirement for some comprehensive sexual education to be brought into the curriculum for first looking. I think it's through 6 or 12 in the first half and then looking for some kind of corporate. I'm always see I also it's going to be having some responsibilities of putting together a list of what some of those resources might be that can be used by the schools. There's still quite a bit of uncertainty about what's going to go on with the levees all of those the school levies. A lot of those are ntip. There's a list of all the different proposals that are out there there on here if you want them, but they're kind of scattered about What was in the education section, but they're kind of scattered around 6:15 47531 3 and again, all these bills are numerical order so you can kind of find him in that way 50316 and 5466. All of these bills are considered and Shay be so they don't show progress at this stage. But that doesn't mean that they're necessarily. At this point. So we're watching that closely and will keep you guys informed about what the legislature is considering for working with this with these Levi issues. I'm coming to place for school districts and the per-pupil assignment challenges with their budgets. The governor came out with a proposal that this was going to be a party for him at superintendent Chris Ragdoll. This is a priority for him as well. So I think that were hitting all the right pressure points in a lot of this is again, it's expanding local Authority. It doesn't necessarily mean that it has to stay. Coming with us. So back focus can be on the special education component. That's also being considered just a reminder for just a couple of weeks ago the school district announced a $49 shortfall for the next school year and is planning to take action to close that Gap. So unless we going to fix that Olympia we're going to see additional cuts at all of our local public schools in the 2019-2020 school year. So I'm hopeful that the legislature can I create this fixed? Press Karen and thanks for the work. It is our operating funds. Yes. So they again with the per-pupil Levi cap that was said as part of the McCleary fix. We need those caps to raise in order for us to be able to raise enough Revenue to keep schools open and operating as they are today. We certainly also need fixes for the students with disabilities numbers and a whole lot of other things that I think are also in the list, but I think that that issue the cap issue is the one that is the most prevalent side effects that I talk to at the district, but the chair of the committee may have something dad. Does prednisone that's okay just gentle reminder. Thank you. Say environment section starts on page for but I'm going to jump right to Page 6 to highlight two bills on there on the top of page six that's engrossed substitute Senate Bill 57 7, and that's a single-use plastic straw Bill. I know that the city has been quite a bit on this and so they're working on a Statewide effort that would make it that you have to request a straw before. They can't offer you a straw are the local ordinances that we have in place have been preserved spu has been very very involved in the conversation with this special shout-out to say go Jackson who's really great with a lot of power and like recycling programs and the would take back and what not, but how much March 4th that was voted out of the Senate with a boat of 27 to 21. So we're really excited to see that one move. So when you referenced establishments having to offer our to provide a straw when asked your speaking Play up the plastic straws. So otherwise it's tailored to folks who have a disability that would lead them to do. I prefer the use of a plastic straw. There is still that the legislation would still with that exception have a ban in place. Correct, correct? Thank you and I just might give deference to come from bro, Brian. Although the stop. The straw ban went into effect under my leadership under SPO is really counts Monroe Brian's leadership 10 years ago. I think if I recollect all of your hard work will be I'm in another 100% clean energy bill that is a huge Topic in Olympia still that's kind of middle of page six engrossed second substitute Senate Bill 5116 on March 1st at meet had a public hearing and the house committee and we're expecting executive session sometime this week. So we are continuing to monitor that one closely and just a really good conversation Point still and I'm not going to the details cuz I have two different or they so it's already moved since I already moved out of his house of origin now, it's in the opposite house. It's it's well ahead of it. But just kind of the same conversation. I haven't actually had a chance to go through it very closely. But Senator Carlyle to drop at a new bill Senate Bill 5981 that's on page 8 which is a cap-and-trade program a greenhouse gas cap and trade so nothing fancy. For that but I just want to highlight that that is something that is singing something's been dropped now a new bill. Now, how does how does that work? Because we've already gone through 50 days of I mean, I mean a lot of different things that might mean that they want to have incorporate this into a conversation with some other legislation if it is deemed necessary to implement the budget it could still receive a public hearing and move through the process but a lot of times it's often introduced in order to meet the request of a certain group that has been working on something that may not have had the ability to get something through right away and just want to have it as part of the larger conversation, especially with a lot of these. I mean, I know that some of the transportation packages are discussing a carbon fee and then with 100% And so alone in the mall too kind of Us Together. Part of the I would imagine part of the objective is just to get something in the conversation so that as we're finalizing the bills that it can be incorporated. Simply for this one but a lot of times that is the goal. Yes. And so that's how I like for environment and moving on to General government. I actually just want to highlight one particular Bill and paged at 10. And that's the wrongful injury wrongful death Bill and that substitute Senate bill 5163 on this has moved out of the Senate at this point that moved out on March 6th with a vote of 32:17. We are expecting there is a house the house version which has not got the house phone, but we are anticipating it moving by cut off on the 13th. So my nose made quite a bit of progress that got Scott caught up last year. So this is just a quick question and I've really not been engaged in this but I got something on Friday where there was concern about the additional liabilities for cities. Do you want to discuss that more? I know that'll BC has voice I'm concerned about what the potential liabilities would be believed that the city's position has been that they think that's still the right thing to do regardless of what the additional liability is so our position That were supportive of this concept but other cities do have some concerns, but they will not though. They are opposed. It will not be wing and on the bill to actively at this point. I think that's great news. I appreciate hearing the update cuz I know that you all sent out a message about this particular bill. I feel very strongly about supporting this particular Bill and I'm strongly opposed to the association of Washington cities position on this one, but appreciate the fact that they are going to stand down given the fact that we continue to be a member of that organization is a really appreciate that but to me this is this is a bill that has been in desperate need of Correction almost since its Inception and as a former trial lawyer who represented people who were injured in terrible terrible situations as a result of potential government liability not being able to represent and Ensign Justice for individuals who for example, or unmarried or four siblings Etc is is one of the most difficult conversation. I never had to have with families who who have a clear claim but for their relationship to the decedent or the severely injured and so I really appreciate the ongoing work of the trial orders and others to continue to correct this wrong. Create moving on to healthcare. I want to highlight just a couple big winds that we experienced this last week. It's always fun to see hard work pass off of the floor. So we want to make sure you're aware of these ones. First of all, I want to touch base on it's the top of the page 13 1513 or 5444. That's the governor requested Trueblood case settlement agreement. The house version is still with within rules on the house rules committee on the Senate version version was adopted and passed unanimously off the senate floor on March 7th. Very excited about the progress that's being made their I also want to touch base on immunizations. So I'm in the middle of page thirteen House Bill 1638. This would repeal the personal belief exemptions from the MMR vaccine. This bill passed out the house floor late at night on March 5th. I'm with the boat at 57240 very excited about that. There have been a lot of people on both sides of that issue and we're we're excited to see that. I thought that this was approved off at the house for so I was interesting to about this is that when this was first brought up for debate. There were a lot of amendments that were initially attached to them 42 or proposed to the spell and then they were whittled down. So 33 of the 42 were withdrawn quickly another three or withdrawn during debate because they're out of the scope the bell and I'm six amendments were adopted that I think strengthen the overall language of legislation. And then see under housing and homelessness on my wanted to highlight a couple things here as well. So the talk of page 19. And remember to my page numbers this time is page 19. That's the local-option bond bail. We continue to track very very carefully. This is that the Senate version does not appear to be the vehicle that one room for this year. Our the house continues to have a great momentum pass out of the house with strong bipartisan support on March 5th 66 2:32 and its refer to the Senate housing stability and affordability committee word. We're still working very closely with a large group of stakeholders who are supportive of the spill. And then I also wanted to share another one that we're very excited about passing on the house floor. So it further down that page 5940 56th St. Bus shelters and encampments Bill Senator. When has really been a champion for us on this bill and it passed off the senate floor with bipartisan support. It was it was frankly. It was great to see some of the support on this from people. We haven't typically seen weigh in on a lot of our housing bill. So excited about that. It's now heads over to the house and we continue to see a lot of support from stakeholders with him to Seattle and housing community in general is on e s s b 5600 on eviction reform so very excited about that or which one this is It's on Page by page 18 eviction Reform Bill that extends a 3 day notice to pay or vacate to 14 day. And even I think in some ways more importantly allows judges to exercise discretion in a quart which they have done right now when it comes to non-payment front. I just wanted to add I believe I'm councilmember Swan and House member herbold. The language that you had flag dress is a concern is incorporated into the represented macri proposed s. Thank you for all of your advocacy on this for the 4th. It's incorporated into the non-payment of rent. Bill knows her the eviction reform. Yes. Yes, and just so you do know that 1453 which I believe is what you're referring to it did pass out of the house with the 54-44 vote on the 5th. I'll put you on that as well. question and housing accessory dwelling units The latest status on those bills all of you that shows the Colombo proposal. I'm represented Peterson is working on a different version for the house. So we're working on those right now we can get that over to you so you can see the differences between the two bills when not it's working off of gregerson's. Yeah. Yeah. Thank you. So just to clarify the chart that I got does not seem to evaluate representative gregerson's version of the bill if it's looking at comparas comparing the SSB 5812 Striker with Peterson's proposal. So just want to really clear that we're not that I've seen does not support a bill Donner analyze representative gregerson's bill. Better being discussed. I think the chart is a little unclear. I have it in front of me. So I think it would be helpful to get a better understanding of what what this actually is. So appreciate receiving the chart at the beginning of this morning's briefing but I think you know as we continue to evaluate this particular sweet of bills in this space and it's becoming increasingly confusing and terms of who's proposing what and what the different components are and what the amendments are preparing to do. And what striking what is it would be really helpful to get a clear understanding of that any customers get and I both have an interest in responding to some inquiries that we have received from folks in the state legislature both on the house side and on the Senate side and really want to be thoughtful about how we respond to some of those concerns and and I am not going to pretend that they're probably isn't even there probably will be some complete. Positions within the city family on this particular set of bills. But before we put that out there, I I'd appreciate an opportunity to get a more robust understanding of the substance of differences. And I know that it seems that the biggest issue is around preemption of our ability to advance some some land use policies in the space, you know, I'm interested in exploring whether there is a legitimate reasonable prudent reason to have a small window of preemption in this in this particular space and interested in getting more information before taking an official position in that regard so forceful, thank you, and I know we we just got this chart just because a lot of people don't have the chart in front of them in some of the viewing public probably would like I'll just a little bit of background to started with the letter to the state legislature. Mini elected sign including some city council members in Dow Constantine and then council member are I'm sorry representer Paulette responded and then we responded back. So I'm hoping we'll we'll get the chart and we'll have a better sense of in this is got regarding adus accessory dwelling units the Senate substitute versus version looking at ass at the Petersons will be representing Peterson's his substitute and then the review by sdci. And so hopefully we'll have a more deeper discussion. We all have this chart and then you can incorporate councilmember Gonzalez's concerns because I see a lot of paper flying back and forth and we've all gotten phone calls on preemption and then and memos and emails. So this may not be the time right now. I'd like to wait for my colleagues. So I'll have an opportunity to look at this. I'm sorry. You mentioned that there was a rumor we responded. Who's the we I'm looking at with councilmember. I'm sorry. I'm looking at what the email that we received. The council member mosquito responded yesterday. So I think that was just an internal email. So we haven't hasn't formally you think I would have meant to say is that cancer or mosquito responded yesterday to us. However, our team here is aware of this as well. So I just want to make sure that we all have the same information in front of us with the letter that originally went out and I don't have the date of that letter. I just have the dates back from a representative Paulette. But in any event, I like it to where everybody has everything and then we can have a discussion. So everyone's on the same page. So thank you. Let's move on. I just want to offer our support for my articulated are interested in possible review of some areas where transmission might be. Okay with the city council. There are a lot of elements of this bill. Where are they? Suggested preemption of local and uses of authority. I think that some of those are warranted for us to discuss. So I too look forward to seeing if there's a opportunity for us to have a unified position. I know that represented Paulette's letter ask some very big questions of us, but I think it's perfectly appropriate for us to express also that there's been some frustration about the legal process that we've gone through just a permit more accessory dwelling units in the city and I think it's fair for us to ask some of those questions and get some responses from why are and it's an ideal use that to formula what could be a final position that is more easily able to be articulated by our government relations friends here at the table to our colleagues and Olivia really quickly before you move on and I think that that again the city has historically taken pretty clear line on preemption, but it but I think the It's important for us to not be not be so stringent on that particular principal in an area like this where we have seen any credible amount of resistance to change in this in this space and feel like it's really important for us to perhaps take a little bit more of a scalpel approach if it if at all possible in order to facilitate a strategy that could provide us at a minimum a floor of what we what we minimally must do in the space or can do in this space as opposed to, you know, conceding to field preemption. Which would you preclude us from doing anything that would ever complexed with a state law. So I do think that there is an opportunity for us to find some new ones here in a way that really meets the call for identifying Concrete Solutions that are going To help us address the affordable affordability issues as a region as opposed to Seattle going it alone once again, and so if I really want to challenge us to think about how this is different and can be different by providing us the floor around that preemption space but also by making sure that we acknowledge that our housing crisis issues are Regional and because of that we need the state to step in and provide us at least a minimum of density requirements across the state that allow the city of Seattle to move forward on adu's and other strategies and I feel like this is an important unique circumstance that might allow us to make those arguments in a way that is reasonable. And in a manner that doesn't set a precedent that Seattle is categorically okay with cramps in at any given point in time. Thank you. Let's move on. I'm going to go ahead and start in on the public safety portion of our bulletin today. We've seen just incredible movement around minigun responsibility victim victim rights and protections issues with many bipartisan and several votes off the house floor. So I'm going to review some of those specifically big starting at the bottom of page 19 substitute House Bill 1002 sponsored by representative or wall would eliminate the requirement that a victim clearly Express lack of consent in order to prove rape in the 3rd degree. That is one that passed the house unanimously and is currently scheduled for executive session and Senate Law & Justice on March 14th. What does it say exactly? So you don't have to have done that at all or because I X I think in a situation like that the victim may not be able to verbally Express lack of consent. This would eliminate the evidentiary requirement that a victim clearly expresses that by words or conduct in order to prove rape in the 3rd degree, correct? I'm also on the bottom of page 19 substitute House Bill 1010 representative Sons proposal to provide the Washington State Patrol more flexibility to destroy legal firearms passed out of house civil rights and Judiciary on January 18th, and is currently on the second reading calendar substitute how spell 1068 on the bottom of page 22 high capacity magazine ban bill sponsored by representative Valdez also made both caught of deadlines and is currently in rules in the middle of page 21 of Representative Jenkins proposal that would require a law enforcement officers secure Firearms when responding to domestic violence calls past the house 6238 on March 5th and has been referred to Senate Law & Justice and then on the bottom of page 22 and proposal to ban undetectable 3D printed guns. Sometimes referred to as ghost guns also sponsored by representative Valdez. Pasta House 55241 on March 4th and has been referred to as Senate Law And Justice and then finally in the gun responsibility area Senator Palumbo's proposal substitute Senate bill 5174 on the bottom of page 24 would put training requirements in place for a concealed pistol license, and then also receipt survived two rounds of the committee cut off sun is also in rolls. Governor president Madam Deborah about the sexual assault kit notice I like the first part of the bill requiring hospitals that do not provide sexual assault evidence kit collection or have appropriate providers available to develop a plan by 2020 but then there appears to be a pretty big out for those hospitals that do not develop a plan and I just want to the out is that they have to look within 2 hours do something and as I read bullet number to it reads like they're just talking about referring the person to another place is that I am I reading that correctly coordinate care with a local community sexual assault agency and assist the patient and finding a facility with an appropriate provider available so that they can have the test completed and that to our requirement is also enforced and punishable by a civil penalty of $2,000 to make the It's available. Why would we why would we allow hospitals to re-traumatized somebody who's already in trauma by referring them to another facility? I have to follow up on with some of the victim Advocates about why that specific language is important to them. But I do think there was sensitivity around the work group that was established around making recommendations that ensured that if hospitals are not currently equipped that there are Protections in place to make sure that folks are getting their the resources that they need if they are not within that hospital system. And I think they may be leading towards a stronger requirements and actively have a requirement for all their hospital's emergency rooms to have my son is a solution. Absolutely. And then I'm going to focus next on protections for victims actions for victims of sexual assault beginning in the middle of page 20 how to spell 10:16 or we just reviewed the time represented call Dr. Proposal also in the middle of page 20 House Bill 1055 sponsored by represent of Entenmann would authorize a warrantless arrest when someone violates a no-contact order issued in a prostitution or trafficking case that passed the house unanimously and is scheduled for executive session and Senate Law & Justice on March 14th been on the top of page 21 substitute House Bill 1166 sponsored by representative or wall with address. Our state's backlog of untested sexual assault kit kits. This is incredible just given it is not without a significant physical note, but the bill passed the house unanimously on March 6th, and it has been referred to Senate won justice of congratulate. How many of you who've done a lot of work in that area Lily me ask you a question almost went with what is the identified Revenue source. To the extent that has been identified. I know that you had expressed concerns are that not negatively impacting victims and that is not currently in place. I think it's just they're looking at general fund resources for that 14 million. Yeah. I'm obviously believed in the importance of making sure that the backlog of the of the rate cuts. It exists across the state our address that that backlog is is addressed. I also want to make sure that whatever the funding source is not going to be punitive towards towards victims to on who might be more disproportionately impacted by gender-based violence. So in the past that have been proposals around texting the the entertainment Industries for this particular Revenue source, and I would continue to object to that type of a revenue proposal and I believe those concerns were heard loud and clear. That disconnect was remedied by not actually texting people who are injured by this and looking for other alternative Revenue sources. And lastly I wanted to fly to bills that I know council member herbold his work closely on to represent of pellets Yeti proposals on the bottom of page 21 House Bill 1382. Would Grant immunity from prostitution charges to those seeking emergency medical assistance and that is currently in rules along with substitute House Bill 1383 on the top of page 22 that would change the second conviction of patronizing a prostitute from a misdemeanor to a gross misdemeanor and not passed the house unanimously on March 6th and lastly under civil rights and safety not I'll touch on a few pieces of legislation including substitute House Bill 1713 and the middle of page 22 that would require wsp develop best practices for an improved law enforcement response to missing and murdered indigenous women as well as establish liaison positions within the agency to build relationships between Common and Native Native communities that is currently in rules choose me and that bill actually passed the house 90820. So unanimously, I will be heard in state senate government in tribal relations on March 15th. So congratulations a bill that would restore voting rights for those in community custody substitute Senate bill 5076 is on the second reading calendar and legislation that would eliminate the death penalty continues to move along on the top of page 27. I'm sorry Senate Bill 5339 sponsored by Senator Carlyle passed the Senate 2018-19 until summer bag Shaw's birthday and has been referred to house Public Safety. Very much. And without a will go ahead and move into the transportation section before you do that. I have a question about the public safety area steps House Bill 1282 driver's license suspensions. This is at the bottom of page 21 looks like it's being support or sponsored by representative Reeves a little bit more about the categories of those licenses. That would not be subject to administrative reinstatement. So there's they're suspended under article. Is that for I'm terrible with Roman numerals gibberish to me. What is absolutely I'll try a demystify the gibberish. So this bill that would essentially decriminalize the failure to respond to a non-criminal traffic infraction that requires the payment of associated penalties RDW S3 as it currently is which is right now in misdemeanor charge that would eliminate it as cause to suspend someone's license and it would create a new dwlsr driving while license suspended for which would instead change that to a traffic infraction. If the person has resolve the underlying issue but isn't able to reinstate their license due to unpaid fines. It's kind of decoupling not from decriminalizing further effort around Financial Obligations components. Nature of our system back play. Okay go I want to thank you and I think he tells her for flagging that cuz that was on something I'd like to with the driver license suspended in the first and second and third degree in the costs. Keep going up and not just court costs and fees most people end up getting their license. Take away. It has nothing to do with the fact that they haven't done everything. The court has asked them to do it just as they haven't paid those fees and so they have to continue to drive to get to work and then we saw how a disparity of treatment this is been going on since I was a public defender and I won't tell you what year so I'm glad to see this is finally being taken care of. Thank You instrumental in that has been working very closely with Rebecca one of our contract lobbyist down there on this and have push it for years. So we're we're very thrilled to see a continuation of at this point. As a very quickly and transportation, I'm we continue to work with the interview. See who's been super helpful on the scooter issue. I'm also working with the industry to see if we can come to some agreement. Not sure exactly how that's going to turn out. Sorry. I'm on page Thirty at the bottom half way down motorized scooters, but I'm actually going to turn it over to Christina to talk to you about automated traffic enforcement officer questions about channeling at this point. Thank you for the work on this because I know something important to her and I think you thread the needle nicely. Thank you. The moving to the top of our last page page 31. We wanted to give you a brief update about the automated enforcement the block the Box legislation has now officially moved further than it has in it Center history so that it continues to move for it as well. When it came out of out of the physical physical cut off. I'm one of the changes that was made was to make sure that it was Seattle only that the first citation was a warning and then yeah, I think those were the two that were the main ones and so we're just awaiting it being hurt on the house floor right now. We continue to work with our stakeholders to make sure that we're connecting with right legislators to express the importance of this as you can probably tell based on the way. It's written that that the house vehicle is the primary vehicle for this legislation. So we will continue to track and we'll let you know. Hopefully we'll have some news sometime soon on this one. If you're being more big than and some of the other ones, but you said it's gone further than it ever has before what's the likelihood of this passing at this point? You know, it's it's still quite a heavy there's there's still quite a bit of opposition out there around this one. This is this is right up there with any time. Someone's been a red light camera bill, but you know, I think we I think by narrowing it we've got a little bit of a better shot but it's really just going to come down to continuing to work with our stakeholders and communicating with legislators why this is important to us. I know there are a lot of other cities who are eager to have this in place within the jurisdiction. So that's very helpful. It's always helpful to have cities other than us helping. Yeah. So what we're going to need to work will be hard on this. We you know, we've we've put a lot of good work in and S. Has been incredibly helpful with this legislation. So we'll keep you posted in hopefully the next update or it will they be gone even further than this? As relates to that bill is any of the are any of the concerns being expressed related to the use of the revenue that was an issue that I know we had discussed. I had discussed with Oar during our budget and I'm wondering to the extent that those might be concerned that that were using the revenue for general fund purposes instead of purposes specifically associated with pedestrian and bike Traffic Safety. We could maybe tie our hands if that would help him in and make that it's not currently the issue to my knowledge. It's not that was an issue on the Senate version but on the house version, we haven't really defined what where the revenue would go. I I that's that's helpful, Very helpful fast. Yeah. Yeah. Right. Now the thanks of bility has been very helpful as many of you have thought through this policy Creek creatively with with our team. I also just wanted to add she's passed through many weekends has made herself available to do legislator Outreach on this to talk about some of the public safety implications and why this is important to the city. So I just wanted to acknowledge the incredible work that got Chief S10s. SPD have also done to move this forward. Are you done? I think okay Beyonce Johnson has a question about know anything can always move forward could be designated as ncib at any minute, but that was the bill that would have cut about seven billion dollars for the funding out of the Sound Transit 3 program. So fingers crossed that continues to be stuck and just again cuz I know many of my colleagues will be going down next week. There is still a bill being discussed in Olympia that would raise a whole lot of Transportation ever. Let it raises a lot of flexible Transportation Revenue flexible. Meaning it is not required to be spent on roads, but it's spent a lot of that flexible revenue on roads. So as you're thinking about talking points to connect with your colleagues in Olympia, making sure that flexible Transportation money goes towards flexible transition projects would be a good and welcome thing for us as a city because right Now we're spending a whole lot of carbon tax fee money on a whole lot of roads that are going to result in a lot more carbon. So those have consistently been taking is a city. I would have traded my colleagues to make those points and then meet with legislators next week. Thank you so much. So we will go around the table and then we I understand that. We have a presentation of the Seattle design commission. So I'm just going to start for some reason notes from Council or counsel present Harris office. As you know, he's excused today a turns out that number one is part of the rotation of the three co-chairs counselor Bagshaw councilmember Mesquite and cancer Marissa want for the select committee on homelessness and housing and affordability council members who want which are the next select committee on homelessness? Can let me finish. Please will be tomorrow, March 12th at 2 conference Awana. Please cancel my Bradshaw. Ask you a question. Okay, so yeah, can I get through this and then you can say I think you let me quickly go over what the seven items on today's agenda on the reappointment of Robert Nelms as director of sales Center. We have an ordinance of idealization of 2.4 million in inflation-adjusted dollars and then development category of the parks in Green Space Levi from 2008. It's basically an inflation condition see that we're shifting money over to to take care of we have an ordinance accepting a gift from the parks Foundation of a Timber Pavilion in Occidental Park, and we have four appointments to the Seattle Center advisory commission Daniel Tam Claiborne, Jenna lemon, Elaine Adara and Raquel. So they're all wonderful folks and then decided to get their appointments approved and our next meeting for the Civic development public assets and Native communities committee will meet on Wednesday, March 20th at 2. And I think that's it. So we will just go round table customers want. Thank you. President Juarez. Good morning. Everyone there. No items on today's full Council agenda from the Human Services Equitable development and renters rights comedy. The next meeting of the committee is scheduled for a special time Saturday, March 16th at 1 p.m. At the New Hope Missionary Baptist Church, which is at 124 21st Avenue in the Central District at that meeting. We will discuss Equitable development in the Central District apartment building call The Chateau, which I talked about last week office of Housing and the department of construction inspection city of Seattle will be joining us for the committee meeting along with the residence, which we really appreciate that committee meeting will also include another agenda point which is the legally required retroactive public hearing on the emergency legislation to establish an emergency moratorium on the mobile home parts in Seattle. This was a legislation that consumers will remember to make sure to preserve the house you on mobile homes without affordable housing for seniors. Disable community members and this is a legally required hearing which is on on a legislation that has already been enacted into law. Little to be holding the next meeting of the select committee on homelessness this week Tuesday the 12th at 2 p.m. Here in council chambers, which is the usual slot for the Equitable development committee. But since the meeting is being held on Saturday, we can hold us at select committee at this time, which is Tuesday at 2 p.m. And I believe my staff have sent out the agenda. We have to watch and items wanted to discuss the immediate future of Sharon will shelters after June and then the impacts of rents and evictions on homelessness and we will be joined by dr. Tim Thomas who is a researcher at University of Washington who's been doing research on King County and Statewide data on evictions. Thank you so much. So I have no idea memes on today's full Council agenda. Although I do have an amendment that I'm going to hold talking about until September up Ryan speaks cuz it's related to his legislation. I have a light committee meeting this week Tuesday the Civil Rights utilities Economic Development and arts committee will be meeting at its regular time every appointments on the agenda for the lgbtq commission. And we are also going to hear from Central staff presentation of a draft version of a council bill on closed captioning in public accommodations. This is a bill that was brought to me as an idea from a people with disabilities commission member. And again, it's it's in draft version yet at this point. It has not yet been introduced really excited about it. It extends the work that the council has done here at City Hall and closed captioning and though it Been in play for a little while. The Seattle channel has asked me to mention that they have added real-time closed captioning to the Seattle City council meeting streamed live on Seattle Channel's website. So we've had it on television, but they've just recently added it to the streaming online as well. Events coming up this week Sound Transit will be having a Delridge specific workshop at the Youngstown cultural center from 6:30 to 8:30. This is a meeting that council member Joe McDermott King County council member Joe McDermott, and I requested of sound transit to do a bit of a deeper dive on the potential impacts of a proposed alignments on Delridge on Thursday. There will be a families and Ed Levy implementation meeting also in District 1 also at Youngstown Youngstown love this week and then on Sunday March 17th at City Hall, we will be having our third annual now North celebration and we will be circulating a proclamation later this week. Q there two items on this afternoon's agenda from the sustainability and transportation committee one is Council bill that would Grant a 10-year permit for University Washington to operate a pedestrian tunnel. This discussed last week is between the parking garage at the triangle like in Pacific in the campus mechanics that parking garage to the hospital and it's been in place the television there for a little over 30 years. And so we would renew that and extended for another 10 years and then we can video on for 2 more 10 year terms after that legislation is lifting a Proviso on the Delridge multimodal multi-modal Corridor project. This is a Proviso we put in place last year during the budget to ensure that there was significant community outreach as it went through the various design levels there at about 30% design right now. They've done some really good work. Community members in committee, we heard a lot or heard some from community members who real pleased with the the feedback that I started taking this point. And so this legislation would let the provides us they can continue to do the design work to the next level and we expect to get our future reports back and said councilmember herbold in the morning close to going to be back up. We received from community members both and the transportation committee itself and its subsequent meeting. I had with the West Seattle by connections group attitude just a little bit more specificity. We worked with MS. And it just relates to the expectations that the city council has before appropriating the next set of funding and we will be doing that during the 2020 budget process. And so the items that folks wanted to shoot up relate specifically to Items that s. Said that they would be doing during the 60% design process as well as some additional additionally identified items. I could go through them. You could beat them together there on your own. They are just generally speaking their issues related to bike safety in the area at traffic calming for both bikes and pedestrians as well as some expectations about agreements with Seattle Public Utilities in s. Because there are some there are some for Capital Improvements for Seattle Public Utilities as well as different than the one you gave me Friday it is okay. Okay, Thank you for doing this one of the issues that we've had around neighborhood Greenway since 2011 is that they don't connect to each other and having in Pendant little lines that they're like worms across them out. But until we get him to connect we're not going to have the safety that we want for all ages and abilities. So thank you for taking it on. And I support the amendment appreciate your working when three members working on this end. That's consistent with what I believe. I saw I was trying to do too. So I don't get to see the gender from stable and transportation and we do not have a committee meeting. This week will be meeting next week. Thank you for the afternoon, but we will have a meeting this Wednesday 3 very exciting ordinances in a resolution that will be dealing in correcting with amendments in the coding from the 2019 budget. So I know you're all excited about that. I know so I'm sure we'll have all seven eight nine of us there. But the other thing the actually is something that people may want to pay attention to is we have a play Pike Place Market ordinance. It actually renews the PDA and day stall agreement. That's known as the hilt Licata agreement. So is Michael hiltz agreement that was then amended by Nick Licata and it provides a term of 10 years for the vendors in the new area of the Pike Place Market. So those will be the four things that are on our agenda for way. She was on the PDA for the market are those are done every 10 years. This particular Amendment focuses on the vendors, and the location has the van and he gets to sell what so this doesn't deal with our date. So right or with the steinbrueck park next door, which is something we're continuing to work on. Thank you. That's over Jonathan. Good morning. No items on a full Council for this afternoon. Would you have several items on the interaction referral calendar the first day's resolution 31870 which is the companion resolution to our Citywide management housing affordability program want to say thanks to all of your offices for working closely with Central Staff last week to get that resolution ready to go. So that will be part of our discussion a week from today. When we contemplate the final passage of the mandatory housing affordability program there to Other Place related items on the direction referral calendar. They're both quasi-judicial. So the following message is brought to you for my Law Department clerk file 31442. Ozan application of Mount Baker housing to rezone 17992 square feet located at 2802 South McClelland street from Seattle mixed North Rainier with a 65 height limit to Seattle mix North Rainier with a 75-foot time limit and an mha suffix of M. We also have clicked file 3 1 4 4 2 1 and application Green Lake North LLC to rezone a 24700 square-foot site located at 420 Northeast 72nd Street from neighborhood commercial to with a $45 limit and pedestrian designation to never commercial to with a $75 limit in pedestrian designation and an mha suffix of M1. Those applications are now pending for the purposes of our quasi-judicial rules. So you should therefore avoid Communications about the merits of the reason applications with other proponents or opponents as usual. Please see keto Freeman of our Council Central staff Wednesday evening on a sound transit related business. There will be a community Workshop in the Chinatown International District at Union Station to allow community members to come and get a preview of the proposed station locations that we've analyzed so far and to collect Community feedback before the workshop that the West Seattle Ballard elected leadership group will be Attending later on this month on March 29th. So for those two really want to dig into some details with community members. I encourage you to join us on Wednesday evening at Union Station from 5 to 8 p.m. I'm also just want to finally surfaced that at the conclusion of our little round the table discussions will be bringing up the sale design commission to give us their annual report as part of the virtues old process for me and my future employed and HL Seattle. I'm going to step away from the table at the conclusion of counseling with his report to maintain the firewall about not getting any briefings about the Seattle Arena project. So I believe that this presentation will receive is retrospective to 2018 on the off-chance that council members may want to ask questions about the design commission to work moving forward with the arena folks in 2019. How many be stepping away from the table so that there's no point of contact. Thank you. I will be happy to go to my report. So we and I will also be needing to probably leave cancel briefing early not because of a conflict of interest because I have to be in South Park by 11:15 a.m. This morning and we ran a little bit longer than I expected a missing most of your presentation. So nothing on this afternoon's agenda from the gender Equity safe communities numericas in education committee. We do have a regularly scheduled to be hearing this Wednesday of that is March 13th at 9:30 a.m. We have to agenda items are in our Committee hearing the first will be to hear about the families education preschool and promise implementation and evaluation plan. Will be to hear from the Seattle Police Department Seattle Police Department around a shots-fired data and how a speedy is continuing to respond to gun violence throughout the city. So I'm just want to really highlight but Wednesday is going to be again the kickoff of our discussion in my committee on the Levee implementation plan. We all remember that we began working this face last spring and then the levy was renewed by the voters in November and it was a renewal and slight enhancement from the cities prior levies, and we're really excited about being able to have a robust conversation about how deal is intending to propose the implementation of those plans across the full spectrum. Of course, it's an expansion of our preschool program by a nearly doubling of the classrooms slots available to Children throughout the city will also here in the implementation plan that there is a proposal to expand Preschool access to three year olds as well as 4 year old so it'll be a huge improvement over our existing system will also talk more about our existing investments in the case through 12 space including supporting family support workers, and I'm really excited about one of my priorities that I championed during the Levee development, which is a new line of investment for students and their families who are experiencing homelessness. So this Levy went through this level, we anticipate being able to generate an additional seven million dollars to be able to support students experiencing homelessness will here for it from ideal some of the work we've been doing with them about how to craft that program in a way that is as as easy and flexible for our providers to reach those families. So I really really excited about being able to roll out a strategy that will focus squarely on students experiencing housing instability in In a doubled-up sense about 62% of the students experiencing homelessness in our school. Seattle public school districts are actually are actually experiencing what is referred to as housing instability meaning that they're doubled up and not actually experiencing homelessness. Unfortunately, that's a space where there isn't a lot of investment made by philanthropy or other government agencies in terms of addressing those individuals. So we are really excited about being able to strategically Target housing and stable as students with really flexible dollars to make sure that they can continue to be stable and learn and have academic success and that's for the K through 12 system. We also a commitment to the family support worker isn't our Public Schools as a cautionary model with the Seattle Public Schools to reach more Title 1 schools, and we spent a considerable amount of time undertones number Johnson's leadership. Are investments in the caser told space to ensure that we were not a stripping away severely our investment in the case Roe v space in particular. So I think we'll be able to see proposals around how to best structure those dollars on going to make sure that we are supporting our kids in space in addition to the six through twelve space. We have a will lay out the process of moving forward. There is a last-minute conflict that came up unfortunately on my behalf for the week of April 8th. So we are currently exploring alternatives for April 10th. We may either have a special meeting the following week or we will have one of my committee members chair that committee. I'm hearing any event that we need to continue on April 10th. So just hanging out with the caveat that the timeline towards the end is going to be modified slightly because I've had a personal issue that come up that I need to tend to that particular week. So I apologize that we didn't get a chance to incorporate those potential modifications into timeline before we distributed but we will do so as soon as we have that confirmation of that we're going to move forward. So that's it on the Levee on that on the second issue issues. I know that in the past when we have had SVT come into committee and present on this issue. There's been interest from district-based council members around more specifically wants data for your for your District's to the extent that you want a speedy to address this particular issues. I'd ask that you connect with my office Cody writer in particular to submit any sort of inquiries to him now. We can get the police department to start thinking about how to Cole through that data in order to be able to present it or answer questions specific to your districts in in committee on Wednesday. So, I'd appreciate that and then last week I will be out of the office on this Thursday and Friday March 14th through the 15th. I've accepted an invitation to join members of the Seattle Municipal Court in Denver, Colorado to attend what is known as a pre-trial innovators conference. It's a pretrial Justice. It is put on by the pretrial Justice Institute and looks at new trends emerging practices promising practices around how to divert on individuals of from coming into contact with our criminal justice system at the municipal level in particular. And so this is part of our ongoing effort to work at both with community and institutional and players around around Realignment of Arc from the legal system. So this will be an opportunity for me to go out to Denver and attend date of workshops including how to reinvest in community. If we if we're divesting from the criminal justice system looking at bonding practices and how punitive they are for for our community and and just really listening to a lot of the expert subject matter experts in this base who spend a lot of time thinking about how to reform a criminal justice system that is more Equitable and just for our committee member so I will be doing that on Thursday and Friday and excited to come back and share what we've been able to learn. Thank you so much for your leadership cuz I know your background and the pre-trial issues are Sookie because we want people to come to court to take care of their business without having to be arrest. For failing to appear or lose some of the pre-trial issues that happen. So thank you very much for doing that. And also think you can spare Johnson and Katherine Gonzalez again for your leadership on the Levee. That was you did a great job. I understood the issues you flag the issue. So I really appreciate that since that was my first time sitting isn't elected and trying to understand how these levees move forward and you made it very painless the complex body of work and I'm glad that there were two of us were looking forward to the continuing conversation in my committee about how organize and evaluate the success of those Investments on moving forward over the next seven years. I I will I will warn you that the implementation plan is about a hundred and twenty Pages. It's incredibly dense. And so for those of you who have ongoing interest in this face, I really do invite you to join us on Wednesday, or you can watch the video at your leisure after But this will be deals first opportunity to give us a high-level overview of the different components of the implementation plan that specifically respond to those priorities that city council indicated. We had in the resolution advancing the Levee to the voters. So so so the conversation on Wednesday will really be centered around. How does the implementation plan Meat City council's stated priorities in there in a company resolution to to this ordinance. So really urge you all to to join us on Wednesday if you have the time and availability lastly, I just want to conclude by making sure you all are aware of some of the work that is being done by the Seattle office of Inspector General for public safety inspector General. Lisa judge just copied my office on a notification on the of her first. What I think is as might be her first audit. I'm out of that office and it'll With regard to mutilating and special commissions related to the Seattle Police Department. So just wanted to as a courtesy make sure you all were aware that that work was continuing on and I'm passing out a notification from her office as to that audit for those of you who have an interest in how's the Seattle Police Department manages? Its Mutual Aid agreements. I know that the council had some interest around that particular issue last year. I wanted to make sure that I fly for you that this this body of work is going to be evaluated and if there is to stomach by the inspector General's office and then wanted to let you all know that that work is happening. And if you have any additional questions about the bodyworker the substance to it, I would encourage you to reach out directly to Inspector General judge that is it for me. Thank you and councilmember Johnson set the bar high. So when council member bad Sean, I start the library Levy. Thank you. We are happy to support your word at the agenda. Let's have our folks from the Seattle design commission. Come on up and do their thing of your 2018. You mean 2018-19 annual report? Okay, great. I'll let you guys come on up and introduce yourself and I know that you gave us material ahead of time. I hope everybody has in front of them of your presentation outline. Okay. Thank you. Go ahead and introduce yourself and then we'll just get started. Hello, good morning. And thank you for having us. My name is Brianna Hall in I am the urban planner commissioner. This is I'm just entering into my third year on the commission. Thank you for having us this morning. Thank you star cast members on Michael Jenkins that director the Seattle design commission and thank you so much for making time today in previous years. We've often times gone to council member Johnson's committee is part of opcd being a part of obesity and going to the pledge committee. Although I do think the Commission in their districts. Are we really appreciate you taking the time for me to hear from us today? And you will have printed copies. I'm going to get started. I'm going to provide you with an overview of the commission. And Brianna is going to go through a number of the projects if the commission has looked at in 2018. And that's like a new one. That are really bright. I want some mood lighting. Turn broken of the presentation today on 240 topic areas an overview of the commission just to remind you about what the conditions makeup is the work that we do and how we review projects as well as chat on our review of the year last year. And then Brianna will go through a number of project highlights that we think will be of particular interest to you. And I'm finally talk to you a little bit about what's coming in 2019. Just to give you an overview of a commission. We were established in 1968. So actually this year were trying to plan a 50th anniversary party, which were hoping I think is going to be in June and it's taken a fair amount of time to go through and look at I think we're up to 1270 projects that the commission has looked out over its 50 years. And so trying to figure out within the context of those projects which ones we think that the commission at find particularly important or compelling. We're also hoping to go out to the public and ask them from their perspective about what capital projects Parks community centers and projects like that are particular particularly resonate with them as a community member to hear from them as well. I'm so in that the commission advised that the mayor and the Council on projects that affect the public realm including Capital Improvement projects, which are predictable Slade Parks community centers police station fire stations. We also look at right-of-way projects as cast member O'Brien knows we have a significant role in the review of Street and allocations. We also look at sky Bridges and then other projects that require a long term use of the right-of-way. Out of commission also looked at major transportation projects word for 2019 work including our review of the proposals at State Route 524 the montlake lid and a pedestrian land bridge before moving on to our review of the replacement of the Portage Bay Bridges and a lid that called the Delmar LED witches up around Seattle prep. The commission also doplanner policy reviews of projects that affect the public realm we've looked at the the master plan the bike master plan plans that have our overarching policy and implementation strategy for affecting the public Realm. And then finally the commission used to be one of the key members of what was called the light rail review panel light rail review panel completed its work in 2016 and it was members of the design arts and Planning Commission. The focus of the light rail review panel was looking at Light Rail stations in their neighborhood integration. I certainly the Seattle design commission is trying to determine right now what their role will be in a re envisioned Light Rail review panel for st3 Investments the other members of the elected leader group here for working with the Seattle design commission, the Planning Commission the ped and paid commissions all of the inter Transit group that are pulled together. Weather be like this as we move forward with Sound Transit 3 organizing. Its I think of really really big added-value and I think the more that this work is done up front instead of on the back end the more we can meet I think Sound Transit skulls of delivering a project quickly as opposed to I think some people might be concerned by that this kind of worried. They would slow things down. I I don't agree with that. I think getting these issues into the community and getting them to Grapple with them early on is better process and also will smooth the way when the hard hard decisions in heart changes start to buy a car will thank you. You don't have to plug very hard for me on that. I'm totally in support and of course I met with you and some of your commission members within the I'm 6 months and we know just looking as an example at the waterfront that part of what we did on the front end was to say we want the engineers in the designers to be working hand-in-hand. We didn't want the designers to come in afterwards and have to either redesign or try to rescale what the engineers said were what they needed for engineering practices. So I really appreciate the work you're doing I think councilmember herbold is right on love to have that information up front and long before final decisions are made because it does speed it up. We know that if we have to go back afterwards and then try to fix things that's when we start getting the appeals in the lawsuits, but to the extent we can bring you in on the on the front end. I'm all in favor of it. I'll talk a little bit more about the role that the design commission played with st3. I will say that there is a meeting coming up on March 29th. We're trying to schedule with different. LG members offices the week of the 18th to provide you with some observations that the commission has flagged as a result of a joint commission meeting that we had with members of the Arts planning and design commission to really look at the issue of what the what sound transit impacts are at Chinatown ID and really focusing in on the edge of the issues of equity and placemaking and try to develop and flagged issues for you, which I'll talk about Noah design commission is not specifically I'm imagining the opcd where we're house probably is but we're not scheduled. I don't think that we have anything specific. We may have a staff member going though. I'm councilmember Johnson talked about it. I'm I'm planning to attend to be able to hear from the community directly because it's so easy to begin saying well. This is what the community wanted. But if we weren't there to hear it the first go at our joint commission meeting on the 27th that we had with numbers. We had not only members from the community Cassie Chan representing in her roles the Arts Commission on the Arts commission the members of the community including Michael Winkler chin and others offering their Impressions about what they're saying. So we're going to have an ongoing conversation with the members of the ID to hear more from them about their expectations about placemaking. Show again moving on with the presentation to the commission that includes 10 appointed members that all the commission members are appointed by the mayor and they're confirmed by the council. We are waiting appointment mayoral appointment on three of our positions are landscape architect or Transportation planner and one of our Architects as well as our chair. The mayor of points are chair on the council confirms the chair those including Brianna stroll who would be she's every appointment this year has not been approved yet and we're hoping that that will occur relatively soon because their appointment ended in March and are Quorum requires five commissioners. So what's a delay on that what needs to happen and I think they're trying to figure out a way to prioritize one to move ahead in particular conditions, like our commission that affects the time in the projects as well as commissions. I have a regulatory review for the short term for the long-term. I think that's a larger question between you and the council in the mayor's office to figure out a way to to streamline the appointment process. Thank you. Thank you. The next light is of the commission's mission and it's a six-point mission that really looks at elevating design neighborhood integration sustainability Equity looking for Partnerships between the capitol departments. We think that's quite important because when departments work together to elevate projects, we often find some successes and projects like Bell Street Park where they come together to create a place larger than their individual investment and then finally effective Investments looking at the best value. I think the Commissioners speaking for commissioner. I think that they would agree good design doesn't need to cost more. It just needs to be reflected of the communities Act of expectation in it elevating Urban Design as a fundamental project cool. Just an overview of how we look at projects that we always provide this just in context to understand how the commission works in the context of Permitting more more in terms of capital projects. I think that the commission is really interested in trying to get in at the very Inception of a project after project has been funded often times playing a role in the selection of Architects or the design team because I think that it's particularly important Rihanna recently served on a selection panel for freeway Park and I think it's particularly important because it's a way to make sure that the teams that are investing in capital projects are implementing capital projects for the city that they identify and Elevate the what matters to the commission early on in prioritizing not only project goals that the team to implement that schools. So why are you in a position where it's public information? Cuz I was there on Saturday with a group that Lyle was there but it was like buy stock. Scott vanness Wu qian Li die 5 effort. So can you talk a little bit about that specifically great candidates. We had a good good field to choose from I think it's a it's a 10 million dollar investment that's going in from the public benefit package from the convention center is just what was the scope of work on that? What was the ultimate scope of work? Well, it's a different project teams have different approaches to it. But it's it's essentially a refresh of the park of making it more accessible. And and I think there's a there's a bathroom. That's that's potential to be remodeled and and maybe an opportunity to do something unique and reopen it and of course. I think when the right exactly. And the other thing I'd like to point out of State Street and allocation process changed dramatically last year with the adoption of new policies that affect the timing of our review before a applicant applies for a vacation whether that's for a private applicant or city or another government. They're required to come to the commission first and the role of the commission before they start the permitting process. Cuz what we've been finding over time as this that the permitting process had begun the commission would come in after permitting and so really important issues about access smashing open space public realm enhancements were already set before the commission could actually influence it and develop a list of priorities that they wanted the applicant to pursue. Go ahead in the comments comes from her Bowl made a few minutes ago about the Sound Transit the just the concept of kind of early feedback at a high level is really valuable and I'm really looking forward to see how this plays out but too often we would get to a point in a process. Where will we see some really great Alternatives and the reality or at least that perceive reality is what was so far down this one path for us to stop and go back and consider a different change would be really problematic and which leaves us in a really tough decision to deny something or accept it as is and so this council member Brian for leading the charge on making these changes to speak to all of us so we can all move on. So the past year that commission looked at 16 projects around the city distributed throughout the City downtown Ballard Southeast Seattle West Seattle Furniture sing this year. We've been a little bit slower and I think that's okay because I'll let Brianna Brianna has has an opinion being commission member. Of course, you fold a every other Thursday and it's a huge lift for Commissioners and I were very clear with Commissioners when we recruit them that it is up to 20 hours a month in the day. So a little bit of breathing room isn't necessarily a bad thing for them. I would say I didn't even with it the full day. There's also you know. Subcommittee is in the in-between meetings and prep for all that as well. That's certainly appreciated to have a little bit of breathing space and I think that the nature of the project we've been looking at our very complex as well. The projects are getting more complex. We had 10 reviews last year and Sound Transit pulling together different workshops to help create the recommendations that we did for you for the level 2 review. We had 5 reviews, excuse my 7 reviews of Seattle Center Arena. Our meetings typically will be a three-hour review of of a particular project just because of the complexity in the end of the projects, I think Commissioners and staff appreciate a little bit of breathing room this year that's going to change. We've got Sound Transit coming back to us next year in the following year. We've got a lot of projects coming so we'll take this year as a breather and last year. You're helping me with yes or crescent and I want to acknowledge and appreciate your help. We are helping you. We are helping a council member Bagshaw had approached the commission to look for a way to get a conversation going an interdepartmental conversation in a workshop for I'm at which were currently organizing to look at. Not only the yesler Crescent work before stand square. And how do you tackle a multi departmental multi-stakeholder issue where frankly Equity is at the front is an organizing principle. So we're looking at holding in a workshop with bringing all of the players together and looking at where we can figure out ways for that site all of us sites to work together or not. They may need to be independent size based upon cultural identity history historic resources within the park. We're working currently with the parks department opcd and the historic boards. All together that workshop on my to think it's going to be in May so we're doing it in a timely way to respond not only to the Proviso but with the guy cast member badge has expectations. Madea boo. I'm imagining the Daniel Strauss from your office has been we've been talking to him about that. And of course any council members offices, we happy to you know information weekend parks department has helped us with City Hall Park. And one thing I want to make really clear as we had nine hundred thousand in the budget to get last year, but that I'm hoping that isn't all going for workshops and planning. I'm hoping that we'll have some action on a number of items that we've been talking about or way too long. But in particular when you talk about forts in square, we have the DIA session of the Arts there and I know that Randy angstroms been involved sound transit's been great about our little Prefontaine area with The Pedestrian Sound Transit exit and cleaning that up and painting and fixing the plexiglass that you can't see through all this. But also just lighting it and starts been working with us about putting some more Festival Lights. Vision it's not new stuff. You know that what we did with Walker Macy a couple years ago. I guess it was 2016 now, so it's been three years we've got design ideas. I'm just hopeful that we can move some things forward. So we're not wringing our hands five years from now saying why does it still look so bad. So we're going to move on to project quickly, but we're being conscious of time cuz I want to get to the projects that Brianna will take the rest of them as on st3 design commission is currently developing recommendations for you in advance of the March 29th. He'll be relative to CID. Although we may touch ground on Delridge although Delridge in and of itself to man. I think I was a level of work that we may take on as well. We're also which we discussed a little bit ago. We are trying to evaluate how the design commission will fit into the permitting process. We are looking at a model similar to a light rail review panel did before the problem is is that that was really based upon it was of ad hoc approach and we want to be much more intentional because the sound transit's review process of really cute up in a fast-track permitting permitting. I think we'll begin in permitting reviews will begin in 20 21 questions that I have is who would be impaneled design commission has a role, but I think there's a definite role for a pedal bike board and other boards with license over. How do these get integrated into our neighborhood would also like to consider having a member of the community be a part of it. However that's empanelled in previous in sound transit to in the previous and the first investment. It was done through memorandum of agreement. I'm thinking that might not be the best way to do it. I think it needs to be codified. I think expectations need to be codified. I think the measures of success need to be codified much like her design review program everything to everyone's expectations from a policy perspective needs to be in trying to figure out. What is the bag where are designed values? How are they being implemented with these station as they're seeking City approval to integrate into our neighborhood and I think that's an important point for us for you and for the executive to figure out how does that what is the measure of success in terms of integration into our neighborhoods? How is that expressed either through design in 10 design manuals things like that? Are big takeaways from the Chinatown ID meeting were we need to figure out a way to protect cultural infrastructure. We need to figure out a way to elevate equity in the designs of anything that occurs there and that the city should be taking a lead for developing the vision for how st3 fits into City neighborhoods. I turn it over to Brianna. All right, so I'm going to run through a couple of highlights of projects that we looked at the design on versus the process of st3, Seattle Center Arena. So the arena itself is actually a landmark structure. So we've tried not to overlap with what the fireworks in inserting. Our own role is is looking at the public realm. There's a lot of opportunities for how the building itself is being reoriented towards Thomas Street. It's currently main access is along 1st Avenue and and to look at that interface in the opportunities for how that public space in South Assad has opportunities for art and Landscape in those considerations and also has pedestrians navigate through and to the site is a key piece. Especially with considerations for the Post event accommodations because that's really won the potential storage and transportation demands are going to be the most acute. Are you working with the folks on the wayfinding signs and all that to what we are trying to figure out how how did their public Investments fit with our public Investments and by reorienting and how you go back and forth after an event has been a critical problem to tackle because again as you leave Seattle Center Arena people are going to be Crossing Thomas and they have a garage that will exit onto Thomas then they got the existing investment south of there. How are people moving back and forth and it's a critical issue to make sure that had safety off all the things that we're about are invested in. We've done a lot of work on this obviously in the last year and Nelson Nygaard has been very helpful there a ton of design ideas out there including getting people buy buy bike through the campus and a over, of course if they want to cross over to Myrtle Edwards Park on using the John Koney Bridge. So what I'm really excited and hopeful for that we can take these good ideas to figure out how to coordinate them. Once again, it's like what we were saying about neighborhood GreenWise if they don't connect I don't want to say they're useless but they really don't help somebody who is riding her bike and then suddenly the bicycle path ends show around here as much as you can help create those pit pedestrian networks that we know ultimately light rails going to be there in 17 years, but between now and then it's the monorail it's bike. It said it's figuring ways to make these connections that can be really helpful. So I got voices important. Those are all on our radar to neighborhood is this very unique opportunity for to convert was existing as a Playfield into a larger Shoreline integrated park for both active and passive Recreation. Four times in the past set starting in 2015. And our last I think we we approved the schematic design in October of last year. So there was a number of challenges that there was some some disagreement with the commission being that the challenge of the road that 23rd Avenue West by for kids Poseidon and creates a little bit of a barrier between the two actions or two sides of the street there a vacation. It wasn't viable because of financial constraints but it does provide a challenge for it being a holistic connected Vision. Also, there's a CSO that's not timing is a little bit further out. So this put some some hindrance on on progressing and also let me know when it's done is ended the ground in the million gallons and we spent a lot of money on that. So, what are you talkin about? Critical element but it's also its location isn't necessarily well-placed when you look at how do you create a larger Park? So you have the challenge of the CSO where it's located where it needs to be located and then a road that bifurcates my site. It's not an optimal. It would be perfect to have a clean slate but we don't have it. So it's a design challenge that I think in many ways limited probably some of the the programming options we would have liked to seen on this because I know Parks has been working on it most of my lifetime and I'm really hopeful to see something that is accomplished. So I'm just I guess my questions or do you have a plan different than parks? Are you working with Parks or are we going to get seriously or we're going to be able to move forward because we've put a lot of money in this. Active recreational pieces and that was a little bit of concern to of not doing the shrine Restoration in the more passive parts that are a little bit more accessible to all of them than just the the specific users of the the play fields that said that there's we certainly gave strong messaging that there's their move forward to for the phase 2 in the end at Shoreline restoration as much as possible as soon as possible and it's going to require some coordination with Port as well. There is some as you can see on the slide some Waterfront access in terms of a stare. But yeah that the overall restoration is delayed unfortunately. So Marion Street Bridges is an integral part to the office of the Waterfront proposals as them very much of Gateway project huge use for as Colman dock is being redeveloped. This will be connect to that new structure and then take take the bridge all the way to Western Avenue is the viaduct is coming down that is the phase. It's funded second phase of it that will take you all the way to 1st Avenue is is in the future and that was one of the big pieces that we worked with the designers on of how to make that an integration cuz I'm also so that the column shape of making it more of a human pedestrian scale and then taking considerations for sight-impaired than making sure there's no barriers. There. We are. They look exactly like what am I missing missing the cheap for them? Frankly did not only change the column Dimension, but also in a great storm. Water into it the column on the bottom is actually stale dated. I know it doesn't look too it's a little bit and it did the goal being how do you integrate stormwater facility into a column design? How do you get the column to be a little bit scaled a little better scaled for the scale of people walking by it makes it feel a little less ominous in a little more integrated into the neighborhood. It's the little things council member just tell what the difference was between before. It's the Y Do you know when it doesn't seem like a lot of it is a big deal to do that. And this is just so one of the other features is is because it's phase that the the railing will be upgraded on the entirety of the bridge. So it feels like a cohesive things and if if and when the rest of the bridges and then we can reuse those railings and lighting scenarios to some part of it is telling us does not need to be replaced currently. So I think that's the First Avenue from Western to 1st and their concern was that they didn't want to take it down and put it up cuz it was going to be another X-Men Origins of dollars. So are we going to integrate with what is there now? Is that the plan and it's approved by you? So I also heard that there's some temporary Bridge structure that has to come up during is that right? Because it seems awfully expensive. A Year's worth of use if there's the timing of the new bridge in the context of they need to get rid of the existing facility the old that old metal bridge that crossed have got to take that down a part of what they're doing to build the Waterfront of a temporary structure which they will you I think it's about a year and then this will be built to replace it. Is it a perfect solution know is it that is the only solution apparently we need to maintain your that's a major arterial next to her Marine Highway and it needs to maintain use for people to be able to cata route as well. So I would think that Marshall would look for a different way that this is probably the only way he can do the project. I can put up a temporary bridge that would go actually around 1 building and then reconnect minute to take that down and do it straight through I just thought that seemed like it seems like a lot of money for a short. Anytime the good news. Is there any replacement building here that will occur and I know that it's been a number of proposals a particular an 18-story Tower. They are looking at integrating the bridge into any new structure with I can't because I think it's a good thing that whoever that is a score that the initial request was to go up to 240 feet. And I just said absolutely not that we've been doing step Downs step-downs is what we're trying to accomplish and then there was well. We have by right to go to 185 feet if it's residential than they change their mind and want to go commercial. They still wanted to go up 285 feet is not going to happen. Now, we really are looking for as much residential as possible down there and if commercial is what is chosen and they may have that by right. We just have to make sure that it goes to a hundred and seventy-five feet and that we stay strong on that. It's okay Southpark Pump Station and then we're going to do the head. So the South Park song Pump Station initially we came to us in 2017 and they were actually asking it as a response for the consent decree in the Amish Waterway for spu. They were originally asked him for a vacation on that 7th Avenue South that was actually dropped during the meeting for that abetting property owner so that they brought in a redesign a refresh that was actually very encouraging it was part of it came out of the new design and Innovation lab that actually participated in one of their conversations earlier on last year. It's been developed with with how we we deliver these types of infrastructure and Investments That Urban Design play the real role in it. We seen that Trends across the board I'd say in a lot of the different city departments and that's really encouraging and Participate in this conversation has been great. So we think the results of what has come out of this project of bringing actual place making water view access and though the facility itself has it had a very public presence as well. Thank you. Think of this as something more than a pump station and the work that's been led by director has been great and valued by the community. I think we're actually going to be breaking ground. This year has been a bit of a head spinning project for the community because of the the many changes in the delays and I don't say so for purposes of really don't want that. But have you done any integration with the conveyance project which is also supposed to be located nearby. A little bit delayed. I think they think they they recognize that this needed to happen before anything else. They're not putting it aside completely. They just needed to have some way to pump excess water won't be our ideal integrated development approach, but we're working with what we got so we can get things moving for good news is leadership in elevating Urban Design. They're looking at how do you institutionalize Urban Design incrementally? How will this fit in with the next one in the next one if he's been doing? Finally for 2019. We're going to be completing our review of not only the mod like LED project that I mention that we're also going to be looking at Portage Bay and the Delmar lid. It's a big deal, but it's an important lifts for that community and it's a unique opportunity to create place from where freeway was through and frankly. It's also a very quick shout-out to wash the matically elevated Urban Design Within the city is a key project goal. It's new territory for them and we would very much appreciate their willing to commit to it. It's been shrinking over the years shrink was because they could have lit it over the entire segment, but that would have required venting stacks and sewing to inventing Stacks with and so was it better to get rid of that as opposed to having denting Stacks with machinery and mechanical error noise. I think that was the trade-off and we're trying to make sure the vet trade-off is in the city's interest. We have a number of parks projects their land bank sites. Would you all may be familiar with that are coming our way. We're completing our review of Seattle Center Arena in on April 18th. We're going to continue to work with Sound Transit 3 to figure out where the design commission integrates into their process. And you saw my shout out about the 50th anniversary. with that any further questions You don't look old enough to have been a 50 years. It just feels are we starting I just really appreciate the work you're doing and you know, when you all talk about having a bit of a breather this year, but that's only in comparison to like the marathon's that you've been running in previous years. I imagine if you look back over the history, it's still a really busy year. It's just not as busy as the previous year. I've been with the commission for 6 years the first four years there were for me. They were 8:30 to 4:30 all day and there were some committee meetings a couple of times a week. So I had a little bit of a breather the end of the work you all do and the thoughts unless you bring your projects, you know, I definitely do not sit through all those meetings but the conversations I get to have and the outcomes Lucina project. So this is amazing and so just so grateful for the volunteers that are clearly so dedicated to the public realm and what we're doing is a city to show up and I'm grateful that we create a space for that expertise to actually influence projects less. Thank you. Thank you Biana. I see you guys every Thursday morning or whenever you meet your all downstairs because all time at least I think that's what you're doing.", "end_time": 6394.1}]}