{"format": "raw", "annotations": [], "confidence": 0.9566721831553081, "data": [{"start_time": 0, "text": "Good morning. Today is Wednesday May 8th 2019. It is 9:01 a.m. This is a special meeting of the gender Equity safe communities near Gonzales and I am the chair of this committee expect that other council members will be joining me throughout the morning. There are three items on today's agenda. We had to significantly shortened it given that the amount of interest that we expect in both of the two first items. And of course that is not to neglect our third item, which is about Paid Family Leave. The first item will be to consider and take a vote on Ordnance one 19509 which relates to the mobile Integrated Health pilot program by the Seattle Fire Department, and the second item will be a briefing and discussion from a variety of departments including the Seattle Police Department Department of neighborhood Seattle Public Utilities and the Seattle Department of Transportation regarding the Recently announced emphasis patrols program in seven different neighborhoods throughout the city last week. We will get a briefing an overview of Washington Paid Family and Medical Leave program from the Washington State Employee Security Department, very excited about hosting the folks from Washington State and committee today to talk to us about the implementation plans for the brand new Paid Family Medical Leave program. Many employees should have noticed that there at receiving pay deductions in her payroll checks starting January 1st, 2019 and beginning January 1st, 2020 people will be able to begin the process of making claims with the state for purposes of receiving this wonderful benefit. So I'm very excited about hearing more about that given that we are a major employers are in the entire State and employ the most number of employees across the state. This is particularly relevant to our Workforce here in the city of Seattle regardless of whether these workers live here or not. So Will a very excited about hearing from the state on that particular topic as well. I'd like to welcome kills more bad shots to give me thank you again our agenda. So as usual we will begin with public comment. So each individual have up to two minutes to provide us with our public testimony we have 23 individuals signed up for public comment at 2 minutes each. So the names of three individuals. So for those of you haven't been here, you'll hear your name called both of these microphones work up here. So as you hear your name called in order to reduce the amount of time that we take for shuffling I would ask that as you hear your name called you come up to one of the two microphones and begin the process of queuing up at that point. Once or two minutes starts. You can provide us your name just to remind us who you are. If you have an affiliation, we'd be happy to know that as well and then we would request that you speak to an item on today's agenda. So there's only three items and then at the end of your two minutes, if you're still going I will ask you to please wrap up and if you don't wrap up then will unfortunately I have to nudge you a little bit more strongly to How to end your comments unfortunately public testimony is not the most natural way to engage with each other it but it is designed to provide at members of the Public Public an opportunity to tell us members of the committee at what they think about some of the issues we're going to be discussing or taking an action on now or in the near future. So we certainly welcome all of you who are here and we look forward to having a really productive breathing and a Committee hearing and we really do take seriously all of the public testimony that is provided to us during this this. Of time. So really really grateful that we have a full house today and really excited about hearing people's thoughts about the various items on the agenda. So once again, I don't mean to be rude if I asked you to please your comments at the end of the two minutes, it's simply for purposes of efficiency and making sure that everybody who signed out has an opportunity to also share two minutes of their thoughts with us and you'll see there's timers. All throughout on the front of Chambers here that give you a good indication of where you're at. So with that being said, I will go ahead and begin the process of calling out people's names again. You'll have two minutes and we ask that you start by saying your name and then providing us your testimony on an item on the agenda. The first three individuals who have signed up or Karen Gillan followed by Heather Kearney, and then we will hear from Martin Cortez. Aunt Karen Gillan so this is what the best yet and I'm a resident of downtown Seattle. I'm testifying in response to your letter to the mayor on the increased emphasis Patrol strategy. I believe the questions that you've asked the mayor are a waste of time and the wrong questions and they're going to take. Her office time and the police department's time to answer which is a waste of our limited resources in the city. I believe it's the implication of the questions are that enforcing our laws require special justification, or that are police department does not know how to do their jobs. The question you should be asking rather is how can we expand expand this approach to additional problem spots in the city and extend the time. In which we do this emphasis is always better when we have more police more people on the streets to keep things in check at Vitamin actually stops them. next things from happening that happened now, so not really is the truth question I would Ask that you please attempt to put yourself in the shoes of the vast majority of your constituents who are fed up with feeling unsafe on our streets even during the middle of the day or walking through one of our parts and running into all kinds of unsavory things happening. Thank you. Thank you, Karen. Our next individual is Heather followed by Martin Cortes. And then Jean believe it either Burns or Burris Burris. Hi, honey, I'm sorry if you just lower it just a little bit. There you go Johnny and I'm a resident in Georgetown and I am actually on the board of the Georgetown Community Council. I'm kind of representing our neighborhood since I actually had this week off and we don't have a paid and representative. But I just wanted to share that. We saw the letter that council member. I'm going to leave his bed and I wanted to let you know that I actually really appreciate the questions that were asked. I think that that's good to know with the background is I do want to let you know that the concerns of the community. I want to make sure that that's heard too. So we have seen the positive effects already at the emphasis control myself. I walk my dog everyday several times a day. I drive I'm downtown all the time. I work downtown and I've seen the Homeless Action homeless encampment recently cleaned up that I never thought would be cleaned up, but I want to make sure that the new element that's being introduced into our neighborhood is understood which is in county is bringing in a relocating a sobering center. That's currently downtown in the South Lake Union. So I just want to make sure that that with the police and possess that that will continue at least in our neighborhood to make sure that they are prepared to handle. We've any additional need that neighborhood. We've spoken to the King County to Leo for it as we talked to people at the sobering center. We've requested 9 when when transcripts and we've discovered that there's a over 200 extra calls just from that area. So we just want to make sure for small of little George Town with no resources. Nothing really there an amazing restaurants and bars will that sobering center be able to with a police able to handle additional cost for the sobering center? And so I just want to make sure that we do appreciate this week. I'm exercising the right way, but please don't lose focus that our neighborhood is one of the higher crimes per resident City when you look at the sky by neighborhood. Thank you. Heather so much is Martin Cortez followed by Gene and then we will hear from Karen Silliman. Hello, good morning. Thank you. Can you hear me? All right, thank you very much. Just a little bit about myself when I was born and raised on the inner inner city of Chicago. And one thing is that growing up we were taught to be when it is. We just learned to be really afraid of police and them in our neighborhood had living in Georgetown now and reading the news last week for the first time. I felt really happy that there's more police in my neighborhood and I'm really grateful to the mayor and the police chief for doing this just interesting how that came full circle. So thank you for the letter. I like the question about how to how do we measure success at the end? What's what are the metrics if I could add to the letter I might say, what about the sobering center that Heather mentioned? What about that? Yes, we only got one month of additional support if his sovereignty Center, that's 200 plus additional police 9-1-1 calls until our tiny neighborhood. They're going to outnumber the 1700 people coming in and out and only 1,500 people in Georgetown. So we're going to be outnumbered me help you help to prevent the sobering center, but I think the the patrols are good for step. And again, thank you for for hosting this for a long table, and for forgiving me I feel hurt. So, thank you. Thank you Martin. We will now hear from Gene and then Karen and then Harvick Allison or Harvey ice. Probably Harvey. Oh, hi. Thanks. Thanks. Thanks for hosting us and giving us some time to speak about this. My name is Jean Burris. I'm a resident downtown in the pike-pine 3rd Avenue area and just want to express a lot of support for this Initiative for the special emphasis. I only question is why this has to be a special emphasis and not an everyday all the time kind of thing for a long time and we've kind of been expected to accept as a fact of life in our neighborhood that that our neighborhood is an open-air drug market and a Haven for illegal drug use and all of the violent crime that comes along with the activities around an open-air drug market for too long. We've been asked to accept as a fact of life that our neighborhood is an open-air sewer and that we get to know when we're close to home by the smell of the urine and stepping over feces and we've been asked to accept that our neighborhood of the fact of life in our neighborhood. Is that our homes and our cars and our bicycles and our property are Not worthy of protection. So if this is signaling a change to that attitude and that that that we don't have no longer have to accept that as a fact of life. I'm fully in support of it. Then I just want express my support for this and hope that it's an ongoing thing. Not just a special emphasis. Thank you. Thank you so much and Lou hi. My name is Karen my list all over the world. I lived on the East Coast New York and DC and I never saw a place so sad like this place and besides the sadness. I figured out that I'm in danger just recently I had spinal surgery and I was really not in the best stage of my life and I was circled by somebody and somebody try to get money from me and didn't let me go it was broad daylight and dumb people couldn't help me out, of course. So I think this initiative is really very important because Seattle is a very nice place and I I think it look at When you don't do anything, thank you. Tell me where you live in the city. Write a tight market and I love it. Thank you so much. All right. Next we will hear from Harvey Allison then Lube on and then Chelsea Nelson. My name is Harvey Allison. I live downtown. I support the mayor's initiative to reduce crime. Women protected minorities and the poor are everywhere and always disproportionately victims of crime. Any and every part of Seattle City government that prevents crime enforcement intentionally targets women protected minorities and it's for this has to stop. Thank you. Thank you, sir. Will now hear from Lube on then Chelsea Nelson & Ally I can't make out your last name. What is it from Bari? Thank you. Ok, and on the property manager of the Melbourne Tower right on the northwest corner of 3rd and Pike been there for 32 years. I'm also here to speak regarding the special emphasis that the mayor and chief best to have submitted. I'm all in favor of it seems like every summer about tourist time. That's when the city actually brings more special at. This is more police on the streets. It does seem to help. I agree with an earlier comment. I'm not sure why this has to be only a seasonal type of an attitude adjustment. I think we need them on a regular basis. My Lobby attendants are dealing with feces and urine and needles every single day councilmember bagshot. We walk the alley with you one day and we really appreciate you coming out and seeing it firsthand with us. It it's it's just not acceptable this kind of Negative bad behavior Walgreens is our retailer. They're losing thousands of dollars a week in stolen merchandise. That's then paddled on the sidewalk the very sidewalk for pennies on the dollar that's with them paying for thousands and thousands and thousands of dollars of the security for their stores in areas. So we have got to stop that. I am for the city council on all of you to do everything in your power that we are going to say no to negative behavior that we're going to enforce our existing laws. That we're going to help those that can't help themselves and it doesn't mean helping them with a needle exchange or some other kind of program of letting them live on our side watching our public spaces. That's not acceptable. That's not helping them. We've got to do more. So I implore you to do all that you can to work collaboratively with this the mayor with cheap Fastenal agencies to be able to solve these problems. Thank you so much. Thank you, though. We will not hear from Chelsea. I tell see and then I'll lie and then Mike Stewart Downtown Seattle association association. We have more than 2,000 members corporate members small business members service providers in residence along with others people who want to live work and play downtown and all throughout Seattle and DSA we believe and we we strongly believe that Seattle is a great place. And we have some serious concerns and some issues that we need to work on together. And we think that Public Safety throughout the city as one of those issues that we need to work together. And so we strongly support the emphasis Patrol Emery in this effort. We think that this can help it can help it can help. What's our people just want to do what they do. They just want to work they want to get there safely. They wanted to take their kids to the park and this could help us do that feel more safe. And so we are fully behind the mayor in this effort. Thank you. We will now hear from Molly Stewart and then she brindle good morning. Thank you for putting this program together. I'm here to stand with the mayor and the emphasizing Morrow police officer. Do you need it to his season and hopefully Beyond I measure every person's character by what they do for their Community. That's why I can stand here because I've been doing this since 1985 doing the business from Capitol Hill to downtown in Pioneer Square and I'm not planning to leave you want to be part of the solution, but one of the problem I have today last year. I have to call my bank here twice to defer my principal on the loan that I took to create this beautiful space for all of you and my community to come and relax and enjoy the community and love that makes Community meaningful and I shouldn't be doing that. And another thing is beside doing that. I feel that One of the biggest challenges I have today are usually could handle all the problem around my store, but these days is not possible. I have to call 911 and get someone to take care of people that they call me my store at the end of the day if I have kids in my house, that is a problem. I get out of the house or happy Community is happy family or Community is not happy. You going to do our best be going to be part of the solution be going to help you guys, and I want to thank you for what you do, and hopefully we can get something done. Thank you. Thank u l e I will not hear from Mike Stewart and then Mike will be followed by Maddie and then Michael Troyer December Gonzalez and committee members up for the opportunity to speak today. My name is Mike Stewart. I'm executive director of the Ballard Alliance. We are an organization that represents more than 500 businesses and thousands of residents in Ballard the line strongly supports mayor. Durkan and Cheese Fest increase emphasis Patrols in neighborhoods across the city including Ballard. This is a much-needed first step to begin addressing the criminal activity that is experienced by business owners and residents to like, he's very challenging environment right now to own and operate a business. We didn't see this three or four years ago with this step and additional attention in the future. We hope the businesses will I have to worry less about safety for themselves safety for their customers and safety for their employees were just committed to support the emphasis. Program further I encouraged this committee committee to start examining ways to find a more sustained police presents for our neighborhoods and make good on the promise of more police officers, which was funded by the city council in 2016 through an increase to the city B&O tax and the business license tax certificate fee. Thank you. Maddie followed by Michael Shroyer and then Lauren Ross. Good morning. Good morning. Thank U City Council for allowing us to make ourselves heard this morning. I first want to say that I fully endorse the marriage proposal her increased emphasis patrols to do something about crime in our neighborhoods. The enabling stance take him to date by the city. Council City attorney in King County Prosecutors has certainly done nothing to deter let alone rehabilitate the drug and alcohol addicted offenders who are fueling the crime surge in our communities and it certainly has done nothing to reward the hard-working law-abiding taxpayers who are footing the bill and who vote you into and in fact out of office and do pay your salaries. The city council and the mayor are they elected governing body of this city for God's sake start governing. It is necessary is necessary to effect changes in laws and regulations to empower law enforcement and to get criminals off our streets once and for all send get on with it. That is your job and bear in mind that while activism is commendable when Common Sense supplied it is no way to govern a major city. And finally, please stop insulting our intelligence with your tortured statistics on crime. We all know the statistics game we live here and we see what is happening with her very own eyes. And please let us not hear one more time. We can do better. We know you can do better. The question is will you do better and if you want we're on the cusp of the golden opportunity to look for people who will do better. Thank you. Thank you. Our next public commentary is Michael Troyer followed by Lauren Ross. And then Dave, I believe it's cuthill. Please thank you. Thank you. My name is Michael Troyer and thank you for the time to give some testimony to the emphasis patrols that are proposed. I'm by the mayor Ivan Sierra with the Rainier club for 37 years and been part of the downtown core for more than 40 in my public comment to the council is something must be done now about enforcing the law on our city and prosecute those that break the law. So as you consider the gender equity in the safe communities agenda today urged you to support the mayor's approach to employ these resources as other commenters of the day. It does make a difference and annually, it would be it would be so helpful to have that continue people working downtown to no longer wait for the council to take decisive action to eliminate the crime that occurs without consequence because our city laws around them forced. So I represent a number of my constituents who live downtown some of them here today. And that's truly the big difference business has had to deal with a variety of things over the years but this is unprecedented and I remember walking down from o'dea high school wondering what that building was that I was going to work in for the rest of my life standing in front of Zales, which now has more crime there then when there was a jewelry store and so with this theft and shoplifting and fencing drug-dealing he's people with addiction and mental illness need something more than just being ignored. So I'm as I represent my constituents downtown. Amber voters we want to help resolve this and we really urge you to continue support rule of law and thank you for the opportunity to comment. Thank you so much. Mr. Mister Troyer. We will not hear from Lauren Ross followed by Dave cuthill and then Greg Smith morning off at the SoDo business Improvement area and I'm here today in support of marriage or kids free summer emphasis program to deploy additional resources to improve Public Safety and many neighborhoods, including soda and soda are businesses employees visitors are dealing with constant criminal activity has are getting broken into multiple times a week off and buy the same offender and others are having a thousands of dollars in repairs to the vandalism and property damage. We have businesses leaving Soto not because they're closing shop, but we need help in the census program is a necessary first step to provide some measure of relief for Crime Victims and neighborhoods like soda that have seen drastic increases in criminal activity. Thank you. Thank you Lauren. And then just before we proceed wanted to acknowledge that we've been joined by some additional council member. So I want to acknowledge council members herbold Pacheco and council president Carol who is an joined us at the table this morning actually been sitting here for at least 10 or 15 minutes. So I apologize for not recognizing that you joined us at the table. So thank you for being here this morning. We will go ahead and now and begin with proceed with Dave and then we will hear from Greg Smith and then Jill Donnelly. Good morning has properties and for those of you don't know place place has been in downtown Seattle for over a hundred thirty years and is part of the fabric of this city. We're here primarily today to address Security in crime issues. We've had numerous incidents in our buildings that have caused us to reinvest hundreds and thousands of dollars in security measures to protect our tenants and our customers. So we support the marriage proposal for emphasis Patrols in the 7-Day neighborhoods that have been identified. We support the younger we would support ongoing emphasis Patrols in the entire city matters of crime prevention Public Safety and public health are Paramount concern pieces, like system failure by Scott Lindsey clearly identify acute issues that should spur all of you into action. Not a conversation not a task force not a deflection with a description of systemic issues. But rather we can no longer sit on the sidelines and allow this to happen and evolve our fine City into further just met again. This is a call for action and we and we support the emphasis Patrols in the entire city. Thank you. We will now hear from Greg then Jill Donnelly and Wendy Norman. Hi, my name is Craig Smith. And I'm CEO of urban Visions It's Real Estate Company downtown Seattle. We own property in Pioneer Square. And then the pike-pine corridor. I'm a resident in downtown Seattle have been for the last 15 years. I'm a partner with Ali Ghan Buri and Cherry Street Coffee small business as well as artists on a good arts. And I have to say I'm very supportive of the mayor's plan doesn't go far enough as resident as employees are our employees are are Taurus should not feel unsafe. Our children should not feel unsafe women should not be concerned about getting thrown off bridges in the city that idea idea that were Considering not doing more police right now is just blows my mind this it's a problem that spread throughout the city of Seattle. Not just downtown Ballard Georgetown Capitol Hill and we have a serious problem going on here. We is community can address the homelessness issue. This is not and homelessness problem. We're dealing with right now. It's crime and drugs and drug addicts and that's what we need to focus on and so I hope that you'll support them are in this place ever. Thanks by Wendy Norman and then Jeff. Dow Good morning. My name is Jill Donnelly and I've been before this panel several times. I started my first time in 2010 2014 when there was a crack problem. I have a store which is been in the downtown Corridor of since 1976 on the corner of 1st and Virginia. How is this for a PR headline for one of the most promising cities in the country and maybe the world all eyes are on us instead of the Emerald City Seattle is dying that anyone if your panelist can sit there and be proud that this label has been attached to our city because in the inept attitude of our Council of our governance of to manage a problem that has been scaling out of control for a decade. This is not knew we had opportunities to do something about this 10 years ago. And now we're just looking and we're paying our hopes on a 30-day program to help us put shine light on something that should have been amended and dealt with this is a stomach problem not just in Seattle, but every city and I just can't understand each one of you and this mayor I've been through three police Chiefs. I've been dat hanging my hopes on now this for mayor to do something to stop this to take that creative effort that is made Seattle one of the most spectacular cities in this country a leader and doing something about mental illness about drug addiction and about the stomach crime that comes from that. We hope that the 30-day program at least open our eyes and just start a dialogue. Thank you. Thank you. Next up is Wendy Norman followed by Jeff gow and then we will hear from Rob Nichols. Good morning. Good morning. My name is Wendy Norman and I have lived and worked and played and shopped around Seattle my entire life. I'm in Northwest Native. I currently live at 4th. And Union in Seattle is just a seasonal emphasis. If I feel like as a resident a taxpayer would be nice to see those efforts more representing myself and not just for us over a time of year where we know the city is obviously busier. I wanted to come this morning because I wanted to ask you to allow us to be part of programs and this conversation to continue potentially not in this for him. But in other forms where we are allowed to be part of the solution, I think it's wonderful to see that the safety concerns. The concerns are on crime or going to be addressed the we want to be a part of it and we want to be part of the solution and as a representative, I'm asking you to come up with the ideas with the programs that we can support. So when I invite friends to come visit me, they don't say to me. Will it be safe? Where should I park? Where will I be safe? Every June. I have a luncheon for friends of mine. And three of them to said they're not coming because they're concerned about safety and Seattle. That's a sad statement and we all know about the crime, but I wanted to ask you today is let us be a part of it the seasonal emphasis again, I fully support I think it's a wonderful program. What are the other programs that we can support and be part of care? Seattle, thank you. Thank you. Wendy. Next up is a Jeff fell by Rob Nichols and then Natalie Viner. My name is Jeff a resident of Seattle in the spirit of being brief. I just want to Echo everyone else that is already said before me the points that I think need to be reiterated to the council. It's time for action. . Thank you. You are really true to your word about being free star. Jasmine Rob Nichols. I represent the state hotel in the general manager there the newly-opened stay hotel. And then Paris restaurant right there at the corner of 2nd and Pike room hotel and building that for most people know it's been vacant for the better part of 37 years has committed over 40 + million dollars renovating this at this place building and bring new life to this wonderful neighborhood. I've been in the hospitality business for over Seventeen years across several cities in other states. I'm new to Seattle for a little over 3 years now, but I'll tell you what, I'm in the short time that I've been here and cities I've worked in. I've never seen Prime the way I do outside our front doors weather is Time or whether it's night time doesn't matter. It's right there. We see it. We are concerned and that's why we applaud the efforts of the focused police presence in the city as well. As you know, the whole thing that this is an ongoing. I'm solution to the problem. I'm here representing our investors Columbia Hospitality for president 24 cities here in Seattle, and we hope that this is again not the end of it but only the beginning of solving the problem once and for all thank you. Thank you, Rob. And the next step is Natalia. I'm sorry. I was saying Natalie, but it's Natalia followed by Don Ayres. And then Jenny Google check. I want to thank Jennifer actually giving me the phonetic way to pronounce her last name. That's really helpful, please thank you Loreena. My name is Natalia by nowicki. I own a business in Belltown. I own my business for 7 years and I came here from Phoenix Arizona and I'm very proud to be a satellite and a business owner and a resident here in Seattle. I've seen a lot of changes in those seven years and I no longer feel safe in my neighborhood. I rely on tourism. I have to keep my business driving as well as local business. My customers have stated many times that they prefer me to go to their house and pick up their clothing. I own a consignment store rather than come downtown. A lot of we see a lot of families coming through they come from Pike's Place Market and go down 1st Avenue and there are countless heroin needles that I found I save pictures on my phone right outside of our neighborhood. I pull out of my garage in the evening and people are shooting up outside of my garage several times have called the police. It feels like they're unable to do anything. We pay so much money not only as tax paper pairs as residents, but also as business owners myself and some of the business owners around me. We all feel that are taxpaying dollars should provide security of police and Public Safety and clean streets and that laws in this city should be enforced. So I'm here in support of both initiatives. In the words of all of the people that have spoken so far. This shouldn't be temporary. This should be permanent until this problem is resolved. This is a beautiful city and people come from all over the world to come and visit us and they should not have to feel unsafe. They should not have to step over feces. They should not have to find heroin needles and explain to their children. We need to stay away from this area. This is shameful and I'm urging you to support both initiatives and take the emphasis out and make it permanent and Empower our police to actually get crime off the street sinking Italia. Thanks. Thank you so much is maxed. Donald be followed by Jenny and then David Haynes initiative, but I have a few comments. I am the property manager at American life. We have some 60 Acres here in Soto some 200 tenants and we are all being impacted Zeiss. Everybody else has a discuss this morning by same issues. We are Community Partners with Seattle we serve on the SPD board and keyboard on a founding member of DeSoto Bia where philanthropic to those organizations. So we partner with you and the city and in every way that we possibly can but I want to tell you we're being overrun. I think you know that and it's a hard job. It's a community. It's a societal problem and not just yours not just ours and so we recognize that one of the things that you need to know. What is the city has been very impactful both economically and in for the well-being and safety of our tenants and their guests number one, we spend several hundreds of thousands of dollars and security measures hired emphasis patrols. We work SF D at the Bia to provide visual deterrence. We are still being overrun and despite our efforts. So one of the things is that we obviously know that we need to do something. I know that you need to do something and we want to be Community Partners in that respect and we strongly supports and there's an issue but we need to go further if I may say we've been playing defense for a long time. It's now time to go on offense. We need to strongly support the laws that are in a divorce and stop the criminal behavior and get the criminals off the street. Once that's done. I think we can then begin to work with the people that are there by chance were compassion. We have compassion for them, but we need to figure out a way To separate the two somewhere and we strongly support the initiative. We need to go a little farther and for you to adopt the policy the mayor and thank you for being with us this morning. And then I would just want to acknowledge that we have now been joined by Dido Thank you for being with us this morning. And then we will go ahead and proceed with Jenny and then we will hear from David James and then Brittany Bell a very close and I hope my fanatic helped you there today representing the 800 businesses are district and help construct the prolific offenders report on their behalf. I want to think many of our stakeholders were here today and support of the mares emphasis to a very diverse group of stakeholders retails restaurant startup Sports bands in art galleries Human Services. In fact, we have one of the highest concentration of Human Services in the states. Where's want to be safe? Whether it's getting into their office in the morning serving guess strolling through one of our Parks or public spaces or standing in line for a shelter. But we look to you to help find solutions to keep everyone safe and create an environment where people are not victimized as they go about their daily business. We appreciate the mayor's office moving forward with the plan for a neighborhood emphasis and ask that you work together to solve some of the very real very challenging issues. We face as a city today. Thank you. Thank you, Jenny David Haynes this next followed by Britney boy. Most of the crime increases are from drug Pusher exemptions. And if you notice the police department doesn't list drug pushers as a crime. The mayor when she was the Attorney General sabotage the Integrity of police reform by slipping a sentence into the 2012 reform that Exempted drug Pusher Seattle is a societal implosion a wicked corrosion to Real by liberal policies that exist low-level drug pushers destroying lives daily while cops are getting rich Moonlighting as security guards protecting bartenders over-serving drunk driving home while Cops show up to their real job too. Tired to fight crime emphasis patrols are designed to show force and falsely assure law-abiding citizens there safe cuz cops are around. get cops are tasked with coffee Outreach hanging out at Starbucks for a hour has resulted in corrupt leaders at the police department creating more excuses for money with another ridiculous request by cops for another new police station as if that will improve the response time when the real problem is the cops refused to even bother responding to low-level drug pushers who are destroying people's lives daily work in the street and controlling everything Seattle's affirmative action and fractions are evident in the police leadership at the Department the trip progress and implode Society over the last seven years starting with I hate to say it black cops are hired specifically to patrol black communities and then they rotate out of that Division and start conducting speed traps on the White Community driving through while the crack operations of Belltown implode. They act like they don't see it don't be deceived by a police department loaded with statistical distraction to justify the rich salaries when they hide the fact the root cause of Seattle's problem isn't the exemptions of crack meth and heroin low-level drug pushers and the Sex Chronicles David your time is that your time is up. Next speaker is Britney followed by Marguerite Richard. Good morning. Council member is my name is Brittany polay. I live in North Queen Anne and spend much of my time in Ballard and Fremont. My child goes to school and Ballard. I am here today to express my concern over the newly-announced emphasis patrols as an ounce of program is based not on actual crime increases beyond the fear of crime and increase policing appears to be intended to Target on house population are there is no question that we have a crisis in our city of people who need homes and they need the stability that provides. However Sorry, my phone turned off over 80% of an House people have already experienced or witnessed police harassment if he's interactions go beyond harassment and two citations are arrest people in already vulnerable situations can see their finances stretched thinner their job prospects for the reduced and her chances for finding housing in the future further in The Climb. Furthermore any interaction with the police does carry the risk of violence, but the risk is far higher for those who are homeless people of color and you're experiencing mental illness and increased police patrols actively make these people less safe. as far as I can tell what we're doing here is taking an undisclosed amount of public money, which could be used to house these people to get them into the programs with Airlines can actually change and find stability and directly use it to make the people in Seattle who already are the safest feel safer. I think everyone needs to feel safe including those who are on the streets not know it was thank you. Thank you, Britney. Speaker is Marguerite. And Margaery is the last person signed up for public testimony. So I will do a last call before we close out. I liked comment. He is good day. Everyone yet Public Safety is always a concern of mine first of all because I'm black. And I noticed that Sandra bland is back in the news again. So when you say safety, are you saying that the behavior of the words that I heard coming before me that other people have priorities over us? I don't even have to mention their name that always in the news either black person is getting killed or the police is getting killed and it's like none other I've ever seen in my lifetime and I thank God, you know that I don't have to fear any evil because he's with me and his rod and thy staff comfort me not you because when I come down here a black woman seems to always be denigrated. Is that a good term for the number of times that I've been throwing out just for free speech and I know it's free speech because God gave me my speech. You didn't tell me what to say. I don't get my instruction. You said I would instruct you and teach you in the way that you should go and it's going to be that from now on. And it always has been so anything outside of that. It's the perpetrator coming against us as a black community of people and disrupting everything even the good they calling evil good and good evil. And and I have a concern about that because the number times that I've come down here. It's like a repeated thing. So okay, if you know, I can't kill him like that cuz can kill him like that. So I'll just try to denigrate them make them look bad and if you don't do what they say when they call these folk on the walls up in here and then if you don't do what they say, then they give you a little pink slip, like when they gave your grade school when you acted up so it's something really wrong up in here. So that is the last person signed up on the sheets for public, Is there any In the audience who didn't have an opportunity to sign up who'd like to offer us and public testimony. Come on oppression. So a good morning so afraid this part of the public testimony, we do require that Folks at sign in so you don't have to do it right now or I will give your public testimony if you can again start with your name, so we know who you are and then immediately after you're done giving your public testimony. If you could just got your name down for us on the list so we can have that as part of the public record. That would greatly appreciate that. So, please thank you and good morning. I'm going to Taylor with the neighborhood safety Alliance of Seattle and I'm sitting here in the audience. I really wasn't going to say anything today. However, I'm listening to all these heartfelt comments and it makes me realize heartfelt versus the statistics that we're getting from the city. There's a mismatch going on here and we've been speaking the neighborhood safety Alliance of Seattle has spoken here over four and a half years and Crime & Safety is what we talked about and here we are again. We're still talking about it. And so Police emphasis all for it. Actually the neighborhood safety Alliance is in favor of any bold leadership that will put a stop to the crime and and give safety the feelings of safety to the community members all over Seattle the impact that's what I question if the statistics are telling us the crime is down 18% How is it that we're going to get statistics that we can believe from an emphasis and my question is is this lipstick on a pig. I'm in support of this don't hear me that I'm not I am but I'm wondering and emphasis during tourist season. Are we trying to make it look good? So we look good. That's what it feels like because we are doing the same thing over and over and over. We can't trust the statistics. That's just the bottom line the community all communities of Seattle need relief. We need to know that somebody is taking a leadership role and they've got her back cuz I don't know that I feel that way the alliance members don't feel that way my own Community doesn't feel that way. So do we support this? Yes we do. But we're looking for is that word transparency? We want statistics that are actually showing us the impact of what an emphasis would do and it's in fact, there's an impact. Let's do it again and again and keep it going. Thank you. Thank you. Okay, next percent, please. Join us start with your name. My name is Kurt Sorensen. I live in the University District. And I believe that the statistics for Crime have increased but I do not I believe it's far beyond what is reported in my neighborhood. The time is so ramp it if people stopped reporting at people stop making reports on it. It is a feeling that it is our own fault if we leave our bicycle on check for 5 minutes or drop our backpacks for a minute and turn around and it's gone the children actually feel like it's their own fault that they lost their backpack. It is heroin is the problem heroin. We allow heroin addicts live on our streets without intervention a heroin addict is sort of like saying to an eight-year-old. Do you need a babysitter an eight-year-old will tell you they do not need a babysitter, but they cannot sustain themselves a heroin addict cannot sustain himself. He needs intervention and Hell The crime will stop when they heroin goes away and we have allowed the decriminalization of heroin dealing in our streets, and this is a crime in itself. Thank you. Thank you Kurt next up and Kurt. Don't forget to sign that sheet. Don't forget to send that. She acquired a property in SoDo January 8th to take advantage of the opportunity Zone investment opportunities in Soto and since we've acquired the building, it's been eye-opening to see what's happening down there. We've had multiple break-ins a person cut a live service feed from the city of Seattle's power grid and steal copper out of the building significant Public Safety things occurring in the building this morning is we have several other properties under contract in the city and what I can tell you is folks who will help Soto State industrial redeveloped those building so that industrial businesses can stay Play in South Seattle the investors who will come to do that for the city, which should happen and can't happen right now specifically based on what's going on with opportunity Zone. It will not happen unless the perception is it safe and I can tell you for a fact I drive around with those folks all the time. The perception is it's not safe. This is not a good place to go place our Capital, which is really unfortunate for the city cuz there's a very unique opportunity right now for investors to change the functionally obsolete real estate and Soto into something that would be another generation long investment and keep the businesses that have been in soto-innes. So I would encourage you all. This is a great first step of the Bia funds the bulk of what really makes a difference there. The city should be in the front of the line trying to make a difference permanently. So I appreciate your time and thank you for the Thank you for being with us next up. Thank you Good morning Joe manager at the Hilton in Seattle and I know I'm not a popular guy because I represent business to a certain degree, but I'm also just a person and for the story is really about one of my employees that just happened to talk to you on Monday during lunch and she's one of those folks the interest groups that you are on the council at a picture but you know, very very wrong to abandon and rightfully so so she's a Chinese background is a member of the luxury hospitality and we can hang out and she has to take the light rail to work and she no longer that's that because she doesn't feel safe taking the light rail in the library itself. And then there's three blocks to the hotel from the Light Rail station either so they can start taking the bus. It was a direct deposit only took about half-an-hour. I thought it was supposed to three blocks away. So she didn't feel safe to do that either. So then she took a different. Best stats to get 2 hours to come to work and it was only a block from the hotel but you stop taking the bus to because she doesn't feel safe. So now it comes to buy card which cost him online and parks in day in the garage that's attached to the hotel because she feels safer in a parking garage that's on the screen what's scarier than a parking garage? Everybody hates parking garages? Yeah, but she feels safer in our parking garage stand on the street and just one block from the hotel. It's it's too much for her. So that's kind of a story that you know, our employees have to deal with it's not about no business is it is focusing on getting put in what police on there on the streets and I'm not the police guy myself, you know, but if it's necessary to to to Secure Public Safety and it needs to be done, it may need to be done permanently. What's the building site? I did this I didn't say anything and I I may have looked displeased. So he charges me for another kind of got in the middle of it so you can punch me but I would have been happy if you had touched me. It was somebody around that being a dangerous neighborhood, but it certainly feels that way. So do you think that you're doing it may be necessary to do the permit planting to increase our Public Safety, Nobody wants to do it, but I think we're at that stage. Okay, we have another person who is in a Q and A miserable. Please remember to sign the sheet. Please remember to sign the sheet. That's all right. Good morning. My name is the studio building and I'm a downtown business owner as well. But I think this one is really illustrative of a lot of what's been said here this morning. So, you know, we are as residents on the 3rd Avenue between Pike and pine where is unfortunately very used to the drug traffic and crime that's occurring and are very cognizant of that and needing to be a deal with that on a regular basis. However, this has started to come into our building in a new and different way recently that we've had things stolen out of our building as high as the 6th and 7th floor of our residents have now started finding a drug addict. Did people in our stairwells shooting up inside the building we are now having to train our facilities person and hazardous waste disposal because of the needles were finding in our stairwells. We're also having to upgrade our security system. So we're going to a video system having to install security cameras on this is already expenses on top of having to care for a landmark building and Zealand tax. So again, this is just kind of escalating the protection is being put more and more on us as opposed to the financial burden has been put more and more on us as opposed to the police force and prosecution system as it should be so Thank you, Julia. Okay. Oh and thanks for remembering the sign that she appreciate it. Is there anyone else who wanted to offer US public testimony before I go ahead and close out the public testimony. Okay, I am seeing no one is so we will go ahead and close out the. For public comment. And before I have the first agenda item into the record. I just wanted to give us a few remarks about the item that folks. I spoke to the most this morning and really just also express my thanks and gratitude to each of you for being here. I know that there's a lot more folks in the audience who are here listening with interest but didn't offer US public testimony and I just really want to thank you all for your interest in attending committee today and being with us and in just generally continuing to be engaged and wanting to be involved in in helping the city council identify Solutions in helping the entire city find solutions to addressing those livability and public safety concerns that Reasonable and legitimate within various neighborhoods across the city and it today I've been taking notes of everybody's a public comment and we have a strong contingent from downtown residents and business owners. We have some representatives from DeSoto neighborhood and and we had a few folks from Georgetown. Also joining us in Pioneer Square as well as well as some neighborhoods that are outside of the seven neighborhoods that have been designated for additional law enforcement resources in this pre summer anthesis that will occur over. Of 30 days. I just wanted to, things that I have heard our overwhelming number of people who are in the audience support the Add deployment of law enforcement Services the as described by the mayor's office and chief best last week. I also want to acknowledge that what I have heard from folks. Is that even though this might be at a good measure now that it is certainly perceived as a first step and there is strong interest in identifying long-term sustainable ways to to address the liberty and safety concerns that I know I I receive in my inbox and hear from community members as I move about the city and so I just want to acknowledge that that we hear those concerns and those comments not just in Chambers today, but I think as we move around the city council members and we want to I think work collaboratively not just with the executive branch, but also with a Community member Azure representatives to ensure that we can identify some solutions that will actually be again long-term Solutions effective measure show measurable success. Not just in the crime statistics spent in the feeling of being safe as you move around the city and as the chair of the Public Safety Committee at certainly my commitment to have those tough conversations and to really allow us as a safe and respectable environment and then you an opportunity to be able to stroll together as a community with some of the concerns that we heard today in public testimony, which certainly are reflective of some of the comments that I think a lot of us have been hearing over the Oh I several years. So I really want to again thank you all for joining us and for your interest and I hope that you will receive a letter that I sent and the opportunity to have a briefing here today as sort of in welcoming to the conversation and in the city council to have an opportunity for us to figure out what that collaborate collaboration looks like so that we can address many of the concerns that were expressed during public testimony this morning. And then before we go and read at the first item into the record, just wanted to see if my colleagues who sat through public testimony wanted to make any initial comments are reflections as to some of the testimony that we heard from folks and don't I know that folks might need to leave intense it through the entire briefings. I wanted to provide council members an opportunity to react to public testimony no pressure, but if you wish you may And I really want to recognize so many of you that came today and also acknowledge the fact that many are from downtown from Pioneer Square from Belltown. This is my district and I'm proud that most of you I have contacted and had conversations with the what I really want to reflect on this something. I heard a number if you say and that is it's time for Action. These conversations have been going on not just recently but for all the 10 years that I've been sitting at this Council table and I want to appreciate the community work Ali that you have done Greg the work that you have done here at downtown and then we can just go row by row and what DSA has done for us. I also want to recognize what we are all saying is that intersection of the need to invest more from Evernote mental health and Behavioral Health. Of course, we continue to strive to expand our shelters to 24/7 and more housing housing housing. We know that we need to do this. I might talk with Chief Scoggins this morning about some other options that we know to get people inside and get the Behavioral Health Services that they need, but I also want to say that I completely Concur and appreciate what the mayor is doing with having police action to arrest people who are damaging breaking in causing trouble for the community that that is something when when laws are broken we need to act and I think for too long that we have decided that there's some there's not a lot to be done if somebody goes to jail and then is released back on the street without a plan to actually help that person get better. That's a problem that we all recognized. But at the same time we can't shrug our shoulders and say all it's too bad because people just breaking in and we don't have a solution of that problem the person-centered approach to get somebody inside to get them the support and to say it is not okay to be breaking into cars to be breaking into businesses tool. Human feces on the businesses doorstep and residence in the morning that has got to stop. I have really appreciate and support where the mayor is going want to say. Thank you that this committee has been opened up today and we were able to hear from you. So please know that at least the last seven months that I'm going to be the district 7 representative. I'm happy to work with you. And as one of you had acknowledged saying you want to be part of the solution, I appreciate that very much and will be very much available and in your community to talk about what that looks like. And that raises a couple of other thoughts in my head one is that there was some testimony and I've received some correspondence about this in my email about the start of this this belief that as council members. We don't move around the city and and that we don't that we might not see some of the issues People are concerned about night and I really want to reiterate that as I as I council member who uses public transit and walking around the city around the downtown core. I see many of the things that people are talking about in public testimony here today. I catch a bus over on 3rd Avenue between Pike and Pine in front of the Walgreens. I walk across the bridge on on Marion after I get off the water taxi. I spend a lot of time in Pioneer Square. I've done walking tours in soda with a Bia. I've been a walking tour in Ballard with Ballard Alliance folks. I and I spend a lot of time in the U District as well. So I can appreciate the perspective of individuals who see the condition of neighborhoods a deteriorating and I can understand the frustration of not seen. Fast and expedient action to address those deteriorating circumstances. I myself live in a condo in the junction. I have woken up to a piles of syringes in and near the dumpster right in the alley next to my condo. So I am not immune from these situations just because I'm a council member and it's part and parcel of the reason why I felt it was important to send the letter because I want to make sure that whatever it is we're doing is sustainable long-term action and that we are actually going to see a measurable positive impact as a result of limited police resources that we have in this area of Public Safety and increasing livability for neighborhood, so that that is my motivation for wanting to keep up this conversation and looking forward to Leading us not just in conversation, but hopefully in action has no purple. Thank you so much. I'm a strong supporter of using law enforcement visibility tactics to deter crime and do proactive please sing. I've been working to try to get more police resources for my neighborhood in the neighborhood in my district most in need South Park from 2006 working to get bike patrols to a Mobile police precinct down in South Park to working with council member Gonzalez on a public safety plan with the community and then funding and implementing it over the last several years. I think really doing some game-changing work for it for that Community. But again visibility as it relates to our officers being seen this is a really welcome addition. I also want to make note that I have been working with the CIA directors who have Commissioned the system's failure report to bring them into these council chambers together with some of my colleagues on the council who have agreed to participate and hear from them a presentation on on that report. And I'm going to be really eager to see how the efforts of the executive will align with the problems that were identified in that report. Just some high-level points from the report over a year's time the hundred offenders in the report were charged with a total of 3500 criminal offenses 1600 misdemeanor cases and and they were responsible for 636 total bookings into King County Jail that's evidence that law enforcement. Is taking action as it relates to this population. It's a lot of the issues that we have to deal with his what happens after I learned yesterday that since that report was issued in February nearly 80% of the population has been arrested again. So I think that's really important for us to consider as we figure out how to respond to these issues because again, as it relates to this particular population of people the problem isn't simply that law enforcement isn't taking action 100% of that population is homeless and 40% of them have severe mental health conditions in 41% of the bookings were for non-compliance not for a new crime meaning they didn't show up to court and just overall this particular population of side 45% of total annual bookings according to a 2017 King County Jail. Health Services report are people that are homeless. So this is a really multifaceted issue that we really I think it's important to have all the staplers at the table. I'm really excited to look at what some some the other jurisdiction King County is doing as it relates to their familiar faces program and staying with that sort of things that we can replicate that are there. Any other councillors would like to give some reactionary reflective reflective English is sometimes extraordinary really hard for me reflective comments about public testimony before we dig into the Items of business. I know you're busy folks. I think I heard from a few of my colleagues. They're shared. I also discussed their share share concern for the same issues that you're having a deal with I almost take personal offense to the fact that people don't assume we feel the same way. It's up to having a wife and a daughter and grandchildren and playing parks and sing syringes. My Approach has been in Spanish. I think some of my colleagues share it is the first Vault figure out what best strategy you working in this country. I got a unique to Seattle and I don't know if anyone realize that they don't hear that part of the conversation that there is I think I create a new subclass of poverty and people that are slipping into the cracks of both crime and poverty and so there is one book. I read it called when Brute Force Tales written by a professor at Harvard train Professor mark kleiman And what he talked about are some of the best strategies in this country that works and in the last several years we've been trying to do that and I'm not going to get up here and tell you all of the great things we're doing because it will not change any of your perceptions but I will say that we have some pretty committed council members and Executives that have really dug deep on this issue. It is a huge issue and while we are a large Target because we are the policy leaders of the Seattle. I did not hear one of you advance a new strategy or a new policy or new law change what I'm hearing you saying is enforce the laws. Quite candidly that's on the other side of the house that's on the executive side. And so this proposal and I don't think you've I think I heard one person testify that we are trying to get in in the way of The Proposal councilmember Gonzalez's share Publix 8 to ask him very intelligent questions that the simplest questions will this work will this change anything? How are we to measure its success and I'm very pleased at the conversation and I'm glad to see such an engagement to hear from all of you. I went to a soda meeting. I think it's few months ago. And I think that was a meeting where we were just supposed to prove too many of you that are living with this problem every single day and explained to all the great work we're doing I didn't say a lot because I'm not going to do that. I will say that again. This is one of many conversations and you have to have these conversations. And so we begin here. We haven't we didn't just watch it until we begin and we've been having this conversation and we will continue to have these conversations, but the problem is very huge and I have to tell folks I travel I talk to other councillors. I talk to other Mayors across the city grappling with the same issues. We are in this together. I look forward to this discussion under my colleagues under-counter Gonzalez's leadership in my colleagues cooperation and with the executive and last I want to say that I would have I would defend both are Chase of Public Safety. Both are fire chief in our police chief are some of the best in the country and the men and women who serve in those groups are some of the best in the country and so as we move forward this denigration of city employees on looking at this approach. I don't think there's a lot of room for that. Can we do better? Of course, can we be more effective of course, but that's why we had these kinds of conversation this baseless the sum of the spaces denigration. I don't think that moves us along we sign up for it by the way, so I don't take any of that stuff personally are the job we sign up for but again, we are looking at Best Practices best strategies what works in other cities in the context of many cities are doing with the same issue. So thank you for being here and look forward to this discussion. Bank accounts president Council Public Health, there's a Public Health crisis in our community and Public Health crisis to the individuals who are sleeping outside his bill traumatic and bad for the health of individuals to be sleeping outside. Just as much as it is a Public Health crisis, for those of us who are living on some consequences of people and sheltered in our communities in our Parks when they're having to use the bathroom outside. That is a Public Health crisis and its definition the Public Health Board and brought up conversations around treating homelessness in the lack of affordable housing as a Public Health crisis, and it's a Public Health crisis to the health of and the psyche of this community when we see everyday either walking with our kids to school or coming in on the bus to work or going to the senior center when we see people who are outside living unsheltered. It is a crisis of Consciousness and a crisis to our health of Arc. But I think the solution is to look at the data and driven Solutions. I want to reinforce a starchy fast has said to us time and time again. It is not a crime to be homeless as many as individuals that are experiencing crises in our street and heart creating additional Health crises for the broader Community are out there because we have not offered the health services that we need. I know that are a firefighter friends are in the audience and much of their time is taken up with having to respond too much of his health crises part of the solution is what we'll talk about later today and their committee the Mobile Medical unit next one, which is I'm patrolling around then when I went on that tour with the firefighters, the only five calls we got we're responding to people who are dealing with the crisis of being homeless consequences of being homeless and lack of access to healthcare. This is a health issue and I think it deserves a health-related a spawn. Absolutely. There should be additional support absolute. We should we should be making sure that there is additional patrols for those who need additional medical assistance to make sure that crimes are not actually being committed but it is not a crime to be unsheltered and fax to make sure that we are not having policy solutions that are driven by perception. We absolutely just like in the public health field where I came from we have to look at the public health. We have to look at the data for free public policies that are based in sound data that drives what we should do not on the perception that crime is increasing in certain areas. I really appreciate the questions that you submitted in response to this announcement because we have to make sure that the date of bear is out the policy Solutions. We cannot just have a call for action and just rushed to put more people on the street and act as if this is a criminal issue when it is truly an issue that requires a council member Bagshaw said additional medical support mental health counseling as in one individual mentent mention access Opioid treatment but also recognizing that many individuals are out there because they do not have a place to live and they do not have a place to take a shower and do not have a place to go to the bathroom. We are creating additional crises that Minnie and the and the community have commented on we need to do is be responsible and I think much of that last year with the large tents that would have partitions between beds that would allow for more people to come in quickly to be stood up. Those are good for folks who don't have a car to sleep in or don't have enhanced shelter to be in for quite literally sleeping in our streets when I talked about creating the stand up tiny Casitas, the little houses that could be stood up in 20 minutes with heat and electricity that have a door and a window and two beds and a desk. This is a responsible way to respond to get more people inside. But it we have to act responsibly as we are being responsive. We cannot just jump to the quick. Solution which is to give the perception that were further criminal criminalizing homelessness. I think it's really important to make sure that people understand the reason that we continue to see more people sleeping outside is because we do not have the shelters and we do not have the housing to exit people from the shelters are shelters at capacity and November we heard that there were 3 enhanced shelter beds open per night 3 enhanced shelter beds open on average per night in the city in November last month on average in the city that for every 20 people. We should have a toilet like they doing much of Europe a public toilet. So that people can use guess how many we have here in the city of Seattle. We have six public toilets. Only two of them are in good condition four of them are not functioning well and not all of them have a Sharps container in order for a city to truly be responsive to the actual Public Health needs right there to be public facilities. We should have 224 Toilets in the city not to mention the type of enhance shelter bed. So that individuals can sleep inside and not sleep on the streets not sleep in their cars. Yes. There is a crisis. There's a crisis of Consciousness that we're not acting quick enough. There are some things that I've never been very interested in advancing with this Council, which is the Mobile Medical unit which will talk about a little bit later with a sponsor last year. And yes, we need to act quickly to get folks inside the solution to homelessness is additional homes and shelters the solution to people defecating outside is a additional toilet the ability to make sure that people can keep their job which are surveysay 20 to 40% have some form of employment legal employment. That is the solution to have them keep their jobs as an access to an actual shower. We need to make sure that we're actually creating to be evidence based solutions to treat this Public Health crisis as a true crisis that it really is and that requires data driven Solutions. I do hope we get a chance. Further conversations to have a conversation about the medical needs the mental health needs the shelter needs and the housing needs and not just this perception that crime has been in a solution to the crime is the only thing yes, we have to respond to those criminal issues. But we also have to make sure that we're getting at the root of the problem and that is that people are living in crisis and in poverty. Thank you manager just a friendly amendment to your remarks Public Health crisis that council member must get a has spoken about but also what I heard from members of the audience just the desire for and I think from the collective body, which is the desire for safe communities for families and individuals to thrive, but I also want to caution not to applaud the when remarks are made by individuals. regarding issues of making racist remarks in these conversations as we have these conversations not to demonize or to fall to I think what are some of our worst Instincts thank you sign up for this job with regards to the difficulties and the remarks that we have to take but also understand that those that's not a pleasing to the best of anyone of us. So thank you love my colleagues for indulging my request to Shear reflections with audience immediately after pellet US money. That's not something that we ordinarily do and just want right now is that I appreciate your all's at willingness to listen in the audience and to my colleagues for your willingness to share your your initial Reflections. I do think it's important for members of the viewing audience both he who are here in person who might be watching from home or who might watch this video later for them to I'm here at the top. The agenda a reaction or sort of initial thoughts that we have about about this this overall issue and I just want to acknowledge as well that I agree with many of the remarks made by my colleagues at the table here today. I think it's pretty clear from both the public testimony and from the remarks made by colleagues at the table when we are addressing a public safety and public health issues. It is incredibly complex and multifaceted and there is no silver bullet or One Singular answer to addressing livability and safety concerns that might be reasonable. Yes. We have an obligation as the city of Seattle to deliver effective constitutional law enforcement policing services to our neighborhoods that is a core function of what we do as a city and the city council has taken many steps to actually support that including passing. Many budget actions to increase the amount of dollars available till Police Department so that they can hire and retain officers. Just recently we all collectively I passed a bonus hiring bonus not just for laterals as proposed by the mayor but I pass an amendment to also allow new hires to be allowed to be provided a bonus. And in fact, that's where we're seeing a lot of v a success in the hiring now is around that new recruitment of police officers who are brand new to the department also passed the new collective bargaining agreement with our Seattle police officers killed and her Seattle police management association, not without controversy, but it was if I recall correctly in eight to one vote by the city council to support that as a another gesture of our support for those public employees to provide law enforcement services to our neighborhoods, and we Going to continue to see more and in fact, the first agenda item on today's agenda is an item that was primarily sponsored by council member Bagshaw that again is a piece of the overall multifaceted set of solutions that this city needs to be promoting in order to address those individuals who may be experiencing crisis on our streets as described by councilmember mascara, but that doesn't excuse our duty and obligation to also address some of the legitimate crime and disorder issues that we hear from community members both in Chambers. And as we move around our neighborhood, so without further Ado we heard public testimony for almost an hour and we've had an opportunity to have Reflections for about 20 minutes. So we are going to go ahead and move into our first agenda item, which is related to one of the strategies related to addressing people in crisis on the streets. Which many of the public house fires describe scene in there? Did they move medicine around the city? So I'll Roxana if you can read the first agenda item into the record that be great agenda item one Council Bill one 19509 and ordinance relating to a mobile Integrated Health pilot for breathing discussion impossible vote. Thank you. Okay, we will go ahead and do a round of introductions. So just tell us your name and who you're with and then we will go ahead and begin the presentation Greg Goss Council Central staff Harold Scoggins fire chief. Seattle Fire low-acuity program Human Services executive is going to lead us through their presentation remarks to kill us up before we get started. Thank you briefly. I want to acknowledge and think of Scoggins. Also, I think Lieutenant Kenny Stewart is back there. I'm head of our firefighters Union and also to the mayor's office Leslie. I am so thankful for this report and John Aaron Feld you have been so helpful to us and identifying what the problem is. We're trying to solve in to get that clearly identified. And the goal here is to be able to have a unit that is comprised with our First Responders, maybe Behavioral Health possibly in the future or a nurse, but somebody who is a group that is out there for those with low. Security problems and that generally reflects with people with addictions or problems that they're having behavior earlier or mentally rather than having our firefighters who are praying for high Acuity responses out on the street every day. So I know you'll bring us some statistics, but I do want to acknowledge how hard you've all worked. It's been something that I have put a lot of pressure on you. I know there's Smiles, but thank you for that. And also just do it. Once again acknowledged our First Responders and our firefighters who are helping us everyday. And then Leslie are you going to actually if it would be helpful to know how much time we have based on? And we can scale appropriate like I start a minute 30 minutes. At council member comments about working with the fire department on this has been an amazing opportunity. I think I will take a little bit in a moment about how we brought together several departments to work on the switch for the first time in my five years here was really a great conversation about not only sort of Medical Response and but how we integrate not into our response to homelessness has been really great. I'm going to let you kick it off and then we'll move into the fitt. How about this? We're going to have John get through the presentation because there's a lot of great information in there. But I do want to make some closing comments. Okay? Thank you. I'll allow me to open just with a few brief remarks of thanks. I'd like to thank God. She's Scoggins, of course for his support and advocacy of this program in this initiative particular. Thank the council members Bagshaw mosquito for sponsoring this we really appreciate it to our partners on the interdepartmental team Leslie Jeff and everyone else who joined us and to iaff Local 27, and I president Stewart for for their support. So thank you all that and then as well according to our operations numbers for helping us, we at the fire department of cognizant of some larger Trends in the fire service, you know, historically fire has been a little bit more of a reactive Branch than our partners with the police who are more proactive typically usually you know that we Four calls to come in we go out to respond. We mitigate the emergency and I think in the big picture that picture is starting to to to slowly but surely change. We want to align our fire department with some of these National Trends. We need to start getting out. It had a little bit of some of the public health issues in crises at the council members brought up and and figure out how we as a fire department break out of some of our silos and really integrate ourselves more thoroughly into the public health infrastructure of our city in our communities. And so our proposal looks at one particular facet of that which is calls for service that don't provide a life-threatening emergency to life hell for property that we have to find those lower Acuity responses where the patient does not need immediate hospitalization. And so I want to talk a little bit about the presentation about our our our proposal for this issue, which is our mobile Integrated Health Response Unit, and I'm not come back to the slide. Just a moment. But really what we're looking at here is several significant deficiencies with in the fire service that we think we are very well address are well-positioned to address. So essentially what we are seeing is that a certain subset of our calls for service within the medical realm are medium or high Acuity calls and we're very well positioned to take care of those right now where we want to improve and where we want to move. The ball forward is in the lower Acuity end of that spectrum. And so it as part of the interdepartmental team we looked at where are we responding frequently for these lower Acuity alarms throughout the city of Seattle and what we see is that the preponderance of these locations are very highly correlated with a provision of Public Health are homelessness services and they particularly cluster in the downtown core of the city. So what we see is homelessness Services shelters and permanent Supportive Housing. We see public locations. We see law enforcement and Corrections and then the other Let me go to frequently for these are long-term care facilities, which is a little bit of a separate conversation and what we found as well working with our partners at SPD is that there's a fair amount of overlap in these, you know, these locations were responding too frequently for these alarms are also frequently by SPD. Give us an opportunity to bring together or not. Only sore looking at this through the lens of the fire department, but also through the lens of the human services department both there homeless strategy staff and their aging and disability staff as well as a very intentional partnership with public health and the police department. So these conversations we're really about Not Only Hell my SSD responds better to low Acuity calls and more appropriately and how might we better serve folks, but how might we reduce those calls on the front end how might we work with our relationships with both homeless service providers and providers of housing to better support them as we move forward. And and so and doing that we had a lot of very intentional conversations with permanent Supportive Housing provider is emergency shelter providers and the healthcare for the homeless Network. This shouldn't come as a surprise to any of us as we've been having this conversation. But I think the first and foremost highlighting the fact that our adult homeless population is aging as it is our residents who are housed in permanent Supportive Housing and because of that increasing age and increasing Acuity and metal medical issues and the results of that are the fire department of seeing the results of that another piece that has happened here. Is it over the last several years permits were coordinated entry has been implemented and that is a very positive and important policy. As such we are prioritizing people who are the most vulnerable to getting access to permanent Supportive Housing that is amazing and we need to do that. But we haven't necessarily changed the Staffing model or the Staffing support for permanent Supportive Housing as we have done that so we are seeing increasing concentration of Highly vulnerable folks in our housing in our permanent Supportive Housing. We also are dealing with the fact that we have a number of Staffing challenges with both Staffing and keeping footstep retention and turnover with regards to the lower wages. That folks are making so together that's creating this compounding issue of our permanent Supportive Housing providers and are homeless service providers of emergency shelter not having staff on site who can address the needs of their Residence or clients and thus calling 91911 become as the default. We also in looking at the Healthcare System. We're looking and creating an intentional conversation between homeless or service providers are homeless services that we fund and Healthcare is not necessarily how we have thought about it. We thought housing housing housing which of course is important but figuring out how we build those Partnerships to get the health care services in to the shelter and Housing Services is also really important. So looking at our downtown core where we see the majority of these calls coming from and the fact that we don't have a lot of appropriate low barrier barrier walk-in care for folks. We don't have much Urgent Care downtown at all. There aren't alternatives for folks who for service providers to transport people to anywhere, but the emergency department and then there are sort of bigger system at gaps around what Should permanent Supportive Housing be the only option for folks who have significant medical needs who are exiting homelessness. So we looked a little bit five both in the memo that response to the sly and on this presentation. You identify Healthcare System gaps. What is not identified in the report is who are the owners of those systems? So yes, and they do some fun. They have funding for healthcare for the homeless Network and I wouldn't say I'm not saying that they are the reason for a gap. I'm just saying that they aren't there actually a filler of that Gap in a lot of ways they provide funding for on-site Medical Care in permits for depositing an Emergency Shelters the healthcare system as a whole the obviously we know that we have a lot of Hospital Systems in the core area that have emergency room some of them to do Urgent Care as well. But they noticed these ZoomCare. I don't want to point out anyone specifically but these a large and titties and oftentimes they only take commercial insurance and don't take Medicaid. Obviously there have been a couple that have been opened up to other systems that will take Medicaid for what we're finding is a bit of a bifurcation and who can access certain types of services. This is some gaps are tall tie to funding some of them are tied to connectivity. So we have a great system that we built the nine-one-one system and when someone needs help they know the number to call and we show up to help them but we have not connected very well is our First Responders on the street to other options. That's one of the gaps in my mind. That's actually the biggest gaps are firefighters do an amazing job each and every day responding to many emergencies around the city, but we are built on a tone of a turnover system. We need to get their solve the problem get them somewhere and we need to be available to do it again, whether it's a fire and medical and there's there's very important reasons for that. You having a cardiac event a stroke everything. Built on time. If you having a fire in your home, there's a time temperature curve battle response times are built after these calls take more time. They aren't the critical ALS type calls, but they still need more time to solve the problem. Otherwise, we are going to get called out and we're going to do it again. We're going to do it again for going to do it again many times. Our resources are called back to Harborview after someone's been released because it's not a true emergency and there at the bus stop right outside of Harborview and we respond back to the bus stop. Now the same brace on a part of that is a connectivity issue. We don't have that resource to get them to where they need to be which is why this is so exciting and went when John gets there. You will see all of the new options that we're going to have but it's going to take time to get them there. But we see that's a part of prevention if we get them to where they need to be. It's going to save us. Time but it's going to get them to help you actually need to have a better life and a better experience highlights why I was going down this line of inquiry is that I don't want the general public to walk away with the impression that we somehow can fix the Healthcare System gaps that have been identified in the response to the statement of legislative intent. The reality is is that even though I'm a strong believer in this program in terms of meeting the Urgent needs of people who might be in crisis who I don't have immediate access to other types of primary medical care that we are doing so within the context of a broken for-profit Healthcare System is really designed to deliver Healthcare Services to those who have the privilege of being able to afford it. And and so I just I want to really acknowledge that without sort of an overarching systemic. Transformation of how we deliver Healthcare to our most vulnerable. We will continue to be put in a position as a city in as a partner in our Public Health System Marquette County Public Health System will continue to be put in the position of having to sort of bite around the edges again in an important way but it is still biting around the edges of addressing the health of the fundamental Healthcare needs of of the most vulnerable people in our population which are not just people experiencing homelessness. It also includes elderly and aging and isolated people living living in in homes and in multi-family housing, so I just wanted to lift up the fact that you all did a did I think I'm outstanding job of identifying what the overall health care System gaps are with the acknowledgment and I suppose the footnote that were left unsatisfied because we have very little Mechanisms by which we can fundamentally transform the gaps that you've identified in the Healthcare System cuz we're miserable. As it relates to the scabs and specifically to the bullet related to the lack of respite beds specifically their lack of respite beds for again an aging population and specifically in the instance that I would like to share an aging population that is is homeless, and I recently received correspondence from staff at Saint Martin de Porres Lazarus Center and they exerted for me when one day's worth of the daily log and over the course of just one day 12 of their homeless residents who sleep on mats in their shelters. Had to go back and forth from the shelter to the hospital because of medical conditions 12 separate people. They also recently shared with me and experience that they had with a governmental entity that is part of our response system asking them why it was that they would not accept an elderly man with active flew enza in influenza in their shelter. Again, this is a shelter with Matt's in the floor people sleeping 6 in another and they were criticized basically for not accepting that individual into the shelter. So just want to share that is in a luster tip example of how the lack of respite beds effects. I'm not just the system but but people and folks organization that are trying to help folks think you're appreciating both of those points. As I move to the next slide, these are not solutions to those gaps that I that I just identified. These are really things that I want to let the fire department focus on the things we're actually doing because there was a but there was budget allocated to it and buy things that are on this list are not necessarily things with budget. So we are thinking about different ways that we might support moving forward. But sort of the Medicaid transformation is important piece of this sort of accessing additional resources for folks who are not part of our you know, who made who might not have the kind of insurance that many places will accept thinking about how we better help our service providers and housing providers to address these needs from a staffing perspective making intentional connections between the office of housing as they find a permanent Supportive Housing project and the fire department. So the fire department knows when housing projects are coming online making intentional connections between the public health department who has funding for aunt Medical Care and the permit ends. The fire departments would have data to make sure that we were locating those services in places that are having an impact on our systems we can do without additional funding and then I think you know, we will look to figure out pieces of this overtime. I'm going to let John take it away because it's the most exciting part of you that you go back to that last slide on the last bullet point Medicaid transformation efforts. That's actually happening right now at CMS and and that's very important that that's taken place. So they just made some changes and what they're calling, et3 emergency triage transport and treatment and this is a big deal because what they're going to start doing is allowing payments for other than an emergency room. If a patient is transported to an urgent care to a crisis center or even left in place in June what's going to happen is you're going to start accepting applications nationally and they're going to award 40 Pilots around the country to study this so they are paying attention to this. The fire service actually has been very active and moving this forward and this is one of the changes that that's actually going to be moving forward. So that's important. Follow up, there's no guarantee that we're going to get that city of Seattle, but it's a grant for which you are applying. Right the others will guarantee that that we're going to get that but we're out of heating that a city in Washington is not Seattle gets that so we can be a part of the pilot. Soon in terms of our status quo system right now essentially what we've done is identified a number of inefficiency. So very briefly the way that 91 work 911 Works in Seattle as the call goes to the police first if it is an obvious Police Issue or an obvious psychiatric issue. They send police only if it is anything else in that they send it to ar901 Center for immediately identified extremely low Acuity complaints a toe pain. We will refer directly to ammar for Ed transport only sometimes four-person down the street or subsequent identified psychiatric called when you send it back the police but everything else we dispatch on and so that is approximately 77000 Medical Response as per year and half of them are ultimately a medium to high Acuity patient. Someone who really needs to be in an emergency department. And I got our system is very well configure to provide the best possible treatment for those were they in efficiencies come in. However is the remainder of the Typically, they're going to receive one of two dispositions one is transport to the emergency department. So these are identified low-acuity conditions for which we have no other recourse, but to send them to Harborview or another hospital and the others are the folks who we do not remove who we leave on the scene and really essentially what we're doing there was ruling out major medical illness is providing some reassurance, but really no other treatment or connections at that moment and then you know at the bottom you have our alternative transport and referrals and this is I think is it a growth Theory this is where we really want to improve going forward. So in terms of the patient dispositions just to kind of put some numbers on it right now every year we send about 9,000 patients to a hospital emergency department who we have already identified as having a lower Acuity complained. So that's more than once an hour every year. We are sending to the EDI someone who really could be better served somewhere else and then, you know a very staggeringly large number of It's War again. We're not removing them. We're leaving them at the scene regardless of their complain. If it's not a medical emergency that again really not doing anything subsequent with them in terms of the typification of these patients are there are a couple there's a couple commonality. So the most common primary impression that are responders note is no complaints her illness or injury noted and that's really a catch-all for really any humans non-medical of nature. It could be a social. It could be a social condition. Someone is just called someone is anxious or nervous. But that is the most common one and then you see some clustering as well around substance abuse, of course, you know alcohol by far leads the way in terms of the patients were seeing with more low Acuity medical complaints and then around behavioral emergencies as well natural altered mental status mental disorder behavioral episode and then a lot of these overlap as well, you know, the patient assist only that's typically when were helping people off the floor for non-medical calls, and I just want to Cenote in our earlier discussion regarding a permanent Supportive Housing last year are top individual who accessed 911 for EMS in Seattle woman about 65 years old resides in a Capitol Hill assisted excuse me, Permanent Supportive Housing location. We saw her about 90 times last year 80 of those times. The only service we provided was checking her for injuries finding none returning to her to her wheelchair from when she had fallen out. I think I need not be said that this is not an ideal match of our core services and that's station 25 engine 25, 8:25 and Ladder 10 is one of our busy or companies in the city of Seattle. Why does program is so critically important and certainly want to extend my gratitude to that company for the work that they have been doing diligently and Faithfully in the Absence of a program like this. So I really want to acknowledge the work that they've been doing in the absence of this and looking forward to being able to deploy these resources to get them back to doing their core Services. Thank you. So our proposal on the mobile Integrated Health vehicle. We we really started by doing a lot of research around what is what are similar models around around the region around the state and National level really trying to build on best practices not reinvent the wheel and see what's working. Well for other providers nationally and really what we think is that Integrated Health capitalizes on what we as a fire department already do well immediate response. We're good at or flexible. We're adaptable were used to problem solving working in teams and one additional element that I left off. The slide is there we enjoy the trust of the community when we knock on the door people tend to open it. They invite us into their homes, and I think that's an opportunity for us. I just wanted to offer you a reframe on the first, that you made because yes, I do think that you looked at your local state and National Partners really this is coming straight from the folks in your unit as a within iaff 27 within the conversations we've had from you. This is not something that you started. As soon as the statement of legislative intent was to have this came directly from your members and you're incredible research your education of us over the years because this comes directly from your lived experience of seeing how our resources are inadequate ly or inappropriately use you all have done a tremendous job with I think a decreasing budget over time. We should also acknowledge that we still need to increase the overall firefighter budget and I think you a lot of Champions on Council who want to do that, but I just wanted to note that, you know, this is really thanks to you and your incredible research the members of the firefighters and Leadership for hell. Identify the existing models that were out there. Yes. We put it in the budget last year, but thank you for prompting us to do that for taking us on the ride along for your members for showing us. What is actually happening on the date on a daily basis and thank you for supposing that many other cities in our region already have this and you helped bring it to light. So thank you. Thank you. On that note some of the work that was piloted a several years ago. I remember being so excited to see you Chief Scoggins speak at downtown emergency service center breakfast about the initiative you were taking around low-acuity calls again working and identifying Solutions based on what you were you and firefighters were seeing on the ground and that specifically there what what happened as I understand it. Is that King County EMS and SSD piloted with DSA a nurse triage line and 24/7. And so rather than nine one handle handling those calls and Being referred to you the some of them were sent to the DSC nurse. I'm really interested to find out that find out what you learned about that. I don't see that as part of the response before us today as an element of this this new system. I was under the impression. It was working really. Well. I don't I don't know if it was suspending that resulted and it's ending but if you could just share a little bit about what the Lessons Learned in why we're not incorporating it now in this response to a few different things that we've done over the last few years because we have some meat we have made some very intentional steps and I think they have shown some very positive outcomes. So since John's come on board, we've done a few things. We we brought on a social worker and in John can talk briefly about the work that Ashley does and and well, I guess I can I know a little bit about it. So what she does is she What you all are ESO reports, which are are electronic medical report and what she does is identifier high utilizers and she circles back around with a high utilizers and touches base with him to find out what they need. And then when she finds out what they need, she connects him up with Services what we have found is that starts to decrease that population of calls, but we only have one and she doesn't amazing job. So that's one thing that we did we did partner with Kane County EMS and they give us some funding for a nurse line. And what would John did and he did the heavy left on this? He designed a training program. He went around to all of the DSC facilities and not just DSC other facilities train them up on how to use at 9 that nurse line. So before they called nine-one-one for certain protocols, they would actually call the nurse line and that was very important and we have the information and we showed it that was effective and when they actually called at nurseline it decrease our responses for those types of calls by with 80% Yeah, it was a little over 80% sold. So that was a big deal that showed positive outcomes. Another thing that we piloted over the last couple of years was taxi voucher programs of we get on scene. We did this a terrible stations and if a person did not need an ambulance ride to the hospital but still needed to go we had a taxi voucher program and John build a relationship with 31 and Meridian and trying to work you that we had some some turbulence along the way to all those things have happened the nurse piece in particular it was on one of the bullets of potential things that we can do in the future. If it became of funding issues King County Ms. Only had so much funding each call. There was a dollar value to that what we did out of our budget is we funded it for a while longer and things got tighter. We we had to end it but what we saw was positive outcomes, but we can actually do more than that. Cuz what you saw on the slide was a nurse in our Dispatch Center. That becomes the intersection Point not going to nurse line not having to retrain a staff to Winter to use his nurse line. But if we had a nurse in our Dispatch Center we can do an interception Sports analogy there right at the Dispatch Center. Our dispatchers are amazing and do a great job building. So many calls they would go through the protocols. And if this just did not seem like that 911 response we give it to the nurse the nurse now goes through their checks and balances if they need an urgent care if they need a caseworker thing at all of those things or if they need to call one that now becomes a better resource. So that's one of the future opportunities for us. We see that as it could be affected in the future. Did that answer your question? Absolutely, the just a follow-up though. The are you saying that the function of having the nurse on staff at dispatch is serving the exact same function as the nurse triage line kid would be a greater impact because it would be for all the 9-1-1 calls. The nurse line was very specific for DSC. We train their staff. We gave him the number and it was very intentional now, that's that's population that needs a lot of services. So it made a lot of sense. But if we wanted to have a greater impact you want to put the resource in the place where the call actually comes in. So then the goals of the mobile Integrated Health Unit really to fold one is to our to our clients into our residence here in Seattle providing better patient experience of care and better outcomes when they call and then the other assorted more eternally is to reduce the impact of these responses on our operations units. So this is really kind of the Crocs of where we think that we can innovate and where we can take advantage of some inefficiency used to the idea. Now, is that the mobile Integrated Health Unit will either be directly dispatch from ar901 Center of boarding a call entirely to operations or if our operations you are already on the scene identify the need for it. They can call and end fundamentally what this unit is about is providing a real-time connection with existing services. So we are not proposing to become a fundamentally new line of service in terms of providing our own Healthcare our own in-depth case management Etc that is very difficult to do on Spotify ad hoc episodic basis and and Frankie their resources to do that. Really. We want to do is connect patients in a real-time immediate moment with some of those existing service is out there. I really want to Echo. What are Leslie and Jeff spoke about about the critical need for low barrier all payer Primary Care community health centers in Urgent Care in the downtown. I think it's a huge gap right. Now. That being said, I think there are enough services that we can start providing this to our to our patients who we encounter and so fundamentally. I think what this unit is going to do is it's going to connect people with a destination. So Primary Care Urgent Care crisis Solutions sobering shelter housing in the immediate time frame or without that providing a connection with a case manager with a telephone nurse with a referral with a next-day appointment or would one of the specialty teams that already exist throughout the city of Seattle because we're going to have our firefighters on this unit if they do encounter someone with a medical need I'll be able to mitigate that to handle that and then facilitate transportation to a needy. So again, this is a it is a connector unit is sort of a force multiplier for a lot of the services that are already being provided by city of Seattle King County nonprofit Partners in the healthcare sector. Thank you. I just want to know that we're also at 11:01. We have to be out of here by noon. So so feel free to ask your question. But if we can keep it like really short sew-in that referral process have we assured have we guarantee that there is going to be somebody there for that warm handoff for that next day appointment for the case manager to be on the line when we have 30 to 40% turnover rates in vacancy rates at places like dese and use care and our other human service provider organizations. That seems like a really great model. How do we make sure that there's somebody there to answer the phone and provide that case management if we haven't as well beast of the funding the wages and stability for those organizations. I'm looking come from the doctor because the the funding that went into the budget for 2019 for crisis connections for the one called program is a really essential part of this on the previous slide. It was the little telephone no, they weren't called out by name but the idea is that crisis connections as the health one. Workers firefighters can call and get that person that patient that they're working with connected to the existing infrastructure. Right? Somebody might already have a case manager fire department doesn't know that the folks at 1 call can help make that connection maintain HIPAA privacy and get there already sort of connected services to them and despatched. So that is that is the idea. I believe that this will be an iterative process both as we learn on the ground but also as we build capacity in the infrastructure, so it's it's a yes, and there will need to be additional connections babe. I think the other Elementary your question is where we're going to start small with a a small Cadre of a trusted Partners where we have agreements worked out with them rebuilt. Those relationships does fundamentally this unit is really going to be all about relationships and the staff on that rig being able to pick up their cell phones and call a provider they know or call a resource that they know and be able to get that in and so, you know, we're going to try to build out over time. It really start on day one with some very firm relationships built where we know that they have the capacity and the workflow to accept these patients. Pacheco the third slide show that King County Jail was the 7th most visited place. I just curious what expansion of the program specifically at the jail. Would that be something to explore down the road? Expect I'm not sure if I like just 4 expansion that program in future years, like just having it on site at the jail. Would that be potentially something worth exploring down there down the road in the future. So we're starting with one unit in the future that that could be a part of the conversation, but we're also having additional conversations with the jail. So the jail has a physician on staff damn nurses on staff. So we're trying to work with them to better use their resources to get their patients to where they need to be without calling nine-one-one. Give a physician on staff and nurses on staff. You may want to use those resources before you use a 911 system Witcher 4 critical ALS events. To be frank, we've identified some workflow problems with gel health and dajd, which I think would be appropriate for a a separate update. But but I think there's some opportunity is there to lessen that that load and so very briefly in terms of the operational profile of this unit. We are going to have a multidisciplinary team which again our research has shown over and over has the most Effectiveness doing this Outreach. So we're going to have two of our firefighters who receives special special training and then a man on fire fighter position likely a social worker or similar level of certification some of the extensive experience working with this anticipated population. Perhaps lived experience someone who's really Adept at communicating with them and figuring out what their needs are and has a very good understanding of the systems and play we're going to cover off the bat on the downtown core and we really want to provide services well to some of the adjoining residential neighborhoods weather. That's Capitol Hill or somewhere similar to look to see how this program functions within sort of the more dense urban areas. Well as a little bit more of a residential area the hours I'm going to walk back that Monday through Friday a little bit. We're still figuring that out, but it'll be it'll be roughly that and we wanted to provide service at peak hours. So when businesses are open when urgent cares in Primary Care open when case managers are picking up the phone, that's when we want to provide that service and we're going to start off primarily as I mention with a response-based models of directly dispatch from 911 requested by operations on the scene. I think perhaps in the future there's some opportunity to do a little bit more proactive about reaching work with some of our Community Partners as well. And again, we have budgeted to run this for a minimum of 1 year and we are looking for some old alternative funding sources as well to AUD to boost that out as well. And the expectation is that late in 2019. You'll get rolling. I think we mostly cover this frankly, but you know that the patients we are primarily expected to serve really fall into three categories one is lower 2D medical condition. So those are chronic complains or Flare-ups of chronic complaints were they don't need immediate hospitalization one is behavioral health emergencies and substance abuse and one is social service needs and that would be things like shelter and warming I would direct the committee for a more in-depth list of our partners to the written Sly but I really see us interacting quite a bit with SPD particular the navigation team in Crisis Intervention team crisis response unit with the countywide mobile crisis team with primary care the community health centers and with our health care facilities on but again, this is really going to be about it's going to be about relationships and Partnerships and sole looking just in our 2nd battalion, which is Sino downtown core Plus Capitol Hill out to the water the need the need is clearly there I think is that is the bottom line for us. And then of course the the crisis of people who are living unsheltered, which overlap with all the above categories is primarily felt in the downtown core. So, I think that that is really the target of opportunity. Before us and it's going to be in order in a program. We're going to see what works where we get the most, you know, where we have the comparative advantage that there are specific subcategories are cohorts of this patient population. We will identify that and ended up the team accordingly. And then we are going to we're promising a very robust evaluation on this. We're trying to get a a grant to do a PhD level valuation, but regardless we're going to do a very significant internal evaluation about maybe he'll be everything that we see the metrics patient contact patient outcomes subjective measures like experience of carrots that are up and then with recommendations back to this Committee of how we think that it should go forward in the future. Is our last line? Okay great. So thank you so much for the presentation and for taking the time to respond to some of the accounts with questions around this and at this point, I'm going to hand it over to Greg Doss from Council Central staff who is going to I think walk us through an amendment that I'm proposing be made before we consider the council bill that will ultimately at lift a Proviso allowing the funding for this program to be utilized by by the fire department. But before we do that, I think one thing that I've noticed is that in the slide indicates that the cost of the program would be $500,000. The Proviso is on $475,000. So I explained to us where the $25,000 Delta is coming from. There's the expectation is that the low Acuity program within fire has some discretionary funds. So we're going to use that to make up that $25,000 to round it up to 500. So there's an additional $25,000 available through the low Acuity program that will roll over into this program, correct? Okay, great for the Executive before I hand it over to Greg. Okay, Greg take it off and I'm handing out the amendment that I had Greg work on for me. As you mentioned the bill that is before you today is one 19509 and it does two things that releases the Proviso on the $475,000 that required this report from the fire department and it also moves into the fire department 475,000 that you mentioned that money had been held in finance General pending this report and the pilot proposal from the fire department at a very high level has to do with the evaluation that the fire department in executive are going to conduct on this pilot proposal as you see up here on the side. They're going to perform a very robust evaluation this particular Amendment asks them to look at whether the team or the public would benefit from the services of an advanced provider on that team. So that would be someone who might be a nurse practitioner or Assistant or nurse someone who is capable of helping with in field treatment the chief talked about how one of the strategies for this pilot might be to bring folks who don't need it an emergency room to an urgent care clinic. This would be sort of the opposite if there was an advanced provider on the team. They they could sort of bring the Urgent Care to the person and whether it's something minor like being stitched up or if a patient has back pain the advanced provider might be able to provide them with pain relief and injection of Toradol. So to say so the idea here is is some medical treatment in the field and whether or not that would have been beneficial so then the council will know in a year or whether or not they might consider a during an advanced provider to this team. I think you break. So I also want to extend my gratitude to the fire department for review of the amendment and my understanding based on my conversation with wreck this morning is that that we've gotten to a place where there is consensus here with this amendment and I appreciate the opportunity to be able to just ignore that this is a pilot program. So there is an opportunity for us to deploy this program in a wave it is small enough for us to feel confident that was about in the model correctly designed. But but also my hope and intent with this amendment is that it'll be important for us to understand it what what how we can make the model and more robust if we determined to take the program to scale once we see the initial data and so I'm leveraging the opportunity that you have all presented with the robots evaluation and Text analysis that will already be occurring with the underlying pilot program to also create an opportunity for us to evaluate how many people might have benefited from these types of Advanced Medical treatment services on site if they were or had been made available during the pilot phase. So I think this is a middle ground way at it getting the information that we need for future budgetary actions and for future opportunities for the Department to look at how to tweak the model as it goes from Pilot to something that hopefully will be much more sustainable because I'm really hopeful that this will actually be really successful for a lot of reasons. So this is my proposed amendment and happy to answer any additional questions or have Greg do the same. Again, thank you so much everybody for your thoughtful work. I think we're moving in a direction. I like what you're proposing here council member Gonzalez. I just have one quick question. We're not at this point putting a nurse practitioner or somebody that can do Healthcare kinds of things like that at this point. We are not doing that in this proposal. So what we are asking for here in this is my question. Is that should we decide to do it in a year? It will only be based upon a solid data and evaluation and a recommendation that you would bring forward based upon this year. So am I correct on that because we're about yes. Yes understanding from some of the providers that are the the First Responders that they've got some concern that they want to make sure that people Call this entity and I I love the help one name and that the relationships are built and that people will go and get the services that they need that this is not just an on-site on the street. I'm going to do wound care and then that's the end of it. So we I'm just hearing from some of our First Responders. I want to make sure that that doesn't become what they are doing are expected to do that's not the intent. So as long as we've got some time to look at that and consider it and and be working with our First Responders this year. I'm going to be supportive of your Amendment. So the amendment isn't going to modify the proposed model as we heard in a presentation today. That's not what this amendment. Does this amendment essentially ask the folks who are going to be Staffing the healthone mobile bus to track additional information in their contacts with individuals. Through the existing model of the program. The purpose in the intent of that is to allow the fire department to collect additional data that may allow us an opportunity to in the future revisit the pilot version of the design of this model to really ask the question of is there an opportunity for us to better serve this client base by having somebody who can provide Advanced Medical treatment on board as part of the multidisciplinary team. So that's a that's a question that will need to be answered by a future city council and a future budget operation process. That isn't going to be this fall and we certainly want to have the the fire department have an opportunity to collect the data that will need to be able to adequately analyze the information necessary to be able to make that policy determination. And obviously it will be done a similarly to the process we pursued here which is making sure that the fire department is engaging with Relevant stakeholders, including our First Responders to make sure that the model is still going to fulfill its intended purpose of not just being a connector to services but also of meeting the sort of basic low-acuity needs of people that are coming into contact with which could include things like suit rain in relief excetera on site. I'm struggling to understand what is funded and what is aspirational for the future when I when you explain to Scoggins how the DSC Trails line wasn't being used. One of the things that you learn from that is that having a nurse in dispatch will actually have even better results than the triage line. I thought I heard the tents being used as the conditional tense the future this would be good. So it's not clear to me whether or not there is funding for us a nurse to be located in dispatches part of this proposal try to provide Clarity. There was one of the slide early on that had future opportunities and on the future opportunities slide, it had a potential for a triage nurse on future opportunities. What a Please find it is to Firefighters position with the social worker for lack of a better term right now. That's what we're asking for funding for shows positions such a huge 80% of people diverted with the old esdese line. Why is that not a priority for this new system that she's so I would say there is some policy work that needs to be done. There. There was a question of would it be better or more impactful to have a nurse line separate and distinct from 911 which is a lower-cost intervention, but creates a to pathway situation or does it make more sense to think about funding a nurse position at the Dispatch Center? I would say those two things in a conversation that policy work is underway. In addition. How do we best leverage this new system of one call who have right now behavioral health specialist, but could we also Think about how they might more intentionally partnership in this way. So there's just some policy work that's underway. And as we look to move forward, we will bring it back. Sound like an hour or so. We are running the clock here. So I'm going to move us along. Is it related to the amendment? Yeah, I want to give you a heads-up. Thank you madam chair. I know we're running late. I appreciate everything that we're doing here because we're moving forward. That's really exciting. I appreciate your amendment. I do have some questions and concerns. I did have a chance this morning to touch base with some of the firefighter local and members and Leadership and there's a just a little bit of concern question marks about how this does affect the current budget that's allocated. I'm concerned that I don't yet know how this would affect the on-the-ground experience of those who are seeking medical care. What additional questions will be asked what does it look like in terms of interaction having seen someone who had a huge abscess on 1st Avenue when we went in art or I can imagine that it's really tough to think about how old are the other additional questions that we have to answer as we're trying to get this person into medical care. So ask him those questions is good. I think at this point, I'm sure given I have these lingering questions about the impact on the delivery on site in the existing pilot. Abstain from the amendment at this point and look forward to Future conversations with you all and members of ifs 27 all of the calls that come in tonight. When one can steal a resource conceal be dispatched to deal with all of those things you're talking about if it's wound care and we need to wrap them up and get them to the ER we do that today. We do that all day everyday. This is just a little different paths to all of those things are still in play if this year if Health one got on scene and it was more than they can handle they can get on the radio and they can call for that resource the comments supported weather today to respond to our medic response. All those things are still in play. This is an additional resources to deal with a lower-level type of a call. But all those other resources we have every day. We are still in play all day. This does not remove that Chip Scoggins in terms of the concern about the Opera in the making my Amendment operational. My minor standing is that the systems are already in place to be able to do this. This is not going to create some incredible income brands or deterrence or inability to actually deliver the core functions of Health one in the field know this this would not your Amendment would not do that. I what I think I received from you as you asked us to evaluate where those additional resources could be helpful in the future. I ain't we can do that during the course of the pilot Wright certainly not my intent to impact the operational deployment of help one as you've all proposed it. So I don't actually perceive my Amendment as creating some sort of difficulty and being able to deliver the core services that help when is intended to deliver. These are just In the course of the work of First Responders making observations and requiring the department as part of its intended evaluation in metrics at the end of a pilot to consider this as one of the things that you're evaluating as opposed to creating another layer of bureaucracy or reporting or recording Honor on the individuals who will be on the help one bus and if I may say we are already intending to do a very robust data-collection sweet considerably far beyond what we already do a Ferrari Ms contacts. And so I think of this amendment would be able to be derived from that data collection. They were already planning to do is I don't think it is an additional burden. Is there any further Questions are okay. So I am going to move to amend Council Bill 1 19509 as described Amendment 1 any further discussion all those in favor. Say aye any opposed any abstentions. Okay, so the motion carries and the bill has been amended and I will now move that the committee recommended the city council passed Council Bill one 19509 as amended. Any further comments comfortable? I just want to really thank for her passion for this work and her leadership over the last several years, of course with the assistance of the department. I'm helping drive us to drive us forward towards some solutions of thank you so much. If I see if I may have the thanks of council member bagshawe who has been champion this item for the fire department and the boots on the ground firefighter. And also I would like to thank Mary Durkin for her leadership and guidance in her continued support on this and our Partnerships is is John mentioned. This is all about relationships. We wouldn't be here if we didn't have a strong relationship with the local in order to create something new and do something different to better serve the community and and that's why this is so important in the fire service. We have truly become a part of the American health-care system. When you you look at the entry point to healthcare most hard apartments around this country are directly tied into it. This is another step in that direction to help people. So, thank you. Also want to thank you Chief since you've got sworn in to be the new chief for the fire department. I've been hearing you talk about this particular issue over and over and over again since really want to thank you for your leadership here in conjunction with the local so really appreciate all the work that you all have been doing here. So there's a favor of the passage of the bill as amended vote. I know extensions. Okay, I will recommend that the city council passed Pensacola 19509 as amended and we have to consider that at full Council this on Monday. Thank you so much. Okay, I am at now going to invite those individuals over here to testify as to agenda item to join us at the table while Roxana reads this item into the record. Agenda item to Seattle Police Department emphasis emphasis patrols for breathing in discussion. Thanks Roxana. And then just for purposes of the viewing public and my colleagues at the table given that the delay in our committee presentations today. We are we have decided to allow the folks from Washington State to go ahead and leave and so we have table that discussion on the invitation of paid family medical leave. So we'll go and welcome them back. Hopefully sometime later on this year to respectful of everybody's time including their so I apologize that we are going to have to table that last agenda item, but it was important for us to spend extra time on that public testimony a portion and want to make sure that I don't rush the executive through this presentation either. So, okay. Thank you so much for joining us. I will go ahead and ask each of you to introduce yourselves to us and for the record and then we will go ahead and take it off. Good morning, sister Chief Patrol operations Bureau Seattle Police. Chris Fischer executive director strategic initiatives Seattle Police. I'm going to be a director Department of neighborhoods can Snipes chief administrative officer and solid waste director for sale Public Utilities. How many of you if not all of you were sitting through the public testimony. And through some of the reflections that councilmembers made in response to that public testimony and really appreciate your all's willingness to be really responded to my request to be with us in a committee shortly. So quickly after the announcement was made about the pre-summer emphasis programa and it really look forward to having a good conversation with you all in to learn more about the details of of of the proposal and the program. That's now Add Bean actually utilize within the 7 it neighborhoods want to really clarify for the viewing public that the fact that we're having a committee doesn't deter or prevent or prohibit the Seattle Police Department and the other related agencies from actually deploy free summer emphasis leagues active and the police department do not need legislative authority to pursue this strategy and this program and we're not here to consider any legislation that one way or the other we are here to Simply have a briefing a discussion about the proposal around having a 30 day shred of enhanced proactive policing in 7 discrete neighborhoods throughout the city of Seattle. So I know there's been some confusion about what the Committee hearing is in what are power and authority over the kingdom maybe and I just want to be really honest with folks that it's we are here to have a brief discussion. The department does not lead our legislative authority to purse. This a proposal nor did it ask for it. And in fact in my moving about in these seven different neighborhoods, I have indeed seen increased Presence by officers within the Seattle Police Department. So it just want to make sure that folks understand that that is is the purpose of today's meeting and really appreciate you all being with us. So I can you may have already said this but for the viewing public in the charter, the chief of police is granted deployment Authority for the city of Seattle. The city council has no role in that Department of Correction those decisions and it's for good reason because we are not law enforcement able to ask questions on behalf of our constituents to get a better understanding of exactly how this is going to help neighborhoods and to also fulfill our oversight. What's the city council to make sure that the program isn't going to have harmful unintended consequences either in the short-term or the long-term really look forward to continuing to collaboratively work with all of the agencies at the table today and the mayor's office to continue to again work together to resolve the need and the desire for for increase law enforcement Services across the city not just a 7/8 forehead. So without with that being said, I'm going to hand it over and assistant chief. Are you going to take us off for Amber's and I'll explain and set the context for how the operations will actually be executed. Thank you so much. Thank you Jesus. So again just to be in thank you. Imagine Sharon fellow other council members for having us here today to talk about the way were executing this strategy of a comprehensive City approach in these neighborhoods. I think we're we wanted to start off from was it overall when you look at our report a crime statistics across the city year-to-date so through May 6th. I we are right now in the midst of a transition to a new record management system. It went live yesterday is rin a little bit of a pause on data, but this is through May 6th crime is down overall 12% The only category that is up. What is aggravated assault a message here and how it relates to are going to talk about today is across the city and various neighborhoods. Something is up in some in each of them while overall things are down and it's a very good picture. There are pockets of issues that we are aware of we meet every two weeks has a full Command Staff fall Precinct captains and investigations captains and Support folks from the Department including our external Partners including Public Health in fire in the City attorney and County attorney to go over. What do we see? What are we hearing? So we're constantly assessing what's happening across the city, but overall the story is good on crime, but their issues always to address we can as president hero mentioned we can always do better. I think in all the work that we all do. So the other point there is so that was your dad a 2019 through 2018 when we look at the full complete Year's 2018 vs 2017 2018. There was a 2.3% increase in overall crime generally across the board of the major crime types were up except for arson and larceny-theft the general category was down slightly, but generally everything was up a little bit last year. We dug into that throughout the year. We put out a end-of-year crime report on Republic dashboard that I've got into more detail on each of these and leverage the information that our investigations Bureau had to provide a context to the numbers. But then we also think about the fact that same time. Population grew 2.3% So I'm not 2018 year-end report that we sort of did as a dashboard. We also provided the crime rate which really shows an interest in picture of over the past few years property crime, especially the rate of property crime has gone down person related crime sort of goes up and down but it's generally stayed and they're pretty stable bandwidth as the city has continued to grow that than the rate of crime has stayed fairly consistent, but generally the story is fairly stable over the past two years looking good the beginning of this year, but there are concerns in certain neighborhoods that really drove a lot of the conversation. They're going to have today both historically some neighborhoods. If you go back even further than 17 you see neighborhoods ramping up and we've continued to hear from the neighborhood. To community groups are advisory groups from your offices about concerns in those neighborhoods. Is that that also played into a lot of are we going to talk about today? It wasn't just how are we looking this year? It's are we continuously hearing these issues from some of these places so that we heard during public testimony is that is in a lot of people basically saying these statistics can't be trusted and that it's basically on the statistic saying that these statistics don't square with what I feel when I am moving about my own neighborhood or a different neighborhood. How do we how do how does your the police department handle that criticism and concern and you know, how does this emphasis Patrol in? Ticular address that or not so I'll start with the issue. I think we hear that we're very aware that perception is different than numbers. Those are reported crimes where there was a 911 call or an officer on view and officer arrived the victim or complaint was there and was willing to talk and there was enough evidence to write a report and that led to these official report a crime numbers. So that's why we look at other things to we look at are 9-1-1 calls. So even if something doesn't raise up to be an issue that becomes unofficial a fence report that gets counted in these numbers. We also look at the trends and who's calling for not who where people are calling for what you know, what time of day what neighborhoods what day of the week we look at those Trends to we have a lot of the Seas that discussions are around are creepy locations much like fire. I think together. We really had a really good conversation about how to commute work on this repeat locations. And then we also have support it for the past. How the fifth year the public safety survey with Seattle University doing that in the analysis and the Outreach and a lot of the community meetings where they they pull folks together to get them or qualitative about in the 57 micro community policing neighborhood. What what are people feeling on the ground there told me we've talked about this before and briefings is our whole of formal scales about social cohesion and so and neighborhood disorganization of variety of factors that theoretically play into the likelihood of crime including fear of crime and feelings of safety. We have a customer satisfaction survey that happens when people call 911. We have a random call back four times a year that we've been doing since 2006 and includes both how satisfied are they with the Department in the response, they got overall and with the specific officer, but we also look at how safe do you feel that day and at night in your neighborhood in the city at large and we are we constantly are looking at how those numbers are trending and now we're out right now. We're discussing. Trying to figure out a way to do a more expensive version of that that is a very intensive that random digit call back of a person on the phone and seeing her survey takes a lot of resources and time and there's a lot of interesting Technologies out there that other departments are using to be able to sort of let the community tell you how are they feeling? What are there issues were they volunteered to do it? This isn't me of going out and asking questions. It's them find a way to let the keep the police department know, how are they doing? What other issues that's how we handle this issue of the numbers. Don't tell the whole story you search around certain things a motor vehicle theft and residential burglary and homicide. If you look at those Trends, there's a whole lot of stats you can do about how that supports other Trends. Those are thing almost universally always get reported. Do you want to do your insurance report for your car being stolen if someone is killed someone's aware of it and most of the time people report if someone broke into their house So, I mean there are things we can look at it in terms of numerical Trends and let us know the numbers are probably pretty on point. The most crime is under-reported certain crimes or more consistently reported the overall. I feel pretty confident that the trend the story of the numbers is right. The scale is probably lower but that's the case in every city a lot of crying about 50% of crime depending on the category doesn't get reported to let me know that to which is also disappearing from the public through those other avenues is helping to deal with that consistent themes that have been bubbling to a top and number one theme in last year's report was lack of police presence. The second issue issue was the issue of homelessness and there then another thing that popped up last year was they want to see better coordination between City agencies? So I think that's going to be relevant to where we go soon Paradise repeating it. But I think it merits elevation. Although the overall Citywide crime increase was 2.3% by my math that person crime increase was about 9% Correct until I think that is significant and I think we should recognize that. Because when the community is saying that they don't believe that these stats reflect their but what they believe their perceptions bearing that very real increase into a larger over overall crime increased. I think further accelerate sort of Mistress of the data so I think it's really important to highlight that that that is social media platforms called and no post that on a social media platform and it gets people spun up so they speak so we hear about it face-to-face we get to the input via email or through 911 about various issues that also helps kind of get people upset one will be very quick to dismiss perceptions is just being perceptions. And and if it's not supported by real data and real crime statistics, then we need we should just move move along and deal with the real crime data. Then there's the opposite perspective of you know, my perception is reflected is reflective of an experience that I may have. Personally had where I was the victim of a crime or the witness of a crime or where I know somebody who's very close to me who was also a victim of a person crime or a property crime. And so for me the perception is actually all the data and the statistics. I need to be able to understand that this is an issue in our city because it may not be something that had impacted me five years ago or 4 years ago or 3 years ago, but but now it is and I just want to be really cognizant of the fact that those are I would say two different spectrums and I think it's important for us to not be immediately dismissive of one perspective over the other in terms of how people experience issues related to crime and disorder within are within our city. And and so I think that while I understand people have sex This isn't about the data. I also want to make sure that I signal and say that the data is actually authentic and validated and statistically representative of those crimes that are reported and we should have trust and faith in the police department who is actually receiving this data and information and processing it that they are accurately recording out those crimes and trends that are reported for purposes of shepherding certain law enforcement resources in a certain manner to addresses of those Trends and concerns but that doesn't mean that we do that at the expense of appreciating that there are neighborhoods and in my experience. I have worked a lot with members in the South Park Community who continue to say that the numbers don't reflect what they're experiencing everyday and in those Arab that's an extremely diverse community. Community that experiences a lot of poverty and lack of access to opportunity. And so I appreciate sort of that. There can be a disconnect of that and that one doesn't Trump the other, what I'm saying is something slightly different, although I definitely appreciate that. I still wasn't trying to build on what you were saying or lose the thread that I think as it relates to person crime the perceptions actually managed match the data absolutely free walking around saying I feel less safe percent increase in person crime supports that absolutely I feel like if we bury that 9% number in a high-level number that says 2.3% We are actually encouraging members of the public to mistrust our data. So I think we we need to acknowledge where there have been significant increases into a publicly not all crimes are the same and I certainly wasn't making remarks to Discount the Highlight that you were make I think that's absolutely absolutely true and some categories that we see in this presentation. And then I'm sure that the department is happy to come back and talk to us more about we have seen an increase in that has contributed to perception the reality of an increase of particular types of crimes before data-driven Solutions are desired for crafting public policy. If you look at the property crime, which we seen a lot of coverage lately of you know incidence of arson and zef arsons have decreased from 2017 to 2018 Larson Larson help me song 2018 the overall property crime bucket if we're looking at this subdivision has increased by 1.57% So I think it is important for us. Kanai's yes, there has been an overall increase in crime and that is no doubt something that I know you and she's best have been absolutely looking into I want to reiterate something I said earlier today that is in my three conversations with cheapest over the last a month and a half or so part of what she has continued to reiterate is that every officer absolutely has the tools and the authority to pursue pursue crimes and that includes theft and larceny larceny and burglary that don't you arrest someone or pursue someone simply for sleeping outside to reiterate issues of selling drugs stealing lighting dumpsters or RVs on fire. All of these are things that your officers still have the ability to go after but it is I think important for us to know that in the property crime section, which has gotten a lot of at 10 Is 1.5% increase I wanted to follow up on one additional, that you may need to just double-check Howdy's numbers overlap with where we're going to see increased Patrol presents and potentially arrest if this data is not the only day that you're looking at and as you mentioned you're looking at trends for who calls or where people are calling from then I think we also have another analysis that needs to be done. Who is most comfortable calling the police, where are those situations? And and in what situations are individuals calling for if the individual that they're calling about is not actually committing a crime how has that affected whether or not you're increasing Patrols in that area? Because I know that there are certain neighborhoods that are certain calls are coming, but they're not actually crime-related calls. And so are your neighborhood's aligning with where you're getting the most calls or are your neighborhood patrols now aligning with where we're actually seeing over. Will go into more detail council member but this was a combination of a whole lot of this isn't this wasn't just a police identified neighborhood Zorba's also as well senior. There are other things that we're hearing from some of these communities about other issues that aren't criminal in nature. So it wasn't just police day. We wanted to start this out from the chairs questions and some other issues with sort of this high-level. This is where the city stands on crime will dig into what we saw in the neighborhoods that were selected but we look at a ride variety of things. I didnt attempted to clean it up in my comment, but I will do it again for a variety of reasons. We don't have the who calls. I think I'm not going to put the statistics. I don't remember it off my head but it's a very low percent where we have any demographics on who the caller is. We know the where the call came from but sort of the who's calling that we don't have but yeah, this is a combination we started out with the crime just because I think people Focus that this was a policing thing because there's a lot of weed we have a lot of the resources but this is a comprehensive and so other information was factored in which we'll get into Okay, I'll talk about emphasis Patrols in general. So I've been with the Department almost 25 years. And even before I came on Department emphasis emphasis patrols are one of the strategies that we used to go directly at crime spikes or problem locations emphasis. If this is trolls can be comprised of on duty resources being directed to spend more time in a particular problem location. So you could say we take away some of the officer's discretion to randomly Patrol and we say here we want you in this block or are these blocks because the data saying we have a problem here? Or we can do a combination like this effort will be between on duty resources being redirected to certain areas. And the emphasis being supplemented with officers on overtime. So it's a combination of both. It's not all overtime is not all on-duty the on-duty folks will be directed to patrol in those areas between calls for service. The overtime officers will also be patrolling in those areas, but they will be a little more think I'll have more leeway to stay put be out on foot connect with folks on the street and business owners and community members. What I wanted to add to is emphasis patrols aren't new. We have ceased at every two weeks and in she's that we have a multitude of the partners at the table from different city departments as well as service providers and other people in the audience from our oversight Partners here with the Seattle Police Department, and we talked about emphasis patrols. We talked about the fact if you implement an emphasis Patrol Miss successful, you might want to do more if it's not successful and it and do something else. So I encourage my precinct commanders to try to be Innovative and adjust when needed one of things I want to point out to the council is the and I just kind of get right to the point here is what's different about this cheap ass is always said a lot of what's happened. Now, we are asking our young officers to do so much more. It's a multidisciplinary approach to a lot of the problems are officers many times go to cause and I know you get these calls sometimes from constituents that said officer said their hands were tied when I took over Patrol. I made it very clear your hands are not tied but we need to do a better job of educating you about. What's not under our purview and direct the person to your right Department this emphasis program. What's different here is we're marrying up other City help with police in these neighborhoods. We actually have other emphasis patrols active right now. In other parts of the city Southeast Seattle is a street robbery emphasis that's been going for quite some time and actually since the first of the year, we've had emphasis going Soto in Pioneer Square in Fremont. There is also ramping up we're going into Alki with the warmer weather and then also whilst Winning Golden Garden. So patrols are nothing new the only thing here we're taking the multidisciplinary approach in these particular neighborhoods because a lot of times when we go out the police department being the most visible arm of the government people come to us to talk about street lights potholes and things that are not under our purview opportunity provided a great segue. Although the Alki summer emphasis to troll is not part of this discussion. I really appreciate you highlighting the direction that you give to officers to not continue this narrative that somehow the council has tied hands yesterday. I spoke to a constituent in the Alki neighborhood has been working the issue of noise enforcement for many many years work with me to help the council change the law and this constituent just spoke to an officer about how noisy it was last week. And that officer told her it's the city council's fault that SPD doesn't enforce a noise ordinance despite the fact that we may change specifically to respond to your feedback to us. I'm about how to improve the loss of that you could better enforce it. So that officers are still giving members of the party's at that time, but it's definitely education. Peace and I think during this this program not to get off too far in the rabbit hole here is what I would like to see as we're out the officers will we're going to teach our officers what department handles which issue and also we can still act as ambassadors while we're out on foot Beach to try to direct folks the find it fix it app officers also have cell phones. Maybe we can get for the information for Community member if they don't have that technology available and we will make those referrals to the other departments. I'm so sorry. I am so grateful that you brought this house council member her about the number of times. I hear from constituents downtown that they talked to officers and the officer say our hands are tied if we can do away with that. That would be the single most important thing. He could do it this table letter officers know that they do have the authority to make decisions and be responsive and I really appreciate what you're saying about offer than the find it fix it app. But I think it's a big deal and I don't want under play it and I definitely don't want it to dismiss it people are frustrated that they think their officers are like just not visible or they don't feel like they do have the power or the backing from you. They have the backing from us. We want them to do their jobs. And if there's a problem, I wish you'd come to and tell me specifically I have had multiple conversations with the chief about the subjects and with Captain Precinct captains. Around this issue as well and with constituents and I also want to really be clear that it is not just something I want officers to do. It is my expectation as a council member that officer is when they show up to work everyday showed up to do the thing that they said that they wanted to do when they went to Academy which is enforce the laws of the state of Washington in the city of Seattle. I also expect them to do that in a way that is constitutional and fair and an equitable to the people that are coming in contact with so we're not just going to do Dragnet sweeps of people into our criminal justice system for the sake of satisfying individuals who feel like that's the only two left in our toolbox to address some of the living the living concerns that are being identified, but I do want to Echo my expectation Officers will will continue to do the jobs that they were hired to do and that and I believe that the city council has taken many steps in the last 3 years to advance in some instances legislation without controversy with no with fair amount of controversy leave Advance legislation because we believe in the ability of providing rank-and-file police officers and their supervisors the ability to fulfill their Mandate of delivering law enforcement Public Safety Services to neighborhoods across the city of Seattle and I believe that we continue to work together on sort of what is that look like and it is and how can we continue to work together to make sure that those services are delivered in the fair Appleway not just for the people living in communities, but also for the officers who were asking to step into sometimes dangerous situation, so I appreciate comfortable bringing that point up. Again, I know she and I have a lot of conversations about this as well and our ongoing concern about wanting to correct the record on our behalf that that that is not what are in ten toes. And in fact, that's exactly part of what is motivating me to have this briefing today is wanting to have that transparent sharing of information. So you can hear directly from us for service. What is arcore deliverable and its law enforcement for us and I think this plan helps take some of the pressure off our young officers and these neighborhoods because often we are called to situations that aren't quite enforcement situation could be social service or some other department that could actually help with that situation. I think that's where some of this frustration is with the officers. They just want to do their jobs, but it's on me. The rest of them has to have to educate them and give them the tools they need to be successful. Whatever else to the other departments that needs to be handled. Part of the deployment will be increased bicycle presents. So we will redistribute our bicycle officers in particular neighborhoods that are listed here to be more visible. We want footbeat officers out of the community police team officers really make a difference with their presents. We're not looking to have a Dragnet we will addressed any crime at we see we're not looking for any coldest. There's there's no stipulation on a particular type of arrest be made. We want to just be present be on scene to prevent crying from a crane and also be more accessible to the communities it so we can have more conversations about what they think will help but it's it's been proven in pass. Once you increase visibility. Those numbers will start to move down work experience. Comment you just made that if if you see crime your officers are going to take actions. So appreciate the desire to have voluntary compliance of the ways that there was good. So what what are can you just talk a little bit more about the type of activities that we can see our officers will be engaged and I'm either going to be doing social contacts IE. Terry stops. Are they going to be through sort of an officer? And we are at on 3rd Avenue between Pike and pine. What am I actually being trained to and instructed to do as part of this program who's interested in you say that sold our deployments kind of change when I came on it was all about get out there and make a lot of contacts bring back proof you in for some kind of law. That's not Did the point model we're going into we want officers to be on the street to be eyes and ears of the community. We also want to make contact with folks before there is an enforcement situation. So that means actually I'll bring up lead our social contact referrals far outnumber our arrest diversion referrals. So these are officers that are in their neighborhoods near come across folks that might be in a situation. They've been in trouble before they're vulnerable and also doesn't make those referrals so we can do that. There's also the mobile crisis team Mark are we have our own unit where the officer and a mental health professional ride together. So if we can see somebody on the corner that's in crisis or might not be a threat to themselves or someone else yet. My contact try to direct them to some type of services. I appreciate that. And it I think it's still the question Still Remains my mind and I'd like to hear you address it is whether you expect that there will be some arrests as a result in an increased police presence in a particular neighborhood that possibly also increases we have a lot of folks out there that officers no on-site who will maybe be on probation and if they're in a certain area of violating that probation officers know folks that are where you can before they make contact with them. They know a person they can check your name and know whether or not they have a warrant. We are definitely going to take action on any predatory drug-dealing assaults or violent Behavior just so I can try to bring the things down. Your accountability legislations pretty robust. The settlement agreements pretty robust. We track everything if it if we not having a conversation about the Seahawks and it's enough for Smith or Terry stop or anything. That would we track it as you know, we audit the Terry stops, the bias reviews come directly to me and then I'm audited by Andrew myerberg and he's audited by officers office of Inspector General. So we are constantly monitoring any abnormalities that might be occurring not just these so we want to make sure that we will review reporting up through the except executive on a weekly basis. What kind of activity we have out there. We want to dress low-level violations with warnings and Doc meet those but also we will in the areas if there's drug issues we want to make referrals first of all, and if we find out there's something Going on like a prolific dealer in the area. We're going to go after that person and as it relates to that might be made in these Geographic areas in one of the concerns that we hear from multiple different sources is that there are including the police department that there are there's work done to undergo an arrest a criminal investigation and then a referral to a Prosecuting Authority either the city attorney's office or the King County prosecuting attorney's office depending on the class of crime that the individual has been arrested for has their General concerned that there is a lack of follow-through in some instances for some of those referrals that are made by the Seattle Police Department by those paws. Meaning of word, he's has the department coordinated and had conversations with the city attorney's office and her King County prosecuting attorney's office related to referral is made by this program in particular and by referrals, I mean arrests that have been made in conjunction with the increased emphasis in this particular King County Prosecuting Attorney supervisor for filing unit about 2 weeks ago. I have an appointment today with Kelly Harris Seattle City attorney's office. I met with them to give him a heads-up you might see an increase in cases. Also, there's been a lot of discussions around chronic offenders and it is quite clear. We have the opinion that there's no hardcore blanket. We're just going to scoop everyone up if we have a chronic offender. Who is causing a problem in the community? We will call ahead and say we have this person. This is a situation. So it's on a case-by-case basis to bring attention to someone that's a chronic offender. They are aware that we're going to have this emphasis going and they'll be constant dialogue back and forth if there's any problems. can Prosecco Couple weeks ago we heard from representatives from lead regarding just the expansion of lead in the U District. We know from data with regards to crimes in the U District that it's higher than to the neighborhood or Seattle that were selected. So I'm curious to know why just from if the expansion of lead is is being included to include the u-district why the u-district himself was not included in the answers Patrols. So right now there was a decision made for number factors of Based on data and Community input to go with a limited number of neighborhoods to involve the other City departments right away historically for the police department. We have done emphasis on you way. And I'm not saying we want is probably likely with the warmer weather. So but in this program, we're going with these 7 neighborhoods first because we ate we have only so much bandwidth with our partners, and I know some of our Other City departments don't operate 24/7 365 like we do so we can loot wear them more agile, but we want to start with seven neighborhoods with the other departments. Okay, and then before I move all this slide cuz you are the last couple of bullet points are connected people with services. So specifically named reach here and I appreciate customer Pacheco bringing up lead in the U District 2 context in particular one of the questions that I asked in my letter was to not just to also help us understand what kind of efforts are being made in the seven different neighborhoods. What kind of efforts are going to be made by the police department and other to coordinate referrals to lead because I'm hearing from you Chief the first priority order. The first course of action is to identify those who may be appropriate for diversion and at want to be cognizant of the fact that it has limited capacity as well. And so would like to hear a little bit more from you about Coordination. So the good news is our officers have completely bought into the program and referrals have exploded over the years. However, I don't want to speak for garden Turn Mowers, but we have asked that they prioritize the rest of versions of course, and then the social contacts will come after that. And then there is also the weekly work group meetings at our officers participate in and those discussions are had their own how to prioritize referrals. I've sat in those they're there their they're very thoughtful and they go through the list of individuals to try to prioritize and some more kind of put on the back-burner if there is shoes aren't as a cute. I don't want to speak for Andrea. He has it some input here on Outreach if we can get her to talk about some of the other efforts. I think we heard in both for the common and then some of your comments council members around a lot of specific feedback that the event staff is hearing day after day around coordination of City Investments and services. And so although we've talked a lot about SPD here. There are Constant Comment around s. S p u City Light HST of how they're coming together and when working cross kind of silos as we know it and how do we really take a look at the neighborhood or the community-based approach to leverage and coordinate Investments? So for. I hear there's really an opportunity to take that descale in the 7 areas that we've identified here. It's also Great opera. You've noted here are some of the work that we've been doing in South Park and leveraging both in South Park in Georgetown some of the public safety task forces and some of those issues and how do we take it to the next step there to show. Implementation? So I want to turn it over to S. NSP you to talk about some of their Investments and then kind of come back around at some of the ongoing Community engagement aspects if that's okay. Yes, but I believe cancer number herbold has a question that might have been related to the last lied, but it's the last time but it is a police related question before I asked the question. I do you want to thank Department of neighborhoods for the coordination role that they have been doing over the last couple years in South Park in order to implement the community recommendations in the council and executive funding for those recommendations across a whole line of things the funding for the the crime prevention coordinator the funding for huge number of life. Improvements that are just so so valuable for that Community funding for pedestrian safety improvements the South Park Community has been very very thoughtful about their vision for Public Safety on to include these other elements and the role that department neighborhoods his play to coordinate. All of that has been completely invaluable. So if we're going to see that replicate and some of the other neighborhoods, that's fantastic as it relates specifically to the police thing question again for Southpark, I am a huge fan of bike patrols always have then again. I think it's just a really effective way to be present in the in the community not in the car but out there but covering a lot of ground and I think visibility is a really really useful tool for brunch, right? I do have some experience with how bike patrols have worked in South Park in the past, and I'm just wondering how Racially that's going to work given at Southpark is so removed from the southwest Precinct. There's a huge challenge or the officers to get from Southwest Precinct down to South Park. They put their cars bikes in the cars and they drive down the hill in the neighborhood. I'm just wondering how we're going to learn from. Are you supposed to close in the past to make sure that they're your officers you have more time and I'm over with the South Precinct trying to get the bikes over into Soto and Georgetown, but we have to load the bikes up and get them down. And that's the expectation that make it happen will be supplementing Services down there with a regular bike Patrol and Community Police team anti-crime team and they are cross-trained so You're even if they're not in the bike team, they can get suited up and bike gear and get a bike and go down. So we'll make sure we'll have a constant presence there. It might not so one thing. I need to clarify butter emphasis patrols. They are not 24/7 365. They're based upon time of day day a week when we see the most complaints or issues. And so they'll be some play in there when you see the officers up staff in certain areas. So I just want to make that clear of hours in a day. Do you think that officers will be deployed for emphasis Patrol in in these individual neighborhood Barre Southpark? I believe the plan from the answer you offline. Also, it's not as many hours as some of the bigger areas. To the fact that we look at the data some of the areas are very active at night or squares active 24/7. So they'll be a lot of hours put in their most neighborhoods. It'll mostly the early morning into the evening just generally it would be some of the questions I asked in my letter was were related to overtime in particular and that is not covered in the slide back as I see it, but I I have been doing a lot of work on the council since I was elected in 2015 around the issues of overtime and continue to I want to see the information specific to the overtime associated with this this particular strategy. I recognize that there is something That the police department uses in a variety of different circumstances throughout the year depending on the needs but I am particularly interested in understanding with the fiscal impact is of this particular 30 day program in these seven neighborhoods in addition to the information about the number of hours that we're dedicated to the various neighborhoods to address these particular concerns that you all have a describe. I just continue to think that's a really important part of transparency and accountability to taxpayers who not only want us to give these services but have an expectation that we are also keeping a close eye on how those resources are being deployed and making sure that those resources are used in an equitable and fair way across the understood if I if I can we can continue to two. Turn over test. Reminder 1 this morning and one a little bit later today and there's already some cross-departmental improvements. They're taking place at your service and capital agencies is pleased to be able to participate in this coordinated effort with the other City departments, as you know, as that plays a key role in the public right away and what are residency everyday as their public spaces which they want to feel safe in and feel are well-maintained as some of the basic functions that we provide our pothole repair vegetation maintenance alley flushing in street sweeping, which is a very successful partnership with Seattle Public Utilities as I heard on one of the walks yesterday in the community residents are concerned about feeling safe when they're walking biking and driving and very congested streets and and tight intersections out. We also depend on residents and businesses. To let us know where there are service needs either through find it fix it or through 684 Road out. We're out in the community constantly, but we can't be everywhere every minute just yesterday on one of the walks. We saw an ally with a very deteriorated condition, and we were able right then to dispatch some of our cruise out to quickly kill some potholes round a storm drain as part of this pre-summer emphasis were coordinating some of the work that we do throughout the year, like repainting crosswalks trimming back overgrown trees to make signs more visible and doing Kiki sidewalk repairs in conjunction with our partner agencies in targeted areas. The city's various agencies. We work regularly together in this manner on projects in the right away, and we're really hopeful that this coordination effort will really be helpful before we get into the warmer months of Summer. Thanks. Sure thing for spu. We have a number of programs and I'm already at play in many of these neighborhoods and we had a conversation Chief Greening out yesterday about the fact that I was different about this action is that we'll be able to align those services so that his officers. Do you have someone to turn to when they're asked questions about litter for example, replied or illegal dumping in those kinds of things that fall under our purview wheat? We do know that litter has plays a major part and how people feel about their community. And so we we are very mindful of that and and we know we've established quite a few programs here recently to help combat some of that a couple that I would mention or we have a trash pilot. I think you guys are up to email you with that has been a very successful. I program we established a needles and Sharps program at the collections. I program as well, which is also an extremely successful. Program eyes actually become a benchmark program. We've consulted recently for the City of New York Phoenix and a couple other cities as well on how we run and manage that program to very successful levels. Asthma herbel, really appreciate the work that you've done as it relates specifically to the trash pilot. I have made inquiries with a chest as it relates to the navigation teamwork and whether or not there are barriers from the operational side on the hsd side another conversation. I Know It with SQ to expanding that pilot beyond the nine locations that currently I would I would like to say that I would like to see navigation team members actually delivering those bags to Maurice Moore locations encouraging people to use the bags so that you guys can pick them up and I want to find out more up from again from the HS decide if they're operational barriers to doing that because I think picking up the garbage is incredibly important to mitigate some of the public health threats that comes with Moscato was talking about earlier times today. We talked a little bit about the collection of garbage by ASP you and based on information that they say they receive from spu the encampment cleanups or resulting in much smaller amount of garbage being picked up going from 6.4 million pounds in 2017 to even though I were only a little ways into the air compared compared to a full year last year would say 2.23 million pounds. I was wondering if you could explain a little bit about the huge disparity there because again, the thing I hear most about is less about the presence of people in tents and more about the garbage. So yesterday the answer to that is as you remember early on when we really started to separate in Earnest with the Cantonment work. We were dealing with and can't miss with really large structures. Sometimes two-story wooden structures garbage that have been stockpiled overtime in a lot of enchantments for it and difficult-to-access areas. And so those areas hadn't been cleaned it. So the volumes at the end of those encampments at that time was just significant and in contrast to what we see today largely in part, you know, what is the success again of the trash pilot which we saw Improve by 106% So in 2017 with that Pilot We went from about 240,000 pounds of garbage removed in last year was born in 90000 pounds of garbage remove to that typically for the the pilot the back pilot. I mean, it looks like giving that in 2017 you removed 6.4 million pounds of garbage and there's less work to be done in these very very large encampments. But yet we know that at any given time there's about four hundred distinct unique encampment locations in the complaint database. It looks to me like the ability to address the operational questions I have with the navi navigation team. You have the you have the capacity to do more cuz you've done more I can't answer that question fully today. But I think we could do more. It's just a matter of the tendering and Camus of change from a garbage perspective. It's just you know, what time it's just less garbage there now compared to what we saw before it again. A lot of those were because we were dealing with structures oftentimes bringing in heavy equipment to remove a lot of that material and not seeing those types of activities right now as it relates just to put a bow on this line of questioning. At least. I think it's I think it's a bow, I think as it relates to this particular program in particular because it is a multidisciplinary team approach. I think it would be important for spu and asked to identify what are the things that that you two as agencies have done in the context of this multidisciplinary team effort. So I don't want to lose sight of the the details of the work that you're actually going to accomplish as a result of this multidisciplinary emphasis strategy and so would would request that you document exactly the things that you are accomplishing as part and parcel of this effort into Des Moines is going to help in working with the mayor's office to help track that with the Department says we look at ten of the comprehensive need of communities in neighborhoods, even though we know this is an intensive 30-day effort and you know, it says up here may continue dependent on operational needs for us. It's a really great opportunity to really take a look at the the City Community feedback loop in terms of what we're hearing from community and how our address and Howard communicating back terms of the scale of what we are doing and so we're going to use this as an opportunity to Cuz I resolidify in some cases in some cases expand that communication with Community. We're working in an audience. Here is Catherine supernap went with FAS and CSP with find it fix it specifically in with CSP to see how do we take what we're doing and then going to take it to scale a little bit. Cancel utilities Committee hearing but you know this this this program that were talking about has been characterized in many ways. And one of the ways that has been characterized is that we're going to clean up some of these neighborhoods as sort of additional layer response to the feeling that members in these neighborhoods have about the lack of safety in in those neighborhoods. And so I do think it's it's important to focus on on some of these more granular details around the amount of trash that we see in in a lot of these neighborhoods. Thank you. I'm just actually I just one other question I have as it relates to the work that spu has been doing with SPD really I think helpful program the RV remediation program. I appreciate the approached again, you're focusing on addressing the public health impacts. Where are these are located in the same place for very very long. Of time. It's less of an emphasis on you know, impounding peoples are bees more of an emphasis on remediation remediating again that the health impacts around the area. But as we know we're only doing 7 locations a month we were doing only six the council passed a little bit of additional money in the budget to get you up to 7, and I'm just wondering is are we going to see those seven focused? Exclusively in these seven neighborhoods or are we going to because what you're doing now is right is your assessing the RV locations throughout the city. And so and you're in your in your focus is is doing those the work for those seven remediation that you do every month on the areas that most desperately need the help. And so I'm just I don't want in our emphasis. I don't want other neighborhoods who might have big problems with RVs to kind of lose out if we're if we're still only doing 7, and now we're focusing on doing seven in the seven neighborhoods that we've identified the RV program. We haven't discussed it outside of here, but it's supposed to stay as is so that program flexes as you know, because RVs do move in so that the design of that program was to meet the need wherever it is we could have an overlap with Communities in this in this effort, but I'm the intent is not to remove the efforts that I'm going with the RV pilot to move them over to this effort. Although they could over that I come in so I got to say I've been so impressed by SP used RV pilot it is they are so organized and they collect data that informs kind of what we're doing the data that I see that's coming from spu says most of their cleanups have been in the Solar neighborhood, which is one of the identify neighborhoods. There is a protocol scoring protocol that's involved there. Where were they get input from the police department parking enforcement other agencies that bumper side up or down on that list. It's the same thing with hsd navigation team. So I think I said before we have not made any request rewire those protocols because I think those protocols were put in place to eat for fairness and equity for everyone across the city, so I don't think Be to our benefit to kind of rewire that just for this program. Okay. So next in the presentation agenda was to sort of go through the the neighborhoods and we did just want to start off with the one of the key messaging points here to make sure everyone understands how this is going to play out is why this election was based on as we mentioned earlier. You have a collection of information where we hearing from. Where is the police department hearing from the community? What are we hearing from her officers? What are other City departments hearing? What are we hearing in neighborhood walks? Both before and is part of this where this goes. The rest of the month is going to be a lot neighborhood driven does a Genesee mentioned yesterday. They saw Sally Ride on the walk and that was that's the idea here. We we use the data and the information the feedback we had from officials are the administrative data and other interactions with the community but a lot of those what happens and how it happens and where work is prioritize is going to be driven by what's heard in these walks and just continued engagement as chief. He mentioned as officers are walking down the street shaking hands of business owners are going to hear what the issues are. So they'll know a lot of this is not coming in with over fixing that that net. We're really looking for the community to help do that feedback and what are their priorities and and how can we all work together to do that? Yesterday was the South Ballard and Justice were to tell the story is this place nicely on the computer or a little blurry up top? But so South Ballard is one of her my crew community policing plans. The map is is that boundary that the the hotspot the colors are just is at his Police Department data show me where the concentration of report a crime is with in that neighborhood. So just where the most busy locations if you could see as you can see on this map are these are along through Affairs a lot of times you're associated with shopping center areas where there might be an elevated rates of car prowl or other sort of shoplifting other information. And so generally what we saw when we were starting to figure out when we were hearing but since he's sad and a neighborhood walks and emails the chief receives and things we hear from my council member O'Brien's office was South Ballard was continuing to feel that there was a lot going on when we look at the data 2018 saw an increase over 2017 so far in 2019, we've made some good progress, but knowing that this is definitely a neighborhood that is the weather gets nicer people are out. It's very active very great for walking the street having lunch at about of the restaurants hanging out in the park, but we know that increases activity as we really wanted that was how from the police department perspective it made sense for. This is a place where we wanted to sort of hold the ground. We were winning and it made sense. Then also looking at the csb information and talking with her partner's they get a lot of complaints and ask for assistance through the various Community Systems for find it fix it and csb in this area. And so that was sort of the story with South Ballard and why that's one of the focus areas. Cast member of that show thank you Chris. I'm a little astonished you when we we focus on South Ballard 11% increase in crime and earlier. We were talking about statistics and people serve disbelieving them 11% pretty big jump and we've been hearing from Mike Stewart and others one thing. I don't see here is your discussion about shoplifting businesses have said to us just repeatedly that they see some Smash and grabs jumping and stealing whatever running outside with it turning around the corner selling it for $0.04 on the dollar. Can you talk a little bit to me about what's going on with shoplifting not included here. Was that part of the 11% What what do you thinking because obviously if larceny-theft is going up here and Ballard but its overall and Citywide is coming down. That means the ballards taking a pretty big hit. So it is included in that 11% that's overall crime. I could get the specific. We didn't want to make this a huge data presentation. So we could have done that call out for every neighborhood. But we do know any other specific locations that are specific stores that come up when we talk about repeat locations and see sad that they're frequently walking out with stuff to shoplift or a commercial robbery. If a store security has physical interaction with the person who's been successfully steals the item so those are that's what we've seen an increase in a lot of these commercial density areas where we are seeing either the shoplift or a becomes a commercial robbery because security intervenes trying to prevent the shoplift. We have seen some of those increases which is a lot of folks working with those store owners and security teams about how to do this sceptered crime prevention through environmental design. Maybe don't have the highly desirable item right next to the door. I'm just ways you can do store design and other tactics so that you can decrease the likelihood of someone stealing from your store. That's one of the responses. And about of that is the education is is knowing the folks to talk to you knowing the security officers cuz the officers walk the sidewalk and say Hey, you know, we're here we go everyday. Thank you. I would just say that I think that's a great Point council member bags all that you're bringing up and highlighting. I think that's been the appreciate understanding of the city Citywide State of Affairs as it relates to crime rates at the danger of just looking at it from a Citywide perspective is that there are certainly neighborhoods throughout the city that have very very very low crime rates that impact those numbers because of server the lopsidedness rights or neighborhoods have much more time of the neighborhoods have almost none. And so the city-wide statistics give us a sense of how we're doing Citywide, but it isn't a good lens to use as we think about specific hot spots within specific neighborhoods because it's not completely accurate reflection of what's happening in discrete parts of the sea. That's exactly why we have the maker Community plans cuz I think a lot of a jurisdictions run the country primarily made focus on their Precinct and discuss the nature of our city our precincts. Even our smallest one is pretty large a new be hard to operationally deploy that way and we have functional Geographic organization below that or sectors in her beats neighborhood perspective has really been a huge asset for the department and understanding to be able to work with other City departments who weren't aligned to are beets in our sectors that it allows for this collaboration for when we talk about South Ballard. We all are sort of talking about the same thing. We know what the issues are. So I think we're totally aware of we got to be aware of what's going on in every neighborhood in the city and we were only look at it. That way if I can just follow up on Chief grilling what you mentioned earlier about having the officers visible on the street whether they're on bikes or whether they're on foot patrol that matters so much to All of us but business is tell me having your visit your visible officers come in and say hello and shake hands with the manager and people recognize that were out there and doing what we can and what you were saying. I'm under his about the neighborhood Outreach as well. This is making such a huge difference in can cleaning up the garbage what I hear from friends and Ballard in particular is it they just so respect the fact that were they are visible cleaning it up making it feel better. Even if it's going up 11% It is the fact that it looks better that matters a lot. Of course with us. The work you're doing about Bush trimming on sidewalks and getting neighbors to do that that's making a difference to so I'm very appreciative of your efforts and know we need to do more of course, but I think we're on the right track that's making people feel or responding were listening and responding. Okay. I know he's got several more slides to go through and I just want to acknowledge that these slides are designed to respond to one of my questions around her. How are these neighborhoods chosen? So I appreciate the additional data around around the Y. So, let's go ahead and go through these as quickly as we can cuz I'm cognizant of the fact that are supposed to be in that Labor Relations policy late for so maybe if we can wrap up in about 10 minutes, that would be helpful. Thank you. All so next was Fremont. These are in no particular order. They might actually started be a geographical from top to bottom and I think that's how it plays out. But Fremont lasted from 18 to 17 had a 52% increase in it and their overall crime that we were this was something that apartment was acutely aware of their was Surgeon activity around the trolls Knoll the free for the Aurora Bridge Park right there. As soon as I constantly remind tri-fest correlation is not causation. There was a large encampment of mini mini mini tents in that area just an elevated number of people and activity in the neighborhood. And so we worked throughout the year to address some of the issues and have again much like Valor the start of 19. We're seeing the numbers go in the right direction, but again was specially lower free mine in the commercial District again where you see some of these the red spots the density Oregon this commercial areas with a lot of restaurants and bars and shopping centers where there is a lot of activity and we just want to make sure that we again hold the the progress we've made so far in 2019, and we also saw and talked to my first city Partners if it has one of the Fremont has I think it's not the highest the highest number of graffiti reports in the csb. System and so a lot of work sort of to be done environmentally and from of policing perspective of just Outreach you a lot of this is based on there were very aware of the research that having officers, especially soft quote-unquote not doing enforcement just doing exactly what this is designed to do being out there shaking hands being present communicating with folks act does have a significant effect on crime and specifically on disorder street level crime. It doesn't have to result in enforcement to have that effect. There's a significant body of research the talks of that. So that's exactly what the issues were seeing how it ties into the issues that the other departments are seen at did admit it makes sense in these neighborhoods in Fremont is one of those Pioneer Square now that council member backshots left the Neighborhood Activity we've had was excellent and not so excellent years in the past probably five years a different sort of changes have happened in the neighborhood last year. There was a 28% increase compared to 2017 this year. There's also been an uptick in some shots fired. So it's a very busy neighborhood. It's always one of those were for if we're going to be too plain extra resources. It's hard for Pioneer Square to not be in that conversation. It's important for the city. It's important for tourism industry the business owners the people who live there and work there it's in so it inevitably is one of our busy or communities and gets a lot of attention and it just made sense in looking at this in the trends. We were seen and also a lot of I don't know if any of the partners going to talk about what they hear from Pioneer Square beyond the csb stuff, but I know A lot of infrastructure work constantly going on in one of our oldest neighborhoods as well. Yeah, I think we're in conversations customer back Charles around some of the even vacant buildings in some of the activity that happened to her and Punnett squares were acutely aware conversations with the alliance for Pioneer Square residents Council and other partners. Can I just quickly add soap for Pioneer Square and Ballard? We were there last year and we've been emphasizing in those two areas first of the year. So the budget breakdown that you'll get from our staff to Central staff will have the breakdown of where we've been prior to this but the difference is after May 2nd. We have the other departments. I I do want to give a shout out to S. It is an example last year in front of the Chief Sealth Club Chief Seattle Club, there were some planters there and we got numerous complaints of drug-dealing fights people standing in a bike lane. So I reached out to miss Adkins. They figured out another option remove the planners and their situation disappeared. I think that was much more effective than simple than doing undercover by Bust or other large operations. That will net what so that's just an example of how we can work together how we can modify the built environment as well as a longer-term strategy to really disrupt negative behavior that is placed based is geographic and nature. I certainly have a lot of interest. Is it as we talked about a Third Avenue in particular about how we can radically transform the environment there with some hopefully additional Investments that will actually create that same level of opportunity to invite more positive behavior on those four corners and happy to talk to you all about that offline. And speaking of Madame Sherri in this particular pilot program is really the pike-pine 3rd Avenue Coral where you see most of those red spots. I think of any folks if you asked aware of the neighborhood, especially any of the bike officers are in the office if they would they would know without even having to zoom into the street, but those spots are it's the the larger commercial establishments a game where there's a lot of a theft or a theft that turns into commercial robbery overall actually crime is down in the downtown commercial Corridor at including if you drill down even further into the pike-pine area, but we haven't seen an uptick in some aggravated assaults of probably generally around sword more of the nightlife activity and some individuals in crisis. So and it's also just it's a busy area it's again, If you zoomed out on we're all of our hot spots are in made it Citywide it would be in downtown commercial is the concentration of individuals especially during the daytime a lot of interaction amongst people a lot of commercial establishments in restaurants. There's just a lot of activity again a place where especially in this Corridor if we're going to look to address the the prime numbers perception of fear of crime and just general experience of the populist with the city. It's hard not to put resources here. And we do see a lot of also downtown area csb complaints. So that's the pipeline in this particular area. We tried emphasis Patrols in the past. The version of that was referred to as the nine and a half block strategy. And while I can appreciate that there was a different flavor to that one because it was coordination with federal agencies specifically related to particular type of crime. I still want to have an opportunity to hear from you Chief or anyone else sort of why and how this is different than the nine and a half block strategy that was utilized and I think it was 2016 my questioning around that is primarily motivated by the fact that you know, we did that in 2016. And I think it's fair to say that the the public safety issues in that particular a footprint has has not improved and although I think there was some temporary short-term relief related to the night and a half block strategy enforcement aspects and you know, it it it certainly is just that it's a short-term solution not a long-term solution. And again, I'm really interested in motivated to making sure that we are creating Pathways to not just meet short-term immediate Public Safety needs but that we are cray. A pathway to the two more sustainable long-term strategies that are going to prevent it environments like 3rd Avenue between Pike and pine to get to the point that there are epithets currently out again. I'll just speak to that predated my my time in this role my perception of what's going on now is I think Westlake pretty much has been a success by activating TV example of a long-term strategy. However out of the tunnel 3rd Avenue has always been a challenge because you have people cross section of people that come together to use public transit and they have to wait for the bus or so they come together and there is an opportunity for friction. So to speak that's a challenge and going forward. I would love to get input from various folks on how we can kind of look for long-term Solutions there with so many people traversing that Corridor and then we have a tourist industry that's coming back and forth on Pike pie that mix it is hard. We have to up the presents there with officers that be great. Have a storefront there, but I understand real estate expensive but apartment to NOS. Has Vision Vision zero. Okay, so to raise officer presence, we have the buses on on 3rd Avenue and raise officer Presence by enforcing the bus lane have traffic while she was out there. That's a more visible presence. So you're taking care of traffic safety with block the Box the bus lane enforcement. You have more officers in the area to deter crime we can still do our undercover narcotics enforcement but I would love to get suggestions and help on 3rd Avenue. It's it's been a challenge since I've lived here last budget cycle. We had an opportunity as a city council to support and effort. That was Advanced my council member Johnson and councilmember O'Brien around some initial. Monster support work around reimagining 3rd Avenue. I know that the that I believe it's opcd has been doing some Community robust community in and around identifying how to really transform 3rd Avenue to take out on some of the issues that some of the observations you've just share with us a chief and you know that the association has been a good partner to the city in that regard and has recently released a very thick report of their ideas and suggestions around how we can change the environment and the mobility on 3rd Avenue that would I believe have significant impacts to improving public safety issues similarly to what we did in Westlake the activation of public spaces. It is a key portion of that ongoing activation of public spaces. Cuz when I go again, I appreciate the work and the difficult job SPD does and the collaborative efforts of the strategy are here at the point. I heard through public comment was just really talking to the in person or the person crime, which is a 8% increase it was because I didn't slide 3 not to skip ahead but also reflect on account number Gonzalez's letter about how that the neighborhoods were selected. When I look at the data from a Seattle Times article that was on the on the 28th of June last year. The fear of crime in North Seattle was highest in the University District Which is higher than Balor and higher than Fremont. The crimes per thousand was also hire in the U District then it wasn't Fremont. I just say this because I think it's the demand and by my longer-term concern is obviously with the U District in the perception of the u-district with the Light Rail station is going to open up in a couple years all throughout the district. What I hear is that the U District unsafe the U District and safe. I'm not going to go there. I don't go there at 4, so I don't go there. I'm just not going to go there for the young people there that they thinks Branson everyday, but And I mention this because I think that there's a need to change the perception for the u-district with regards to the safety of the people. There are the businesses there. So that more people feel safe to utilize a U District are the university U District Light Rail station when it comes online, but I also encouraged if there's any Revisited which neighborhoods are selected order which one neighborhoods to include that. The U District is included because I think it's an opportunity for us to really help that kind of like as you stated earlier Westlake. It has been a success and as I said earlier given the data it's hard to not put the resources there. Stop and just a pile on the district for my office a little bit of digging into number of calls and with a cold were received for which again setting aside whether or not we're charges or prosecution's as a result. There still calls related to Public Safety received an in Roosevelt and Ravenna neighborhood. There is some some significant increases as well. So when we look at for example of calls related to narcotics calls went from 54 to 7654 in 2017 and up to 76 and 2018. Robbery called in 2017 were 35 in 2018. They were 52 shots fired in 2017 with 15. It went up to 22 in 2018 and and reports of threats and harassment went from 14 in 2017 to 24 in 2018. And you know again Is is part and parcel of some of the other comments that we've heard from folks in different neighborhoods about feeling like like they were left out of the opportunity to also receive additional law enforcement services to address their public safety concerns, which have been going on for years and years and years and years. And so I appreciate that line of questioning of Kells Murphy chuckling maybe you can talk a little bit more in the context of the selection of the neighborhood's certified. What what you are saying to other neighborhoods were saying, why were we left out of the equation? So I'll start off with that. So just specifically for the U District. PD Command Staff. Usually my Mo see stats at NRC stats every two weeks. A lot of coordination. We just went to a meeting a few months ago with their entire executive staff their school president to talk about crime issues around the school. It's an open campus. Another challenge that they've had is there's a number of shelters just on the other side of 15th Northeast and people that are homeless are back and forth. There is predatory drug-dealing on the Ave. And we are familiar with the challenges are we've been there are bicycle team in North Precinct rotates through there quite often. The night life is a challenge. We want to get our staffing up to a point where we don't have to emphasise all the areas. But I just want to mention last year. We did do a University District emphasis and I regardless of the program. The mayor's office has started. I can't speak for the other departments, but History and my experience tells me we will be back in the U District in 2019. As far as other give you numbers but that the biggest expenditure of of overtime hours was actually nightlife in the East Precinct Precinct Aurora North Northgate. We were there in Alki so these neighborhoods are all in the top 10 for last year where we were I think again, let me reiterate that was specific about this plan is that will be in the U District but we have to reassess and the executive will make a decision as whether or not the other departments will come. Does that make sense? Thank you. Next up with soda. So it was busy last year. It is continue to be busy this year. And if she's green and can talk to the the resources the South Precinct has poured into soda and a lot of us as mentioned earlier with with s. The a lot of the RV remediation pilot work is in soda. So it is hitting on a lot of sort of the city metric hearing from the VA is hearing for business owners hearing from all sorts of individuals about need for more presents and activity in Sotto Sotto Sotto easy selection as a location just the given how it it sort of on everything from every aspect of the team. I don't know if anybody wants to speak about Georgetown again, they had an increase in crime. They've been having also a lot of the RV issues do sometimes feel down into Georgetown a lot of illegal dumping reports. I think there was some purposeful sort speaking to the earlier question if we had just done a straight ranking. We can't do it like this sort of thing it all at once and l57 neighborhoods straight ranking by percent change. It likely would have been all small neighborhoods with small numbers cuz then it would be easier to have a large percent changes. Mathematically. We have done it by volume of change. It would have been all the big nut big neighborhoods. So some of this is a SPD data some of it is other department data. Some of it is feedback from the community. Some of it is going to be a is is the collaboration of that information and then also not just picking the large neighborhood sign a part that Georgetown makes sense on the numbers, but also it's it's a smaller Adoption doesn't stand out so that thing I was part of the selection of the Georgetown in this one in SouthPark are good examples of how many years of kind of organizing coordination of monks multiple departments that resulted in both Public Safety task forces action plans that we saw it as an opportunity to say. Okay, we have this this intent coming around San Francisco. But how do we leverage other Investments that have been happening over the last couple years? And also, how do we continue the momentum in these two efforts? The same issue and we talked already a lot about this council member her boat about South Park. There has been continued work there. It it does it goes up and down in terms of that the crime that we are responding to and read to her directly from community members who have reached out to the department before about a sense of things were scaling up. So we wanted to short-circuit that cuz it can become very busy while small in number and size it for the size of the community. They can have an elevated amount of activity and there were some folks telling us they saw the signs they've seen before and so that was part of that decision. So on South Park unlike some of the other neighborhoods has a pretty significant density of vacant or abandoned buildings. And so when you travel on Cloverdale, you'll see a bunch of houses that are boarded up and I think I'm going to put her gold is done. And a lot of work around monitoring of those vacant buildings and I noticed that part of the multidisciplinary team doesn't include anybody from sdci with experience around vacant buildings. Is it can you talk a little bit about why they weren't included with with SPD or through some of these other initiatives that I talked about either the public safety task force or in some cases to do on this Valley action report. As you know, there are is quite the language barrier in South Park. And so we are active in the use of our community liaison sand in in partnering with sdci and spd2 to have conversations with this property owners there sometimes not in English. And I'm looking at the specific South Park plan from the southwest priests and it calls out that our City attorney liaison for the precinct will be responsible for monitoring those vacant properties in whether or not they turn into nooses properties and I think he's been pretty effective in the pass it to bring the appropriate books to the table to handle those issues keep asking that we keep a close connection to that cuz I know that that particular for Southpark has been a top concern for members of the community and really appreciate that intersection an opportunity to collaborate a little bit further as well. So I think that brings us to the ends of the presentation. Is there anything you want to say about next steps? So we are in these walks through Thursday. And then at that point we are assessing the feedback that we're getting we're doing that now, but I working with staff to make sure how how are we addressing it and then in constant conversation with Community about this is what we heard is this what you could have meant to tell us this or anything else and then starting to this be an action driven approach from his perspective in kind of working with across the team again use this as a Launchpad of a better kind of community collaboration around some of these improvements so that this isn't necessarily just where the conversation stops but how we kind of continue to improve the feedback loop we're going to be working with departments working with other mayors office around metrics of implementation and that I was part of what your letter account number set and so we are happy to come and be in conversation with you around that. On my letter to see what was answered and what wasn't answered you all knew that was coming. You know me. Well enough to know that I keep my receipts when I haven't heard yet discussed here today is is is really sort of the fundamental question about what the with the theory of change is here in terms of like what are we trying to accomplish? And how are we measuring whether we Rose to the occasion in terms of meeting that desired outcome and so we spent a lot of time talking about some of the basic concepts around the reality of of crime and and how crime has increased in these 7 neighborhoods that you all have identity exactly was identified as initial focus on what I still haven't heard yet and undress you just mention. This is that you all are still working on evaluating on identifying what the metrics will be in order. Determine what successes and in what I would ask is part of that is that you also consider clearly articulating what you hope to be out the what the theory of Change Is as a result of doing this multidisciplinary approach again the bedrock in the foundation to me seems to be the concept of the emphasis Patrol which is ordinarily utilized by the Seattle Police Department and the addition of other agencies on top of that in a coordinated fashion. It is is a build upon a sort of that bedrock. And so I want to get an understanding of what is the theory of change here as it relates to Public Safety and how we are meeting the needs of Public Safety within these neighborhoods and I want to get an understanding of whether or not we were actually successful in developing that and would like to get a sense from you or anybody at the table about when you anticipate having that available for us. I will nausea and then add one other thing here is that as was mentioned these walks and issues have been community-led. And so one of the reasons why I kind of like we have to see what is identified as cuz as we go to the walks different neighborhoods and communities will identify different things. And so, you know, as I mentioned Thursday is the last Walk we're going to meet us a staff to connect a term and see what the list of is of requests are and then we can begin conversations with the council about kind of what next I'm sorry timelines. But again as we have said is our intent here is to be action-driven and collaborative. So that will be reflected in our action plan. I'm happy to sort of make some additional time in committee to sort of hear how that plan is is come to fruition and what the feedback loop has been so that we have a better understanding of What's going to happen on day 31 when this particular approach runs its course. So the next thing that I heard a commitment to give us information about overtime and other resources that are going to be used and so I just want to reiterate that while I don't yet have an answer at the table about how much overtime is estimated to be spent on this particular program. I'm asking that that information be provided to council Central staff Greg Doss can it be the recipient of that information and share it with her office and would like to get that information sooner rather than later. So Chief you have a sense of when you can provide that touch base with our budget people today and those reports are pretty easy to run a we have specific tracking numbers for each neighborhood. That we can sort of bookend temporarily here and look forward to getting that information from you soon and will you know accordingly? You know, I think the last thing that that we didn't directly touch on but I understand is sort of happening as we speak is the community engagement. I'd just like to get a better sense of who is being engaged in community. And whether the three walks in some of these neighborhoods are the extent of the community engagement. This is where it builds off a lot of the conversations that d o n in other departments are having day after some of the concern that we've heard from Community is that and why I think this is such a beneficial different type of way of looking at Community follow through is each of our departments might be coming into the project to the 6 and then go out go go away until kind of the next fix. This is an opportunity to really have that kind of continuity of servicing in in in communication and As we are engaging throughout the city with neighborhood groups Community groups. Advocacy groups or its Evo organizations. I see this is it ongoing conversation in terms of how we just shift the way that we do community engagement holistically is the city we keep track of who were engaging with in community again, you know that the city is vast and diverse in its opinions and its constituencies and I want to make sure that that the communion gagement that your department is leading and that ice is reflective of that that variation within different perspectives as it relates to this particular issue. I just think it's really important to make sure to elevate the voices that aren't ordinarily allowed to be elevated for tickle in the context of Public Safety. And I think there are certain neighborhoods that I'm hearing from people with insert neighborhoods in hearing from that are feeling really concerned about how their neighborhoods weren't included in this when they are neighborhoods who have had chronic issues with gun violence for example, and other types of really violent crime bet that they feel it that they were also deserving of his attention and I want to make sure that those concerns are addressed as well answer questions customer for Teco anything else from the good Folks at the table here. We have a night life in space is going on right now in the East Precinct. Also, we've had a number of shots fired and he's pretty see there's a limit if this is going on there as I said before there's emphasis on going in southeast Seattle in Rainier Valley and Rainier Beach on the street robberies where we've had patterns year after year of vulnerable victims usually senior Asian folks who are just trying to get to where they're trying to go and they're being robbed on the street. So we still have that going we're still working those cases. We have not backed off of those cases and also as far as West Seattle Alki is getting warmer will be out. There will be in Golden Gardens. So that's all I'm going in as far as Outreach. I think you know, we have Chief Diaz and his bureau and are always making contact with folks. Also my precinct captains attend the precinct advisory Council meetings. We also attend the demographic advisory Council meetings and so will get that feedback and woke to where it needs to go also from week to week. We will be monitoring our rest and tracking everything we do and we'll look at T stat and see where we're moving and we'll get all the information together at the end and deliver it to the Executive before closing us out is that there has been a temptation to tie this body of work with the prolific offenders report or with a repeat offenders issue with inter. Criminal justice system and what I have heard very clearly at the table today is that this is not a strategy to address those issues. This is a strategy designed to take a much more multidisciplinary approach to addressing some more lower-level types of criminal activity occurring within the 7 neighborhoods. And so I don't want folks to walk away with the impression that this is the city's answer to the the reality of the issues related to repeat offenders and wanted to give you Chief an opportunity to just talk me to maybe maybe say a few words about why why this is not necessarily a strategy to address a repeat of rebuttal to those complaints as I said before we've always advocated with the process. Inside the house when we have individuals who are not getting the message so to speak so nothing's changed there. We will make sure we're tracking folks that we come in contact with and if it's if it's a particular individual that is is considered a chronic offender will have conversations with mr. Holmes office or mr. Satterberg Sophos just like we always have that's great as this meeting was happening down here upstairs on the 7th Floor. There was a meeting happening with the work group who's actually focusing on the repeat offenders issue at my office in Council at has representation in in that work group as well and really appreciate the opportunity to be able to collaborate and yet another space relating to Public Safety to relieve some of those issues, but I certainly appreciate all of the work that you all are doing. I can appreciate you being patient with my office as we Agenda and really wanted to have thank you for your willingness to share information in a very timely response of way and I'm sure that we will stay in touch and continue to engage with each other to to make sure that this program does what we hope it will do. So thank you all so much for your work and your service and I hope that you will send a gratitude on behalf of the city council to all of your respective Department employees. Really appreciate all of your effort. This is the last item on the agenda. We are adjourned.", "end_time": 15081.2}]}