{"format": "raw", "annotations": [], "confidence": 0.9355564397208544, "data": [{"start_time": 0, "text": "Good afternoon. This is the regularly scheduled meeting of the Seattle City council of Human Services Equitable development and renters rights committee. It is March 26th, 2019. And the time is 2:03 p.m. And I'm trying the comedian. I'm joined by Carl Sandburg water. Thank you for being here. I expect that today's meeting will not be very long. We only have two items on the agenda and they're both appointments the Pacific Hospital PDA. Take them up together. Robert cook is being appointed for his first time by the PDA governing Council and this is dory's Koo second appointment. She was originally a mayoral appointee in 2015 this time. She's being appointed by the King County Executive. Lost. I'm a comedian discussion the PDA that talked about some exciting work. They're doing they're starting to build affordable housing on the Pacific Hospital campus. I have heard that this wasn't a unanimous decision on the part of the PD, but I definitely support affordable housing at the campus and I look forward to discussing it with the appointees and and hearing from them personally, but don't they support the decision for affordable housing or not? And we do have public comment before we bring our presenters to the table Nick Jones Staffing this council meeting and will be reading the names of the people who are signed up. Each of the speakers in public, has two minutes and we're also joined by cancel present all thank you for being here. Nick and you read the name. Public comment we have Alex Zimmerman, and that is all. Z-CoiL my daughter shooter anti-semite criminal and killer Minor by Alexandra Mann on speak about with people with his you appoint my experience with almost 300 people and I almost every commissioner meeting. Yeah and you all in the same people again and again and again, it's very simple because by definition when you croak croak to is this not surprise me because Apple always not falling far away from 3, then I give you a classic example about what is happening right now be right to call right now Korn so he could go for re-election. But because right now or I'll call Sue Gonzalez times in no one from you mentioned here. She's a crook a criminal supposed to be moved. Chamber yesterday, you're not some carpet how you can go for re-election. It has people elect you again. When you never go voice about criminal in your chamber. How is this possible know? I understand when you support 9 trespasses about Alec Zimmerman when executive branch doing something in legislative branch support executive against Constitution, I understand you but right now it's very simple Council Gonzales in your very quiet about this is how it is possible that you are so people could your choice is not some feel-good different. So right now, it's just people 700,000 666 stand up America. Is there anyone else lined up? No, that's all. The real close public comment and we will invite the presenters to the table. Good afternoon, guys. Good to see you to meet you Doris. Thank you. Can we have a very quickly one line introductions from each of you for the record and then Kenny or I don't know who wants to start it. introductions My name is Nick Jones on Legislative Assistant with sharman's office. Hoping to be an appointee to sit on the phpda governing Council. Hi. Thanks for having us. I'm Jeff matter. I'm executive director Pacific Hospital PDA. And I'm Bob cook also a candidate for confirm confirmation for the governing Council and Kenny Pittman office in a government relations. Thank you, and who wants to start this? Thank you madam, chair like the present for you two you two appointments to the Pacific Hospital pediatric public realm Authority cook. This is his first time of pointy since 2013 has served as a strategic advisor to the PDA and he is an appointee of the governing Council themselves. They have four members that they appoint for members are appointed by the mayor and won by the King County Executive and he represents the governing council is also the senior director at the Washington State Housing Finance Commission in the area of finance and IT services has an extensive background and nonprofit and Cooperative organizations have worked with the Plymouth Housing group, Cascadia revolving Loan Fund served on various boards and comes very highly recommended as an appointee to the Pacific Hospital and we support his appointment. The next one is Miss doraku, who was a representative for the King County Executive the King County Executive has one appointment of the nine members on there. And this is Miss cool basically was appointed in 2015 had to step off and is now graciously agreed to come back and serve on the Pacific Hospital PDA and we're very glad that she's back there has an extensive experience in nonprofit housing financing and would be an excellent addition along with mr. Cook to the Pacific Hospital. Thank you end up in a couple of minutes. We would like to hear a little more from Jeff about the housing project itself. And also can if you can talk about the status of the funding for the project, but before we get to that could we have a few comments boats from my school and mr. Cook about what your experience has been associated with the pedia so far and what makes you excited. I'm excited about a serving of the PDA. And and what do you hope to accomplish and and please me even the point about affordable housing bill that you know, you you are already have got a question for my office. I know other consumers are also interested. So you might as well so address that the thank-you council members who went good afternoon council member for rest, and I'm a proud resident of D5, by the way. I spend my whole life in my entire career on affordable housing first as a community organizer in Chicago working on organizing tenants to take landlord to court for repairs and then feeling that the process was too slow switch course into building affordable housing and that's been the Mainstay of my career my involvement with phpda as Kenny side started with the an appointment by then memory and I sat on both the real estate committee and the finance committee and it was under that. That we realized that there was a surplus land on the campus of the Pacific Hospital campus to put that land if not affordable housing. That's when we actually took a charter Amendment to the mayor to allow the phpda to take on Housing Development including affordable housing and we've never look back. We now have a plan. Jeff can give you more details, but the plan is to Bill roughly 260 closest 300 units of affordable housing affordable to both residents below 60% and then partially for residents below 80% and a child care center run by El Centro De La Raza and a health center run by the Seattle International District Health Services. We all very excited about that project and Signing back up to serve as governor and Council gave me great pleasure to look ahead to the completion of that project. But also to take a look at what else the campus can do ask we both raised funds to help closed the health disparity Gap by making Grand and providing affordable housing. So the mission with something I passionately believe in and hopefully the service that I offer will allow me to do that. Thank you. Thank you. Thank you madam, chair and other council members that are here. I appreciate you being here and you're interested in hearing from me. I first became interested in PHP Dai in the 90s when I was a resident of Beacon Hill for 9 years and I watched the North Tower the north Edition being added for earthquake retrofit purposes and admired how well it was done so that you can't even tell that that wasn't Edition. So I've been a long time long long time interest in the campus, but I really didn't know that much about what I did however 5 years ago in 2015. I became a strategic advisor, which is a member of the public that is a Committee Member on the finance committee. And I've also since 2016 when the real estate committee was established have been a member of that committee as well. So with my 23 years of experience at the Washington State Housing Finance commission, which does Portable housing through tax-exempt bonds and low income housing tax credits and also is controller Northwest AIDS Foundation before that where we were the fiscal sponsor of the first HUD 811 project in this area the Cal Anderson house for people with AIDS. I've had enough almost 30 years of experience in affordable housing work. So I'm very excited to be a part of this project. Doris outline very very well what we have in mind and I've demonstrated my commitment so far in picking participating in the real estate committee, and I hope we'll have an agreement that I can support when we get to that point. Thank you. Do you do Jeff and Deni also dependent talk about the project itself and PDA. I can come I'm very proud of the work that we've been doing the past six years. We are up tripartite Mission PDA. Our first mission is to Steward the Pacific Tower campus and make sure that it stays beautiful and accessible and the tower itself that preserved as Landmark status our second mission is to provide grants based solely on lease Revenue. We don't accept public funds. We don't do fundraising that we provide grants to ensure Health Equity throughout King County based on our lease Revenue. I'm in the pack to the given you I've given you a list of all the various grants. We've given over the past six years. Now, we average about three and a half million dollars per year in grant-making going to a wide range of community organizations. That's it. Yeah, I'm pretty surprised at how much we've been able to do in such a short amount. Time but also very very proud of of my governing Council that it helps to read this and Arthur the newest mission is the development Pacific Tower campus you had mentioned prior to us taking the table here that there was some disagreement about moving forward at the affordable housing. The only disagreement that we really had I think is a governing body was when we decide to take the initial step is Darth mentioned and start to develop it at that. This agreement is based on the fact that we weren't charger to do. So, so that's what we do. We have the authority to do that. We knew we had the authority to lease it to someone else to do and then the PDA decided you know, what if we do that we run the risk of the toothsome for-profit developer could come on the site and build condos, which does not serve our social Equity Mission what needs to be in hell to the original concern was more about how do we gain the authority to do that mission? And thanks. I have to say very strongly to Darcy's knowledge and input as well as the input of some other council members. We came to the mayor's office in to that Charter Amendment since then it's really been a question for us about how to direct InFocus the project initially. We thought we were going to build a hundred fifty units of low income housing and 150 units of market rate and use the market rate units to pay for some high-end cladding some high-end Landscaping some gym facilities and do a kind of social Equity. Nick's similar to new Holly or Rainier Vista. We are moving forward in that direction until a very successful meeting. We have the Speaker of the House speaker chopp who raised some questions about whether we really wanted to consider doing half low income and 1/2 market rate. He felt us a better use for the property would be low income and Workforce housing. So in December of 2017, we made that The 90-degree turn a hundred h96 to turn to reorient the way in which were working on the project. We decide the at that time we're going into Charlie low-income. The best thing for us to do would be to work with a developer that really knew what they were doing in low-income. And we're very glad if we're not working with this house Chinatown International District PA. We're in the process right now of finalizing our lease with them and they have been aggressively going out to find funding. They just got some guy talk about the state budget. I guess. They just found out that the million dollars allocated to them to help move the project forward. They must have gotten some other funds in the city and the county so we're very very excited. We hope to have the lease codified. I hope I would buy her early summer as Darth mention. The least does include a requirement that a pace the aging-in-place facility that don't ask me Health Services is working on with Karen on And El Centro childcare facility are sighted on the lot. We would love to see groundbreaking and a year-and-a-half. Obviously, we'll have to resubmit the master use permit and do some more early design guidance. But you know, what does this mean? I think those are the fun steps if you have to take because they really help you mold the project into something that's going to be long-lasting. The other thing that seems very important is everything we will do on the lot has to uphold landmarks preservation values. So we're going to ensure that the tree canopy is all their the fencing is all their access will be the same and we think it's going to be a great addition both to Beacon Hill into the residence of the property itself. So, I think that's that. I apologize for hours. Thank you for welcome. Any questions. Thank you for I told me some of the history and in between all three if you just clarifying what the background was and also Jeff appreciate you making a distinction between merely adding residential space to the city, but at between dad and affordable spaces and so that the emphasis being on a fordable given the crisis variant so, you know and and also based on the specifics that you mention. Hopefully the work that you are doing can be some sort of model for how we should do and you you went everywhere from affordability to tree canopy. It's like Universal LS training that we can have a city not either or we know it be when we can and we need to emphasize all this one too cuz for living having a decent quality of life, all of those things are absolutely critical but it starts with affordability as you said, so I appreciate you putting a fine point on it all of you. Deserve to live in beautiful affordable housing council members if you have questions Jeff, thank you so much for for providing all this information. I love chronologies. I have a long history that which which isn't in here with the with the newest episode, of course, we want it used to be the veterans hospital. It also was any health services grow? I spent my youth going to that huge building it when it was IHS, which is not in your Chrono, so you might want to put that in there. That was the spin-off for the Seattle Indian Health Board, which is as, you know now flourishes with with nurses and doctors and Native American traditional based treatment housing all of those things, and then of course when you guys became a PDA 1981 is when we created. The selling is Service Commission also a PDA for that same purpose. So you're all in that same good family. And also I wanted to thank you when I was looking at I'm so many of these organizations that you found the the downtown emergency service center food Lifeline YMCA Chief Seattle Club Country Doctor. Rather see more we work with all these groups. So I cannot tell you, you know your partnership and what you do for the city in this community. It goes far and wide never mind the distraction the wheel of D5, it's our favorite. Thank you so much for that. I did have a question for Ford Taurus and a question. But more just a comment When I was Your Side senior working all kinds of areas on the yesler project in the things that you have done. So is this is your second term doing this? Right? So I just want to ask you again. I know you kind of made some introductory remarks. What what you think your vision is going to be the bigger Vision this time around and what you want to do with this committee are this group? Thank you. The first term was a learning curve term. I'm trying to figure out what the p. Could do and how to be loyal to its original founding Mission and then doing other things that I personally am very passionate about witches of water housing now that we fully on our path to realizing the affordable housing. I love to take a look at the rest of the campus. There are other buildings and parking structures there that that are historic but with some creativity maybe we can add even more affordable housing on the campus. That's something to explore given the significant crisis of affordable housing we have in the city as a public agency owning land. It would be critical for us to look under every Rock to figure out how to contribute both to closing the health disparity Gap and to continue to build Housing on the campus the marriage between the tower which houses the Seattle Central College job training programs and many nonprofits and our soon-to-be residential campus is also very critical. It's not, you know, people come to work and then people come back home. How do we provide housing for the trainees that are pursuing house Allied health careers dental, hygienist and other things how do we help them live close to where they work is another great exploration to take advantage of the community preference policies that Council just supported in the mayor. I'm signed to figure out how we can turn as many affordable housing units in Seattle to the people who work in Seattle, especially lower-income jobs. So that's another exploration. I like to take a look at my phone. Can be anyone who wants to answer but as a chair one was saying. We are finally reaching the point where it's not enough to just have affordable homes that we are working out at this now in D5 with nonprofit and for-profit developers that Pre-K and daycare should not just be an amenity that it should be part of the RFP process that that should be a sweetener. You should get extra points when you provide that and we want that are Light Rail stations and the other issue is thank you so much for in the project and looking forward one thing that has not been a foundational Block in these units are when we're building is services for elders when we passed. Mha one of the nice by-products a gem of that was we got an additional ten thousand square feet in North Haven so we could put a medical clinic in there and it dental clinics were not just servicing the low-income Elders in that building, but everyone up and in D5 is the only District that does not have a Elder Community Center and has the highest number of shag housing so I haven't Turn the childcare oriented development services for elders on the medical and dental side as well as the housing so people can age in place. So thank you so much for 5 years ago. When I used to do this for a living with another when I was a lawyer developer working with tribes and other nonprofits and other four prophets people always act like that was just like a extra parking spot or some like a nice piece of art and we were always pushing that know people have children that it can't just be a one-bedroom condo. Two other amenities are going to be in the tower of amenities important like Necessities pacmed will continue to operate their clinic for Primary Care and Specialty Care in the basement to first floor at neighborcare Health operates a 20-seat dental operatory in the tower. I'm so it's going to provide people who live in a reprise people access in the community but not for people to move into the new community. But if we might be calling it in terms of Pacific Tower steps or Pacific Tower Heights, they'll have access to those services to tell him I said Fair start there which plans to expand its it's training program, obviously for Baristas and food handlers a but also will be opening up a larger restaurant which probably be a grab-and-go, but they'll be places to eat to Eating is important. But we also want to ask Robert about being on the sale mens cars are doing share this weekend. So for a lot of fun at my car all I've been on the board for two different Cycles there and also that is one of my other nonprofit Passions. Fresno fish. Why don't I want to thank my Robert doors for serving. I certainly look forward to voting for you. You are formidable talents and what you done for communities in in the housing world, so that that's a no-brainer Jeff. You said something. I just didn't understand and I wanted to come back to it. And you said very quickly that the PDA doesn't accept funds from and you said some sources like we don't accept some things. Corporate Bible. Can you say what you're saying about that many other organizations including several pdas accept government funds. We don't we are only source of income is the rental on the tower. Now the rental is paid for by the Department of Commerce. So technically one could say that is governmental in nature, but in the past, it's been amazon.com. So the only source of income to PDA has is through that rental in on how about the exception with the north side. We're going to start you're going to get money from both of State in the city. Hopefully those monies will be Going right now counts person Harrell to skipta to help develop the site soon as we received already received some pre-development money from the state transit-oriented development Swanson's those came from King County and also from the stork South downtown PDA those allowed us-based me to purchase the lease. I see we're looking at reform ptas an hour looking on the state level for me another PDF another building and I'm trying to understand better how these. Models work. The other truck just question I had is do you think what the developing the north fought at all, either positively or negatively impact your ability to feel the give the immigrants are the major grants for that screen in a little bit or do you anticipated having any effect at all? I'm hoping it doesn't one of the key. Tenet's that the board discussed we move forward with this was that are grant-making was sacrosanct. We did not want to touch the grant making it was when was we describe the PDA? We are not an either-or. We're not doing healthequity of granting or doing house and we are both and so certainly every time we look at a decision in terms of what we're doing on the North lot. It is with the sense of how do we make sure that we Safeguard all of our crabs we're not right now in the process is a set of developing a lease with skipta, which will include some ground lease funds which will certainly help make us whole in terms of future Revenue that we might need to make sure the tower stays in one piece and as we do about the rest of the land, I don't think we'll be gaining any funding for our grant-making from this this project but our goal certainly right now and I think we're right on target is not to lose funding at all on the funding peacemaking lot causing some very very supportive what you're trying to say. I think that's an exciting opportunity so pretty Really? I call So the appointment consumer Juarez Matt and Jeff that you added to which is having Child Care Health Care and North characterizing the method manatees but life Necessities which Well off communities have very easy access to most working people actually have less and less access to and if you look at the expenses of people undergo for childcare. It's basically wipes on one income in a two-income family. So so those are as important as affordable housing and having the well-rounded idea of what makes for a decent life. Appreciate all that. I feel quite satisfied as to The Passion of the two individuals were considering for appointment in terms of their commitment for affordable housing and of the PD as a whole dozen Birds any further questions or comments. So I will go ahead and move appointment 01238 appointment of Robert D cook as member Pacific Hospital preservation and Development Authority government governing Council for Durham to December 31st, 2021. Thank you all in favor. Say aye and then Number Two Witches appointment to go 1276 appointment of Doris W Koo as member Pacific Hospital preservation and Development Authority governing Council for a dorm to December 31st, 2021 five language of so, it's been moved and seconded all in favor. Say aye aye. Thank you and I both appointment that United has like a million people come to council. dumb Ted is it next Monday Monday next week weather. Yes, April 1st so you don't need to be there but but I have no doubt that this will be passed by the full Council and I'm really happy that you are going to starve and regulations. Are you doing very good seeing all of you again? Fat body of a cup in the other items are dumb and I will adjourn the meeting. Thank you.", "end_time": 1803.3}]}