{"format": "raw", "annotations": [], "confidence": 0.9173778583768939, "data": [{"start_time": 0, "text": "Good afternoon, everybody. Thank you for being here on April 1st April 1st 2019 city council meeting of the full Seattle City council come to order its 2 p.m. On Bruce Herald president of the Council of the clerk. Please call the roll. Brian Gonzalez 7 present. Thank you very much. No objection council members sawant's absence, which was approved is hereby rescinded. She is here. We see her. That is rescinded. I'd also moved to excuse councilmember War as from today's meeting. Is there a second removed and second that we excuse councilmember War as all those in favor say aye opposed the eyes have and councilmember whereas is excused. I don't know for the record of this will be a counselor or Johnson's last meeting here on the dice at least in the near future and we'll Reserve our comments for the end of Arjuna to address that issue. But I can't promise him that they won't be comments made him between now and the end of the agenda. There's no objection today's introduction and referral calendar will be adopted. can objects in the introduction on throw calendars is adopted and there's no objection. Today's agenda will be adopted. Hear no objections. The agenda is adopted the minutes of the March 25th. 2019 City Council meetings have been reviewed and if there's no objections that minutes will be signed. Interjections, they're signed. a cute Presentations are pleased to have councilmember Moscato presidential Proclamation about census awareness and a thank you very much for the council members that help put this together council member Miss Katie of the thank you very much. Mr. President. And thanks for this entire Council for your unanimous sign signing on of this Proclamation. And for the Community Partners for being here with us today. We were just in community about an hour or two ago with County folks with our philanthropic cells with union members and with state representatives as well as we recognize that we are one year away from initiating our one year away from this crucial process that contributes the shaping the structure of our democracy from the 2020 Census count. We are and knowledge that we are when your way with his Proclamation today in an effort to come together as a community to ensure that we are with the community. In our state and trust with all residents. It is our responsibility to conduct a rova Census count of every person in this region as the law says every person in this region, especially communities that have historically been left behind in in in our accounting processes in the past. When we count everyone in our communities we can plan for the development of our communities. It facilitates the process through which we can access resources that we need to build a more vibrant safe inclusive productive and Equitable. This is true for us in Seattle and it is true for every other city across the country and it's especially here in our state that's committed to create an inclusive safe and welcoming environment this process of a Acura 2020 Census count is critical for making sure that we get the resources on Healthcare making sure that we had access to Federal funding when it comes to building affordable housing making sure that those who need Access to a healthy and affordable food have access through Federal programs and probably most importantly making sure that we count everyone in our region to make sure that we truly have a representative democracy and that our representatives in Congress truly know who is in our communities and that we have the numbers of representatives that we need to reflect the power the voices in the bodies with our jurisdiction, but this white house and this Administration is not interested in counting everyone. They have a very different agenda one that is exclusive hateful and divisive. They are not interested in serving anyone counting everyone or acknowledging everyone especially members of the lgbtq community members of our immigrant and Refugee community and members of our people of color communities. So let's be clear in Seattle do things differently. We're putting this Proclamation forward in an effort to show that we are leading by example. We are putting people first. Because we know this is how government should work. This is how you grow and build communities and we know that every person in our region does count. I'm excited to be working with all of you that immigrant rights groups unions workers small businesses with the customer Gonzalez who's sitting with us on the task force with the county with philanthropic organizations for ready to do the work of combating bigotry hate and fear and ensure that every one of our residents is counted and that they have the trusted Community Partners through funding necessary to reach everyone. We are providing that local communities have the power to mobilize and shape and change the Census count by making sure that we provide resources as a region and that we ensure that every person in our community council president, and I'm excited to be able to present the stop proclamation to Our Community Partners on behalf of City Council. Thanks very much. If there's no objection before we present with any other council members like to see any words before we suspend the rules and hear from our guest counts, Gonzales get off work at bringing this Proclamation at this afternoon. I really appreciate the opportunity to memorialize today as the one-year Mark of a lot of work that has to happen in community in order to make sure that that all of the things that counts Mariska has described our are effectively accomplished in it and it was really proud and excited to stand with Marin County Executive in Toney from the Seattle Foundation early this morning at his house. Vasa to announce this new investment of 1 million dollars that will go directly to a community-based organizations who are trusted Messengers and will give us the best hope and the best chance possible to reach into historically hard to count communities. To make sure that that they are seen and counted and to ensure that the federal government understands that we not only expect but we demand the investment that our communities deserve and that that is really at the heart of what a Census count is is that we need to make sure that in these times when we have seen the effects that dire terrible effects of failing to invest in our communities that now is not the time for us to double down on continuing our lack of investment in in these critical communities. So really excited about this Proclamation and more so excited about the years worth of hard work that lays ahead of us is super excited about supporting us in about partner and about the effort to partner with a community to make sure this is the greatest success we can make it. So thank you all for the support. There's no objection to the rules are suspended. We love to hear from our guests and thank you for being here. Are you walking down customers kid? Good afternoon counselor when I started as my name is Oscar Zambrano. I'm the director of student get you now because he proteinex me fund and we're currently the fiscal sponsor for the Washington's Alliance. And my name is Menasha by my youth fellow at the Latino Community Fund. Thank you very much for the proclamation. It means a lot to us to also be recognized by all your amazing leaders to call the work that has been done. I was going to recognize Elsa here and there in the audience for all her work prior to coming to the city and helping us us at the at the Frameworks which are were working for the very important issue to alchemy's of a color especially cuz you all kind of mint rd2 high-stakes today of what type of risk early last year the Trump Administration pretty much a packages of color MN immigrants and refugees for adding the census question, which is a question that hasn't been in the census for many many years right away that takes me find along with maldef and other 21 organizations across the country. We put a lawsuit to post a question to make sure that communities and immigrants record especially did not have to answer this question this question would Severely impact the census complete and accurate count because it would discourage many non-english speakers immigrants refugees and even with unknown status says to not answer the census question. We know that this also, please ask this question also asked more of R22 more information that is needed to have a complete chances. The Census Bureau has other mechanisms. They can get this information from our communities their senses question in the whole process has been to release a press the Census count for immigrant Refugee community and other kings of color one of those pants main mission has always been to build local and state why resources to breach the equity Cab in our communities. This is why this keeps me fun is proud to be the fiscal sponsor for Washington State census Alliance light for people in the audience and people on here. What is a sense Alliance? We are like account number. Loretta Gonzalez said We Are The Trusted Messengers for our community. There is a big test. Between immigrants and kings of colors such as with just any type of government or just the lack of information that you don't get and so when we come as a community group, it could be your face groups School groups, that could be just me the organizing groups that they have a relationship with a really Biltmore trust and it builds more capacity to have these questions and doubts be answered in the more interesting way. So defense Alliance was formed last year make sure that we have a state fair in complete 2020census count the alliance can being over a hundred Community leaders of color and 67 organizations across the state to build relationships and set forth an overall framework in the Statewide strategy. We understand the city of Seattle and King County tend to have more resources in a population. But that means that also we want to make sure that's people Central Washington and the door aurarius get some resources as well. So that's why we have been advocating successfully for 15 million dollars at the state level for my budget. Great news is that last Friday? We got to send it to show proof of emailing and then the state house to approve 12 million. So I'm asking all of you to please call your legislators have a cake to make sure that we get the 50 million were requesting. When people ask why 15 million 15 million doesn't go far enough and want to think also the philanthropy sector the city Seattle King County for today's big news that we're actually coming together as a community to build are all of our resources into one and two actually support the community groups are going to be doing the hard work with talking to the community members in in their areas the two main reasons why the census Alliance really exist as a savings account or the goals is to have the 17.2 to make sure that the Buy in a sense of strategy allocation of important Federal resources was asking me that 17 billion dollars in education Healthcare and transportation from the Grinch to Washington State solely based on the Census count these funds represent critical resource to support basic needs and infrastructure on which our communities depend. Those are the most vulnerable are the ones going to benefit the most from this account. We have been saying that Scout has been growing in population and we can all feel the strain of that. So We are to gain possibly know there's a congressional seat and Elizabeth II point which is political representation under a Federal Constitution to sense is required to reapportion congressional districts for the data is used to draw a congressional districts All State Legislative districts and local levels. We fundamental belief that our voices in all levels of government are strong and we have a more accurate Census count. So what time it comes down to is the fact that people of color can you use are the most disenfranchised actually feel and know that they have a seat at the table and so far as it's very important that all of you here and three networks today. We're launching which will talk more about also I wear our big me to push today the census one-year anniversary. So Chucho the actual count if you want to make sure that those communities of color and can you use that don't speak English get to know that today is a very important day because we're here in front of you. Thank you for the proclamation and most important to make sure that the education pieces start going out and so that's why this month Really important to make sure that our things are well educated about the issue. So with that as want to say thank you very much. It's a great pleasure to join Community groups philanthropy sector city in the State and State and County governments to make sure that this funding gets allocated to the people that have impacted the most. Thank you. Hello, my name is Osman again, and I'm a good fellow at the Latino Community Fund and I'm here to talk about the senses. So 10 years ago. I was a twelve-year-old kid on the playground and I didn't really know what the census was and I didn't know if my parents had counted me these past 10 years have seen many kids like me to turn into adults adults that depend on federal grants that fund are higher education and Healthcare adults were just learning to use their political voice and deserve accurate representation. So I'm here as a student and a youth Advocate to say thank you for your support and Leadership on this issue and towards having a complete and accurate census for all ages and all communities. Thank you very much. Yes, and also so we are currently launching a media campaign across our social media platforms advocating since today is the one year countdown to where the senses so we are using the hashtags Count Me In and senses 20/20 to bring awareness to this issue and make sure that we are educating all of our community and use as well. Thank you very much. Do what you want count us in? Champs the backstory Thank you Oscar. Next month. Thank you customers Mascota and Gonzalez for presenting this okay at this time will take public comment on item that appear on today's agenda or our work plan or introduction referral calendar and we are going to extend public comment for 20 minutes. I have a list here to order with what you sign up. So we will start rattling off the names here. So we are we will start with David Haynes followed by Alex Zimmerman. David Haynes is first eye exam and second. City council needs to reject financing Martin selig and his Bankers vote. No on ordinance and Council fill one 19485 reject Shady deal. That hustle taxpayer money, propping up artificially inflated rents and leases located in front of a noisy toxic coal and gas trainyard the Parks and Recreation Department. This does not need employees sitting down on the job distracted by rumbling horn honking trains. We don't need corrupt political donors highlighted President Trump buying off our local politicians to abused tax dollars probably commercial real estate speculators getting Wealthy overcharging on Lisa's every month while the same governments eliminates off of the squander property taxes to buy more votes city council must reject this deal because it further drives inflated cost of living and the City Is a pressing the attempts to discipline the greed by corporate welfare subsidizing Martin selig and his banking donors while they laugh all the way to the bank with their capital gains every 3 months. Perhaps we should investigate we should investigate City council's lucrative retirement favors and Promises. From their work financing rich people ripping off the city every month collecting inflated rent. We need Parks and Rec to stop ignoring all the trash in the city as they refused to get out of the truck as a flaming homeless guarantees a lazy Workforce protected by suspect Union. We don't need to get Parks and Rec a waterfront view interrupted by coal and gas toxic trains while giving charity to Martin silly cuz he chose a bad location where nobody wants to rent it because it causes PTSD by toxic rolling horn honking trains that Echoes throughout the building and give me stick a zero off that perceived value and need to realize it at Marisol has an influence on this budget because his husband runs parks and rec department and then Lindsay Johnson. Kyle my dirty shooter How do you stop a pig from Animal Farm? What is Fermi very interesting appointment to people around 4 Museum in support biker belt and 7000 time before they are corn so sad when it comes to go to the election right now, then somebody in 10 minutes ago mention about democracy confused about what does mean democracy constitutional republic something like this to people who go for re-election in solvent. I don't think so. Very simple question give to people that has a appointment simple question why Council Gonzales V. I never hear this from the election cardboard. People are good for the election that posed to be no lawyer citizenshipper for many years. Was it like a for the phone your 7th? Like for six years is a long time to this place for 10 years every day and that stands it but my question I think you are next to speakers be Lindsay Johnson and Christopher King JD. Hey, my name is Lindsey Johnson and I'm here today as a volunteer for unified Seattle and I'm making the statement today because I've had to have had the chance to learn firsthand about the issues. Surrounding low-barrier sacks in the undeniable effort it plays on the community. Spell barrier Shack encampments like the Lake Union and catmint in South Lake Union will not be successful because like other Shack encampments, it does not emphasize or require. Any Lifestyle Changes no real oversight or proponents conducive to adjusting their lifestyle currently drug use litter and the inevitable overflow of homelessness individuals loitering to the streets of South Lake Union neighbors. 2 encampments are suffering the same consequences. Those did in North Seattle surrounding now closed lichten Springs encampment. By the closure of the encampment due to low transmission rates to permanent housing the crime rate doubling in the area. The opening of the Lake Union encampment was still approved. And it became obvious that look very or Shack encampments like the Lake Union encampment or adding to the homelessness epidemic instead of helping to solve the homelessness crisis in Seattle. If this system Remains the Same Seattle neighborhoods will continue to be invaded by the many downfalls of encampments like the Lake Union encampment and will suffer the consequences of these and a D liquid solutions. We need a real solution not shocks. Thank thank you. Following Christopher King will be Oscar assume. You're just so you won't speak again. Toby carry crock Cori Crocker after Michigan. Good afternoon. May please the council. I have a copy for each of you. I was just a quick First Amendment reminder or Warnings all of you 20 years ago. I sue. Columbus city council for violating the First Amendment right to redress on behalf of my client Jeri L Doyle case number 41 F sub-second. 765 southern district, Ohio 1998 blah blah blah city council never again interfere with his speech in the whole city knew the truth because it was front-page news when there was still a real media not here to tell all of you and particularly counselor War as giving her recent episode. Of course, he's not here today, but I'm here to remind all of you that you work for us. You know, this is a fact and you are no ways to treat speakers differently based on content or to interfere with their public comment unless there is a Thai place or manner violation Bruce your lawyer, you know the rules. Okay, that's fact. So I've seen city council discriminate against speakers including me and many others and last week. Of course in the matter of weeks ago. We saw with the Council of War as her interruptions to the public speaker has happened since that evening five years ago and many of you attended a foreclosure and underwater housing form that I bring child with Michelle Darnell and safe. You may recall the strangers and so will hers served as moderator for that event. Since that time even though my videos demonstrate shamisen want and Nick Licata noting that the banks were engaged in quote criminal unquote activity toward homeowners. You have refused to allow my colleague Marie McDonald the right to present the findings of for auditory review of Kane County recorder of deeds, even though the taxpayers pay for that review and even though she has been an expert witness in many trials including the 5.4 million dollar, Texas verdict and wolf vs. Wells Fargo. She basically said you need to submerge you never did it, and I'm just telling you Lisa herbold was very strong in her opinion about it, but all we got from the from the city when I assumed you guys was a reaction from the city attorney. We will address that later. I just want to share that with you today. Thank you. Thank you, sir. I'm following Cori Crocker will be Drew dressman. Great. Thank you after half a dozen years of community discussion engagement mobilization. We have delivered a unique example of a community-driven stakeholder vetted Mobility plan for the area surrounding the U District Light Rail station. We thank you for your support a resolution 31873 and for you to remain engaged throughout the implementation of this plan and particularly wish to recognize council member Rob Johnson and his legislative aide Amy Gore for their steadfast commitment to the project and most importantly for their belief in the power of community-led planning throughout. Our desired outcome was a holistic multimodal stationary Mobility plan for the U District are guiding principles included a safe the importance of safe and comfortable environment and wanted to prioritize walking and biking Transit create a great network of for every mode and a great network of public open space. We wanted to, date people of all abilities. We wanted to transform the right away in open space the project the most active. Is the project was last year we were brought together thousands of volunteers stakeholders in the city agencies in the community. We hosted 3 Community workshops 3 online surveys intensive designs with the city and we held an interactive Booth the street fair. We applied the Adept move to add a Proviso to the funding on the rebuild of 43rd Street to incorporate pedestrian priority options. The city is now in planning the plan. We need your help to follow through on his priorities, but there are a couple of the things we'd like to get done buses on Brooklyn has no one knows what formed the future Mobility will take with Innovation such as scooters in car share Bike Share the most realistic strategies to remain flexible. So unless changes are made to the final designs. The station buses will be absent from Brooklyn ave. We encourage a coordinated effort to add six more in to accommodate buses. Also what happens on 43rd Street will set the tone for the district. And so we want to be bold with his pedestrian priority options. Thank you. Thank you. Following Drew will be Rudy Chrysler. I just want to Echo what Cory said thank you cards for Apple Johnson for your support folks like Rudy you speaking after me the last 10 years have really been going. Okay, we're getting the Light Rail station U District, how are people going to be getting there? So I think what this plan represents was first, you know an attempt to go to the agencies involved and say what's the plan are people going to be getting there and when the answer was a little muddled and not very well developed. We asked what maybe you should have a station access plan and when they answer that was well thought we can fit in the workflow. You were very thankful. There's encouragement from the agency's from Rock Johnson's office to develop this community-led plan that that we are presenting her today. And what I think would really like to ask is that you just continue to be good stewards of these values and visions and goals and Concepts that have been put forward in Planning others. We've done a lot of work getting out in front talking to everyone who might have disagreements about how things should work around the station making sure a small business owners who deliver their goods with Chevy Astro Vans feel like they have a workable plan as much as you know, the u-dub how they're going to accommodate the next twenty thousand people will be heading to campus. So we just ask for respect that those conversations. I've been going on for a long time. And then we recognize that when when there are the inevitable difficulties in a growing place like the U District that we refer back to these guiding principles that have been developed these Concepts and and I keep developing a great neighborhood that works for everyone. Thank you. Thank you. Falling Rudy will be Moana best University Park Community Club on our community club is obviously very interested in what happens in the U District until we've been involved in all the planning that's been going on for at least the past seven years leading up to today to the auction and in the Alps only got all sorts of you no toll buildings that are being in the construction right now, but what's really missing is old infrastructure that needs to go over stairs. Could be police report that could be schools that could be specifically what we talkin today at Transportation issues. And we really afford this working group that Corey Andrew have just been talkin about to push along these things that were at the time and I also forwarded as part of the city council resolution. And so we Be really grateful that can I have another resolution that is pushing for it at some reasonable planning a lot around the Light Rail station as you've heard. We've done a lot of Outreach and we also recognize there may be some other opinions about this show one of the major things that we need in the future is not to box ourselves in but keep things flexible so that as things we can do something crazy Buffet in the long-term. And so that's what this resolution is about the my opinion and thank you very much if you were going to pass it. Thank you from Moana. best will be followed by Alicia Davis Thank you so much for this opportunity to speak. Thank you so much. I asked an invite you to engage this topic not only serve a really with your head with your heart everyday. Well, I want to start by starting with what I am here to support and ending with that as well. I'm here in support of a resolution in support of U.S. Senate Bill 76 the personal care products safety ask everyday. We are exposed to toxic chemicals throughout a variety of me the foods. We eat our cleaning products and the products we put on our body. Daily exposure to toxic chemical has a profound and Lasting effect upon our health and our relationships. Women of color have a higher incidence of chronic disease associated with exposure to toxic chemicals. Women of color have a higher level of toxic chemicals in their body that impact their children and their families, but this is not just a women's issue. 1 and 3 children are diagnosed with autism ADD ADHD and other illnesses. I have been a speech pathologist working in a medical and educational setting for almost 20 years over this time. I have worked day in and day out with families Educators and the honor of working with students and a seen a rise in this illness directly impacting the success of the students that I serve and their Mental Health I have been an educator and an advocate as it pertains to children and their families in the educational setting. I am also here because I am a beautycounter consultant the leader and the Heart behind the bringing clean saver products to all people. I am using my voice to educate and Advocate as it relates to the lack of Regulation and safety regarding the Cosmetic industry. Can you wrap up please? I leave you with stinking about the fact that we need to have change. This is our issue and it is an issue that only all of us can resolve. LSU speakers to be Alicia Davis and then Robert smiley. I came here totally prepared to support all of my fellow consumers of the beauty industry and not prepared to speak. So bear with me. I want to say thank you to Rob Johnson for bring a resolution forward as a consumer of the beauty industry. I was blown away to find out the facts of the nearly unregulated cosmetic industry. It's confusing and an unregulated market place where as consumers. We don't know everything that's in our products and products that are labeled natural and organic green. They can still contain toxic chemicals. So I'm here in support of regulating that letting us as young women middle-aged whatever age were at giving us that choice of putting cleaner products on our body and their for extending our life spans and the lifespan of a Hey Kirby, Robert smiley. Afternoon, everyone Lenny's Lubbock Smiley. I'm the founder of the hand up project and something North. Org and what we do is we go out in the woods in the alleys and we talk to people and get him into detox treatment and housing within 24 hours results, which called Insanity and with LinkedIn Springs. We did a clean up there with all the needles and put that all out that that's and then are most people that are there being moved over to the Lake Union Place. I know a couple of them that we moved into the Boykin Springs when it first opened and now they're looking over there in the Lake Union. What if you want to help us with this homeless problem, you need to take a look at the fact that the mental illness drug addiction and economically displaced people out there and they all need three different types of solutions. But but low barrier is not one of them I deal with a lot of people in a couple of the camps that I have up north and bottom line. Is there Zero Tolerance if they don't have a problem with drinking and Drug rate, I'll put them in the camp and working through Services getting connected every sixty nine months. They graduate to their own apartment to get the kids back to get my life back if they have an issue with drinking and drugging I get him into detox treatment and Recovery housing that works program of recovery to get their lives back the idea of putting people that are still allowed to drink and drugs. Resource of tiny homes is ridiculous, simply because I've won I've done that. I'm constantly not finding people for appointments. They set appointment to go out to find them there. Hi there. This is that please reconsider. What you doing with the Lake Union property Robert smiley smiley coming on the sharing your thoughts and ideas at this point will move to payment of the bill. So please read the title of the bill pass any further comments. Please call the roll on the passage of the bill Gonzales president Harold 7 in favour Nana post. Appointment 1267 appointment of Stephanie ellis-smith as member Museum Development Authority governing Council for term to July 11th, 2021 committee recommends the appointment be confirmed the appointment to the museum Development Authority is an appointment as being brought forward to the council by the MDA governing Council. It is an appointment for a vacant position. And this will be Miss Ellis Smith's first term is Alex Smith is the founder and former executive director of the Central District forum for arts and ideas. Otherwise known as DD Form currently. She is the founder principle of fill out and Gage giving Which does amazing philanthropic advisory work. And also she was the past board director of artist trust. She served as a CEO Arts commissioner from 2008 to 2010 and a Washington state parks commissioner from 2000 to 2007. forget any further questions on the Snowman Nation I just wanted to thank Stephanie ellis-smith. Very aware of all the great work. She's done. And thank thanks for serving green to serve on the Development Authority governing Council. Thank you very much all those in favor of disappointment please vote I Try that again. I really was a little off on they will not take ownership without those in favor of confirming the appointment, please vote I confirmed please read the next appointment H&M to appointment 1275 appointment of Wayne Adrian Rocque as member Seattle lgbtq commission lgbtq commission for term to April 30 2020. The committee recommends appointment be confirmed. Thank you. Mr. Rock is an appointment to be lgbtq commission brought To Us by the council the council has the authority and it says it's just a rock is a community engagement specialist currently working at Asian counseling and referral services and has a wide variety of community experience including work on environmental housing and disabilities issues. Forget any further comments on this appointment? Those in favor of confirming the appointment, please vote I buy those opposed both know the motion carries an appointment is confirmed. Please read the report of the finance and neighborhoods committee and I am three times but 11945 authorizing superintendent Parks and Recreation text good at least greenovation City Seattle and Selleck Holdings company LLC Delaware limited liability company for office space in the building located 300 Elliott Avenue West, you known as the Elliott Bay Office Park in ratifying confirming certain piroxicam pass are backshots ring cuz I was hit the floor. Make a council president Council bills 119485 would authorize the superintendent of Parks and Recreation to enter into a 15 year lease for office space at 300 Elliott Avenue West Des Lis can be renewed two additional years for 5-year terms for total of up to 25 years. The total space being leased is 28000 square feet, which again can be increased by up to 4000 square feet within the first 5 years of the lease. The lease rate is $33 a square foot or $924,000 a year. The least rate will increase annually by $1 a square foot starting in 2021. This newly signifies the moving of 113 staff members of The Parks and Recreation Department that will be moved from the current office space in the RTA building and the Chinatown International District at the current least in that particular building in the current building expires in November of this year. So there is a sense of urgency around Salinas of action on the city council Bill to allow for this move to begin to occur. The location of this new office space is also very close to the main Parks administration building and Denny Park which in addition to the favorable Lee Street terms made this a good choice for the new space. This ordinance was considered in the finance and neighborhoods committee on March 22nd, and it is the committee's unanimous recommendation that the city council passed this Council Bill. Are there any comments or questions? If not, please call the roll on the passage of the bill and post bill pass and Cheryl sign it. Please read the report of the Human Services Equitable development and renters rights committee both both items four and five, please. Services Equitable development and renter rights committee Gen X 4 and 5 appointment 12:30 and 12 Sundays 6 appointments of Robert D cook and Doris W Koo as members Pacific Hospital preservation development Authority governing Council for term for December 31st, 2021. The committee recommends you planning to be confirmed Development Authority. Robert cook is appointed by the PD 8000 Doris who is appointed by the King County Executive last week. We had the party nominated by Licking County Executive last week. We had the opportunity to talk to both of them in the Human Services Equitable development and renters rights committee along with the president of the PTA about the Pacific Hospital and their work. We discussed a plan to build affordable housing on the Pacific Hospital campus, which is partially funded in the proposed state budget last week. Before the meeting mouth is Austin Albany to prepare to answer questions about their position on this affordable housing project. Of course, I completely support that affordable housing project and seeking responses from the nominees at the table and board nominees Express support for that affordable housing project and as a result the committee unanimously recommence console confirm these appointments. Thank you customers want any comments or questions from the dice customer skater passed including Bob cook and doraku very appreciative of the fall of questions that we submitted to the candidates and thanks to Bob cook for his response as well. I think are all in alignment was wanting to see that affordable housing childcare facility and Senior Center created on the North Lot in addition to making sure as the council president mentioned this morning that Good work that they do through grant funding for our community organizations who are working on ensuring that we are addressing Health disparities and improving access to healthcare and healthy communities through address in the social determinants of Health that they continue to get that information of that funding out to the critical Community Partners with the information that I received this morning and a huge amount of appreciation for the quick work on behalf of the nominee very much in support of these two nominations going forward and I'll be voting. Yes. I I don't suppose both know the motion carries and appointments are confirmed. Please read the report from the sustainability and transportation committee recommendations found in the U District station area Mobility plan and supporting pedestrian Focus rebuild of Northeast 43rd Street committee recommends a resolution be adopted. I am very excited about the opening of the University District Light Rail station and the opportunity to create a vibrant Lively Transportation Hub there that serves all sorts of users and I'm really grateful to the community members who have come together to help create a vision of that in this resolution adopts that and I'm grateful for council member Johnson's work to get us there and see what that I'm going to hand it over the council member Johnson. I don't have much more to add. We've got a lot of things that are happening in the neighborhood rather than weights as you heard from community members tourist. Hans to request from a variety of different agencies King County Metro Sound Transit several different city departments this group of folks banded together came up with their own vision and are working really hard to make sure that each of these individual different government agencies are working hard to implement that Vision as opposed to being responsive. They were proactive. I'm I want to say thank you to all of them for multiple years worth of hard work and we had a really great set of Consultants to the city help tired to help them create that Vision. I want to say thanks to those Folks at makers who did a lot of that working and as mentioned my chief of staff Amy Gore spent literally years working on this project. So happy to have this small resolution today affirmed the good work and look forward to its implementation. Excellent any further comments or questions? I don't think the members of the community coming out in support of this resolution. Those in favor of adopting the resolution, please vote. I know the motion carries a resolution is adopting sure will sign it. Please read the next agenda item 31875 Reid retiring introduced and referred Council bills resolutions clerk files an appointment to have received no further action this morning. This is just one of our administrative legislation. Where are we have to process according to rule 1/8 x where we retire legislation that has been in a standing committee or before the city council for this one year. And again, this refers to bills resolutions clerk files in appointments and made this a list, of course publicly available as attachment 1 to this resolution and it's something we do every year any questions or concerns. If not, those are fake, I will move to adopt a resolution 31875. Okay has been moved and seconded those in favor of adopting the resolution please what I supposed to know the motion carries resolutions adopt and Cheryl sign it please read the next agenda item personal care products safety act in that supports a bell in front of the US Senate that would do a better job of regulating the personal care industry. It's a 70 billion dollar a year industry and it's regulated by approximately two pages of federal law. The that's in the sounding thing to me as we heard him come in today. I'm no changes to that lost since the invention of the ballpoint pen. It's been now more than 80 years since we've had any action tube and chemicals from the kinds of things that we put on our bodies everyday wear as a the European Union has banned more than 1,400 chemicals in the last two decades. We as individuals in probably about a hundred different individual chemicals on our bodies everyday. I think that it is important for us to really knowledgeable about what those things are and unless folks think that it's just the beautycounter team who's here today and thank you to my wife Katie for helping to organize folks today, but there are a lot of other major brands like L'Oreal Johnson & Johnson Estee Lauder Revlon Procter & Gamble football supported this legislation. It's also been supported by folks like the March of Dimes the American Academy of Pediatrics the national Women's Health Network and a whole host of others the bipartisan bill. I think it's time for us to start taking some action. And and this is a our little small way of demonstrating our little sport. Thank you counselor jobs for bringing those four door there any questions or comments or concerns and give you want to thank members of the community for showing such strong support for this resolution. Okay. Rules in favor of adopting the resolution, please go die those opposed both know the motion carries a resolution stopped and sure will sign it. The first to ask if there any further business to become before the council which may include excused absences and then I may say a few words and or rather let customer job to see if yours if you'd like giving this is his last time on the dash. So is there any further business for the council? Okay, so Cal summer Johnson. I'm going to start it off and say it's been an absolute pleasure serving with you and thanks for living leaving in the middle of the year. I mean look nothing like looking forward to another replacement process. By the way. I'm being very facetious your your passion. You know, I I met you when you were lobbing on Transportation issues and a strong lobbyists at that and I know you're your passion for transportation solutions for our environment for neighborhoods, and for the children and I think having young kids in it shall Public Schools when I first joined a very unique perspective as well on the perspective, so did my pleasure serving with you in that look forward to working with you and your your new capacitor? It has been my honor. Did anyone else want to say anything? Breast cancer. I just want to say that I know that you will be proud for decades to come of the fingerprints that you have put on this city both in physical ways in policy ways that will have lasting positive impacts for a communities for very long time not the least of which of course is passage of mha and the lasting contributions to affordable housing with a legislation will bring I will miss having you on my side of the diocese and having somebody to fetch with on occasion joke with and I really enjoyed working with you. I'd say we've not always been on the same place, but we've always I feel done a fine job of finding what I mean the middle. So, thank you. unscrambler Thank you. Mr. President Johnson. I was unloading to the present that I would very much like to say something because it's been an honor to serve with you on city council, but it was an honor to work with you. I think now 10-12 years ago when you were with transportation choices and I was with the Department of Health as a recent graduate from the Evergreen School of public administration working on my final project. I run event nutrition and physical activity policy leadership group just a mouthful of words and it was your steadfast leadership and that and that Coalition that made me think that the change is possible and even though we kept running into robach after Roblox on issues around safety is safe routes to school getting healthier foods in school you continue to sort of give me hope that change was possible and as a young policy Advocate seeing another young policy Advocate who had been already successful in his career show that the the pathway forward in the advocacy world. And now as a council member showing what it means to be inclusive and respectful and to be thoughtful in policy-making you've shown. I think the city how it's possible to take those good ideas that we hear about from our Community Partners tomorrow family from the leader is that we've worked with in the past and and indices turn those policy ideas into action Los. Oh, thank you for being there for the time that I've known you over the last decade plus to show that it is possible to make the changes and to lift up the community voice whether you're outside. These Halls are sitting in that seat right there. I know we're going to keep working with you to make sure that this city is a healthier and wants is a place. So thanks for all of your work over the years that I've known you. SML Brian Robin trying to remember when we first met and I'm not sure I know we served on the viaduct stakeholder committee is probably over a dozen years ago, but we interacted before the Inuit transportation choices and he is a volunteer the Sierra Club and I've always valued our friendship and relationship and I work together. It's been a real honor to work for nearly four years with you in an office right next to you on a day-to-day basis and that's been amazing. You're someone when I can count back to how long I I know that I'm a little bit older than you and so I am not sure when you were just a little bit. I thought I started pretty young at this but you must have been like an elementary school with us for a long time and you're someone who you know, you've been great to collaborate with a co-conspirator a time this but you've also been someone who brought so much knowledge to this work and has helped educate me in my activism through that and understanding especially around transportation and urban policy. And so I've really appreciated that over the years and I know you got going too far away. So I look forward to continuing our relationship and continue to work together and continuing to get advice from you as we move forward. So good a pleasure going to miss you for the next six months. Look forward to what comes next. Katherine Gonzalez Rob likes to joke that he hates going immediately after me. I have really enjoyed having you as a colleague council member Johnson. It has been an absolute pleasure for me already been articulated up here. I think for me. It's really important to recognize that you bring a very different style of governance and that includes always being willing to have tough conversations. Even when you're really uncomfortable with them and into really focused yourself in coalition-building. That's really where you come from is from coalition-building and from bringing people together who might not be sort of the people who would naturally come together the first time I met you was actually at our first debate when you were running in 2015, and I was running in 2015 in Eastlake. So it has been fun ever since then. I guess I really intended more for Katie and your girls. I hope you know Katie how wonderful Rob is. I know that you know, how wonderful he is. But I hope you appreciate how much he has done for this city and that it's been done out of the love for you and for your girls and for all the families across the city, and I know that you have made great sacrifices to support Rob's commitment to public service. And so I want to thank you and the girls for letting us have him for a little over three years in this really tough tough job. So thank you Katie for your public service and allowing us to have robbed for this. Of time. It's been really amazing. And I know that you all will be around and we'll be a part of our community and I've just been so thrilled to be able to fight for a more equitable. Send inclusive City that includes transportation for all inclusive housing for all that includes education programs. And and I'm really proud to have been a colleague of yours for the short. Time. We will miss you and I'm still hoping that your speech is going to end with April Fool's. I'm staying you guys don't have to do a council vacancy reappointment saying just kidding, but I suspect that's not the gift, but I don't receive. Wouldn't it be funny if I just did this for a three-week vacation and then all of a sudden reapplied compass on this Council the last three quarter years, but it feels Hollow compared to those very kind words. So I'll just leave with a couple of thoughts really inspired to do this job. Not just because of some kind of Legends in the Civic space like Jim Allison Aubrey Davis that we all hear a lot about one more time and public policy in the city, but also because of some personal Heroes of Mine He's a wolf who is not a very well-known individual but is a real legend in the environmental Community locally for her commitment to environmentalism and Environmental Education and my own grandmother Margaret Smith who was in the first graduating class at Seattle University of the first graduating class of women, And was known throughout the depression as being one of those houses where you could come and knock on the back door, if you're hungry and you needed a sandwich those kinds of people inspired me to do this job because I think it's important that we have people who want to serve the public and I did not talked about early on in this job council member O'Brien where you said our money is used to be really short. They used to be 15 or 20 minutes would get some stuff done and we move on a short Mondays and I think the reason we haven't had very many short Mondays is because we really work on hard problems and work on hard solutions to those problems and and those require a lot of complex working a lot of behind-the-scenes work and I'm really really proud to say that I think there's a lot of different ways to be a leader in the city and I hope that my sort of behind-the-scenes style and and collaborative Nature has been one of the ways that's helped. Skip through some of those hard things. I will confess to be a little concerned about some of the rhetoric that I've seen in the city right now. And I think that that comes from both sides on whether that you're somebody was shown up to city council very ardently in favor of something like the head tax or they're not you've organized public forms around Public Safety that kind of intentionally pick on individual City Council Members or or process, but that doesn't seem to be the Seattle that I grew up in. It's not the Seattle that I want to see us become and I get concerned about that rhetoric because I think it it really imitates the Colorado that we seen at the national level which pits us against each other. This is a city that really does a good job. I think of governing and particularly hard spaces when we can talk to each other and we can learn to disagree without being disagreeable. I'm so grateful to Kate's for everything that you've done. I love you so much. really hard So blessed to have them watch some people step into our lives to help in those spaces. I'm incredibly grateful parents were still around to those aunts and uncles and cousins and friends have defended us who cocktail parties because they knew how hard this job was for us to Jerry and Emilio and Amy and Noah and Patty and Alicia and Maya and all the other folks in the office have been around Des papes our kids to be part of our lives and just so grateful to you for letting us do this job has been a very hard job, but I'm very grateful to you all and thank you. You can't go back and edit some of this out. But I know it has been a true honor to serve with you all and I look forward to following your careers from afar do cancer and Johnson. Passionate words we stand adjourned. Thank you very much.", "end_time": 3782.4}]}