{"format": "raw", "annotations": [], "confidence": 0.9166003984433634, "data": [{"start_time": 0, "text": "Good morning. Today is Thursday, April 14th, 2019. The housing Health Energy and workers rights committee will come to order is 933 on tourism has get a chair the committee. I'm doing my council member Gonzalez. Very excited to have you here also co-sponsor of some legislation that will be considering today. We have two items on the agenda for today. I'll focus on workers rights. The first is a discussion of the hotel employee issues. And the second is a discussion on paid sick and safe leave time for Seattle School District employees. Very excited to have with us the honorable school board members after the wolf to talk on an infection related to that issue as well how we're going to start with toilet comment. And as a reminder for those who are in the audience and our viewing committee are viewing public. There will be two minutes accepted for each person who's here to speak. We would like you to begin your comments as usual by introducing yourself in the item you wish to speak to there was some confusion in the last few meetings about what our Council rules actually Say about public comments. I want to use this opportunity to clarify according to our public comment Council rules item three Council committees shall accept public comment at a standing and the select committee meetings public comments at committee meeting shall be limited to matters within the purview of the specific committee item or List It on today's agenda and the presiding officer at the committee meeting shall ensure that all public, is accordance with rule 6 c3a just to clarify that we have here to speak is mr. Zimmerman. Your time has started your car. Not too big from Animal Farm name Alexandra. I want speak about hotel worker problem right now against discrimination and sexual harassment in because my experience extremely big, you know, what is being so I can share information about with my experience but there's absolutely nothing to talk about. This house is Hotel working. I have a discrimination and sexual harassment give music a woman like Gonzalez like a virus or like a mosquito die Garden Hotel where I give you my experience. So you posed to be supportive people, you know what it means to work for her tail because it was Rapid Care in this chamber is only show called Deep sexual harassment and discrimination. We will call. Do you know what that means? He's in this chamber. So when is this chamber? Mr. Zimmerman, I warned you to keep it two items on the agenda. That was not a public comment related to the items on the agenda your time is that The next person that we have to speak. The next person that we have to speak is Charlie lamb home, and I'm sorry if I pronounce your name wrong. Charlie are friends for Martin Luther King County labor Council. Okay, if we see them come back with me go ahead and let them know they were called and if they have a few minutes, I'd like to share will do that. Anybody else here would like to share something specific to the day's agenda item. Okay, great. So we will close at 4 today. Thank you very much sitting in my chair. Remember last forever help to them. Let's go to the first item on the agenda the first item on the agenda of us. Could you read into the record for us? And while she's doing that cuz we have our friends who are going to be participating in today's conversation or and some of the workers from the hotel industry to join us at the table. Agenda item 1 Hotel employee issues for briefing and discussion. Welcome, come on up. Antonio are you going to be translating today? Okay, very good. So far viewing audience. We also have Antonio Roofing he was going to be consecutive interpreting for one of our panels today was like he sounds like he's getting on Yo list of stories. I just mentioned that customer Gonzalez and I are eager to have Folks at the table who speak in various languages. We're lucky to be able to understand Spanish. So looking forward to the presentation. We're still going to translate in Spanish. So for our viewing audience at home in English for viewing audience at home. Thank you guys so much for being here. And thank you so much time with Kaden and members of the committee for the opportunity to join you today and that you had a briefing last week about the the contents of the initiative that was first passed in 2016 in the current legal status. And so I think we're really hoping today to take the opportunity to talk about you know where that is blocking from in the issues that are present in the hotel industry in Seattle. I'm two in particular hear some stories from workers in the industry about what their experiences have been on but really to background, you know, why that initiative was so needed at the time and why we now need legislative action to make sure that those protection stay in place for workers. I'm salting reduce the folks that are here with me today and also have them and I do since they went with what they would like to say, but I am really excited. They're both folks that I think can speak directly to some of these issues and also have been real leaders in their workplaces on a number of important organizing efforts that workers have undertaken over the last step. Nearest Sam's to my right is nearest to us. And then I have been buying to my left and steliana across the table nurse. Is there anything else you want to say by way of introduction? gracias por entender musica para hablar sobre Los anos de las consecuencias any Castle. Completamente como se meses embarazo. Yo Creo en ese momento. Innocent in this moment of personality most now that booty most a lot going on New Year's Eve in a polo. but I've already AAA Parabola de hacer algo con esta locura are on Thank you for having me here and for understanding me and and giving me the opportunity to speak. I'm here to talk about some of the things that the events that can happen in a hotel situation and the consequences of that can carry for employees. I was actually involved in a very unpleasant. I can you see molding against and I when I came to clean his room he removed his clothes. I was six months pregnant at the time. It was an extremely difficult situation. Nothing. I Really Happened beyond that but the following day at all the way didn't do anything at the time the following day. We reported the incident to my union and management of the hotel and I got the support that it was hoping for and the guest was dismissed pain. But I was pleased that something was done about this particular event. Where you at? Good morning, everyone. I'm working in the main. Can you get that microphone a little closer to you if you go. I'm walking in the Westin Hotel 27 year, and then I walk into the house keeping Department housekeeping. Miss. You already have a job everyday. We clean I-15 through my day. Diana my name is Celia know I work at Embassy Suites downtown. I am a banquet Houseman life is not easy even there but what's even harder is the magical planets with no medical plants are expensive everywhere and they are getting even funny as funny as I told one day a commercial want to bus it was saying fixing one arm and one leg doesn't always Coast one. So I will I have this paychecks with me pay stubs that show how much I have paid for last year. It was like 150 6.41 each paycheck for my medical plan. It's very expensive. That's what I need you to cover my needs and this year I changed it because it would it's very expensive for me. I changed it to a crappy plan which is Like 50 something. Because it doesn't cover all my needs, but it's what I can afford right now. And for this I'm trying to do something because we all have medical problems. I am alone. I don't have someone else to have a medical plan to cover me, so I have to cover myself and I would like something to change. Thank you. Thanks. And I should also say we have Natalie Kelly here who's in organizer with Unite Here Local anytime a worker organizer and may also jumped into some stories that that she's heard from from work about these issues. And I guess we would that introduction from folks we can kind of get into the different subjects under the initiative. And what does he think you to the folks were able to join us last Friday at the library to hear additional phrase to remember is we had about 50 Seattle hotel workers in the room that night. That's a really powerful stories about the issues covered in the initiative and purple go through at today that was originally in designs for for that meeting at the pockets of the font is very fun. But I just want to thank you for joining us as well and additional co-sponsor of the work that we're doing here. Also wanted recognize. Thank you for the invitation. Thank you for the invitation to the event last fight. Herald office was represented customer Gonzalez myself and Council O'Brien had a chance to attend as well. So thank you first and foremost for your members time and the folks who are working in the hotel industry for sharing their stories. I feel like I'm we have so much more of your stories to share today at the stable and that was just an introductory, So we do hope to hear more about your stories in any of the items that you'd like to share as you go through the presentation. So with that, you know, thank you cuz I know it takes a lot of courage to share those stories. I just had some interest rates and as soon as we walked through these pieces want to express our thanks and appreciation to Puget Sound Sage for the research work that they've done over many years around the hotel industry in Seattle office in 2012 and their report our pain no gain and are paying their game and Marie silly to their publication of a survey that are members work to do as a workplace injury and sexual harassment in downtown hotels. I mean, both of those are I really important resources and would be happy to provide those to council after this meeting just to two important background plants to make as we talk about these issues. I first the hotel Workforce in Seattle is majority people of color majority immigrants and housekeeping departments in particular overwhelmingly female 30% of Seattle hotel workers are Asian Pacific Islander 15% black African American and 16% Latino and a substantial majority of workers me in the street. Currently have the benefit of a Union contract and I know you did some history last week, but I think those were sort of the background conditions for in 2016 on the ballot initiative that was passed. I was 77% of the vote to create some additional protections around our workload and workplace safety around sexual harassment around Healthcare access and around job security. So we'll we'll get into work load and in 2012 and say just looking at these issues. They found that hotel housekeepers had a higher rate of injury than coal miners are construction workers. I went back in preparation for this to see if that's still held true a number of years later and it does Hotel housekeeping more dangerous than you know occupations that I think, you know, definitely a public perception of being more dangerous work and Yeah, I would love to turn it back over to Min to have her talk a little bit more about the work that she does day today and then her experience of the impact that that has had on her body on a bit more about the work that you do every day. When you go to work. Will you do have to clean? What's going to work? What do you do? I clean my room. Describe here. Keith Murray about 2:15 if you want. Hey, I'll Department everyday V housekeeping cream everyday fitting rooms. I wouldn't really help a lot to check out and then we're ready Russian dressing for finish the room and then what about you have a lot of when when you have a lot of kick out you have to make more time for cleaning the room. Because everything you have to complete car clean when they get checking you. Talk about when you hurt your shoulder when I was harassing. The the room is I got a lot of kids and they will not sleep in the bed. What did you have to do to get better from your injury? And then after that I stay home. and then a walking lie. For 2 months and then after I stay home and then and then I pick up a race and not getting ready 10 to 4:30 work. When I go to the chiropractor for 15 ton. Well my cut up at the doctors and then apply feeling better. And then I go back to 4:30 work. Thank you. Thank you. Macy's something really quickly. I just want to say thank you for sharing your story guy says welcome by the theater to Astoria. I just wanted to acknowledge that that this is somewhat of an uncomfortable environment and I don't feel comfortable here very often. So what time do the safe or something? Oh hell. Yeah, and I just I want to thank you for that. I want to I just know I know that this is sort of a weird space and environment cuz it's very formal and official and and it's, you know, it's important to ask mix to make sure that we have real people joining us and Chambers to talk to us about some of these issues and I just I want to thank you for for sharing your story. Anything we can do to help you make make you feel comfortable. You let us know. You're welcome. Nurse. Is there anything you would want to add about your experience doing the work of housekeeping and cleaning? ways of defacing super pesado It is really hard work have been doing this belly. Just three years. It is extremely heavy work. We just happen to be lucky that I have an employer who looks after us and sea salt vs quadricycles. No sign of mattresses that you wear masks on my phone say but alas Ocho Horas que esta mejor que Nosotros hoteles para que Los Demas a mean thing in those benefits of going to throw some MO. The number of rooms that I have to clean berries depending on where they guess I've been checked out or not. It varies between a 10 equal be up to 1300 Ranieri is about 11 rooms in 8 out in an 8 hour shift. It's still better than many other hotels, but one of the reasons why I want to be here is to help to speak for the people who are not as fortunate as I am the adios adios en Tu cuarto Chicago's convenience. Irelia carries, Kansas to buy you rent a car in Daniel's PSN support. Seuss. Ombro sus dedos ceraadi assistant. Vanguard international Teresa really hard work sometimes I'm told while you're young you can handle it and if that really makes really no different than trying to be a factor after you have to clean 11 rooms. You are absolutely destroyed. It's it's really really a lot. I know some people who been doing this for 40 years and their bodies release show show it the their bodies are often performed by the stress in their shoulders their fingers. Arni's Arni's, especially get really swollen. So it's just really hard work. And just said to pick up on a few of the pieces that nurse mentioned in the the survey that we did have housekeepers in Seattle hotels and 97% reported pain as a result of their work. I'm in for a majority. They said that pain cause them trouble sleeping made it hard for them to complete a routine tasks like eating walking exercising or taking care of their family members and dad are paying workers attribute both to the volume of work that they do. So the number of rooms that are required to clean and also the pace the speed at which those rooms are are required to be completed. There is a happy birthday typically assigned a quote a number of rooms that they need to complete before the end of their shift and that can range significantly from hotel to hotel and is often a lot of fear around rebuke or discipline. If you don't complete your drums in the time that's a lot of to you and that that Stress and Anxiety right also contributes to some of the physical problems that workers are experiencing as a result of of their workload. And it's the name is damaging to overall health and I think is as also came up and then story is a threat to a family's Economic Security when workers are forced to take paid or unpaid leave have additional medical cause some of which are covered by workers compensation some of which are not no longer able to do their jobs because of injury that has you're not only an impact on their house but has an impact on the economic security of their families. I'm sitting looking at at the survey results in the stories that we've heard. There was sort of a clear need for some limitation to the overall work that's being a science to housekeepers and see if there's any questions on workload around the the story that folks yard before we move into talking about sexual harassment. Thank you have a and thanks to both of you for sharing your story isn't for you shouldn't put your story earlier. I want to reiterate that. This is a safe place you all have your union Representatives as well here with you. I want to make sure that you feel safe and telling your story as so thanks again for your your willingness to you know, relive these experiences with us. We know that it's not easy one of the things that I heard that really stuck with me from the presentation last week was the conversation around the type of stress that is caused both for mental stress and physical stress and how that had induce miscarriages. I think it is a trend that we're seeing in a lot of precarious positions are unsafe working conditions from hotel working to Amazon warehouse work. We are repeated stories of miscarriages being reported. And we also know that those are underreported. Is there do you mind reiterating some of the stories that you've heard a more want the one that was shared with us from last week cuz I think as women as people who are Fighters for workers rights and as a healthcare champion, this is also something that I think is a really important. And that we continue to expose because it is has a direct connection on people's health and the health of women in the health of future baby. So do you mind I'm just repeating for us of the story that one of their members shared about miscarriages. Sure yet, you know when you're at there are really specific limitations about what kind of physical labor you should do while your pregnant lifting limitations I think sometimes it's like 10 pounds is the maximum you should lift. There's virtually no part of the housekeepers job that requires listing less than 10 lb. I'm so something that that Union housekeeper self out for is a workload reduction during pregnancy and last Friday a worker from the Embassy Suites Hotel shared her story of having multiple miscarriages on the job at a job. She's been at for a year. She suffered a miscarriage mean while another of her co-workers was pregnant and while she was in her third trimester pregnancy was being given extra rooms everyday beyond the 5000 square foot limit and she only had a room reduction when there was an outcry of her co-workers and from her Union representatives to get her workload reduced. She got her work workload reduced the woman who spoke on Friday, then try to get in to have a baby and was pregnant and once again lost it because there was no work load reduction for her and she's she's trying to figure out what she should do because her mother and her husband are both saying you have to stop this job. It's really hurting you but this is the job that she uses to support her family. So something powerful she expresses that she knows she should quit she knows she shouldn't do this work, but she feels like she doesn't have a choice because this is how she supports her family. Thank you for sharing that as someone who also had a miscarriage last year. I know that it is extremely painful and to think about sufferings. We that multiple times especially knowing that your workload is contributing to that stress physically and mentally is is not only tragic but it is something that demands attention and demand to be stopped. So, please reiterate our appreciation for her sharing that very tough story and and I think you know, a lot of people can understand that pain but a lot of people could not imagine having the pain be repeated multiple times and have it be I'm in part due to the workload. So thank you for sharing that with Seattle as well as we think about why it's so important for not just the health of the local economy and the health of individuals of stability, but the health of our population, I think it's important critical connection and I'm especially in this committee as we have health and laborers connected. Thank you very much for the paws Abbey at any other questions comes members. I have a question about compliance with the initiative as it has been enacted despite the fact that it's being challenged. What what are we finding General in hotels with compliance at as it relates specifically to the square footage rule. I mean, I think we've seen a whole range of different approaches to implementing that piece of the law some of which are compliance which I not I think a particular piece that we would want if I can think more with you about as we think about the future of this policy, is that whether or not additional if a worker cleans additional square footage beyond the limit in the law if that's something that is done voluntarily or is that something that can be required by employer is the language in the original ownership is with clear that that's a voluntary decision that a worker makes that they have the capacity to clean additional rooms and we saw some examples where workers were not actually given that free choice to decide that they wanted to do additional rooms, but were were We're told that they had to do that. So that's a particular compliance issue is being that I would like to think about how to address. KSP can move into talking about sexual harassment by way of background. I'll say another number of reasons that hotel workers in particular are at risk for workplace sexual harassment and assault so I'm having to do with the environment in which they working as I'm having to do with the demographics of who works in the industry. According to the EOC on those respecters include a cultural or language differences in the workplace work places with significant our disparities workplaces that rely on customer service or client satisfaction and isolated workplaces. And then we also know socioeconomic status race and ethnicity and gender identity these other factors. Also I put workers at at particular risk of a workplace sexual harassment and assault Yeah, I apostrophe agency nurse if there's anything else that you want to share your experience. Why why you think that? One that that that happened to you and then triple what what factors influenced the outcome for you. Casa Castle Infant a 4K II Society in which hotel has no kidding. I gave you think he knows what I Call Polka. Mackey in Gary, Indiana on West Bay this how you Naughty Leprechaun told security Jolla limpiar Su cuarto para el hijo de Gasolina en Carro. Public event tracker say in this sentence Pokemon Johto. No te amos Lee seconds and that was condos at El cuarto recyclable Central in Diablo. Kalia saving audio out about masala dosa Temple Carlos manager know camels Athena Macan s o s a you finish. No, I don't have no voice or no puede Pasar de Chao Brazilian Blowout LAX Uso the focus on the way that correctol. Okay. I love you. So I have I want to speak up on my case because this is something that happens a lot, especially to women and and little is done often because they are afraid about many things. They are afraid that they may lose your job. They are afraid of their immigration status. Maybe it's their only job. Maybe it's hard for them to find another one if they are dismissed as a result of this they have little or no insurance. So usually they just simply stay and say nothing in my particular event. I was as I mentioned earlier 5 to 6 months pregnant and I was going to clean this particular room their guests. The male guest said that he was just back from breakfast and when she went into the room I know if he needed the room cleaned and he said yes or no problem. I'm just going out. So as she went to back to the car to retrieve her cleaning supplies the guess I'll close the door. And so when she came back she knocked on the door a few times. He will not reply initially. He knew who she was coming back. So this was really deliver it what happened next year finally opened the door. He was going to completely naked except for a towel I said, don't worry. I'll be back later. I can clean your room later and close the door. She continued her shift. I had all the rooms to clean. So she she work at 1 maybe another half an hour an hour and but you could thinking I'm really shaken by this. I need to come back and clean that room that is in my schedule. So what is going to happen hisses? Are we going to have a repeat of the same situation? So she she spoke with her supervisor and she said she said no, this is totally unacceptable. Go back in I'll go in with you the two of us we'll deal with this will clean the room if necessary when they came in they guess was already gone. And so they completed their cleaning and left it at that but the following day the issue came up again, and she spoke with Olga who's her union representative. And and she said all this is just an acceptable. Did you did you ask anything that I'm sorry? Did you report this event to anyone in and listen? She's an o or I said no. So keep in mind. This guest is still at the hotel in this could repeat the situation could repeat itself or we could have been even worse event. So we really need to speak with a manager and which I did and Nicholas was dismissed. I'm just reiterating that last night and he said the case was dismissed getting out of us alone. This place. OK Google. Hola como Lo dije. No Magneto esto para me. And it's like I saw you an apology Lo mismo por ustedes tienen Tiempo trabajando con Nosotros ustedes en Esa does bien or get estimate El Resto Del Dia cafeteria separated and he said West Virginia for Saturday to tell me you want me so you meant and Argosy for commercial. So the following day after after I spoke with Olga my union representative as I mention. We spoke to the manager and and his reaction was immediately you should have told me immediately. How come that didn't happen. He mentioned that reminded me that that employees are extremely important to to the business. That although it's common to say the biggest is always right in this case. The employee is someone who's been working there for a long time was well-known and Anna clearly the situation was not right and that he should have never happened. He asked if I was feeling okay, and whether I would want to take the rest of the day off or need any professional help psychological help to deal with the with the event cheese at know that that was okay. He also pointed out of the against was dismissed thrown out of the hotel and told to never return and and the guests apparently faced with a situation except that you're done something improper. So I feel really good that my boss reacted my employee reacted in this way. And in part of the reason is special is because it's she she feared that if she came forward with his story that you might be believed and told that maybe she was inventing something. He was holding her head by the time this case she was immediately believe without question and the she was there with Zillow locate Sammy Soria play say so. Otto airwest Olympus off for Seattle Como pedir. Ayuda. Para. No, no, no. No, nevermind. Why do I see me punto de la policia. Auto India, and the sun with your lentos. Is he a pasado? Ssso internet de las cosas por Las cuales tambien Nosotros estamos Muy Bueno on a lot of my solo. Suena como estas. I know they're so so thank you for letting me share my story. This would be all but I also want to refer to another very troubling incident that happened to another fellow employee of mine. I in this particular situation the complete add a note on the door of a particular room and the guest on only male try to actually pull her in and for a few instance. It was actually a physical struggle between the gas station and the employee she cried for help in there. But fortunately she was on the first floor where there were other people about and police were summoned and under guess was dealt with thrown out and it was resolved. She was lucky because she happened to be you and Ian area that was accessible on with some put traffic. But if she had been in the 4th floor, maybe she will not being so lucky you no one reads about also people being armed and and so so they concern of physical aggression assault is a real one funny buttons are good as well as well as a good starting point, but she would but I would hope that there is a better or more effective way of doing this. Maybe it's something that also know it's the location of the employee another another particular. So so the right amount of help can be someone immediately Thank you. Thank you very much. Then level grass at the Norva. I just want to remind me about 15 more minutes and thank you again for incorporating the stories really appreciate it. I'm so just quickly provide some some kind of hate of data about sexual harassment that came from the survey. We did a members weed 53% of housekeepers are putting some experience of sexual harassment or assault over the course of their work by far. The most common incidents was being flash exposed to nudity permacast other workers are part of your corner during lewd remarks are comments being propositioned are offered money for for sex in fifty 1% of workers surveyed said that they wouldn't or didn't report sexual harassment that they'd experienced. I'm an egg. And this is also an issue of Economic Security for families, according to data from the National Council for research on women women are nine times more likely to quit their jobs. 5 times more likely to transfer jobs and three times more likely to lose jobs because of workplace sexual harassment. I'm at 80% of women who have been harassed leave that job within two years. So it's you know, I can about the workplace safety issue, but also something that has an impact on on the ability for women hotel workers in particular to be able to support their families and I think we've seen from this Prison from that day. Clair need for additional tools both to prevent workplace sexual harassment and then to our workers to respond to harassment when it does occur without I'll move into talking about Healthcare. I'm staying at you want to start us off and talk a little bit more about the challenges that you faced being able to access healthcare for yourself in your family. Okay. Not me personally, but there are some people on the banquet to work on several places on court. First time. That means that they don't get medical insurance in any of them doesn't matter if they were. 80 hour * 120 hours or more and that's an issue to 10% of them have that the issue but I still have some issues even as a full-time that I am sometimes. I don't get full-time hours and that's place cuz the business depends on Seasons depends on the weather. and so on and the Sometimes that are a risk that if you don't work a certain amount of hours, you might lose your medical insurance and you wait for the month or two. It's complicated and guess that's all you have now. Expensive deductible. I pay less and it covers less obviously. I haven't used it yet, even though I can I'm paying for it. It's not really what I need cuz I have a lot to do with my body and then I hope I will be okay. What is your deductible? 3500 deductible yats to pay per month for that plan. Right now is like 54. Her check is cuz I choose the cheaper one because the expensive one was very expensive for me. It's an almost impossible decision hot to choose which health plan. I really like the foundation that was earlier set and the conversation around the initiative because really we know that the gold planned is the best plan that folks could choose but having to think about how you can afford that just on your own and they exchanged for example is almost impossible. And so I totally hear you a lot of people make the decision to pay less per month, but then if something happens and it's so much more expensive and that's just scary and stressful have a medical plan in the end of the year. When you pay the taxes, you still pay for it, even though you didn't have it in and used it and there's another thing that other employees say to that if you have an expensive one. You will pay a lot. You will not use it all of their benefits. I was about to say something else. I'd it if you ran out of my mind. And I think that the thing that you're saying is really the access issue is the most important, you know, it's one thing to say Hey you have insurance, but if it's not accessible and then it's really not a piece of mind or a safety net. Thank you for sharing that and for bringing your example pay stubs. That's very helpful. Yes. I'm glad we look at at Bureau of Labor Statistics data nationally about worker access to employer-offered health care workers that accommodation in Food Service establishments have the lowest rate of Medical Care access the lowest rate of participation in plans when they are offered and the the lowest rate of take up. So it means you know, those workers are less likely to have access to plan and then less likely to take it when it is available. I think for a lot of the reasons you just heard either premium costs are too expensive or deductibles and other costs are so high that it it just doesn't make sense. Our folks are unable to to take those costs on they think they're also unfortunately some real limitations the extent to which the ACA has expanded access for workers. And we see challenges in particular were employers offer you no minimum value plans that then mean that workers are in able to access subsidies tax credits when they go to The Exchange to purchase. Either a higher level of insurance or insurance for their families. And so they're sort of stuck in this position that we're the the plan that's available to them to their employer is not one that actually creates Healthcare access because that's the associated costs are too high, but they're also not able to get help to purchase a different insurance plan. They didn't know we see a clear need for some additional compensation for workers to be able to actually access Care. Thank you. I'll come from Gonzales on this issue. I I think that the the value in which the provisions of 12124 they're rooted in improving access to Medical Care is super important in my reading of the now legislation. It doesn't seem to have a requirement that the money actually be used to purchase health care and can you and to me it makes sense? To try to figure out how to marry the two in particular because I think that I get concerned about there being readily available money and when you are already making not a lot it's tempting to take the money and then if there isn't an actual work requirement to purchase health care insurance, then I think that the intent the underlying intent of the law which is to create access to healthcare is potentially being undermined in a way that wasn't intended. So, can you talk a little bit about sort of a potential Gap there between the intent and the actual letter of the law? Yeah it for folks and disagree about whether it's fortunately or unfortunately, but I think there are some limitations around what the the city can can stipulate in terms of health care provision. I think the a clear objective of the original initiative was to make sure that workers were receiving additional compensation that genuinely reflected the amount of money. They would need to actually go out and and purchase a healthcare plan because if if workers Burdick add an additional two or three dollars an hour towards Healthcare, that's great. But that maybe he doesn't actually get them that far in terms of actually, I'm accessing the health care that they would need for their families. So I think we certainly tried to address that concern in that the the payment is structured to actually reflect. The cost that the folks would face based on their insurance needs but I think we would be very open to thinking more about on the the worker side. What could be done to make sure that that folks are actually using that money to access sticker. Yeah. I mean, I'm not calling into question the valuation around the cost of the insurance but but I do have concerns about about making sure that work connecting the amount of dollars are being provided to workers to actually allow workers to be able to purchase health insurance in and whatever Market they choose and so I think I think for me there's a there's there's a and a little bit of an disconnect currently around verifying that the employee actually utilize the the money to Access healthcare and ultimately I see The shared goal right as we want a healthier Workforce it helps to address some of the work injury issues that we've been hearing stories about in that you highlighted in your presentation and we're not really truly allowing workers to address those fundamental physical mental health issues with insurance. If the money is going to be used to purchase other stuff that meet basic needs but aren't healthcare insurance. Is the other thing I would say is just looking at other cities that have sense thought about these issues and taking some kind of action Daniel Kahneman suspend particular. It involves insignificant infrastructure from the city in order to establish a system where folks are more directly accessing care. Yeah, and I think you know in the minimum wage context There Was You Know slightly different kinds rubric to create a greater incentive amongst employees to just provide that more affordable insurance directly to employees. And so that might be a potential for us to explore as well in terms of a model here. I want to do a quick time check in about 2 minutes. Can you very quickly I think of hotels as as business that makes businesses that make money to operations. I think they are also serve as real estate asset Center are bought and sold from that perspective. And so I knew we see pretty frequent turn over either in the entity that owns a hotel or the entity that's operating that hotel off in those those two are different and she is and either of those changes can be very disruptive to the workforce of the hotel can result in in folks who've had 5 10 20 years of experience losing their job because the new operator wants a clean slate wants to bring in workers at a lower wage and benefit level. And I know folks I think a system of the fights that our Union has had in these situations to make sure that an existing workforces able to retain their jobs during a change of ownership. So there's just a quick list over there and in the industry probably has better data than us on this but this is our our record of the the hotel say I was just in the last 3 years in Seattle in the number for Chris compacted. So I think the the last piece of the initiative in the Peace by we really saw action needed for workers was to make sure that there was a worker attention so that folks were able to maintain their jobs maintain their economic stability when their hotel was bought or sold and I will end their internet back to you. Thank you. Thank you gracias de Nuevo thank you once again for all of your time and your stories and as we talked about at the last meeting, this is just one of a series of meetings that we plan to have through the spring and early summer. See if any of my colleagues have any comments before I wrap up on the section. I just really appreciate you joining us at the table and helping us craft good policy that replicates the initiative that y'all work so hard on getting past and making sure that the city is supporting your efforts to be safe and secure and have access to health care in your job. So thank you. I'll reiterate that again, please tell all the folks that we did meet on Friday. And before that on Christmas Eve. I think I saw a number of people in news was coming out about the lawsuit. So we don't we really appreciate people being willing and able to come to the table again. We apologize for the formality of this but it's a very very helpful for us to hear those stories directly just a few reminders before we wrap up the section. We are definitely interested in tracking some of the news that will be coming out. We believe later today about the ruling on initiative 124. We know that we're supposed to hear back on the Supreme. Decision on the pill later today, if if not tomorrow. I think we were also the game I've been yesterday. We also know that some of the current protections included in this has 124 are not currently doing being enforced though. It's great to hear some of the good examples of some of the employer's enforcing elements like making sure that people are getting kicked out if they are behaving poorly and harassing or intimidating assaulting people on so we are very interested in continuing to hear additional information that comes from you from folks that Unite Here from other workers that you work with specifically elevating the voice of women of people of color of folks who are immigrants predominantly working in this hotel sector. We really want to make sure that that voice is clear and present in our conversations around around the policy moving forward. I want to reiterate that we are definitely going to have some of our friends from the hotel sector as well. Come in May to share some perspective. You know, this is part of what we did. Domestic workers Bill of Rights discussion having employers and workers at the table. He'll Fest in the end come up with really solid policy Solutions. So that will be forthcoming in May and I just want to close by thank you gracias to the workers. Thank you to my Council colleagues. I were working hand-in-hand with the mayor's office as well and we'll be having additional conversations with the hotel folks and will continue to engage with you as the representatives and the direct workers in the hotel industry. I'm to make sure that we put some very commonplace protections back in place and in statue in our city. So thank you. And with that we will close the section. I move onto item to before we do that. I did see that there was one other person who I called earlier Charlie. We did have a timer for public comment here. I will open that up if you're still interested in making a few comments before we get into item number two, so we are opening back up public comment for the record Charlie lamb come from Martin Luther King County labor Council, welcome to the microphone, but I'm sorry I missed it earlier today because I wanted to thank all of you. For working on this issue. We all know voters overwhelmingly passed i-124 just like they passed so many other worker protections because the city cares about protecting our workers is special are most vulnerable workers. And so, you know, we all know it's an injustice that this lies being held up in the courts. And so again, we just want to be half of the whole labor Community from hotel workers to janitors two security officers. We want to just thank you for a really taking this song riding the Injustice making sure that these workers get cemented in law just like the voters intended in 2016 thinks those are public, Crown officially for today. Thank you Charley for sharing that and put it if we was could you read the second item of business into the record and well, she's doing that. Can I please be joined by Dave Westberg and Mike? Be from iuoe local 609 for a first panel. Oops, I don't think your microphones on sorry about that. Send item to paid sick leave and time off for Seattle School District employees for breaking in discussion. Well, thank you so much and thank you for being here as well too long. It's right. I had the honor of working with Dave Westberg in the halls of Olympia for a number of years as we worked on labor protections when I was with the state labor Council and it's a good segue. Thank you Charlie from the seal see you for your comments around labor protections and making sure that we're protecting those because one of the things that we worked on right here in Seattle a very long time ago was paid sick and safe leave and we know that some of the workers who are around some of our most vulnerable populations being kiddos need to have access to sick leave and appropriate and robust sick leave. So this is one of the first issues that I had the chance to talk with you about when I got elected and I will admit it's been far too long in the making that we're getting to this day, but I'm really excited to be working with you. I'm too that's incorrect some small pieces. Fixes that we need to put into place to make sure that your workers are kept also invite you to introduce yourself at the table here. So folks have and have your name for the record and then we'll get started. Thank you. Mike. McBee business manager local 609 Easter Avenue. And if it's green, then it's on David Westbrook retiree retiree Club. 10 minutes ago. We didn't have a retiree club now we do. Well, thank you for a couple weeks ago. That although he's not leaving until this issue is a button. Well, we don't want people to jump on the bandwagon for that reason when you believe in something it's hard to retire you just move on to the next chapter and this is unresolved chapter from my years with the union and representing classified school employees at Seattle School District members, depending on how many vacant positions we have in a particular week that has and other workers at Seattle schools. Don't get coverage for paid safe and sick time and then we're not asking for safely sick time or asking for a means of enforcing and have a place where we can go to complain equal protections under the laws what we're seeking and in a and I know I'm doing all the talking so far Michael stopped at the moment, but in organization is highly stratified hierarchical organization, like the school district is that values education and primarily and values having matriculated in education. We sometimes often Overlook those people at the lower end of the economic scale and I think that's what happened here for one reason or another we're not we're not down here often. We generally handle our own problems and that's how we prefer to do it. However, there are times and we've had this in the last couple years primarily with women immigrants minorities who are who make up the bulk of our largest a second largest group of 200 in nutrition, they get very unsettled by the way. They are treated at the school district. When they are when they have serious medical conditions, I can rattle off names, but I'd rather not a group here today. They'd have to take off the job and we have not lost anybody but we've had to call upon offline workarounds. If you will to protect these women and 1/2 of 4 women and 1 Man names to remind myself for their stories, but they get very upset and they're told well if you run out of leave will you just have to quit and resign and come back as an entry-level person and when you've worked for an organization for 20 years or more that's not how you expect to be treated you had some pride one of the ladies that that Lisa met here a few weeks ago. She I didn't get a chance to tell you but she lives right across the street from the school. She's so Proud of that little is it High Point High Point House of hers and that she can walk across the street and walk her dog and she thought about getting back in there and get back to work from September until March 7th when she came back often and it's hard to avoid that when it's right outside your house and a part of it. We want to give people the incentive to over to get through medical emergencies and come back to work without the threat of losing their jobs over it and that's the problem in a nutshell. This is related to an effort that's been in the works for a very long time right Seattle pass. It's paid sick and safe leave ordinance in 2012 to ensure all employees in the city have access to paid leave at time to care for themselves or their family and really excited that our city continues to get national attention for leading. The way on the sick and safe leave effort. We use this momentum and the initiative 1433 effort to really takes it is Statewide the commitment that every worker should have access to paid sick and safe leave but we also know that without adequate enforcement those words can just be cute pen on a piece of paper and we need to make sure that workers both know their rights can access the rights and also that you have a place to go to in case those rights are being violated. Unfortunately. We see some discrepancy with how the classification or categorisation of sick of a School Employees are being applied in this situation. So today we're really excited to hear from you as you think about the work. That's to come here. We have some opportunities to have some technical fix this to make sure that were applying paid sick and safe leave to the school district as well. And as you heard will also hear an opportunity here from school remember to Wolf who's interested in this issue as well. So before we get there, though, go ahead and tell us more about what's on on your to-do list here for us and looking forward to working with you at the Seattle School District Under the Umbrella of the city ordinance. I think it was an oversight and it's something that we can Rectify and we should as Dave said, you know, we've got we've got sick leave our members accrue. There's federal federal and state access to that. They can take time off but the loss of the lack of enforcement is what's really hurting us. There's also the ability is Dave said we're very large percentage minority a large percentage of immigrant the ability for the union to bring issues forward on behalf of our members is lost to us at the state level and we look forward to Opportunity at the city level investigatory processes that are covered under the ordinance as well as penalties. We oftentimes see the school district to see the employer is a may have to give some back pay here and there but it hurts when you know, there's a finding against them. We're small local and do we represent our members very well take him to interpret Labor practice grievance arbitration and whatnot. But another opportunity another Avenue to rectify these wrong is always welcome for our members. Not every case is something that you want to take arbitration not ever cases and unfair Labor practice, but that doesn't mean that there was sick and safe time days aren't critically important to our members and the ability to have an agency assist the worker and rectifying those wrongs that they May be subjected to is critically important to us. I do see also representing from that off of the labor standards in the audience. If we do have questions as well want to thank you for being here and you're always welcome at the table. And I think one of the things that you just said is really important as we think about our lessons learned from labor standards enforcement specifically around wage-theft. Obviously, it's impossible to be in every industry or in every business, but just the ability to know that there is an enforcement mechanism to fall back on often deters violations from occurring and so I think that it's not just education and enforcement it's the fact that this will now be something that you can refer to so hopefully it will be a preventative measure. I love that you brought that up, sore questions. I just appreciate the clarification that you're receiving. Your employees are receiving the legally mandated sick and safe leave that said it occurs to me that you know, some of the exemptions in in the ordinance were out of an understanding that other regulations warm place that require that employer to provide sick and safe leave but without the understanding at the time that the ordinance serve two purposes not just to require the employer to provide the leave but also to create the mechanism for for the enforcement locally because sometimes it's more difficult to get other jurisdictions to enforce those those obligations. So I really appreciate you guys bringing the Forward I appreciated work meeting with the teacher at West Seattle high. Thank you and I am just wondering if there are other exemptions that were put in the law that might have the same the same problem for their Workforce. I've looked at it a lot. I don't think there are that are the same characteristics is to Seattle School District, which is wholly and completely contained within the city of Seattle. I can understand how do University or the county or you know, the port any of these things. These are at external entities to the city every one of our members works in the city of Seattle. And that's the point of equal protection as far as the that fabric of other laws. Don't get me started. But that's the nature listening to the other workers here today the nature of this work primarily in nutrition where you're at Food Services, you're working adjust the school year, you're working perhaps short hours, perhaps more than short, but you are there so many pitfalls to fall through the Family Medical Leave Act coverage 1250 hours per year worked. That's A lot of hours for a school year person full time is 20 mm. So you have to work more than half time to qualify their log Washington law against discrimination of very very stringent law that we got in Olympia here a few years ago doesn't apply to dependents. So I have one lady that right now razgriz adult son with colon cancer stage 4. She's trying to take care of him as long as her leave will will last unfortunately, we tried to use an argument of washing logins discrimination doesn't cover dependents. And so, you know, there's a number of different pitfalls. I'm not aware of those other exemptions in the paid safe and six times but there sure are a lot of exemptions and other laws that need to be fixed after we do this one my friend from Alaska off of the liver Center had to go but there is this ongoing conversation that harmonizing I'm at the macro level on this micro example because of the narrow scope of the correction. We're trying to include my hope is that we will be able to circulate to you all on draft legislation before the end of the week so that we may consider this at our next meeting in two weeks. Are there any other things that you all would like to share but introduction next steps and add a meeting in two weeks. Would you like us to bring an example of one of the ladies that has been harmed by this? I'm definitely we will follow up with you on that if that's something that folks are comfortable with that. We always welcome those voices of the direct workers at the table and appreciate union representative leaders as well. Cuz we know you bring their voices. Well any other things you'd like to ask what we really appreciate you being here and we do have one more panel. So we will thank you and will follow up with you with the legislation emotes Pacific time and Next meeting at this time. We like to welcome board members Zachary the wolf who has been very kind to engage with us on this topic and I really appreciate his ongoing commitments to labor standards listing of workers, especially workers of color women the lgbtq community and immigrants and refugees Zachary. It's great to see you again board member to Wolf. Thank you for being at the table with us comes number Gonzales and I were thrilled to have the opportunity to see you almost every other night when 2017 and haven't got the chance to see you as much lately, but I'm glad you're here and thanks for being here and go ahead and introduce yourself for the record and tells your perspective on this issue set departing herbold for inviting me today. My name is Zachary woolfe for director with the Seattle public schools, and I represent District 5, which covers Capitol Hill downtown International District Center. Mystic Lake to the the sound I guess you could say and then the cut to the 90 about so first actually come to you last year in 2018 and September I was grateful to connect with some of our labor Partners particular from the building and construction trades Council as well. As some other folks from labor Community to begin exploring ways that are Seattle Public Schools might join Partners from the city the county the port and Sound Transit and their commitment to workers are communities and mostly folks for the farthest away from economic Justice by implementing our own Community Workforce agreement. So last time we officially brought CWA Conversation Set to public schools and we will look forward to with a resolution and might be strengthened by what we see is the one resource that we have at Seattle public schools, which is students. And so we're trying to figure out ways that icwa might be enhanced or supported the time. Have a great resource and thank you. Yeah, and as far as are both r609 partnership, but all of our labor printer set that contribute to Seattle Public Schools. I mean, they are some of our greatest contributor store Student Success. And so we do strongly support our workers in unions as part of the patchwork of folks who make her school district run smoothly as I understand it you have you just mention it a minute ago. There is work on going on language or Amendment and I think we would obviously I would want make sure we had some staff here pretty boy from HR and finance deeper conversations, but we are eager to work with you on ways that we might ensure workers are supported and can really rely on their players like us as have a public schools for support when it comes to paid sick time paid sick leave in time off. So we we are looking forward to being up the partner Network. I appreciate you saying that I also recognized that you are a different jurisdiction. So this partnership is really critical. I have really appreciated your interest in this topic and you're interested. I think what we're trying to do as well which is lead by example as public employers. I think it's really important for us to show the rest of the city that it is important to implement the rules and policies as we pass them at the same level. And in fact we've done so especially around sick leave and minimum wage quite literally the sky has not Fallen as people were concerned about the headline actually said that in the Seattle Times and we seen greater economic activity so has employers I think we're in the business of showing that this is not only good for the workers, but it's also good for you know, the business and is public employers. We need to show that this is absolutely the right thing to do and when we do that at together, I think it shows a unified for so I'm really excited that even though you're in a different jurisdiction, and we really can't tell you what to do. Is really critical that we do have Harmony that we standardize these these application of the rules. And as you heard from the earlier panel that were not greeting car voucher exclusions for workers in our city. So it's exciting to see you here and family members under right in our our school. So we should we do on Altima support them recently. So let's just a continuation of this strong partnership else that you want to give us an update on Pastor strategic plan probable. I would say when the most Innovative with a real strong centering on students of color particular black African-American males, and so kind of retarded universalism philosophy we We're going to do some really great works were looking forward to that good a good note to end on so I think do you think so earlier panel from the leadership at 6:09, and we will be bringing this legislation forward to our meeting on April 18th will get a draft out to folks to look at ideally by the end of this week, and then we should be able to have that on the agenda for our next meeting along with a high-level briefing on yet another housing and land-use issue Fort Lawton. We will have a chance to have a comprehensive overview of the plan and land-use proposal and that and that should be meeting. I think we'll go this and a journalist is another coming seeing then the meeting is adjourned. Thank you all for being here today and thank you for today for stopping us today.", "end_time": 4927.5}]}