{"format": "raw", "annotations": [], "confidence": 0.8935986533761024, "data": [{"start_time": 0, "text": "Good afternoon. Thank you. This is the meaning of the Civic development, Casas. The name can use committee. The date is April 3rd in the time is 2 p.m. I'm council member Juarez chair the committee and I'm joined by cancel. Never knew I was going to sit in the skating actually Road council member Gonzalez. I'm sorry excuse for 10 days a Committee hearing today. We have a shortage and then we speak we have we have two appointments for the board of Park Commissioners, and I want to take this moment to take thanks Paula who's here from parks for traveling to City Hall to present their candidates as well as our Acting Superintendent Christopher Williams and his team for their continued leadership and hard work providing quality services to the people of Seattle and Seattle Board of Park Commissioners is a volunteer Advisory board established by or against the Borg consult with and makes recommendations to city council the mayor and the superintendent regarding parks recreation department policies for the planning develop and use of the city's Park and recreational facilities. The board of Park Commissioners is a nine-member citizen Advisory Board serving three terms. Four members are appointed by the mayor and confirmed by city council for members are appointed by city council and one member is appointed by the get engage program and I understand today. We have two people Mister Evan Hundley and Kelly McCaffrey will both be Seattle City council appointments. With that I will go to public comment neguin. Do we have signed up? We have Alex Zimmerman. So just one person, okay. oh, okay, babe 2 and so as you know, the rules just state your name and please speak to the items on the agenda. You have 2 minutes. Mr. Zimmerman. My face, come on. What's going on? A sermon let stop the car for one second. Why is it don't show my face? Enough to stand by cuz they're trying to fix audio technical problems. So until they call me back. We are asked to stand by. Okay, thank you people thrown from animal Animal Farm. We have two people signed up. Okay, the first Alex Zimmerman second David Haynes paymasters. Everything's done with Mr. YouTube minutes are done. Yes. Oh, so it's about this? Okay, no problem. Thank you. I just want to make sure the city council realizes that when they do nominate folks and expect them to like represent proper in the Parks at the superintendent's need to know that there's certain employees who were training some of the parks and rec employees when they come down to the lake to Canal area and the guy tells you people he's training stay in the truck looked on the bike path. Keep going if you don't see any Trash. So all these locals have to pick up everything on the outside and it seems that the parks and rec has found a lazy way to take as many trash cans away as possible to make it impossible for people that they wanted to make the effort and I think we need to like keep some of that like suspect Union like accountable for like having more forthright diligent efforts in the honest day's work that they're getting paid. So please like the other superintendent overseeing these folks make sure that they got like the proper diligent like sober and not hungover employees showing up to clean the parks and what Thank you, sir. Correct. All right. How do I get to appointment today? I'll let negeen to do her job and then we'll start. Appointments tr1278b appointment of Evan Hundley as member Board of Park Commissioners for a term to March 31st. 2022 Domino Park Board member he has a long family history of Seattle Parks and Recreation his father infect with the superintendent at one point. He's also been very active in teaching tennis lessons in her public courts holds a master's degree in public administration and urban planning and he's got a great thoughtful balanced approach the issues that come before the council runs a wonderful local middle school, and he's a great addition to our board. Thank you, Paula Hough. I just introduced you. I'm just going to say a few words. We know Evan and we've work with him on a lot of issues and I'm really glad that we're going to do this reappointment and he used to work for the city of Seattle as well as senior budget analyst and he says he's just really good at all this stuff. So I'm really glad he's back. Is there anyone and cancel my appointment of 01278 all those in favor? Say aye so we move forward on that appointment and presented to full Council on Monday. an appointment 01279 reappointment of Kelly McCaffrey as member Board of Park Commissioners for a term to March 31st 2022 Great Kelly is also the chair of the park district oversight committee as well. As a member of the board of Park Commissioners. She also has a master's degree in public administration Environmental Policy from the University of Washington. She is a great board member very prepared and works hard. She's been really instrumental in some of the Outreach that we've been doing with the community in which we will continue to do and we're excited to have her back on board for another term. Thank you. We've we've been work with Kelly to and from her resume to we know that she still did share this hill Parks District oversight committee and she's had a ton of work with parks and Washington State Recreation conservation office with the RCA which we work with and she just has this incredible history to with the Seattle Public Utilities and all the work that she's done and water trust management. I'm glad that this is a reappointment so with that we should be okay. Should be great. Okay, so I move the community pass appointment 01279 7th St for Council on Monday and thank you Paula. Okay, so the next meeting of the Civic development public assets and named treaties will be Wednesday, April 17th, and with that we stand adjourned. Thank you.", "end_time": 514.2}]}