{"format": "raw", "annotations": [], "confidence": 0.9460627018631279, "data": [{"start_time": 0, "text": "Good morning, energy in workers rights committee will come to order its 9:33 and I'm Teresa must go to the chair of the committee. So excited to see a packed house again on these topics. I know you are here to talk about the first item on our agenda. And the first item is a briefing and discussion on the Human Service Department contract inflationary adjustments. This follows. A really robust work session that we had about two weeks ago. How many of you all were here at that work session. Thank you so much for being here. It was a packed house. And if you weren't here, I feel the media's watching online. It was standing room only and we had about two hours worth of testimony at the table about the need for human service provider contracts to have at least an inflationary adjustment for incredible organizations that are taking care. Of our seniors of our use of our families of folks who are experiencing homelessness and those who are trying to prevent falling into homelessness. Oh, thank you so much for all of the work that you do on a daily basis and thank you so much for being here today. We really appreciate it. Thank you so much for coming. I was just checking that the first item on our agenda, which is the Human Service Department contact inflation adjustments, which I think is why we have a packed house again today. There's two other items on our agenda. There will be a briefing impossible vote on the housing Administration and financial plan. This is what I like to refer to as the moral compass for the office of housing in terms of how they use their dollars. We want these Dollar City going into affordable housing across the city and ownership in side control, especially for organizations who and individuals who work directly with those who've been experiencing displacement and to build affordable housing not just units but cultural centers with childcare and Plaza and small. Minority business opportunities and public spaces and Senior Center. So that'll be the second item on our agenda. And the third item is 89537 which modifies our City's notice of intent to sell legislation. So this is four properties that have two or more apartment units in it. We want to make it more possible for those who are renters to have an opportunity to maybe purchase those buildings if they got for sale before they go on to the market and for our nonprofit housing developers to have an opportunity to make an offer before it goes online on to the highest bidder in the in the market out there. So this is a really about leveling the playing field and creating a notice of intent to sell so tenants and nonprofit housing developers have a heads-up on when those properties are going out no objection to today's agenda. I will approve today's agenda and moved to public, exactly on time at 9:35. We do have quite a few people signed up for public comment. So, thank you in advance for being here. David you are first in line today. I know you get here early. Appreciate it. Thanks for being here. I've never seen so many motivated homeless service providers before they only get fired up when it comes to getting paid their ill-gotten gains city council versus counsel members and keep the dialogue respectful for our rules. Buying off the subhuman mistreating service providers. It's obvious city council is using tax dollars to buy a political activist organizers and operatives hiding behind unaccountable nonprofit who's six-figure salaries by off our politicians and trade re-election support for no accountability for all the bankers hours half-hearted effort tainted with a nig nobly racist agenda and hypocritical priority that discriminates against innocent sober drug free homeless citizens judged harshly deemed entitled. YT bikes giving his very people who think they're entitled to another yearly raise shame on this treasonous lie corrupt and unconstitutional agenda of race asleep reverted unqualified-id end up subhuman service providers depraved reason. The home is priced will never even though they should all be investigated and fired occasion. People should be ashamed. All right. Thank you to the next item of business. The next person who signed up to testify just says d e s c and 1199. I don't know if there's a group that wanted to sign up for a DSC great in the next person will be the next group will be 1199. So we'll come up and is there more than one person that will be speaking? Thank you. Thank you. Helicopter members thank you for the opportunity of speaking to reset your time Cafe. And I'm the director of housing programs with dese a very large Human Service organization here in Seattle nearly, 700 employees and operate out of 19 locations across five council districts here in the city of Seattle daily DSC serves roughly 3,000 people living with severely disabling conditions to leave marketed Health marketing healthier outcomes for our clients study after study after study have proven this point. However, it's cost of business naturally increases over time. We're faced with making tough decisions, but had to stay in this very success weather be the cost of healthcare utilities are basic repair maintenance the cost of doing business increases year-over-year, but a contact revenue does not This really affects every aspect of our work but none is greater than the effect. It has on our staff our staff are the lifeblood of everything. We do a DSC the passion and dedication of our staff is matched only by their skill and expertise. Like all professionals DSC staff to go years of training education and experience to become a skilled Workforce that they are, but when wages cannot keep up the cost of living our staff the face with a very real decision to leave the work that they love and have a deep passion for simply in order to make ends meet without reliable inflationary adjustments for a contract. We are unable to retain the skilled staff that service the linchpin to our work with nobody paying a higher price than the thousands of honorable people. We serve everyday we are simply asking that we ensure we don't continue to lose ground year after year. I want to thank the council for the work that was done last year to make inflationary adjustments HST contracts. It was a great start, but we need to continue on the Severn. Thank you for time. Thank you so very much. It's okay to fly. 99 welcome and Then followed by that will be is still at Ortega executive director of El Centro. What command do you have more than one person speaking today? Okay, so Okay, so because you have a group we will give you the five minutes, and then I'm if you guys can use all that time together. Thank you. Welcome. Perfect. Okay, my name is Patricia Towers. We are here representing SEIU 1199 Northwest in support of council member Teresa Moscato proposed inflation adjustment on human service contracts. I work at the front desk front lines at DSC for over thirteen years clients come in our building in expressing to me that they see they recognize my face more than they do that case managers. They can in some cases have 6 case managers in a year-and-a-half because the turnover I'm this morning when I was getting off the bus coming here when you walk over a human body sleeping on the sidewalk, I think about Seattle and I think we're such a rich city that this shouldn't continue and that it's fixable in support of Teresa mosquitoes proposed inflation adjustment on Human Service contract also my coworker and friend clatonia van spoke last week on she said imagine having a new teacher every year how you think that would shape a person's foundation and last week the more than AIDS cancer diabetes drugs disrespecting human life is the highest killer of all those diseases. I was stunned at the percent. So we support you Teresa mosquito and thank you very much for having us here. Hello. I first of all want to acknowledge the work that both of you have done and your continued commitment to to addressing this issue in our city. You are walking the walk. Only just talk and talk and we appreciate that a lot. My name is Andrew and I worked at Evan's house and I just wanted to share a story a short story illustrating. Why not only do we need to be building more housing but to sustain the housing that we already have Evans house is a 75 unit Supportive Housing project. We primarily have people who are being discharged from long-term psychiatric hospitalization. I started there about seven or eight months ago and almost immediately when I started the elevator broke down we have a lot of people there that along with psychiatric illness is also have physical limitations Walkers wheelchairs limited Mobility. I having the elevator down was very challenging for a lot of reasons. We offer a lot of services including medication management and Meals On Site. We definitely suffered in terms of people being stable on their medications because they wouldn't be able to come downstairs and that took just about six or seven months to fix because money wasn't issue with our facilities manager. They said, you know if we had a huge budget this would have been fixed very quickly. So that's just a short story about why this type of inflationary increases incredibly important to us. It just helps us be able to do our jobs. Thank you. My name is John a mental health case manager and I specifically chose this position with this organization for the work that they do which is so vital to the health of our community. I work with amazing and knowledgeable people and what the most frustrating parts of my job is the constant as the destruction of that knowledge due to the high turnover rates everyday. My inbox is filled with advertisements from indeed for positions that pay more and every day on face make that decision of working with Seattle's most vulnerable individuals and my own financial securities turnover rates, which affect many of the organizations represented here today have tremendous impact on our clients who often are sharing the most intimate aspects of our lives with us as we try to help them into housing at the city. I think we can and have the ability to do better and we appreciate you bringing up this legislation. My name is Gary healthy. I work for the mobile crisis team also part of GSC. Although it's a county funded program County programs. Don't work with City programs. Don't work. We help alleviate SPD and sfd response times. We take clients today Center shelters. I change centers food banks. So entry level program. So inflation increases help sustain basic programs retain staff and support So social say, thank you. Thank you so much. My name is David heldi. I'm a housing assistance case manager at the main shelter and does not much more time. But there's a certain level of turn over there people just don't make the money that we need in order to to live in the city. That summarizes it well, thank you very much. Tigger followed by a crew together because we welcome all of you and do I get a little bit more than two minutes because we have a group here. Thank you for all being here. Good morning council members. I am instead of paga the executive director of El Centro De La Raza El Centro De La Raza provides 43 comprehensive and culturally competent programs and services to over 14,000 children use adult families seniors each year with the staff of about 140 people and on an average, we utilize anywhere from eight hundred to a thousand volunteers a year. And so you can see that we stretch the dollar very well the city of Seattle needs its Human Service organizations to be strong to help individuals achieve their full potential and a way that is valuable to our City Mini Human Service Advocates have dedicated their lives to helping build the infrastructure to provide services that strengthen our communities to live their lives. The dignity and respect this work dates back to the source of survival Services Coalition back in the 1970s as providers many hats and advocating for Community needs. We are crucial to maintaining a healthy democracy and representing and ensuring Community needs are heard in addition. We provide spaces for the broader Community to volunteer providing an additional public good. And other organizations have testified we also continually face turn over because our salaries cannot compete quite frankly with City County and state government this in turn affects the effectiveness of the services we provide at a loss of Staff capacity every year. We see annual rising cost and health insurance and general operating expenses that increase our fundraising goals as we know most foundations will not pay for General operating support. We need stability and continuity and our service delivery system to achieve our outcomes that lead to improve lies of those who need a helping hand we argue to support an automatic adjustment for inflation for all human service contracts me. Gracias. Thank you. All so much for being here is someone who studies? We will also have a chance now to hear from John Barbie 10 Tina Ellison, and I'm sorry John if I didn't pronounce your last name correctly. So, I'm John Barbie. And and this is Tina Ellison and we're here on behalf of compass housing Alliance. One of the things that we do is we provide emergency services in shelters as well as affordable housing for the city of Seattle's most adults and one of the things we're noticing as we just did a recent study that our annual turnover rate of our front-line staff is over 40% And the number one reason during the exit interview is the lack of compensation as well as many of our staff have to commute a long way to live outside of the city limits because they just can't afford to live here. So with that in mind, we're also asking these staff to be the most trauma-informed asking them to do the most the most darkest of the most challenging the most adjusted the most important Work Fit to meet the needs of many of our client. And and we need to support them. We talked about supporting the gas in the clients that we start throughout the community. But as employers, we also need to support our staff and we need to make sure that they would provide them with the brown work to be able to do the work. And so I like on Tina to share a few words as well, please and I actually thought Tina Ellison was part of your last name. So you do have more time. Thank you. So just to pay me back home just to pick it back home with John is saying is that we have seen such an increase in the need of our clientele as I'm sure everybody else here has like the gentleman earlier said, you know people moving at our permanent Supportive Housing are coming straight from the hospital. So both psychologically fragile medically fragile physically fragile aging populations on top of mental health and substance use issues the behavioral health piece. That's just not going to go away until for us to be able to have the staff. Better qualified and capable of doing that work. We just can't pay them the same as Subway does right because it's really important that they are the skills. They have the skills in the supports to maintain that job because what it's good for is the clients that we're serving, which is been good for our city. So we are all in support of the wage increase on just one Note 2 as well, 80% of our programs are funded through hsd contracts and so it's an important funding source for us, and we want we want to create stability growth of community. Not only with our programs that we want, but with the staff that we that we can play as well. So, thank you. Thank you very much. trim, followed by slim, followed by Brian Simpson And then Aaron, how about Aaron? Would you like to speak Aaron, followed by Brian Simpson and then we'll be a Mia. or Ellen Welcome. Thank you morning council members. My name is Erin Coomer. I'm here on behalf of youthcare's board of directors in support of an annual inflation adjustment for Human Service Providers Youth Care Service Youth and Young adults experiencing homelessness in Seattle and King County. I've been on these carriers board for six years and know that this is a recurring issue the topic of Staff wages Recruitment and Retention have come up almost every board meeting as Evelyn Korea are Human Resources officer shared last week you cares annual turnover rate in 2018 was 38% and this year. It's now 44% Our partnership with the city is very important to us. We know that you share youthcare's Mission and ending youth homelessness here in Seattle. It's very hard to fulfill that mission when turnovers constant and positions remain vacant. Twin City contracts don't cover the rising rates of inflation providers have to pick up the tab for the increased cost of maintaining and sustaining Services cost like rent repairs Insurance sewage things like that. Just puts as providers in a position where we have to use unrestricted funds which you know are limited funds that could otherwise go toward paying staff a livable wage in order to keep the doors open and the lights on. As a board member, I'm very proud of our staff and the work that they do on a daily basis. I want them to view Youth Care as a place where they can have a sustainable career not to mention job security, but we cannot provide a livable wage and Youth Care becomes a stepping stone rather than the destination. Our city is a leader in so many ways and I believe we can meet on this issue as well ensuring that providers. Keep up. The cost of doing business isn't an essential first step in stabilizing Human Service infrastructure in our city and bringing us closer to realizing our vision of becoming an inclusive and Equitable city. Thank you for your consideration. Byram and Malcolm Byron Good morning council members. My name is Byron Simpson and I'm the training program manager at you scare. My job is going to trainings for youth workers across King County. It's a date with her in about 400 stuff from 34 different agencies near unique perspective because I get to see our regional needs and I get to hear directly from youth workers about the challenges of their jobs. When we hire youth workers. We are asking them to be crisis responders nurses mentors teachers care coordinator has promised through its emotional support and much more. The entire time they're working their responsible for the physical and emotional safety of the young people in their hair. That's a lot to ask of one person who is making barely more than minimum wage. Ever mentioned in her testimony that these jobs are seen and treated as stepping stones and that means that we lose talented and passionate youth workers to high paying jobs in higher-paying positions are Fields work a can and should be a career in and of itself people do this work because they're good acid because they loved it and because it is a vital service for the way. Our agencies are funded. It's not sustainable to build a career and life in those positions. This is our capacity to do this work well and to be that one consistent trusted person that Tristan mentioned last week. We train stop to use a trauma-informed lens, which means taking the time to really listen to Young people and find out what is going on under the surface, but when you're single stop and responsible that you have to triage, so not only does this inflation disparity impact the wages were able to pay. It impacts the way we're able to provide effective care. The people I interact with every week truly value the work that they're doing and I'm asking city council to value that work and kind. Thank you for your time. Thank you very much. Well, followed by Patricia Heiden and Anna from YWCA. Good morning. My name is Mia Adora. And I'm the program manager at use carrots Hope Center The Hope Center is a 24/7 emergency shelter for youth ages 12 to 17 are as R program serves High needs youth youth were involved in the sex trade you three are experiencing substance use disorder you through Street entrenched and you to have a cute mental health needs in a trauma-informed. Why are shelter has 14 beds and under state law. We required to have one stop number for every 8 use. I work at the Hult Center since we opened and may of 2017 since that time we have never been able to sell all 14 of our beds not because there isn't a need but because we are so chronically understaffed that we can never meet the ratio requirements to supervise more than eight youth at a time. The hardest positions to fill our Graves staff meeting the staff working from 12 a.m. To 8 a.m. In the morning or required to stay awake and check on the youth as a sleep. It has been almost impossible to keep the positions filled because ours are so difficult and the pay is so low. We have a wonderful staff at the Hope Center. They're incredibly committed and do amazing work to help young people stabilized and I'll trust but I can't get myself to stay more than 10 months 12 at the most and when they leave they all generally say the same thing that they love the team. They love the clients. They love the work they do they just need to make more money is it is one thing to have you sleeping outside because there are no shelter beds. It's another to have you sleeping outside not because there's no not because there aren't enough beds. But because there aren't enough. Willing to do the job. That's why this legislation is so important when agencies cannot keep up with the cost of doing business use the dentist 12 years old and up sleeping outside on our streets. I think I can safely assume that no one in this room would ever want to go in person to face reality, but unfortunately, that's exactly what we're doing. If you don't pass this legislation on behalf of our youth and staff fired your support, thank you for Thank you so very much. Good morning. Good morning. My name is Patricia Heiden and I'm the chief program officer for the YWCA in the co-chair for the Seattle Human Services Coalition. And today I'm speaking on behalf of the Coalition shsc members provide the services at support Seattle residents to thrive across their life span from Youth Development senior centers gender-based violence response and prevention to community clinics Human Services billed well-being. We ordered you to automatically adjust human service contracts for inflation so that we can maintain the Human Services infrastructure that we have built together. If you built a home for your family, you would secure that investment by repairing a roof after a storm damaged it not just let it fall into disrepair. in the same way when cost to provide services like technology recruiting training Transportation wages Healthcare benefits and Facilities increase we must pay those cars or we will not be able to maintain current Services simply put you An undetermined simply but you undermine I'm sorry our capacity to reach our goals when cost to provide services ride, but your investment does not in some years the city has made inflation adjustments on some contracts spin, even though sporadic adjustments are less than actual inflation. You have the power to solve this problem once and for all we are is that you take this common-sense step to secure public investment by adjusting all human services contracts annually for inflation. Thank you. Thank you very much. Welcome Anna and Liz Nagy. Good morning council members. My name is Anna play. Funky Saint I'm speaking on behalf of the YWCA of Seattle King and Snohomish County. We are here today to ask city council to automatically adjust Human Services contracts for inflation. We all understand that inflation is part of daily economics. That's why in 1975 Congress recognized that cost of living adjustments were critical specifically in financial situations where institutions and people are working with a fixed amount of income. Our cost to provide services for Seattle residents through the YWCA have increased well beyond adjustments. The city has provided for health care and transportation systems as well as critical services like Technology support staff Recruitment and wages training and contacts in facilities. For example, every year the cost of contacting the Seattle Housing Authority increases. This partnership is critical to the ywca's ability to provide housing and services to those experiencing homelessness, when cost provided it when cost to provide services rise, but your investment does not threatens our ability to maintain our current services that you've asked us to provide on your behalf. Thank you. List welcome list. Aliana Kenner Thank you for the opportunity to address the Seattle City council and this committee on the proposed inclusion of annual inflation adjustments in all Human Service Department contract. My name is Liz a g and I'm here representing International Community Health Services speaking in support of the proposed inflation adjustments established in 1973 ichs is a federally qualified Health Center that provides comprehensive and affordable health and wellness Services throughout King County. We offer culturally and linguistically appropriate medical dental and Behavioral Health Care for patients of all ages as well as traditional Chinese medicine Pharmacy Services nutrition, community-based Outreach and education health education and related Services ichs operates 11 site for full-service clinics in Seattle Shoreline in Bellevue to school-based Health Centers of Vision Clinic a mobile Dental Clinic Primary Medical Clinic at a community partner organization a 24-hour assisted living facility and a congregate meal program. Ichs, we help our community to build the foundations. They need to live healthier lives. We do this with facilities where patients can access the full range of primary care services with skill providers who have the expertise to cross health and wellness at the Spectrum and with programs that meet the needs of community members at every stage of life and it is critical that we Securities Investments by adjusting all human service contracts. Annually for inflation. It is no secret that the cost of providing Healthcare increases each year. For example, the cost of operating our facilities increased by over 10% from 2017 to 2018. Typical Healthcare feel like Medicaid reimbursements. Do not fully support our costs. We provide for a whole person care which ripples back to their families and communities building annual inflation increases into Human Service Department contract shows that the city understands how important these services are to community well-being. This will ensure that organizations like ours will be able to better keep up with the rising cost of living in order to meet our goals of a just society and a thriving Unity thank you for your time and your leadership on this issue. Thank you very much. My name is Monica and while I'm not a part of any non-profit, I'm glad that I can be here today to help push forward with this legislation. We just haven't stagnitta throughout this country for decades and price of living has continued to grow the only hope workers have the rare occasion of an overall increase in the minimum wage. Thankfully this happen for Seattle, but it's still not enough and while this doesn't apply to all minimum wage workers. I feel like it's a great step in the right direction that eventually hopefully push for this to apply to all minimum wage and because of that. I hope you will pass it and if I can speak just briefly on the other topics on this, I believe that they are also really important to help housing for other people. Thank you very much. Thank you. Keep on coming back. I know you were here last time it seems like you are inspired to speak. So thank you for sharing your thoughts and great segue. It sounds like the next two people are here to talk about the housing plan if we can have Eric privates and Eric first. Welcome, Eric. Good morning. I'm here kravet Sunday director of real estate development for a homestead Community Land Trust. I'm here to support that the passage of the housing enough plan and specifically I'd like to call out Amendment 13 council member or both some pozole to increase the amount of subsidy available to the construction of 3-bedroom units. That housing affordability issue in Seattle at the DNC one that everybody is keenly aware of wework specifically on the home ownership and event. And that's an area that is there's really this missing first run in the in the housing ladder in the city and you know, 20 years ago. The median home price in Seattle was about $275,000 and that was affordable to somebody earning median income. After about 2006 the we begin to see at the virgins in the housing prices increasing much faster than median income. We had a brief little break after the recession but it is continued up on that trajectory. Now, we have median house price. It is around $750,000. What's the odds of? Care who are working? And he's critical jobs of affording their first home and being able to stay in the city. And that's why we're encouraging the council to really look at any kinds of tools in adjustments to the NF plan that the future housing Levy to help start to really focus and address even more resources. I'm filling that Gap so that we can provide an opportunity for people to purchase their first home here in Seattle and stay here. Thank you so very much. Good to see you again. Good morning with Emerald City Seattle, where a collaborative of unions government affordable housing providers many groups businesses and Workforce training providers. We work at the intersection of equity and environment. We're currently working with housing development Consortium and nonprofit housing providers to bring the environmental and Equity benefits to building upgrades and new construction. We believe in leveraging government Investments to Advanced equity in hiring and procurement and construction. We helped develop is TWA with the city and the Building Trades for Energy Efficiency, and that led to the model for the seawall CWA. We also recognize that inclusive procurement for women and minority-owned businesses is a key opportunity for wealth-building and creating a diverse Workforce. We believe that Provisions for Wendy Contracting might be a great fit for the housing sector allowing for new businesses to start up and grow and become midsize firms and general contractors of the future. That is why we support council member must gave his proposal for a comprehensive labor Equity strategy for housing Construction in order to determine the best path forward to help Advanced Equity while we strive to solve our homelessness affordable housing and climate crisis cities is committed to supporting strong measures that can advance comprehensive solutions to these vexing crises and look forward to working with the city and state coach to do. So. Thank you serve breakfast. If a patient's the lava. Hi, I'm Leah with the Housing Development Consortium are cities ecosystem of growth and opportunity depends on the strength of our Human Services sector from community health clinics to housing and homelessness services are a hundred eighty members are working at every corner of this work and we see the importance of strengthening the entire Integrated Network of the Human Services sector. We are fortunate to live in a city where are government values and prioritizes investing in our Collective efforts to Foster economic physical emotional and social well-being to protect those Investments and make sure they are maximizing their impact. I ordered you to adjust all human services contracts to adjust with inflation. At Seattle's economy booms. We need to ensure we are able to retain a strong dedicated Human Services Workforce last week trying to learn at once we heard from Tristan with youthcare who benefited from a 3-year consistent relationship with his case manager Joe. We also heard that many organizations lights youthcare have staff turnover rates of over 40% We undermine our ability to create successful outcome and maintain the infrastructure for successful delivery in the cost to provide services Rises, but our investment in the sectors infrastructure does not I urge you to think of the bigger picture of our city. It is vitally important to create a sustainable solution to this yearly problem. Thank you for your leadership. And thank you to everyone in this room. Who does this work? Thank you so very much. Haitian good morning, name a minutes and comedy chair. Thank you for all of the way that you have done and the administrative and financial and also updating the house and finding policies. I'm here to speak on that agenda item and I specifically we strongly support council member mosquitoes lamps. Proposing a comprehensive a label Equity strategy as you had from one of our members were really see this as very intentional and thinking I had off. Can you collect data establish a baseline to make decisions that is effective and we're gonna crunch that can actually be applicable on the ground and all members have offered. We have hundred eighty members within ask Association that are working or nonprofit affordable housing development service provision and funding as well. They have offered to be at the table to work with Alexa. In developing what the data will be so that they actually applicable on the ground as well as the months go by before the September 30th a deadline that you have a set. Thank you for all that you have done in putting this together as a comedy and helping us build a city that is a community for everyone and ensures dignified our lives for old people and I will take my last 30 seconds to lend support to the inflation rate at peace for all your contracts really think that this is the way to go and we support the effort. Thank you. Thank you so much. The next person will be cheap. Hi. Hello, how do you speak to you all today? My name is Pete Chris Globus. I'm a program manager at Compass housing Alliance. I've been working there for about five years now. I started out at the front line staff and saw firsthand the impact of the low wages that are offered to a lot of Social Service workers in this field to that end. I strongly support increasing the Human Services contracts to account for inflation to make that work happen when I was younger. I had to live with about six roommates working in a number of different nonprofits including d e s c d Washington low income housing Alliance and hepatitis education project at work. I regularly saw highly qualified workers leave for other programs. Sometimes only offering $0.50 more an hour than what they were originally being paid. The impact on the clients was often negative and a case of case managers with sometimes traumatic as a manager. Now. I realize that low wages continue to impact our front-line staff when new positions open up low wages impact the applicant pool. This leaves me. Choose between either hiring a potentially under qualified employee or waiting for a better applicant on my programs remain strained and short-staffed. We love doing this work, but it's not easy in the city at the wages were being paid. I recently met someone from major software company in Seattle who held the same title as I do had half the direct reports and earned three times the salary I'm simply asking that you invest in us and allow us to continue doing the work that we love. Thank you. Thank you so very much. Montecristo followed by Marci Bowers and Allison eisinger. Hi. I'm and I'm going to be brief cuz I know you have a lot of work to do but I just want to stay related to the a&f plan work. I want to reiterate the commitment of our members the mini that put their lives on the line every day building and producing affordable housing of what they are committed far beyond what I think people believe a to the diversity of a Workforce that benefits from the economic work and opportunity that comes from the production of and maintenance of affordable housing it so they want to demonstrate and share with you everything they're already doing as it relates to this commitment and be part of a comprehensive solution to make sure that As a community see Equity as a top priority. So we stand ready for that as has been already communicated and then as it relates to the issue of the inflation adjustment, I was listening again this morning. So the testimony in it Harkens back for me many years of our work at Habitat for Humanity and we had seven key principles that bound together are Affiliates worldwide with the family of Habitat for Humanity. One of those principles was clearly that we were about the uplifting of families and individuals not just the construction of house and we interpret that always to mean not just those that bought the homes or the residents there of but all those involved in the production of those houses as well as providing services and resources and we have a real problem today as you well know in terms of how well we respect or don't respect the front. Wind staff or standing in the Gap in our community, and we really need to do this and we thank you for leading on it. Thank you. Thank you very much. A quick thank you to the Housing Development Consortium patients in malabo and Marty cholesterol. We received your letter and appreciate you sending this in and your generous offer as you both mentioned to be part of the team to do this evaluation prior to September so we will take you up on that and follow through welcome Mercy very good to see you. I love you have a tall Mike up here. This is amazing. Good morning. Thank you for the opportunity to come and testify in support of the inflation adjustments for area service providers in my formal role at work at every year over 70,000 people come to Solid Ground for support and response. We provide legal services to people accessing state benefits teach cooking nutrition and budgeting classes educate tenants about their rights and responsibilities provide accessible Transportation operator company until Domestic Violence Shelter. How is over 400 people including over 200 children support families with basic housing rental assistance. Advocate for system exchange at the state level and much much more. We provide a broad spectrum of services to meet a broad spectrum of needs and the city are staff are smart with our staff are smart skilled and dedicated many have been with solid ground for years myself included. I've been employed there for 14 years and some four decades. They have incredible specialized knowledge and we ask a lot of them every single day travel around the region to me with community members and provide trauma-informed care every year the cost of are they all so rightly receive annual cost-of-living adjustments to help mitigate the cost of living in our city and region every year the cost of our wages training and health benefits increase many of our funding sources failed to keep Pace this week's just after know which in turn of course has a negative impact on our program participants and it makes it difficult for us to adequately address. Our current needs. Let alone plan for our future. This is a smart investment in our City's infrastructure investing and quality services and skilled workers helps us all reach our desired outcome of a healthier safety safer or more just city to live in working. Thank you so much. Thank you so much Mercy. Allison followed by Our Last speaker is g n palak muchhal is on her way and I hope that all of your Council colleagues have a chance to see and hear these remarks. I am here. Of course on the half of the Seattle King County Coalition on homelessness and our member organizations. And as a member of the Seattle Human Services Coalition because this is a sector-wide issue what I am struck by as we contemplate on your proposed legislation to adjust for inflation just to keep up with inflation for Human Services providers. Is that what you've done is to create an opportunity for people whose work is so vital that is often both unseen and discounted to speak about the pride that they have in the work that they do there have been people here who are Janitorial. Senior Services case managers you'll hear from someone who operates an important food bank in Senior Center shelter housing providers Healthcare Providers people who do the work that keeps the city running and it is actually quite inspiring but also a little sad to me to think that we are having this very basic conversation. I simply want to note that in the course of working on this effort. I have learned a lot more than I ever knew before about the different forms of the CPI. And in fact the the work that you did last year to build on their Durkins budget proposal to create a modest and necessary 2% across-the-board inflation adjustment was below the CPI for 2018, which was 3.4% So I think what you are proposing is common sense, it is necessary and it will change. In a subtle, but vital way the culture of this city in terms of how we value the work that we say we Valium. Thank you. Thank you very much. Welcome. Hello. My name is Jeanne Falls. I'm the executive director of The Pike Market Senior Center and food bank. We're right in the Pike Place Market and serve a lot of people who are homeless and I just want to say how heartening it is to me that you're supporting this initiative. It is experience is more important than degrees really in serving people that are very high needs. And if you can't retain the staff, you can really not do the work well, and so I sure you on and I'm very supportive. Thank you very much. That concludes all the folks we have signed up to testify. Is there anybody else that was inspired to testify and that still would like to say something? Okay. See you then. We're going to go ahead and close today's a public testimony. I want to thank everybody who came we had about 30 people who testified today. So thank you for the generous time and for being willing to be here again, you know, we have heard that there's folks from Cairo Seattle Times Crosscut and others who are following online and I think that you continuing to speak up about what you've you've done for the city what you can continue to do and the challenges that have been created by not investing in these contracts fully and providing inflation adjustment helps to underscore exactly how we can come together just help solve the crisis of homelessness prevent more people from falling into homelessness to treat our seniors to serve those who are youth and to do so requires us investing in you all just as much as you all have invested in those very vulnerable populations. So we're glad the Watching from afar and this will be one of two conversations that we will continue to have in this committee that again follows on the heels of last year's discussion and the Very packed standing room only house that we had two weeks ago during our work session. So thank you very much all for being here and things as well to the folks who came to testify on the housing AMF plant that is our moral compass for how we invest in housing if we don't have housing that's table for folks that you're serving and you're going to continue to see them just as much as if we don't invest in those who are serving them. We can never actually get them house. Appreciate you all being here and we will go ahead and move to the first item of business at 11954 to an ordinance relating to Contracting by the human services department for briefing and discussion. Welcome. Thank you Amy. Do you want to introduce yourself for the record? I'm Amy NGO or with Council Central staff. Excellent. And this is the first time I believe that you have been at the table with us. So thank you so much for your role at Central Staffing for all that you've done previously with councilmember Johnson. We are so appreciative of your current working your password. So thanks for helping us walkthrough this legislation. I want to thank councilmember herbold for being here as an alternate to our committee. It's really really wonderful that you were able to be here for all that full public testimony today, and we know that this is an issue that you've been working on for a while as well. I was councilmember O'Brien I so thank you for being here and I know we'll talk later about them really important housing issues that you've been also tracking with us. So thank you. I just want to say a few words about the importance of this legislation that we're beginning to consider. We've had the opportunity now to as I said here from the direct Human Service Providers who were here last week from Frontline work. From the CEOs. I like a Stella truth about that Mark who was here last year last week 3 directors management Frontline staff from the people who receive these services are alarm who've been through various programs that help get folks on stabilize individuals who received Human Services from our city and the importance of having their case managers be able to remain constant and the importance of having these organizations fully funded with something that they underscored better than anybody can we heard a few things from last week that I just want to call out and remind folks of first human service provider contracts and the individuals who work for those contracts provide services such as youth in development services the senior care services Community Clinic for a services to domestic violence and sexual assault prevention response food banks and meal programs. We heard from the folks at the food bank that at Pike Place and also they provide services in our homeless shelters as well as preventing people. Falling into homelessness if Marci Bowers is here still from Solid Ground. One of the most important thing. She said was the role that they provide in helping to prevent people from Ever Getting into homelessness in the first place that require spending the second thing that we heard was that the reason that we contract out the work and I think House member herbal them myself and others have been very vocal. We're not interested in Outsourcing work that the city should do. But in this case, the reason that we have these contracts with Human Service Providers is precisely because of their expertise and the strong relationships that they have especially was vulnerable communities the direct Community connections that they have both as nonprofit trusted organizations and individuals who are providing those Services cannot be replicated at the city. They are efficient because of their focus and these nonprofits help us create the trust in that work to actually get people stabilized and get them the services that they need in a way that the city can't because of that trust that they created The Wharf has provided Not just a trust a relationship, but they have proven to be efficient. I want to underscore that and this day and age and as somebody who comes from public health who believes in data driven Solutions, these organizations have a proven track record of helping to stabilize both provide needed services and help prevent people from falling into homelessness and or losing the stability that they currently have we heard from Tristan Tony Susanna who share their stories about the connections with Frontline service providers and how they couldn't have done. It had their continued to be high turnover rates and very individuals to help them get stabilized. We also heard and I think this is really important if I can borrow this document and we have some flies that we will show later that we heard from organizations. Like you scare Who provided this chart the talked about the high cost of doing operations in this in the city. We talked about the high cost of doing business. These folks are not for profit organizations are nonprofit and even on these very slim. We're talking about increases in the cost of water and utilities electricity internet gas recycling. Rent, these are issues along with health care and wages that we know really cause the inability to provide the Direct Services that we need if we're not actually adjusting for inflation. So the charts that were provided by youthcare show the inflation overtime what happened happened over time is the contracts to keep up with that inflation. We also heard from folks about the need to be able to adjust to these rising cost and without actually having the ability to see an increase in contract. The only thing that many of these providers have actual control over his wages and that's where we see compromises in our system with 40 and 50% turnover as we heard with the fact that people as you heard today are staying on the job between 10 and 12 months that is not how we create stability and I would not be acceptable for any of our positions within the city if we really saw that type of turnover and high vacancy rates. We have an opportunity to respond and to thrive And you continue to address the housing crisis, but without actually doing so we are harming our efforts to address the crisis of Housing and homelessness in the city. So I want to thank the council members very quickly for all of your work last year and all this has been an effort that you've been discussing over the last few years last year. We were able to get the 2% inflation adjustment for all contracts and why that's important is it wasn't just general phone contract was all contacts that comes through the city and what we heard from Folks at the time and some of them were in the audience today. Is that a yes a 2% increase on your paycheck is hardly noticeable, but the fact that were increasing contrast by and hopefully an inflationary adjustment that as Allison said actually meets the inflationary cost in our city is so significant. It is Meaningful for the not just Organization for the workers to see that were respected and invested in so that more people can get stabilized. So I want to thank the council for last year's commitment to finding the 2% increase. That we applied in the 2019-2020 budget and without the stability. We know that we are not on track to meet the needs in our city with stability and with the work that Amy has provided with identifying a way to tie and Play Shania Jasmine's to the Consumer Price Index CPI W for our region. Just like we have done at the state minimum wage since 1998. We've tied inflationary adjustments to minimum wage to recognize that then the $4.50 that we were offering as minimum wage was not going to keep up. We tied cpi-w to the minimum wage and initiative 1433 recognizing that even as we took a step up we needed to continue than inflation adjustment. This is not something that we're coming up with on our own. It's used in many other ways, which will hear from a meeting. So why don't we go ahead and turn over to you need to talk about the policy that the baked into this legislation. We talked about the Y to help us understand how we're going to get there. Thank you very much. Provide an overview of proposed legislation sponsored by council member Mesquita Council Bill 11954 to the legislation would have been the Seattle municipal code to require that Human Service Department. I'm include annual inflation adjustments for renewed and or renegotiated contracts. This annual increase is intended to reflect the actual operating cost for contract grantees, which of an escalating rapidly during the current. We conomic growth in this briefing. I will discuss the current Contracting practices and recent budget actions related to this topic the proposed legislation and potential budget impacts of the legislation information can also be found in the central staff memo attached to today's committee. Agenda. I want to know that there is a revised memo which is slightly different than the memo attached to today's agenda the revised memo which is located on the table has updated calculations for attachment 1 and I will work with the committee clerk to make sure an electronic copy of the revised memo is added to the cow. Spell supporting documents to that's available for everyone and momentarily we will make sure that that gets also projected onto the screen and there should be copies as well on the diets for folks were interested. But the person want to talk about current practice at hsd as you know, our human services department achieve its mission in two ways by prevent providing Direct Services by city employees and through contracts with partner organizations. A trustee services are funded through through the general fund or through federal or state grants. For example of Community Development block grant program for housing opportunities for persons with AIDS in 2019 HST contracted 118 million and services with 62% supported by General find 38% supported by non general fund sources because hsd is designated as the Area Agency on Aging for Seattle in King County HST contract sometimes cover services in Seattle and King County or combination of both. Currently a trustee fun Services through a competitive bidding process that Awards funding to organizations for multiple years. Usually for 4 years though. The award is for multiple years funds are dispersed through successive single year contracts and each year of the war. The contract is renegotiated or renewed increases in contract amounts or changes disco can be made during the wars process ordering contract renegotiation, but are not required during either the award process or contract renegotiations over the past several years. The city has included an inflationary adjustment in the adopted budget to apply to HST contracts from 2014 to 2018 the budget included an inflationary adjustment ranging from .6% to 2.3% to be applied only to general fund contracts. The 2019 and 2020 mayor's budget proposal also included a 2% inflationary adjustment for General fun contacts Council amended the budget to apply a 2% increase to non General van contracts in 2019 at a cost of $903,000 council out of the same amount to The 20/20 endorse budget to maintain the 2019 increase but did not find an additional increase for 2029 General phone contracts. I don't know if it's only practice and that's kind of lines in with my my question the inflationary adjustments that we've seen in Prior years is reflected by this chart. We we know it's not a result of council established a policy through legislation. But is there a standing or has there been a standing hsd policy or these just decision? Nearby year based on a consideration of other often competing factors. My understanding is that these are included in the budget when either the mayor or Council feel that the funds are available to cover them. Thank you. Anything else so moving on to the proposed Council Bill 11954 to this Council Bill sponsored by council member scada and would have been the Seattle Municipal codes require that hsd contracts both those funded by general fund and not general fund sources include an annual inflation adjustment when renewed or renegotiated the bill would apply to contract issues under the authority granted to HST in the Seattle Municipal Code with four exceptions one is that the city of solely acting as a pass-through Agency for services that are not provided in the city limits. The second exemption is that the contract is solely supported by State Medicaid funds or funds appropriated by Title XIX of the social securities act the third is that the services are provided by a consultant as to find it defined in the Seattle Municipal Code or that it is explicitly prohibited by or otherwise incompatible with requirements of the funding source. On the proposed Bill states that the annual adjustment will be based on change in the Seattle-Tacoma Bellevue consumer price index for urban wage earners and clerical workers, which we referred to as cpi-w. Do you mind telling us where are the other cpi-w indicator is used? Yes, that is the indicator that is used for the minimum wage increase for the on the state of Washington as well as a few other places. It's a common practice to use cpi-w as an inflationary adjustment. Okay, green. The Proposal is currently agnostic about how exactly the cpi-w is used to calculate the annual adjustment though. There are many ways to calculate an annual change for the purposes of your memo. I have looked at year-over-year change in the December cpi-w that we could also look at annual averages year of your change for a different month or a rolling average council members might be interested in being more specific about that calculation the bill if the annual change for cpi-w is negative the annual inflation adjustment for the contracts will be 0% that is to ensure that the contracted amounts do not go down for context. I provided you the annual change and cpi-w from 2001 to 2018 on page 3 of today's memo as you can see it range from a low of .4% from 2009 to 2010 to a high of 4.8% from 2006 to 2007 and averaged a 2.4% increase from 2001 to 2018. But even if you could find the chart that shows the 2010 to 2020 chart so that we can all see that so when the CPI W increases so does our general fund. Is that the biggest takeaway? Most years when the cpi-w increases our general fund. I'm also increases however particularly during significant downturns in the economy as we are usually as we are coming out of those downturns, for example, I believe in 2010 and 2011 there have been instances where the CPI increase is more than the increase in our general fund revenues and so it since 2010 there's been one year in which the increase in cpi-w was more than increasing our adopted general fund resources. If we just isn't for example, if we just look at the last 10 years 9 years, I think one of the things that we see is that our general fund increase increase that twice the rate of the cpi-w. Is that a good takeaway if we just look at the last 10 years here? Yes. Let me pull up that table. in the. That, you're talkin about from 2010 to 2018 the general find has Went from 905 million dollars to 1.4 billion dollars that reflects in some ways are big construction boom because a lot of that comes from construction taxes. It also reflects are very high population growth. We have more people paying tax says it also reflects some new attacks resources, like the sweetened beverage tax resources, but over that time are adopted budget general fund resources did increased about 40% over the same. Of time are I'm cpi-w increased 20% from 231.3 to 269.47. Okay, great. Thank you for that guy is watching and is on her way. To underscore here is that at if we just look at the last 10 years for example, folks have a swill how do we know if the cpi-w is not going to know Carl's and do harm to our our budget here at the city and I think you know what there's obviously the important reason that we heard from our community college about why we would continue to invest because it's a high return on our investment to make sure that the Human Service Providers have adequate contract. But also when we see just over the last 10 years that the general fund budget increased by about 40% and the CPI only increase about 20% I think that helps us understand that the math will pencil out. I'm at least if we look at the last 10 years and it's a modest increase. I think the same thing can be said about the state's Revenue forecasts when we tie the state minimum wage to CPI at the state level mini of the businesses that we work with who were interested in making sure that the minimum wage was adjustable in a reasonable way. Wouldn't necessarily cause undue harm. One of the things that we saw is that when CPI does not increase neither did the minimum wage I can think of I think 2010-2011 if I'm correct, maybe 2012 where the minimum wage help Dad in it for at least 2 years at about $9.47. And that's one way to make sure that we are not creating an indicator that without Pace the actual cost of true inflation. So I don't know if your ears were burning I was just talking about you makes me that I need to have now but I would like to have maybe a short summary of The the pros and cons of the different types of CPI. Just so way I can get a sense of how we're weighing the trade-offs between the different approaches. I have heard that there are trade-offs. But I'd like to get a better understanding of that. There are two things that I can do one is comparing cpi's. So there are other ways of looking at CPI. There is CPI you which is a difference. Okay, and we can also talk about again the methodology that we use when converting the cpi-w to an actual annual inflation adjustment weather that is a rolling average for example, and so I can produce both of those for the committee. I think I did it earlier today when we talked about the work that we were able to accomplish in last year's budget. I'm with the 2% inflation adjustment across-the-board and really appreciate you with the budget chair helping helping us make that significant investment last year as a down payment. And then again when we were walking through the metal gear, I know and he's just begun walking through it. So let her talk here in a second. But one of the things that she was talking about is the indicator that we've used for inflammation in the Budget is tight as cpi-w the Consumer Price Index in the W category is what we used at the state when it comes to minimum wage increases. I'm in a few other strategies to make sure that contract keep up or we just keep up with the actual cost of inflation, and then I asked about how are general fund budget has compared to CPI W's in increased over the years and if we look just at the last 10 years since 2010. There has been one year in which the increase in CPI W was more than the increase and they adopted general fund resources, but since 2010 Argento fan increase has been twice the rate of cgiw, so to break that down a little bit or general fund budget has increased by about 40% will cpi-w only increase about 20% So hoping to find that that that that I'm correct balance in this legislation is part of what I help me answer and what I'd love to underscore. Thank you and thank you for allowing me to My other meeting, you know, I chair the retirement system board and I just came from there and just to complicate things for our 2019. Our employer actual contribution rate is going to go up significantly and so all of the other things that were looking at in our budget including, you know, negotiating collective bargaining right now. This is something that I'd love to talk with you more about when I get all of the numbers, but just rev round numbers the employer that's us contribution for this year will be 130.5 million dollars and this takes precedent almost over everything else. So as we're looking at it and smiling at the good news. I just keep reminding all of us that I am your grumpy finance committee chair and I'm going to be bringing all of these issues to us because the value statement of making sure that our providers had the money that they need to do our At work. I think it really means us to take it to a whole look at how we're spending our money in the human services department. So I'm just putting people on alert that we got a lot of work to do but I'm taking this holistic approach to how we're spending our money in the city not just in the Human Services particularly concerned when we spend a year after year in from certain departments on projects that we have asked. So anyway, there's there's my grumpy moment and the mall in mention earlier is for the general theme that we've heard from many of our Community Partners as well as our Council colleagues that I think we take for granted the fact that every year we know that there's going to be an inflationary adjustment for our cost of living adjustments here at the city and we apply that to our city workers to the folks are on the front line here and today's legislation that Considering help contemplate how we take this issue that we assume every year and really apply it to those were providing equally important services on behalf of the city so that we're not engaged in this race to the bottom mentality. So appreciate you bringing that up and we'll turn it back over to Amy's to walk us through more. I just have a few more points about the actual policy and then we'll move into some budget projections Council Bill one 19542 requires that new Awards consider previous contracts when determining what would be an accurate and fair assessment of the cost of the build a new contract. This language is trying to balance two goals first. We want our contracts to be fair and do not want the bidding process to result in less Fair contract for our partner organizations. However, we do you want to allow organizations to find more efficient ways to provide services such as leveraging philanthropy or reducing operating costs when possible Additionally section 2 of the proposed Council Bill makes a technical code correction requested by law to clarify. The HST. Contracting is governed by Section 3 .20 of the sea Seattle Municipal Code rather than section 20.60 which governs City contracts granted and administered by FAS. The current code is contradictory and this change would clarify the code and make sure that it reflects current practice. Are there any questions about the policy before we move on to discuss the potential budgetary impacts, so can I just take a nap? Would you mind going back to that last sentence and unpacking a little bit sure right now in our Seattle Municipal Code, we have a section that talks about how FAS should do it's Contracting and for example in that section of the code, it says that only the FAS director is allowed to enter into contracts on behalf. Obviously that's not actually what we do and in the hsd section of the Seattle Municipal Code. It allows the HST director to enter into contracts. And so what section 2 does is it exempts hsd contracts from the FAS section of the code so that those types of contradictions are cleared up and again, it puts it in line with what is actually going on in the day-to-day business of the city that request from the Law Department. Thank you. Thank you for that. Finally. I want to talk a little bit about budgetary impacts as discussed previously The 20/20 endorse budget includes an additional 2% contract increase for General phone contracts and maintains the 2019 2% increase for non General phone contracts an additional 2% increase for non General phone contracts would cost an estimated $633,000 if the CPI if the increase in CPI W is more than 2% additional funds will need to be budgeted for that item in 2020 and there are two understands which could be used to help pay for an additional 2% increase for non General phone contracts contracts. There's an end of approximately $281,000 from the 2019 adjustment for non General phone contracts, which could be applied to a 2020 contract increase in addition. There is an estimated $200,000 under Banned from the general fund contact increase in 2020 in both. If both of these understands where apply to the non General phone contracts only an additional $152,000 would be needed to I'll keep the cover that is that on your revised sheet those numbers you just gave me it is not I can provide a table with that calculation and it. Again is really about this 2% increase from the Greensheet that was adopted in last year's budget. So we were saying for at least the next year based upon underspins we could do the 2% over and above the 2% that we budgeted and are allocating. I hope in 2019 that we would have money to proceed based upon understands for 2020. But I would like to speak more broadly about the long-term budgetary impacts of The Proposal the memo has an attachment which shows the budget cost in 2021 and 2022 under different inflationary increases 2.0% 2.4% and 4.0% I chose those percentages because 2.0 has been a frequently-used adjustment 2.4 was the average increase in CPI W since 2000 and it shows 4.0% because that was the highest cpi-w annual increase during this economically cycle. I think it's very very unlikely that that type of increase would be sustained but wanted to wanted to include it for a lost art of purposes as a reminder. There is a revised memo which has cracked in amounts for this and the table you are looking at should have the previous numbers marked out and a table and read below which of the correct numbers. Could you scroll to that last page for us? Do we have the updated to add? Okay, so as we're getting loaded their do our Council colleagues have the updated spreadsheet here. Okay, and I really appreciate you walking us through this number. One thing that I think is important though. So as a shot of knows I'm very interested in continuing to be able to underscore are the way in which we do budget this in the City versus the difference that we do at the state level. One of the things that the city does differently is that we add the numbers for the biennial budget together for that second year. So even though in the second year, it looks like it's about twice the cost. Annually, that's actually not the case, right we will reflect in that second year is the combined total energy of mine just breaking down for us the difference between years one and yours to four examples of her just to look at a two-year budget and the difference over time or if you want to do the next four. Nearest through 2020. That's great. I think you're in your memo shows that okay. So as you mentioned the cost in the budget, as you know, we have a biennium budget issue explain, which means that every other year. We adopt the next year's budget and then endorse the budget for the year after that. So in 2018, we adopted the 2019 budget and endorse the 2020 budget in the second year of the biennial budget the cost of any budget item must include the cost for the first year and the cost for the second year. So in this context the second year of the budget needs to include money to cover the contract adjustment for the first year and the second year. So that is why when you look at the revised attachment one, usually the 2022 number is approximately double what the 2021 number is which reflects a so the 20/20 number one number for example under a 2% increase is 2.36 to million. The next year the 2022 the budget add would need to be on 4.771 million dollars which includes the 2.0% increase in 2021 as well as a 2.2% increase in 2022 on the fly. If we look at the revised numbers in your chart of here and we are just looking for example of that to 2.0% increase is that the example you just use if we look at the actual increase in cost over a year the difference between 2021 and 2022 would be $47,000 to be $47,247. Exactly. That's the difference in the increase that were talking about year-over-year just by way of example by using 2% and I think that's a helpful number to think of versus the million dollar figure that folks usually see right and I think we are friends in the financed and Which department would say is that may be accurate, but you would be paying two million 2.3 million dollars more for 2021 and then in 2022, you're actually paying 4.7 million more than what you were in 2020. That's how that's it. That's how that adds up. So what the concern is just follow me to underscore there is we are all completely one-hundred-percent and Alignment around the value of what we're doing and trying to provide additional support for the Human Services providers that Noble would say to us is that as his compounds we need to be realistic about what it's going to cost for the general fund going forward. So I'm I'm back to my look. Let's just make sure we're holistically looking at this and that we're not we're not pretending that it doesn't have an impact just to clarify one thing. The difference that you see, you know, if you were looking at 2022 to 2021 the amount that you gave councilmember mascara that if you subtract out that you .36 $2000000 and then say what is the difference that additional I was at 40000. I don't have a calculator to 7:40 7000 that is the increase in the increase. So you have the 2% increase which is 2.3 million dollars. Then the next year that increase will still be 2.3 million dollars plus for $47,000. And because the way that we talk about this in the budget contest camp Scare what is actually happening year-over-year? I do have a handout that you should have that's the larger piece of paper which shows the yearly increase in the HST contract budgets under the three different inflation rate increases to point. 2% 2.4 + 4.0% and also goes out a little bit farther from 2019 to 2029. Appreciate your your quick Edition their second crease in the increase. That's where your 47,000 comes from from 2020 to 2021. And if you adding those two numbers together, that's where we come up over two years that the increase over 20 20 is 4.7 million just for the 2% doesn't talk about contracts were just talking about that the increase that we would be asking for that's correct. And that I don't want folks to take away from this conversation that it would be somehow 2 million or 2.5 million dollar increase year-over-year that the combined total for a biennial year. And so the way she started delineate in our budgeting it almost makes it look like it would be at it would you would mean to add these two numbers together when we've already added them in the second year. And we'll keep working on ways to demonstrate these calculations. I think it is very complex. Thank you talking about about these. You know, I don't think anybody is pretending that this won't cost money, but it's the same scenario that we have to deal with and our employees to do that with our own Workforce doing the city's work and when we contract out with people who have expertise that we don't have here in the city when I think need to also factored that into the cost of do my best friend and I just wanted to Circle back value we all agree. It's should we be looking at all of these contracts and even the ones internally that the work that's being done to make sure that the people are doing a war. On the outside are getting the fair wages. They need to sustain their programs. So a value statement that I think we're all saying. We want folks were doing the hard work to have an inflation adjustment. We recognize that we've done the internal funds for the cost of living and inflation adjustment for our own city workers and we haven't done it for all contracts across the board for each of the service providers and to underscore that with data when we look at Seattle General employees. They have received increase every year since 2003 when we look at what the average of those increases as War. It was 2.45% over that time. Which is almost the exact same increase in CPI w22000. So as we think about the rationale behind using a cpi-w inflationary adjustment, Tool as we think about the rationale for how these workers compared to our internal city employees. And we do see that the data backs up that we have used this very calculation in a way to increase inflation adjustment for our own workers and how easily we can then underscore the rationale behind why we would do it for external workers in an event that that data point is really important in a 2.45% increase for our Seattle General employees since 23rd 2003 means to me it were on a good track here in from the policy rationale. Weather coming from that. I need to jump more fries, you know, I think the chart speak for themselves as I just wanted to know what that as. We discussed before the annual adjustment Tides is cpi-w would vary from year to year. But if it's horrible Trends continue would most likely be similar to the 2.4% increase on that chart. I also want to know what that these increases reflect only the cost increase for existing services. And if Council wants an increase in Services provided that would not be reflected in these estimates. And again, I think that the legislation that you written has also underscored that this doesn't take away from any of hsd as the agency's ability to write new contract says Needs change a service has changed. So those contracts wouldn't necessarily have to be applied to a past amount for a contract if they're completely new Services. We wanted to make sure that we weren't hamstringing age of D in anyway when that regard Turn the crank email from somebody that said oh you just doing this so that you can raise your own salaries council members do not get colas. So no matter what we do with council member salaries. That's that I also think it's important for us to keep pushing back on the narrative that somehow this type of work and other music municipalities shouldn't be funded. We are one of the biggest cities in the country, but even our smaller cities and we don't pay folks who are doing this kind of work. I've been living wage job than you get phones to her more likely to be independently wealthy have their own funds and not necessarily from the community that they're representing. So I'm proud of our city for having a living wage jobs. Yes, we do not get colas want to make sure people know that but we do value the work of our front-line workers and we have included a cost-of-living adjustment for those Frontline workers. We do not provide those Services we on city council are not Frontline Human Service Providers, and we also want to recognize the hard work. They do everyday to carry out the policies that then we all pass. So it is an important distinction to make this is not applying to us, and if so, we wouldn't even be able to vote on it. Thank you. so I have to follow up items which is to dick and Morty the cpi-w question as well as finding some different ways of expressing those budgetary impacts. Is there anything else that I'm leaving this conversation? You'd like me to work on. Thank you for understanding that will remind us again when this is coming back to our committee that I believe that the next Council committee meeting will be July 11th, July 11th, 2019. So this will be on our housing help energy and workers rights committee on July 11th, then gives us just about a month to work through any questions and comments concerns that folks have our intent is to try to I work with all of you in the meantime before that Committee hearing to follow up with the tax room of the Pax room again today. So good to talk to some of the folks that were here and then to have a discussion of possible vote on July 11th council members any comments. I know you both have underscored the value components any other comments or questions. I'm good. Why did the information I'm hoping get but otherwise, I appreciate your taking the initiative to move this policy forward so that you know, we've created a baseline for the budget process and we're not having to do one lost every year. No, I have lots more questions. We'll talk about it again the holistic approach but I am interested in thinking that if she died this past what the implications would be during the budget process if our favorite friends in our Human Services Coalition will be back asking for something else and I'd like to know that up front if possible. Okay. So this year we've actually if you request that I don't know if our possible but this year we provided the 2% increase to general fund and non-GMO fun contracts across the board at a total increase of 2.3 million dollars, which was about 0.2% of the 2019 general fund budget which was around 1.4 billion dollars. What I'd be interested in is if we looked for example at these three options that you provided most notably recognizing the 2.4% increase mirrors the exact average income. The contracts that the Seattle General employees receive if we did a 2.4% increase, what would that be in terms of our projected overall budget for the upcoming by Jetta. Could help us put it in perspective because alone these numbers look big and then when you think about it in comparison to some of our other Investments, it might be helpful for contacts. The second thing. I would love to know and do feel free to push back and now or later on I know that there is a way for us to look at the return on investment and if there is turnover rates in the 40 to 50% range if there is an estimate for us on what the dollar figure could be for both retraining folks vacancies that are going unfilled appointments that are getting unseen because at the case managers are not available if we can quantify what the existing consequences of not having some of these positions still that would be helpful in that specific to the And then lastly but I don't know if you have the ability to share this slide that we received last time from the folks that use care as one example, but we have great chart here from the Youth Care committee meeting over. Thank you for pulling that up and what you can see in this chart is years 15 16 17 and 18 and the increase in cost especially for utilities. I'm utilities at rennes health care. For example, the cost of I'm doing operations at that would be helpful because my assumption is just from looking at some of these initial numbers is that this far outpaces a 2% increase and when we look at water and utilities, for example, or the cost of rent there was a number that I had in terms of the cost of square footage, so Square footage in the city of Seattle used to be just under $20 a square foot in 2012. And now the commercial retail rent has increased over 26% or $26 a square foot in 2018, so I can do that math quickly and that's about 12% increase since 2000 2010-2012. And I think that that type of data to juxtapose we were talking about in terms of cost for these contracts versus the cost of these contractors have to pay in these types of services would be helpful. So those are my three buckets and if they're not possible in the next month, we understand now, I think I think it's very possible to come up with some indicators related to the cost of doing business in the in Seattle. I think Translating that to exact service providers will be a little bit difficult cuz you know, obviously somebody who provides meals probably has a lower water bill then somebody who allow showers. And their facility so I think making that exact connection will need to rely on the service providers about what their actual cost increases are but I can absolutely find some sort of broader indicators of the increased cost of doing business here in Seattle for bringing that up with Melinda, June Bingo and Allison dies. And there were there in the number of others earlier in the week. This is this strikes me as being the information that's really critical for us to pursue because what Melinda was showing here was not anywhere close to a 2% increase it was significantly higher like you said from utilities and if they do offer showers when they're moving to a 24/7 model and they're getting young people inside they want showers. They need. They need the food prep all of it. And then what you were saying to about just the the rental but they have deferred for building paying for the rent just for the building and then you add on to that. Utilities and we're trying to raise wages for the people. We need the most to provide the stability to the Youth of a Twist and I just thought was so so great. I met you needed three years of stability to be able to get that kind of stability back in his life. It's going to cost us way more than 2% and it's how I'd like, I'd like us to really be as a sidebar evaluating what it would take to really get the system inform to do what we were asked actually asking them to do so, I know that's not just 2% but as you're doing this research and Analysis, maybe you can help us and I I know the Tracy and Allie are here, too. They're involved in it to from housing. So I think you can trust with cast member mosquitoes request that we also look at what you refer to as the return-on-investment. I think we could do a much better job in the city system-wide across our investments in showing how those Investments if done wisely actually save dollars and I remember during the discussions around paid sick and safe leave in 2012. We relied heavily on some studies from Economist that looked at how the rate of turnover where is impacted by investments in workers. And so when you and when you improve turnover rate reduce it there are cost. To the cost savings to the employer themselves and that is I think a really really important Story to Tell in our efforts to be fiscally responsible to that would be really super helpful. If we could get from our providers information about their rates of turn over and we could make some some projections about how addressing this might reduce those rates and attributes him some cost savings associated with that well stated and chair we've been talking about this for years of being able to capture those savings. So an example within our criminal justice system when we finally build our crisis Solution Center so that people had a place to go that was that was neither the jail nor Harborview 5th floor that the cost savings for the taxpayers, but most importantly The Improvement on the human being that we're taking some place where they can get stability and get whatever they need to get stabilized in their physical life mental life that saves the system a lot. And if there is an accounting way that we can recapture that and reinvest it somewhere else. We always talk about it, but then it comes to the end of the year in the budget and where you know, just so up against the wall to have a balanced budget. I'm not sure how we move in that direction. But if you Geniuses can help us, that would be really helpful. Thank you. So the next time that we talked about bringing this out of the memo says July 13th, okay so much and thanks again the post came just have to write thank you for your presentation and the committee and think about return on investment for the direct Human Service Providers. Concerns about those vacancy rate. It is also a return on our investment to make sure that the very folks are being employed by the city to do this work in effect or employing them through the contract any of them are waiting in the food bank lines are eligible for housing because of their low wages are in some cases as we heard living in their own cars and when we have folks who we're funding to do this work who are eligible for the services that also must be a concept that the cut at the consequence that we should potentially calculate as well at that we can potentially save on the front end by paying these contractors that are so I don't expect you to do that level of analysis, but I think it's important that we not forget those those stories that we've her too and the cost consequences to the city and society when we have not been fully funded these contracts. Thank you for your time. And I know we're running short on time. So we are going to move to the administration and finance plan for today. If you could read into the agenda item number two, and we have had the chance to go through. A lot of detail, so potentially we can get through these amendments today very excited about this and for you to go ahead and then we'll do introductions item number to cancel Bill 11953 1 1/10 relating to housing for low-income households, adopting the housing Levi administrative and financial plan for program years, 2019 and 2024 briefing discussion impossible Craven. Do you want to introduce yourself Tracy Russell Council Central staff Emily Alvarado office of housing. Excellent. So will this is last week's meeting we have had this issue in our committee. Now for three times this update again happens every two years. This is the administration of final plan for the 2019-2020 off of the program office of housing program. I'm dealing with funds like the housing incentive zoning payments mandatory housing affordability and other fun source. I want to say this is our moral document our guiding compass for how we use these fun and I'll reserve some other comments for later as Tracy and Emily. If you have any opening comments, feel free to do so would love to walk through the various amendments that we heard last week and maybe focus on the ones if there's any questions or concerns that you would like to dress today cool. If you set it all we did have quite an extensive conversation about on the Amendments that are most of the members that are in front of you today and I will highlight when I go through these amendments quickly the ones that are new to the conversation, there aren't that many actually majority is you had conversation about and if I seem to be supported by the majority of you also it with that I'm happy to start running through the amendments. There are so if you would like I can just actually highlight the ones that are new and the ones that may be in dispute. Is that a most efficient way to do it and then we can then move through those amendments and then help you get along with the adoption of the legislation in front of you. Okay, so if you look at amendment number for And this would be a new section that we would add to the council bill one 19531. It would request the office of Housing and finance and administrative services to evaluate strategies to Advanced labor Equity outcomes in Sandy City funded rental housing developments, including a comprehensive evaluation of the case. I'd housing projects. So just remind council members in the public Eye Site is a housing project that the city will be undertaking which we are using as a pilot to test the imposition of priority hire program priority hire program is the one that requires a friend of Sheila's ation wimby, usually in the context of a community Workforce agreement. It can also include other requirements. But the core of that is the priority hire program requirements. So that that project is our pilot project it is what was decided would be the best approach in terms of rushing to apply priority higher to housing projects without understanding the cost and benefits of doing that. And so the concept here was to test the party hire require. on this project Ingrid apprenticeship as well as Wendy and then to see at the end of that construction of that project we end up in terms of the benefits and the cost and then to determine at that point whether priority hire program requirements shouldn't be imposed on All City funded housing projects in minority business Enterprise. I separate those two things are separate. Okay? Yes, you were hurt, and sorry. Yes, the party hard has a number of different requirements. Yes apprenticeship. When be so forth and distress them employment certificate. So I want to offer a little bit of context on this one and two also celebrate the fact that I don't think that there is any controversy on the various and then we're considering we've had the chance to work together with his colleagues over the last week. Thanks to Tracy's quick work on this. We want to also underscore on amendment number for Are that were discussing correct Tracy, correct? Did receive a letter from the Housing Development Consortium about it specifically there's two amendments there that they are referencing and one is number for which relates to the labor Equity outcomes for city-funded rental housing project. This is an amendment that word jointly offering at this point. I've given our joint interest in the earlier conversation and having some Latin language that reference Labor Standard policy what you'll see from the housing developments of Consortium nearest what we've heard from the Washington starting Seattle Building & Construction trades Council which have underscored and appreciation for us trying to gather this information. So on that second page there of the memo is where they reference their support for the language that we've now come together to put forward to create a comprehensive strategy to Advanced labor equity and housing. From the folks of Northwest Energy and Housing Development Consortium earlier today that they're supportive of this revised Amendment. It basically says that when we're creating affordable housing economic Justice and we want to see those commitments to Justice also reflected in those good living wage jobs as we heard from HTC. They have a hundred and eighty members were interested in working with us and the labor community and the city and the executive specifically to help come up with a strategy that will be then reported back to us in September. It will look at issues that we've already included in legislation in the past like our language that we've included in the case. I pilot that adjust just got awarded to Plymouth Housing that was intended to create stronger labor protections and policies and how the city is using those on labor protections that in many cases as we heard from HTC are already being used. But how are we actually seeing those reflected in the projects that go forward that the city's funding recognizing with city-funded dollars? We want to invest in the Public's good as well as building units and I think that was underscored this morning from folks has done here in the legislation in amendment number for is withdrawn from the language that we worked on with the building construction trades last year who helped us come up with me like legislation. I heard it was not exactly Meats which is Energy Efficiency standards that we had applied to the Seattle City Light on retrofitting legislation. We've also pulled from language from as I mentioned the evaluation of the case. I project that looked at issues like priority higher apprenticeship utilization oppressor preference priority for local workers utilisation of women and people of color in both Contracting and direct worker so much excitement comes from the ability to pull together all of these efforts and look at Apples to Apples and contained within the amendment is a plan for labor and the city and our providers to come up with the data collection strategy. Look at all three funded contract so that we can make sure that we have Baseline data on existing practices as we move forward to create greater pillars of our commitment to labor standards across City funded projects. So again, the report will come back to us from Office of Housing and FAS on September 30th of this year. I will still be around the starter is knocking and then we will have a chance to work Bradley with labor up or low housing partners and the rest of council as we think about what to do with that and just add my two cents on this. I'm really excited not just to evaluate what The case light pilot has accomplished as far as these these goals for our for our Workforce but also to collect the information about other housing projects because that's really how we started to create priority higher in in Seattle's. We collect data at that point on a lot of things but we're really really focused on looking at the number of workers that were from Seattle that were on these taxpayer-funded Public Works projects and we found that only 5% of the workers on those projects were actually residents of the city with our tax dollars. And so I think collecting this information will create some focus with a lot of different stakeholders on on the goals and The needs to make sure that that we are using city tax dollars not just to provide affordable housing but to also help create Pathways for people who live in the city to have a livable wage jobs. So I want to acknowledge office of Housing and the work that you have done on this and the K side is a big deal acquiring the property planning getting your partners. And I also want to acknowledge our friends in uptown. They've been very supportive of this and really demanding that office of housing have more low income and affordable housing in their neighborhood. Do you want to just address this this paragraph? Is there any anything that you want to tell us from Office of housing standpoint? I would say that we have had a long-standing commitment to labor equity in overtime. You see more and more explicit policies included within the administrative and financial plan. We do have requirements already for prevailing wages. We have goals set around Wendy utilization and we continue to see projects exceeding also our housing developers are doing a really good job at intentionally implementing those strategies we have take A cursory look at some data that we know we do have and see really strong outcomes for priority hire zip codes workers with the zip codes on our project. So excited to follow this approach this approach works for us to all get together continuing to Advanced labor Equity by analyzing the data and actually reporting on in some cases how well our projects are performing. So just two underscores are the process here. What I'd love to do is talk about a few of the amendments to the Amendments we discussed last week. I will go through each one of those amendments and then at the very end will consider the full legislation and then we'll vote on each of those amendments to or legislation as amended as a package. So what we won't discuss after each amendment, I won't vote after eating my mobile bill due at the very end if that works for you as a former grammarian point out a conservation of punctuation problem on on section 4 We've got. At the very end of the zoo, and we also have two periods at the online 6 to be wrapped in 2 minutes and there isn't any controversial. I just want to let you know we came to a conversation with you about the forward commitment policy where the office of housing director has the authority to forward command some future funds in a current Nova the current policy allowed up to 30% or 8.6 million dollars of only 2016 Levi dollars, which meant they have the ability to four commit these other funds we have now got a policy enzymes that says no bills offense count for the four of commitment, but we're going to increase the amount from 8.6 million to 15 million. So it is fine with that. Seems like a reasonable alternative kind of in-between. So that's Incorporated The Substitute. There's no dispute about Please want to let you know we can't do resolution and my bad resolution with okay 11. And this is one of those issues that we talked about last week has to do with mutual termination agreement policy. So that housing funding policies does have a management plan that has certain elements that are required to be submitted by housing providers when they get ready to open project that had suggested that we should add some language that relates to housing providers who use Mutual termination agreements to say that if they are going to use those agreements that they have to have a written policy that allows the use of such agreements and when conditions for eviction might otherwise the active pain, so I'm the last phrase a part of the phrase I think is the thing that HTC has now raised as a concern because in their experience with their their providers sometimes usual termination agreement are not used in situations where there's actually an addiction. And so I think what they have requested and what council member this gate is now recommending delete that last part of the phrase and just say that they will have a written policy if they're going to use me till termination agreement and that this coupled with the language that we have in the ordinance that has moh talking to stakeholders about when are mutual termination agreement shoes. What are Best Practices? What might be some sample policies that could be provided to provider seems to go nicely. I think that's fine the actual impact of this amendment where I actually consider it friendly is we're asking for a written policy. I was only asking for a written policy in the terms it in the instances where they were using it in place of an eviction. I wasn't asking for a written policy in the cases where the tenant actually wanted to leave. So if they want to give her both situations, I'm fine with that as well. You're interested in accepting and Conversations that we've had over the last week also to HTC for flagging this at late yesterday. One of the things that I think we saw in the letter is that the concept of limiting the mutual termination agreements to situations when illegal eviction of likely to occur potentially could be unintentionally disadvantageous to the tenants and we totally understand that sometimes those tenants to move they have a life Shane's I have a job change and so it is in recognizing that sometimes these Mutual termination Agreements are used to be advantageous to the tenant to get out of a leased one of them things. I love about this is that this will help us get the data that we need as a HTC suggested in their letter this process that you have agreed to amend here would allow for the city to have a better understanding of how are a city-funded housing owners are using these policy. So getting a written policy, so that's very clear to the tenants and very clear to I think our our departments as well on how these are being used. These policies that that's good grade practice and no absolutely that when I write this is actually asking for a broader guess a couple clarification because I actually walked away thinking that'll be great. We'll have a baseline understanding and stuff. That's not what we were getting with with the initial language. This isn't even better set of absolutely. No concerns about Mutual termination Agreements are used when a tenant wants to leave my concern. It was only when you told termination agreements were being used as an alternative to an eviction, but if folks want to you don't provide us with a broader policy, I think that's fine. I love it and I appreciate that and clarification because we're clearing that in your statement last week until the intent again just to underscore for folks. Is that on page 22 under the management plan subdue striking in This is when the conditions for eviction might otherwise be acted upon a very small Amendment but I think has a great impact and I'll share this with our accounts over you have one as well. Yes I do and can I just acknowledged the work that went into this? Thank you for being cooperative and collegial because it's really moving this forward and I also I also want to acknowledge the Housing Development Consortium. Thanks to Marty and the patience for getting this letter to a so quickly cuz it's obviously their opinion matters to me again. Thanks to o h for always being right there when we need help. So thank your council member herbold for bringing forward when we vote on this and just a few minutes. Can I say one thing on Mutual termination just as this amendment relates to including items in our management plan. I just want a flag that our office of housing Asset Management. Has the difficult task of reviewing those management plans and so really for us the most essential piece on this issue is doing that exploratory work to identify what the best practices are so that then the asset management team is in a position to assess whether or not the policies that are being proposed are graceful or not. Otherwise folks may include the middle management plan, but we're not in a position to say. Well we've agreed that this is or is not best practice. So just flagging how those work together and I appreciate the inclusion of the language in Section 3 to help you do that. So that was not something I was thinking of but I understand how that how about dovetails into the larger objective in super helpful. New Amendment 13 which also is including the substitute. This is the man offered by council member her bold that would as a relates to the Home Ownership program broadly. It would increase the maximum amount of a waste funding for development of resale restricted homeownership units from $90,000 to $100,000 only four units with three or more bedrooms. And I think you did mention it at the end of committee last week your intention to bring that but we didn't have a new front of us formally. So just to let you know when I'm sad, can you add trust about this the current amount of songs that are available is up to $90,000 a year, but we know that a family of four have to have it household income of a hundred and 10% of Ami in order to afford a mortgage on a $500,000 home or with down payment assist. They have to have a household income of 90% Ami more $90,000 a year and our our funding doesn't allow for funding of low-income homeowners up to well if they're not considered low-income homeowners when they're 90% Am I so are our funding is not available for down payment assistance for folks who are in that position. And so what this would allow us to do is it would allow us to provide sufficient down payment assistance for folks who are at or below 80% Ami, but it it tags that that funding amount only for development of units with three or more bedrooms again recognizing that were were tying the size of the household in the am I of the 80% Ami Household in what the Gap is for affordability for that size household for these size. Okay, and then the final amendment is amendment number 18 and this is one that is actually not reflected in the substitute is from council member hobo herbold. And this was one that was not discussed last week. So this a minute with a man that has a pending policies it to exhibit B for the rental housing program to acquire housing projects developed by Seattle Housing Authority that receive 5 million dollars in Moore city funding to include a goal hiring at least one apprenticeship. That is a graduate of a pre-apprenticeship program recognized by the Washington State Department of Labor & Industries for every 5 apprenticeships apprentices that are hired for such projects not a whole lot to add on this other than thank you Tracy for the work that you did with sha on getting them to agree to not having this is a requirement but as a goal I also want to thank the folks at and seal Housing Authority as well. And the worst they've done to in the past Step Up on many of the labor protections that you have mentioned Emily as well and their interest. I think there are there interesting really strongly working with us as we use the platform of publicly funded projects and a public entity like Seattle Housing Authority to underscore The Joint partnership and Joint interest in both not just creating units, but creating good living wage jobs as we build the housing. We don't want the folks are building the housing to also then at the same time is qualifying for the very housing that we're building. So I'll look forward to that continued partnership and they are not here for me to think today. So I want to thank them publicly for they're stepping up on this amendment. What what is our Building Trades think about this. Did you have a chance to talk with some folks at Aaron house? Go ahead and introduce yourself for the record high Marin house with their supportive. I think they're supportive of this broader labor strategy in particular and had done a lot of work on the case. I get to really come up with what are the standards? What's the date of we want to collect when so that when we go back and evaluate the pilot we can think about broader policy Direction. And so I think that they're generally supportive of the direction of this so I haven't talked to it with Marty and Anderson about this. I just what I want to make sure is that our premises are prepared. They they come for prepared what struck me was being a graduate of a pre-apprenticeship program recognized by L&I. Does that does that limit our pool for? Qualified apprentices for the pre-apprenticeship program. It's not for an actual Apprentice program. So this is kind of Baseline training program that gets offered to people who have no experience in the trades that actually give them some really basic understanding of what the skills are and skill development that actually tempositions them potentially to move into the trees and potentially to then get in line for apprenticeship programs. Like svi has depression program youth care has pre-apprenticeship program for homeless Youth and Des want us to get so tight that we didn't allow for other programs that are doing good work to be qualified for this and this is also what a i r program requires entrance there prevention program that it is Laura as the background of my thinking on this is that looking at the different components of higher as zip codes priority zip codes apprenticeship and pre-apprenticeship programs the proxy that sha uses because of requirements of federal funding that looks a lot like priority zip codes is Section 3 and they are performing very well exceeding what are requirements would be for priority hire for preferred spreads. For instance Cimorelli on a patient generally as compared to City projects that use party hire the piece that was missing of the components of party hire for sha is that pre-apprenticeship pathway in identifying this as a goal for sha that allows us to cut up add that. missing piece of the other party hire puzzle Is it cause any problem? Should be fine. Thank you. And I really appreciate you double-checking especially for our friends at the building construction trades and we will do some follow-up after this as well. And I underscore folks. This will not be coming to a full Council on Monday upcoming up. It will be the following Council on Monday, June 24th set up a time and I think you wanted to highlight. Is that okay ready to move on with the boat? Yes. I was carrying on on the thank you. Thank you Tracy for your work with us. And this is not just our conversations. You've been involved with the offices and city council is also our larger community housing round table that we pulled together to walk through the various components of the afford an F plan. I thank you Emily to you and your team. I know that this was something that we had. What too much excitement for that is a bunch of alphabet soup and you helped us understand the the excitement exciting opportunities for us to channel the policy ideas that we had into the end of plan and you've been very generous with your willingness to adopt many of those especially our commitment that we peppered throughout that we talked about last time as we build housing wanting to build Child Care Health Center community centers in to do so in a way that is reflected throughout the plan. If you will find little Jewels throughout this document that have come directly from Community really want underscore as well. Some of the Amendments we talked about last time in terms of the community preference policy the affirmative marketing policy that opportunities for first-time home buyer to have the chance to now have a home love what we've done on expanding the number of bedrooms that really families can afford to live in this city as we Elevate housing. We also are elevating a worker Protections in this Visa policy. So, Just a lot of work went into this the mayor's office executive team led by Emily and director Walker. Just thank you very much and Aaron house. Thank you for your ongoing work on this time and for helping us get all these amendments in and then also work with the community has been really really a badge of honor to have you on our team and I think that the document here is as more informed because of your work and work with community. So thank you before you got a piece of work that we're doing cuz we could do it after I do. I do think that we did not intend to Have the pilot be exclusively for on ideas within the existing structure. It could also be used for the accessory detached unit. And that with this pilot. We can make those spaces more livable and that's really tied to the work that we're doing under the leadership of Nelson, bro, Brian and so very excited about that that work again. Thank you both for your input on in the administration and finance plan Emily. Is it? Okay if I keep calling this the moral document official approval. I have to move to remove Amendment 11, then council member herbold will move to include her revised Amendment 11, and then also include amendment 18 and then we can vote on the whole package. So I'd like to move to pass Council Bill 11953 one second. Are there any other comments all in favor of moving Amendment? I'm considering removing Amendment 11, which is exhibit B. I'd like to hear from you. So I'd like to move Council bill 19531 by substituting version 2 4 version 1 by substituting version for 4 version 3 of exhibit a and by substituting version 3 4 version 2 of exhibit B, except for Amendment 11 which just underscore removes Amendment 11. Okay, if we have removed from our documents plural, we are going to consider the revised Amendment 11 customer. I'd like to move revised proposed amendment 11 great, which we can find an exhibit B chapter 4 section A 10d Vented by Council Central staff which cast member Herbalife preferred to revise? I'm at 11 for Simplicity and appreciate that none all in favor vote for moving that motion forward the motion carries and the amendment is adopted cuz her phone would you like to move 18? Yeah, sure. I would like to move related to The Usos related to this is related to the amending Council Bill 1195 31 exhibit B chapter 4 section e apprenticeship programs by adding a new paragraph As presented in amendment 18 all in favor any post none great. It appears that amendment 18 has carried and then then it is adopted. So here we are with our amended legislation if there are no further comments. I'd like to move that the the committee recommend passage of council Bill one 19531 as amended any other additional come? All in favor say aye then opposed great. It is unanimous bring for the various pieces of legislation and we will recommend passage of FL 11953 one as amended on the June 24th city council meeting for final consideration. Thank you all for your work on this and if plan and look forward to working with you as we do the implementation, just thank you. I know we've been doing this and really appreciating and diving into the thank-yous. But seriously, this is been a ton of work on we are and I'm glad you're part of the team Tracy you're going to start the number of times you've been in explaining all this to me. - always Emily office of housing. We really appreciate you and if anybody wonders we keep calling it an F plan administrative and financial plan for or Seattle Housing Levi. This is the thing voters vote on that it works. So, thank you. Turn off left. We have extended this to noon hoping you guys might be able to stay for the last fifteen. We had delayed having a conversation of this last item on the agenda, which is notice of intent to sell. It's just a briefing today. And then I'm we will get you out of here on time. Thank you very much for joining us air in and all your work on this item number 39537 and ordinance relating to the sale of low income housing requiring owners of certain multi-family rental housing to notify the Seattle office of housing the Seattle Housing Authority and the tenants of the owners for proposed sale of that housing for roofing in discussion, Tracy and housing. Okay, great. So I'm going to try to be very brief. We know that the cost of housing continues to Skyrocket in this city. We are trying to look at every tool that we can add to our tool boxes. There's no one tool that Galvez address affordable housing across the board but as we see the cost of housing mean that I units go up for sale and gets all just like that. What happens is that many of the folks who are living in multi-family structures think of apartment complexes even duplexes and triplexes those units go up so fast, so we'd love to do in this legislation with your help is to study for both tenants or an existing structures for a non-profit developers to have access to these multi-family structures before they go up for sale on the open market other cities is that when we create this window for individuals who are tenants and for nonprofit developers, including off of Housing and sha have access to make an initial bid. It doesn't change the cost of the sale but it does create a little bit more opportunity for especially our nonprofit developers that have access to help create a more affordable units across the board so very Briefly I'd are you going to go through I will do that. I just want to say thanks for the ongoing conversations that we've had with many of your offices. And and for the other cities Hoops in men s the chance to learn from them. This is not the end of the conversation today. We have had some conversations with some folks in the industry to talk about various ways in which this can be implementable. I love that word because it's not just a vision is how we make it work. I'm the one flag for folks that this will be coming back on for consideration in this committee again on July 11th. So this will be the beginning of the conversation and how we're proposing to the city council adopted the first notice of intent to sell policy in 2015 that policy requires owners of multifamily rental housing units with 5 or more housing units with at least one of those units renting at a rate of 4/2 households, Adam below 80% of area median income wish today would be About $1,500 for a studio $1,600 for a one-bedroom. The owners are required to provide this notice to the office of Housing and the Seattle Housing Authority the owner must provide at least 60 days prior to listing a property with a real estate listing service or advertising it in a print newspaper or on the Internet. The notice must include the owner's name phone number and address of the property housing is responsible for enforcing these requirements. Are they do it on a complaint basis only the Seattle Department of construction inspections is authorized to impose a penalty up to $500 for any person who failed to provide the existing required notice. Chance of moving to the proposed legislation. It would make a number of changes to the notice of intent to sell policy and that includes the following it would expand Nonno's requirements to own a multi-family rental housing units with two or more housing units again with at least one of those units running at a rate of 4 total household. I add her below 80% of Ami. This does not apply to be really clear does not apply to single family homes 280 use or. Dues and that is basically just because of the definition that we use in the legislation would have which excludes those from this policy. It doesn't crease of nose. From 60 days to 90 days prior to a building being listed for sale. It requires an owner to submit a signed declaration under penalty of perjury affirming that the owner has comply with a nose requirements when they submit their written notice to the office of Housing and also requires an owner to prominently posted notice in the building notifying tenants of the owners intent to sell the building. So the tenants are informed of this impending action. The notice must be posted no later than 90 days prior to the building listed or advertise for sale the nose must include information on the availability of home ownership assistance from the office of housing as well as information from the city on programs that can help renters who might have on some need of assistance in the event of a building sailing. It also requires an owner who is not actively marketed their property for sale. So not not gotten to the point of being able to list but actually has gotten an unsolicited offer. It requires them also to provide a notice to the office of housing to sha and to the tenants within two days of receiving the off. Cause I know that this is an issue that you're not thinking about selling your property, but somebody calls up and says hey, I would love to buy that house and here's an offer. So that would not be enough. So the language is very clear that they receive an offer and they intend to act on that offer. So it has to not just me that although they got a call or flyer that says, you know, we want to buy your place. It's that the owner is intending to move forward with that offer. So we made we made it really clear that that has to be part of the equation. This would not apply to single family homes and it would not apply to any home that has a daddy or granddaddy was so in case folks or thank you. Oh my goodness. What does it do to me is in a homeowner that wouldn't apply there. I was going to actually hold this question. But since you underscored the fact that it does not include single family homes have a question. So one of the Urban Villages within my district is really really interested in pursuing some sort of an overlay of their neighborhood because they want to make sure that as single family homes are sold that they're not just flipped and one of you know an affordable neighborhood for for young families for homeownership. They're worried. It's going to lose its affordability. And so they are actually interested in creating some sort of an overlay just in the Morgan Junction. For single-family homes. Just what do you think about that? So I know that the mandatory housing affordability accompanying resolution directed our office to work with community members from the Morgan Junction on this issue. We have met with phone has several times and I think that part of that conversation what it reveals is that really in this Ledges existing ordinance that we participate in and from those community members. The real interest is in finding willing sellers who will then sell to an entity like a land trust or an affordable housing developers to help try to maintain affordability. And so we've talked to your constituents about how do we both educate owners about opportunities? And how do we inform them about the ability. Transfer their properties to affordable housing developers and that can come in many ways and it's partly about building a relationship with property owners to let them know. About what it says. So sometimes in these cases carrots or information or education sharing is really what's important. And so for the purposes of the existing law, this is a little bit of a pivot one of the things that our one of the things we focused a lot on implementing the owners of their requirements under this law because we are unlikely to get owners who are interested in transacting their properties with affordable housing developers if they don't know about it, and they don't have confidence in the ability to to to sell the property that way so we didn't mailers to all Property Owners. We posted information on our website we work but the rental Housing Association and we had a real education focused implementation of that and I think similarly in sub neighborhoods where there's an interest in moving property from private to nonprofit owner. Skip that education piece is going to be critical. So let's keep going to have a few more minutes. I last two Provisions that are worth noting the ordinance would prohibit an owner from executing a purchase-and-sale agreement for the building until 90 days after the required notice has been issued or posted then this would apply to either the case in which they're getting ready to list the property or got an unsolicited offer. So 90 days before they could actually move for with executing a purchase-and-sale agreement. And then finally the penalty for violation goes from $500 to $2,000. Just passing legislation, but making sure that it is workable and that there is enforcement and when we see a $500 penalty right now and then also recognize over the last five years, there's only been about nine individual cells that have been brought to the office of housing for notice under the existing ordinance and made us think that we need to do a better job of both doing education as Emily talked about And also doing a better job of enforcement. I don't want to pretend that $2,000 is a huge penalty because we know that it would potentially be a drop in the bucket compared to the actual sale. We've seen some other kind of innovative more robust strategies used in other cities on when it comes to legislation like this, but I think recognizing that it's not just about the stick as Emily talked about it's not just about the penalty but more about the education and broadening out who gets noticed when we do things like not just increase the fine, but do a better job of notifying the tenants which is not a component of the existing ordinance run out the number from not just five and more units but to 2 in the morning and it's there's more opportunity and I think one of the things I'm excited about his potential first-time home ownership opportunities with the changes of the state law that allow for us to think about the condo ization of some existing multi-family structures. There may be more people in the future who would want to take up these two first time. Options of tenants good job of hosting information at the front perhaps more of these individuals will want to work with our nonprofit developers to potentially initiate a transaction and as we've heard from Office of Housing and Seattle Housing Authority acquisition is becoming more and more a tool to help us identify which structures we can bring online to keep as affordable housing that said, I regarding the 90-day window existing policy. As you know, is 60 days. We have brought in that out because many of the folks at our community housing round table has said within a 60 day. It's really hard to initiate that transaction to get all the paperwork together 90 days will be more more reasonable. Also engaging in folks were on the seller side who say hey, we usually get a heads up within a 30 day. Whether or not someone actually interested. Maybe there's both on time frame that we can look at first. Is there a notice of interest that we can buy defiance? In a future draft for our colleagues to consider and if he's there is interest then that 90 day. Kicks in I want a flag for you all and the public and anybody who may be listening We are continuing to explore that option and over the next month because again, this won't come back until July 11th. We would love to explore with you the potential for the intent time frame and then the transaction or in initiating a transaction time frame send area or a couple of areas. You mentioned that I'm interested in is and I understand that San Francisco may have what they call a gate that allows for somebody to raise your hands. Hey, look I'm interested. And then the second gate is all right. I'm going to bring forward to you. Maybe it's a statement from the bank that says I'm capable of doing this and then the third is okay. Well, we'll extend give you some time lines to make that work. I will tell you I'm interested in that tiered timing tiered based upon the size. Set of the units for example, I'm having been here and I know that council member herb old was was here as well in a different capacity. But we worked on this though. The notion of the 60 days prior to listing a property that was quite a debate how long that was going to be and the other was the five five or more like wise was the debate real estate groups that I have have heard from our saying, you know, 400 not a big deal because there are a lot of quad quad quadruplexes at that people treat them really as I'm living in one and I got my mother-in-law living in one. So I'd love us to consider. You know, that 5 units are more. I'd like to discuss that just raised it and maybe talk was more folks about why did we choose that particular number? And I also think the 90 days frankly is a really long. Of time. If you're selling a home the the gem in the world is a willing buyer. Now. I realize what we're trying to accomplish is to make sure that others have a right or you know advance notice to get their financing together and like you were talking about with your experience and Queen Anne had you known you could have had the time when there were people with the wherewithal to make that happen. So those are the areas to the tear timing the gate isn't any of the gate which is essentially or I'm going to give you a certain number of days notice and I think I understand San Francisco is like 5 days seems really short but the idea is just raise your hand if you're interested or not, but not fair if nobody's home just said five day starts ticking. So I would love us to explore that butt in those areas. Let's take a look at it. You know, I know the 60 days. Hard spots look at the tiered with the time and could be and then have an actual gate that says whatever. The number is 5 days 10 days 15 decide. I'm interested. That's all you have to do and have you know within the next certain number of dates to say, okay here is my finance plan or at least a statement from the bank saying this person has has the wherewithal to do this as well. Thank you. I just want to say in retrospect. They do remember in 2015 when this is being discussed in retrospect. I don't quite understand why this was so hard fought because there were nine property owners that complied with the law and we know that in the last four years there have been many or three years probably wants that one actually went to a fact there been many more properties that have sold in the city. So that is kind of fun thing to reflect upon I think the verb is awfulizing but we want to make sure that we get this right so people comply on the issue of enforcement. I would like to explore whether or not the office of housing might consider a something like what like the office of housing Army entire the office of civil rights or the office of labor standards does not just waiting for in a complaint to come forward that there's been a violation but having sort of an affirmative enforcement process and perhaps what that might mean is periodically checking with the King County Assessor. It would be after the fact right on notice is a violation you to maybe check or not notice about God notices of sale, you know, maybe doing a green to check 5% of sales a year on to see whether and in comparing those records in the King County Assessors with your own records to see of the sampling that you've looked at whether or not those properties hell reflected adherence to this new requirement because these aren't these aren't these aren't documents that are required to be filed normally with the city. They are required to be filed with Kane County. I'm going to going to be requiring them, but you're not going to know what you don't know if they're not being filed her just to think about it cuz we got a month. I appreciate you bringing that up because turning Emily's wheels are turning over there and it gives us a few weeks to listen to chew on some of the important ideas that you had and maybe look at some of these other examples, Rivage I had and I like the fact that we're not just putting call sandpaper, but we're thinking about how to make it workable and enforceable on so I'm going to ask you all to think about that and work with us as we think about that component any other comments from the two of you I did have one other suggestion for us to consider in the next month and that is to containing a group of stakeholders tenant Advocates and providers. And if you can do that Brokers land at 2 to talk about how we can both create a system where we're monitoring and identifying properties that can go up for sale in advance as well as potentially make you some recommendations as it relates to creating the budget and capacity-building for tenant groups to work together with nonprofits to purchase their building PC has a has a has a model for that capacity building model. And so perhaps a group of stakeholders could also applying on that as well. I would love to say yes, and yes and stakeholders, but let's broaden the stakeholders. So nobody feels left out and I think there's a distinction between the two conversations that were having someone is a we will definitely continue to Being stakeholders as a release to the legislation. I think that's a great idea. And when I say stakeholders is Broad believe me folks. We've been trying to the tenants and the nonprofit developers as well as Sha and offer housing to get feedback on legislation. And then I think I hear what you're saying is assuming this passage. We want to make sure that it's not just I'm making available the information but then how do you do the ask that building so that people can actually access those dollars and make it to make a transaction possible. We should be a broader stapler process going forward. So go ahead and did your phone work in Tracy. I just want to respond to your I thought you wanted us to do that before the legislation was actually adopted and that was going to be a problem. Tested as an amendment that we would develop. Setting out what we are goal is in the future. So what I heard was five maybe more things starting a backwards forwards on together a table so that there is an asset building conversation that would accompany such a policy also reaffirming that we are interested in continuing the engagement with sellers tenants and potential buyers from the non-profit world, including our public Partners in the next month as we get to get this right in terms of the policy ideas that we've heard is affirmative enforcement looking at the size of the units looking at a tear time frame which is sort of what I described verbally, but we'll look at some of these other examples that you mention. I definitely interested in what that looks like for an intense and then sail and you mention proof I'm so those are the four policy areas that will look into in addition to the stakeholder commitments that we've made and with that we will bring it back on July. Event and that will be a 9:30 meeting one of the flag for folks. Especially our Council colleagues that there's not going to be a regularly scheduled meeting next week because of that nothing will not having one next week and we will also have a meeting on the 27th to make up as well, which is going to be June 27th at noon is going to be a special meeting just focus on the hotel worker legislation. Remember that hotel worker legislation initiative one 24-pack by 77% We want to do the legislative approach to getting the policy into statute to make a few tweaks here and there so we've been working with hoteliers and the workers and training at large to come to you all with and legislation that I believe is going to be online available for you all to take a look at in the next week or so legislation for pieces coming for our June 27th meeting and if there is anybody interested in childcare for that, we will provide childcare. Let me let me rephrase that. We are also going to have an evening meeting with childcare will be provided on July 2nd two days before my birthday to say it is my birthday on July 2nd at 5. I'm sorry 5:30 is that right? Friday 5 p.m. To bring folks in to talk about the hotel worker legislation and there we will have childcare. So if you'd like childcare give us a heads-up and let us know we will also have discounted parking at James and 5th Avenue at $5 and I'll let us know how else we can accommodate you all being here. We know evening meetings are tough. But day meetings are harder for many people who work during the day. So with that huge appreciation for all that you've done on Erin s and congratulations on today and thanks again to everybody who came out to testify this morning on the hsd and play with that. Today's meeting is Adjourned. Thank you.", "end_time": 9467.8}]}