{"format": "raw", "annotations": [], "confidence": 0.9432764018283171, "data": [{"start_time": 0, "text": "Good afternoon, everyone and thank you for joining us on July 10th 2019. This is our financing neighborhoods committee on Sally Bagshaw chair of this committee with me council member Gonzalez council member O'Brien council president Harold. Thanks all of you for being here. We've got a number of important items on our list today and I want to just go over those agendas agenda quickly. We've got an ordinance to fund Housing and Community Development programs. This is part of what we call our 2019 annual action plan is a Consolidated plan for Housing and Community Development. We're actually going to have a pro forma public hearing. We will open it up people can speak to it. Then we will close it. Then I'm going to ask my colleagues to allow us to move forward to be able to vote on that today. But probably the reason most of you are here is because we are going to be considering two separate ordinances ones related to funding for the Equitable development initiative. We call it a TDI. For sure that is dealing with affordable housing and creating a fund for short-term Investments for our rental tax revenue. And then our third item of business is an ordinance that is going to look at our sweetened beverage tax revenues and how we're going to spend that money and I want to say thank you to councilmember O'Brien who has been really the sponsor on these and the advocate for all of it, which is here in my committed today in no small part because he was very interested in moving forward this summer. So thank you for that and we will definitely get to those items for possible vote later. So With that, I think we can now take public comment. We've got about a dozen people on the list. If you signed up to speak what I'm going to ask you to do. I'm going to call three names and most of you know the drill already the two microphones in the middle pick whichever one is most comfortable for your height that one over there. They all move they're all just pulling towards you closely. And so you'll each have two minutes Allison all time. You can see you'll be able to see the clock. So if I can call Tanika Thompson Island Sarita and Lindsay is it hovind and if the three of you will step up to the microphones get ready, and then of course Jim Krieger will be the fourth speaker. So welcome to Mika. Welcome back. Thank you for working with Scott green. Looks like you got a cheerleader C-section behind you. NM City Council Members, my name is Shaniqua Thompson and I am the food access organizer at. Green. I am here in support of council member O'Brien's legislation of a separate fun. But the sugar sweetened beverage tax for 20/20 the Fresh Cuts voucher expansion program has helped 2,000 low-income people of color and Working Families have access to healthy affordable food. However, we could and should do more within 30 minutes of the public site opening 700 enrollment slots were full there is currently a wait list of 3,500 people which had to be shut down after 1 week due to the high volume of people signing up for fresh asking the 120. Mm in addition to the 3500 families in the food security Gap to wait until 2021. Opportunity to have access to healthy food should not be an option. During staff and volunteers knocked on hundreds of doors in South Seattle having conversations with our neighbors to explain why they should not see the SPG as just one more aggressive tax when people Express their concern about revenue from the tax going to the general fund. We put them at ease by telling them all about the program's their money would go to for their benefit. We told them both ate those things because that was what we were told by you the community is holding. Green accountable and we are holding you accountable you made commitments and we expect you to honor them voting against this solution happening in 2020 will create a relationship built on dishonesty between the community and city council you made a commitment to reinvest the revenue from the spt back into the community it came from as outlined in the ordinance voting yes to a separate Fund in 2020 will ensure that this Revenue will be protected from going to the general fund and being spent on who knows what Ardmore moment Kanika can I ask you to wrap up please? No problem. Waiting to put this legislation in place until 2021 will put those who have already worked so hard in the position to start over again. Is this the Legacy you choose please let's finish what we started. Thank you, Tanika. Can I get a nap after Lynn we have Lindsay. My name is Lynn Sarita. I am a senior citizen. I have a shop that the farmers markets with the French book match since it started, you know, I think 2010 additionally I qualified for the voucher program. I want to tell you that in my apartment building their three families. I think they are now using those vouchers. They have working parents. They didn't qualify for food stamps, you know, but they have you no bills to pay and everything and the vouchers meant so much to them. You know, it is very important to have the fresh vegetables and fruit and also want to say generally I do not like regressive taxes like sales tax, but I like and I like in this SBT text to like the taxes were used on cigarettes right that where the money was going through smoking cessation programs. Get dispatched hasn't right because the money is going to wreck lie to people that are often affected that affected the most by lack of access to healthy food and I would be extremely disappointed if they put the money into general fund and end this program cuz this is a program that is absolutely working. I'm like over 65. I have normal blood sugar all that, you know, and I think like having the vegetables and fruits. It's really helped improve my house. So that's what I have to say. Thank you very much. And I'm glad you're feeling well. That's bad and thank you for you than Jim Krieger and then it looks like Victor Coleman. Thank you. These fellow Advocates did such a beautiful job. I'm Lindsay Joven with the American Heart Association and we to fully support council member of Ryan's proposed ordinance starting in the 2020 budget. This would restore 100% of SVT revenues to the commitment Council me to community in 2017 to grow and expand food access an early learning programs are the taxes off to a promising start diverse communities across Seattle or already benefiting from meaningful Investments and food access in early learning. So actual Revenue happens to be higher than projections which were based on assumptions. Please do not divert funding from the intent of the original ordinance and that commitment that you made to community I ask for your support of the proposed ordinance with implementation beginning with the 2020 budget respectfully asking that you not adopt the proposed amendment to push it to 2021, please ensure no more SBT revenue is diverted. Ensure it is all used to fulfill the promise to community to expand access in early learning programs in the communities that need it most thank you. Thank you very much Jim Victor and then abusive. I am co-chair of the commune Advisory board for the sweetened beverage tax and also executive director of healthy food America of nonprofits focused on Equitable healthy food policy the commune Advisory Board supports the proposed ordinance to set up a special SBT fun and prohibit the use of SVT Francis a plant general fund support for healthy eating in early childhood programs and most specifically than half support setting up this fun to monitor how the revenues are being spent to make sure they're being allocated to support a specifically new and expanded healthy food and early learning programs for low-income communities is consistent with you original legislative intent on with the prom. Is made to community members who supported the adoption the tax in the first place importantly we want to see that the fbt revenues are not use for supplantation effective in 2020 budget the Caps committed to seeing that I speak to your revenues are allocated to promote social racial and Health Equity and to address to Progressive and disproportionate burden of health problems associated with ssp's and therefore to be devoted these specific uses. We want to see that the revenues are allocated to they mitigate any potentially regressive tax Effects by showing that they're invested specifically in low-income communities and not going to the general fund. So with the utmost importance of the cap to see that these funds were used as intended only then will the spt be a progressive rather Progressive policy only then will the spt tax limitation respect the values and expressed desires a community Advocates and Community who supported the tox adoption to matter honoring the promises and commitments made by city government maintaining faith in our Democratic processes. Honoring the commitments now not waiting till 2021 Repose therefore to any delays in the prohibition of supplementation losing another 5 million dollars in 2020 is not acceptable and closing with strong support the proposed ordinance, but not the amendment to delay till 2021 and thank you for your attention to this matter. Can remembers my name is Victor Coleman. I'm the director of the Statewide childhood obesity prevention Coalition in member of the Seattle healthy kids Coalition. I'm here to testify in support of the proposed ordinance regarding protecting all of the new revenue from the sugary beverage tax. This ordinance is needed to deepen the legislative intent and purpose of the original spt ordinance, which was to ensure to the community that the new revenues are going to create expand Key Programs and initiatives while the city has for the most part lived up to the initial promises on this new Revenue that uses some of these revenues in last year's budget to shore up in Portland programs that were previously supported by the general fund is problematic. That's why this ordinance is needed. Trust in government trust in government is a critical part of a vibrant Collective Society in the harm done when trust in government is broken or severed really hurts both the citizens as well as the government institution. This ordinance can help rebuild that trust. So we strongly encourage you to support this ordinance and it's important as you've already heard that the organs be passing made applicable to the formation of the 2020 budget. Thank you. questra Good afternoon council members. My name is abusive animal organizer message or a coalition of a 25 community-based organization is over the last two years. We have seen the mess. This placement does happen in our city how it's affecting our community and our families. How is this place in cultural and religious institution is and how is multiple businesses are getting pushed pushed out and priced out of our Siri is the only fun that address is a comprehensive and displacement strategy framework. I will need to grow and protect this important fun last two years day. Did I find has received over 30 million of eligible asks this as a Community Thrift and Float minutes. With people and institutions in place and this year and next year that the fund will see 20% less money. Then was allocated in short term rental tax legislation council member of Brian is amendment. That's before you today. We also support creating a dedicated fund for this will turn a beverage tax as well to protect the revenue for the legislative purpose of that fun. Thank you. Erin, Moran. Hi, I'm Simona Community Alliance for Global Justice and a member of the coalition to close the food security Gap and I'm here to urge you council member back. So and this committee vote Yes on consumer Brands proposal to create a separate fun for the sugary beverage tax revenue. I also ordered this committee to not wait for this to take effect until 2021 because we can't let several more years go by while people are left struggling to access healthy food when they've been told that this tax revenue will support closing the food security get this tax is an opportunity for city council to demonstrate equity and accountability Grassroots Community organizations have been on the ground telling people who are most impacted by this tax communities of color and low income that the revenue is going to expand and increase city funding for fresh bucks. So it can reach more people in need that Community light food access programs will get support and most importantly that the tax will be Equitable that people who have been impacted by an unjust food system will That's it from the revenue of a tax on sugary beverages which is part of the system the food access programs at the taxes supported are working. So let's not let another budget process or months or years passed without counsel being accountable to their commitment to increase the funding of these programs and then instead of moving the funds to other programs. It is the American councils job to find important work and it should not be at the cost of accountability to community. We all have the right to eat healthy food. So please help close the food security and create a separate fun for the sugary beverage tax. Marion Marion Good afternoon, Marty. I'm sorry. I jumped you. I really apologize. Would you hold on just a second Marty or up? Okay, thank you. Please nice to see you again. Hello, Tara Bradshaw members of the finance and neighborhoods committee. I appreciated the opportunity to meet with you yesterday with a few other South Korea represented in shock about how the EDI fund husband could have been a critical resource to Equitable community-driven anti displacement projects. My name is Madeline Casa Moon. I am the community development manager at home site, which is also a member of the racing social Equity task force. I'm here once again to affirm my support of council member O'Brien's amendment to use the first five million dollars from short term rental Revenue to fund EDI projects directly as was the original intention use of the fund Levi's fun is the only friend of its kind and has made significant impacts for community-led capital projects such as the Adela square and africatown Midtown Center. The fun doesn't stand cannot currently meet the demands of the community as the fund has had over 30. Million dollars and asks in the last two years there for any cut back and its dedication would hold the funds current anti displacement progress for the more. We also support got green and our community Representatives here urging for the creation of a dedicated fund for the swing by sweetened beverage tax as well. Thank you. Thank you very much for coming. And I I just also want to say thank you for coming to my office yesterday. It was good to see you Marty. Welcome back from I'm here today to show the support of our 180 members for the funding for the Equitable development initiative. It's a testament to our commitment to equity anti displacement Community empowerment. And we need to find a match that we strongly support the proposals that allocate the short term rental tax funds for the EDI program and its grants and we need stronger and more sustainable funding sources. This is a step in the right direction HTC members have been and will continue to be partners on EDI projects recently at our Housing and Development Community Development Summit. We joined together with Housing and Community groups to dive into the important work of collaborating as we work to meet the tremendous need for housing and ensure that housing is reflective a known. By the community, we know the importance of this work, but it cannot happen without the funds to ensure that communities have the opportunity to overwhelm the destructive forces of displacement whether that be economic physical or certainly cultural today. I'm reminded of a favorite quote of the days. I used to work with the native peoples initiative from Lila Watson if you are here because you've come to help me you are wasting your time if you are here because your Liberation is bound up in mind, then let us work together. The EDI is our first step and we need to keep moving it Forward aggressively. Thank you. Thank you, buddy. I think we've got one more speaker Katie Wilson. High Council Members, my name is Katie Wilson, and I'm here representing the transit Riders Union. We want to express our support for got greens asked that all funds from the sugary beverage tax be protected and used for food security initiatives. As you know, the transit Riders Union is a strong proponent of progressive taxation, and while we recognize that there are some other policy considerations in taxing sugary beverages. It's also a regressive tax, and that makes it so important that all of the revenue from that tax be reinvested in the communities that are most impacted by the tax, especially low income in communities of color, and if that's not happening, then we're kind of just texting poor people. So we really really urge you to protect that those funds as soon as possible. Thank thank you kitty. Okay. Colleagues if there's no objection the agenda that I mentioned before will be adopted. Hearing no objection the agendas adopted. Okay. So now I believe we're going to have Allison Reed in the item number one and then we're going to open it up for a public hearing number one cancel the 1 1 9 5 5 0 and Ordnance relating to funding for Housing and Community Development programs adopt in the city of Seattle 2019 annual action plan to the 2018-2022 can solid plan for Housing and Community Development commission to the United States Department of Housing and Urban Development. So this committee was briefed on a draft of this 2019 annual action plan a last December 2019 and 2018. So what we have now is just a confirmation about what the action plan will be in where the investments will go. So I'm now officially opening a public hearing. For any discussion about this anybody want to speak to the action plan. See none. I want to close the public hearing. so now we will invite to the table the speakers that are going to be introducing And discussing this so if I can invite Amy add an r h St. Welcome. To thank you both. Amy do you want to introduce yourself first and Dan Central staff? I can post you to make yourself comfortable Amy. Are you going to introduce us or LED 5-0 which adopt the animal action plan and it allows us to send it to HUD and make some budgetary changes based on that and no action plan. I can give you the detail very good and damn my understanding is there is a small change to this the money is that would come from Hyde. We have something like $750,000 more than what we understood in at the end of 2018. So maybe you'd like to just give us an overview of this talk briefly about what the more looks like and then we can put it to a vote. So the 399 develop last year and Enough with the 2019 budget we used projected revenues because the federal government had not adopted a budget until February of this year in April of this year. We are allocation. We're able to update the budget projections were very close the four grams that this action plan coverage of the Community Development block grant emergency Solutions grant that housing opportunities for persons with AIDS Graham and the home investment Partnership of crime there were only very small changes those the total of 750000 are next to 60,000 for the Community Development block grant that's on top of 9.3 million dollars that $60,000 increase will go towards funding for the home side at Ellis Square project. I'm the emergency Solutions Grant with increased by $26,000. They'll go towards emergency shelter which funds emergency shelter rental assistance mostly in 2014 the housing opportunities for people with a persons with AIDS. Formula allocation process was modernized our community saw a huge increase in the amount of money that would come in based on that. So this year we are increasingly can we $600,000 which is the bulk of the change from the projected revenues that money will be released in a bye. Bye on Yule RFP in the spring of 2020 in conjunction with King County Public Health and we discussed this little bit yesterday. There's going to be some additional money is going to a Rainier Valley site. So Emergency Shelters anything else specifically you like highlight know there is a large amount of prior-year funds that were identified in 2017. And distributed among several projects who then turn that money down that's going to be re-released in an RFP this summer to explicitly describe what those funds are and what you can use that money. Okay. So our 2019 annual allocation is going to be a total of 21 million. That's right at $67,444. And then we have about six million dollars of this prior-year that is authorized by the adoption if it's very good and I know you've got descriptions in this report about where this money is going that's on page 3 of the report Council colleagues. You have any questions about this. It's essentially we are accepting 21 million dollars. Okay. Alright, so I'm not I'm not seeing any other questions at any other questions or concerns. So if you have no more questions, I would like to move Council 119550 all those in favor. Say aye aye no abstentions. Thank you very much then. Maybe thank you for your help. Okay, I'll send you one of Redan Council Bill one 19402 to cancel that woman 9402 and bun for short term rental tax revenue impossible boat. Very good. Thank you for your good work on this and colleagues. I I want to just make sure that counsel present a council member Gonzalez know I had proposed an amendment to this but I'm going to be withdrawing that Amendment. I'm supporting councilmember O'Brien's because he and I had talked about this during the week. I support what you're doing. I think we're close enough that there's no use making things more confusing. So I'm going to be supporting is amendment withdrawing mine. Yolanda ho Council Central staff So I'm just to give you a little background on the short term rental tax, which has been discussed in the past two committee meetings. It was a 4-night tax on each short term rental operator in Seattle and it was first established to generate at least 5 million annually for Grants to community organizations for the Equitable development initiative projects also known as EDI, the mayor's proposed budget in 2019-2020 allocated revenues. I did not fully aligned with this intent and made it difficult to amend the spending plans without reducing funding for other priorities the council Bill one 19402 was introduced during the fall 2018 budget deliberation process in response to this to ensure that counsels intent was clear and afraid of fun that would allow for the tracking of this Revenue Source this day we didn't the council opted not to act on this cancel bill because the account Could not find ongoing resources they were able to find one time resources in 2019, but not ongoing resources to fully aligned the proposed spending plan with the original intent and also at the request of the city budget office. So in reference to the mess the memo and table 1 shows a detailed breakdown of how the short term rental tax proceeds have been allocated in the adopted 2019 and endorse 2020 budget the inconsistencies with counsel intentar that funding for EDI Staffing consultant support are taken from the 5 million intended for Ati Branch leaving France at about 4 million and funding for existing Supportive Housing projects in the rental housing assistance pilot, instead of new affordable housing projects and payment of debt service on bonds issued for all the housing projects. So that is kind of the background of the bill and onto as the chair has noted that she is withdrawing her moment. So we will just be discussing councilmember O'Brien's Amendment. So this is a this amendment to the original bill from last year would establish a short term rental tax fund beginning January 1st, 2020 and establish Financial policies that would begin also in 2020, which was direct the first 5 million to the Equitable development initiative grants direct the next 2.2 million to Debt Service payments on bonds issued for affordable housing projects direct the next 3.3 million to support permanent affordable permanent Supportive Housing direct the next 1.1 million for Equitable development initiative Staffing and consulting services and direct any additional revenues to Economic Development initiative grants. So the impacts of this amendment are that unless the revenues are higher than the projected 10 points 5 million in 20/20. This will this could result in a shortfall of 1.1 million for funding the Equitable development initiative Staffing and Consultants Services next year. So if general fund or rather a new revenues are not generated to back to the shortfall this respect. This would hinder the office of planning and Community Development ability to administer their program. Okay. Thank you. My bro, Brian you want to speak to it? You want to thank you for that background form here for the past couple of committee meetings in giving me space for that and I appreciate your support of this amendment. Colleagues of this is fairly straightforward. But just to the hierarchy of what we're doing on my top priority would have heard from Community is that there's no other source for these EDI grants. And so that's why the five million dollars at the top of the list to the expectations. We will be able to Grant at least five million dollars every year. I'm going forward as long as reflecting the short term rental tax to fund that and then as you want a line the next to the hierarchy would go to the the repayment of bonds Department Supportive Housing to paying for staff overseeing EDI and consulting services and then if there's money in excess of what I think would be 11.6 million anything above that would go to additional grant funding. We know that last year. I think there are some there's 25 something Grant applications refunded maybe 20% of them of small fraction. There's a lot of really good projects out there and if we had the money, I've no doubt that we would be able to More amazing stuff more than 11 million dollars and four terminals. It's a little bit up in the air because we have the track that yet, but at least we have a path for that. Any other questions on this amendment? So Kent swimmer Ryan would like to move your mother for of the amendment say I I there's not a pose. There's no abstentions. So now we can move for passage of 119402 as amended any other comments. I've seen none has been moved and seconded. No further comments. All those in favor. Say aye aye in a post knows no sentience. So the motion carries as Amendment as amended and councilmember O'Brien. I understand that you are not going to be at this next Monday's meeting. So with your you're okay and our Council colleagues concurrence, I'm going to suggest we put this over until you return on July 22nd at which point you can then speak to it is. I just want the full support of this until we presented to the speechifying will occur. It just will not occur today, but I want to thank Brian for this show. So these are critical Investments and I think the council is approaching its Look forward to his return. Thank you. I'm and I also I'm sorry that Marrone I'm not pronouncing her name correctly, but I'm sorry she left because she and white king and others were in my office yesterday and I just found their stories just very impressive and I just want her to know and thank all of you who have come and talked about this how important it. Is that the end of my speech of fine now, okay, so we can move on to the last item of business and do Allison. Would you like to read that in interpreting a fun for the swing beverage tax revenue a van adding a new Section 5. 53055 to Seattle Municipal Code. Very good. Okay. So this one I do have an amendment that Yolanda would you like to speak to the underlying legislation and the amendment and then we'll dive in sure. So again, I will give a background on this week and beverage tax in. How we got here and I speak to the legislation and potential amendments. So the sweetened beverage tax is a tax on the distribution of sugar-sweetened Beverages and the revenue was intended primarily to expand programs that expand access to healthy affordable food close of food security Gap and promote healthy food choices as well as support evidence based Child Development programs, particularly to reduce disparities and outcomes for Children and Families based on socioeconomic factors in the 2019-2020 proposed budget surplus sweetened beverage tax funds were used to supplant mostly general fund supported programs and I've done up doing a little more digging into this the actual Total amount swap amount is 6.3 million. The 5.7 million we had previously discussed and the programs that were where this occurred were childcare vouchers. There was that was fully swapped and support for child care providers participating in the voucher program food banks parent-child home program of which 52% of the program with swapped for SVT for four other funding sources nurse Family Partnership Farm to Table and out of school nutrition X tier meal delivery senior congregate meals fresh box and food policy program had a smaller amount of the plantation. And so what we've heard in the discussions was that by doing these fun swaps in 2019 for programs that were consistent with the sweetened beverage tax policies, but we're not expansions or the creation of new programs. The budget office was able to direct this amount to Human Services Department for various homelessness services and other programs. So in the council Bill 11955 one would establish a fund to receive sweetened beverage tax revenues and track expenditures beginning January 1st, 2020 and would codify the spending policies that are described that are in Ordnance 1 2 5 3 2 4 and a man these policies to increase flexibility for the allocation of funds to one time or limited term expenditures and prohibit the use of as a sweetener average tax proceeds. Just plant general fund or other funding sources dedicating the proceeds to be used solely for expansion of existing or creation of new programs in accordance with the programs identified. So as that last point is at that they would permit prohibit the use of SPG in the place of general fund or other resources beginning on the effective date of the ordinance which could impact any supplemental budgets in 2019 and the endorsed a 2020 budget. So essentially any instances where programs are funded by other resources in SVT was used instead would be partially or in some cases completely cut as a result of his bill if other budget cuts are new Revenue sources are not identified to backfill. Sew onto until we actually have three amendments. We are the two that are in the Moana third one that council member or Gonzalez will be sharing and the first amendment is just Technical and clarifying Amendment. So removing the word net in reference to SVT as we never text precedes. It's not really a relevant uses the term here doesn't mean something but not in this particular instance and clarifying that sweet beverage tax revenue should be used to expand evidence-based Child Development programs. So adding that and allowing these wooden beverage tax proceeds to use to cover cost increases for new Endeavors tax-funded programs a little bit more on that. You said it doesn't it doesn't have an impact here, but generally the difference between net and gross does make a difference or It wasn't refer reference to grow. So all the proceeds and it was how it was kind of allocated. But I believe at the time of their drafting. Maybe they're there had been did. I'm not really sure but when I was speaking with the budget office and allow kind of where are they they evaluated the use of the term and noted that it didn't seem to make sense in this particular instance, but it would in a soup when was saying that of administrative costs or something like that, but we aren't actually saying that because we are allocating, you know, like certain percentages and then staying within those Administration will be allocated. Right? So we're not there's no net. It's just the proceeds. I understand with the Second Amendment is Oh, yes. Oh, yeah. So do you want me I'll go through the Second Amendment even just cuz I did not speak to that yet. But they Second Amendment sponsored by the chair badshah would amend the financial policies to line with the indoors 2020 budget requiring that any surplus unallocated. We never tax revenues beginning on the effective date of the ordinance be used only for expanding existing programs and creating new programs and to cover a program cost increases beginning in 2021. All sweet beverage tax revenues would be used for expanding existing or creating youth programs including program cost increases in accordance with statute and this would give the council and mayor more time together create new Revenue sources to back fill programs to make time to pray Revenue Services are two other cuts to backfill these programs where Ask me beverage tax was used to support supplant other funding sources a little bit more about in the legislation what section A and what section B is and what the expenditures are. Yes. So section A is in the in the spending policy in the financial policies Section 8 is about the limited term one-time expenditures so that and so that is so they're currently 10% of the proceeds of all the proceeds may be used for other one-time costs necessary to enable administrator section of the tax of those are done at this point. I'm up to 5 million for the 13th year promise scholarship program and up to 1.5 million in for a job retraining and play summer programs for workers who may be adversely impacted by the tax in that it will be identified during the program evaluation and also funding for capital projects Constructor enhance classroom facilities for East by the Seattle preschool program. So those will so that's it for the first five years of that the taxes collected and That's 5 years elapsed after 2022. All the proceeds will go then to the organs listed under the section B, which are the ongoing expenditures. So these are for the lifetime of the tax. And so these are these are the ones about expanding access to healthy and affordable food closing the food security Gap and promoting healthy choices food choices and the evidence-based programs that improve the social emotional educational physical and mental health of children. And so that those are the two McKennon. I'm sorry. There's a few more items under that administration of assessing and collecting the text and ensuring resources for the office of sustainability environment and the sweetened beverage tax Community Advisory board and the cost of program evaluation conducted by the auditor. Thank you. And I will move on to amendment 3, which I had some where do we have that I do I have copies as well. If I do have another think we'll just it does not appear. Here's my Nan's on to yeso. This isn't that this was just sent around right before the committee. So amendment 3 is also a what I would consider a clarifying Amendment this would specify that sweetened beverage tax per sheet. The proceeds should be used to expand birth to Age 3 and kindergarten Readiness services. So this is amending that section V that we were just speaking of ongoing on expenditures. And so it's just clarifying the targets of services that would be funded by the sweetened beverage tax, which I believe is in accordance with the community Advisory board and the intent of the sweetened beverage tax revenues councilmember Gonzalez's amendment is consistent with both of the proposed minutes back Shaw's and Brian's correct and I would say yeah, that was correct, correct. The underlying legislation is a telomere Brian's intent and so is I would take him to Myra bag Shaw's amendment is the one that would make the major changes, but I'm both councilmember Bryant's Amendment, which is a technical clarifying Amendment and customer Gonzalez's with not the main conflict. Capital bikeshare I'd like to possible to move forward with the numbers 1 and 3 first and then discuss your appreciate changes. I think her pretty straightforward. So get this out of the way. So you wanted to move your Amendment and 3rd and council member. Are you finished with the introductory? Did you want I want to take the chairs Thunder. I'd have to say about amendment 2, but I think overall I know that we're struggling with a lot of good causes here and I've I said at the last meeting and I just want to acknowledge right now for council member O'Brien. What I deeply respect is your commitment to this is a feeling that you have just as a matter of intrigue Tegra tea that you believe that you were putting forward something that was you strongly supported and that you feel that your word is on the line and I respect that very much and I just want to acknowledge that To suddenly argue your measurement. Let me make sure I understand what the debate is about an ulcer repair fries how I'm looking at this but I might be a little wet on the issue. So you wanted to keep me on a shirt. For me, at least I have very little desire to deviate from the Investments that were the basis for the sweetened beverage tax. And I think I smell brine for the captures at Spirit. And so we looked at the communities that we're trying to improve from a health standpoint would look at the regressive nature of this taxing, and we wanted to swear to be a purist in that sense. Make sure the money goes back in the communities and that's where my values lie. But if I'm understanding what the Practical effect of his amendment that made cause in Craigmont, I'm wrong, Brian that by supporting it. We are we may be requiring the executive to back off this year in 2019 back off investments in some of our housing a homeless housing investments or some other and I thought I had seen from you a a description of the Investments that this may create a withdrawal from that were pretty critical Investments customer bagshaw's Amendment. That she's not interested at all in pulling back from her investments in healthy food programs and the Great War that got green dozen the other organizations. She just said she wants to stay the course this year and the next year. What what happens next year? So none of this would change 2019. So we're actually talking about his 2020 and 2021. That's I want to make sure it's okay that was not clear to me. My first what you spoke to is actually my underlying legislation My First Amendment, which I'd like to get out of the way just because I don't think it's controversial Soul expanding in front of evidence-based programs is the net effect of Amendment 1 of 1 and so I would love to move. And then and then a council member Gonzalez a chance to move her. So I'll go ahead and move them in the number one. I thought your big ones. Amendment number one, which is forward deleting word net and expanding evidence and including Associated program cost. Answer the questions. I'm supporting it but I think I heard you say that there's not a huge dollar amount but it actually increases because you take out the administrative piece. It actually will increase the dollars that goes to the neighborhood orders at the the application that the organization's is that true in regards to this amendment. We were talking has no meeting and it's not no meeting in the specific instance. Sometimes sometimes gross means a lot in this case you're saying okay any other discussion cancel Amber Pacheco welcome 1 and as we have been going through this is considered a technical Amendment which I support then we're going to move. Amendment 3 which council member Gonzalez put forward again. We consider that a technical meant then we'll get to item to Oh the sweet peppers. Like that's what that's what I was trying to say. Sorry. We did it we've done maybe I've passed unanimously so we know we're on to the beverage tax any further discussion about okay, so it's been moved all those in favor. Say aye no abstentions. Okay. So the technical amendment number one else. Would you like to speak to council member? I mean to your account would like to speak to my son asked me is simply an amendment that clarifies a City council's original intent as it relates to programs that would improve the social emotional educational physical and mental health of children in relation to Early Learning in particular. So the city has a strong history of investing in the zero to three space and obviously at the ratio preschool promise we have strong and Events in preschool that cater specifically to three year olds and 4 year olds. And this is an opportunity for us to make sure that we affirm that we are not going to put in a programs related to the nurse Childhood Program for example and child care assistance and parent-child home program is on The Chopping Block in the event that that is something in administration isn't going to do so, this is just a further clarification and that really these Investments that are not to be used for any category of children related to anything but they specifically focused on early learning for zero to three ages and with programs that have a focus on making sure that our youngest winners are ready for that God. Would you like to move here or MMA? So move this moment II any further discussions? Okay, all those in favor say aye no abstentions. Okay. Now let's get to amendment number 2. You've introduced that Big Show. Green. I have all the respect in the world for you and what you've been doing on to the cab Jim Krieger. Thank you. I Lindsey as you said on the microphone, it's been a promising start and want to thank you all for that. So let me tell you what my amendment is about. My Amendment would say let's finish off our biennial budget before we make changes in this moment. Now the reasoning behind that is that the monies that were put in during our last year's budget for both 2019 and 2020 were four programs that all of us love and support there is no question about that. Yes. It was supplanted money. Here's what it went into parent-child home program child care assistance program nurse Family Partnership in the Human Services Department in you remember council member O'Brien how passionately That council member was argued for more money into food banks for out of school nutrition time money as senior meal delivery and Senior congregate meals. There is no doubt that these are things that all of his support just as we support what the sugary beverage tax Investments are going into as designed my recommendation and my Amendment what it would do is to say keep all of this keep the money that's going into the parent-child home program for child care assistance the nurse Family Partnership the food banks out of school nutrition and Senior meal delivery as well as the fresh bucks program of 2 million and 2.7 million into that fresh bucks program. I want to keep all that for 2020 if we Move forward and change this $6000000. There is no guarantee of backfill money for it. I think that is irresponsible and not not only responsible to these programs that we should back out from them. But also it just does not strike me as being as responsible stewards of the public funds as we could and should be now that said under my Amendment we would move forward in 2021 and invest all of the money into the what the sugary beverage tax is designed to do you under the original ordinance. We also under my Amendment if there is additional revenues and we will know what those additional revenues are in September all those monies would go forward to the recommendation that you have council member O'Brien and into the original intended investment. So all the fresh fresh bucks and all the things that we've identified we may have more money to do that this year. I'm just very concerned about Midway through our budget cycle are biennial budget cycle changing what we argued so strenuously for Last At Last October and November. So that's the essence of my I'm happy to answer other questions Allison we did do on a pass that around we did just right before this committee get this from the budget office people have said we don't know where the money went and what investments that the general fund went to hear here is what it went to One X cost for Hygiene. I can pass this one out and I'll just I can just use Allison's here when I pass it down. Thank you so much as hygiene cost at our encampments. We had some assistance in building more of the tiny homes at 18th and yesler money's for Assistance with basic shelter to support the annual increase in rent for the Queen Anne shelter. The money is also went to Bailey boushay house to assist at the city hall shelter smt shelter. Angeline's provided some additional Services a YMCA late night motel vouchers. Peace on the street for kids on the street some additional support for their facility additional money for the navigation Center. And this was some converting Office Space to sleeping space for people. We open Haddon Hall that is again enhance shelter increased case management at LinkedIn Springs with Chris Behavioral Health Services assisted Lehigh with some on-site staff again at LinkedIn Springs. We increase some case. Management at the Interbay facility management at the Northlake facility. We increase Behavioral Health Services at Whittier, we added some nursing care, which is something so critical and it'll be one of my top priorities for the budget coming up additional nursing Services as well for residents at Whittier, all of these things. I don't think there's a single one of us at this table that would disagree. It's all critically important. So the question is are we going to disrupt some of this now halfway through 2019 and a 2020 budget and it's my recommendation that we move forward with my Amendment which preserves the funding that we have put into this budget and all good things that we are supporting so love to hear for the for the comments. I just have a clarification question before we get into the actual debate. This is that okay, okay. The grades so I'm a little confused because I'm seeing this chart of things that are alleged to have been funded by general fund dollars that apparently can be straight track back to Sugar beverage tax, but I thought the reason we were doing this is because you couldn't track those dollars back to specific uses. I am left with the conclusion that the executive Cherry Picked these examples to sort of pull on the heartstrings and create a untenable situation and dynamic of you know, if you stayed true to the intent of the ordinance and move forward then you know, you hate homeless people and I feel like that's really unfair narrative to try to build at this point, and I just don't have a lot of confidence in how Suddenly we can track these dollars with this level of confidence and accuracy. I just I just don't understand how such how we got there and in a week or two weeks suddenly or we can track every single sent back to these precise Investments went before we can do that. That's 1/2 is so I'd like to get a sense from Council Central staff evaluation what the level of confidence is in terms of the tracking that is being now asserted as being sort of one hundred percent these every single one of these dollars we can try to sugary beverage tax as opposed to other Dental Fun dollars that come in from other sources of variety of other sources. That's one question to is listed off a bunch of other things that you said would be Cut this year or next year including fresh box in the parent-child home program and the nurse program and in I think you made a claim that those are all because they're all inconsistent with the intent of the ordinance of a sugary beverage tax. And I thought those were the things that we're supposed to be funding with a sugary beverage tax. So I'm I am unclear as to what the serve list that you gave initially around sort of, you know that parade of horribles. It would happen. If we pass this ordinance of the other things that would beat that would suffer as a result of the passage of this bill. So I'll answer your second question first this came from the June 24th staff memo that Yolanda prepared and we went through quite extensively at the June 24th meeting here is the adopted 2019 budget used sugary beverage tax revenues to support General funds in the following program. Total SBG funding noted in parentheses. So if you'll take a look at page 2 and 3 of Yolanda's good memo. You will see that she identified from Department of Education from Human Services in the office of sustainability. I thought I heard you characterize it as these will no longer be funded if this Bill gets money and those have not been identified what is appointed. Maybe I don't understand what that means. The the issue is that these programs were all either General son supported or will mostly General unsupported and sew as in the certain it's over these specific programs all experienced at least a certain percentage. If not a complete swap of that general fund for a sweetened beverage tax. So it was just a one-for-one swap not an expansion. It was a sub Plantation so-so in the example of food banks, the 1.795 million. That was just that that was just a swap of sweetened beverage tax bring up 1.595 million for General fun to be since anyway. Are in the budget so back to your first question. There is no way of tracking because we don't have a dedicated fund so we can't see where a transaction has occurred necessarily so there is there is no but while this is a list of things that were funded by general fund won the War 1 billion dollars worth of others. Yes. Yes. Oh and once it's generally it's kind of anywhere. So it would be hard to say that the 6.3 million that was freed up by doing the swaps where where those went. They could have gone here to any of these programs or to any other program funded by the general fund programs. They do human services department Department of neighborhoods. correct legislature City budget office mayor's office or or other kinds of dedicated sources at the Ronnie and so back to the discussion about so some of the so the effects of this legislation should it pass without shells amendment is that those that's a plantation that occurred would no longer be allowed for in the 2020 budget, which is been indoors, but you know, so we so for instance at 1.795 million of that was used to supplant for food banks would need to be filled by something else not and then has been dance we never task be then used to Augment or supplement. So it's you add onto so that was the intention. I believe of the original sweetened beverage tax revenues was to supplement not supplant. It's necessarily so that's that's where there will be funding cuts. And if other cuts are not identified or other new Revenue sources, so these some of these programs will be yes. I did to a greater or lesser degree depending on how much the plantation are Kurds. So then for the programs that were listed in your original memo for the last hearing the impact is is that that that whatever was Supplanted we need to come up with the difference of that. So right so dealing with his bill now would provide the mayor in her process of developing a proposed budget extent that she still holds. These programs is priorities in opportunity to take the next several months between now and September to identify other resources to be able to continue to keep those programs whole and if she doesn't do that then Council can do that through our own budget process by the right now to find any Revenue Source or by identifying cuts to those things that were proposed by the mayor in order to prioritize those programs. That's correct. So I'm going to do my best to be clear perhaps even concise but maybe not on a couple points. I want to make first I want to talk to the issue is so Plantation because this is an issue that comes up frankly whenever we're trying to raise new revenue is not unique to the sweetened beverage tax. For instance. When we passed the move Seattle Levy, there was concern that when we went out and raised close to a hundred million dollars a year in new Transportation dollars, they would simply use that to supplant the base 40 million dollars a year. We were spending AM General fine and transportation and then spend somewhere else and the folks advocating for it said look we are in favor of supporting this initiative that would raise an additional nearly a hundred million dollars a year. So we want that to be additional and so is part of that initiative will be committed to was that we would maintain at a minimum the existing General fund commitment to ask. And so I don't have that. That's about 40 million dollars a year. I think we agreed that it would go up adjusted to inflation or something each year. And so every year in the budget we do that so that were clear that those monies that we raised in this case from property tax would go to be additional investments in transportation not supplanted to free up things for the things. I think that we should be doing the same here. In fact, I think this is more critical to be doing here. I want to talk a little bit to the the issue of so where does this come from relatives or 20/20 budget? Cuz how you made a really good point that there are a lot of priorities in the budget and how do we figure out what those priorities are and what might be cut if we if we going to rededicate this this Revenue source to the things that it was originally intended to go to and there's a question that I don't so much that I don't believe that we can actually answer that today. I actually believe what this legislation does is it tells the Nair don't do this again and then come back to us with a budget in September and you will demonstrate to us what your lowest priority is an existing budget now want to be clear to that the budget has hundreds of moving parts. We adopted an endorsed budget last year for 2020 that is soon to certain Revenue stream from sales tax form utility tax from Dino. Those are all undoubtedly wrong as those change know we don't know. Okay, we got an extra 3.2 million in sales tax where that money go. It went into the big bucket and it gets that text came in a little light what cut is like we don't know it all just goes into the big bucket and the mayor looks at all the revenue that's available to her at the time and send us a budget based on what she prioritize when I look at this list. I don't believe will certainly for me. Please are not probably the lowest priorities in our general fund budget so I would not believe if you should be cut. I also don't believe that the mayor thinks of these are the last things that were in the budget in the first things to be cut. I believe that these will continue to be funded because I think they are higher priority. And so what I am asking to do today is to not make a decision whether these will get cut or another set of things you have to do is to think about my colleagues see about what the committee was to community members when we asked them to tax themselves, especially communities of color at a disproportionately high rate. And as we heard today Tanika spoke very eloquently about that. Well this tax may fall on you significantly, we're going to invest back in your neighborhood significantly and because of that we were able to get people coming out from those communities thing. I know I will bear the burden of the tax, but I'm okay with it because of what you're saying to do. And I don't think anyone wanted to undo that but under the all the pressures that came up in the budget. This is what was made and I was part of the council did approve this budget last year, but I don't want to be in a position to do that again this year, but I'm asking us to do is to take this off the table to re-establish that commitment to set up a dedicated fund. So if money does come out of it, we will know exactly where those dollars went because it will have a dedicated fund that we could track. Hopefully the money that comes out of that will only go to the things that are prescribed in this ordinance the American proposed that she did we do something else and then have them Thursday of all the other billion-plus dollars in general fund money. Now without the sweet beverage tax cuz I set aside now tell us what your priorities are meeting send us a budget with that and I suspect that most if not, all of these items will still be in that budget and if they're not then we have our budget process where we can choose to reallocate it. And if we decide as a council the majority decides that wow everything in Budget is such a huge priority ahead of some of the things like closing the food security Gap and we want to change your mind that we make hope we make him today and go back on that we could do that. I hope we don't I don't think I will be in a position but we have the authority to do that if we chose choose but I don't believe we want to take the money from this community and use it on other good things. And so I appreciate the question that you asking. This is a fair one. If we take this way where it would go and I believe the answer is we don't know until the mayor Center budget. But what I think we should do a Target I call if we should do is say do not take the tax revenue. We're getting from a population is being disproportionately taxis are low-income communities and communities a color that these are people that are making bad decisions is a people that are in a position where they're marketed to have Levi's soda companies where they live where they can afford to live with often are food deserts that don't have access to Great alternative and we want to fix that we heard today that there is no shortage of good programs to be investing that much. Into I heard there within a week there were three thousand people that on a waiting list to get access to food programs. And I imagine if we open that for another week we might get another three thousand people and we're only finding 700 people and that's just one of the programs that's out there. So we have plenty of really robust great programs. We can spend this money on to live up to the to the wishes and commitment to me that community and then we'll have to struggle with the rest and I agreed that will not be easy. We will be argue about that. Then there'd doesn't want to be put in the box right now, but I would think we should put that in that she still has a billion plus a general fund money to solve things. And then let's see how it comes back. So my request would be just to say no to confirm Big Shots amendment number 2 and let's see what the mayor does in whatever it is two and a half months. We will see that budget and then we will dive into it and figure out what we do and I hope we will when we talked about this week and beverage tax revenue will be talking about it exclusively. Terms of how to allocate that money back to that list of priorities that we've already committed and I really appreciate and also I really appreciate just how strongly you feel about this now. My my direction is really not inconsistent with where we want to get. I'm just asking for the time to allow us when he gets into budget to really think about this comprehensively. I believe there's going to be some additional revenues maybe not a lot but some more this year we'll find out in September that we can put into this directly. My concern is the things that we had agreed to last year and I'm again I'm looking at a million dollars for the parent-child home program child care assistance program fees also help. Deeply distressed communities and say well let's just let's just say we're going to have to find additional monies were going to ask the mayor for additional money. I would rather keep it the other way. I want to fund these things because we put money into the budget to fund it and then when additional revenues come in to say all of these really good things that the sugary Bennett sugary beverage tax is designed to do let's put more money in it. Then we've got money for 2019 that's not going to change. We will I believe have some more money in September that we can dedicate to this then come 20/20 Lisa. Our successors will be able to say will have the budget in 2019, but our successors will be able to say look we really want to flood the community with these good other benefits that we had designed to do. So I'm asking my colleagues to hold the course allow us to do what you're trying to do effective 2021, but we can definitely add more in this budget coming up count. President to you, so I find O'Brien's position very compelling if we supported his Amendment. It does it still thought you said earlier when I should have given my description of the tissue that it doesn't affect any funding this year. But as a practical effect that this year there will be a shortfall on some of the some of this weather. Is this a cherry picker not I don't know but this list is an example on the adopted 2019 budget. So supplemental any supplemental budget if there is some Plantation proposed by the sweetened beverage tax proceeds for any other general fund. We we haven't seen it in the most recent. I don't know if I should have received but that that it would impact that but not anything nothing. So if we were to support council member O'Brien's Amendment they were setting legislation and we're not there might not be sure to fall this year, but we are setting pretty much a policy statement at a template on values that I think I'm hearing you. Say you agree with why then would you oppose it? Why would you amend I'm not opposing the underlying what the money should go for I'm suggesting we not change course now that 20/20 we have an endorsed budget and I want to keep that endorse budget intact and not have to go back into general fund money to read to redo what we did last year the general fund money has gone into in my mind at some tremendous things around increasing housing and supporting services that we needed that six million dollars that because we decided to use the money this way there were six million dollars that went into housing and assistance for people who are homeless. We don't have at this moment a dedicated Revenue source to backfill that so, But I'm not sharing they need to redo anything is what I mean if my Amendment does not pass because then these things that we adopted last year that were supplanted. We will have to find general fund money for that and the general fund money will have to come from other priorities and it's what council member Gonzalez said the station between concentration of speaking about the endorsed 2020 budget not the adopted 2019 budget and so we endorsed the budget in 2020, but we are going to do a whole 2020 budget process again this year or you're likely to be right that there will probably be some additional revenues as we get towards budget some of that is just because the economy continues to grow and we tend to be conservative in our estimates. Hope to see some additional bomb since I'm certain things. There's also talk about other, you know, rumors or something of other new tax revenues that they may come forward certainly some properties that may be sold. I'm almost certain the mayor will not send us a budget that says and here's the 20 million dollars that extra money. We were out. Why don't you go figure it out? It will all be allocated when we get it and if she does not allocated as we want to we will be forced to do what we did last year and say I really want to fund what we said we're going to find but now I have to cut other things that the mayor just made a public promise to people with and I don't want it that way that's too hard for us to do too often in a 6 week. I don't want us to be in that position. So I believe the mayor will have additional revenues and she can use that to the back feel these things that were on back filling she can use it to expand other programs. You can lose it to a mix of both an allocated you guys decide what you want to do with it. And if you want to do, you know honor the King has given you can do that. If you wanted something else can do it will almost certainly at least in my ten years experience have to undo something else at 5. The new Revenue Source reminder and that is not a position IND, which is why I want to do this today. I think I've had the exactly the same feelings you do is I don't want to have to undo things that we've already done. If we have additional revenues. Then I am all in favor of putting it in there all in favor of moving forward as you're describing. I'm just suggesting we don't unravel this now but move forward with your what your plan is in 2021 issue 20 budget is always kind of been like a fake budget it sort of You know, we just I mean every year were like, yeah, I kind of sort of real not really like it's just there for planning purposes, but it's not actually committed dollars. They have not yet been allocated. They certainly have not been spent and so every year and I and I think this is a shared frustration amongst most of us who've been through several budget Cycles. There's sort of an inherent frustration with how we do budget because it's not really an endorsed budget. We generally look at every budget year as though it's a new Fresh budget year and make decisions as though it's a new Fresh budget year with whatever Revenue we have so I don't I mean I think I don't think that it's fair to say that were unraveling something for 20/20 when we all knew that in 2018. We were simply voting on a 2020 budget for purposes of planning. That is old. He's been contingent on having the revenue to support the things that we indicated would be a policy priority for the city council. So, you know, I think we have an opportunity to have these conversations during the budget session and I think it's better for us to address this big policy decision in advance of receiving the budget and certainly an advance of getting into the thick of budget where we will be then put in the position of both making these difficult policy determinations run a dedicated resources and also making the tough calls as described by counseling program. My Hisense from this committee is well intentions on all parts and we're really trying to solve problems. I think we see them slightly differently, but I don't have any doubt that we're trying to accomplish the same thing to use the money as broadly and wisely as possible. So if there are no other comments on this council member of Jekyll So this isn't my first time going to do the budget of the council member the doors Budget on the swimming organizations in the community that make assumptions based on what we have in the endorse as a city and sayin so then they use that planning document to then say, okay, these decisions are how we as an organization should plan for the future for the next year. I think it's a planning tool but there's no commitment. Like I said, they don't have funding for organizations. So there's no commitments in our 2020 budget or any of our budgets that say we have two million dollars for this. This particular organization gets 100% of those phones that's just been a discouraged physical practice and policy of the what do you know of examples as a budget chair of where organizations then utilize are endorsed budget to then begin to plan for themselves moving forward. There's many examples. I think we would look at Human Services Department as specifically but we don't say in a Plymouth Housing. We're promising you X number of dollars, but we have a pretty good idea of having some programs law enforcement assisted diversion as an example that they know and they hope that the money is that they have or something that they can count on and then hope that we will increase that in years to come so I'm in that is a an example that we can say also with them. I'm thinking of Youth Care as an example. We work closely with youthcare with the state to get money for them. We got money for the Chief Seattle Club. Those are no specific things, but they're not guaranteed until you know, the budget assigned funding clearly signals that you should not be relying on anything other than this one time and then there's ongoing programmatic Investments. And I think what we're trying to accomplish here through this underlying bill is a follow through on a commitment we made to both sets of Investments but in a very particular area and space and I think there's a concern amongst us and community members that we have not been fully fulfilling those commitments that we made in both the one-time funding and in the long-term funding, but I would say that I think it's fair from us. policy General budgeting Sans organizations who rely on public funds to continue to do their work are pretty Nimble and understand that they can rely on Sunday and that is actually appropriated in that year and that everything sort of on the table again the following year which is why I advocate show up during our public hearings throughout the entire process to advocate for no cuts and additions because there is a clear understanding expectation that everything is back on the table every single year, which is why the 2019-2020 Endorse budget process is a misnomer. It's not a true biennial budget council president before we go further with what may be your proposed amendment catching Bagshaw and thanks for discussing with me and I should probably share a few thoughts as this conversation has occurred couldn't agree more with customer Gonzalez's point that the endorsed budget is sort of pliable in nature weed. Look at how we are investing was working with not we look at our revenues expenses excetera. I find customer O'Brien's very compelling and I'm still a little hung up on it would seem to me that this is a pretty strong policy statement that we all agree on in that that's where his Legislation is intended the points that are he's intending intending to drive and I'm still although I might have described to you in a court of what you're trying to do. Not quote-unquote unravel something. I find that argument weakening a little bit in this conversation because the number one is if I'm understanding the basic legislation, we're not unraveling and Investments this year and we're short of setting an investment policy statement. If you will directives if you will for next year one of which I support So for that if I'm understanding this correctly, I would not be supporting perhaps the the amendment and would be supporting the best legislation because we're not unraveling anything and it is an endorsed budget. So but I can be convinced the other way if you'd like before you Compelled to say first of all again saying thanks. And secondly, this is not to an anyway undo what the sweetened beverage tax is designed to do. I do have concerns about 20 20 of commitments that we have made and I'm thinking again, I don't want to keep saying nurse Family Partnership in the child care assistance program, but those are however they are designated in terms of how much money we had set for them. Now if we if we open is all up again during the budget context. Yes, we can put more money in here. But again, we're going back and looking at the general fund money and where it went and it did that. At least I've been I've been told that the offset here is around shelter and Human Services. Show some physical discipline here in in got Investments. But if this works this legislation works, it does force that the mayor can approve a budget all they could do was proposed it sew-in in the way. I'm looking at it. It really just creates more work, but good work for us in about 3 months from the mayor at all through this. I see it putting more pressure on us when she simply proposes a budget. So that's what I'm looking at this as you know, be careful what you ask for kind of legislation here because we are going to have to be the one to make the tough decisions. If in fact the representations are that it's not going to change anything significantly this year, correct? You got me on a boat to see you back here in the fall again. Hopefully, we'll have a better starting spot. So I am going to call for a vote unless council member Pacheco. You've got something that you would like to add but I appreciate the passion that yeah, but it's it's important for me to kind of think about it and holistic way of how we got here. And you know, I certainly was very much frustrated that lattes and diet sodas were not included when this initially was proposed because we've now not only made a commitment to communities we then use the money to supplement for other General General. Purposes why I was trying to bring my point about the endorsed budget and how they brings to regards to conversations in the future. I think it it's it behooves us the kind of think of it holistically as well because you know, I've been asked and I'll say this is what I'm planning to be doing next year and one of the things that I hope people spend some of my time and see if we can work with a state legislator to provide an exemption for us to revisit this soda tax so that we can then include diet sodas and locked it cuz I think it was a bit of an injustice now having said that as well as I can't ignore my fiduciary responsibility as a council member and not be mindful of the holistic responsibility that we have to make only thing go through our budget organizations who are relying on or on our budget as a city also have to make those decisions. So I'm happy to revisit this in and try to put more money into the soda tax so that we make communities whole but I think it's best for us to do that when we have the proposed budget in hand and make those tough decisions holistically when we can make them all at the same time. Thank you. All right. Well, I'm going to move my amendment number to do. I have a second and you can present it would fail if you said no, but now we've got an amended bill in front of us with number one passing amendment number three passing any further conversation about this. Would you like to have this delayed until the July 22nd? Again? Thank you for reminding us for my colleagues. This is because council member O'Brien will not be here on Monday with us and I want to honor the fact that you've been bringing this forward and we'll have a full vote on June 22nd. All those in favor of this bill as amended say I buy no post no abstentions. Thank you for the excellent discussion. We will be back with the budget all of your points. I think we're excellent. Well made thank you for that. Nothing else on the agenda. Okay, so the meeting's adjourned. Thank you.", "end_time": 5501.5}]}