{"format": "raw", "annotations": [], "confidence": 0.9452251295248667, "data": [{"start_time": 0, "text": "either run Good morning. Thank you for being here. I'm joining by council member Teresa Mexican and our staff. We have three appointments would like to have on our agenda today and I will just move right into the public comment section. We have one speaker silent Master Alex tsimerman and Asher Alexandria you have for you. Do you care if my daughter if you're not you got to beat your ass from Animal Farm my name Alexandra mean I want speak about something with his appointed a director office of hearing examiner. Okay talking about which is for the last ten year like a hundred times. For example, and I spoke with him right now. He's sitting here nice man. Office of Department don't have every man's meeting. So people cannot come in the livery opinion about a hundred times and I did mention it just very simple common business common sense of buying for to see people so every Department was today have one month's meeting what is freak include director and people in commissioner V. Commissioner, so people can come and delivery opinion this government but as we have here acting like a water cycle or not to Social Democratic Mafia, did you forget stuff for many year did the apartment and I'm in Council commissioner meeting all around many Department. Never have one month. Meeting so people can come and talkin Q&A is best but when you don't have to Renee, maybe you can speak something in delivery opinion, but it's going to be totally different department or you don't have sense. I don't understand. Why is this 9 consoles for citycab don't understand this very simple and good business principles when people come in delivery opinion. It's going to be totally different and I have this experience for all my life my head work little bit different. So sometimes I bring something what is never happened to you. So I demand right now clean this dirty Chamber from this cuckoo don't understand what this mean American Business and moved her first agenda item. Please read it in the record is Samuels and Bushmaster coming forward and joins to the table, please 01277 reappointment of Ryan P vancil as hearing examiner Office of the hearing examiner for a term to March 28th 2023. Good morning. So you've been to the table before and I want to thank you for what sort of opening up your office to our enquiries in our evaluation and we've gotten feedback from council members and you respond to all of our questions and so just had a few clarifying questions on some of your written responses in all think if everything goes as planned you will receive it should have an expectation letter after this this hearing assuming there's an affirmative vote and we will present the full Council. So I'm going to turn to this document that is basically a series of questions and you gave some early level 2 answers. I just want to go to bed understand your thinking so on one. You talked about to have an integration with the Seattle Fire Department citation system, and I'm not familiar. So what is the end goal there is that you in your office has access to on a real-time basis all of the citations. And so you're able to see them and coordinate schedules. And do you is it or is this one of the areas that frequently comes to the hearing examiner for appeals? I am not familiar with this will be an entirely new item as we have with SDC i&s. They issue citations either for violations in the right-of-way or maybe a land-use violation through sdci. The Seattle Fire Department apparently has not had a citation processing place since the 1960s and most jurisdictions in the US and in the in the state have that capacity through their fire department. And so the fire department looking at implementing a new citation process. Similar to those other citations if there's a problem with the citation on the part of the individual who's been cited. They have an opportunity to appeal before the hearing examiner Sophos. My understanding is that the Seattle Fire Department will be on a sort of a reach out or stakeholders process for next 3 to 4 months. They're anticipating having Council have legislation on this in July and then maybe implementation and sometime in October or November. Actually, they had they were very anxious to get it in place. They when they first came to us, they said January of 2019. So I know that they may feel for example with false alarms and some other items that essentially the system is is somewhat being abused in the citation would be an offer opportunity to make it a bit more enforcement on their part. IC show there if they're their there must be some kind of appeal process in place as we speak it. Well the citations don't exist yet so that they can't they can't issue citations. So course you can't there's nothing to appeal. But once they issue citation starting in the fall, then the appeal process would be the exactly the same as we have for DCI and ask. Where if somebody gets a citation they it's just like it's like a traffic ticket I think of it is small claims court every Thursday. We have are citations calendar will hear two or three cases individual check on the back where they they're here for a contested hearing or mitigation hearing or that they're just going to pay the fee and then they come in and make their case in an hour or less actually wait, we would probably help of her Council to know it'll certainly affect our caseload right now come by and we see is. In DCI giving us about 750 citations in a year and Seattle Fire Department of land at least 400 and there they were trying to be soft on us so it'll and Load to our our caseload. I see you talk a lot about mediation in the opportunity to increase mediation through some of the some of the matters that coming for the hearing examiner. Are you talk about getting the drinks from the bar associations are the land use an alternative dispute resolution on the bar involved. What is that look like are those volunteer attorneys set with linen Chelsea's appeals and maybe get stuck with what your thoughts are. Absolutely So currently I'm a member of the Washington State Bar's environmental and land use law alternative dispute resolution committee. We farmed it specifically to identify areas where in land use and environment Allah, but I buy my focus is land used where mediation can be enhanced has an opportunity. It's the types of parties that we see in these types of disputes are are unique compared to say family law or business where you have a neighborhood group or you have The developer and or the city there's unique interest in the in those different parties and why and how they might come to mediation and how they can reach resolution lot of the times these individuals are participating in developments or projects where they're going to be neighbors or working with each other for years even decades such long-term interest. There's things that I can't address of it for them in front of a in front of hearing. I'm I'm thumbs up thumbs down in the law, but they may be able to cater it agreement between each other so long as it agrees with the code that the one tree that they all care about gets saved or something along those lines, but the law might not protect for them. I see it as an opportunity to and the end of this is similar to what we see in our courts now, it's an opportunity for individuals to come to a resolution to reach that kind of fine tune resolution that they would like to see plus it takes them out of the system to reduce our caseloads. There's a Judicial efficiency that's achieved so it's ready as a win-win for everyone. Everybody still gets the hearing date if the mediation doesn't work they get to show Not looking at anything mandatory by the group for the bar association is made up of land use professionals from all walks of life of individuals that I see in front of me is both playing as representatives in developer representatives and an expert mediators from around the ground state. You seem interested in the possibility of conducting hearings are some matters through video-conferencing or Skype or FaceTime or something along those lines. Have you actually tried that yet, or is that something you're interested in getting your office and doing in the future? We've done it a couple times we've had it was really set up its is not return if it's likely citation cases. I was talking about you have an individual who they have a right to appeal maybe even a just want to mitigate and say here's Max Mears my situation. I had my sandwich store on the sidewalk. I didn't have a permit but I'll never do it again. I've got it now and there's one explained that they have to come downtown find parking pay almost as much as the ticket just to get there and take a day off from work if we can increase and improve the ability to people could to come in particular as we're looking at the decreasing the capacity for individuals even make it into downtown. I think we would provide a better service. We've done it a couple times 1 and a citation hearing weird. Visual had reduced mobility and capacity and it worked. Well, we also had three this was a bit more than we were looking for a case where the city I had three witnesses that were in California that they simply wouldn't have a case of those Witnesses couldn't come in by Sky was more formal. We'd see them in a single setting a law office. I can believe it was and it was managed on that and very well and if it went okay, but I'd suggest is because I'm interested in trying to assist jobs doing that is you know, you were in search of a small five-member officers gnome from a lot of what city does but I'd like to look at as we enter to the into the budget year what getting you the right our it group or any of our experts in the within the city look at how we can increase that. Can I just think that that's you make a great point that for so many folks involved in the process for And some of the more routine matters just to be able to do it through video-conferencing many judicial forms are moving of that for many matters. And so it may be hard for you to show to make it up on the fly. So maybe there could be a scope of work week. We can look at to see how we can improve that absolutely warrants looking at more word doing this Dance Now of working with technology. That's not quite where we wanted to be. I imagine the day will come when somebody can flip open their phone and I can participate in the hearing. We're just not there yet with the connectivity and making sure you can introduce exhibits and and be reliable as witness, but as you mentioned courts do it often as because I have a fixed point I'd be another courtroom or jail at the other end, but I think there's a lot of opportunity there that I would certainly welcome council's attention to okay. We asked me strata solar system information from your office on the use of land use your CPAP heels where perhaps are the motives such as delaying the process might be a concern of ours and you talked a little bit about balancing that then while that may be the case. You also have to err on the side of giving everyone for their day in court Swiss Peak. Can you talk a little bit about now that you're really doing it for a while and you also talked about changing some of the rules of practice within your office. Can you talk about our concern about a abusive the process a little bit and how you can Perhaps expedite matters when when when there's an opportunity to provide frankly because it's not clear direct and providing response. I think my listener wants to hear but the fact is that our judicial system and I are sharing room Issaquah traditional system does err on the side of allowing appellants to come into the system itself? I think the best way I address it in addition to what I've said in the in writing on which essentially says that the hearing examiner has rules that can and allow for dismissal of meritless. Lawsuits parties can bring them I can initiate that on my own other parties can buy motion moved to dismiss cases. I think what's help might help Council understand the system and how it works now is to give some examples of cases and how I've applied that and it's actually it's as a facilitator for the for the hearing process has its is my job to to move cases through Merit or not as fast. I can and I'll also give you some examples in the case one one case for example, that was was mentioned. I think was a peel of a C5 determination for forethought and individual who made the appeal the face of the peel itself was written. Well better than a lot of some attorneys and some of the face of it. I can't say this has no merit even if everybody else in the community thinks that and in fact that case that that appellant before had had success through their hearing the indoor court process. So it's a difficult the outside simply say this doesn't doesn't doesn't work. If as that case for grasses and they don't meet deadlines as happened in that case are they didn't submit an exhibit in witness list, which is somewhat extraordinary. I don't see very often. That's when I can say look, you're not following the rules you're not for do you just you just messing up the system now, there are a lot of leeway in some of these things and what we had generally Find a lot of these cases is no matter how hard I am pushing to get things going every party wants it slow down a little bit for their own interests. Mha is a good example of that when I went into the hearing pre-hearing First Premier Inn conference out of three that we had fourth at nine the pallet Representatives the city representatives and I was going to push them as hard as I could to get it going and I told him in November. Okay, we're going to be hearing in February in every two weeks. Nobody could really gainsay me at that moment that that wasn't going to work but they all wanted more time what eventually unfolded really was the city attorney's asking for another 3 months simply to comply with that records requests from the appellants and and then the appellants genuinely showing that they needed to through the number of witnesses and the city the number Witnesses. They were going to bring we needed a 3 to 4 weeks. To do the hearing only then was I willing to extend that for them and then took me that schedule but I'm pushing for every opportunity I can to tighten things up for Gilman Trail case is another good example where we didn't know how. That would be managed. And so we tried to restrict it up front. We dedicated a specific amount of time to the parties for the hearing. They convinced me even to use a chess clock which I probably will not do it again because I spend all my time doing this with the clock and watching every minute is supposed to really hearing the testimony but dividing time giving equal time. It ended up being a very effective and efficient hearing that we were able to get done in a week for a matter that I think could clearly is of great import to the individuals involved in the city. So if the tension that I constantly have to simply be aware of as part of my do my job and my duties as Deputy hearing examiner will let me ask a direct question your predecessor suit Anna she would write at the end of the year very good annual report looking at all of the cases those that were repealed should have the disposition of the cases and you had an option and look at the prior years reports that she produced at. All. In fact, I was involved in one and then Sears report that has been sent out to council is essentially modeled on the same report bucket to to make sure you had that I found those very effective because more times than that the council somewhat removed from a lot of it the cases except for the controversial ones and I just thought one of the best pieces of work. She had produced were those annual reports. If you really gave us a good description of what are the activities throughout the course of your strength and courage you. That's helpful to hear and I do hope as is process go forward with him confirming that I do get a chance to meet with you to the council members to discuss this this annual report music just gives me an opportunity. I don't get in a committee to hear from each individual council member. I'd like to look at the report and make sure that really is giving information that that's needed. It looks a little heavy on some of the data to me sometimes but if that's working for the council members than I do that it is and the cities such as Kirkland At Mercer Island in Tukwila some of that contract cities that we work with you. You mentioned that you sure. Monitoring dad to make sure it's their caseload increases. We have to monitor whether we have the resources to serve some of those cities do we build those cities for our time and it should have a contractual relationship. And so how do you monitor whether that is effective and I do have our auditor or anyone else was just sort of your common sense evaluation essentially entirely the discretion of the hearing examiner that the rates we've charged have been in the industry low and I would do well for it and there's a there's a mileage coverage to cut to the chase though on that. I've been careful about not making any move with it. It's it's the status quo is that we serve contract cities. I'm here for a year. I'd go away. Somebody needs the opportunity to really examine that if I am retired, I think that it's time for us to move beyond that aspect of of our service. I want to be able to focus on some of these administrative tasks taking on the Seattle Fire Department and the historic High caseload that we have in Seattle and I I simply haven't been able to say that to her contract cities and they don't hear from the council needs to know that if you don't buy him as part of the hiring, I think it's time that that that's probably really lived its usefulness has said we can always come back to it during low years. You can always send out in contract but the diversity of cases and seeing how it goes as you're useful and you get more hearing examiner skills, but I think we get all that through through Seattle pretty well right now. Yeah, it really does cut down on our our our case of Bill it be able to be responsive to the city of Seattle in my opinion at this point any questions like last time we met but just the disparity. Of the appellants that come to your office and you talk a little bit about creating a citizen guide form for challenging decision so that I guess there could be more diversity and who comes forward is that correct? The citizen guide has existed in place. It could be cleaned up. I think there's I think there are internal things that we could do cleaning at the citizen guide maybe even posting a video on our website. How do you use our processes? We are perceived. This is a tension that goes back to the other question asked about how do you move things along? There's actually a phrase in the citizen guide right. Now that says describe this as user-friendly, which I think is disingenuous. I we are quite additional you can represent yourself as a tour group. Is it as a non-attorney you can the rules of evidence for a bit loose so it to an attorney at might be user-friendly compared to a quart I think to an individual out the street as anything. User-friendly, I don't know how much we can go in that direction frankly to be continued being efficient and holding up our job quasi-judicial duties. So conversely though, the individuals could be trained and could be informed as to what those processes are. Even being made aware that there they are and so they can participate in this is give me attention of how we go about doing it in my mind presenting things on our website making sure that we have a line to get you to a translator making sure that we have a citizen guide maybe even a video is simply not enough to reach certain populations and I don't have a plan in place for this yet because I think it's going to take a lot of networking in a couple of years to put in place. But essentially we need to get out of the office and go in those communities with that were not reaching and have direct communication interface with them to find out what works for them. What doesn't maybe the Skype connection is a way for us to start letting people come to the hearing more effective. I don't want to be speaking to that with pre formulated answers before I've heard from those communities what they need most and that that's really what I'm starting now. So to start embarking on I'm at that networking to hear from those with those individuals take out rewrite and so my suggestion was to make sure that you're getting Community input directly from the folks who are having a hard time accessing your office. It sounds like that's part of your plan and would love to have you keep us updated on that has to move forward. Thank you. I think it's going to be a couple faces right now. I could with my institutional experience and knowledge of how the office works and do some cleanup on the guide. We're proposing to do some rules revisions to but that's not going process. Once I get feedback from the community is the guy that place to put that in in a minute. That's the message we get then we revise it again to be responsive to that. One other small suggestion is I'm over the years. We've tried to get rid of the word citizen because it's obviously all residents and is more of a community guide so that might be something to take into consideration as you think about who is accessing this if I have a few more seconds to ask a question around in land used in CPAP heels be used and malicious ways are ways to try to delay the process that weren't actually trying to get at the heart of whether or not there was a violation for Stables really delay tactic and you mentioned in the middle of your answer to number for Council must be extremely cautious about circumventing the current system on the basis of one or a few bad case kind of cereal Helens coming forward on issues related to Fort Lawton. Tiny Villages tent villages. Bike Lanes having the same individual come forward appeal after appeal the super of review process which would not ordinarily be applied to certain circumstances kind of stretching to make it apply. And then you also couple that with the demands on the city for public records request and this ongoing kind of cycle that war and I'm trying to respond and be responsive to a very system that was intended to make sure that that Community Voices being hurt when you see that level of Engagement. Is there any sort of mitigation strategies that we can put into place ahead of time so that either an individual or an organization has a better understanding of the type of cases you will and will not take given the past history on someone coming for it like that. This is a difficult dance. We see individuals come in for public comment. We see individuals file for public records request and come in and utilize our appeal system that if we close them out we end up closing out in other individuals who have a right to that transparency and openness to process. certainly, I can say in the course of acting as hearing examiner. If I have the same individuals ask this could be true for specific attorneys that sometimes appear in front of me if they miss represent the law if they acting bad face if they don't. Percent facts that are true. That's something that I'm entitled to remember and in the end certainly the same thing could be sad about certain of talents that said I before I was hearing examiner represent a lot of plenty of some of them were by their local jurisdictions considered gadflies. Sometimes they were right one out at 9:10. And that right is what gets them coming back and en Ceiba. He was a challenging law for all of us. It really is a full disclosure law that really gets us into the analysis of the environmental impacts and I I can only encourage enough that's one of the things is to keep in mind your your project can get a peel. So make sure you do the analysis right? I mean I've seen cases come in front of me. Where is I think I'm a chase a good example of that. Decisions out on and I made my decision on it, you know not to include the city's Storehouse of historic properties is not a good idea when you know people are going to be gunning for you. So that's one of the first places it can be dealt with City attorneys filing emotions quickly and on time is good. And then of course I can take my own steps within the bounds of the rules to make sure that it isn't being abused if it's as you can say it is a bit of a waffling answer is not a direct response. There isn't something where we can say once we identify individuals that can't participate. We just simply don't have a system that allows for that. It was an internal looking analysis as well. If you see situations in which maybe in hindsight appellant was give leeway to bring their face forward and then in hindsight, it was really a potentially not the best use of either in the existing law or the Appellate Court appeals process, perhaps some universe. Turn down for what? I'm thinking of another Bike Share example where a seba was using that case which would have ordinarily been exempt from Ceiba. I think trying to make sure that we're avoiding slippery slopes and the start of broadening up a tent in terms of how simple was intended to be used in originally. We keep saying that use pushed further and further away. I think from its original intent. So I thank you for your answer because I think it was both internal looking as well as external that you see me mention in. My response is what do we do when I can see something happen do I deal with it then and there or do I actually let it run? Its course so that if it goes up on a peel that's where it's going to end knowing that it's going to go off on a peel. That's something we always have to be mindful of his if I Rush some things for you because then and there it's the appropriate thing to do. They might simply by doing that. I may have created an appeal issue. So I do tend to approach it with People going to go to run a chance to run their course and sometimes that's enough to create a record that that's as far as they're going to get is is my hearing room appreciation for your answer in identifying that there's a need to diversify the office for very small office though relatively, right Google assistant and administrative assistant role coming up appreciate your commitment to increasing both diversity and inclusion in your office and would be no strongly encourage you to think about ways in which the community can help identify folks so that we're not just tracking folks of color into administrative assistant position and we're thinking about how we lift up folks into higher-skilled higher higher pay Physicians as you go forward, but obviously entry points are important. I do think that there is a plethora of highly-qualified attorneys and individuals of color and Varsity who would benefit from having such an experience in your office. So I hope so and I really looking forward as an opportunity not just for diversifying our office. But exactly what you you highlighted council member with creating is in a stepping-stone an opportunity. We've seen two young women come through our Legal Assistant role. When was Taiwan use the current one is got Caucasian descent. They were there for two years and they went on to graduate school and we've we've spent a lot of time mentoring each one of those of individuals through the processes the public process and then what we offer and I think I've seen them grow through that. I think we can see that same with our administrative role and Israeli. We've seen it. I I fi can cite to pack holes are Executive Administrative Assistant executive assistant. Now she stepped up a new supervisor role and I would love to see that coming soon be our office that were permeable that it's it's not a one-time place. Thank you for the question. Okay, so I am going to move this and I will move for the appointment of Ryan vancil as hearing examiner appointment 01277 all those in favor. Say aye aye so I will present this to the full Council Monday next Monday, and I anticipate things go well, and I'll certainly argue your case and you're welcome to of course be there and will likely suspend the rules on an affirmative vote. If you want to address the council you. I really appreciate that. Okay. Thank you. Appointment 01287 and 01288 appointment of Tanya C woo and reappointment of Sergio Max legon-talamoni as members of the international special review District board for a term to December 31, 2021 and November 30th 2019 correct phone service that reductions and Rebecca free stand and I work for the Department of neighborhoods historic preservation program. I coordinate the international special review district and the Columbia City landmarks and I'm here with tiny lose one of our recommended appointees. Would you like me to start by just giving a note done this before for you? But still a brief overview. So the international special review District board is one of eight historic districts or the or the international special review district is one of a tattoo start to text in the sea. The board is responsible for reviewing any changes to exterior alterations of buildings are sites within the boundaries of the district as well. As any changes of use for businesses are properties that exist within the district as well set with the seven-member board 5 of the members are elected by the community and an annual election appointed by the mayor and then confirm my counsel. So one of our appointees ceragioli Chantelle money is one of the mayoral appointees and this is a recommendation for his second term. And then the seat that Tony is being considered for is one of the elected seeds that became vacant and in accordance with the rules and procedures for the district. Those vacancies are fulfilled by Meryl appointment. I meant so kind of wood or or the appointee would serve through the end of that elected term which will run through November of this year and then it would become an elected seat again. How does that work? I know that and thanks for serving during the intro. Show the board itself than Alexa or is elected. What does that mean in in the annual election for the other five members there is within the land use code a criteria for for who those candidates are fulfilling to do business owner property owner who elects the members of the community who are registered voters through that process. I thought that it was actually the board members gotten to me the input and then they elected a choice actually the vacancies in the case of a vacancy the the board will consider anyone who is not elected in a prior annual election. And then anyone else who has been recommended or considered within the community and the board will have the opportunity to weigh in will also put out a public notice for Interested parties at the process. I was joking and Miss. Will you allowed no doubt Run for the position at the end of the temporary turmeric. Have you made up your mind yet? So I know your family in your hotel and your your what you do, but maybe for the viewing public you describe a little bit about your family and why you're involved in this particular bored and yourself, I should take my great-grandfather helped start lock my music association. My dad was one of the founding members the Chinese chamber conference, I grew up in this neighborhood in my father's Bakery. So I've been a long time to remember and I was proud of Chinese girls real team sideline dancing and did a lot of things in this community. Is it love it? On my father bought a building and 1960s Louisa hotel that caught on fire Christmas Eve 2013. And so these last five years we've been very busy trying to navigate building code and renovate the building and try to rebuild an open up the public and we're very excited that the Louise Hotel will be open may but May 16th. We are hoping to bring in different businesses local businesses on the ground floor and open up 84 units in the upper floors. And I am so tired of following that that's exciting and talk a little bit about the history of the of the the district. Then I shan't an International District and short of your I guess your interest or passion for preserving that what you think is important maybe y y mean a lot of people I have just a few years on your Salat of people your age would not even care about the history. I would assume and they just want to let you know put skyscrapers everywhere. So let's talk a little bit about what soda drives your Nature Preserve cultural history. RR buildings, they tell a story about our past about all the people who came before us and made us who we are and I believe in honoring that passed and being able to carry that on to our future generations. And so just just walking through Chinatown walk through these buildings. There's just so much history. We have a history of jazz clubs a history of immigrants of even the Chinese Exclusion Act all the history. We need to remember and I believe that these buildings do tell that story and they're all that's left of this history and being able to educate speech generations and preserving that for people to learn and to respect and honor. I think it's very important and especially, you know with this construction and with these old buildings are our will need to be renovated and willing to put up to code and I think that's one of the biggest challenges facing China Town is preserving the history and being able to reserve it for the future. And so A lot of these issues with displacement is your vacation and construction and navigating building code will be evident to all these building owners are owned by families. And so it's fairly important and I'm very passionate about saving these buildings and preserving our history and being able to have this story around for future generations. And I know your husky to so you could do that a presumption of doing good works for that and I know Sergio reappointment so I'm also been really just I'm so council members now, he's also been very active on the Architectural Review Committee. So helping to oversee some of the new construction and the high-rise buildings that are coming in and in selling some of the spaces that are available within the district. So he's been really actively involved in that process. Yes, please. I'm just looking online for pictures of Eliza Hotel. It looks like it's all to be posted soon when you guys open up at least according to Google Map. So looking forward to seeing that I do I live near Beach things that I'm very interested in is how do we both do preservation and enhancements given the crisis of affordable housing the need for there to be small women and minority-owned business spaces that are usually more likely to be constructed in some of our older buildings and some of the newer buildings which kind of have the size for the next CVS or the next, you know, Ram bar or something like that. What we want is smaller spaces to be created and also I think preserve but as we do preservation part of what my interested in is in how do we lay our existing be? Things with the opportunity to create new affordable-housing on top. Have you thought much about ways in which we could protect or prevent the demolition of existing buildings and then maybe couple that with additional Building height or air space that could include affordable housing. Is it something that you've worked on in the past? I think that's when the amazing things by The Authority is thought I had 30 does protect all their old buildings from those issues that you mentioned and an example that we've had to work with your Authority and I really believe in all other values and is when we lost part of the building because of the fire, but because of our Authority rules we had to construct it as it was and no one makes a real break anymore. And so we had to find five different types of brick and mix them up into finding the perfect not the perfect but as close a match as we can to the Old Brick. Time to Levis already sets the tone of the standards for for solving all those issues for the future and it's something that I really want to be part of one thing to be aware of is that the board in its jurisdiction doesn't have authority over affordability level. So that is something that's come up quite a bit actually within the design review meeting is that we've had in public, and community members who would like to see the Board address those issues, but the code doesn't give them the authority to do that. So I think it's a bigger policy issue that are the historic preservation program would be involved in that discussion, but not something that the board specifically right now has been grappling with could you bring us some ideas for how to address that I will definitely talk with the Sarasota historic preservation officer for the city and and raised that issue is it Cultural spaces but preserving old buildings that allow for the creation of successful businesses and thinking of gay who owns optimism up on Capitol Hill in one of the things that she's done as she's renovated this beautiful old building that had to have the windows preserved in it, and she wanted to do that but preserving that was quite the challenge. I'm defying the the window replacements for these tiny little panels and like you mentioned trying to find the bricks for the replacement of the one that was destroyed in the hotel is a challenge to how are we how we helping to make sure that business owners can both meet the requirements of the preservation goals, but also then being may be more flexible in terms of our assistance to help them get there. And then as we think about the density needs in the city having your input about how we can then use airspace above places or even maybe set back so that you don't see it from the street view, but there's clearly housing upgraded above. It is something I'd be very interested in and you know you Is there going to be on the ground level quite literally? So let us know when things come up that you're saying why I wish I had the tools to take such and such on and maybe we can get together then think about what's not in your purview and how we can continue to expand that. Okay, so out further Ado I will recommend the appointment of Tanya Wu and Sergio Max legon-talamoni appointments 10287 and 10288 to be there Monday at 2, but you're always welcome to be there as well. But but it's not necessary and I'll be your strong as half good as what comes from the skater. Okay. Okay. I will move to a point 01287 and 01288. 2nd ODI with that whilst Angier. Thank you.", "end_time": 2592.8}]}