{"format": "raw", "annotations": [], "confidence": 0.9558423465870797, "data": [{"start_time": 0, "text": "Oh my God. Good morning. Thank you for being here for a regular scheduled Council briefing. We are here with customers who want councilmember Bagshaw Council and Pacheco in Casanova Gonzales in myself if there's no Objection the minutes of the May 20th 2019 meeting will be approved. If any of you want hard copies you have soft copies. I have them here. Just let me know and I'll always try to pass them down. Turn objects in the minutes are approved and just as a reminder, we do have an mha meeting after this for the movie catch memory cazalis could share a little bit more. She's so inclined but that will start at 10:30 this afternoon this afternoon and far as a vote. Nothing from the Governance Equity good governance committee. But from the select committee on Civic Arena Suite do have resolutions 31888 which is a resolution that immense a previous resolutions 31857 that provides conceptual approval of a I was called a significant structure turn from it to the Seattle Arena company LLC which includes the construction worker called permanent tension tie backs and portions of Thomas Street East of 1st Avenue north and west of 2nd 2nd Avenue North we first met as a permanent tension tie back isn't it passed out of the select committee in will resent that this afternoon and so kudos to the status of the project that we had the construction update on Carrie in and all the great things happening over there. And so that's going as is as well as could be expected. So we're looking forward to that piece of legislation. And then from the governess equity and Technology Way Nashua misspoke earlier that we do have one actually will resolution 3-1. Sex which is a resolution the revised a certain general rules and procedures of the Seattle City council on Milling attachment the one of the resolution 31806 and as you may recall we should have addressed issues of Kabob in our court are canceled decorum hear words of a threatening nature and of a salt like Words those kinds of behaviors that but we certainly don't condone which is a far different than free. Speech. And that's it from this side and we'll just go around the table come to my restaurant equipment and renters rights committee. The meeting the next meeting of the committee was scheduled for this Friday, but we are putting it off to give the human services department more time to prepare their presentation on the Seattle Youth Employment Program, and I'll be announcing the date of the next time buddy soon. Have them sit on a mirror. Nothing today for the financial neighborhood committee. We will have some items next Monday because we had a meeting a special meeting on last Friday. So there wasn't enough time to bring forward what we had passed out of committee. So that'll be a week from today. We do have a Bobby Humes. Who is the proposed sdhr director nominee. He's going to be coming to my committee on June 12th and 26th. If you got questions for our new potential Director of Human Services. Human Resources resources, thank you. Please get your questions to Allison today. We've got a start and we can circulate that and you can add some additional questions if you'd like. I'm tomorrow. I'm going to be meeting with a group and if any of you are interested as well, we're going to be riding our bikes around the south end of Queen Anne Uptown looking at Thomas Street and the connection to the Seattle Arena. So if you're interested, we're meeting at 8 a.m. Tomorrow morning on bike. So let me know if you would like to participate. I also have a proclamation here. That was brought forward by council member herbold. It's a proclamation by the mayor and the city council declaring June as Orca awareness month. This is actually in support of something Governor Inslee did also I'm looking at the state of Washington Proclamation and the major objectives here to focus on what is causing the decline of the Southern resident orcas both in numbers and in health and ended Kluddes the fact that the endangered salmon runs we're finding that would just not getting as many Chinook here in our area as in the past their principal source of food. There's also significant noise and disturbance from ships and small boats and vehicles vessels that are chasing the orcas which of course impacts and Effexor ability to echolocate and then lastly would to be aware of the toxic pollutants which are going into the sound that really caused the young orcas problem. So I'll be circulating that thank you for signing it and let me know if there's anything you want to tell council member herbold before she introduces at this afternoon. Good morning there. No pleasure later appointment on the full Council Jennings a council meeting. I will be presenting a proclamation declaring may as bike everywhere month in the city of Seattle. Just like I think my staff of her to put this together before the holiday weekend on Friday and the Cascade bike club for helping us drop language. I might have sent this out onto the Council on Friday and I hope you all will sign on the next plus committee meeting is on Wednesday, June 5th. And on Thursday, I will be attending the annual Puget Sound Regional Council General Assembly as one is Seattle's Representatives. So I wish everybody could we thank you. That's why we're as she think you could morning. Sorry for being late. So two things actually three big things but first the next Civic development public acid in Native communities committee is June 5th. I'm dedicating his agenda to one item briefing and presentation on missing murdered indigenous women Girls by Abigail. Alcoholic Abigail is works at the Seattle Indian Health Board, and she was commissioned or well over a year ago to ride the 30 page report to the urban Indian Health Institute, and we serve at a briefing on that of the Board of Health Abigail. Alcoholic is Pawnee. She's a chief research officer as a shared at the Seattle Indian Health Board and director of the urban Indian Health Institute. Not only did she offer this report Seattle and the state of Washington was the first aid and see to come out and have this comprehensive report about the data crisis. Not only regionally, but nationally the report sheds light on the following fax Decades of an epidemic of violence perpetuated against native women House Seattle has the highest number of missing and murdered indigenous women. Over 70 cities identified in this report Seattle has 45 missing murdered indigenous women and girls and the state of Washington rank second in missing murdered indigenous women and girls the report also dresses the gaping holes in our government and it comes to data collection law enforcement and Reporting if you remember this Council passed legislation and in the budget, I'm with a customer badshah who join me in this to address that the city departments require that they basically intensify their efforts and our require now to provide the city including law enforcement with data regarding Native American women. And again, this would be addressing the data crisis regionally. And nationally. I'm honored to share this meeting because Abigail be able to identify where the city lacks and accountability and how we can step up as we move forward to solve this major Health crisis. Abigail's advocacy has gone as far as DC as well as King County. On the Washington state legislature. If you remember this last session, we had improvements in Olympia representative Deborah Lake off and lost Burger sponsored legislation in response to this report H-E-B 1713 a bill that we worked on this Council supported establish is 2L on positions within the Washington State Patrol to build relationships between government and Native communities requires a Washington State Patrol to develop a best practice is protocol for law enforcement in response to missing persons and reports for indigenous women and requires the governor's office of Indian Affairs to provide Washington State Patrol with government-to-government training in this is crucial. This bill was signed by the governor on April 24th, while this life isn't perfect. It's a great step forward to the foundation to build upon which I'm hoping we can do this session at least until the end of this year. I invite my colleagues and others who are interested for this presentation again will be June 5th at 2 in council chambers and my staff will also and be providing you not only with a copy of the bill that way Past but also a copy of the report the report came out last year. It's about 30 pages long. It's incredibly well, it is is critical but it's also I opening and it's also very sad because not only your dressing missing murdered indigenous women were also in addressing the LGBT community the two spirit community and there's just a really interesting intersection of of the discussion about how long for cement is tracking missing emerges in missing murdered indigenous women and girls how the media reports it and how the community and Collective memory has responded and those three Visions if you will don't always add up so we suspect that there are much more missing murdered indigenous women not only in Seattle in the state of Washington, but nationally and again, it's called a dad a crisis and I was very blessed and lucky to be in Washington DC in February to meet with our Congressional Delegation and talk about the money that has been set aside to address this issue. But also the fall of the violence against women act which was really crucial and so I will continue to work on this and I would invite you all to attend and I will give you all the report. Thank you. Good morning, mister president there are no items from the housing Health Energy and workers rights committee on today's full Council agenda. This next week on June 6th at 9:30 a.m. We will have a regular meeting of the housing Health Energy and workers rights committee are five items. First the Seattle City Light review panel appointment. The appointments of The Joint Apprenticeship and training committee the notice of intent to sell legislation briefing and discussion possible vote on the Fort Lawton rezone and Redevelopment plan and possible vote on extending the rent during prohibition by another year. I want to say we had a really good meeting on the Fort Lawton a Redevelopment plan last week Tuesday afternoon. Thanks. Also to council member Pacheco staff for being there and helping us. That ain't we had about 35 people sign up overwhelmingly positive and support there was a few people who ask for some amendments that I had. Are we are already drafted up and heard about turning. A portion of the parking lot into a green space for Blue Heron. I want to thank the folks who came out to testify Those Who come out, this is the 15th year that we've been engaged in that process, and this is now 4th meeting we've had so next week will be the fifth meeting. Thanks the council members to want and customer over Ian who were part of that discussion as well last Tuesday, really? Appreciate you being there because of all of the items on our agenda and then at 1:30 that day next Thursday, June 6th. We will have a work session or a lunch and learn to host a special committee meeting on the Human Services providers cost of living issues around the inflationary Acosta to operate in the city and to live in the city folks remember and thanks again to come to her back. For Her Works include this in the budget last year my biggest issue last year that we were working on was trying to get a inflationary adjustment in for all human services contracted providers recognizing that many of them hadn't had an increase in about 10 years. This will be an opportunity for us to hear more broadly on this topic that many of you have been working on including counselor O'Brien's office to make sure that Human Services providers have a meaningful compensation and that we respect the fact that they have a direct relationship with the residence and provide vital and wide-ranging services and support to all residents. Especially our most vulnerable want to recognize that last year. We heard from Human Service Providers who are working a hundred hours a week. We're living in their cars who are qualifying for the same programs and services that their clients for qualifying for if we want us to have any sort of stability in the system to help serve those who are homeless are on the verge of becoming homeless. We have to make sure that are humans. Providers are also I'm stable and that organizations that they work with our stable still. Look forward to having all of you come if you can see on Thursday. This Friday we have office hours in District 5 and I looking forward to seeing all the folks out there. I think at a coffee shop double check where we're at. We're going to be at. Cafe in coffee klatch coffee klatch at 12:30 on Friday. And then this weekend's going to be busy to be participating in the Seattle emergency communications exercise on Saturday morning speaking at the Sea Mar Cesar Chavez, social justice festival at the new Sea Mar Chicano and Latino Museum in South Park and afterwards attending the town hall Gala hosted by Town Hall Seattle and their new people's Hall. I'm sure many of you who commented on this already and Others May our thoughts are with the families who this weekend or shot at doing something that all of us should be able to do which is enjoy time in a park with our families and I think it just continues to underscore on deep need to move forward on many of the gun violence prevention programs and to restrict the amount of guns that are out there. So the intersection between our continued effort to try to address gun violence and the ways in which people want to access and utilize our Park sitting right between the two cocheras on this issue. I think it's truly a public health issue and want to underscore the importance of us technology in that end not just sending thoughts and prayers but I think A Renewed call for our action is what you'll hear from. This council is a whole thoughts are with them. But so our actions and we will be working on it. I'm sure going forward if communities new Americans education committee. And in terms of at least on the regular introduction referral calendar we do I will have Two resolutions for the full Council consideration that I circulated amount of circulated last week before the requisite deadline. So I'm going to hand out copies of those and speak to them really briefly. So that folks are where they're coming. The first one is a resolution in support of a woman's right to bodily autonomy and the right to access the safe and legal abortion and affirming the city of Seattle commitment to act consistently and practically in support of those rights as of this is a follow-up to a lot of the recent legislation that we have seen coming out of other states across the country that endeavor to directly challenge the Roe versus Wade Supreme Court case that established Clarity around a woman's constitutional right to Access healthcare including us safe and legal abortion many of us who are at the table this morning joined Women's Healthcare groups last Tuesday. Insider to speak out against these laws that effectively ban abortions and this is a resolution to continue to affirm our commitment to that we do participate as a partner in the Seattle King County Public Health System. One of the things that we have fun dark on tracks related to women's reproductive health and really need to I think send a clear message to folks across the country and across a region that here in Seattle. We remain committed to ensuring that there is full and unfettered access to to reproductive health care, including safe and legal abortions for the women who live in and receive Healthcare from our Seattle King County Public Health. So is resolution Endeavors to solidify commitments and I'm excited about presenting that at 2. We are expecting that folks from the community will join us at at full Council this afternoon. The second resolution is a resolution That we are advancing in conjunction with mayor durkan and congresswoman pramila. Jayapal many of you may have been following the news last week that really laid out the fact that they gave us a good news that the first step was taken in passing the dream and promise act. This is a piece of legislation that was introduced in Congress that will create a legal pathway for dreamers as well as individuals who are currently eligible for temporary protected status and deferred enforced departure. And again, as I mentioned we're doing this in partnership with the mayor's office in Congressman pramila. Jayapal, I'll speak more to the resolution of the contact content of the legislation that was passed by the house in the federal level, but we here in the city of Seattle, of course continue to have a very strong set of policies around being a welcoming City and in that includes first and foremost ensuring that we Providing Sanctuary to are immigrants and refugees regardless of their immigration status in and this is a body of federal legislation that if adopted in the Senate would finally provide a pathway for millions of Youth Inner City to finally become their full American Salvage in the legal sense a really excited about advancing this resolution is well, and hope to have your all's support this afternoon in that regard for a speaking on a woman's right to choose. I know I think all three of us spoke, but I'm just saying it was wonderful. Thank you and It kind of got a little bit passionate because as an older woman who's had a couple children and two daughters that are 28 + 25. + this issue has been going on. See I'll be 60 in July. So this issue has been going on my whole life. So I think a lot of it was just more anger and frustration and calling out these states in us getting tired of and goes to the issue that we have to continue to fight for the basic right of a woman to choose and I'm hoping that my daughter's won't be doing this at 59. So thank you very much. Absolutely. And really a lot of the credit and Thanks goes to all of that activists and organizers in the community who've been really harnessing this opportunity to continue to build momentum to ensure that we are going backwards in terms of our our right to Access healthcare. I'm so really excited about being able to to sponsor that resolution. In support with with those community members. Okay next. I wanted to just quickly touching the fact that later this morning starting at 10:30 assuming that we looks like we're probably going to end this early. So we'll be back here at 10:30 A M I will be chairing a special meeting in public hearing for the select committee on mha after those of you who may have missed council president on memo. I can remember Pacheco and I will be co-chairs of the select committee on mha and I have the pleasure of tearing the the next committee which is again today at 10:30 a.m. We will have two items of business. The first item is only a briefing there will be no action on it. It will be an update on mha implementation in parts of the U District. We will be joined by opcd staff and Ally penuche from Council Central staff for that breathing and I'll be an opportunity for us to get an update on some of the policy issues. We deferred on making decisions on until there was additional. Yes work completed update about that work and anticipate a timeline for the rest of the year to is a technical clean up that will amend Ordinance 12579 one commonly referred to as a Citywide. Mha legislation it will correct map errors in math a for SMC 23.58 B .05. Oh and then Mapei for 23.5 8.050 and attachment 1 to the Ordinance 12579 one that these are truly technical clean up opportunities at the overarching issue here is that we want to make sure that the attachments the maps and the language in the coder consistent with policy decisions that we as a full-count. Initially past the Citywide. Mha ordinance of this is not an opportunity to relate a gate those policy decisions. This is merely an opportunity to ensure that this council's policy decisions that were made several months ago are consistently and accurately reflected in Ordinance one to 5791. So we will go through the process of considering those technical amendments none the less. We are required to have a public hearing because he's our land use issues and we will go through are legally required to mandated that process is to ensure that we have met those the standard so we will hear will have a public hearing we will get a briefing from Council Central staff on those technical changes and I will then suspend the rules and allow what the folks that full committee to vote on at those technical amendments and refer them accordingly to full counsel for actions. So that is all I have on that and then lastly I just wanted to say cancel present. If I may I also wanted to take an opportunity to reflect on the recent episode of gun violence that we just saw in South Seattle as as customer Mesquita mentioned this occurred yesterday. In fact at about 7 p.m. At Pritchard Island beach. Regrettably. This was a situation where it appears that two individuals began to argue in a parking lot and then exchanged gunfire people who were injured appeared to be innocent bystanders who just happened to be in the park enjoying their Memorial Day Celebrations. Unfortunately, it includes children a 27 year old woman and two boys were victims in this in this most recent episode of gun violence. One of the children was eight. Sold the other one is just under the age of 2 and there is out. There was also a young girl who was 10 years old who was also hit by gunfire so that we obviously take gun violence seriously without regard to who the victim is, but it becomes particularly concerning when it is children who are as young as to when our own City falling victim to the gun violence and so I know that we are all equally concerned about the impact here and have received assurances from the Seattle Police Department and the mayor's office that they continue to engage an emphasis patrols to try to engage in as much proactive policing as they can in these areas to deter this type of behavior from from occurring in the future, but ultimately obviously what we need is a much more common sense and Swift gun reform legislation that really takes a lot of these dangerous guns off of the streets and we have no reason to believe these These are semi-automatic rifles of any sort of I'm not exactly sure what kind of weapons were used. But it from the reporting it appears that they were just handguns. And so I think that it's another example an opportunity for us to really challenge the people who control these laws to really take some Swift action to ensure that Archimedes can stay safe and I just ice and a lot of thoughts and obviously you want to see action come out of of these types of incidents in My Hope Is that we'll be able to connect with some of our federal legislators for example to give them these these stories as as as a tool for them to hopefully be able to catalyze some change at the federal level. President's present state of volume Transportation committee has a number of items on this afternoon's agenda. We will be the first item is approval of an extension of a permit for a sky bridge over an alley in South Lake Union. Then we have six separate ordinances each accepting a series of deeds and easements. Each of those ordinances has 28 acceptance reason why it's so total of 120 of them. I'm just a reminder for the public often times has new development happens. There's small parcels and talking small often times just a couple square feet of a property the city will need to acquire an in response to a development project. Maybe it's to make sure the sidewalks the appropriate maybe it's makes it has access to certain utilities and transportation infrastructure instead of each one of the city code requires that goes come back to the council for approval but instead of doing those on a one-off basis we let them accumulate in 20 of them in the last few years at the pace of development. We're seeing our city wheel off and get them in bundles. And so we will be accepting on the six ordinance has a total of 120 different Parcels are easements cross Parcels. We also have a the final approval of Valley vacation for the block any triangle where the Amazon spheres are. This was something that we did conceptual approval on that block into other blocks at 5. For 5 years ago and now and one block is already come through final approval. This is the second and then the final project is going to be done sometime this summer and I imagine would see that last one by the end of this year. Maybe next year. We have a couple of appointments one to the scale Transit Advisory Board and 1/2 the sweetened beverage tax Advisory Board, and that is all four. Fox News agenda. The final thing I want to mention is that we have a special committee tomorrow afternoon at 2 p.m. This is a stable and transportation committee, but it's a single agenda item to discuss legislation around a backyard cottages and in-law units 80 using data use as a reminder. This is something that's been on hold for a couple years as we went through an appeal and then in the IRS and then another appeal hearing examiner ruled a couple weeks ago as I'm sure you all recall that are you asked was I had met all the requirements and we're ready to proceed. So the discussion tomorrow is going to be largely highlighting the the changes that are proposed in the draft legislation over what the current law is for backyard Cottages a couple of changes are expanding the square footage from 800 to 1000 square feet instead of allowing either a mother-in-law or backyard Cottage with allowed to accessory dwelling units. I'm only one of those could be a backyard Cottage on a single lat long a slightly increased Heights 1 to 2 feet extra height depending on the lot with for a backyard Cottage structure eliminating the parking requirement Illuminating the owner occupancy requirement and Ali will be at the table to walk through those changes. And then also highlighting a variety of options that we may want to consider in order to offer. You know, I love you different different ways. We may want to consider changes including not making some of those changes that I'm proposing in the last 10 years or eight years was piloted certain areas for the historical developments who they're pros and cons that we've seen since we have some some data to the show so we can access absolutely highlights of the number of units that have been built the pros and cons probably gets into a little more subjective. And and so I probably won't present too much on that. I certainly have a discussion about what we've heard. But certainly we can talk about the numbers and in a little bit of of how that taste is changing and also probably a little bit of reference to what's happening in places like Portland to Vancouver British Columbia where regulations are a little looser and I seeing a lot more of this happen we could also talk about that he is and what it's the modeling projects would be built in Seattle. And also what the modeling shows kind of with the viability Financial viability of certain models that are for these two, so. I'll follow up on that one cuz this is kind of Hot Topic we will also I'm in addition to the meeting tomorrow afternoon. We will be back in committee here and Chambers on the evening of June 11th for a public hearing on that. I imagine a lot of pretty good turnout for that and then back in committee on June 18th. And if the council is ready to be considering approving legislation out of committee, we would do that at that point. Just wanted to say to me two points. The first is is I wanted to confirm that council member Bryan you've been working on this issue since when pressing a little over three and a half years ago. That's quite some time and I really appreciate you sticking with it and guiding our conversation forward on this really important issue, which I see as an opportunity for us to prevent the displacement of some families that are looking for opportunities to age in place for example, and also open up or single-family a home zones to other people who may not historically or otherwise have access to living in this part of our city. So thank you for your commitment to that. Just take an opportunity to think the folks over the department of neighborhoods who been doing Round Table conversations around the proposed legislative changes had an opportunity to sit in and one of those round tables in West Seattle last week in the junction right across the street from where I live and had had a really great time listening to and hearing from interested neighbors around why they frankly believe in this policy and how it's important for the reasons that I just described previously. And so I hope that there will be an opportunity either during the special committee meeting or in the future daycare report back from the Department neighborhoods insurance with their Outreach and what they're hearing understanding is that That they've been hearing a lot of positive feedback from people who would be impacted or could benefit from this legislation. And and I think that we're going to be pleasantly surprised with with some of the feedback. They have been receiving from from our neighbors. So I'm excited to give him an opportunity to type a report on those more granular details on end and feedback that I was able to attend one with positive positive feedback for three and a half years and take the negative two flavors of a negative feedback obviously has some fairly local people who've been part of the challenges that have been opposed to it. And then the other feedback has been how come you can't do this quicker because I'm waiting for you to finish this so I can submit my permit. So my you know fill in the blank my my mother my sibling my children myself can move in One of these things that I really am waiting to build tell you change the regulations. So I'm anxiously awaiting our action on this and it'll be a good month. One event is occurring this Saturday at Fisher Pavilion at 6 is the dad's organization Divine alternative for dads services in this is a phenomenal group. The city has funded in recent years has been around for 20 years are out in District 2, but they are an organization that really Worx feverishly on a particular fathers who have had either either they've been in custody they've had legal challenges but they've had challenges reuniting with their children and they put together literally thousands and thousands of Father particularly and communities of color bakken's in healthy relationships with their children. And so so it starts at 6 and fish Rebellion, we actually have tickets for either staff or council members or anyone who would like to attend it'll be well-attended this Saturday at 6:00 every hundreds of people there but it's a phenomenal organization one. That's very near and dear to me. So 6 this Saturday and you all of you are invited to my notes so really quickly. We will also be considering a grant acceptance ordinance for us. This afternoon. This is a series of grants that is that is one from Federal government state produce and Regional Council and including one that the prospective Grant cuz there is there's a project East Marginal Way that is next on the list to be awarded a grant from Puget Sound Regional Council on a contingent basis of some other projects ahead of it. Don't go through and it's looking like there's a chance that we might get that money into an addition to accepting grants that we've already won. They'll be a conditional acceptance if we win that one too. And finally there's that there is an actual a clerk file around the street vacation proposed along the burke-gilman trail between the burke-gilman trail in University Village for a project they're looking to vacate streets that is a dead end Street and it said replace it with a really nice facility bike and pedestrian Cashman connect the burke-gilman trail all the way down to 24th with a new Crossing on 24th over to University Village including up a bike repair station and some water and a poet area along tuberculin there. Just a JC. I did see that you were just slow playing. Thank you for this day and we'll see you then at 10:30. I was temperature.", "end_time": 2281.5}]}