{"format": "raw", "annotations": [], "confidence": 0.9368453509494906, "data": [{"start_time": 0, "text": "Good afternoon. Everybody. Today is April Tuesday, April 16th 2019. It's 2 p.m. My name is Michael Brian. Welcome to the sustainability of Transportation committee. I am sure this committee and I'm joined by Jasmine Murray Staffing of today. Thanks for being here. We have a number of items on our agenda today or going to start with appointments to the Seattle pedestrian Advisory Board both appointments and reappointment. Then we will hear about land zoning around electric fuel reading tests and parking garages. We will take up appointments in reappointment to the urban forestry commission. We will have the urban forestry commission present their annual report. We will hear from the school traffic school Traffic Safety Committee and their annual report and finally will have the first conversation about a possible Ally vacation. Related to an affordable housing project at Willow Street near MLK. So we will start with public comment there for folks signed up Alexander when you're first followed by Amy Fowler than Megan Murphy and Rachel look like vehicle my dirty shooter Nazi Garbage Patch from animal My name Alexandra mean what is a surgeon. Number 10 School Traffic Safety. I drive car wreck School something happen. I pay my ticket my insurance go up. I was a thousand and thousand dollars can drive next School in CityWalk kill children and not some happen criminal cocaine Drive in City Walk in trachelas children in why we cannot fix this problem. It's make me absolutely sick and Dustin Cows as possible and you for mine. Just thinking going to grind you are a member of of what is his bicycle club. It's not legal. You can make a decision last year bike and CD work to call Care About Us children drive like a crazy. I see this everyday next my car driving and driving when I open door is a freaking idiot a psychopath. I'm coming cuz they make a low know by NCG walk-in exactly next school like when you stop and Vine theater. Thank you very much. Amy good afternoon, Cheryl Bryan. I'm here on behalf of the Puget Sound clean air agency. We are the air quality Agency for King Kitsap Pierce and Snohomish County's I manage our voluntary an incentive-based programs there at the agency in support of cb11 94-72 to be courage electric vehicle infrastructure and all new construction. Transportation is the leading cause of greenhouse gas emissions in our region. Excuse me. NRA board of directors has asked the agency to act more aggressively on climate pollution and to do so we have to address cars every gallon of gas burned is 20 pounds of CO2. So other than not driving driving less driving electric is our best option for those single-vehicle single-occupant vehicles that need to happen. unfortunately Although our region is a leader in electric vehicle adoption. Charging infrastructure has not kept pace. This ordinance will help us do a little catch-up. It will make EV charging stations more equitably available and that will help make electric vehicle more equitably available including low-income housing developments in this in this ordinance means that the infrastructure is there and so individuals can afford to buy a used vehicle and know that they'll have a place to charge it. That's why we encourage adoption of this ordinance. Thanks for letting me speak. I was wondering is in Sioux City, Iowa. I wanted there to be electric charging vehicle stations. Is there any worksheets I could send the city council there? And so they could review of literature about it or fellow council member they wanted to see what we're doing here. That would be good. I'm trying to get their interest the tunnel when you're trying to decide how deep I feel like they had the committee's meat and it should be more three-dimensional or something or knowing more about what materials are going to be used and how how much and where they're coming from those materials cuz then I feel like the timeline might move faster. So is really interesting. I'm glad everybody's working so closely together. So and then I I think that once have rent Control Ordinance passes at the state that I'm we should pass at Citywide for rent control. I thought cuz I know you're an advocate for 10 encampments and we're trying to get clean up because last night she said it should be like a hotel clean up for the enchantments will we could go and even step further and actually get get people inside of Housing and so I thought that was good and so just a lot to look forward to but I'm trying to think if I missed it. 10 encampments rent control. Okay. Yeah, I think I got everything. Thanks Rachel. Sorry, just the part where I can have Traffic Safety Committee representing today because the challenges they faced trying to figure out ways to get kids to school safely as a direct result of our transportation priorities being Miss line as example s. Has shifted away from creating regular sidewalks and sit are creating a low-cost ones as a portion of them Push by a car parking into the sidewalk, which is kind of questionable for a safe route to school on whether it's even worth the money. And in fact, it's not even clear that they're Crossing substantially less than a full sidewalk. And of course the reality is this isn't going to get us to Safe routes to school. The problem is we don't want to spend our time and our money and our time on products for cars. The Mercer mess is still a mess. It's two in five times as much. What was Ben on sidewalks or the entire Library Lander Street Bridge Project, which has a single side Sidewalk also will cost more than everything was Ben on sidewalks are volumes in car parking over everything including our children safely walking school. This is unacceptable that seems to call Travis if he can be found will cost nearly a billion dollars to build if we if we if we made our require people first Transportation Planning rather than people who can afford cars and are able to drive first. What if we actually 25 mile per hour speed limit everywhere, which we don't even understand zero four doors is actually diverted traffic. What if we plan our fees for kiddos with the same devotion that we have for wealthy car commuters and what if our children could actually walk to school on the street if they knew Because the streets were that safe. I really look forward to seeing some kind of redirection and Reeves thinking about how we Rachel's the last one who signed up for the general public, We do have a public hearing that will be coming later and today's agenda around the electric vehicle legislation by public comment this point. All right thing none will close public comment and I'll invite presenters forward for the first few items five or six and let Jasmine Stephen join us for dinner appointment 01289 through 01293 appointment of Carol kachadoorian on junco and a Leticia zivarts and the reappointment of Patricia m Chapman and David seater as members of the Seattle pedestrian Advisory board for a term to March 31st, 2021. Welcome everyone. Why don't we start by doing a quick round of introductions? Hi, my name is Bella and the spiritual advisor for the appointed to The Pedestrian Advisory Board. Ana's Ivar, it's also here to be appointed. Thank you all for being here. You want to give us a quick overview of The Pedestrian Advisory Board and then introduced the the new appointments Stewart's of The Pedestrian master plan and also assist in the decision-making and guidance for the finish a master plan implementation plan and think I'm cries of 12 members of Leaven partially used to be. Between the mayor candidates in the council candidates with one get engaged member and that get engagement book is rotated every year and specifically the get engage members. I use a position between the ages of 18 to 29 and that's pretty much with a headboard the great The Pedestrian master plan is is a critical piece of our commitment to Vision zero, which is the city's commitment to eliminate all trap. Related Fatality and serious injuries across any modes of transportation and we know that almost everybody starts and ends the trip as a pedestrian and for a lot of people that's the only way to get around and so ensuring that we are designing a network of safe pedestrian connections for all users in our system is critically important in The Pedestrian master plan is a amazing document the really lays out, you know a map for how we achieved that and we also know is it's really expensive and you take a lot of commitment to actually build out that net worth you need to do. So, why don't we take a minute and let let Anna and Carol if you want to just give us a few minutes about why you're interested in joining this traffic to the work and what you might hope to accomplish as a member of the testing about your bored. So I moved to Seattle a little over a year ago after living in Washington DC for since 1980. And certainly I experienced the changes at Washington DC had in terms of additional facilities for people walking and biking I'm a multi-modal transportation planner. I'm a consultant I when I saw the ad for The Pedestrian Advisory Board, it just struck me as the right thing for me to do in this city that I've come to love as a way to contribute and to apply both my personal and professional background. I'm a lifelong pedestrian trial to young adult as a college student as a mother with two children and now has an older an empty nester and an older adult and so I feel I bring those perspectives as well as a multi-modal transportation planner when I turned 60, I thought I could probably focus on active transportation for older adults. And so I do And I do that I might work for both walking and biking the other thing to note is that I had a disability earlier in my life up until about 18 years ago. And so I experienced pedestrian Mike Fiers walking as a pedestrian with a disability professionally. I also worked on a number of committees in my positions with people with disabilities. And so I understand both personally and professionally that aspect of it is. Well, I think I said it our meeting last week that I hope I don't have any particular personal goals for being on The Pedestrian Advisory Board other than being a good member and helping that board make good advice to this committee and city council. It's so I also just recently moved to the Seattle area that I grew up in Olympia Washington. I left in 2005 and moved to New York today. I lived for until last summer basically and then I moved back here for a job with disability rights Washington. I'm the program director of rooted in rights to our video. Advocacy. That's part of disability rights Washington. I'm low vision and I I move that left Washington State because I felt like it wasn't a place that I was going to be able to get around in New York with a place that I felt like I had equal access to going to where I needed to go coming back here. It's been amazing to see the sort of commitment to Transportation the functional relatively functional bus Network compared to other places and but I think it's a lot we can do to make Seattle and more pedestrian-friendly City and being part of the board. I want to make sure that the other two table talks in and connected to Our voices are heard. I also want to make sure that we're talking about how this is all connected to zoning to housing affordability to building out Transit networks to Transit areas that are Transit desert so that you know that that is not just rich white wealthy folks who have the opportunity to live in walkable communities that it's it's all our community. It's it's the whole city and and outside of the city as well. That's my interest great. Thank you so much and I'll just take a moment to thank you and rude and rights efforts and collaboration with the city working in Olympia to get some some more flexibility around legislation to protect the austrians in bus lanes in and use automated enforcement to make that say, I think that you're working really nice work. Olympia still have a couple weeks ago here to get that finished, but it's a completely different conversation because of Are you all done? So thank you for that. And then we hope to bring that sort of respective to a lot of conversations around mobility and access han-jung. KO is also a new appointment but not able to make it to you having to say about. So I can have some. Pokemon friend nickname by she is a triangle research scientist and Professor specializing in human development and gerontology, which is the study of the process of Aging problems of old people and all the study of old age as a trained scientist. She found it important to pay attention to equity and social justice issues such as unsafe living environment support for social engagements for both older and younger Generations. She identifies as Taiwanese and she helped her time when he's Community organized Taiwanese American Heritage week back in 2014 and 2015. That's part of the board. She hopes to contribute to the walkability needs of diverse residents particularly for those of the older generation. Great and councilmember sawant typically have new appointments show up at the table. But I also recognize that the meetings during the day can be hard for folks to make it too. So I really appreciate you both making it here and I'm uncomfortable dancing the appointment for han-jung stew. But if you have any concerns we can hold off on Amazon and I also think I can floating the profile that you read out of han-jung and also the comment that Carolyn on a boat made. I think they're really important that you're focusing on the I mean, obviously the needs of all pedestrians because as consumer Brands and we are all pedestrians, but also, Placing a specific emphasis on the needs of the disabled community members and older citizens. I mean that I didn't get free if they can have an urban space that is designed that works for disabled and older people adding a 12 more for everybody. And so it's really a good Benchmark to have and I look forward to hearing about what specific things we can do. I mean obviously prioritization that's a no signal in private signals in Seattle quality of sidewalks. And and all of that is tied together like for me to go from point A to point B. Give me make it safe and and accessible in every way and I appreciate That you said that it's also it's tied in with housing affordability in town. So really crate in addition to the three appointments we have to re appointments and then if you want to say anything about them or I can just appointment is David seater. He was a previous pay board member and would like to be reappointed and he was an active volunteer leader with the Seattle neighborhood Greenways and Central Seattle Greenways. He's committed to helping transform Seattle streets in two places that are safe Equitable and comfortable for all ages and abilities. He brings knowledge of s. Work since he has searched for 2 years, but I would like to continue to do so or Patricia Chapman is Amaryl reappointment and she has also previously served for two years on the board. She brings not only her two years experience on the headboard, but she is a retired fhwa perspective. As well as senior perspective as well. I'll go ahead and move all 5 appointments and reappointment to did Niners 1 through 5 all in favor signify by saying I thank you both need appointment for car the full Council on Monday. You're obviously welcome to attend but not necessary to be there really thank you for your service and commitment and you know invite you to use your voice on the board to push the city to continue to work on this testing environment. There's a lot of work to be done. I think there's a commitment to do the work because a commitment to do a lot of things in the city and without some Focus attention, sometimes we will not achieve what we want to and headboard plays a really important. And elevating those voices and raising awareness and holding us all accountable to deliver on on the master plan, which we've made a commitment to do. So, I look forward to hearing a lot from you in the coming years. Well for me in the coming months. So thank you all so much. Alright, then the number 6 Jasmine. Council Bill 11947 to you and Ordnance Road until and Easton zoning mending sections 2322 06229321404558490199344030 and 2384. A010 the Seattle municipal code. Welcome everyone. Why don't we start with a quick round of introductions Yolanda you can lead us off at Yolanda had a council Central staff Christine again Department of construction inspections. Rate, so we had a great conversation. I'm sure a conversation. This is a piece of legislation. I've been very excited to to have a chance to vote on and so the presentation last week or two weeks ago is great really good to understand the work. It's clear to me that a lot of really thoughtful work has gone into drafting our legislation including looking at what kind of pure jurisdictions around the country are doing is kind of a baseline for Best Practices conversation with folks in the electric vehicle industry and advocates in the community and also conversation with the folks that build the buildings that will be required to meet these new requirements. And you know, I think that you've navigated of half if it works out really well, and I'm really excited about that. You want to maybe I'll give you just a minute to give a quick Review for folks that are jumping into this conversation today for the first time and then we'll probably just looking at that. So cancel bell 11947 to would amend the land use code to add a requirement for the provision of electric vehicle charging infrastructure. That would make it easier to install charging equipment Anastasia Inn in the future if development provides off street parking. So specifically the legislation would require that each private garage or private parking area provided for an individual residence such as a single-family house duplex or townhouse includes an EV ready space defined as a 208 240 volt 40 amp power outlet require that multifamily development was shared parking garages or shared surface parking lots provide at least 20% of the spaces as Evie ready with higher requirements for small smaller parking facilities require that parking facilities for non-residential uses include a minimum of 10% of the spaces as evi ready and allow flexibility from the Eevee requirements and instances where the meeting the requirements What are require a certain types of upgrades to the utility infrastructure these requirements would apply regardless of whether the parking was required by the land use code or provider for other reasons and are not intended to increase the number of off-street parking spaces constructed. We're happy to answer any questions. You want me to have an hour or after the public Hearing in general with my recollection. Is that for a single-family homes or really small construction project? You know of six or fewer units is a requirement that if there's parking provided there's essentially of 180 / stall so, you know any individual Towne homeowners family home would have access to it. And then as we get the bigger projects the requirement shift to about a 20% requirement and I have a chance since our last meeting to meet with a company and it actually does EV charging stations and they confirmed what you said that the technology is is there almost there today where a single single charging station has the capacity of managing load in a way to charge as many as five vehicles sale at 20% charging station EV ready requirement with something. Could use the technology could get us to 100% adoption which would be outstanding so and looking at the comparisons to other jurisdictions. It feels like we've taken kind of the various high standards from other jurisdictions and put them all together and it feels like for Farsi to be taking the next step Realty for the jurisdictions were continuing to raise that part of it is accurate dish. I think he nailed it. Not really. I'm also ice cream very excited. There's a we're going to go ahead and open the public hearing I have for folks signed up Aaliyah Miss X first followed Dianabol Drayton and then Alec Zimmerman and Anthony Harrison do each have about the two minutes. I am good afternoon. My name is Liam is sick and I am the Washington Transportation policy manager at climate Solutions climate Solutions is a regional nonprofit with the mission of accelerating clean energy solutions to The Climate crisis. We are in strong support of his ordinance, which is one step along the way of transitioning to a clean energy economy. As our city grows. It is important that our infrastructure is adaptable to the Future the transportation sector accounts for about two-thirds of the city's greenhouse gas emissions in addition to promoting multi-modal transportation. We also need to ensure that our infrastructure will accommodate zero emission Vehicles. This ordinance is crucial in that Way new buildings will stick around for decades but electric vehicles are here now making sure a building has wiring an outlet is necessary to accommodate vehicle charging up front is very low-cost the retrofitting a building later on in cost five to ten times as much one of the biggest barriers to EV adoption is the lack of convenient charging at home. Give him a low-cost. It only makes sense for new buildings that include parking already too, date for future. Recharging the outcome will be broadened access V's Lord air pollution NPR greenhouse gas emissions. I want to emphasize that this ordinance went through a robust input process and the staff made adjustments according to the feedback. They received the result is a well-crafted ordinance. That is one step along the way of helping to ensure Seattle's growth is more sustainable. So thank you for considering this ordinance and again ran strong support Annabelle. Good afternoon in Sanibel Triton. I'm a policy associate at the Northwest Energy Coalition or an alliance of over a hundred member organizations United run clean and affordable energy. I'd like to start off by thanking you all for your commitment to equity in the environment as you all know from the 2014 inventory on road transportation makes up 66% of the city's greenhouse gas emissions this amendment. Is it essential solution and a suite of policies and programs that can be used to reduce air pollution and meet the city's climate goals and WBC is supportive of policy and advancing beneficial transportation electrification and supports this Council Bell. That wouldn't show new buildings r e v e r i d e v Reddy buildings or land use codes help provide several EV infrastructure Solutions same if you EV infrastructure installed new construction such as electrical panel capacity raceways and pre-wiring can be up to ten times cheaper than selling EV infrastructure during retrofitz new construction buildings last four decades, so it's critical that charge. Structures Incorporated during original construction and the standards are technology-neutral which allows the infrastructure to adapt to a wide spectrum of EV EV charging technology. Again, we are supportive of this policy, and we look forward to continuing to work together to meet the growing easy adoption and infrastructure demand in Seattle reduce air pollution and support a healthy environment for all. Thank you so much. Oh my gosh. Vehicle my daughter if you do not see it garbage Radford Animal Farm on my name Alexandra a charge next door or go spit up and everything in this happen for the last year and I drive around. I never see one electrical car when I drive in charge. We spend a dozen and doesn't million dollars a hundred million dollars for nothing and you'd be absolutely freaking idiot could spend a hundred million dollars for who for private driver. Nobody has been pouring money for me. I have private driver I pay for gasoline by a paper every single freaking idiot electrical car. Don't say nothing. I pay for Sam. Why is some an eustachian about electrical car but this happened when tomorrow's is old electrical car will be there? Guice, what does Vic have right now? Is this a bunch of freaking idiots about causes? A Nazi Social Democratic? Mafia will talk about climate in Spain hundred thousand hundred million dollars noting so I speak right now 2018 skin cleansing story chamber Frances crook could spend a billion and billion dollars for nothing in transportation. It's exactly what the cars. Stand up America cleanses dirty Chamber from creating a promise. It's not a big. Thank you very much. Anthony Harrison is next. Good afternoon. Mr. Chair councilwoman. Thank you. Anthony Harrison Ave. You have to charge point and I am pleased to be here in strong support of this really important ordinance chargepoint is one of the leading providers of EV charging in the world. We have the largest Network here in North America and we had actually just over 600 charging spots here in Seattle and we work with cities across the country on either redness orange juice and I can tell you if adopted this will be the most sound and reasonably be ready ordinance in the country and I want to come in the staff on the robust work. They did to reach out to Industry on the design and development of this policy and as an EV infrastructure provider, we get to see firsthand what the huge up front barriers are to the point the infrastructure. We need to support the growing rate of cars and this ordinance addresses that number one barrier. There's been multiple studies that shown that having policies like this and play. Comida, seventy-two 80% cost reduction at time of installation for EV charging stations. So I am again, please to testify in support and I look forward to I seen this ordinance going to affect. Thank you Great Big Sea Anthony. The last person is signed up to provide comment or testimony in the public hearing. Is anyone else that wants to comment Sing no one else moving towards the microphone will go ahead and close the public hearing. Yeah, so for those on the camera the question was about where this would be in commercial retail operations requirements. Do they remember to stop your head? 10% of a spot for a retail operations while and again with the the technology able to expand that that could be up to 50% of the spots could be ready at some point in the future. So so I will go ahead and close the public hearing. Typically our rules are there we do not hold a vote on the same day of the public hearing but I've only heard positive things about this and when applying to suspend the rules to move it out if it's okay with you can spare someone to want to make a motion to suspend the rules. Sorry. Oh great. Thank you all in favor of spending the rules going to have a saying I suspended. So now we can proceed to a vote Yolanda tell us about the amendment. Well Tara Brian you have sponsored an amendment that would add a reporting requirement to the bill and it said Council would request that this report. Seattle Department of construction Inspections Office of sustainability environment provide a report to Council in three years. So June 1st, 2022 and that report would qualify how many parking spaces were created. How many worth of them are EV ready and also kind of track the number of electric vehicles in the city as well as an understanding of geographic distribution. So what neighborhoods are these being built in and and the types of development that these are associated with and also attract the number of reductions that are granted through a type of decision. So we understand if this is a significant barrier or if not, you know, and they report would also request adjust recommended adjustments to the standards if they are not meeting intended outcomes and them I was able to work with Christina at SDC ion kind of making sure. Seems reasonable as well. So, I think it yeah that should work in three years on that Amendment for me and consumers want the the the thing that I was always try to do is get some information, but I want to be sensitive to how soon can we get information that actually mean before because when this goes into effect it'll be for new projects that are coming along and so three years is I'm guessing it's probably at the front end when just the first handful of projects will be out there. But at least it'll be a chance for us to see you in evaluating on the world will most certainly have changed a little bit in the intervening time. And so it be if there's things we need to do to tweak things because you know that point too so I will go ahead and move this moment and now go ahead and move the council Bill agenda item number 6 As amended, how old is a person if I bet and I thank you for all your work on this and look forward to getting this before Council and getting it in place until we can start seeing projects MTG new standard. So thanks attempt your work. Alright Jasmine. Do you want to read the next agenda items appointment at 5 appointment of Joshua and Norris as a member urban forestry commission for a term to March 31st, 2022 and reappointment of Weston Brinkley as member urban forestry commission to March Point, March 31st, 2022 Come on Ford. Welcome everyone. And when we start by around the crown of introductions Joshua Morris and the urban Forest Urban conservation manager at Seattle Audubon Society of Weston Brinkley at crunch are children forestry commission environment and a liaison for the air compressor commission my pleasure to introduce Western reappointment and Josh's appointment to the urban forestry commission, which was established to advise city council and the mayor on police these plans regulations having to do with the management of urban forestry in the city commission has 13 episode stations 6 hour appointed by the mayor 6 by counsel and one is appointed by the commission itself council is recommending reappointment of Weston Brinkley to position number 3, which is the University of Representatives Western brain strong knowledge and experience. Clean a range of community-based urban forestry program in science and education. He has a degree in urban geography and a master's degree in urban planning with the land use concentration. He currently teaches at Antioch University Seattle University and the University of Washington. He's also Ambassador for the urban Waters Federal partnership it with stones broad experience in back running around forestry research and he's strong leadership skills have been an asset to the Oregon forestry commission. He has served as a commission chair for the last two years and he's being appointed to a three-year term that ends in mention March 31st, 2022 to position numbers 7 and G or representative Josh is the conservation management at Seattle Audubon. And in this role, he leads engagement on local conservation issues in coordinates Court coalition-building advocacy and Outreach to support Urban concert. Priority switching food pantries Josh a wholesome master of arts in international environmental policy and bring it over 10 years of professional and volunteer experience in Environmental Conservation to the air compressor commission. He's being appointed to a three-year term ending March 31st, 2022. Just want to get a chance to hear a little bit about your background and why you're interested in this role and what you would hope to accomplish. So thank you very much for the consideration. So the manager and see which is the oldest conservation organization in Washington state. We were founded in 1916 and are now in our second century is an organization and throughout that time. We've had a hand in the establishment of Olympic National Park North Cascades National Park in the successful passage of the migratory bird treaty act. We've been involved in numerous environmental lawsuits and more recently. We work with City Park. Turn stool cheap formal designation of the city of Seattle is an urban bird treaty city do the US fish and wildlife service throughout the years. The conservation program has shifted Focus to better suit the needs of an increasingly urban community and our Flagship conservation initiative is one that we call Neighborhood flyways which seeks to maintain and Hanson connect habitat patches across the city and a healthy thriving growing Urban Forest is critical to the success of initiative and that's why I'm excited about the opportunity to join the urban forestry commission and chose to share his perspective in expertise with you all as it has an NGO representative on the commission. So thank you Josh just really quick on the urban flyaways is that to support migratory Birds. Is it really for local birds to be able to get to Houston where they foraging for both, but it's critically important for migratory Birds is there but they're flying North along the Pacific Flyway. Listen to thank you for being here for your reappointment. Thanks for your service. Tell us a little bit about where you see the reports. We commissioned going and what you want to accomplish next. Great. Thank you will do our annual report coming up. So well, I'll give you some more detail then, but personally I just want to say that the forestry commission is a really tremendous opportunity for us as a city to better understand the benefits. We all get from nature and to really put those in practice in many different ways across the city. We had a really just great relationship with staff with Council and you know personally look forward to continuing Network. Smurfs want to have any questions for these folks will get a chance to dig in deeper over to get to the the annual report then thank you both for your work and grateful that you're willing to step up enjoying the commission. Appreciate you working on the bottom. It stands to convene. There's definitely a lot of interest in the community and I think I'm the council to do some work around urban forestry regulations. And so I know that the commission has been very active in that and I'm sure we'll talk about that in a moment too. So I'll go ahead and move appointments numbers in 7 in. I want favor signify by saying hi. So your appointment of reappointment will go to the full Council on Monday. And with that. Why don't we jump to agenda item number 9 on read it in the 2018 urban forestry commission annual report. Welcome to say it's not your report, but you can come in. And whenever you're ready, we can Jump Right In. I'd like to just walk him Sandra and join us up here. Well, thank you very much is by ordinance. They are bound 42 commission is required to issue an annual report and we have the chair and vice-chair to provide information for you today. Thanks, and thanks again for the opportunity. That's it's always the fun part of the job. Today. We're going to talk through our annual report. So essentially walk you through hell 2018 went where we are. And what we do we'd like to give you a glimpse of all working on this year 2019 good overview of our work plan. And then is he already mentioned a council member we'd like to focus specifically on the work being done around updating City tree regulations. Urban, forestry commission commission like many of the boards and commissions is to advise mayor and City Council on policy and regulations specifically governing protection management and conservation of trees and vegetation in the city of Seattle. Dwayne Haskins salvation army forces Bradley 3 objectives. The first is to help make specific policy recommendations. And that would be working with Council II would be to provide a public forum. We Engage with the public on these issues. We provide a space for them to bring up issues to engage with our group as a way to connect with the government more broadly around urban forestry. And that's also an area that we're really working on expanding our capacity and our ability to be effective in and how we work with the community and to be a away in for the community around urban forestry into into the city's government. I'm the final key objective we have is Randleman Tatian of cities management of forests and trees and larger that happens to the implementation of them forestry management plan. I'm taking tea with our objectives were really working with the council. We're working with the public and We're working directly with the Department's and that includes the half-dozen plus of all the different departments that touch on trees and vegetation in the city. You figured out how to navigate the complex web of a tree oversight that the city provides rather departments that we're working on it. I'm going to hand it off to Sandra to chat a little bit about our 2018 successes in our work plan. So we did continue working on the the tree protection ordinance update in 2018. And where what sound will be delving into that and let more detail little bit later on. We've also been working with staff to update the urban Forest management plan, which used to be the stewardship plan through a listening mainly so far through listening meeting to come in in an explanation of what the process is particularly the process for reaching out to communities in the area as part of the planning effort. We did also Recruit new members to the commission you physicians in the area of environmental Equity public health and Community neighborhood and that adds to the original 9 positions that were created in 2009. And then also they get it get engaged position that was added. I'm not sure when exactly but so we have many more members now and in a broader Representation of of skills and interests and perspectives those positions are valve been filled by the way. So we're also we had one of our Representatives attend the environmental Equity cohort training sessions. That would it was put on by the city for City Representatives is part of the race and social justice Equity program initiative. So one of our members participated in that in 2018. We did work again on building relationships with other partners that deal with urban forestry issues and met with organizations like Seattle 20-30 which dedicate it's up to energy conservation sustainability and stormwater. We we were breached by Sound Transit regarding the Link light rail extension from Northgate to Lynnwood about three issues, which you probably saw today was in the news to get an idea of what their tree planting program will be in in what they're dealing with we met with City fruit take to understand their programs related to fruit trees and food security mountains to sound Greenway The Nature Conservancy, which is which Focus still a bit more. I'm there more urban initiatives than they used to be as special related to stormwater. We met with for Tara and and learned a little bit more about Are the green Seattle partnership in particular and then also the king Conservation District, especially in relation to the grant programs that they provide two cities in in their region in their district for urban restoration and remodel restoration. Are you all and give opportunity to tour with Sound Transit Beyond just the city's borders to me certainly we can encourage but this is relevant Beyond just the border and I don't know their own rules about trees and tree replacement. So as well as wash. So they are working with several jurisdictions besides Seattle on trying to satisfy all those require. And it seems like the intention to do pretty significant tree replacement is there that's great to hear all the benefits do we get from an urban forest and be great to have light rail to sew binding way to coat the coat of this is a good thing. So, thank you. Sorry to interrupt. Okay, we worked with sdci and commented on the proposed directors rule regarding entry code violation penalties. We provided comments on the accessory dwelling unit draft environmental impact statement. We did we were briefed by the Seattle Public Utilities ship canal water quality program and 3rd Avenue program and they did request input specific input from us on tree replacement species and locations and other things and they briefed us twice on that. So that was really good relationship to have a lot of input. And we provided comments on the mandatory housing affordability ordinances particularly in relation to the green Factor changes, and then as related to that the input on the directors rule that the city was proposing for updating the green Factor. Stop turn it down back over to Weston and he's going to delve into more detail and then the tree ordinance date, but I'm sure you're very where were long in the process of working on updating Seattle Street ordinance. This is now entering its 10th year the interim tree Ordinance one in place about the same time that the force commissioned a began in 2009 and it has been an item on the top of the fourth commission's list for its entire existence all 10 years. So we're very excited that were closed. Hopefully to getting something in place that will meet all of our need two goals and we're very thankful for council member Johnson as well as many other council members for pushing us forward pretty strongly in the past 2 years. Broadly, I think the goal is to get something in place to protect trees which is not something I think we would all agree is happening currently in something that does that in a way that is Equitable that works for the huge range of other needs we have for space in our city and I firmly believe that's possible. A key point that we have pushed for that. I don't think we got him on our list tier list to simplify. The process every attempt at revising country code has been up a very complex process and I think we believe it can be done simply and still meeting those those other goals that I outlined generally some of the key principles are a queen and place a permit process where we can finally have data on tree removals in the most important thing is we don't know how many we're losing and that really cuts down our ability to make good policy. We can make the recommendations. We need to without having better information, please. The main barriers to not being able to document the number is because the trees are most I mean it because of the location on private properties are out like how exactly yeah trees on private property are removed and there isn't currently a mechanism to track that answer. Tuna. Permit process would allow for a record. Would you say that for the most part? It's actually not understood by homeowners like what? When I think a broader understanding from the public from Property Owners is a key key component in this man again. I think that's reinforces. The notion of we need something that simple because if it isn't utilized if people aren't using it, then there's no point in having it. So permits being a key component that really a lot of these other things will flow from protection of exceptional trees and grows. We have designations in the city for trees that we as a community decided to have special significance. We need to ensure that those can be protecting those mechanisms in place for that to happen. I'm feeling blue program. So understanding that sometimes we will need to remove trees for a variety of reasons. And when that happens making sure that there is some mitigation or some other component in place that can if not lead to a direct replacement on site have another way of mitigating the impact about a big part of this and send it to your attention. So not just looking at what we do after we lose trees by having make sure we keep the trees some place that we have. It's much more cost effective to retain a tree then to buy new line and wait for it to grow for many years. What kind of incentives would? Their current city programs in place to provide free trees that provide training for maintenance for managing trees on your property. I'm all of those could be improved could be better resource that can potentially abusive family also doing that is in the green factor to provide to allow on developers more points for the retention, then they're currently allowed. So that would be another type of incentive for attention. And flexibility around some of the development requirements so that if helping helping up as a project free will impact the development some way. But if they preserve the tree to get have more flexibility around setbacks or hate or some other elsewhere to accomplish their goals or whatever it is and when done well be great if we can find ways to further its programs and think could be really successful. Couple other items that we've recommended in and had strong a positive feedback on tree service provider registration. So essentially keeping a registry of companies who are approved to remove trees in the city at start of utilizes such a tool for Street trees or proposing expanding that Citywide first and foremost. This is a safety issue. We want removals to be a safe and well regulated and seeing process. And also we want to be sure that we're not losing trees in expenses are we don't need to be there. We have professionals variegation things like tree health Would you anticipate that this would be a requirement that for anybody to work on a tree that we need to be part of it or that they were just be a registration and that would be the best experts are certain uses. I think they'll require us to finding the term work in this instance specifically to date. We recommended it removal be done by professionals who are registered and the other caveat being here that word defining removals or even tree activity as I'm only on significant trees are trees larger than 6 in trunk. So those are existing fresh bowls were thinking it might trigger for this. I might empty. I just mentioned it adjusting the threshold for where these items coming to play to be 6 inches at listen to the industry standard said he's kind of night Nationwide Seattle in the past has used 12in and there's far too many of our trees were talking probably 50% or more of the trees in the city fall between 6 and 12 in into a program. That doesn't capture. Those really isn't being very well. It's not going up. We have a couple other pieces of recommendation with my small out exemptions, of course funding enforcement for the program. And another item that I want to call that isn't on here is tree replacement working towards replacing trees that removed as first and foremost the action should be taken and not just go into a payment again that's set of a hierarchy of preserving trees in his first priority if they need to be removed replacement is the next priority hip replacement can't be done. Then we're looking at a family program would be used to do replacement. It was just be off-site somewhere exactly. And we were also looking at finding ways to make permit costs the fee and Luke components available for programs that would Target kind of the equity concerns. You might have around charging for some people to be able to own trees and we think that that shouldn't be a barrier. The one thing I do want to call out of this that these are kind of detailed Nuance positions that have been discussed for years and I feel like a really coalescing around this list of items. These are things that are largely supported and then Mary Burgess is executive order 2017 11. I'm calling for changing how to manage trees and they're also items that are largely supported by mha companion resolution that you all passed recently. So I just want what kind of reiterate that we have executive directive that seems for the line here. These are commission recommendations and we feel from our expertise our strong and we feel like you all have at least given a general policy agreement and full Council that these are directions you want to take as well. So I think that's a great sign. We're really close to being able to move an ordinance forward. I am I appreciate your ongoing work on this collectively the commissioning and frankly Advocates throughout the community in new had a piece of legislation last year last fall that step forward and counseling bagshot has indicated a desire to kind of stewards this work for the council over the coming months. And so I look forward to that because of all the work that's been done. I think we start from a really good spot and I remain optimistic that we can get something accomplished in the next few months that be great great wonderful glad to hear and yeah, we're very thankful that franchise agreed to step up and help us get across the finish line. More broadly are 2019 work plan. Beyond trip protection ordinance updates would be again focusing on the executive order implementation. How does this work free Spin apartments? And what does that look like specifically we anticipate Fallout ordinance. The other big piece of 2019 is looking at the urban Forest management Plan update the Sandra spoke to earlier. This is a great opportunity for us to add an improved understanding of the current landscape and really outline of very actionable plan for our city streets of Education. As always will look at a broad range of policy decisions affecting urban forestry in the city. And as I mentioned earlier, we're really set on improving our engagement with the community particularly around getting a wider range of voices in there before Street Community. that's a big issue every respect but also you see the a difference in the recover if there are stars different. Let me go to North Capitol Hill. Very beautiful lots of recover. I'm not I'm not I'm just talking about it from a Labor Day stand for hugs and you see completely different much and much lower fee cover. So we did if I may add that we did canopy cover assistant 2016 data in a we had a component to analyze the equity peace and is interesting with the analysis using to census tracts one was the 20% within 20% of the poverty line and also a people of color as a census tract and interesting be enough in general. Yes. There is Lower Canada vs an average. We also noticed but they did the work that we did showed that some of the affluent neighborhoods that have views also tend to have fewer trees and some of the low income Neighborhoods that are yet to be redeveloped at 10 to have some bigger trees. So he's one of those things that is not always the same but we are very seriously looking at the Equitable a way of Distributing better Distributing canopy cover and also providing services to a historically underserved communities as part of the plan update. I just want to add that we've utilized that work extensively in the commission and we're really grateful to city was able to do that analysis and again are pretty critical piece of data that we need to to do this job. Well, That's all we have. Thank you very much again for this opportunity happy to answer any more questions around today. And also just look forward to continuing the conversation. I know you're only like branches loss or where I mean, I did actually see a couple of trees come out at the roots and I saw one at the Arboretum that was pretty sure as a result of the snow storm, but I don't know if there was any I don't have a number. I don't have a number but they they were certainly trees down and I want to give kudos to the department. That actually did a great job with emergency emergency management Paris Tennessee light Spurs. We have been working closely together to make sure that we're serving the public in a way. That is it doesn't matter if it's a parts tree if an extra crew is right there. Let's take action in help and that's why it is very important for us to protect trees and to make sure that they're healthy in areas where they can post a hazard and angels. Great work from from City departments and I can find a number for you. But yeah, usually in in in When Storms we will use trees and that's why we keep on planting trees as well. And I would just add to that that we don't have a good way of tracking again the trees over lost on private property and we have anecdotal data from colleagues who work as arborist to work as responders on private property, but we'd chronic just don't have a good way of understanding. What was lost again mechanism for replacement would be a value here and it's time for tracking losses. And that would also give us some data round wear this ring species that didn't withstand the storms. Don't do well smell all information. We could use to create a more resilient r4i system. Well, thanks a ton for your ongoing work, and hopefully we can achieve some success on an updated ordinance that meets the objectives that you all laid out. I think there's a mention. I think there's a path to get there and if we can do that this year and for you all up to to focus on the next iteration of work for Tri Star City that be great. Thank you both. Next gen item. This is the 2018 School Traffic Safety Committee annual report. by presenters Ford welcome everyone settled. Why don't we start with a quick round of introductions like your first my name is Mitchell Ottumwa senior Transportation Planning with Seattle Department of Transportation and also serve as liaison to the committee. I'm Ariel and Russell. I'm the chairperson of the committee and the volunteer. I'm Margaret McCauley, and I'm a volunteer on the committee. Maryland Furman and I'm a volunteer on the committee project Development Division former liaison to the Seattle School Traffic Safety Committee trumpet on handing off going on here. Welcome everyone. Thanks for your work and we have a good presentation. So do you want to just jump right in where was going to leave that thank you for having us here. This is the Seattle School Traffic Safety Committee annual report because we are forward-looking it. We are calling at the 2019 annual report. So we were created by ornette. So the committee was created by ordinance in 1975. There are institutional members Public Schools Department of Transportation Police Department King County Metro, and then all meetings are open to the public and we actively invite people to come join us. The committee the comedian Louis Central Point for people with concerns about school traffic safety issues to come complain and get concerns addressed some of the things we were tein Li do our recommend new school crosswalk locations in crossing guard assignments with a lot of help from s. In identifying optimal locations Wii U review traffic circulation plans for new and being renovated school buildings. We help with the forest updating elementary school walk boundary maps and we have been doing a lot to improve crossing guard recruitment, which will touch on later in this session. So we actually didn't realize that other committees were reporting to you. So we were sort of letting you know that we report to you. Take me to talk about what we see as the five top needs to promote School traffic safety and Seattle starting with support for active transportation for students in Seattle Public Schools filling in missing sidewalk and other Street safety infrastructure, particularly within a quarter-mile of schools reducing the crossing guard vacancy, right working with ospi to hopefully we're hoping you might be able to to help us there because the laws that is written include support for non bus transportation related Transportation related expenses, but currently the formula just doesn't accurately reflect. The law in Seattle is losing out as a result of that and then we want to ensure that the requirements for Street improvements when schools are belt or renovated are focused on enhancing student safety. The crossing guard vacancy rate is 39% in a little bit institutional support for active Transportation. I apologize for the statistics. It says 60% of SPS students do not receive busing in fact 60% do not bus 50% or not eligible for think so it should say 50% and these students are expected to get to school without any sort of organizational support two streets that are increasingly dangerous with heavy traffic and with free cats in infrastructure. Ask a question that to the cities in some more trying to get more Orca Cards into students half and so over the the last few years. We've starting with some students in Rainier Beach who are really highlighting fit that they live just inside the walk boundary. I think it's two miles and I went down I think I was just at 2 and walk to school at the kids just to see You know what they had to go through every morning and every afternoon in the challenges they face and so the the city stepped up with a pilot program and it's been expanded since then and I'm curious to know if this data the 50% eligible is through the the Seattle Public Schools kind of baseline or that includes the extra Orca passes that we're giving it. So that's a good question. It does not include the Orca cards cuz when we say eligible for busing that means for the yellow school bus while we are certainly interested in traffic safety at every level we tend to focus must have Lyon elementary school because that's that's where the kids are most vulnerable. Yes. So I'm taking back at The Pedestrian safety improvements around schools for elementary schools. The walking distance is typically 1-mile, but you can see highlighted just within a quarter-mile. The red dots are schools. They've pinks. Is quarter mile radius and the gray areas of the missing side while swimming a quarter-mile. So there are sections of the city where we are asking Elementary schoolers to walk a mile to school in the middle of the street in the winter in the dark and we estimate is continually working to improve that situation. They made substantial improvements around schools and do every year and they have at the safe routes to school program specifically geared toward that and that program is funded in part by the red light camera funds and the committee does want to take a moment to register as this may hang up seeing in November 2018 Bay City budget revision, which transferred funds out of the red light camera. Sorry red light camera funds away from the safe routes to school program if you are depressed. Every year in our city students are struck by cars including a recent Collision in March with a student at Robert Eagle staff Middle School who was stalking is recovering. Well from a broken leg now, but we just want to emphasize that making Vision zero a reality for the children of our city includes a commitment to funding the safe routes to school program and we hope to see that red light camera money restored in the future. I appreciate your concern is part of the council that did what was unfortunate. I would be very interested in working with with you. All another is to to put something in place in advance of this year's budget to just make a Commitment to to dedicate a portion of these funds again, maybe even higher than we were last time to these these projects and then maybe expand the language around what what encompasses a School Safety project to to make sure we're as comprehensive as possible. There are some challenges in the budget last year. There will be challenges as much as a teacher is always a reality and a council could undo that but I was really uncomfortable with what happened last year. I can figure out a way to do something differently and Achieve someone's active. So I just kind of Santa my hands but I think there's an opportunity to advance this budget to make a clear policy statement from the the city council if you all are interested in that would be happy to work with you on something like that and and make sure what that language might be. We definitely would being a thank you. I'm going to go cover something is that you probably know but I feel like are still worth touching on which is that what we build creates a culture that then kind of accelerates in whatever direction that it's going. So if families are not comfortable walking to school then they if they can will probably Drive which makes it more dangerous for other people which makes them more likely to drive so that the Vicious Cycle and the folks with the least number of choices and resources suffer the most from that and one sort of Broader way that we know about this is ptas. Some schools has strong ptas. Some schools have no ptas have been able to do wonderful things from biking and carpooling that is haphazard inequitable across the across the city and even the strong ones strong programs tend to fall apart as parents leave as their children leave. On the other hand hiring a district-wide active transportation coordinator could make it more Equitable could help fill in some of those gaps help figure out where we can. Get people walking biking and carpooling and start a virtuous cycle in which the last contested people feel more comfortable walking and biking and carpooling and those benefits. Don't just go to the school families for the go to the whole neighborhood the feeling of active happy children walking on the street is something that makes it clear to the people broadly that it's a it's a safe place to be so and it's not just in traffic there are studies and we can provide you the citations that movements and schoolchildren stays is really important for academic performance. We found the are the cellular phone that you can be as much as I have a grade level and that's also supported by the research studies and then the air pollution in the can congestion. I have personal anecdotes about parents in my children's classes crashing into each other with cars. So it goes around. The city is currently missing out on a resource that exist that is provided by King County. They have an app called School pool that is specifically designed to help families form walking biking and carpooling groups to help people pull their resources to get kids to school safely with fewer cars on the road and they provide that free and is currently being used in Redmond Bellevue Kirkland Kenmore Issaquah and buy some private schools as well. The city of Seattle does not inside the SPs cannot use this resource currently because there is a need for some administrative support to verify that kids are actually attending the schools that people say King County needs just to have for every family that signs up someone who says yes, this person attends this school and that is not available now so families in Seattle are not able to use this free resource. So crossing guards as you noticed, we have a 39% vacancy in a critical safety position program used to be managed by the Seattle Police Department and it was moved over to the district a number of years ago with the understanding that state law would reimburse the cost because the state law states that the state will reimbursed full funding for transportation costs. What has been happening is that that has not been the case and we've been trying to figure it all out the current theory is that there's An Excel formula that some bureaucrat is using that is functionally penalize in the city of Seattle and ask for a transportation cost. You're only able to put in bus cost this just no way to say we spent this much money on crossing guard. So they just there they just don't see it and don't consider it and don't reimburse it and for the only thing but in Seattle buses are not will not and should not be the only option and I don't know there's also the issue around the recruitment people at schools feel somewhat ambivalent about the crossing guard program residing with them. They feel a little bit like, you know, Seattle Police Department used to do this and we kind of wish they still did and I haven't taken there's not a strong crossing guard recruitment. Programmer or any other treatment program and has in its it's the resources that support around the crossing guards didn't come along with the responsibility for the crossing guard. So I'm just there's one woman there who doesn't amazing amount of work with the crossing guards, but is incredibly work van and there's no one else who sees whose responsibility it is to recruit them. So the vacancy rate is very high. We have Police Department's been really enthusiastic about helping find creative ways to do recruitment, which is been great. But then once the new recruits submit their materials processing is awesome bog down there if there was any more consistent support for recruitment that this could actually come down significantly. It's it's not in some places in more affluent areas of the city as a little bit harder to find them. It's a very low paying job, but we don't need that many people in absolute numbers there. If there are people who can do this. It's really just a lack of push to get the vacancy rate down that we see is the biggest barrier will not kind of hoping that the city can help with in the short-term some resource-sharing to get the program back on a sustainable basis and then long-term help push that the state funding for bills the terms of the state law as it should. So another thing that we do on the committee is review the walk boundary Maps. These are the maps that determine whether or not a child will be eligible for busing based on the location of their home. There are others eat children also get busing because they might be eligible for special ed or might be going to an option school. But if they're going to pick up a clear not eligible for busing so in 2018, we can be pleaded review of all of the elementary school walk boundary Maps. They had not been reviewed and several years and we were looking for areas where they were no longer reflecting and the conditions on the ground and a few instances where we found that they were not showing the true danger of an intersection and we had to reduce the way I found real ID and for the most part we were able to open the lock band reassess. Are they said it's always putting in new projects and they are focusing projects around schools, and we found many instances where Conditions on the street but better safe to walk now ask. Also assisted us throughout that process by grading intersections around every school with a consistent rubric so we can make sure that we were making those decisions about which intersections were safe to cross equitably. That process we found that there were some opportunities to open the walk boundaries that we couldn't take you're probably aware that that Seattle public schools has had significant challenges related to busing this year. There's a there's a driver shortage not just at us gas but also at King County Metro and in the region that has made a very difficult to staff all the routes and results. Delays about 2-3 hours particular point the start of the year and they've done huge amount of work to improve that situation and now have their they told me that as of this month there currently on staff browser down to 1% So this is a huge Improvement unless we found that if the crossing guard program could be fully staffed we could actually reduce the need for passing and help reduce that last one percent. There were a number of instances where we could if we could have created a new crossing guard position. We could have opened another section of walk boundary. But with the existing Physicians on staff at such a high rate, we couldn't in good conscience create a new physician. You said that the the number of chronically understaffed routes for the school buses has been reduced to 1% That's right. It was themselves are obviously one of the main issues is that it's it's private and SPS does not mean because their private entity they don't hire enough drivers, which is one of the reasons I see some of the students are arguing that they should be United Republic, you know, any other districts it is so I've had a number of conversations around busting into m. I don't they have they feel they've done studies about whether should be public or private and still feel confident. They made the right choice. That's not within my purview. They consistently say is that the number one issue is just the lack of drivers in the region King County pays higher wages and offers more hours. And so the drivers are constantly being poached from first unit to King County end. But now I can say but they have they have contracted with some additional providers and work this First Student in they've been consolidating routes and if they've been doing everything they can. student does not hire enough drivers I'm sorry that's outside my area of expertise here, but I just want to point out that the crossing guard seems like a small piece of it, but it's actually impacting the busing as well and we could be in addition to I'm getting more kids walking getting you know, having fewer fossil fuels burn. We can actually just be reducing this uncertainty these delays that are making life difficult for families of students and also reducing students ability to be in school and advanced learning is crossing the students that live in that red area would be a walkable distance from the school most of the school and that would put less stress on the bus drivers also less congestion less pollution and all those things that you know, Support through Schools transportation in Seattle Department of Transportation. So we have taken a preliminary look at because in some places to walk my boundary might include an area where not very many students have been to live going to the schools. But there are a number of instances like this one. This includes many students in this area who do go to Wedgewood Elementary. So this would definitely have impact on how many routes are needed. Yes. School speed zone cameras exist around the city, they take automatic. They take pictures of people who are speeding when the the lights are flashing and send out tickets. And on that program is run through the Seattle Police Department project that we have begun in 2017 is to track the data the police department Tally's the number of tickets at each location every month, but we are finding it's really difficult to stay with just just that month's data weather conditions are actually improving or not. And because the number of school days in a month or variable, you know, this number doesn't have very many compared to November. So looking month to month is often not very helpful either. So we started a spreadsheet tracking looking at December compared to the year before and the year before and the year before and we have about three years data in that now we're going to keep moving it forward that we hope will be available to us. Hope they'll be able to use effectively YouTube to really examine whether or not conditions are improving for example At Mercer Middle School one of the cameras there is consistently our highest number every month with an average of 826 tickets and that's just it's 4 hours a day. I think it only on school days. So it's as a lot of tickets and there was actually there was actually a man that I had worked on for an improvement. They are as a result of the request by the school that came up against some vocal opposition and has been shelved and so we're hoping that as we have this data and as it becomes more robust, it'll be available to lean on to to help really gauge where project I needed. And where opposition is maybe not always the most important factor a neutral source. All right, and I really quick on that just to remind myself in the public that the revenue from the school safety speed zone cameras. Those are 100% dedicated to school programs and we didn't change that last year red light cameras. We historically had done is a 25% I don't know the percentage of time. I have we can get and the goal of course with the school speed zone cameras is that we don't like the penny because everyone's following the laws and you know, if we have a great circumstances and we'll find some other revenues to support Safety project that we really do want to see those numbers going down and I appreciate your help to dig into the date. I know when it when they first started a number of years ago the early data showed that that they would you know, I've ever seen the revenues at a specific camera would taper off after the first year, which is great. I'm riding a lot of the camera. So that's also a good thing. But if you this analysis is really important for us to help understand what's going on. There are some I didn't bring you know that this quite a range I should say some some cameras. We do see are down very low numbers as few as 20 or 30 in a month. So we're hoping to see more of them had the traction the Empire has that and of course you really important. Into the last thing we want to talk to you about is city code in school construction as Margaret mention when cities are sorry when schools are built or renovated we take a look at the circulation plans and give him put on them and try to identify problem conflict areas before the city before the school is built and open as part of that process we have on a couple of occasions seen as soon and as CCI requesting some improvements from schools and really requiring them in order take out the variances. They need that we didn't think we're an appropriate use of schools much money or resources. And for example, you can see here is a drawing for a wing Luke Elementary that includes a box truck turnaround to facilitate package deliveries to neighbors behind the school and it's actually eating into the playground there and it Pay for my school is it would was going to be taking away playground space from the school and had a fair bit of communication around that with us. And we were not able to get them to drop the requirement for the box truck turn around so they did eventually work with schools to find a location for it to be that didn't take away from the playground but it did the school was not a happy. They felt that it hampered their ability to manage their on-site circulation as they would like to do it involved in that but also the people who were working on it who were requesting these are just they're not in the safe routes to School Division and they're trying to do their best for the taxpayers and get you know, everything they can out of development, but we feel that there should be an acknowledgement that a public school is not a typical development and that a public schools should not be required. how to build things that benefit commercial vehicles I appreciate the acknowledgement that the gentleman here from outside, or maybe not the ones making that decision, but I know if you guys have any comments on on that, that's fine. Well, I think one of our big challenges as as was mentioned is that at that is a large organization and whether it's safe routes to school or Vision zero making sure that those principles are in trench and ingrained it within and throughout the organization is one of our biggest challenges. I think we've made some good strides over the years, but this I think clearly illustrates that we we still have a little ways to go there, but this is really good food for thought for us, and I think can help us move internally to make sure that we are communicating with folks who we don't see everyday or ever in some cases to ensure that they understand what the objectives of our programs are and what kind of alkanes were trying to achieve which everyone can get behind safety for students stuff. Thank you. Define the recent passage of the council bill that will change the focus of M requirements for traffic studies to include more of a multi-modal focus. That's a big step forward and we are watching as the director's role is developed. We really like to make sure that not only is the multimodal focused wrong. But that schools are specifically addressed in the director's role as having their separate traffic requirements school projects have very, you know, different Transportation requirements than a typical commercial or residential development. They have more vulnerable young users more pedestrians more bicyclist. And also the the rush hour is offset from Peak Community hours. So we would like to see the breakfast rules require Transportation studies for schools to really focus in on the transportation needs of schools and not treat them the same as Say a commercial or a condo project. That's it. As you may remember. These are our main points. We are hoping the city can the help the district get active Transportation support going and one of the ways is point number for which is helping push on the state because that's something that's really Seattle specific and it's not necessarily a large amount of money, but it really affects the district's ability to do what they need to do. Something that is the city's Isabella point two missing sidewalks bullet point three were as mentioned hoping that the city can do some resource sharing in the short-term and we know the police department is enthusiastic and has some sympathy institutional knowledge and networks that they can provide working with him as much as we can but need some additional help and then the last one is making sure that City requirements for schools focus on student safety. And I thank you very much for the miss the time to speak to you today. You just one question. I know if only your assessment is Citywide, but I'm sure you've heard any. I mean, I'm sure you've heard of specific concerns relating to also the school Traffic Safety outside Bailey gatzert Elementary School. So I was just wondering if you or I start had anyting to say about what? What could be done? I personally go by Bailey gatzert at least 8 times a week. So I have a lot of personal opinions and I'm moving my children by the state. We're in the next District over our Benavides Elementary School catchment Fiesta. It wants to say what you're going to do and then I'll tell you what you should better. Do I want to hear about opinions. Well, personally, I'm personally driving any of the plans moving forward with Bailey gatzert. So I'd have to go back toward our team and and collect what are our current plans are for that area. I am very familiar with Bailey gatzert. So it's pretty much surrounded by arterioles and major principle arterial streets 12th Avenue Rainier slack born in the area there. It's a challenging place to walk bike driving as an adult Sebastian. You have to be more aware. Yeah, I think that's our approach would be to limit speeds to that area and certainly look at what we can do to improve Crossings for people who want to walk and bike to school out there as well again, I'd have to go check with the team down to exactly what we have in the works at this point. So from a user perspective, I guess the fact that we can't maintain the crossing guards because they're scared and that we're always going to have a large population Crossing two major streets because of yes or Terrace and the wonderful new resources and parks in the community center were always going to have people going others. That's not optional. We did recently the police representative on the board asked us to write the district Department to ask for extra. police enforcement on drivers in school zones during school passing times and foremost schools that the sort of I know I'm late. I'm late car commuter conflicts come in the morning, but for Bailey gatzert being surrounded by hospitals, you found that the afternoon rush-hour also conflicts with Bailey gatzert. We got out times. We've asked the police department to also do afternoon as there has the primary role in that and I feel like looking at the 12th Avenue. I think it's kind of the first first way to fix and then Boren would be next. How to draw a lot of pictures but I don't know that we have time for that. But yeah, I think we should take a moment also to just say that we do have a police officer on the committee and that place is very supportive. They work with us too and they have a hot spots list that you can put schools on when they're having specific traffic concerns around them and they will send routinely sent officers there in the morning to try and change that behavior because soften it is the same the parents of the kids are are causing problems. So they can they can assist with changing the behavior which is particularly helpful in the short-term. Mitchell's is a boat at work with s. Too often get some faster things like signs were striping pretty rapidly. But the police are the ones who respond first to try and address an issue while last time is working on their revisions in there and extremely helpful. Just as the comedian ass. Also to keep my office updated. I'm just say I really appreciate the thoroughness of your work. This presentation is outstanding and I particularly want to acknowledge that your comfort with bringing concerns for the city council directly and without thought and very respectful way, but I think it's really important for for me that we have these independent commissions that that are both into us and say they hate that decision you made the other day. We didn't like it and here's why and so I do want to commit to work with you all the things true. If there's a strategy to go back to where we do with the red light camera. I'm revenue and also maybe talk a little bit about the scope of what does investment look like to sew As we mentioned some of the other camera revenues are are determined. How much is allowed to be spend out on things other than School Traffic Safety is is it's at by state law the red light cameras were initially our understanding as to when they were first authorized, you know, kind of part of the political cell with that. This would go towards Traffic Safety improvements and it and that has continued to be the case, but the amount has gone down in our concern is that you know, once a revenue stream is going somewhere else then if you move it you're taking out of that is if it can get hard to put it back and so we would be very interested in looking at any sort of more permanent backstop. That's save this much will always go and if it could be returned to its previous level in and have some sort of more permanent resolution that assets level, that would be excellent. And it was a set of safety improvements we can invest into cuz there's a great need there and again and I do world people would stop running red lights and we would stop clicking that money in the banks. Thanks so much for your presence today in your ongoing work for safety of our kiddos. Alright, Jasmine had to run to a meeting. So Jodi, thank you so much for being here. Would you mind reading until acid end item? Excuse me tonight at 11 o clock file 31442 to the petition of Willow Crossings lllp to vacate a portion of 39th Avenue South and south of South Willow Street. Thank you so much, and it presenters are getting her once as presenters gets settled down. Ask me to do introductions. It's my go-to spot down here and keep an eye on me. Hi Beverly, if you would like to start by introducing yourself in the Seattle Department of Transportation. Hi Emily Thompson from GMT development Joe. I guess you can start off and tell us where we are in this process and we're going to hear about today. So over the course of 2017 and 2018 that city council took a pretty intense. Look at the existing Street vacation policies and rejuvenated them and revise them and one of the top cuz of the discussion through that we're what opportunities were there for the community to see a vacation was coming in and have a voice and so the policy revisions looked alot at the role of the community when the city was reviewing vacations and one of the things we'll talk about it after the PowerPoint is the community engagement plan price. A switch that department of neighborhoods is administering and then this is a new petition that came in under the new policy. So they have developed a community engagement plan. And the reason we're here today is one of the other things within the new policies was that when a petition came in a brand-new petition that we would bring it to the transportation committee before we done all our work as we come to you at the end of the process after we've identified issues and worked and worked on them. And we think we're bringing into you all the issues resolved and solutions. And so what we heard from the council and from the community is that will maybe there might be different way to resolve some issues. So let us see us early on so I think this may be the third project we brought in so we're still kind of figuring out what kind of information you want to see and how early but the idea that direction in the policies is that we will come in basically with a brand-new petition. And now of course the Or someone can petition they do a community engagement plan do early design guidance meet with Michael Jenkins and do the normal feasibility assessment work with with me and others in s. And the city but the idea is that with a brand new fresh project. You're seeing it before we've worked at it. And so this creates an opportunity for the committee and four members of the public to say. Oh I like this or can you think about that? So we think there's some projects you're probably going to give us a lot of Direction and some not and so we're just kind of seeing how that goes. So with this this is a brand-new petition just starting and the process. So what we have planned is that Jeff and Emily will go through the PowerPoint presentation which shows the project where it's at summary of the community engagement plan. And then Danielle and Michael will talk about the community engagement plan process. And what Michael expects the design commission to to consider as we move forward, so we do have about 20 slides. We want to give you a really I'm a good overview. We can go through things pretty quickly. If you're familiar with the area and the project so we'll just be guided by how much information you need to know. Emily was going to jump for here. So definition of the next slide. I'm supposed to kind of Orion 2 to where the project is. This site is about a block North of the Othello Light Rail station. If you're familiar with the new Mercy Housing building that went across the street last year were just pretty much in the same block on the other side of the street. And a little bit about the applicants we are the project is being co-sponsored and Co developed by the company that I'm a partner at GMG development and a nonprofit partnership with aof Pacific affordable housing Corporation. We are based in Seattle have a long history of working in the Pacific Northwest most recently in June of 2018. We opened Linden Flats, which is up on Linden at hundred and 32nd. And which is 170 units of affordable housing. We only develop affordable housing and we're very committed to Seattle and are partnering with the office of housing on this project and another project in Belltown coming up. So Pacific American leader with Evan office in Seattle, their head office is in California. They have two roles in projects in Washington, very Echo General partner in a number of larger Bond transactions. I don't know. I think they do have some stuff in West Seattle that their members of butt and then they do a lot of our work around tenant Services property tax abatement. So there they are an active project participant though GMD takes the lead on design and construction which is why they're not here today and taunting and you said that you only do affordable housing. We only go for crabs a for-profit developer make for Seattle not unique for the industry industry affordable housing industry, utilizing the low income housing tax credit as a financing piece of their development is actually more dominated by private companies from nonprofits it just in the city of Seattle and then the state of Washington the way that the funding policies have been developed over the years. It has created. Favorable playing environment for the nonprofits and so typically for private companies don't operate here as much. And then I see you in just the note on the Linden Flats. Is that the top photo their recent Bond transaction built in the city of Seattle window Austin housing funding 4% The installation. This is not the front and we're here to talk about today, but what level of affordability So I guess specifically to talk about Willow Crossing. We went out to look for any project. We found a site on MLK a block North of the Light Rail station, which we loved Tod site. I'm actually already had him up but it was a much smaller project and we needed a greater number of units for feasibility. There was a sight available behind it on Willow that would create an L-shaped personal. So we purchased both sites where she purchased them with a city of acquisition loan from the office to housing. So the city is a partner on this transaction just for the acquisition portion and we are now working to vacate and unimproved section of 39th to be able to spam and the the vacation they can fix it a portion if you well. So what is important about this is there is already a 20 or land use restriction now for affordable housing at 60% of Ami on both Parcels with the front MLK park in the back Willow parcel still protected. So there's this R2 business plan options here with the plan that we are pursuing is 211 units of housing just using the same financing packages. We talked about at Linden so 4% bonds with permanent financing and no city of Seattle that subordinate that we would actually be repaying our land acquisition loan info at rlp closing which my understanding according to Lori Wilson has never been done before so they actually had to redact quite a bit in the documentation for it. 7 year land use restriction that would start the clock ticking again at placement service, which should be in about 3 years. If we are not successful in getting the vacation for our business plan, which is again not to use off of housing subordinate that we do not have enough units on either site to make it financially feasible. So at that time we would basically essentially give the keys back if you will to the office of Housing and say, okay Steven Lori, you know, what you guys want to do. Do you find out what you want to find another developer who can step in and develop both sides separately. Do you want to maybe they can remove my understanding is they can remove Latisse prescription and then tell them we would be able to step out of the picture at that time. So and that would there would be no an unknown cost in timing to develop is to help affordable housing on that site are not without the vacation. It just doesn't Not what I'm looking for. And so kind of today. I got a step back with this project and all of our projects when we think about this location this location to sort of the north entrance to the Othello neighborhood when you're riding south on the light rail station, and there's so much new development going on and I thought of when we really see this as a Gateway corner to the neighborhood and we want to help use our product to create a more active pedestrian environment leading into the light rail station, you get a barrel of trash cans coming out of the lower density housing to the east to the west and we want to create a better corner there in pleasant experience and integration as you come out to MLK or third up to MLK to the Light Rail station. I'll talk about a little bit of the architectural side of this. We actually had this project in her office previously. Emily's company bought this project from one of our clients with them up approved. So I just wanted to kind of brief you guys on what was actually in the original design based on what's changing as we move forward since we already do have a mop on this project and in terms of the permitting process, we will be doing them up for revisions not starting from the beginning again. I'm so for this redesign, we're reprogramming the first floor by adding a larger Lobby and amenities spaces maintaining the retail spaces long MLK and keeping the previous litany design Courtyard space in the middle of the building access from MLK. It's a community Plaza. They will be open to the public. The exterior design is exactly the same. The parking is now moved from off of South 39th, which it was previously designed which if both of these projects for developing become sort of vehicular and pedestrian disturbance on the site and its Just now access directly off of Willow. So you go directly into the parking garage instead of having to have the ocular circulation between the two future projects. So it's much better for The Pedestrian experience any meetings for the community and everybody was in favor of the project especially because of the community Courtyard as well as the fact that they would prefer the project to be affordable housing when we met with the community. It was not an affordable housing project. It was 100% market-rate apartments and one of the main, that always come out of those meetings was can we get more affordable? Can we get more affordable in our client previously was thinking of doing a very small amount just to sub just to reflect the code requirements, but they really wanted more affordable housing in that area. And then with the new design Edition outdoor open space along Willow has invited as well as more amenities space for the residence within the building between the two sides now, This is a map site plan of the two sides. So on the East you'll see the 6901 MLK side, which is what we previously had permitted threw them out process. And then the Willowside is on the west and shaded with the red is the vacation that we're proposing and you can see the vacation actually dead ends to the South that does not contain you pass any of these sites so does not connect to anything. I passed the willow site and then to the north it does not connect to any other streets either. I'm not sure if that was vacated in the pasture or how this became about we don't have the the information on that but this is a solo Street by itself with no connectivity at other than to Willow and it's not used very much right now in total. It's not improved. Yeah actually doesn't look like a place that people would hang out and assume it's a city street. If you look at these photos that we have here, you can see that actually it's being used by the willow property is parking and it doesn't even Look, like if you were driving down the street, you wouldn't even know that you're allowed to go in there. It's completely personal property from our perspective seems to be no use for it in the future. This is our ground floor plan. You can see that there's the community Plaza off of MLK and it's on the west side of the East Central side of the project. We have the retail in the darker Purple colors on the west which would flow out into the plaza and also be accessed from MLK the orange spaces are the amenities spaces for the apartments and the blue are the units on the ground level. So you can see the outdoor amenities spaces notes 5 1 and 7 and that's where we would have common space for the residents as well as for the community and the parking accessed from Note 4 there on the North This is the transit system right now and you can see that Saturday night. There's a dead end Street and in actuality Willow does not cross MLK either and so you're not getting a lot of traffic flow coming from that the East everything is really isolated to MLK in from the West. I'm in terms of vacation and no vacation benefits. We we have a graph graphic hear that shows on the left what it would look like without the vacation and that's our last month drawing and we showed a typical what a development would look like on the willow side. So you can see that there is traffic problems. If we were to develop these has two separate Parcels, but if we combine them will actually solve the traffic issue direct access into the parking garage without having any pedestrian interference and also create a lot more open space around the perimeter of the project. I just wanted one thinks that last slide though. We are a block from the light rail that we are including some underground parking the original mop that the just previous client had had two levels of underground parking. I think 75 or 80 stalls. Maybe we are proposing one level of underground parking. I think on the this document says 40 sols actually lost a few cuz we need to increase our bike parking count. So we're in somewhere in the mid-to-high 30s. So it's not as if it's a 211 unit building with 211 parking stalls were fairly modest number. I think we're down to about 30 to 35 stalls, and we have a hundred and two bicycles Falls now. I'm standing so I can talk a little bit about the key to the engagement process. So it's just mentioned. They had a whole public Outreach process during the designer you pieced we then went in under the new community outreach process that went into effect in July of last year with Danielle's support drafted up a community outreach plan and I'm had really wonderful robust meetings with the local community groups in that neighborhood. Everyone was everyone felt like they got their win at design review because they got the building. I wanted the look of the building that they wanted and then we came back and told them that it was him and it felt like it was Christmas. We didn't have a lot of success. How do people come to the open houses that we planned and I think again people felt like they were very engaged during the design of your process and it was just icing on the cake. But one of the things we talked about a lot at the community groups and at the one on ones that I had with individual stakeholders within the community was the idea of the sorry that the public benefits and we to maximize housing on the site. We don't have a lot of opportunities for additional open space to create some of the public benefits that to create enough for we felt like to put enough robust on-site public benefit in there are some opportunities and we'll talk about that but actually going to go for it to size. This is just a summary of the public Outreach that we did what we did in printed and digital with all in multiple languages culturally appropriate to the neighborhood. And again, we had a couple of really great meetings with the local neighborhood groups. Has he written on pretty early on was what can we do as an off-site public benefit in the neighborhood to in order to make our public benefit package more robust the topic that came up most regularly and I felt like with most appropriate is there is a program called places for people which is being implemented by another local community group with the acronym called hosted which stands for healthy. Othello is safer through environmental design and they're basically they've identified a couple different locations within the neighborhood that wherever they're going to put a public art that will create a space that is more interactive and safer and try to Force bases near the Safeway and they have a couple different locations chosen a local artist signed up to do the art and they're basically doing one location at a time as they're able to raise money for it. Then the first location is fully funded but I like that might work. Well with this is as long as we don't know the timing exactly of when we will close and that's when we would fund a project and so we would then be able to find to whatever put me know whatever location they are working on. These locations are all within a quarter-mile of the site and given that it's about pedestrians and safety and community and art I felt like I was a good a good tie into what the purpose of the public benefit package is supposed to be so and then this is a summary of the on-site public benefits that we are proposing. So we have the entrance Plaza at MLK which is on the left drawing and then we have this Willow Plaza. We've got a funny Street right-of-way funny right of way step back and designation public space even call. It has the road situated right now in front of the site, they stepped between two sites. And so there's about a 10-foot discrepancy on where the actual right-of-way anchor blinds will be and so on the willow side will be left over with an area. That's not that we can't improve to our building but we can improve and turns a right-of-way benefits with seating and Landscaping and public benefits. Two locations plus an off-site public benefit donation, and we wouldn't have to improve that. We just start electing to this project. And then there's just a couple more at visuals of the sites as the front of the site along and okay, and then I'm if you stand at the corner, you can see how it works back along Willow. And this is our Central Plaza along them. Okay? And we will be working with there's a couple different nonprofits that would help to try to connect with minority owned businesses in the area to make sure that the and small businesses to make sure that the retail spaces are devised appropriately for small businesses and not you know, just giant 6000 square foot spaces that small businesses can't use we do have income under written from those faces, but it's at like a 50% discount to Market Road. So we're here we are hoping we'll has connect with a local business. If I move in hoping that these spaces to be very small so they could get multiple tenants within the building and reach out to local communities members to take these sweets. Cream to the on-site spaces then okay one so. And I look at the plan view. Does that Plaza go all the way through or is there? Typo on that so where he had number seven on that tab is actually that is not a public space that is private to bid for the tenants. So it's the first plaza and then it stops. The building entrance is also located in that one of the entrance of State private. It won't be fenced off. So that leaves you said, this is a relatively new process Michael. Do you want to weigh in and Danielle? Do you want to talk a little bit of the engagement? Yeah, so this was one of the first projects I worked on with advising Othello, as you know is a very diverse area. So we wanted to make sure that they were really reaching out to all neighbors including people speaking other languages other than English. So we had them translated into Spanish Vietnamese African languages including Somali Amharic Oromo in tigrinya. They did a mailing to local neighbors put up posters in the neighborhood did an online survey which a lot of the things they talked about where things that showed up on the survey in terms of a Ford of making it affordable having people Have local businesses and the plaza and things like that. They did to focus groups with different groups that as they mentioned wear it very well attended but still advertise did Bradley to make sure people knew that they were offering this to come and give him put on the project and also the public benefit and then we had them reach out to some key organizations Homesite Puget Sound Sage Rainier Valley Community Development Fund u-dub Othello common in that Multicultural Center the organizations in there and then we had them send their invitation and To their focus groups and Survey too many maybe 25 different groups neighborhood groups in the area. So they did a pretty expensive. Outreach process to really make sure that they were hearing from community members and organizations that are impacted by this show for the the design commission process. Remember when you change the policies any applicant of a subject to design review would come to the design commission before starting the early design guidance process. We wasted a lot of quality time together to try to figure out because they were revising an existing mob to expand the convert in the way that from a market-based to affordable housing we have to do a little bit differently, but we tried to stay within the spirit of those new requirements and they met with a few of the Commissioners who are we're all I think Landscape Architects is helpful for a project like this because of the nature of the public benefit package. I think there's not a lot of question about the use of that right of way. Was it if it feels like it's not really connected. I think the Challenger is the public benefit package and the public nature of the plaza in particular off of MLK. We see this a lot when there's a public space but it's also being utilized for the public to access the building how they balance it feeling and really public opposed to an extension of the Identity or the function of the building is a challenge. I think there's a solution here was it designs for the public has clear cues that this is public space and not just the building entrance. Again, I think there's ways to unpack that. It's just spending some time to figure that out by contrast the Willow Plaza really feels independent of the building its function and will feel I think particularly public for for anyone who wants to use it all of this. I think is balanced against the basic proposition that this project the vacation creates affordable housing with the notification option really not having a vehicle or an option for affordable housing and I think that's not balancing test that you all try to strike to acknowledge. The fact that affordable housing is being created as a result of a vacation that isn't necessarily the part of their public benefit package, but it's creating something that I think the council has been quite clear about this part of the vacation process is how I think the council with the excuse me, the commission will look at that issue closely is part of what they evaluate. Other than that, I've been a pleasure so far working with them and having the Commissioners for help and I hope that their help. I hope that their participation has been helpful. We'll all all this way in with him my thoughts. I think I'll start with I guess the the MLK Plaza and I would say that the concerns that you highlighted Michael we discuss would be the primary concerns and If This Were a more traditional project I'd say those concerns would be significant but on the specifics around this project and what the mission is for this I will leave it to design Commissioners to work who a way to make it faster than I could imagine that the end of the day. It'll probably mean they'll be retail along there and they'll be people we pulled in there and it may not feel like totally public but I am okay with that. I look at the end of my assumption is it if you walked away from this project outside housing would find someone else one of our nonprofit likely providers to buy this and they would build something in a different scale and but it would almost certainly require additional off the housing dollars to make that happen and so we could get More affordable housing here in a different constraint if we didn't want to vacate 39th, but your proposal what you're doing is it means we're freeing up off the housing dollars to invest in additional project. And so I kind of you this is well this site yes could ultimately have affordable housing. It really is the opportunity cost. Is that without this? And so then also what are we giving up? Well, we're giving up something that no one knows we really have which is a small street. So maybe me know and in theory that probably should be treated differently today, but it doesn't actually go anywhere. It's not going to connect anything. We also have a set of values. They were very committed to both the council and then they are on on we want to use on public land for affordable housing impossible. This isn't really that but it's kind of that. I mean we're talking about is giving up somewhere and it's in the right away, which is a public use in exchange for a project that's going to deliver, you know, a couple hundred units of 6% Ami housing at a transit-oriented development. Descendants on a network at Saint of mixed-use community. I mean there's a lot going for it. So point for this process Beverly's you outlined. I'm for me was to give a sense of kind of right track wrong track or if there's a major decision to be made or we want to go in a different direction that we don't come back and either say redo the whole thing or be told like we can't really read do this. It's a really great idea, but it's too late to incorporate it and everything I see here is heading in the right direction and I trust that the design commission will be thoughtful and balance son on how to make that space usable but recognize it the the benefit we get really is it the project happens in this case and Australian egg. Congress want to have any maybe I do that. I talk a lot else. You want to give you some love to be breaking ground. Now that we've had this meeting Ranger standing is that Michael and his team will start working on actually start feeling into some of the design pieces of the Allstate benefit and through the chest region and streetscape issues that we need to work through a little bit and that they basically have will take a couple months to produce their report and then it will just have to go to the it gets approved by the design commission and then it comes back here for two meetings and then it goes to council. So our hope is that we are able to get back here in the early fall before you guys close the agenda for Budget because if we don't and if it were able to be at work putting in a bond application in May so we should have bonds if everything goes smoothly we would be helpful to close at the end of December end of the year and start construction pretty quickly. If we are not successful in getting on the commission agenda before budget and commissioner and then appointments to the new committees in January and February. Spanish Senor this could be March before we get in front and we probably have to reapply for our bonds because the state Housing Finance commission now has a fairly tight timeline, you know where bonds of clothes in the certain amount of time. So you probably have to reapply which would push us out probably to a May or June closing of next year. So about six months difference schedule or Michael in the design commission schedule, but then I'm sure they heard your plea what I can say is that I am excited about this I get the transitioning Council just you know, I give you a bunch of feedback and then you come back and I'm not here and then do persons. Like that's not the feedback. I would have given so I would love to commit to work with you what I can do on the council to show some flexibility. If we need to get this through immediately before a budget in shortly before the end of the year. So responsive you are to both Beverly Ann in Michael's team, but but hopefully that that's Feasible thing and it's a really exciting project in you know, would love to see the office of housing is expanding their their investments in more affordable housing in a recent past. Mha so we work for continue to grow the pool of nonprofit housing providers capacity, but that is definitely not going to be enough and so having private developers like yourself engage in this and be successful and hopefully be replicated delivering, you know, a housing type. Do we really need that without the scarce off the housing resources or used uniquely forever evolving find and hopefully in the NF plan will allow them to actually really use that money again on another project. Know. It'll be soon to so pretty excited about it. So thanks for your work on this. Thank you for sticking around beyond our deadline. I really appreciate that and with that we are adjourned.", "end_time": 8359.8}]}