{"format": "raw", "annotations": [], "confidence": 0.9571107264257904, "data": [{"start_time": 0, "text": "Good afternoon. Today is Tuesday, July 16th. 2008 is 12:05 p.m. This is a special education and training at the table is my co-host and Committee Member number Abel Pacheco. Thank you for thank you for a partnership in the collaboration on this joint effort to frame up this conversation today. So there's a few wonky logistical Robert Rules of Order things that I got to say it before we can actually be in the conversation, but there is no will be adopted. During no abduction. Today's agenda is adopted on today's agenda. And that is to have a conversation with our friends at the Coalition against Andrew Beginnings Anna Washington State Coalition against domestic violence and the City of services and gaps in the system will be holding public comment at the end of today's lunch and learn for those of you who might have signs up to provide us public comment. So we'll go ahead and begin with the panel first and then we'll do public comment last so I will ask Roxana to read agenda item one into the record and then I would invite folks from whoever here representing those organizations to make your way to the table as she does that Agenda item one domestic violence services in gaps for breathing and discussion. Great. Thank you Roxana and we have our friends making their way up to the committee table and then you'll just I just ask that you not fit in this first seat cuz that's Roxana see otherwise any seat you like. And then we do have a PowerPoint presentation. Yes. So Roxana will help with making sure that is fired up for us. And then somebody will need to sit close to that computer to drive. Okay, and for those of you who have joined us at the table before you'll need to speak directly into the microphone often times. You have to get it uncomfortably close to your mouth, but that's their sensitive but not so sensitive enough that you that you can be far away from them. There's also a little button on the stem. That's gray. And that's how you turn the microphone found on or off in order for it to be on the button should be green. So just make sure it's the little light is green if it's not so we will go ahead and start with a round of introductions and then remember Pacheco and I can make some introductory remarks around what we hope to be able to frame up and accomplish with today's conversation and then we'll kick it over to you all to lead us to the presentation. So let's go with instructions for so named and organization that you're here representing. I'm Katherine Reed. Oh, I'm a prosecutor with the city of Seattle in the domestic violence unit welcome. Summer is a melanoma victim advocate for the city attorney's office. girl cousin with the Coalition ending gender-based violence here in Seattle King County I'm Susan Segal with New Beginnings Judy Chan Washington State Coalition against domestic violence Lockhart, I manage the victim support teen program with the Seattle Police Department for being here so that my committee focuses on our issues related to gender Equity as part of his part and also the intersection of Public Safety and some one of the things that I have the pleasure of doing a serving on the domestic violence prevention council with some of you in fact and we have an opportunity in that room to talk both about the work that the city and the region is doing together to prevent domestic violence and to support the resilience and the recovery of those individuals who may experience a domestic violence Bill to talk a lot about issues related to sexual assault in the same servine. But today we wanted to really focus on the issues around I'm domestic violence and how the system is or isn't working for survivors or Current victims of domestic violence and what the city council in particular could do to better support organizations like yours that really do a fantastic job of working with internal agencies like the Salem Police Department and the city attorney's office on really accomplishing the work of investing in and ensuring the recovery of victims and survivors of domestic violence and really appreciate an opportunity to have a conversation with comes out really, well. I'm in a really happy that we were able to partner together on an opportunity to host this conversation and to hear directly from you all about what you're doing well and what we could do more of and of course, this is all in anticipation of what will be the budget process that kicks off at the end of September and we always I have always Prioritize making additional Investments or protecting prior investments in this space and wanted to be a little bit more proactive about those efforts this time around. So can we protect those anything you'd like to add? I did I did the thing where I caught you. Just I just thank you all for being here and that customer Gonzalez just for she said preparation for the budget what we can do to support, but also we'll see what we can make an Investments and stuff. Thank you. All right. He wants to lead us off. Good afternoon. My name is Judy Shannon with the Washington State Coalition against domestic violence. And I think there are slides. Yes. I have the pleasure of being the acting executive director of a Statewide Coalition. We have over 70 member programs around the state serving all 39 counties and several tribes of our 70 plus member programs actually only 42 you are now what we think of as traditional Domestic Violence Shelter based programs that have state contracts. The balance are community-based programs and remote rural communities tribes and culturally specific communities and actually a full third of are culturally specific or tribal. I'm and we have a slight World majority of amazing people doing amazing work so than this photo you can see just some of the amazing work that people are doing not just domestic violence emergency services, but also working for fair wages. You can see there's a that's a totem pole that was carved out of the quileute reservation by men and other people in the community working to heal from intergenerational violence. Onyx please we're moving from being a nationally from being a reactive to domestic violence in the crisis of violence to moving Upstream. So that all people can live in love freely without fear to do that. We are I really rooting and cornerstones of race Equity economic Justice and gender and reproductive Liberation, and I'm very excited to be on looking at new Pathways around for example, rethinking criminal legal solutions to violence so that there are more options for families and communities, especially in communities of color. The Coalition is the leading voice blah blah blah. We have I'm kind of gets around supporting our members engaging the public and doing missionary work and run engaging the public. I want to thank the council for your work on economic Justice and just am so excited next slide, please. About the New Order now is Statewide rights that survivors of domestic violence sexual assault and stalking have to not be fired from their job because of their victimization or for seeking help. For example, we have a new guide for families and friends. We know from domestic violence fatality data and doing almost two decades of reviewing domestic violence homicides and suicides that survivors go on to their friends and family are way more than they go to any other resources in the community. So I'm reaching families and friends on what to do both for people who are struggling with surviving abuse and people who are struggling with hurting someone else people need to know how to intervene because domestic violence is 100% prevent. That's her message. It's 100% preventable. We look forward to seeing many of you at the refuse to abuse 5K at T-Mobile Park Mariners this this Saturday. And I'm also excited about the work that we've been doing Statewide with refuse to fuse program in our prevention work. I'm to reach people young people and all 39 counties in the state with evidence-based and promising practices around prevention. I next slide, please I'm supporting remember programs. This aren't other buckets. And at what I want to call your attention to it mainly is the mobile. Advocacy work that is a promising practice on we're Gathering evidence. I'll talk about in a little bit. I'm through research study and to so pleased that the city of Seattle has been a leader in supporting bubble. Advocacy tree survivors so that so, you know, just what we know is this that when somebody is surviving abuse that you know, traditionally people have to go I'm to an office across town with their kids on the bus may not have the bus money you get there you go and you're telling a stranger about the most intimate and often embarrassing details of your life. And what have you been dealing with and for for many people being able to go someplace is important for so many people having someone come to where they are especially if they don't have a car and they have to stay home with your kids or they work the night shift. It's just so difficult to get to a domestic violence Social Service Agency and having someone come to them or meet them at McDonald's and their kids can play or you know, whatever it is time to be able to talk about what's going on and get help but that is a promising practice that reaches so many more people especially people who don't speak English or have other barriers such as disability XY please and then our third bucket is around Visionary leadership and really recognizing that domestic violence and domestic violence. We need to have good jobs people need to have good jobs where they can earn living wages and have safe time off of work so that they can go and get help that there are people who are working in the fields are picking the apples and and all the fruits that are on our Grace are tables that they deserve help too and that for survivors and victims like I'm charleena Lyles Who was I'm killed in a police interaction in Seattle a few years ago that surviving violence and having a many complex issues in their lives. But those are folks who need help and need help that makes sense for them and their families. Next slide please. So he this is the last one. So one of the questions that we ask and get is what will reduce violence and repair the harm in the trauma that family's experience from people who use abusive behaviors or one of the things we know you can see this image of this was a snapshot of a domestic violence homicides in murder suicides in Washington state one of the things we know from many years of gathering this data is this that perpetrators use guns more often than any other weapon combined and that I'm one we see what we seen in other states has is that when are people who are dangerous abusers have those weapons removed that there is a reduction in domestic violence Fatality and domestic violence and harm from domestic violence. Abusers is one of the leading causes of death for for women in the US from someone that they now We know that we need to expand Community accountability and have it not just be that the survivors accountable for ending the violence. But the whole Community is a part of that we know that safe and affordable affordable housing is one of the number one issues facing survivors and it's the one of the leading causes of homelessness for women and children the United States that we know that I'm survivors often say for those who are able to leave an abusive relationship. What survivors have told us in focus groups is that the one of the main reasons that they have to return is because they can't afford health insurance. They can't afford rent. They can't afford to not live without abusive person. So living wages and employment rights are key. In terms of needs that that city council might consider are reliable on non competitive finding that focuses on Vestor promising practices, including mobile advocacy and flexible financial assistance. So for example to be able to stay in your own apartment, but those are a promising practices that should be a continue to be encouraged and we will at we're actually have some handouts for the council and four participants today about what is domestic violence housing first, but what we know is that often times people can stay in their own place with not alot of investment. I'm compared to what it cost to keep people on 24/7 shelter. So I'm sometimes you know, that's it's always sad to hear that. You have a Survivor, and say I know I'm going to be evicted because I can't afford the rent or I time I had a big debt to come up that I need to pay off. And so I'm calling ahead to see if you know of any shelters where I could go and you know, what happens to people once they have an eviction on there and their rental record are there credit right? It's very hard to keep your family's table. So I'm we're super excited about the results of this of the preliminary evaluation. Actually, I should say pulmonary. I many years of evaluation that we've done putting that 96% of survivors were able to retain housing after 18 months. So are we working with the Bill and Melinda Gates Foundation and the FEDS to do a longitudinal study? And otherwise, I'll turn that study will be complete in 2021, but we'd be happy to come back or share them with your offices at another time. We'll have some short-term housing outcome results in December as well as some data on the impact of the flexible financial assistance. That would be great to be able to get a preview of some of those options. I know that not only Statewide a nationally one of the leading causes of women and children entering into a state of experiencing homelessness is domestic violence, right and you know Seattle is not an outlier. Lanterns about statistic it is also true that a large Papa a large portion of women and children facing and experiencing homelessness in her own City. And in the county can say the same thing. Some have reported experiencing violence in the home either a youth you know, who has experienced violence at home or in a partner on Partner domestic violence. So I think it's really important for us to get a really clear understanding of how that impacts housing stability for individuals who are unfortunately trying to break this cycle of violence and eating all of the support. They need to be able to do that and I'm not sure if you're all aware of this or not, but can't remember her old is leading a conversation around some potential legislation at the city of Seattle to further extend some protections to victims of domestic violence in the area of eviction. So, Really important conversation and I believe she just picked up at competition in her committee last week and I believe it's in her committee, but we'll make sure to share some additional information with you all to make sure that she has the benefit of this wonderful information about a particular promising practices in the housing. First model that is unique to individuals who are either at risk of experiencing domestic violence are who are actively experiencing domestic violence or recovering so want to make sure that that was on on your all's Collective radar that there is an effort at the city to really tackle this Really this eviction complexity related to people experiencing domestic violence about what we hear from survivors around how this has increased their safety and are produced further victimization and the data so we'll be glad to see you tomorrow in that. I thought the council might be particularly interested in the impact for Refugee and immigrant survivors who were 20% and 22% of the participants in a study and I did not print out the hundred thirty-four page report that it is online lastly tube for the points and then I'll be able to return to my colleagues is that on black of capacity for a meeting basic human needs for survivors and their children continues to be a huge problem Statewide under turn away rates, you know, where are tremendous and our state? And we also know that building more and more and more shelter isn't the answer. There will never be enough emergency emergency shelter for the need. If we are meeting people after they have all of that the violence has increased dramatically and all of their resources is going to have gone down. They have no money left no friends or family who are there connected with because we know isolation is the first thing to kick in and that is with we are seeing people at that point their needs are tremendous and that there's it's so hard to fulfill those needs when we go upstream and help people before they've been evicted before the violence has peaked before I'm there children have experienced tremendous trauma that is so that's the promise of what we could do and I'm those kinds of Investments and prevention and earlier interventions make a huge difference. And lastly I'm rethinking criminal legal solutions to violence is something that we're beginning to I'm engaged a lot more with our colleagues around the state in the criminal legal system as well as in communities knowing that I'm for so many people that needs to be an option and end all of us as a mess citizens and residents have the right to access criminal legal the criminal legal system to protect ourselves, but there needs to be something else on the menu besides that I need to be other options. So not really looking at housing living wages economic options opportunity for All Families. Thank you. I appreciate been a lot of conversation with and this community about the viability of criminal legal system conversation. How do we you know, if if the conversation has been historically focused on Dozen victims only are we leaving sort of other creative Innovative options on the table that could fall into the rubric of preventative measures that we could take into place to prevent the mileage from occurring in the first place, which is really what I think the interest in the goal ultimately is as opposed to having the blunt instrument instrument of univ punitively penalizing people who might actually be susceptible and amenable to some other type of intervention that is not quite as a blunt instrument not saying that that is the answer to every single situation but I'd certainly appreciate the spirit of having conversations that lend themselves to a more holistic approach to be able to thoroughly pivot and turn the tide on these issues if I could have a dress that point very briefly cuz I know my tongue is probably up. I think one of the one of the lenses that I try to look at it with is Of course, we want people who are causing Harmon and through criminal activity to be accountable and we know that there is it's a very complex issue and that's for so many survivors. So I want that accountability and for many survivors, they can't access that system safely. So what about them? Absolutely excellent point anything before we move to the next organization. My name is Mario cousin and I have the honor of serving as the Director of the Coalition ending gender-based violence. We used to be the King County Coalition against domestic violence. So and we expanded our mission to include sexual assault and abuse and other forms of gender-based violence in our mission. So we are a parallel Sister agency to the state Coalition and our state sexual assault Coalition working at the regional. So Seattle King County level on these issues and this is just a list of this isn't even all of our members. These are our member programs that provide some kind of services to survivors of gender-based violence survivors of domestic violence sexual assault commercial sexual exploitation and trafficking and also anti-lgbtq violence and like the state Coalition. And so and many of these organizations are also members of the state Coalition. And so we definitely work in Partnership of what the state Coalition does a sort of set the the broader or the state Coalition set the sort of broader vision and and Statewide agenda and then We work with our members here in Seattle King County to support their implementation. So everything that Judy said about sort of the roots and insert of how we approach this work is being rooted in racial economic gender and social justice. I think would hold for us and like the state Coalition. We do not provide Direct Services ourselves. Are are we work with our member programs to support them to do the work of supporting individual survivors and their families. I'm so our mission is to end gender-based violence and promote Equity book relationships through Collective action for social change and like the state by several buckets of how our work fits and we do that by Leading policy efforts at the city and county level by connecting. Members with each other to share resources coordinate Services set common agendas around local policy issues and and also to connect our members to the other Human Services organizations and other organizations working for immigrant Justice racial and economic Justice. And then finally we also work to build the capacity of Our member programs and other professionals and folks in communities who come into contact with with survivors and their families some particular areas of focus that we had we have had some dedicated staff time working on revolve around issues related to family law on the intersection of Behavioral Health and gender-based violence housing and homelessness is our newest we've always been involved in that work and we just Today extra housing service systems coordinator just started and we got to find it through HUD actually two to do that work. So we'll definitely be connecting with the work that the council wants to be doing on congratulations. And we've actually been having some Focus conversations among our members around transformative Justice alternatives to incarceration in and engage in communities in more proactively responding to and preventing gender-based violence and raising up the work of the organizations that are doing that. And so next so here all the time from our members and a few years ago. We did focus groups from survivors. And you know, it's what you all know and sort of echoing what Julie said is just that Judy. Sorry. We are so lucky in this community that have so many organizations that are respond to know that are providing just a whole host of services many of them rooted in specific racial ethnic and cultural communities other serving specific Geographic areas, and then it means they're there really are a lot of options out there for survivors and everyone is stretched Beyond capacity. And so definitely, I mean, thanks largely, you know, what is significantly to to your to your work we have Expanded the level of services that are available particularly focused around on the Survivor driven on mobile flexible advocacy and there's still more that's needed and and basically the cutting the range of housing options. It is sort of one of the number one things we hear from survivors legal advocacy and representation, especially a not so much not as much around the the criminal legal system as we hear about it. I'm related to family law and immigration issues. But that's where survivors are really being impacted for. The long-term issues related to divorce proceedings or can you tell us a little bit more about the particulars of the coolest videos. The majority of contested custody cases involve domestic violence and often times. It may be the first time that the violence is disclosed is in a divorce proceeding because it's the first time that it's been safe to talk about that. So there is not necessarily a lot of other evidence and the there's a lot of focus in our family court on cooperation between parents. And so and so So some of that I think orientations of the court that may be there for very good reasons like when domestic violence is happening and not understanding the trauma that the Survivor is often experienced. It can really work against survivors and we're releasing survivors struggle in that system. We're also seeing people who are abusive becoming really Adept at using the system to further their abuse. And so basically it's a tactic of control to keep the proceedings going. It's the Survivor has resource says I have I mean we have seen folks. Literally, I mean again in hearing about it through our member programs spending tens of thousands of dollars and over years and years trying to protect their kids in the court system and constantly being pulled back in so there's a whole bunch of work there and then of course the immigration There's just not nearly enough and then the whole system is so backlogged and so on any immigration contact is that focus is that primarily around that being able to achieve relief under violence against women's act or are there other components that are barely heard if there's any kind of custody issues that also involves, you know International at an international relationship or something like that. There's a lot that comes up in the Confluence of immigration status and family law when it when they're splitting up. So yeah, but a lot of it is a status and or even like trying to figure out is there any kind of relief that some survivors can get even if they don't have status and you know, some of those kinds of things I think Add to that the response of no Legal Services. I've been a really huge advocate and a pretty dogged about my perspective. I think we need to be kind of energy provide people meaningful access to appropriate and quality legal representation. And it's being a part of history of the establishment of the legal defense network is primarily focused on providing free legal services in the area of immigration specifically to individuals who are at risk of deportation or who are actively in deportation proceedings things that we discovered in that space assertive a takeaway. Lesson was how many individuals were coming to participate in the program under the U Visa program that really needed to have mental health services as well. And Enzo one of the things that we have done to modify the program a little bit is to make sure that we're a little bit more flexible around connecting the dots of you know, when you are applying for a u Visa you need somebody to be able to vouch for the fact that there is been harm caused to you and that somebody tends to be a licensed therapist or a counselor or somebody else who is actively providing therapy in the setting aside sort of the legal requirements in those checkboxes. They have to go through there's a actual basic need of Mental Health Services for individuals who've been severely traumatized as a result of violence that they've been subjected to so I just wanted a flag that for you all as something that we know needs to be further developed in that space and there's also Let the Investments we've been making around I have protection orders and other issues for organizations like the sexual assaults at Law Center to be able to represent individuals who are going through that process and then continue to connect them with much-needed services. And I recognize that it's assertive dimes in a bucket that you know, we need a lot more to go into the space given given the amount of need and and I'm really interested in continuing to make sure that we're prioritizing the legal advocacy of representation aspects for survivors systems reform that needs to happen because you shouldn't have to spend tens and hundreds of thousands of dollars to get a divorce if there is it's a whole other conversation and it's actually more at the county level in the state level I think is where most of the remedies are are going to come and less at the city level. But you know, there's all kinds of professionals being pulled into these cases of a lot of these family law cases that are happy to be happy to have a follow-up off-the-record conversation with you. The other thing is that we are actively doing right now the city is beginning the process of formulating our state and federal lobbying agenda. And so I think there's an opportunity for us to we always prioritize this this category in general but if there is going to if there is a specific bill or legislative fix that it could benefit from having the city of Seattle weigh in on and dedicate some of her lobbying resources to that is certainly something that we would be happy to do and that we have historically done in many of these bases. So happy to hear a little bit more about that as as we gear up for conversations with her. Tell relations around crafting the specific proposals to go through everything else. I think Judy framed it really. Well. I mean the bottom line is we we absolutely know that survivors really really benefit from you know, trauma-informed domestic violence advocacy and support services. We also do have now thanks to the County's some funding from the County's mental illness and Drug dependency fund we have as some mental health therapist based at several domestic violence programs, which is a new thing and then our position that focuses on you know, making sure that folks in the mental behavioral health field know how to respond to survivors of to identify domestic violence and unresponsive survivors, and and that folks in the Because he failed the Survivor advocacy fields are better prepared to handle Mental Health crisis and and needs of the survivors they work with but the bottom line is if people can't see their kids if they can't afford rent if they can't get a living wage. It's really hard to have any, you know any success with these other things so both and not either or and we are also trying to work. I think this community lead sort of the nation in terms of some of the really Innovative culturally specific services and prevention programs that have been started hear some have become National models and we are always looking to talk about Community engagement transformative Justice prevention and move our interventions further Upstream, you know, including true on violence prevention and and changing Community Norms at the same time. We need to address the Real needs and suffering for individual agencies. That can be a struggle is how do you do some of both because the needs are so great. So moving on. I think that like the state Coalition. We are looking at beyond the criminal legal system. And so certainly we want the criminal legal system to be responsive in the way that it's supposed to be and accountable and and we don't think it's contradictory to both be like supporting police accountability and responding appropriately to domestic violence and sexual assault cases throughout that system and but really at the local policy options in Seattle has already taken the lead as as Judy bookmarked on a couple of things like the safe sick and sick in a boat, Seattle. Time how many f-words can be in some of the things like that and Human Services policies including policies that say that Human Services contracts should rise with inflation. So thank you very much for that. Yesterday was a great result for your leadership, you know a lot. I think I should certainly policy related to affordable housing and homelessness and like one of the things that I kind of talked about his DV competency that like there is so much intersection between domestic violence and housing homelessness issues between domestic violence and mental health and substance abuse issues and you know children's issues that folks in all professionals have to have a certain level of understanding of how to recognize domestic violence and how to respond within their roles. They're not all expected to be. Child Advocates, but their responses. I'm within their roles and that's not necessarily something you get in social work school or law school or you get in, you know mental health programs or things like that. So And I also think that the you know this at the city council has a role in terms of raising of a awareness and visibility of the issue because unlike the way, you know, chronic homelessness shows up with folks living on the streets. It's not domestic violence sexual assault other forms of gender-based violence aren't necessarily is in our faces. And so it really takes bringing it up and raising visibility. The other thing that locally there has been a lot of leadership on here in Canton at the county has been around firearms and domestic violence and getting guns out of the hands of people who are abusive and we end we've been working with the city attorney's office and SVD around those issues around issues of who serve of survivors who have been arrested in criminalized because many survivors are often are arrested actually for them. Violence or four other crimes that are directly related to the violence that they're experiencing and then so many also find them there themselves criminalized in the act of trying to survive and so really trying to up our ability to support survivors and who have been criminalized and we have been working with the Seattle criminal the DV PCS criminal justice committee around like a model and Intervention Program for people who have been abusive and around these issues. So there's a lot of great collaboration there. And finally, I'll just stay in terms of funding priorities and I think we talked to you about this before but are number one funding priority for 20/20 on top of no cuts to Human Services and the information ordinance on the inflation adjustment is to around domestic violence is a central regional domestic violence helpline. This is the culmination of more than two years of planning in the community for many many reasons, including the specific dangers that survivors face the fact that it there is more reluctance particularly on the part of immigrant and Refugee survivors other marginalized folks to approach formal systems and because of the lack of capacity frankly to meet the needs of every Survivor within person live. Advocacy let alone Housing or or other kind of legal representation that help line is the entry point for many survivors and for some survivors. It may be the only kind of domestic violence service that they can access and there is not currently a dedicated 24-hour Central helpline or hotline for survivors of domestic violence in this region. There are several agencies that are mandated to staff their phones 24 hours, but they're not funded so frankly and I mean they do the best they can given the circumstances but it's usually people you know, the combination of volunteers folks who are on-call and folks who are doing this as part of their other job many calls go on answered and it also like it's You many survivors get really great trauma-informed helpful responses and many don't and many get a busy signal or voicemail and it's right now frankly. It's a crapshoot. And so we did a multi-year multi-agency planning process for what it would take to actually Implement a dedicated 24-hour well-staffed crisis helpline. I'm here in Seattle King County and we have almost like three-quarters of a funding secured largely through the counties that seniors and Human Services Levy. They dedicated a big portion of that we have about 350,000 more that we need to identify Byerly 20/20 in order for it to really be feasible to implement and Given the number of programs and and survivors that are in Seattle and I think it would be I think it's a reasonable recommendation to to the council. It was recommended by the human services staff for the mayor's budget and where you know, we've certainly communicated this to her and also want to just call out that it's not only a resource for survivors. It's a resource for First Responders. Currently, I think law enforcement, you know, they're required to give information and there's a list of like that list of the of our members there's a list of like 20 agencies and then survivors don't know who to call and they end up having to call multiple ones because of capacities. So this would give them a trauma-informed response someone who could spend an hour safety planning with them if that's what's needed who who is they're having an emotional crisis can talk to them. I also want to integrate a chat function and it will increase access and we did some focus groups. I won't read this to you. But this isn't this just shows some of what the difference is between someone getting a great response from a helpline and somebody getting a busy signal or you know, someone saying that you know, we don't have shelter. Now, you have to call somebody else and getting off the phone quickly cuz there's three other lines right ringing. So that's our plug and yeah, there are number of Statewide hotlines and we actually consulted with a couple of them. Many states don't have as many programs as we do here in King County and there used to be a state domestic violence hotline here in Washington state and for a number of reasons including I mean, it was just I think complicated to run and most calls really were coming you coming in through the day and so, you know, it was deprioritized and doesn't exist anymore. Although the number unfortunately still out there in a lot of ways so and given the number of programs that we have here the level of complexity and frankly, I think the complexity of like the housing homelessness system and the mental health system here. It really felt like we needed a dedicated line locally where people would really know and be able to stay on top of like, you know how the coordinated entry for homelessness like changed again. I think last week, you know, so if it really would be a way to help folks navigate the other services that they need in a really really informed way and tell people what they can and can't expect I do know that I do think there are some other county-level hotlines out there. I know that Portland Multnomah County had a crisis line on I'm not sure if that's still going. Do you know of any others and I'm and then there's also some State some State helpline. I have a crush on someone to check. Oh, okay. Thank you for that information. And that presentation I know that you and I have had conversations about the hotline in the past and I think with the knowledge now that can county has also invested in the program it it makes a lot of sense for us at the city of Seattle to take a hard. Look at what resources we could contribute knowing that we have the need as well. And even though there are Statewide organizations that I think do provide some level of a hotline. It is important to make sure that the organizations that we are referring folks to our from the communities that people are living within which which is you know, I think of that Geographic component I think is super important. I am really compelling stories from folks about how hot line made a difference for them and in their experience and being able to do that safety planning and And move on to Healing also heard stories about how badly I think it's really important as this concept continues to be implemented to obviously make sure that it's a model that is really going to be truly responsive to the to the unique and local needs of the individuals were calling and and I like the point that you made around the First Responders in particular. I think of officers often times want to be able to connect people to the right place in person and it does feel a little frustrating that you have to hand out sort of a here's a directory of every single nonprofit agency resource resource, but it's it it doesn't shift the burden to the domestic violence victim in a way that I think is is really unfair to that person and we have been focused on really looking at Language access and how we make it accessible in in terms of language as well. As you know cultural appropriateness and things like that and it really is a community effort and it is going to take all of our Community Partners to you know be working with the helpline staff to make sure that they know what the folks that they're saying in their communities need energy want to time in put in a piss for this as well as it looks like I'm probably won't have time but I did want to also I'm just say that this does help fulfill. The requirements of the wac as the wac has written around me to try to rest now law enforcement is required to offer the state hotline to say hotline is no longer in service. And so this would help to kind of make sure that we're getting up to the requirements the wac 3.3 point. We're running really short of times. So it would be helpful to know because there are several of us that have two that haven't spoken yet. So what could you suggest to us? About? How much damage time do you got left here? I think I think I think we can and I don't think the chambers are reserved for anything else. I think I think I think we can go in till about 12:15 ish. Maybe a little bit longer, but I think we're safe until somebody comes in here and thank you so much. I'm Susan Siegel executive director of new beginnings and New Beginnings was founded as a Grassroots effort in 1976 to address a documented need to provide safe haven for women and children playing abuse and what began as a small community shelter 43 years ago has evolved into a multi-service agency which includes a 24-hour helpline individual and group support children services homelessness prevention short-term Bridge housing with a rapid rehousing compono. Legal advocacy therapy Community Education and Training as well as prevention education for youth New Beginnings also coordinates three clinics for survivors really throughout King County a DV family law clinic ADT protection order a clinic and a technology-enabled coercive control clinic. We're also a proud participant in the latest iteration of the DV housing first demonstration project and the longitudinal research that that Judy spoke to and that will be available in 2021. In 2018. We answered close to 5500 crisis calls are 24 hour helpline. We provided in-person support to 525 adults and 174 children 80% of the survivors that we served out where low-income and 50% were people of color and we also touched 3200 adults and you through our Community Education and prevention efforts. We can go to the to the next slide what follows will Echo quite a bit of what Judy and Admiral spoke too. So I think I'm not, you know, I'm in the interests of enabling other folks to speak. I'm not going to go over all of these points again other than to say that or to remind us that domestic violence remains a hidden epidemic in our community and two of the best things that we can do or really within our reach has a community One is to to use an unfortunate have military phrase. We need more boots on the ground in terms of Advocates and Educators that are reaching out far into the community to to educate about domestic violence to talk about services that are available to ensure that community members have the Knowledge and Skills to to support survivors. And we need that countywide helpline. One of the things that I've Merle really described it in very eloquently. So the only thing that I will add to that though is that in the planning for that help line. We have always conceived that it would have a strong assuming that we were able to obtain the full budget that we needed that it would have a strong emotional component to it. I'm so that we'd really be able to lift this up as a high-profile resource for survivors both through broad Outreach in the community as well as As more culturally specific community outreach as well. So this you know is not only an incredibly essential service but it also could present us with a mechanism for reaching a much broader swath of the community and to make them aware of the kinds of supports and services are that are available. So moving the dial, I think that my colleagues have touched on a lot of these kinds of things some of these are going to represent obviously broader cultural change that we all need to be a part of and city council can do a lot in the way of of talking up these issues and and modeling this kind of action. We really we really need is if Judy and Merle both sent to aim as much of our efforts as far Upstream as we possibly can do and it really is going to involve the the full Village of of our community to do that. So I'm going to cut it shorter than I would have just so that other folks have a chance to speak. Thank you Susan. I really appreciate all the work that you all have been doing any of that. You've been good partners to the city and two others and in doing this work and have had the pleasure. I'm hearing you speak at the dvpc meetings on really important issues in the last one that we heard from you all about is around the technology components which was fascinating to terrifying in terms of the emerging area of work. That is if it is a happening in this space around how technology well it can be a wonderful helpful tool to create efficiencies and many other areas of Our Lives. It is really being weaponized in this space of domestic violence and hearing some of the Innovative work that you all are doing was really inspiring and a promising in terms of figuring out how do we how do we how do we really think about these tools that many of us around the table use on a daily basis without without even blinking or batting an eye at and thinking about how those those same tools are used to just Memorize people and of course that means that the population of people who are causing harm is becoming younger and younger and younger and so we learned from that conversation including how youngsters think about bullying and how it's not really they don't use that word drama is the term drama. Yeah. There's a lot of us old folks different way. Thank you so much for being with us for the work that you do is just a very big. Thank you also for the annual inflation adjustment legislation. That is critical. Thank you. Of course we're having to do it now. We just got to make sure it gets into the budget. Alright, let's hear from the good folks of red SPD. Now. I'm here to tell you about the victim support team. So the VST program that provides of victim-centered trauma-informed collaborative response. That means the emergency needs for survivors following a traumatic event. VST was designed to address the gaps and services that occur on the weekends when domestic violence calls are happening in the most frequently and when Community programs are hardest to access I'm on the weekends. He's volunteer teams are called to respond to crime scenes at officer's request. The presence of these community volunteers help break the cycle of violence and allow survivors to feel supported by their Community as well as by the Seattle Police Department during the week. We have a follow-up Advocate. She responds incoming calls from survivors and from Community Advocates to answer questions about ongoing cases about court order service on firearm seizure and surrender and other crap. Justice system information via to program is part of the domestic violence unit is part of the Seattle Police Department. It has been part of spd's response to domestic violence since 1996 last year vs to program received over 1,200 referrals in addition the VSC staff responded to over 50 request from community support from the community for training Outreach system Improvement and gender-based violence prevention efforts and currently RBST program has over 60 Community volunteer many of whom have been with us for about five years or more and I start with the statistic. I think it's really important at the Cornerstone of how we approach our interventions. And also how I trained Patrol officers to utilize our program. I need them to know that we will never respond to a traumatic event or a violent event with urgency or pressure for the Survivor to make drastic changes in there. I said they're not ready for rarely does the moment of Crisis and heightened violence also correlate with the exact moment when a Survivor has all the tools and resources and information they need to act on that plan to keep them safe. So we're planting seeds for providing critical information and most importantly we're connecting them to the long-term community support and advocacy from programs like Susan's and other programs that are member organizations with the coalition. Domestic violence calls at the victim support team respond to are not only person to person intimate partner violence SPD officers are responding to multiple forms, of course of control and gender-based violence many of them are overlapping for survivors of intimate partner violence the PS2 program can help to identify safe housing options. We can walk someone through with the processes to obtain the domestic violence protection order if that's what they choose is safest to do we can provide transportation assistance. We have taxi vouchers. And now we have a contract with a Rideshare company as well. We have a hundred and sixty-five community resource brochures in 18 different languages that takes a lot of time to navigate through Seattle has a lot of resources, but it's very complicated and it's a hard process to figure out what is going to be the most appropriate for that person. We also have a lot of several we have several emergency resources such as food clothing baby needs and cell phones. I'm for people who are experiencing stalking. We can provide tools and strategies to help document future incidents and information about anti-harassment and stocking orders. We are also frequently engaging with tack or cyber abuse. And we do call this technology enabled coercive control or attack. So if you see it written like that, I didn't spell Techron any situation VST can provide text specific safety planning strategies that include identifying potential compromises and their devices and resources to help document online harassment and impersonation. See also support survivors of sexual assault by offering transportation to a sexual assault nursing exam. And we also accompany when a victim is reporting to law enforcement their assault. We support children who are abused by waiting with the kiddos for CPS at the precincts. And a lot of people don't know what kids are oftentimes waiting at these precincts for CPS to arrive for over 4 hours PST is available to assist with officers to help reduce the traumatic impact of that experience for children. Four families impacted by adolescent Family Violence, we can provide resources for parents and other family members and we can also offer safety planning that involves alternatives to youth incarceration in partnership with step up and first and when working with victims of Elder and vulnerable adult abuse, we can connect the Survivor and support a family members with the SPD elder abuse Advocate and Seattle senior service. So I have lots of recommendation that we don't have much time. So I'll start personal here is that we're asking for ongoing operational budget for the victim support team program currently spd's budget supports the three full-time position myself included all other costs associated with the Victim Assistance and volunteer training are not in our current budget the Seattle police foundation access the fiscal sponsor for my program and helps to raise the roughly $20,000 necessary for annual operation costs and victim Service delivery. So we will be asking for support to encourage SPD to pay for the volunteer training and retention expenses as well as a necessary victim services. Also a specific to a speedy were asking for additional advocacy staff for the Seattle Police Department the domestic violence unit currently only staffs to felony Advocates each of them last year with a caseload of 450 people their workload continues to expand and the structure of the program that was designed in like the early 90s. I believe was designed as a time when the population of the city was nearly a quarter less than what it was today, but it is today. They're increasingly High caseloads create a gap and services for victims most significantly during initial investigation when suspects are at large and often pose. The greatest risk to survivors will be looking at opportunities to fund a third felony Advocate to address this current need an enhanced a level of advocacy SPD can provide I will also be looking for opportunities for 1/4 VST position that can focus their work on systems improvements as for a more trauma-informed. Focus response to gender-based violence within the department I think we spoke about housing. I might I think maybe I might have a bit of an angle to that's more specific to us, but from a first responder and emergency service and referral program perspective on the weekends when Community programs their doors are shut for the most part the fact that the emergency housing has gone away in a lot of regards is is very challenging. We are relying more heavily on using motels and this again through donations through the Seattle police foundation. We're finding that this model of is putting a strain on existing Hotel business partners who are beginning to deny this type of hotel stays for the community programs that we're working with that they're using the temporary model Hotel placement as well. It's not sustainable for our city and it's not what's best for survivors who really needs a Ability to heal so flexible funding mobile. Advocacy are proving to be very successful. I it's it's like what Merrill said that yes, and that we also need to continue to expand our capacity to respond to the most vulnerable in the most pressing and life-threatening situations that we see every weekend that require immediate response. I'm recommending modernisation of our Criminal Justice System communication tools as well. The criminal Criminal Justice System remains difficult to navigate survivors are left with questions unanswered and are often confused about their criminal case comprehensive online portal could provide a streamlined way for victims to look up a variety of information including who they can reach out to for further support throughout this process connections to community programs. There is a few successful examples that we've been researching one of which is case companion in Multnomah County down in Oregon. It was built by code for America and then the Family Justice Center in New York City has also recently launched an online portal called NYC. Hope in partnership with Cornell Tech. My fifth recommendation. This is per recommendation of the recent Recent research that you're aware of. I know already come to my Mark Gonzales of the Seattle technology-enabled coercive control working group is that we need to improve the criminal justice system's response to Tech abuse including standardizing trainings and best practice as outlined in the research survivors experiencing Tak abuse describe filing numerous police reports with law enforcement either failing to connect a pattern of crime or just missing the reports of non criminal Behavior altogether the lack of a comprehensive response is re-traumatizing the survivors. We are recommending more resources to investigate and prosecute these crimes particularly at a misdemeanor level. I'm the research also recommends the modernization of the Civil protection order process to enable survivors of tecavuze to reliably submit digital evidence in to record. We've already discussed my last recommendation. They're great. Thank you. Any questions for Dana right shift over to the folks at the city attorney's office. Thank you. And thank you so much for having us here today summer and I are both here from the city attorney's office. Summer is in a domestic violence unit as a victim Advocate and I am a domestic violence prosecutor at just to help illustrate some of our work. I wanted to share a case that summer and I both worked on together. We always seek victim and put and so in this case we thought Survivor input about the case going forward and she was not right. Testify and so we made the decision to move forward without her in that case. We had significant safety concerns. It was a case that involved the Survivor being hit in the face with the butt of the shotgun. There were threats to kill she would run to her neighbor's house for help and made her a really terrified call to the police for help that day. We were able to move forward with this case without her because we in our unit. We follow the author of evidence-based prosecution model meaning we were able to use other components of the case without her testimony. So photographs of injury a 911 call. We were able to introduce some portions of the officers body worn video just to show her demeanor on her injuries on that night and it did you need the victim's consent on the body worn video pieces of the evidence or is that something that the prosecutor can decide at that is a case-by-case basis and we would make that determination whether to use it or whether we even could use it on a case-by-case basis. In this case. The Survivor did actually end up coming to court and testifying on behalf of her abuser. That was a decision that she made and we supported her throughout the process and supported her decision to do that somewhere and I both had a feeling she was going to come in and Testify on behalf of her abuser because of the other evidence the jury still convicted the defendants and so prior to sentencing somewhere and I met with her again to see her input about the city sentencing recommendation and something that she wanted was treatment for her partner. She wanted to remain with her partner, but she did want him to get treatment. She never denied that the abuse had happened to us, but she just wasn't ready to leave him or to step away at that point. She didn't want any jail time and So based on her and put that is exactly what we asked for at sentencing. That's just one example of the work that we do and we're not able to move forward with every single case that we get and not every single case has enough evidence that we could proceed without the testimony of a Survivor. Sometimes if we don't have a Survivor who's willing to testify in court, that means that we can't actually move forward with with a case and hold that abuser accountable and at that point. We just don't move forward. We never force a Survivor to testify in court or to do something that they're not ready to do. But if we're able to go forward using that evidence-based prosecution model then we will do that and try to get some accountability for the offender and I would say about one-third of my trials have proceeded forward without the testimony of the Survivor of domestic violence. And the reason that we go forward on these cases is because of the massive Public Safety Community safety concerns. I think that's something that everyone is aware of that domestic violence is the greatest predictor of future violence to that individual or within the community. We're not able to go forward with every case. One of the issues that we face is is a capacity issue a staffing issue and we have five prosecutor is my unit. We have one detective who is assisting with the misdemeanor caseload that we have and in 2018. We had 1287 cases that were actually filed in so In addition to those domestic violence cases adding an non domestic violence cases, like stalking cyber stalking harassment child abuse sexual assault animal cruelty. What that means is that each prosecutor has a caseload of about 300 cases that they're working on. Our unit is very Innovative. And the city is very Innovative. We're on the Forefront of changing the way that we respond to and handle domestic violence another victim involved cases and we're changing the way that we practice in response to input from survivors and in an attempt to hold offenders accountable and increase Public Safety, but the issue is capacity. Are we need more people? And I think that's something that we heard from everyone. We need more people assisting our unit so that we can continue to do better serve survivors and better serve our community. I'll let some more talk about the role of the advocate. Thank you, and we typically will attempt to make contact with about 3100. Survivors of domestic violence of every year so for each report that we get we have an advocate reaching out to try to reach that person and we do that because we want to find out what what do you want to see happen? We want to be able to safety plan with them and we want to be able to connect them with community-based resources as well because we know that the majority of people who interface with the criminal justice system do so reluctantly and for good reason the criminal justice system has been historically harmful to victims to survivors and a we acknowledge that so our role as advocates has to be there as a support to help explain the system to explain the rights of the victim and to assist them through the life of the case for the cases that are filed it can take 6 months to a year before case finds resolution in our court. That's a lot of time and a lot of waiting and a lot of questions and so are additional rollers to make sure that during that time the victims and put a still considered. You want survivors to feel like they're hurting our office, even if ultimately a prosecutor decides that they're going to make a different decision. It's important that a Survivor have the ability to voice their opinion on the case and that they know what their rights are as far as how to continually voiced their feelings about a case play the survivors want treatment for offenders. They don't want jail time till times can be harmful to a jail time can mean that they're not working until time can means that they could lose housing they want treatment and so the domestic violence Intervention Program is really exciting for our office because it gives us an ability to meet that need a potential to invest in change an offender accountability in a way that implements a community coordinated Community response because we don't just want to put them in treatment. We want to make sure that everybody's on the same. Page about what happens in the relationship. We need the big picture approach to domestic violence because it's not a snapshot that you see in a police report. It is a pattern of behavior that harms our survivors and our community because of that when we talked about capacity issues, we're talking about additional prosecution and advocacy staff to specifically address the D VIP program to go to those meetings to be there with historical knowledge to be there with input from survivors about what's going on continue from previous history, whether it be prior reports that were never filed or if it be a new information to the victim is sharing about pow. The offender's Behavior has changed or hasn't changed since they started treatment whethan consistency is important in investing in that program in that way is one of the best things that we can do. In addition to that echoing the wonderful work of VST in highlighting the issue of Tekken able Corso control. We are falling short on investigating and Prosecuting these crimes even if it's not a cyber stalking case DV order violation and we had about 500 last year could be a text message could be harassment online those cases require a great deal of Manpower and Technical proficiency that our office frankly doesn't have so when we are looking at ways that we can assist victims of domestic violence survivors of domestic violence. We need to listen to them and what they're saying is that they want offender treatment and they want us to prosecute these cases. They want our help and doing and keeping them safe in that way. And so when we don't do anything Put this on the line. So those are the things that we've really feel are important at this time. But we also want to invite you to come to her office and see kind of what we do and what our process is. We are really proud of the work that we do in the domestic violence unit. Like I said, I know that the system is is harmful can be harmful to victims, but when they are interfacing with our system, we're doing the best we can to make sure that we are honoring them with ignorant dignity and respect and trying to create outcomes that are separate from your traditional pattern of prosecution. Great. Thank you so much for the work that you're doing. I know it's hard work. And I'm and I think the panel today really sort of exemplifies how this is really truly a full spectrum of work, right? There's for the prevention and Recovery aspects that are certain much more service oriented and then they're there are so we're really having transformational change in our systems by changing Law & policy and making investments in those things and then there are sort of the internal processes, right so as institutions and people who work within government institutions, we have a responsibility to not for the perpetuate harm or cause harm ourselves in in the work that we're doing on the inside to hold people accountable on people who are creating harm. So I think this serve really laid out the full spectrum of the universe that we are operating within and really pleased that this is one of those who stay This is why I feel like there's a lot of alignment amongst internal and external stakeholders in terms of understanding what you need for all each one of us plays in in really eliminating domestic violence and harm within our communities. I really want to thank you all for the work that you do everyday the hard work you do everyday to advocate for represent and protect victims of domestic violence and in our city and Beyond it's really important work and and I and I really am appreciative of all the work that you do Echo and thing you like to add question one of the things I need for the for the investment, but also just given just that this is a longest. Of economic Prosperity that we had since the depression. Do you see a correlation between when things are going well economically with regards to domestic violence. it goes down and when things are in a recession is there like research that supports that or can't press that green button on the stand. There is another interesting data about what happens around domestic violence and sexual assault on child abuse during times of economic Prosperity verses times of economic hardship. What we do know is that when survivors I'm have no economic means I'm to be able to support their children then and no other options but to stay with an abusive partner then we see a increase in violence there. You know, they're the myth around I'm who's causing violence. Do you know that lifetime television kind of heat on Monster guy? Of course that is a subset of the population. That is so often. It's people who are I believe that they have seen a different they have the entitlement. They have the right to control the people in their lives and and there's a lot of things that aren't going well for them. So, of course when when there is widespread, I'm unemployment. For example than those dresses to increase the domestic violence victim is up that the behavior of domestic domestic violence victimization, but I want to emphasize that the what we're seeing around that both economic Prosperity, but also this huge gap Huge gap between the Haves and the Have Nots where so many people are just hanging on by their fingernails to their apartment, you know, working two or three jobs that for the survivors on that means that they have fewer and fewer choices to protect themselves and their children. So Investments that the city can make both in the your public policy agenda as well as in know, what are we doing to help people have living wage jobs and employment protections and safe affordable place to live that that those Investments are I'm going to make a big difference when we look at that, you know, longitudinally on the data indicates that what has reduced domestic violence over time in the United States are on the right to a no-fault divorce that economic opportunities for women and then the opportunities to have to have help. It's just because one of them going to be trying to be mindful of his just as given the role that I had for the last three months we get the economic picture and so I'm trying to make sure that this is a critical time to make the Investments given the fact that there's we anticipate a bit of a slow down. And so how does how do we make those investments in Investments and Industry because I think so much of the work that you all talk about is today intersectionality of so much of some of the issues that we talked about today. Is it to the city and is a region more specifically homelessness and you know that in this first Handout, it says domestic violence is the leading cause of homelessness for women and children. I think so much of my own lived experience with regards to my mother and how many times she was on the run and with for little kids holding her hand, and so thank you all for the work that you do and if there's anything that I can do to support the work that you do, please feel free to reach out to. Thank you. Great anything else from any of you for the good of the order here? Alright. Well, thank you so much for being with us and thinking cuz we're Pacheco for being my echo host of today. I apologize to the viewing public. We went 30 minutes longer than we had intended to but that's how much we think that this subject has a lot more time than an hour and a half then we certainly have it as a top priority here in our city and at the city council in particular really appreciate again, once again all your work in the space. So that is our last agenda item. We have no one who is signed up for public comment. Is there anyone who that did not? I cannot seen anybody dashing toward those microphones and this is our one and only item on the agenda. There is no their business before the committee, so we are adjourned. Thank you. Thank you.", "end_time": 5076.0}]}