{"format": "raw", "annotations": [], "confidence": 0.9279089501184045, "data": [{"start_time": 0, "text": "Good afternoon, everybody. Welcome to this special meeting in the state of Illinois and transportation committee. It is August 9th 2019. It's 2:01 p.m. My name is Michael Brian. I am chair the committee joined by my colleague council member take out. Thank you for being here. Especially the second meeting this week. So I appreciate you crazy space for that comes today by Kelly going to walk to the agenda really quick before I do that. I just want to know I just came from a press event. Give me a few blocks from here. And with the number of folks in the audience were there. I want to thank members of the mass Coalition including rooted in rights and the writers Union Seattle neighborhood Greenways Cascade bike club. CR Club 350 Seattle Seattle Subway in any other folks who were part of that press event in for your ongoing advocacy and we will be talking about that hearing committee meeting in just a moment after we get your public comment. The agenda today, we will have a briefing on the move all Seattle sustainably or mass transportation package followed by an ordinance related to construction of protected bicycle Lanes. This is listed for a possible vote on my antenna is not actually vote this out just have a discussion today. Also going to have a resolution on the funding the bike master plan implementation plan that will likely just be a discussion and we'll come back to that number for is a red light camera briefing to their number fives and multimodal parking resolution. That's listed everything discussion customer check his leading on that work. Thank you. And then finally we have an ordinance related to the green New Deal for Seattle. We discuss this in our committee meeting on Tuesday. I will have a brief discussion today. I was originally thinking of potentially voting this out of committee, but I'm not planning to do that today. I will talk about that item when we get to it. So unless it's an infection will go Improve the agenda Jackson. The agenda is approved. Now. We're going to move to public comment. We have about 20 folks 25-foot signed up. So when I get folks 90 seconds a minute and a half. I'll call you up to you the microphones Asuka Jack's is first followed by Ryan hacker in Philip Weiss and Yasir off rag. Thanks for allowing me to be here this afternoon. Just great to see you Michael Brian. It's important and urgent that we pass this mass transit package. And the green New Deal on Monday. It's important. We need to stop climate change. Ryan sorry, I'm running Packer and I'm excited to be here as a part of the mass Coalition really excited talk about signal policy. I know really exciting. We have a pedestrian safety crisis right now in Seattle 39 pedestrians were killed or seriously injured from January to June this year. I was here last week to talk about that. The only way to make serious progress on this is comprehensive system Exchange in belt environment 70% of pedestrian collisions happen at intersections in 67% of collisions with pedestrians happen at locations with traffic signals so that the best way comprehensive change is to have a Cigna policy the math collisions Transportation package ask for a signal policy that is comprehensive and not car focused recently there appeared at Light Rail stations. In the Rainier Valley signs highlight in the people should make themselves visible this week sfd had to lift a car off of a pedestrian at South Alaska street sign changes not lecturing. Thanks. Thanks friend, Philip. How do you my name is? My name is Philip Weiss. I live in Eastlake, and I'm part of his welcoming Eastlake and I have a little bit of extra time than I planned. I do want to say that. I really think that a couple of the items on the agenda will really help Southeast Seattle and really need it. But I also want to talk a little bit about how these things are good for all of Seattle particular items on them in the mass Coalition package relieve bottlenecks for Transit at a number of Choke points, including one at Fairview Avenue North just used by the number 70 serving Eastlake yesterday. I waited at in Eastlake for the 70 going north at 5:30 40 minutes later. Still waiting. There were these with a delays for the next 6 coaches as listed on one bus away 39 minute delay 51 minute delay 40-minute delay 51 minutes away. 35-minute delay a 35-minute delay my screen shot in their typical secondly on requiring protected bicycle Lanes in the bicycle master plan to be built as part of repaving project. There's really loud opposition to buy. Bicycle Lanes in Eastlake and around the city, but they don't speak for all these Lakers passing. The bill means that that projects get done based on quantifiable criteria or veto to the loudest the most threatening or the people who can sing the most money into opposition. So, I really appreciate if you guys would would pass. Thank you. Thank you, sir. Merlin rainwater then Rosario Medina and Jesse Moore Hi, thank you for letting me speak today in front of you. This is my first time being in the city council. I just want this package to support the South Seattle and the southern part of Seattle like biking and City and downtown. Sometimes I feel safe not all the time. But biking on Rainier is really really risky or anywhere near Georgetown Rainier Beach Beacon. Hell like we need more bike Lanes protected bike Lanes giving us like Head Start instead of cars. It's so common on Rainier that if I go forward and write a Car steering right that like like I've been on a many many clothes accidents, and it's really really scary. We need more protected bike Lanes, but I'm also here to to ask that we need to tell the 3rd companies Bike Share programs to let the the writers Park their bikes off the sidewalk. So people with disabilities can walk or crawl on the sidewalks, and it's really common to walk in downtown or anywhere in Seattle and see a line bike like blocking the whole sidewalk, and it's really unfortunate seeing that for me a really privileged person. I can just pass on top of it, but it's really really sad. Thank you. Thanks. Hi, my name is Merlyn rainwater privilege to be here today. Thanks for all of these items. I'm here to strongly support the mass transportation package and the items related to a bike lanes and completing the bicycle master plan. I just returned from about four weeks in Europe. I spent four days at the European cycling Federation some fellow City conference in Dublin and got to hear a lot about what's being done around the world to promote bicycling and then I spent 10 days in Berlin visiting old friends and I got acquainted with the young son of one of my longtime friends. He told me that he was very excited to hear that I was from Seattle and he said isn't see how to look like on eco Paradise. I mean doesn't everybody ride bikes. I said, I'm really sorry to tell you, but Berlin is doing a lot better in that regard than we are in Seattle. We don't have anything close to a connected Network. We have mass transit that's constantly stuck in traffic. We have a long ways to go before we can be the paradise that you imagined us to be. So, I hope that we pass all these measures and I can go back to Florian and say we're on our way. Thank you. Thank you, Merlin. Earned that reputation that we do have globally Zaria for the package and other South and projects that were left unfunded. So my great-grandfather was safety Toblerone, he came to Georgetown and the late fifties and during that time he was able to freely walk and bike in the drama Valley before is heavily industrialized and Sally in the last 50 years or so. My family my community have not been able to do that safely and I would like to be able to walk and bike in my community and Oliver South Seattle, but Sally and it's not safe right now was safer walking and bike paths. My community will be able to commute safely and be healthier individuals and leave a smaller carbon footprint. Thank you for your time. Are you excited? My name is Jesse Moore. I saw the Batman shirt. I see you. Zoom in on that but whatever. I see. Scraped my name is Jesse and I live and work in Georgetown that is part of the greater duwamish neighborhood together with Soto Georgetown and South Park in the last 14 years since I've lived and worked in the greater duwamish. I've seen projects projects like Corson Ellis Avenue South East Marginal Way South East Marginal Way Corridor repaving project. None of these have resulted in a single recommendation from the bike master plan being built our neighborhood still don't have a single piece of all ages and abilities infrastructure built by the city of Seattle. I'd like to see are our complete Street ordinance have some teeth. So I support legislation that would help help things get build while we're doing repaving 65000 people come to and from work every day and the greater duwamish Within the largest industrial center in the state of Washington, and we do this with less sidewalks and bike infrastructure and fewer bus options than any other major employment center in our city. It's no wonder why 73% of the driver people drive alone when I get down that that down to 51% like we say in our comprehensive plan. We need to support us safe separated places for people to walk and bike. Please some fun fun. What's in the bike master plan a safe connections between downtown SoDo and Georgetown the Georgetown to South Park Trail and make investments in the greater duwamish neighborhood spank you Next up is breathing killed followed by Matthew Lang Marcy Carpenter and then Kimberly kitchen. I am freaking cold and I'm going to keep it really short and sweet. I just want to make sure that we recognize all the people who are here today to support the mass transportation package that I don't think we're all going to get to speak. So everybody who's here to support the mass transportation package raise your hand. That's a lot of folks on a 2 in a Friday afternoon. Keep them raised for photo. I don't care in Japanese. Thanks Bree. Hi, my name is Matthew Lange and IMDb organized with the transit Riders Union. I'm very supportive of a mass Coalition Transportation package everything that's outlining that package. I myself I am primarily cop car driver because I teach parkour and acrobatics throughout King County and have to haul the equipment all over the place. I believe the physical health is key to our children's future even as physical education programs are being cut day by day is climate change continues in the air. We breathe becomes less free breathable. We must invest in almost a transfusion station and keep our bodies moving speaking of children. I just witnessed a 13 year old girl that was planning to testify today because of some of us arrested outside of city hall because of a strike message painted on the walls of City Hall the police came in a stream of a storm. Sorry if 6 vehicles and no less than 20 officers. They were acting in an aggressive nature toward this young woman 13 years old again. I heard one Jared her you can't strike if you don't have a job. That right. I was repeatedly blocking from getting her information so that I can get in touch with her parents and get the right legal support. They needed our children are scared and are acting out in the only ways. They know how they're part of the green New Deal movement. They are here in support of their communities good children. We must be we must have just our policy so that their future isn't as Bleak as it looks right now. Thank you. Marci Carpenter's next Thank you. My name is Marcy Carpenter. I live in West Seattle. I volunteer around the city the county the state and all over the country. I'm here today. Recovering from a fractured rib that I incurred from a sidewalk that was pushed up by a tree root. I think that Seattle needs to do a much better job of keeping track of the areas of town where these things are prevalent and take measures to solve the problems before there more injuries like mine. I support the mass transportation package in the other the other programs that you're looking out today. I don't want to say something about. Bike and scooter share, you can build all the parking that you want and you can have all the lanes that you want and they all are very good. They all help and I want people to be have almost Transportation available to them. If there are no consequences for people who parked illegally, none of it is going to matter I encounter on a regular basis bikes that are a bike Corral with bikes that are littered outside the bike Corral and blocking sidewalks. It's it's not working now there needs to be a geo-fenced area. Maybe something like what Washington DC has done in the Capital Area. I've been there twice this year. There were lots of people riding bike and scooter share and very very very few improperly parked bikes. Thank you. Kimberly Kimberly you're going to be followed by Jesse Simpson then gets cindrich calendar or ydrach calendar and then Margaret McCauley. So thanks for this agenda everything on it looks fantastic. I want to talk about money. Because we have to pay for all of this stuff and we deserve all of this stuff. So I asked the committee and the council at everybody in this room to keep fighting for truly Progressive Revenue sources don't back down in the face of Scare Tactics like those at the Mary use to kill the head tax. The city is so rich it is so rich but its riches are held captive by a small number of people with obscene amounts of unearned wealth and its unearned because it was a mass on the backs of the under-compensated public all of us. And more than what all that money can buy those undeserving wealthy value the unearned and disproportionate power that their wealth gives them to Lord over the rest of us and over our public institutions and policies and our very lives. We can pay for the mass package. We could pay for Seattle Green New Deal or safer streets for more and better maintain public toilets for affordable housing public education free fast frequent accessible public transit and so much more we can do that if you and we fight to take back the unearned wealth of gazillionaires and billionaires invest out well in the public that it belongs to you. I am just Simpson. I volunteer with a couple of runs finished Evancho the city's I'm here to speak in favor of the mass transportation package. I mostly get around the city by bike and I experience feelings of danger all the time constantly when you're going around biting in the city. You have to worry about right hooks last text cars overtaking and we know that people only actually get around by bike and mass weigh if we build out safe and connected bike infrastructure infrastructure that your mother or your child will actually be using that means we can't leave like 1 to block segments of next traffic as estimated. Tended to do that means we need to focus on making sure that everyone in the city can get around by bike and I urge you to build out the bike master plan as quickly as you can and save money by implementing it wherever you're already ripping up the streets. Thanks. did Cedric we're going to say hello. My name is a padre and cancer support increasing the amount of money from red light camera fines the safe routes to Seattle and physical changes that make it safer to walk and roll in Seattle to say I was on the bus with my grandma and brothers into big car crashes on Rainier and MLK made it impossible for a bus to take us to Rainier Beach. We had to turn around and go home. Please make a rose easy for people to be safe and difficult to be fast and dangerous. Thank you, Margaret School Traffic Safety Committee, which is one of the city boards and commissions and the committee is very enthusiastic about number for I believe on the agenda the red light camera money redirections. We are very dismayed in 2018 to see money from the red light camera fun be directed to the general fund and away from safe roads school. We have been mapping problem areas in San Francisco and there are many of them. So we're really excited that that might as well go back to school and we are also excited about the zero we would like to say that we think that that should go to physical infrastructure changes, which will help people drive safely use olive. Red safely, and we would like that to take privacy over the enforcement prong of the vision zero program because we feel like it's much easier for people to use the word safely when the infrastructure is in place, and that can be the enforcement. We need by then the unintended inequitable by products of enforcement that we have been advised that too often in our communities. So, thank you. McDonald's is next and then Doug you're going to be followed by Liz Dodds and then cts2 Smits. St. Thank you, and then Pauline Van Senus I'm Doug McDonald I'm here in support of almost everything is principally to reinforce with Marcy Carpenter said yesterday I sent around 20 pictures of the new bike trails in the University District all of them with no Bike Share bikes in them and bikes littered on all the surrounding corners and blocks. You can build the quote Marcy all the bike Pharrell's you want and if you do not have an enforcement mechanism that requires people to park their bikes in the bike Corrals, you're wasting your money in missing the point and not protecting the sidewalks for people who need sidewalk access. There are two other reasons that are problematic one is at the Bike Share program is shriveling which is a difficult problems and the fact that they've raised prices 60% means that the people who should be enforced against probably afford to pay because bikeshare is being priced out of the ability to be used by people of modest income or low-income and there are now I think going to be I suspect only before thousand bikes in Seattle. Do you like countless some of the rides to fight the terrorists recently? Is it a problem while I walked up from 2nd and Cherry where I got off the bus 2nd Avenue is totally block. There's a bike right now blocking the entrance to the City Hall. So you couldn't come in the Fourth Avenue entrance with a wheelchair because the jump bike is there a couple other points on the signals. We so badly need leading pedestrian indicated animals. It's a big problem. They're going to expand the program to 144 more in 5 years. Are you kidding there are cities around the country that they're doing that every year and have 2,000 LPI is in place. Now, why can't something get it done as if it were a matter of real urgency to protect pedestrians say one more thing, which is that I ride the bus all over. I rode 7 down to Graham, which is actually been stopped by the other day and rode back. I live in North Seattle. Something has to be done about Rainier Avenue. I mean, this is terrible. It's the it's the best room conditions. The transit is so slow money is being spent on things all over the city when I women priority that should be addressed by Citywide is to stop the mess on Rainier Avenue and make it a safe place to drive to walk to bikes at a convenient place to ride the bus. Thank you. Miss Dodds Good afternoon. My name is Liz. And I live in the Bryant neighborhood. So much has been done in Seattle in the past few years on bike safety and bike lines. I'm happy about that. But as everyone in this room knows so much more needs to be done. So I'm here to support the mouse package and I couldn't bring my 5 year-old and two-year-old grandsons with me, but I just want you to picture in your mind what I got to experience this morning on a nice day and Seattle as we did this morning. The two year old is on a is in the trailer behind me on my bike Hugo and Marshall is in front of me on his bike. He's five years old and there could not be a happier person in the world as his little legs go around and around and he sings to himself and talks to himself as we bicycle along. So I was your thinking about all of these great bicycle measures. Please keep Marshall and Hugo and mine. Thank you. Thank you very much. Estes Hello, my name is FPU and I know a couple of people have already talked to the problem of people in wheelchairs getting blocked by bicycles and other things along the way one thing that I wanted to add to this is a general request to make sure all the parts of the great plan have better coordination. For example. bicycle plan and Access Transportation Is one example right now, there are many times their problems are where access drivers cannot get to the sidewalk to pick up Riders because the bicycle the bike lanes are in between where they go in the sidewalk in people with disabilities that you need to access those access advanced can get through it because the bicycles get in the way. Things like that. There are a lot of parts of this great plan that needs much better coordination much better. Anyway talking between one department and the other we all Familia was roads being repaved just to be dunking them because they didn't think about the one part of the road needs to be dug for something. Please get a better coordination between different departments that all work towards God's great plan. Thanks. Jinri, followed by Claire Richards than Brett Hillyer and then Bob anderton. Well, I guess you guys still why was Neptune discovered? So you've heard that sell Transit this way favorite part of that and I like bus in particular because it's very flexible goes where you want it. So I'm like to see more dedicated lanes for buses cats like to see the Bus all the way out there now extended all the way to Broad Street and I was thinking about how they routes with that impact practically the entire door that cuz they start their head big all the queen. and Kraut Hill Greenwood all the way up to Shoreline college and all over except these three Lake and even routes to go to be like Northgate and also two more local routes that are not the not the main route that the 41 in the western air express route, so I don't see that as a word that play before I leave. Thank you Mike in particular. I appreciate it. That's the last committee meeting a few days ago that you were like addressing people by first name, and you were really friendly about the public service and public comment. It's sometimes that's not always the case that could get really out of cereal, but it was really a nice experience. It didn't we didn't fulfill put down and then I felt excluded. I appreciate that very much. Thank you. Hi, I have not been here before either. My name is Claire Richards. And I'm here as a mom. I have a three-year-old three and a half year old son and I want to cry cuz I can't think of a future for him. in the car with climate change, so I'm crying all the time because I don't know how I'm beside myself because I'm a researcher and I look at the data and like we are off on a crash course with a disaster and we are not prepared as a society. We are not prepared and we are not taking this seriously enough. This is only beginning in the beginning. I think we need to support this package and we need to support more. We need to be less reliant on fossil fuels we need to support equity and make this fair for everyone in the city. And we need to think about what is going to happen when other people in the country in the next 30 50 hundred years don't have enough water and they're coming to our city. You know, I mean that seriously people are not talking about this. But it's real. I don't need it because you look at the data and that's what it says. A bike with my son and I we have a family bike and I we are at we only go along the trails because we are terrified about going off the rails. It would be nice to make the rest of the city safe for everyone. Thank you. Brett Hillyer, I'm a civilian employee of the Seattle Fire Department. I work in Fire and Life Safety Systems compliance and I administer the high-rise inspection program and I just want to share with this chamber this this afternoon that this morning I was biking to work as I do most every day and I was driven off the road by an 18-wheeler semi truck which nearly collided with me despite me having the right of way and being in a separated bike lane on Alaskan Way South And I just want to urge this chamber to do whatever it can to implement the bicycle master plan and create separated protected bike lanes for everybody who chooses not to drive in the city. Thank you. Brad and I'm really sorry about what happened today, and I'm grateful that you're you're here in one piece mostly and I know that must be terrifying and we can do better. Thanks. Buy Apple Mitra and then f is the last person who signed up although I think maybe someone else signed up there, but go ahead, Hi. I'm Bob Anderson. I'm here as a board member of Seattle neighborhood Greenways and is the founding attorney of Washington bike law. I'm holding this Vision zero sign and mostly what I plan to do is say thank you for actually taking action towards getting us to Vision zero. We all talked about it, but it requires action to make the street safer for everyone. So thank you for having this hearing and please passed legislation that enforces it and based on our are firefighter hear one of the things that I'd like to see are protected bike lanes that are actually protected spring-loaded plastic. Whatever those things are called. Don't really protect people but big pieces of cement even though it contributes to global warming does separate physically, and I'd like to see more of that. So thank you. Please take action to make our streets safer. I thank you. Subway to fbms Transportation package and also talked about my personal experience of someone who lives in South Seattle and it's to downtown everyday right now. We still don't have a single safe and convenient route from from South Seattle to the rest of the city and I think that's definitely something that is urgency too many people in there. And also we didn't South Seattle neighborhoods that there are a lot of particularly dangerous streets and and we really need To have safer infrastructure so that people are currently walking and biking can be safer. And also the people who are currently not will feel empowered to get around by walking and biking Transit and Mobility devices and you can just have better and what sustainable neighborhoods. Thank you. Why do Robinson and then if you would like to comment please just get in line by maisel. Definition Aria, my name is Rodger Robinson, and I actually don't know too much about what you all have been doing on. This issue is already or what you're voting on today. I don't live here. I got a frame track yesterday, and I'll get back on Amtrak on Sunday because it's my summer recess, but when it's not summer recess in the city council member in Berkeley, California, I'm just here on vacation Berkeley is I think the third the Country Inn in walkability for commuters fourth in the country for bikeability for commuters, but exploring your city as a tourist that I have felt. So incredibly safe in your very protected bike Lanes admiring the dedicated bus lanes despite Berkeley's numbers. It's clear that Seattle you are leaving the country in Mobility infrastructure, and I just wanted to congratulate you it's hilarious. I was delighted to see that on this entirely random day that I decided to stop by City Hall. Starting in 15 minutes to do even more on these issues. I'm really impressed by by all you been doing and I would align myself with the incredible activist here today demanding that you and the fight against climate change could first land mostly just here to congratulate you and tell you to keep it up very good to meet you. Nice to meet you where we we try to schedule Friday afternoon meeting is not just about the kids but for tourists to come through and visit. You know Seattle as soon as one of the safest cities not just in the country in the world and we continue to have way too many fatalities in serious injuries, despite being one of the best and frankly the the date of this year's shows a significant increase over recent years. So there's a lot of work to be done but it is nice to hear from folks from another city saying it did feel like we're doing well which be reminded but as Merlin said earlier some of the people sometimes the phrase is a little more than we actually about to spend some work to do that also want to just mentioned we're passing a green New Deal resolution on Monday moving tired towards the Climate pollution-free City by the year 2030. And one of the things we're going to be looking at is prohibiting natural new natural gas hookup switch you guys did about a month ago. So I'm really grateful for your your city council leadership on that. I believe the first in the country to do that. So, thank you. All right. Get yourself and have you sign it after you keep coming back to Seattle and grateful to be here. I'm grateful. We were able to get rid of our car and we live fully car free we walk we bike with us. I would love to buy tomorrow with my kid, but I'm nervous to do. So, I understand the way as many of you know, so I would love to see you more of these things get past get funded and be done so quickly. I also have to use Mobility aid from time to time. So I understand what it's like to try to walk on these sidewalks when they're broken up and I can only imagine what it must be like to have to deal with these bikes everywhere. So I encourage some Creative Solutions to these types of problems and I would also ask that Seattle work harder on getting these sidewalks in better condition and getting sidewalks throughout the city and places where there are don't exist. So thank you for the work you've done and thank you for continuing to do that work and let's do it as fast as we can. I just asked you to sign in when you're done. And then David there are two folks actually been in front of you behind you. So just Savings in Anna right through it with a bunch of national folks who are trying to say is that called routine accommodation. I said that sounded like a crappy hotel room inside. What are you got and I said well and we were thrilled back in 2008. I believe it was a big city to adopt a complete streets ordinance. I was a little bit chagrined when I joined The Pedestrian Advisory Board several years ago the realize that while we do a pretty good job of auditing for complete streets. We don't do a great job of the funding and and sticking to the solutions that are recommended through those complete streets audits. So I'm really encouraged to see some legislation to put some Jason. Complete streets ordinance as somebody was on The Pedestrian Advisory Board and work on The Pedestrian master plan is also been frustrating to see that plant along with the bike master plan transit plan another of our modem plans. I get short shrift often when the political winds blow against something and it feels that someone said earlier the loudest voice for the most money voice tends to tends to provide. So I really appreciate your your taking these steps and I thank you very much for having this hearing or meeting. Hi, my name is Bob and I'm a Seattle light and I live in the Ravenna Wedgewood neighborhood and was part of the safe 45th Coalition. It attempted apparently Feedly to maintain the original design as originally and since you don't have a lot of great leadership in the mayor's office, I think this will give more teeth to maintain bicycle Network for the city which is important for climate and for transportation and Provisions or something. Hi, my name is Matt Lowe. I also I need a satellite but just moved back here about three years ago and councilmember O'Brien one first. Thank you for your service to the city and just all that you've done pushing on these efforts Ford. So cuz she used to be the type of person she lives up in the 35th area and she's beautiful person. I complain about losing parking spaces and things like that, but I got on the jump bikes and she got super excited about that and got an e-bike and is now the person that like has a meeting on the east side or down in soda and ride your bike there vs. Driving and like I think the just like the level of the fact I like ebike store getting cheaper and more affordable and accessible for people helping people older ages that may not be able to bike normally be able to tackle the hills of Seattle and things like that and get out of their cars. And so I don't know I just like a bummer for me because like she'll go up 35th and like we've seen all the videos of 35th and stuff like that and that's just one example Turn the city, but like to have people you care about who like super excited like she like takes selfies and sends them to me if I cry on the 2nd at bike night. So cool, but do not have those like facilities available in your neighborhood, especially in South Seattle. I just think that everyone should be able to if they want to get out of their cars feel safe doing that, so I had four times. So would love to just not have drivers feel so aggressive. Thanks. Hello, my name is Leah bow and every Friday I come to sport fight is for future right outside the city hall from 1 to 2. And this never happens usually but today I saw a 13 year old arrested by the police in a very aggressive and violent Force perfume for her future. And I support them every week and these kids are very scared for the future. That's right. They are compelled to come here every week. So please do something. Thanks for letting me speak the other day. I was here and I mentioned the Heatwave that was reaching on the Greenland ice sheet. And I hope you don't all the news media is speeding in the kids about how the climate change is happening and we're not really changing their consumption patterns. We're still consuming at like you note white or 1.7 x. I'll have to figure and it just seems daunting. I should think if you're a kid, I'm not to get in trouble with the law and use your talents and away like writing letters and like joining a club or making a cloud with your friends would probably be the safer way because when you get in trouble with the law then your school habits changed and there's there's actually writing letters is more effective in you can document it. So even though you hear figures like oh I heard on Democracy Now like there's three soccer fields in Being cut in the Amazon rainforest. So then I started thinking like did they name an Amazon? Because that's going to be the new Amazon in the other ones. Just going to be all chop down. It's like all these thoughts come into my head and I think we've got to cut. No, I don't like that Vision like let's get that Vision 20 and let's make the vision like we map out the whole Amazon and everybody can track it on their phones, and we can watch it in real time in any company that touches it will all know about it, and we'll all send him a letter, but maybe that's in the year 2100, but for now the best way to cut back is through Green Transportation is so that's why I'm so lucky to be here, and I know all the kids wish that they could be here, but they're in school and they should learn about this in school and bring it home to their parents. Thank you. Thank you all for your topic, today. We will go ahead and close public comment and move into our jenda. I'll provide I will invite presenters forward for a first agenda item tonight in one move. All Seattle sustainably mass transportation package briefings Monfort. You may sit wherever you like. Why don't we start with just a quick round of introductions and the key if you want to go first. Grand Theft with Cascade Bicycle Club decanter with Seattle neighborhood Greenways. I'm Brittany Bush bolle and the chair of Sierra Club Seattle group. Katie Wilson with the transit Riders Union on a zebra. It's with disability rights Washington contractor rooted in rights. Andrew kiddo IS350 Seattle welcome everyone. We have a presentation today. And so whoever's going to lead off. Why don't we jump right into it? Okay, let me be your Katie supposed to start this off. So yeah, so patients that are part of the mass Coalition and basically mass or wishes remove all Seattle sustainably mask came together last fall and partly feeling the urgency around the climate crisis that so many people have spoken to today in public comment and also frankly with some feelings of consternation that Transportation projects in Seattle. We're not getting done and so over the past almost year and we have been building relationships organizing and we have come up with this set of Transportation programs or policies and proposals that we think can really make a big difference this year. That's what we're here to talk about. And am I supposed to keep talking to text Andrew Britney to talk about why this is important. Oh, yeah, I guess I can go next to my name is Andrew. The climate crisis is indeed a dire emergency Greenland ice sheet is melting an unprecedented levels European Heat Wave never-before-seen arboreal for aspern ETC. The list goes on and on everyone is reading the newspaper knows about it. And here in Seattle Transportation mostly cars is responsible for the Lion's Share of climate pollution. We have to change and then mass transportation package is an excellent first step. It is in fact, not an option for my perspective. It is necessary. And yes, we are actually planning on leaving our children unlivable planet. The transportation package is not bad news. It's like it's not bitter medicine. It's actually quite the opposite bad at by adding bike Lanes bus lanes improving sidewalks and cross was not only will we give people options but we will slow traffic down swelling traffic is increasingly recognized across the country as essential. Not only for the incredibly important goal of reducing fatal collisions, but also because it'll improve our city. Most of us speed around Seattle at 35 or 40 miles an hour drivers speed through space rather than experiencing a place. People using transit or biking they experience a place. When drivers speed through space, they are disconnected from their environment. They form almost no attachment. It's just another half full parking lot at the fast food restaurant. When the bus rider Works to their stop they experience a place. Appreciate the new bench or the trees that have been planted for shade they chat with the neighbor and smile at the bus driver places or what help people form attachments to the city. They make cities memorable and maybe even cherished. And let's face it with videos like Seattle is dying. Seattle needs some loving. We need to be fixed by the magic of slowing down. And this will not be easy behavioral change is hard to get all of the benefits of the mass transportation package. We need our leaders to step up. And I'd like to address Jenny. Durkan Jenny. Please urge Seattle residents to get out of their cars and instead to walk ride bikes and take transit explained that we must do this. If we want to leave our children a more livable world and a safer gentler and more loved City. I will never be that poetic but I would like I would like to read it when Andrew said as we know transportation is the largest source of emissions in Seattle area 85% of those emissions come from car. So we really do need to be back in with a sense of urgency to get people out of their cars and walking by controlling. However, we can but also this is a policy that people want this is a response to public desires and needs a national study from 2014 indicated that 53% of Americans want to bike more and 60 friends. 60% of them are worried about being hit by a car. If we have protected bike lanes and save them for structure people will get out of the cars. They will use bikes. They want to people use buses if their frequent if they're reliable if they don't have the schedule in other buses going to come and pick him up and take him where they want to go without being sitting stuck in traffic behind a whole bunch of cars and is really simple things. We already know that we can do to make people's lives Nicole your wife's easier on a day-to-day basis as well as a long-term climber perspective. I also just want to add the two other points up here the thumb safety we heard a lot from public, today. We had a major death on Rainier Avenue earlier this week and we know from the statistics that that as you mentioned earlier deaths in serious injuries in Seattle are on the rise rather than on a decline, even though we have you stated Mission Seroquel, and that also that you know, the impacts of unsaved streets are following does abortion and Leon are low income communities and I can use a color on a disabled people and on the elders in our community and so Just wanted to put that out there as well. Thank you. Okay is our this is supposed to be doing something. Okay, so I'm going to ask you to use your imaginations. I feel like that's like a marker whether you're old or not. So this imagine so far is that you can empty weight between 60 and 80 people per bus and the little counters go up and they show great demonstration of how important the decisions that we make about allocation of Road space are to efficiency of our of our transportation system. So we get to the point where we have frequent fast bus service a dedicated bus lane just carries astronomically more people. Elena of cars kind of creeping along and so one of the things that that mass has been calling for is for the city to really Step Up prioritizing our road space for really the most efficient Transportation modes and public transit being being one of those. This is from Los Angeles next slide you want to come in and that your description was wonderful so I can visualize what's going on there, even though it's not moving and often will hear from folks. I'm frustrated cuz they'll see a bustle and it's empty my mother stuck in traffic and yet the reality is even though there's not a bus there not backed up bumper to bumper when they're moving through every few minutes. They're carrying so many more people than those congested vehicle. And so they to meet that goal despite with sometimes people might Intuit their intuition Metallum, absolutely. Where we make Transit really fast and reliable more people choose it more people use it and then it becomes an even better allocation of row space. So we just need to get that started. So there's three things in the mass transportation package that had to do a Transit one is what we just talked about creating a robust network of priority bus corridors connecting Seattle's neighborhoods. We also want to accelerate the rapidride corridors Promise by the move Seattle Levy and part of that given the funding challenges is to really expedite some of the improvements that can you know you before we have the the flashy rapid ride buses that can get the existing buses on those routes moving faster. And then also just Expediting a planning process is so that hopefully when more opportunities for for example Federal funding come out, we are prepared to take advantage of those and get them back on track and then finally some kind of High value for money investments in Rider experience upgrading bus stops and really making the experience of writing Transit comfortable and safe for everyone. And finally, this is a map that we put together of 20 places in Seattle where we think that dedicated bus lanes and other bus priority Investments, like signal priority can really make a huge difference for for keeping things moving. And so we are hoping to be able to work with the council and with us. And with the mayor's office to to make to make these improvements happen. So there are four pieces in the packages while around biking we know that safe bike routes are completely critical piece of any trendy Urban pacification system and that protected bike routes make it safer for the people who are already biking. They also increase the number of people who are biking total and make the entire Street safer for all users including people who are walking and taking Transit and driving since biking is an expensive. It's also incredibly reliable option for people who don't own cars weather for economic or climate reasons particularly, if you're moving around late at night or in neighborhoods without gray Transit, so these four pieces of the first is to find and build key bicycle routes particularly in those connecting Seattle said the neighborhood's which we heard a lot in public, today and I'll be talking about that piece little bit more later to improve the maintenance of the existing bike routes. This is Public infrastructure that the city has invested dollars in over decades and many of those routes are hard to use or unwelcoming or sometimes completely obsolete or disappeared. The maintenance program a test. Is currently complaint based and so it's very reactive and it also results in unequal distribution of Maintenance across the city where communities where folks are really comfortable with approaching the city and demanding that things happen get better maintenance and for communities who have language barriers or just trust or less information about how to navigate to Safety Systems end up without any maintenance at all. And those are the bike lanes and end up disappearing or you don't be coming full of glass or foliage. So this request is is basically to ask a spot to draft some new maintenance standards for bike routes that address those needs in a systematic and proactive we've seen policy is across the country. Do this effectively it's about repainting and replacing bollards. They get hit by vehicles, but it's also about general maintenance like cleaning and drainage and clearing of trees and snow and everything like that. And this is a piece that we've been in conversation with s. About for some time now and they recognized me as well and I are excited about this but it's it's a lack of communication between planning and operations teams and just needs a little bit of a political push to actually make it happen. The third item is to require that plan bike routes be built with overlapping repeating projects, which will also be talking about a little bit later and the fourth is to measure what matters and make decisions based on more than just vehicle delay right now. When s. Is evaluating a project the different options of designs for streets are measured by how much each option will delay car drivers using what's called a vehicular level of service and it's getting a little bit technical but we're asking for us to develop a new analysis that better aligns with the city's adopted priorities and goals and with our little plans and basically incorporates metrics that will give a more holistic view of what's happening at that intersection or along that street Corridor including measuring the safety and efficiency for people who are walking and rolling and biking and didn't Transit and I just Point out with that one that what happens when the city defaults to prioritizing car traffic is that you're more likely to be protecting the needs of people with higher incomes and white folks. And so we also wanted to require a stop to conduct a raise in Social Justice initiative analysis for all projects over two and a half million instead of the current standard, which is 5 million. Pinkie Pie this is a map of One of the pieces that I sort of brushed over as the the 2019-2024 bicycle implementation plan routes that are currently unfunded and you'll notice that most of those are in the South End. And I'll just point out the district 2 which is a lot of that South End area right? There has the highest rate of traffic deaths in our city by a really high margin and so is desperately in need of some Safe Streets projects. Alright walking and rolling. So I think you've heard in some of the testimony today about how important walking and rolling are to our transportation system. Most of us are pedestrians and some moment of our day and for some of us it's how we get around and it's their Primary in the only way we are able to get around the city. And so I just thinking all of this analysis is important to remember that there are Folks at 12.8% of the population of Washington state has a Mobility limiting disability. If you add to that, you know folks who are too young to drive too old to drive undocumented can't afford cars choose not to use cards for environmental reasons. There's a lot of us out there that are pedestrians and when you look at the state of our sidewalks or the lack of sidewalks or the lack of other of safe intersections in our city, it's it's shocking, but it's also probably Fact that those of us who can't drive are not the folks at the table making decisions. And so we need to make sure that our voices are part of this process. So some proposals are going to talk about today in the mass transportation package include sidewalk repair as we seen and heard from Marcy and crumbling sidewalks are a safety hazard in Franklin embarrassment in a city with so much wealth right now that there are sidewalks along near that are in the same disrepair that the ranids is embarrassing and dangerous and blocks access for those of us who rely on on sidewalks. And so it's the responsible for maintaining sidewalks, but that's not enforced in the so we are asking device development improve sidewalk repair program. That actually looks at what other cities are doing like Bloomington, Indiana or Denver and is able to have Property Owners pay based on on their wealth and income and so that the city that can subsidize then folks who don't have the resources to repair individual sidewalks that we can ensure that our place where where they're safe and accessible. We also have in our proposal around asking the city to look at new funding sources for building out sidewalks 26% of our city blocks Citywide black sidewalks entirely and it's not just small Greenway type neighborhood streets. There are major are to Ariel's 1800 block of arterial streets inner-city blacks sidewalks and You can guess you know where those those fox10tv they tend to be for the route away from and the wealth and the powers that can make that happen. And so we need to funding sources to try to fill out our side what networks it's it's not it's not accessible and it doesn't create the sort of city that we want to have on a can you repeat that number again? 1800 1800 block Saint arterioles not everyone and he wants to walk along arterial and there are people who do that now, I'm sure because that's the only option. So the third item appears to adopt a single policy that prioritizes people currently most of the the signal decisions that I thought makes are done. If I gave stasis depending on the intersection the national Baseline standards that they reference are very heavily slanted towards favor and cars over any other uses on the street and what happens if the people end up waiting forever just to cross the street people end up getting confused when the light turns green for cars, but not for pedestrians. Sometimes the light comes on but it only gives you a few seconds to cross and that is especially challenging for people who are in wheelchairs are using other Mobility AIDS folks are blind and low-vision elders and people with small children find a toddler's across the street or carrying large bags challenging. So we're developing a single policy that reflects our values and goals of the city to make it easier to walk and roll into bike and take trance around our city. I'm in this is another piece that we've been in conversation with us. About, but there's a lack of urgency and the process has been incredibly opaque and difficult. And so did we just want to ensure that this happens in a timely manner and that the process is happening in collaboration with the modal advisory boards that have felt a little bit distant from the decisions, even though they they care a lot with the disability rights Advocates special Advocates and with Council staff and public input. The 4th part is to build Park your bikes and scooters out of pedestrian spaces and in the streets and that's another piece will be talking about later and V part up there is to ensure that our kids have access to Safe routes to school. This is a recommendation of the school Traffic Safety Committee, which we heard from earlier as well and during public comment and it's a recommendation to for the district to hire an active transportation coordinator in this person would be overseeing programmatic in infrastructure improvements make it easier and safer for kids to walk and bike to school right now. There's nobody within the district. Focusing on those things and any kid who lives within 1 or 2 miles depending on their age of there school on is not served by the school bus routes. And so when the school district focus is entirely on school bus school bus thing as their transportation department, they're leaving behind thousands of kids and it tends to be a lot of the low-income kids who are not able to have their parents drop them off in vehicles at school and some of those kids are, you know, Crossing arterial streets with no save crosswalks or signals. There's roadways without sidewalks like I was speaking about and there's just other unsafe conditions out there. So the task here is to provide funding for an active transportation coordinator at the school who would be overseeing the crossing guard program administrative assistance for walking and biking School Bus program those programs. I only exist in some of them are athletes schools that have a lot of parent volunteer energy to keep those things going year after year. They would also be handling the transportation related complaints and action plans that are filed by the schools that are currently off ignored and just making sure that that this support is happening across the city and not only at certain schools that have the energy to keep those things up. Okay, so that's what it looks like. When does an important issue of why now peace anything coming out of the move Seattle Levi reset? We saw the dramatic. We seen the dramatic scaling back of projects and fun things. That would make it much easier to walk by Converse. And so the other package obviously includes priority funding asks, but it also think in some cases. Yes, that will make it easier for people to get around walking by controlling fussing. And so that's kind of the blend hair of policy reform and Asks, but that's policy reforms that do not require but yet at this moment. I think that pretty much sums it up. I'm so I guess I will say is just that incredibly grateful to the lead on these first pieces of legislation that are part of the package and we are thrilled with a lot of support. We've seen over the last couple months as we've been developing this package from from the community to be advancing all these things this fall. Thank you. Thank you all for your ongoing working for being here to present today in Freon going out because see, it's I say that this everything you're asking for is consistent with what the city has been saying. We want to do for a number of years, so there shouldn't be any surprises here and yet we know that it's been challenging to move not so much in the direction of those. Sometimes. It feels like that, but at the pace at which we need to go to address people's concerns it erased here until I'm optimistic that we have some piece of legislation coming up later today and later this year. It'll be a piece in that direction, but we will I continue to have a lot of work to do. So, thanks for your advocacy. Thanks for everything. I think a few of your sticking around for agenda the number to the so we'll invite for Zehnder's or I guess it's everyone's here for two and vitamins record discussing Council Bell one 19601 and ordinance relating to the construction of protected bicycle Lanes requiring requiring major Paving projects to include protected bicycle Lanes as identified it in the city of Seattle Bike master plan and adding a new chapter 1582 the Seattle municipal code. Why don't we do I know you've always used to self adjust for the record and for the Seattle channel to get introduce yourself. Once again, thank you all for being here. So this is a piece of legislation that worked on in collaboration with you all another two new members. It is frankly in response to a decision earlier this year fairly late in the process for repaving project on 35th Avenue Northeast the design original design included a protected bike lane up there that was consistent with the bike master plan. It was my understanding until the very last moment. That was the plan that was going on. There was a process is there is with almost all these projects. My view is that process is designed to figure out the specific Design Elements, but how to make it work now whether we're going to make it work or not and was Disappointed when the department the mayor of chose to reverse course and that one and complete the paving Project without installing the previously agreed-upon protected bike lane this piece of legislation on his model them for heart. After what came out of Cambridge Massachusetts earlier this year and we heard in public, today is intended to in my mind. I said, she close the loophole that didn't know that really existed. We do a lot of work at the city Advocates to a huge amount of work as they work on these motor plans. I'm to figure out what are the Investments we need to make whether it's for bikes pedestrians Transit afraid as we move forward and the most cost-effective way the most efficient way when it comes to bike infrastructure and head infrastructure and Transit infrastructure that matter to do that work as winter already tearing up a road because we're doing the repaving job. In fact, that's I forgot terrapro Tandoori Paving job when we put it back together. We have a choice of how you want to put together and the cost difference between the varieties ways of having me put it back together or very minimal compared to the overall cost of it. So at that very moment. We have the opportunity to get something right by today's standards as opposed to continue to double-down we done wrong. And so that is the moment really frankly insisted. If there is a design element that is already been agreed on his part of the plan when that project is being implemented. We need to ensure that that happens now there's a place that is obviously a place for a lot of community input to figure out what that specific design looks like you know, how did the crosswalks work who you know, where does it take her in and out? But the reality should be that gets constructed if there's something has changed since the bike master plan was adopted if there's a new piece of information or there's new technology, whatever we do leave room for the Department to come back and make their case as to why they think we need to switch cords to reverse directions or whatever that is, but it's not simply a discretionary decision that someone can make based on something I did. Sometimes it's hard to tell if you want to spend a second to fill in some of the details that I probably glossed over. Yeah, I think at the heart this is really about creating transparency and accountability. We have amazing aspirational goals for vision zero for our climate change goals, and we have an amazing bike master plan that's been louded around the country. It weren't for safe infrastructure. That's great for all ages and abilities and Now's the Time to really deliver on those plans and there still is a way to be transparent and accountable if there's a reason why it doesn't work to put a protective eye clean on that road, but we really need to be moving forward now as we heard and public comment now is the time Picking card turn it over to you all to make some points about this or add any comments or feedback to this list specific piece of legislation or more broadly what we should be doing as a city. You know, I think speaking to this legislation, you know as we look at the bike master plan on building connected Network CN sulfur is a filleti's was going to provide for people who don't even see themselves as riding a bike right now. I mean, I think again public comment several people spoke to this the need to build out a bike master plan and I think this feels like a very sensible Common Sense piece of legislation, especially as reference to move Seattle reset, you know, what what would I constrained and transportation funding right now and leveraging Paving projects to build the infrastructure that we plan to build? Makes play Common Sense. I think we so often when we are we must Implement these plans, right? I think it's easy for us to often stop talking like that. But when we repaving a street we're redesigning the street so it works but today when we are by clients. Yeah, we riding bike Lanes Castor on the plan, but it's so much more than that. It's not just about being incredibly important to give people a safe place to bike. But it again much more than that. You know, we look up bike Lanes the reset shows us that I'm adding bike Lanes to a road is data shows. It's the most effective way to calm traffic speeds which reduces the number and What's the weather looking for the seriousness of collisions between pedestrians on sidewalks and faster moving vehicle is really a win-win and these are the times that we need to be making the changes and then you know, I think the other piece to say that says about accountability we have these great plans and again these plans and not just for the sake of having his plans what it when they come down to is how we going to rebuild off streets and so making the connection between the plans and the projects on the ground. I think of this ordinance will will provide the accountability and transparency that the people said the people understand how those decisions are being made. That's everything. I might have said but I do also want to just reiterate the fact that this is an ordinance that's it's emphasizing fiscal responsibility of you know, combining construction of these already planned bike Lanes with repaving projects is saving a city the money of tearing that street up again and do it and doing it as two separate projects and it's saving the neighbors the ordeal of having those construction projects in front of their house twice and it just makes sense as City policy to be combining these things. Check out so you know, I thought about transitioning from a car ownership to my car early on the experience. How you live in Wallingford right off of 45th and decide to ride a bike on 45th and took me one time before I was like never again. I put in my life my own hands and I want to move two blocks north of the galmont. I used to work at the University of Washington and being able to ride the take a safe route to the Gill man was probably and the wind breezing through my hair was part one of the best experiences with a helmet for the helmet. Is my mother's experience I say this because I think it's important when we think about the reflection of our Progressive values of the city about it being a good governance for us to do this when it's smart as you often say that you're not doing work on the street because we have all these plans and all these plans. I think how we can best cornet time is best at the time. They were doing the work and as we think about this that the future micro Mobility options like scooters, you know, we want to create those safe spaces for those microvilli options. We've had opportunities to hear about micro ability the future of transportation and what these microvilli options may be. So I am fully supportive express my support in terms of us being able to do this and move forward because I will say this because I'm sorry I missed the last few minutes of the last presentation. Because there is no bike lane in southeast Seattle, you know, I want one of my own personal priorities for the budget and thinking about what we can do to move forward is what we can advance in terms of a bike lane in southeast Seattle during this budget because you know, I'm cognizant of the fact that I happen to be in one of those Transit rich areas in Northeast Seattle and Seattle one of those privileged neighborhoods and most people who look like me don't have that same safe route, and I want to ensure their safety as well. So And make a really good point. Also, I mean the data shows that 60% of people in Seattle want to bike more than they currently do and we know that the number one reason why they don't is because they're concerned for their safety. And so having access to a safe eligibilities bike route immediately close to where you live and where you're going makes a huge difference in people deciding to use their bikes more. Thank you. Cancel, my mom thinks Clara. To buy really appreciate all the work that's gone into this ordinance. I I think that it covers all the bases. They were trying to cover on this again. This doesn't outright mandated there still leaves a little bit of room for folks to do some analysis better requires a process if they want to change paths in a release. It's the clear expectation that we're going into Community Center repaving project. This is what's going to be expected and their projects, you know, we've been doing this for a few decades and we know that there's often resistance. What we find is usually after the projects done things work out and I just find their work out better. I seen recent data from Vancouver BC that continues to show how much better businesses are doing that despite those very businesses being originally upset about losing parking in a bike lane going in front of business or now. They're their sales are up and they're advocating for more of those that safe bike infrastructure cuz they see the results of it and we have similar instances. Neighbors in Seattle where the transitions happen if we just need to make it clear going forward to this is what we're going to do and what's way in about how we do it. But this is what we need to do this today. I would like to hold it till next Friday and thrown at that point that'll give you know that they sent that that I was want to review legislation and giving you feedback we can do that. Our last full council meeting is before the August recess is on Monday and we wouldn't have time to get it to that meeting anyway, so we'll take another week in case folks have other comments or feedback to give and hope to pass out of committee next Friday and then it was beautiful counselor first council meeting in September which breed of September 3rd. Thank you all so much for that and we will move on to agenda item number 3 we have some of the same presenters here, but would you read that into the record? 24 bicycle master plan implementation plan requesting the mare commit to building out the bike master plan and identify the funding for priority bicycle master plan projects in America 2020 proposed budget discussion. Resolution is really focused in response to the 2019-2024 bicycle master plan implementation plan, which lays out of map of where of transportation is planning on designing building a protected bike Lanes as well as neighborhood greens as a part of this process and in 2018 for the 2019-2024 place, which was very smart looking at we could actually find with the movie at 11 a funding that we have and one of the things that was kind of a key criticism of the implementation plan is that several key routes particularly in South Seattle are left unfunded and they're kind of in this place of pre-planning and we aren't really sure when they're going to be designed and built we would like to see those plans committed to getting their funding and being built the course of the Moon, Seattle. So that way after the Levee is complete. We will see complete safe all ages and abilities routes through South Seattle. We also have added in specifically highlighting to pieces in the center city that feel really important to fund as well. There's a section of Alaskan Way that will connect the Elliott Bay Trail to the Waterfront project and we feel like that's a really important piece to ensure is funded and completed. So you have a nice seamless. We know a large employer is coming in in the Inner Bay Area and will be great. If more people could bike to that large employer. The other piece that we have highlighted is a way to a protected bike lane on 4th Avenue. This was identified in the one Center City plan and what has been proposed and implementation plan is a one-way protected bike lane on 4th, which relieves southbound Riders out a lock if you're trying to find a an all ages and abilities route to head to places like City Hall and the Civic Center in the library. destinations that are not accessible by a safe route author of the key. Would you like to make any comment about this? I just wanted to expand a little bit on something that Kelly mentioned briefly that this this is really in response to a lot of the community input that s. In the city receives last spring when this plan came out. Funding for these these unfunded ballots in the South End in the center city was the highest state of priority of the Seattle bicycle Advisory Board and at the community outreach meetings about this plan and not just in the south end. But Citywide this was the highest state of priority and a huge advocacy push at the time. And so Having those routes remain unfunded is is a serious. Disappointment for a lot of people and you know the there was a cover letter of that plan at the time that the mayor and S. Stated that they had every intention of finding funding fees routes into push for their completion. And so we're really excited that this is all coming together having the council agree with that. And we can all work together with the mayor and with us. And this Council to find funding and be able to complete those routes. It's it's absolutely unacceptable in my mind that we could find ourselves six years from now at the end of the move Seattle Levy with no knowledge of Natalie's infrastructure connecting from the south end to downtown. And so this is kind of a non-negotiable in my mind that we have to be able to find this Sunday at some point and be able to construct those routes. Resolution and counsel absolutely and locks about needing to find funding to to complete these projects that have a long-standing priorities of the community stand at the matter of Wednesday. Is she announced the sale of the mess of Mega Blok and with a 16 million dollars and multi-modal transportation funding and you know what I look to both the Maryland and counsel during the budget process to stop funding some of these projects and I think that both sides of the fatherless dial, you know, both said the council I look forward to supporting in any way that we can but really feel like things are moving in. This this resolution is a piece of that. Stuff for the public to reminder that the earlier we talked about the decision not to build affected by Queen on 35th Avenue Northeast in that decision was made roughly concurrently with the update to the bike implantation plan back in if it was March and then the timing of both those was really unfortunate and it held on the sense that I'm the city doesn't doesn't care about implementing the bike master plan and I think the invitation plan is proposed that point I believe was the draft. I'm really came across the communities with with a big thud to ask. Credit. They work with Department of neighborhoods in rapidly did a bunch of Outreach probably half a dozen Community meetings or close to it over the course of the following six weeks. This is under the time that almost brand-new director for us. And they came back to the committee on my believe in June basically report. Talking with a hard and kind of revising kind of their approach there and well, I believe from my sense of these the the tone of the approach felt a lot better A substance that it was still short which in part I think reflects just some funding realities of their run into that. We heard and public comment seems like whenever there's a funding shortfall the certain type of projects they could cut and certain neighborhoods in other things keep going forward and that felt disappointing but I appreciate you mentioning the pending sale of the Mercer Mega Blok. What's the mayor announced earlier this week? And that's really exciting because of the mayor has indicated that she would like the council to put over 15 million dollars of revenue from that towards projects that are these types of projects. And so that is something that I want to one. I would love with this resolution and be able to make it clear. The city's policy is that we are committed to these projects and an even if the funding reality today is that we don't see a path to do it. We will find the funding to make this happen and then during the budget in the coming months. We have an opportunity but most immediately to live up to that commitment because there are some funding opportunities and clear as you said the idea that we would complete this nine-year Transportation package and still be kind of where we started when it comes to Safe browser folks living in southeast Seattle would be a failure and we have an opportunity to prevent that from happening really need to move swiftly. But thankfully there's any things are aligning that be great if you have any comments or thoughts on this resolution I mean, I guess I was just go with everything's been said on the table again, you know, I think that was regards to the Fourth Avenue bike lane project, you know by Maroon June me it's ever going to do it. Let's do it. Right and so I think it's 4th Avenue bike lane project is a good opportunity for us to do right and again right in the Heart of the City. And so I want to make sure that we do it so similar to the last piece of legislation. I'm going to hold this in committee for one more week. We'll have a chance to hear any more comments from both serve people have brilliant ideas of how to make it better. We can take a look at that and then my hope would be next next Friday morning when we have a special committee again about the resolution out of committee and it would be before the full Council ideally on September 3rd. Thank you all for your work on this and I think with that excuse you all and move on to agenda item number four. This is a red light camera briefing. Calvin is coming Ford. Welcome, would you like to introduce yourself as a chair working out right answer correct? Miss statements that make it last year will the city for a number of years has had a red light camera program in the city of Seattle and a number of years ago. We as a policy said the 20% of the revenues from those red light cameras would be dedicated to school safety projects last year in addition to the red light cameras there speed cameras in school zones, which are authorized by state law and required by state law that all revenue from the the schools safety cameras goes to school safety projects last year in the budget the I can't remember exactly who's supporting a budget that Temporarily suspended the 20% of red light camera money going to school safety projects for this fiscal year 2019 and proposed for 2020 and then in part of that I deeply was because there was there was more Revenue than we had expected on the traffic safety cameras the speeding cameras in school zones, but a lot of folks were disappointed myself included about you that I voted for walk back on a previously made. The revenues came in the projections in in October came in about 2.1 2.2 million more than was anticipated for each year and settle with those additional resources. One of these decisions was to suspend the contributions from the red light cameras, which was about $900,000 a year. So it was still more money in the school zone camera fun, but the resources from the red light cameras were the very back to general fund. And as we heard today least from one commenter and public comment on the school safety board School traffic safety board have that right? There are a lot of safety programs near schools that could use some funding so it's not like we're out of projects to do their what I'm interested in doing in this conversation and then I'll ask Calvin to walk through kind of what the soreness would do is to restore the commitment from to dedicate revenue from the red light cameras starting in 2020. So we will still have lived through one year of suspension of that rule, but not two years my proposal at the moment would be that we would restore the 20% of Revenue that would be rededicated to school safety projects and then add an additional 30% of the revenue and dedicate that towards Vision zero projects. My timing for this council member Shaco would be to have a discussion today be back in committee. I believe in September and if their support for it to voted out of committee, but technically how would do this potentially refer to the budget committee to take out his part of the overall budget because this will certainly change the endorse budget for 2020 and likely change with the merison's down with America just us and so we'll have to figure out if we do want to dedicate this funding a piece back to school safety in a piece of additional piece to Vision zero how we do that in the sense of a valid but balanced budget, but I think we'll have some news reports to figure it out and we'll see where that goes but no policy perspective. My hope will be to work through the policy in this committee and deal with the budget component in the actual budget a few months later. I'm telling you want to describe everything technical about this budget is so that would be classified as the same way that they contributions the current contributions are it is important. I think that this does go through the budget committee because this would have impacts on the 2020 budget and just get more we are in a cycle is essentially a budget action. So you'd want to make sure you had the Appropriations to backfill if we were to remove that 2023 sport that point appointment the other thing I just want to add last year during a legislative session one of the top priorities for the city's really from me on the transportation front down in Olympia was getting permission authority to do automated enforcement of block the Box violation. So when vehicles are in an intersection and stay in the Section after the light changes and also violators of our Transit only Lanes people tend to follow the rules on those things when there's a police officer present. We simply do not have the resources to have police officers president all those intersections and what we find in our city is on almost a daily. If not hourly basis intersections continue to be blocked causing a massive disruption for the transit system and drivers. I'm also causing huge safety problems for pedestrians and cyclists too often still trying to navigate their way through the most the most serious off of her most vulnerable uses people in wheelchairs who I was upset can't squeeze through the little window is left between Cars and Coffee Forest way out into traffic and really unsafe situations. Got an issue didn't make it through Olympia despite. So amazing. I first got really close. I will be back this year and talking to some of the legislators in Olympia. They express concerns about what we did with the red light cameras last year. They obviously could legislate like they did with school safety cameras to mandate that the funding goes but I think it would be a good show of good faith if we can find a path in this budget in advance of the next legislative session Olympia to undo what we did last year and then further we dedicate this to safety. I think there's a I sense that from some that we are implementing these types of programs as a revenue Source defend the government is hard to defend that when we take all the revenue from the red light cameras in use it for the general fund and for me, these programs are driven largely for about safety and my ultimate goal would be that we don't like a penny of these because no one's blocking the Box no one's running red lights. No one speeding in school zones. No one zelle. Do using bus lanes. We really want compliance is what we want and to the extent that there is some Revenue because people are out of compliance dedicating a portion or all of that to fixing the problem is is Michael. I'm grateful, Thank you so much for your work on this will have it back in committee sometime in September. I can't remember the date, but we'll see you all then everything else. The next agenda item will invite presenters forward with Kelly resent in we're having a resolution. And I'll ask people to be introduced counselor to take of this is something that you've been working on. So I will just hand the microphone over to you after we do introductions if that's okay with you. So as people get seated we got some familiar faces back here today. Thank you all for being here multiple times. Why don't we start with introductions? My name is Carlene rickon and legislative aide for a concert. Washington State smoking remarks and then I'll you just moderate this whole thing. I'll step back. So this resolution and I appreciate my staff Carlene for helping lead this discussion to the produce & street multimodal parking infrastructure currently. Yes. Is on track to build 1500 spaces in 2019. The resolution will ask for a funny proposal to install 3000 spaces in 2020 and really want one as I kind of been in the committee thinking about just advocating it in front of advanced future micro Mobility options. I want a start to be able to think of for that before thinking about how we can create those spaces for us to be able to park Bike Share or scooter or other microvilli options Traverse City. And so with that if some of the advocates in it as well as Carlene would like to speak a little further and defer to you. I think you would like for Anna to maybe show this video that has gone viral something that will kind of inform folks what we're talkin about, even though we sort of Branch out of just video and the Heart of what we do. This is a video we produced with us. Actually after our don't block the Box video did pretty well in the legislature last year raising that issue and talking about it as an accessibility issue s. Approached us to help educate users and educate folks in Seattle about proper bike parking in the impacts to disable folks in particular when bikes in Bike Share aren't parked correctly. So let's roll Blind I'm a wheelchair user and I'm here to talk about the dreaded bike blockers Story in space and dangles Jacobs white team Berkshire might be good for some people but it's not good for me because I use a white cane I get frustrated cuz my Katie gets caught in the spokes bicycles through a crosswalk sway bars, and it makes it difficult for blind and low-vision people to find the entrance to the building or in the space between the sidewalk and the street parking and use common sense. Don't block access to Transit stops curb ramps benches driveways or doors. There should be at least 6 feet of clear space for Nestrian access if you see a bike parked wrong, please move it to the correct safe place. Bike blocking is not cool. It's rude. It's dangerous transportation for morons like share seattle.gov Transportation flash Bike Share. We are happy to educate phone for this video. We need to go further because it's clearly not just education that's going to solve this one. So we're excited to support this resolution. I would love for a Claritin maybe speak about the increase use of notches Bike Share, but just no bike and micro Mobility options in general with green eyes. Yeah, so we seen I mean Seattle's in the middle of a huge Boom for for biking and and part of that is people riding. Their own private bikes part of that is also using the Bike Share bikes The free-floating Bike Share bikes and soon. We're seeing the potential for a scooter pilot coming out and all of those bikes and scooters and other kinds of microvilli right now are being parked on the sidewalk in sidewalk space. Sometimes at bike Staples sometimes sort of haphazardly, but most of them are all entirely in the sidewalk and fester in space and our sidewalks are already crowded like on the video and so, you know improperly parked scooters and bikes can be a real Hazard for people in real challenge, especially when they're blocking curb ramps and Transit access and blocking The Pedestrian right-of-way. So we're seeing a lot of bike parking. Downtown and near Transit hubs, but often not enough. Sometimes it's entirely non-existent in some parts of varsity. And so this resolution is basically rolling out a larger swath of in street bike and scooter parking and these stalls multimodal Corrales were calling them would have space for bike Staples where you could park larger bikes and personal bikes space for cargo bikes and then also have space for Bike Share bikes that are not docked and it's kind of a win-win situation because if you look at an intersection cars are already not allowed to park within 15 feet of intersection, but it's often a rule particularly in residential areas. That's not particularly. Well followed and I can have real consequences for pedestrians trying to cross the street there for cars trying to come out and you know everyone here I think who has tried to cross an intersection there weather on foot or in a car on a bike. You have to kind of knows your way out a little bit and feel most unsafe before you're able to actually crossed over being able to Daylight those intersections a little bit is an added bonus and I would also reinforce the existing rule for cars not to be able to park there. Yeah, if I can just add one thing two quick things, you know, I think is we moved and we think about the future that conversation bubbles micro ability options. It's important for the city and sees infrastructure also move with it, you know that end with regards to one. Thank you for the video. And you know, I always tell my team Carly is going to be upset at me. I don't have a lot of rules in life. And one of them is just don't be an asshole. I really try to think about just how what we can do to further alleviate the concerns of our most vulnerable and those that are disabled in it in terms of ensuring that they have the space to move through adversity is important. And so I think this is a great opportunity for us to have that discussion and assets. To come back with us what the plan about how to best do this. So cancel. I ask feedback. I know your office and cancer mosquitoes offices. Give me some feedback and to your point earlier. We hope we can bring this back for a boat next week. Thank you so much for your work on this. Thank you all for your work on this one month in council member that I'd love to talk to you about it. This is the right vehicle or not. But I think with some of the data that came out this fall or summer of of Miss tights Miss Hart bicycles. And I think there was a bit of a discrepancy between what the name of the companies were reporting and what seems to be happening in practice. But either way even in the most Rosey sin, are there still way too many bikes are the Bahamas part and I feel like the it's the city's roll to really step up our enforcement and expect us to increase our game. And so the meaning of my understanding is a stout was going to penalize some of the companies by reducing. The number of bikes are allowed to be Down the street. It's not clear to me that that is the most effective pain away, especially as I see them shifting their modes two different things anyways, and I would really like to get a stop to actually find the bike companies when by service part I think would be great if we can figure this out. So that require the bike companies to pass it on to the users at least in some points. If there's people that have repeatedly doing these things and I don't just want some Venture capitalists to absorb this cost. I want them to actually change behavior. And so again, I love to chat with you a little more and get some feedback mess out of that too. But I just as as you mentioned the city's evolving into comes of Transportation frankly. It's evolving faster than I think a lot of us are off and comfortable with but that just means if we're going to we're going to embrace these changes, which I think we need to do from a climate and congestion perspective and nobility perspective. We have to also really change how fast people's behavior change to week. The fact that we have these systems in place for 2 years now and it still seems that the problem is very persistent. I think in public, at the most talking about I can remember what the city was were the top there isn't much better compliance and it was here but I know it can be done and I think people in Seattle are capable of learning that to these companies are operating in a whole bunch of different cities. Every city has their own sort of Regulation framework and we tried and what's working in other cities and we should really be in conversation with places like, you know Portland in Chicago and DC about what they're doing with the same companies, you know, that's great and to your point because we're Brian I completely agree with you 100% as someone who's a frequent user of the services. I think it's it's important to model good behavior. I'm sure they were student that be good behavior of others and so have a conversation with last night in terms of what more we can do what we need to do quite frankly and come back next week. Sounds great. Thank you all for being here on a thanks for your video activism team and to the actors activist who were part of that their ongoing work really makes a big difference in the city and hoping the state is great to hear. And thank you for your leadership on this really appreciate it. Are we smart final agenda item? Now I'm sitting in the other direction happy hour starts at 4 to the green New Deal for Seattle establishing the green New Deal oversight board for wedding compensation for those who incur financial hardship by their participation on the board requesting that the office of sustainability in an environment create an interdepartmental team to advance the green New Deal for Seattle amending the section 3.13.1 4970 of the Seattle municipal code and adding a new section 3.1 49792 the Seattle municipal code. Loving a man who stood and legislative aide to council member Bryan. Tell your the Cray Button. Matt remaley co-founder Melissa, Scott talks Thank you all so much for being here. This is a piece of legislation that we discussed briefly on Tuesday in committee feels like a few weeks ago, but it's just a couple days and maybe you wanted could you just give a quick overview with this legislation is intended to do and we'll have a little discussion about as I mentioned in my opening comments had originally intended to hope to vote on this today, but I'm a changed course and I just want to have a discussion today and do a little more work on this before. We have a vote in committee. Is a is a compliment to the green New Deal resolution, which was also discussed in committee on Tuesday. And basically it's the main goal of it is to establish a green New Deal oversight board, which is really an accountability board staff primarily comprised primarily of community stakeholders. And the goal is to oversee the city's activities related to the green New Deal resolution and ensure that the city is moving forward to realize that vision and some key components in the ordinance. Are that the green New Deal oversight board would comprise of 16 members. Eight members from Frontline communities including tribal members and use as well as members from environmental justice organizations and labor Representatives as well and individuals with a depth of experience in greenhouse gas reduction and climate resiliency strategies relevant to cities Additionally the ordinance outlines that the office of sustainability in environment is to staff this oversight board and also convene an interdepartmental team of key City departments and work with them to outline a specific targets metrics and measurement towards a greenhouse gas reductions for every city Department. So this point maybe I'll turn it over to Matt and Jill and see if if you want to add some more comments about the importance of purpose of this board and some of the questions we should be considering As you move forward. Thank you. My name's Matt Bromley. My luck Hotel name is Waki on Walnut and I am from Standing Rock. But a resident of Beacon Hill and I first want to thank councilmember O'Brien and his staff for taking the leadership throughout your tenure really on the issue of climate Justice and in particular with this resolution. Thank you for your vote still to put out of committing to full console for Monday. And for this ordinance to provide some bold leadership in kind of Backbone in income of my perspective to the goals of the resolution. So thank you both for near your office for the work that you're doing on this. I always find it important to Ground Us in the in the realities of what we're facing. I think sometimes when we discuss climate issues, it's easy to kind of see that I see far down the road issue or something. That's not directly impacting us type issue and then we get inundated with reports and often don't see the faces behind the tragedies that are already taken place because of climate change and so I just wanted to share a couple of those One being in 2003 the government office of accountability report stated that 180 native communities in Alaska are already currently facing land loss and increased flooding due to climate change and that when had particular resonance as I was scrolling in and reading to the social media today where report just came out that Alaska shore line is completely melted away. And this was the earliest time that this has happened since 2 years ago and Are Alaska native villages in particular are being hit pretty hard with land loss. That same report also stated that 86% of all Native communities across the country are being negatively impacted by the impacts of climate change and just here in this stay. We know that our Quinault Nation relatives out on the coast are currently having to relocate their entire main village of Tahoe away from the coastline because of the rising Waters with this oversight committee. One of the things I see vitally important for the the need of it is that it provides accountability for the goals that are laid out in the resolution. We know that Seattle has taken many positions on the issue of climate change dating at least back to to 2001. if my memory serves right when climate goals or reduction goals were stated by then-mayor Paul shell and I every mayor afterwards has and I'm probably city council has made reduction of greenhouse gas cools, you know, what a goal for Seattle and Well, that sounds good. The reality is is we've had an increase in greenhouse gas emissions here in the city over the past couple years. So it's it's one thing to take or to make bold words and statements, but it's something quite different to sort of kind of put teeth to that and hold ourselves accountable to seen these goals that are laid out in the resolution come to be and in my opinion. There's one thing I appreciate about a resolution has been drafted is it is very bored and a declaring Seattle to be climate gluten-free by to 2030 and not just carbon neutral climate gluten-free by 2030 that's very bold. And I appreciate that because that is the type of action that is needed. So with this oversight Committee, one of the responsibilities would be up to helping to ensure that the city and other stakeholders are being held accountable towards its commitment and that in the application of the the result of a resolution goals that they're applied at. Could we bleed? One thing I also really like about this ordinance in which you laid out. Is it cost for a community to be sitting at the table alongside labor alongside impacted communities alongside tribal communities in ensuring the accountability and that the goals are met and I think that's a unique saying that I often haven't seen them a lot of oversight committees. But I really want to share today though is the importance of being bored and sticking with the goals laid out in the resolution. And again, they are a very good goals that are laid out in there and I just want to highlight a couple other communities that have been bull cuz sometimes I've I've noticed that here in ends in Seattle. We make both statements but oftentimes don't follow through with bold action in 2016 where I'm from in Standing Rock AR youth who's actually young people who first rose the concerned about a Dakota access Pipeline and began having Reviving it tradition where you run between communities to spread awareness and our Tribal Council and our elders in our community. Listen to them. And I thought this is kind of interesting when I heard about a 13 year old girl having it quite different response just hours ago right out here because of her concern over a climate change where she was met with law enforcement. But anyways are our nation and Ananda Community sees me that the county where this is Dakota access pipeline fight took place where the third poorest county and all of the United States that third poorest behind two other jurisdictions are unemployment rate is over 60% So despite all this we took on a multinational oil company and their Wall Street backers. We didn't have the money are Tribal Council doesn't have the money and don't have the resources like says a city of Seattle does That pipeline was eventually put in we're still fighting it and courts, but when peace to that story that doesn't get as much attention. Is that the community of Cannonball where that fight took place just a couple days ago launched a solar panel Farm That's going to give electricity to the art. Are that whole village of Cannonball right there? So they took bold action despite not having the access to the resources that we do here and are bringing forth Solutions. I would also say that our tribe are standing Rock doesn't have quite the impact on the missions that are city does we also saw our relatives just north of here in Lummi who face similar economic hardships take bold action and taking on the coal industry and stop the construction of what would have been the world's largest coal export terminal that not only protect did Lummi nation and their fishing but I didn't that has positive impacts for us down here as well. You know Billy Frank who was one of the leaders in he's Nisqually when the leaders in the the fishing rights struggle. He was arrested over 50 times Salinas right to the tricky fish starting at the teenage years. He often remarked, especially when in company of State local or federal governments and reminded them that tribal governments are far out spending the non travel governments in terms of Investments and habitat restoration and addressing the impacts of climate change despite having little to no impacts are words that climate change. So Seattle, it's it's time for us to to be boiled to stick with the the goals of that resolution to create an oversight board and and see that by 2030. These goals are met Thank you. Thank you, Matt. I'm on a diverse want to adjust appreciate you mad. Thank you for getting off a little nervous. I want you to go for but I also want to honor that we are on I'm do Amish land and land of the coast ABCs and one honored that the first people of this land has been taken care of this one for years before I send as much to learn from native communities and want to also emphasize the need to recognize the rights their sovereignty from Doc Greens Point of View. You know environmental justice has to be woven throughout this process Rachel Johnson has to be woven throughout this process. We know that if you know, we intend to a transition to a sustainable green economy, we can't guarantee. It's just unless you know, there is the process is also Equitable ingest that the process takes into account. The people who are most closest to the problems and those are the Frontline Community since so this this legislation really highlights the need to be specific in creating an equitable process of accountability of oversight and I appreciate the time taken to Define. What a front-line communities in Frontline communities are literally people living living next to or living next to the the toxic sites are living it most impacted by climate pollution are living in poverty or unemployment other people color their indigenous people African American worker is low income people immigrants and I think it's important to name who are the people most impacted because otherwise they will be continually left behind and what we will continue to have the same old outcomes that are not just and so I think that it's really key that we set the foundation DeSoto. We can actually achieve these goals cuz I I truly believe that everyone in this building does want to do good does want to solve this problem, but we had we can't do it without the people in the room who are most impacted. If I were to spill this this water bottle on this table every one of the stable jump because they are closest to the water and that's what I mean by frontlines, right? We are closest to the toxic chemicals. We are closest to the the the hazy smoke and the health disparities that are happening in our communities Center for Disease Control King County. All these different on reports. Keep telling us the same thing that our communities have health disparities have unemployment are struggling and we know that we don't need a report to tell us that we community service with with people in South Seattle and talk to them. We didn't start with ik what do you think about climate change we talked about what's going on in your neighborhood and one after another? There was enough information to share that. Yeah, we have a lot of pollution. We have all the displacement. A lot of people are out of work people are facing really hard conditions and there needs to be a platform for four people to really address these issues and I always ask myself. Why do I do this work? And it's really hard and a lot of people are in this this this, you know, and it feels like it's a long-term commitment and and you know, the reality is we are losing people in our community is everyday health related or economic related conditions where people are also being pushed away or be there there were losing them and it it feels like a losing battle. But if we don't take action today, we're going to lose more people and I don't want to see that and I don't want that. I don't think anyone this room wants that to happen. And so this task this this oversight board will make sure that we aren't operating from the status code that will actually be able to bring in the expertise from our communities to be able to ensure that we are I'm making the right direction putting down exactly. How do we Implement these this edition of a green New Deal for a Seattle. It also will make sure that you know, we're not going to allow all solutions into the room. That won't actually bring us to where we want to be that won't like continue to increase her emissions and air pollution that will actually get us to our goals and you know, the elements that got us here in the first place aren't going to get us to where we want to be. I think that we need to really start to internalize that we need some drastic shifts that this is a City full of wealth and it should be able to protect and provide its peak for its people and to really Take to heart what it means to protect environment. We have all these these values. How do we put them into action? I'm not saying this to shame or discourage anyone but I am saying this for us to encourage us to stay strong and to give us courage because it this is heavy work and we are trying to make a major systemic change the like and I think about back in 2014 when we partnered with the office of sustainability with O'Brien's office to do a cross learning about climate change impacts. I think it was a big wake-up call for us and our community and got green like this is this is what's happening in the sea level rise really internalized that we needed to take an active role and and mitigation and adaptation in and out really addressing. You know, you know, what what got us here in the first place. How did we even get to an unsustainable economy? And so I think this is this is a really important legislation and really sets the the tone of how we're going to operate in and create a green needle that is just an equitable. Thanks. Matt until so much for all the work you've done in our communities and for the work you've done to really shape where we are at the moment. I know there's a lot of other folks that have been with those tables doing the work too. But I really appreciate your leadership Green New Deal resolution that we passed out of committee on Tuesday will be before the full Council on Monday There's a set of amendments that generally reflect the comments that were made of the table. I'm concerned Pacheco council members who want to make sure I wasn't the table but provided a comment to so we will bring an amendment to incorporate those but the goal would be the fingers crossed that the full Council will adopt a resolution on Monday. You've highlighted the importance for having an oversight board. And I think the ordinance is a really strong ordinance. I in conversations with with community members and the off sustainability environment in the mayor's office. I think there's some interest in taking a little The time to think through that a little bit. I know that specifically valve sustainably environment when they look at what's in the resolution now that that is done that like, this is a big body of work that this oversight is board is going to see and the ordinance calls on the office team building environment to to work with the Borden and support them in that work and I think they want to impart understand. I'm calculate what kind of resources they're going to need to do that work what I've heard from folks as they want to be clear that this isn't just another, you know few pages of paper that talk about how great we are the city we care about climate and if we're going to do this they want to make sure they're going to take these actions and so they're trying to be very thoughtful on that and I really appreciate that from both the mayor's office in the office to nobility and so my plan on this ordinance will be just to continue to work that process bring it back to this committee on September. We've been through Friday, hopefully in the next week or two will have, you know some more thoughts that come into I suspect some some slight revisions to it, and we'll be sharing that with community members to and then we can discuss that again. And what do you think is 3 weeks from today 4 weeks from today 4 weeks from today. I guess. I hope we get something passed away September to know just thank you for sharing and being here and being part of this process appreciate it. So, thank you. Both of your comments today were really powerful not the vision of I don't I don't pretend to know the traditions of what happened to Standing Rock the division of these young leaders taking up the charge on their own and convincing Elders in the community that this is something to do. I witness Standing Rock from a far and it was still a huge inspiration for me. What what the people back there did and I know there's lots of examples here in our community and elsewhere and so that's really powerful to There's nothing else. This is our last agenda item and we will be back here the full Council on Monday and the green New Deal resolution and more work to come next Friday in his committee. Thanks again for all your work and we will be adjourned.", "end_time": 8282.5}]}