{"format": "raw", "annotations": [], "confidence": 0.9477277886867523, "data": [{"start_time": 0, "text": "Good afternoon, everyone and thank you for coming to the finance in neighborhoods committee today. I'm Sally Bagshaw chair of this comedian with me as council president Bruce hero. Thank you so much for coming. We have a very long agenda today unusual for the finance committee. And if there is no objection the agenda will be adopted. No objections. The agenda is adopted. So the five items we have on today's agenda include first a briefing and discussion and possible vote for an ordinance landmarking aspects of what was the Old Spaghetti Factory on Eliot Avenue. We will hear from our friends in the department of neighborhoods. Next. We're going to have a community panel on the sweetened beverage tax and how that tax can be used to increase access to food and communities most impacted by the tax. We're going to follow that up with a discussion that will be led by our Central staff person Yolanda ho on potential potential considerations for the ordinance. Weather to create a dedicated front some of the options are yes, no and after the 2020 budget, so we'll hear more about that. We're all so after that going to have a second panel in conversation on the importance of the Equitable development initiative EDI. We know that this is important to all of us were also dealing with a balanced budget and how we're going to approach this in 20 20 and 21 there after we're all so then going to have an opportunity here from our parks department friends. We are going to lift a Proviso for one of my favorite projects that City Hall Park and yesler Crescent. We put money in the budget last year. But Proviso dead until we could see a budget on how the money would be spent. We've been meeting with parks and and our friends across the street and King County since the beginning of this year. So today, I'm hopeful that will lift the Proviso and approve Parks proceeding to spend the money according to the plan and finally we are Going to have another briefing discussion of possible vote on the appointment of Bobby Humes as the Director of Seattle Human Services Department human resources department. So I want to thank Bobby Humes for all of his work. We had asked him a number of questions at our last meeting and he supplemented his resume. He answered the additional questions. So I am very excited and hopeful that we can move forward with his vote today this afternoon. So we have public comment time now on items that appear on today's agenda. We've got eight people. I'm going to ask you I'm going to call you names. I'm going to ask you to step up to the microphones and be ready and prepared to comment so that we can move forward will have two minutes each. I'm Kathleen Hausfeld looks like Julia prosciutto Marin. If I slaughtered your names, so Kathleen, please and if it's Julia, would you kindly get over go over to the other II microphone now? So we're just ready to go and maren. I'm if you'll just move up to the front row. Thank you so much. Thank you. And if I state your name, please I am Kathleen hosfelt and I am the executive director of Homestead Community Land Trust and I'm here it is strongly endorse councilmember O'Brien's proposal to create a dedicated fund for EDI. The Equitable development initiative is an embodiment of the intent brought Homestead into being and compels us in our work today. Homestead was founded more than 25 years ago by citizen activists to address the rapid displays in the central district and our current priority is 1 anti displacement strategy just community-owned permanently affordable homeownership because we believe that the everyday hero To contribute contribute to our quality of life should be able to remain in the communities that they made to create. One of our purposes is to share our skills and experience with organizations like those better by the EDI Fund in low and moderate-income neighborhoods and communities to enable encourage and support Improvement of Housing and land in ways that lift up those communities. So although EDI funds do not support homesteads work. We support ati's focus on community initiated project grants with a great deal of respect for those who make difficult budget choices between competing priorities. I maintain that investments in new projects and anti displacement must not only be protected be strengthened. The need for new projects is urgent. We must accelerate the growth of community initiated projects focused on anti displacement and Equitable access. So that all might benefit from our City's tremendous growth and prosperity. Thank you. Thank you for coming down today, Julia and maren and then Lindsay. Good afternoon council members. My name is Julia prosciutto. And I'm a policy Analyst at Puget Sound Sage am also a member of the race and social Equity task force who helped helped create the Equitable development initiative and set on the EDI Advisory board over the last few years. We have seen displacement pressure is grow significantly in our cities families workers cultural and religious institutions and businesses are getting pushed out of our city at rapid Pace. The EDI is the only fund that addresses a comprehensive anti displacement strategy using a racial Justice framework, and we need to grow and protects this important fund the last two years of the fund. We have received over 30 million dollars of eligible asks for Community Development development that Roots people and institutions in place and end this year. We're seeing less money than was allocated in the short term rental tax regulation. We need to secure the five million dollars from the short term rental tax for EDI grants for 2020 and Beyond before this year's budget cycle. We argue to support this program by putting councilmember O'Brien's legislation to a vote later this month and we also support the same demand for this week and beverage tax is all thank you for coming Julia maren, and I'm if I'm saying your name wrong, would you please for the record it correctly and then Lindsay? Hello, my name is Madeline Casa. I am the community development manager at home site. Also a member of the race and social Equity task force displacement is occurring at a rapid pace and his portion Italy impacts people of color and low-income folks holistic Community stabilization through Community Driven development is the only effective strategy to prevent displacement and the Equitable development initiative is the only tool the city has to address multiple Equity drivers that prevent displacement as a grantee of the EDI fund leading the development of the excela square project home site will be able to leverage the 1.5 million dollar investment from EDI tenfold for their project. We argue to schedule a vote for account number O'Brien's legislation to create a dedicated fund for both the EDI and sweetened beverage beverage tax by the end of this month. Thank you. Thank you very much. We have Lindsay than violet. and Simone Good afternoon. I Must Be Heaven to say hold on just a second. Can I ask Violet to come on up? Thank you for that and Simone next please. Thank you and Lindsey Joven with the American Heart Association in the Seattle healthy kids Coalition as I shared it this committee's last meeting. We were proud to support the passage of the initial ordinance that established the sweetened beverage tax and we're proud to support council member at O'Brien's proposed ordinance to create a dedicated fund for SVT revenue does could increase transparency and ensure revenue is invested in a way consistent with councils original commitment to community to grow and expand food access an early learning programs. The tax is off to a promising start. It was designed to improve health by raising the price of sugary drinks to deter consumption and invested into Community Health and well-being. We seen declines in sales from similar taxes in Philadelphia Berkeley and Mexico and the universe Washington evaluation of the Seattle tax is underway and do this fall importantly diverse communities in Seattle are already benefiting from meaningful investments into taxes in early learning actual Revenue happens to be higher than projections which were based on assumptions since there was no historical basis. Let's not divert funding from the spirit of the original ordinance and the commitment made to community. Please ensure all sweetened beverage tax revenue is used to expand the passage of this proposed ordinance. Thank you. Thank you for coming Violet Simone patients. I have to get off this one would be better. Good afternoon. Come to members. My name is violet Robert I am with. A lot of organizations, but I'm the director of the tenants Union of Washington. I'm also on the board of got green. I'm here to speak on the EDI and the sugary beverage tax. We know right now that the displacement of tenants of citizens in the city of Seattle. Is that a rapid pace and we want to protect these fundings that were allocated to help people in displacement. I'm here to speak about also the sugar tax beverage and what we're trying to do is we come to you sell a council members that shout-out to urge you to schedule vote for council member O'Brien's legislation to create a dedicated fun for both the EDI and the sugary text. I actually just got my vouchers for the sugary freshbooks, and I'm Happy about this because it helps me to buy fresh fruits and buy carrots and stuff like that because I'm qualified to get fresh bucks until this these these important important, you know, I'll funding does go to communities of color that people that look like us and low income and we ask that you heard you Sally Bagshaw council member Bagshaw to schedule vote for council member O'Brien's legislation again to create dedicated fund before both the EDI and the sweetened beverage tax by mid-july. Thank you cousin members. Thank you for coming by Simone. Hi, my name is Simone Adler and the organizing director Community Alliance for Global Justice. And we are a member of the coalition to close the food security cap with got green and other organizations to strongly support the ordinance to create a fun for the to ensure that the revenue for the taxes being used as intended, especially to be accountable to communities of color in low-income communities that are impacted by the tax time. And in line with what the text was intended to do in the first place to expand to the benefits of this has been a lot of work that's happened. You're not getting an otherwise. I'm to get people to understand and support the tax. And so making sure that the revenue follows through on those commitments is important both. Has community-based organization but also for the city to be accountable and transparent without using the funds and so we really push for the ordinance to be created to make sure that that happens. Thank you. Thank you very much for coming patients. Thank you. Good afternoon. My name is patience malava and I am the policy manager at the Housing Development Consortium. I am here to speak in support of council member O'Brien's legislation to ensure that is a dedicated fund for the easy eye and I will Echo a lot of the voices that have already spoken of how TV is too isn't getting us replace way. We are achieving our goals as a city the gap between the application and the 5 million in actual a dedicated fans is one that's telling need for a dedicated find source setting is important that we move forward in ensuring that the portion that was allocated in the short term rental ordinance is actually being placed in that dedicated fund for the EDI. And in the future will look forward to talking about Ida sources of actually extending the fans because they need Can use to be very visible with many communities of color low-income communities really being affected by displacement in the most disproportionate banner and I think this company for all your work and getting us to a place off where they is a natural legislation that will be passed. So we look forward to seeing the legislation move forward and thank you. Thank you, please our last speaker that your name please. My name is Quinn Pham and with the friends of Little Saigon also here at the urge you to support the dedicated fund for the world development initiative in this week and beverage tax. I'm here to really speak on Little Saigon and R are pressures and challenges that we're facing right now or earlier this month. We already we lost another small business Seattle Deli to a private developer and they had to close their doors after almost thirty years of being there and their family in the only on the deli that but they also own the property that they were on and they all Doors to other small businesses, and now we've lost out on that property and without this funds we wouldn't be able to continue to advocate for resources so that the community can remain in plays in own and control our own properties. We don't want to see future businesses and properties that are owned and controlled by the community lost again because of all the development pressure is happening in our neighborhoods. The EDI also supports the Friendsville Saigon in our adventures to apart property and develop something that we can also provide to the community to Anchor the neighborhood. And so without this dedicated Source we wouldn't be able to do that. So I do urge you to continue to support that the to push for the 5 million to be dedicated to EDI. Thank you. Very much, so that ends our public comment. And I would like to move on to the first side of a business, which is our Landmark projects. If you like to come up Sarah, and we'd like to read this in Alice, and thank you. Item number one cancel bell 11954 0 and ordinance relating to Historic preservation and point posing controls upon the Ainsworth and Dunn Warehouse a landmark. Does Amanda by the landmarks preservation board under chapter 25. 12 of the Seattle Municipal Code. Thank you very much. So would you just like we'll start introductions up here and your name and for your working Union West Merriweather Partners the company that had to redevelop the Ainsworth & Dunn building Thank you, very Sarasota Department of neighborhoods. Thank you all so sorry. You kicking this off. Yes, I am. And I do want to say thank you all for coming. And if you feel rush today, I apologize for that. It's we've got a lengthy agenda so we may be moving on. That's okay. So I'm here for the warehouse building at 2815 Elliott Avenue North it was designated on August 20th, 2014 under standard C D and F. I want cover with those are today features are the exterior of the building and some of the exposed interior heavy Timber structural system on the first four. A portion of the site adjacent to the west side of the building the building was built in 1902 and the architect was Stephen Austin Jennings. It was constructed In 1902 by the salmon packing firm Ainsworth and Dunn for uses a warehouse. The thing that I find really interesting about this building is that it was built operate in tandem with appear. That was built across the across Alaskan Alaskan Way. There's still some other buildings along the Waterfront that are owned by the original owner that also own the pier. So it's just kind of an interesting pattern that's occurred. Well, I would I want to say the most important thing is that this is the Old Spaghetti Factory anybody really wants to know where it is and what we're talking about that that is true Jesse. Did you want did you have comments that you wanted to bring in time? And I'm speaking for the owner and the owner can also speak for himself, but we're excited to be here. We're supportive of the designation and interesting. They were close to after this ordinance has passed we will be before the landmarks for to get a transfer of development rights certified by the board to sell off the remaining development rights from the landmark building. So it's one of the only incentives that is available to Landmark buildings to kind of make some dollars off of the the property that's been landmarked. And we're really excited to do that. How many stories for a TTR purposes to do you get credit for it? So you can tell me how many stories will is it's as if I can stay opportunity that we don't have by preserving. The building is building a new six-story building. The construction is coming along. I saw the new windows going and recently it looks really quite beautiful. Thank you. Those are the new old windows. So anything you would like to add about this. I know only that the TDR program that Jesse referred to as an important incentive to help fund what is an increasingly expensive Endeavor to preserve these historic buildings. And this one in particular I think so much just to the character of the community on the North End of Alaskan Way, so I want to thank you all for all of you who are involved in this any other questions for my colleagues. Pay it. If not, I would like for the committee to consider passing cancel that 119540 people has been moved and seconded if there's no further discussion all in favor say aye has no abstentions. So thank you very much and I appreciate your coming today as quick as it's been Allison, if you would kindly read in our second item, which is one of the reasons, I think my Council colleagues say, thank you because member O'Brien council member Gonzalez council member Pacheco. So the next item, please remember to cancel that one 19551 and ordinance related to creating a fun for sweetened beverage tax revenues and who all is coming to the table with Kelly Brown. Thank you. Yolanda, thank you for being here. Excellent. I'm just going to ask you to start off with introductions. And as we go down the line if you will state your name and with whom you're working Yolanda ho Council Central staff green Kelly Brown executive director of North helpline in my name is Lika Susan Community Advisory Board member. Thank you very much. Do you want to start off with or someone else doing this? How does tax one pack them directly? Okay, very good. So who would like to start? I was looking at you and I can't start I do have some just general like reviewing the budget recommendations that we made as well as the fund itself. Do you have a preference of where I start know? I think that will we've got about 20 minutes or so. Okay this item so we just love to hear from you about what your involvements been and what's important you going forward. I think I'll start with our budget recommendations for 2020 because we just submitted those earlier this week to give context and then I'll speak about the separate fund. So this year we are just recently we made our 2020 budget recommendations for the council in the mirror. And this was after a process of gathering Community input. We had two meetings for the community. Where are over 60 community members attended and that was at the beginning of May and from those the information that we gathered. We've been developed our recommendations inclusive of those the Voice so some of the highlights that I want to point out is that for 20/20. We focused solely on the unallocated funds as well as the one-time funds and this was very intentional in order to maintain any of the current programming that was happening. We did not want to take any funds out of current programming cuz we recognize how important that is for programs to really establish and effective and so among the the funds that were unallocated. We wanted to really make the focus of the Investments go into Community lead activities so similar to what we saw with the Innovation fund with the food access that went out to an RFP process. We want to expand that to the early childhood education component of the of the tax as well as expanding that for the food access. And in addition to that. We allow added more funds for freshbooks because we know that that has been a hugely successful program and there is more community members that can be If that is expanded. We also that were proposed from the budget office that there was interest in having money. Go towards Food Bank Renovations from what I understand. And so we also unanimously voted on approving that as well. And that seems like a good one for everyone. There's also funds that we expanded for evaluation because one thing that we consistently heard from the community is that people really want to know if this is working they want to know are people getting more access to food who is being reached through the tax funds and who is providing those services and so we recognize that evaluation is a huge Endeavor to be able to do in that really requires establishing what is being determined as success for the for the programs and then making the system to be able to gather that information. So we put additional funds into evaluation on top of what was already allocated for 2019. And there's also the funds that were for the count of marketing that had gone in for for this year and recognizing that in order to do that. Well and effectively we wanted to put more funds into that and then lastly with the one-time investment. There are funds that are going to be going towards an assessment for the Seattle Public Schools nutrition services. As you may know there is a nutrition director who is very interested and skilled. I'm have experience in transferring a system into scratch cooking. So before we jumped into putting money into infrastructure, we really wanted to do an assessment to fully see what was needed to do that effectively with a long-term vision for that to be successful. We also heard from community members that in order to do some of the programs that are existing for example, the freshbooks program Distributing food to preschools and community centers as well as the after school and community meal programs. They need more things like Refrigeration large equipment to be able to process food. And so we put money into that. As well. I'm so that's in a nutshell our recommendation and just moving into the separate allocated fund that has been proposed by a council member O'Brien. All of the council members are the community Advisory board members are also very much in support of that for the main reason being transparency with the use of funds and holding accountability to the original intent of the ordinance of expanding and growing the existing programs and not having it be displaced to other other programs in. So in order to protect that and really will have accountability and transparency to the community. We all are in support of having that separate fund for the strippy beverage tax revenue. Thank you for coming today. I really appreciate you. Take your time, please. we operate to food banks in Lake City and bitterly and I'm here to kind of talk about what an expansion of funds would look how that would look at North helpline as opposed to the supplanting funds which happened this past year wonderful study, which was presented to council the needs of food banks and food access throughout the city and their findings was that report funding difficulties were seeing an arm pantries and food banks needs for funding our first staff for vehicles for food first space and then just general fun to have the sauce to be able to deliver Services personally at North helpline Community groups approaches quite frequently looking to add a pop-up site out of school or at a housing the Man or different things like that and we just simply don't have the Staffing to meet that need right now within our current Staffing structure. So that's something that could be possible with the expansion of funds is expanding that's talking to be able to do that as well as purchasing culturally appropriate and healthy fresh food. That's the best way to deliver food to folks being able to purchase things. We have wonderful Partners who give lots of donations of foods and things like that, but really having that purchasing power to supplement and to be able to provide the full complement of nutrition to the communities that were starting is super important. So expensive the funds would provide those opportunities and we definitely support the legislation in front of us that the board recommended additional funds for food banks this year because I know there was some discussion last year. I just want to make sure I understood what you said, correct my understanding that it's Stickley for infrastructure infrastructure being what Kelly's talking about or four for more food itself and I'm confused certified things like that, which is the intent to pursue more of the food pantry grocery store model that I know that many food banks in food pantries are heading in that direction. Yeah. That's that's a piece of it by Nursing From what they presented to us that there was a need for the Ballard food bank and then Northwest Harvest also needs some infrastructure support and then that would be about half of the funds that they allocated and then the other half would be going out to do an RFP process so that their food banks could apply for those funds. At practice and I'm definitely expert on this one. Maybe you can help the sum of the way that food is flowing through the system to Folks at food banks. There's a need for refrigeration Refrigeration on site because of the leave if I hear correctly, there's protein showing up in a way that is great and yet when it comes in big waves can't just stay on the shelf in his refrigerator into that was one of the needs that I had heard identified that food banks. Where do you send us a fresh we have wonderful donations coming in from Community Gardens and I'm done being able to put that in the freezer and Supply is something that can be relied upon. To accept more of those donations so that were able to prevent to serve our communities clarify that is part of the one-time investment and welcome. Thank you. My name is Tameka Thompson. I'm the food access organizer at got green going to the food bank is a little different for the work that I do we aim to reach families who are in the food security cap, and those families are families that are working and they make is what considered a living wage yet. They are not there because of the the cost of rent in Seattle these days, they're unable to provide healthy food for their families. They will not go to food banks and saw the fresh box and fresh box expansion programs are very important for these families. They won't go to food banks because they think that food Are for people who are not working or are low income and they don't see themselves in that category and they say it will let's save that food for someone else who needs it more than I do and I'm so right now we have been able to reach I think two thousand families and roll 2,000 people into the fresh box voucher program, but I just realized that we can do so much more. The waiting list is so long. If we have the revenue of the call of the revenue from the tattoo last year. We could have reached so many more families you have numbers on that to make up. My only have numbers for gottman. I know that there's a total of 2000 families and rolled between 8 organizations. We all had the opportunity opportunity to enroll 150 individuals a piece and then there was a public site that enrolled 1,000 people. You're welcome. The green was able to reach demographics of people who are 60 and older on 53 people who are 6 year older and seniors are having a hard time having access to healthy fruits and vegetables. We were also able to reach a lot of African-American individuals. And like I said, a lot of the people the majority of the people who were enrolled we're families and the food security Gap, they don't have access to benefits like EBT and snap and so we'd really didn't want to reach out to those in too many of those individuals because they do have access to the Fresh Prince program. I just wanted to say all this to say that I think that is really significant that we have more money to be able to go towards the freshbooks expansion program because there is such a great need the waiting list shows that need Thank you, Tanika. You're welcome. Any comments or anybody want to respond? Okay with Yolanda that brings it up to you in an excellent memo. Thank you for that. And I've also distributed to all of you a letter that our budget director Ben Noble sent down about 45 minutes before this meeting started. So I want to make sure that all of you had a copy of that. Okay, so as we we provided some background a couple weeks ago about the history of the sweetened beverage tax and so run through a quick summary in my memo that the things that the revenues can be spent on and I'm based on some of the conversation here. We might want to think about amending not to laugh or Capital project Investments for food banks. Cuz right now that's not in the last time right now. I'm only Seattle preschool program capital projects, but that's something to think about and I'm just kind of reviewing what had happened during budget last year impacted our 2019 adopted budget in regards to the use of SP unanticipated access SBT revenues to supplant the general funding in specific organs in which that occurred primarily in the Urban of Education Early Learning and Human Services Department specifically things like food banks on the parent-child home program a child care vouchers and a nurse Family Partnership. So and then also nowhere last year during budget. We there was a Green Sheet as sponsored by council members, or as an O'Brien to provide some additional funding for food banks last year. When one time on the 270,000 and excess ongoing funds And so that leads us to the legislation. They sponsored by a council member O'Brien Council Bell 19551, which we briefly discussed at the last committee meeting but made a couple of my changes that I want to talk about. So again, we are creating a dedicated fund to track a phone using expenditures by departments and also establishing Financial policies with regards to the spt revenue specifically where one thing is to codify the policy. So have them and the municipal code. So people can see them easily instead of having to try to track down the ordinance. So we would it be adding a new section to the municipal code in chapter 5 and increase the flexibility for the allocation of funds to one timer limited term expenditures. So instead of dedicating 10% specifically of the SPG proceeds to these uses we could Allow up to 10% I'm too kind of providing a little more flexibility last year. We amended the initial the original policy which had been initially 20% to 10% given the higher-than-anticipated projection. So we we could cover the obligations we had at that were I'm out lines under those in that category of I think much more quickly than we had been anticipated and specifically the Endowment for the Seattle college has 13 theater promise scholarship program and the 1.5 million for job training and placement programs for workers who may be adversely impacted by the tax and yes xability from 2210 that's like during the budget process that we can play around with all the other revenue streams whether it's C light SP or generous up. But for this particular fund we can only modify that within 10% as opposed to. Right arm out. Well, so initially the in the original ordinance. So there was 20% had been allocated to these one time or limited term expenditures and then 80% to the ongoing programs. And so that have been based upon the conservative projections of you know, making sure that we we can cover the five million Endowment for the Seattle colleges a 13-year promise scholarship and the 1.5 million for the dog breed training as well as one time cost for administering a text with it so that there is that kind of allocation and then because the money was more than anticipated the revenue is greater than we anticipated. They could lower that 10% Did I can remember the name of the group the name of the group that had some discretionary funds the cabin? I'm sorry. That how does this 10% proposal affect the amount that goes to the cab is when the the the tax went into effect and then we be on collecting Revenue but there was also the idea of creating the cab to help provide recommendations, but they we had not died had not they have not been appointed yet the members to the cab. So the thought was of that there's initials out of tape of okay, we have this certain, you know, the projections were going to allocate a certain way but we're going to hold I think about 2.7 million for this body to allocate as they see fit once they are fully up and running. And so that that was then what they did. And so that that happened last year was that that 2.7 million was then distributed as a cab had a request had recommended and so but then that idea Ongoing the cab would provide as we have heard that kind of every year recommendations on how the SBC revenues be allocated. So was the idea was that they were going to provide recommendations to the council and the mayor on how the how all of the revenue shall be allocated overtime. So there isn't a reserve every year for the cab. It's more like they are recommending and in this case they have made recommendations about the allocated revenues. And so there is a yeah for them to have some discretionary moving forward they will have they'll have an advisory role on the full fund but three years from now, they're not getting another 2.7 other 2.7 to 2.8 that they just get to advise. That's so we're not here marking a lot of fun for them in the future. I didn't realize that I thought that the way we had set this up that in perpetuity that always have their discretionary fund outside of it, but that was short-lived to two points and just to clarify. We only recommend we've never had full power over any of the funds and so we recommended for those 2.7 and now making recommendations for all of the funds. I had a misunderstanding. That's why I thought the way we could set that up was that that 2.7 was for the community to decide and we'll play around the other and look at our privates. I didn't realize that that was just a ganna recognition. I thought it was yet more power if you will of that. My take on all this was that we were going to start collecting Revenue in that first year. I'm well, we were still establishing the community Advisory Board and so we didn't want to not make investments. Well that board was being formed and and working together and So based on the guidelines that we had set for the cab. I'm in legislation said we're here but junk are things that we think we want to do and then we'll leave some of the pool of money likely to be for the latter half of the year for the cab to recommend but in future years the cab would be able to give us advice on the entire budget because they will have been formed at that point and that's what you spoke to today was was not just a chunk of it but here are the sets of Investments that we think you should consider in time for the mayor to consider in the mayor's budget and for us to consider and I imagine we will see you and members of the cabinet throughout the budget process talking about what your expectations are. Thank you for that. Yeah, just really wanted to clarify the pages 2 through three of your memo Yolanda you sort of late out the sptv revenues that supplanted General funds out the programs and the programs that I'm focusing in on or the parent-child home program the child care assistance program in a Child Care Program and the nurse Family Partnership, and I just and those are for me and I think for the city council in general and I guess I'm but I don't see the memo and what I'm not tracking very clearly is if council member O'Brien's proposed changes would eliminate funding for these three programs for the include cccp. So they Bad all they're over there options. Obviously that can be taken but the intention is that that we would not they would essentially be other funding for these programs were the supplantation had occurred, right? So that is about 5.7 million that had happened last year. And so the so that would of course require finding additional Revenue sources or Cuts, but it would not be about it. So I think that we're just we're just identifying where the money for the supplantation had occurred, but it would not necessarily cut it I think that yeah like I don't want to speak for them. I mean there's a difference between 10 and what the bill actually does and you drafted the bill. So I want to know what does the bill due right so that the bill would not cut the funding at at this point. It's so I think it kind of accepts what has happened to this date to date. Now if say there is a supplemental budget that comes in for this year that does implantation that is after the effective date of the ordinance. Then you know that there will be. That would be counter to the spending policy of no supplantation of a general fund but it it does not undo what has been is not retroactive. Well, yeah, I know it's not right because we've already spent the money on billing people haven't been his back but my recollection and the programs were within the spending intent to begin with so I'm not it's not tracking why they would be on the chopping block with sort of the understanding that was heard of the theory that they somehow are outside of the Contours of what is acceptable expenditures of these programs were outside of the acceptable expenditures. I don't know that was not the issue was not that it was issue that some of these were supported by General funds up until and then the spt was used to free up that journal fun for other priorities, right because we traded to free beverage tax in order to fund stabling these programs impart these programs. And so we said, you know, there are programs that already exists that are doing work around unhealthy food access and and Early Education in your promise to and we want to do more of that and so because that's going to support these communities that are impacted by the sweetened beverage tax the disproportion impacted and so, you know we go and collect a bunch of money and my intent I think it's pretty clear on the legislation. The original legislation was it this would be additive but what happened during the budget process was it said we're going to spend this money on these things that are allowed these types of programs, but then we're going to take the general fund money that was previously used to find it and spend it somewhere else and we don't know exactly where that was. But that that's the problem I have is that reset your community members. Yes certain communities, you know any of the people you were talking to you on the doors in your community. Yes beverages you're going to pay more for those because of this tax were implementing but the programs are getting access to whether as fresh box or preschool program. There will be more spots because we're adding money to that and that's not that is not what happened. They took that and said we can take some of that money and use it to find other programs. I don't know exactly what programs they were. So he was probably almost we can try to track The Color of Money went to the left that door and that's the challenges that we added collected, you know, 20 + million dollars just communities that we didn't increase spending those communities that 20 million dollars. So if I apply that until one is I appreciate that clarification cuz I wasn't it wasn't clear to me from the text of this memo. I was concerned that what we were talking about was either maintaining this minimal funding or or utilizing other friends besides sugary beverage tax to continue to fund these programs which would be a major concern of Mine by you or Siri. So in other words if we look at the parent-child home program, which is within the Contours of acceptable expenditures for the jugular ubereats beverage tax revenue. We spent 1.113 million dollars on that correct answer. The question is how much more should we have spent on that? But for the fact that there was this general fund supplementation gimmick that was used. Correct? OK and do we know sitting here today? What that number should have been but for that but I don't I don't think so. I think I'd had some recommendations on how the allocation should have been last year and and you know it including the Perkins I had been supplanted it was kind of roughly. I remember if I recall you might you will have a better sense of your recommendations to how they matched up with the actual budget, but I don't think it was to the detail. There was kind of a General Distribution that had been hope for with the full amount not expecting this at Plantation. I was at that the alley to join us as well. Thank you very much. Pick up the phone. I just thought I would jump in here. I don't have all the details of the numbers in front of me. But I think in the the simplest form had the supplantation not happen that 1.13 million dollars in sweetened beverage tax that was used to supplant could have been used to expand. So I think if you look at all of that as the money that was used to supplant the general fund funding instead could have been used to grow those programs is one way of thinking about it the challenges that the other programs that would have needed to be cut in order to achieve that because the Weaver still trying to fill a funding Gap from four other programs. And can you describe a little bit about those other programs where I know we talked about permanent Supportive Housing, but I think it's going to be really important for us to get into the detail about what this bill would do and I'm and particularly when we haven't endorsed budget last year. I know all of us want we have the same values here. We were To support these programs and my my concern at this moment is to make sure that we've got all of the details on where the money went last year and what other programs might have to either be cut back or eliminated if we move forward I think off the top of my head. I can't identify specific program so that week but we can do is look at programs that were funded with one-time funds in 2018 and 2019 and highlight those as potential areas that would need to be eliminated because in some cases council is in a difficult situation during budget of wanting to fund a variety of programs. We are only able to identify one time cuts are one-time Revenue source. So for that year the budget is adopted to fund a program that really will need ongoing Resources with with one time fun. So I thinking in the context of this conversation for the sweetened beverage tax. I think that they and correct me if I'm wrong types of my bro Brian the thinking is Is to not go back and try to unwind everything that was done in 2019, but moving forward to make sure that additional programs that are currently funded with other resources aren't sweetened beverage tax isn't being used to fund those existing programs and instead are only being used to expand programs that are already funded with rain beverage tax revenues or to find new programs that are consistent with the policies outlined in the sweet beverage tax. We're digging deep into the complexity of the budget and it's hard for me because I haven't I haven't turned my budget brain part of that on this comes on at the end of September. I want to go back to kind of the root of my concern because I think we touched on some of that stuff. It's hard to tell because it's it all once it becomes general fund money just goes in the pool and no one says which year did this come from property tax? If this come from sales taxes come from whatever was but we know that there is a lot of needs within the community and the mayor and we have challenges challenges to meet those needs to save those are probably types of programs that may have been funded in part by one-time funding before and they're looking for Sustainable Solutions that isn't a budget challenge that we have and we'll have going Forward and we absolutely need to struggle with that to figure out. What is the best way to do that. It may be that we have to cut programs or maybe that we need to raise additional revenues my perspective. But what happened last year is we chose to raise additional revenues and we raised those additional revenues by using the sweetened beverage tax, which was a we knew was a disproportional tax on low-income communities and communities of color and that's the heartburn that I have is that those if we need additional revenues to pay for these, you know, the people that are consuming more more coke because I'm Pepsi because they're marketed to our live in neighborhoods that don't have access to healthy alternatives shouldn't be disproportionately responsible for solving the homeless crisis the funded on the homeless crisis. We need more money for permits were to housing that's a hard call for us will have to go find revenues. But let's find a tax source. That is more Equitable than this. The only reason I supported the sweetened beverage tax. Cuz because we would be investing that back in those communities along the guidelines that we laid out here. And when does supplementation happened last year? I felt and I logically heard from community members who felt that. Hey, this was not what we sold to our community members when we said you should support this text on you, but it's okay because both attacks on you. You're going to get more benefits back to Fresh box really education through Food Bank, whatever that that set of Investments is and that's that's not what's happening. So I you know, the intent of this legislation is to go back and honor that there's language in there that talks about some Plantation. It's it's a little bit tricky on how we do that, but I think the language in there is a strong as I can be and that leaves other budgetary challenges. How do we find enough general fund budget to find all the programs we have including the base amount of some of the things we're talking about here. And that's what I think we're asking the mayor to do today is as you're forming your budget for 2. 20 don't take from the screen beverage tax figure out other sources if you have to make make Cuts here and there to do that and that's what you want to propose to us. Then we'll consider that if you want to find additional revenues somewhere else. We will also consider that I will say right now if those revenues are disproportionately falling on low-income people to find Rod a Citywide and it is unlikely the support that but that is what the mayor's job is between now and September 25th, and then we take over that job for the following six weeks and come to some conclusion. I would just say that you have for me it's it's really important to make sure that when we're talking about the expenditures. We are acknowledging the commitment that we made when we all voted in favor of this that that we recognize that this was a regressive tax. That was just before she going to impact Lillington community. but as a result, we have an obligation to members share the concerns that council member O'Brien has Express with regard to what appears to be a diversion from that commitment and that intent that was originally laid out when we first legislative this this particular tax and would like to see a path for us to get back on the right track in terms of how we are going to fulfill that commitment to community and I would also say that when we're talking about the supplantation issues and I think it's really important for us to be clear about what The impact of this bill as proposed by council member I will have on some of the policies that I see is some of the programs as I see clearly within the rubric of commitments if it's a community, right and it is very clear that the individuals who greatly benefit from programs like the nurse Family Partnership program the child care assistance program and the parent-child home program are the same exact populations that are being disproportionately taxed in this area. And so, you know, I feel strongly that that we need to continue to make really clear that we're not backing away from those Investments That infect what we're doing is wanting to protect those Investments as heard of one of the primary investment areas that we considered and debated and made policy choices about during the deliberations of the sugary beverage tax in and so is a little concerned when we first started this conversation that there was some moving away from those programs that created anxiety for me. And so having a better understanding of the true intent here is really really helpful and I would like to apologize because I assume that we were all on that same Peyton and I was speaking about being able to reach 2000 families when there's actually 122,000 families that assistance and taking away from that Revenue really did not help what we were trying to heal fully agree with everything. You said this or something is that going forward is going to be to really understand acknowledging the commitments that we made in last year's budget what programs might be cut or what are we going to have to backtrack on that? We are committed to last year and I don't know that at this point if it turns out that way. Have a lot more money than we anticipated and we can fulfill all of the commitments that we made last year. I'm going to feel good about moving forward with that at this point. I'm not sure what programs were supported by the money. That was actually supplanted. What are those programs with specificity? I'm going to ask Yolanda. I'm in a leaving work with me if we know and if we don't know then we need to ask the budget office for that. So we've got a real clear commitment. I think I would just know that it was it was anything funded with the general fund frankly so that the choices in terms of what it is not funded or finding a new Revenue Source would really be anything that was funded with general. I'm going to call it General General fun. Cuz the sweetened beverage taxes is also was in the general fund and I think I think that therein lies the challenges that we can identify all of the programs that are funded with one-time ads or cuts and that might help narrow the universe of of programs, but I think The hard the good in the bad is that it is anything that was funded with the general fund. It seems to me that the irony here. Is that the The question posed by camera bag has a question that we're all struggling with but is the one question we can't answer because we don't have a dedicated fun that allows us to do that kind of accounting in the tracking. So that's to me that's the the irony of the situation in the conversation. And I think the reality is is that we have to make difficult decisions and budgets all of the time in this context. We made those difficult decisions when we considered the creation of the sugary beverage tax and defined clearly what the investment priorities were going to be. So anything that was funded outside of those spending priorities as adopted by the city council are are the things that were likely inappropriately funded. So inappropriately in this ends of it fell outside of the rubric of what we said the sugary beverage tax revenue could be used for so And I think I think I think it's almost have to inverse it and say what are the things that we did fund based on the revenue where they funded at the appropriate level but for supplementation if the answer is no they weren't find it at the appropriate level, but for the supplementation, then it almost doesn't matter what other things were funded because we know that the things we said we were going to find didn't get funded programs into a propria question. I don't know that there's a real answer for that other we're ever going to get one. I mean, I think my sense is the answer is that the budget process it is the entire budget document that shows all the mix of things we spent on in. No way means, you know, the mayor could come forward and say know that those specific dollars went to this program may be accurate or not, but it's but it's somewhere in the And we don't really know when it all got mixed together. My concern again is that we made a commitment or at least I made a commitment to community members that we were going to tax them. The. Tax would be dedicated to additional investments in their community and we didn't do that again. I want to be clear that the mayor the mayor didn't go to buy a new car with this money. She's investing and other things that we really care about. I just don't think it's fair to tax these particular community members to make those Investments and I we could sit here and talk about this for the next four months, but I don't think we're going to get any more clarity in the question. I'm asking my colleagues to consider is if you agree that this population is central portion taxed by the sweetened beverage tax should not be funding the broader fundings to must put that money in a bucket and reserved for the general budget, you know, we will have plenty of hard discussions during the budget as will the mayor is she proposes the budget but let's take this pool of money off limits for that. And I know I really appreciate you all being here today. I appreciate you being here a couple weeks ago. I appreciate your ongoing engagement for the month before I really want to do whatever I can to let these people get back to doing their work and not keep dragging them back here. They're the question before that. They're asking me is and in the next panel to this money was intended for us. We have to come here and keep defending it and I won't say no. We want a block that off will have a big budget fight over. You know, what else we want to find in a couple months the let's block this money off today and let these people get back to work and will resolve that other questions as we work to the budget. I'm going to end this because we have other items and we will continue this conversation. Thank you. I want to completely respect and say I appreciate so much on the heart that I hear from you and have heard from you all along councilmember O'Brien you are committed to living up to your promise. So I want you to know that I appreciate that where I'm coming. From is not inconsistent with that but I feel that we made some commitments to our budget last year. I want to know what that is. If it's permanent Supportive Housing if it's the nurse Family Partnership, if any of that is going to be implicated. I want to hear from our budget office, but we can do that after today. So cancel present here. I'll do you want to put in a final words on it again? I'm fully support what you're trying to do an in and I think we all should I felt that when we articulate I had a lot of heartburn even support the tax and then because of what you said that is where this may that's why I'm so passionate the Thirteenth Year the Thirteenth Year program near and dear to me cuz quite candidly black and brown people are the beneficiaries of that the impediments are going to to a school. And so that was real those are real dollars that we are only for five years, by the way, but I figured we can get the program up and running and then we can figure out of the way to do it. So so short of I like the concept of that sort of You could manage her to speak that we're going to really try to pump back into the community and so bed will probably have some are against, you know, if I mentioned child care assistance program in there in about that bucket to it and it in a good way, but I like the concept of keeping it in the community. I think we all states where the money is supposed to go. I would love to get a sense. I'm timing on this because I'm ready to vote on this and at least lock down where the money is collected from sweetened beverage tax goes because whether that where that money is being used for permanent Supportive Housing or you no more Public Safety or expanded community service at Community Center hours regardless of what you put on that list. I might say No, it should not go for it if it's not on the list, so I don't need to fill in a plane. Accounts for vote so I have signaled multiple times here. We will continue to look at what would not be spent or what programs would be defunded a reduced if we move forward in 2020, if you're talkin about wanting to make sure we've got the ordinance and place in 2021 and thereafter. We still need to consider about what that looks like, but I think we've got two weeks and I'm sure that on September 25th or what but I really would like us to have some information about that by within two weeks so that we're not just left with somebody say, oh you got a $5000000 hole in October. We need to be thinking about this as we're going forward. So we'll have this opportunity of the next two weeks and have more clarity from the budget office about Applications are in what happens if the city budget office doesn't provide us a satisfactory answer. We have an opportunity to make our decision then. All right. Well, thank you all for coming really respect all of the work you're doing and again, I just want to acknowledge that council member Bryan you're pushing this for all the right reasons and question just a central staff the idiot. I'm sorry, honey. None of that was going to ask was I thought part of your proposal was some of it would go toward that but during the first round we came up with that money from One X sales. Another property was like 15 million or something like that. Okay. Thank you. Thank you for coming and if you'd like to read in the next item, which is EDI. 402 and ordinance related to funding for the Equitable development initiative and affordable housing for Dana fun for short term rental tax revenue. An ally again. Thank you for calling welcome and we have Nora. Okay, I think so. Okay. She got through security. All right. So I'm Ali when she introduce yourself calling and Nora will go right down the line Central stuff Alliance. Do you want to introduce this or shall we do what we did last time which is start with Colleen and just talk about the implications for you what you're replying to do with money, Congratulations again for your Chief Seattle club and the Lazarus day Center construction project. We're very excited to be partners with you on that. Thank you so much for having me. I am really honored to be at this table again to tell you about our project and it really I'm highlight how the EDI fun has been so important for us just some setting of the contact is that as you all know American Indian Alaska native people have the highest rates of homelessness in our city the last point in time count, which was a more accurate account. Then I pass counter then the whole nother topic showed us at 10% of the population of it within our homeless population yet. We make up less than 1% of our total population. So that race disparity is highly incredible. I believe it is disheartening and something that we have our city should do better at and so I'm happy to talk about the EDI funds and how that has I'm traded at an opportunity for us to I'm really provide housing for our for Native community that is experiencing homelessness. The EDI funding came to us and I'm a surprise. It was something that we weren't we didn't know very much about and I just wanted to honor the people who have em initiated this much way before I was ever involved and they had the foresight to recognize that the displacement displacement was happening and happening quickly and they set up a beautiful fun for us. I'm of course it is way limited because it's not as a dollars are not as much as we'd like them to be. However for our project a small organization like the Chief Seattle club that did not have a huge amount of assets. It was incredibly helpful for us to get going. We received $750,000 of that funding on that went all to pre-development and that was so essential for us because we just did not have the experience we had the gutsiness and we had a passion to like move forward because we knew that we had to do something but those dollars were and just imperative. We just wanted to say he was thanks to I'm opcd. Start with us to try to figure out how how to get us a dollar. So that was hard because we hadn't done this kind of work before. I'm really excited to say that we go to Construction in November. So we will be creating this beautiful building of 80 units of housing. One thing. We really love about the building is that we believe it'll be one of the first buildings in our Downtown Quarter that's named Alicia schuette name soda be the all building which means home and we hope everyone thinks and talks about that name because that is part of of of changing what has been the norm in Seattle for the past many here is an English into the prominent language what part of equity in our city is understand that we are in a coat sale in the Kansas territory. I can talk to you forever about this project and I've almost everyone I will be in council member Bojangles office soon. So you'll hear more from me on Friday that I just want to thank every On the table and especially councilmember Bagshaw for your continued support and love for the project be to see it and feel it. Thank you. Kind can you really am really excited and other resources to build this whole project that he died money? What piece is it funding for your project? The early architecture issues we had right we had to like understand the site. So we did Geo surveys. We did Waters surveys. We have a square but weasels dollars to realize bad idea. And so we use those dollars to I'm get all the pee development work. You know, I'm done and I'm it has been huge. The other thing I'd say to is it helped us with this capacity organization is grounds with 75,000. If it was just let's get Chief Seattle Club on staffed up appropriately to do this. Because it is you know that undertaking but it's also I think that what is amazing about this funny to is that people of color organizations that have not been really have not been allowed to buy government to build housing. This is a remarkable because we're doing it and it's I had a friend who's done a lot of development is that calling? It's not rocket science and I always hear that in the back of my head the other week. We have the knowledge of ancestral knowledge as well to know how to do this. Thank you, and I just cannot keep enough Praise on you and your bored for the work that you've done, and I also want to acknowledge how much support you've gotten from Pioneer Square from your neighbors from people that are there. And also I want to say thanks to S. I appreciate the fact that it has been willing to look at the hole for 10 square and the approach because one of the things you told me early on was that you wanted to be able to use that property out front as a community Gathering space or welcoming space and also has essentially a job training opportunity if you have the cafe if you were able to sell native jewelry on site it is that kind of development word talking about so well done. And thank you are excited about how things are going. Thank you. Would you like to proceed please? I'm so honored to be as well just saying and since we're alone, I mean power to the community coming from Africa. Mission and Community to provide a model that focuses on training one-on-one coaching Marketplace and Seed capital and I cannot win this one came to us just like you surprised I was not expecting it because he was married to self find it and I mainly started because I saw a tremendous amount of potential in my community not just Somali Community, but I'm thinking about African black women who has been doing this for years in the city from an equitable items that is unacceptable because we live in the most beautiful progress the city of Seattle, but joking about the echo. Helped us. If you give us two things the stability to remain on the course and push forward and really rely on the resilience and strength of our community and use that to move us forward. And another thing is really a verb. I'm still the face that I have and we have with the board in the community members themselves that has to close. Both genders are the service providers without institutions currently in progress Fine Art institution academic the face that we're not alone and it's it's as if I don't have a small because it has done tremendous amount of marketplace. So that's currently in progress. We decided to have our own place and they will also find it on my face because you're really based on the North and as well and are demographics so far. It's It's it's a bit diverse. So we want to make sure that they get the strength. They need to be able to do the marketplace and you want to get the screen that we need to do that. But so far the funding is really benefited Us in hiring a program manager for the first time being able to find my salary as well because I work for free almost for 2 years and what else commercial space for black women-owned businesses in Seattle. So that's in progress and we're working to make sure that we get that at some point. Cancel my God. I'm so sorry. Can I add something one of the best things to do right now is really Sharing The Narrative of black women in business and we realized that yes, we can do technical support. Yes, we can focus on hiring people but honestly speaking from doing this work and for my own personal experience as a black African women sastre or immigrants and is that people not aware of the value black women describe bringing to the table. And thankfully we got 10K from the funding to be able to develop a beautiful special film that is going to take that. We going to show it in October sometime in partnership with Diego without grades don't make her stories and talk about data because we talked about gentrification because majority of our women members have been gentrified. It's been so sad like sometimes I find myself crying Introduction to problem is rapidly increasing and we don't have enough capacity over. This is right that you'd like addressed things. However, collectively I do have to hope that somehow we can come to some thank you very much any questions today and talking about how you've accessed the ethical development initiative funding really appreciate that the EDI came in a fifth time that he was like. Wow. This is an amazing resource and the people have been doing trying to find resources for years and then there's been some amazing work to help inform the council getting behind the anti displacement work take so many forms are City, and I think it's really easy for me to lose sight of what that always looks like affordable housing is a huge piece of that because I know people are being displaced cuz they can't live here and we have a bunch of tools for that not enough. We need more, but it's not the only reason I'm the only tool we need to have and the way you both described here today as this flexible pool of funding that can support housing like it did the Chief Seattle Club, but can also support other initiatives that are anti displacement initiatives is really it is really just great to hear and great for me to kind of internalized too. So thank you for that. How do you want to address some of the financial issues here? Sure, so I will describe Taco Bell 11940 to that would establish a fund and financial policies for short term rental tax revenues and describe describe some potential options for the committee's consideration. And thankfully this is a little more straightforward than the previous Revenue source as well as discuss on June 12th, the original intent for the short term rental tax was to generate ongoing funding for the Equitable development Initiative for Grants made to communities and the goal was to generate at least 5 million dollars that would be available for Grants. I was cut the president Harold mentioned originally the Equitable development initiative grant funding was provided with one time funding from the with interfund loan from based on the sale of the property across the street then following that there was a commitment that the council would identify an ongoing Revenue Source in that led to development of the short term rental tax. I'm the so the initial intent was to support Equitable development initiative project grants. And then as a secondary goal to provide additional resources generally for affordable housing in to provide a resource to pay the debt service on the bonds that were issued for affordable housing the spending plan in the 2019 and 2020 budget supported several Council priorities broadly speaking related to EDI and affordable housing. However, the proposed budget swapped short term rental tax proceeds for General general fund resources to fund Office of the office of planning and Community Development Staffing and consulting services that were previously supported by general fund dollars with some expansion and to direct money to support permanently Supportive Housing operations, the maintenance in a rental assistance programs were consistent with general counsel priorities were not consistent with the original intent for this Revenue source. In response to the marriage proposed budget Constable 11942 was introduced last fall during the budget deliberations to create the fun in adopt the policies that would have would have restricted use of those funds. However, because the council is unable to find the ongoing resources to fully Alive align the proposed spending plan with the original intent and at the request of the central budget office the council did not ask them the bill at that time and instead adopted statement of legislative intent 1 - 5 - b - one that asked the budget office to prepare legislation and proposed Financial policies by March. I'm at that when that was you instead of transmitting legislation. They submitted a letter suggesting that they agree that a fun should be established, but they would propose legislation when they transmit the budget in the fall of 2019 because that legislation wasn't transmitted councilmember O'Brien requested that Central staff work to identify any necessary changes to cancel. 119 402 to allow Council to act on that legislation prior to budget deliberations and to establish policies on beginning in 2020 and Beyond So what I have done in the memo is Outline Three potential options at council could consider in modifications to council Bill 11940 to the three options would all establish a fun for short term rental tax revenues. So we could be clear about where those dollars are going and it would amend the bill is introduced to have it put in place in January 2020 rather than January 2019 since we passed that date, the first option that is on pages 4 through 8 of the bill if you want to see the details would establish Financial policies that direct spending of short term rental tax revenue exactly the way it was originally intended when the council adopted the local tax. However, if adopted that it would be inconsistent with the 20/20 endorse budget and it would require likely cutting resources for the criminally Supportive Housing or finding additional Cuts or revenues to support on the ongoing operations and maintenance. It's about 3.3 million dedicated for that as well as identifying about 1.1 million dollars to provide funding for the staff and Consulting Services. No PCD. Option two witches on page 9 through 13 of the memo would establish Financial policies for 2020 that are consistent with the 20/20 endorse budget. So it would provide about four million dollars for EDI grants would provide about 1 million dollars to support Staffing and consulting services and would continue to allow spending on permanently Supportive Housing and to pay the debt service on the bonds issued for affordable housing and then beginning in 2021. It would go rude to go back to the policies that were in the original that was the council original intend that word again require because the the funding for apparently Supportive Housing is an ongoing need it would require likely finding other resources at that time. So there were essentially push the the challenge down the road and potentially provide more time to identify new Revenue sources. Option three wood similar to option to 42020 would establish policies that are consistent with the 20/20 endorse budget for 2020 and in 2021 in but beyond the financial policies would first prioritize paying the debt service and bonds issued for a portable housing direct the next 6.1 million-dollar in revenues to EDI. This would include $5000000 for Grants made to community and 1.1 million for Staffing and consulting services. And then for anything above that would provide more flexible use of any excess revenues that could include additional funding for UTI grants including the affordable housing component of those projects or the support affordable housing generally and included in that could include payments for ongoing resources for operations and maintenance for a permanently affordable housing. These could be you don't mix and match or additional options could should be included but I wanted to lay out some alternative approaches for the committee's consideration. Cast member Brian you want to dive in? Axios much more clear than Alexa Bliss Ice Complex. I just say the last one. So I don't have much to add. I'll just similar. I think that this style of the sets of Investments. I can't remember the exact number but I think they're over 20 applicants for the the pool of money last year and refunded a fraction of them and we know that every year as more and more organizations get more familiar with this I expect to see more and more applications for it. And so I imagine this is a pool that we want to grow not to shrink and so, you know, I'm looking for support of my colleagues and happy to have discussions between now and the 10th of July on how we can get as much money funding into this. It's a little I mean one of the tricky part screen right now is we really don't know what the we don't know how much money we're going to receive from the short-term rental. We're receiving the money but Navigate me to tell us a little bit about the status of a good the data coming over as a little complicated and hasn't been told me that Jesse gets we don't really know for On Target ahead of Target behind Target collecting revenues at the beginning of this year. And it is it's a Convention Center tax. So goes to the convention center and then any money any revenue generated in the city of Seattle comes to the city. So there is a delay in us doing what the revenues look like today. I think initially the budget office had thought we might be looking at last Revenue that we had originally projected. It. Looks like we think we are on track to stay close to the 10.5 million dollars that was proposed in the adopted 2019 and 2020 endorse budget, but we really won't know until early next year how much revenue is generated and you know, hopefully we'll all be pleasantly surprised and there will be excess revenues and that could help some of these problems but going Into discussions of the 2020 budget we won't have enough information to really know if they'll be excess Revenue. Hope in that situation would be in last year's budget the proposed budget only included for million for Grants and then a million dollars for for Staffing and we were able to boost up that 4 million to the 5 million dollar and grants as as committed without cutting anything else because we found I think Community Development block grant money, which is somewhat restricted and not great got us through 2019 budget proposal options and I would be really interested in figuring out how we can make sure for 2020 we can also get 5 million in Grants. And so that's a conversation that I would love to try to put some parameters around, you know with this legislation recognizing we may have Confusion work on that in the budget perhaps some version to talk about, you know a chunk going to the bonding a chunk going to what was in the twenty20 endorse budget, but then the next you know, if in fact the revenues are coming in slightly higher than we think you're above we better do for that that would go towards turns out you know, because this is a relatively new Revenue source that we still don't have her hands around. I would love to put some language in there. They're really strongly pushes. You know, anybody above the five the 1.1 in the 2.2. Whatever that adds up to a point three, maybe somebody that some of these for the next few years. I think that's going to be a an important Source place to invest Thank you very much. Thank you for thank you both for taking your time to come and join with us and I wish you the best with all the work you're that you're doing. Thank you for the day. So I'm going to excuse myself and purple shoes today. Alright, just wait in the next item. Thank you. I don't ever for a councilwoman 9552 and Ordnance related to yesler Crescent Improvement Simon an ordinance 12572 for Wichita to the 2019 budget including the 2019-2020 for Capital Improvement program. Excellent. Thank you and Christopher Williams. Welcome Tracy rats. Will thank you so much for all of your help. So are you going to introduce a Tracy 2019-2020 budget discussions you added about $270,000 additional funds to the yessa Crescent Improvement project. This is a CIT project that was actually funded to the tune of about $500,000 by the executive in the 2019 budget you wanted to Understand perhaps how that $970,000 of total funding might be spent for the Proviso on that money and asked for the parks department the executive working with other departments as well in the community come back with a proposed spending plan. And so what you have in front of you is the ordinance that releases the money and also attached to the Cisco note is a description of how the funds will be spent. Thank you. It's one of the best summer he's ever and Christopher. I'm going to pass it to you, but I want to acknowledge us a huge thanks to you and your team you are always so gracious and have been very involved. And I also just want to say for my colleagues. This isn't just about Parks. This is the King County building across the street. We've been working with them the ESC Sound Transit across the street big focus on the community engagement, but what you are doing in City Hall Park in yellow Crescent is making a huge. And I want to acknowledge that we say thank you. Thank you very much. So maybe I'll jump in there. We're proposing a set of intentional people-centered strategies to make City Hall Park Century work better have the strategies build on the successive the prior-year that people centered strategies focus on people versus are traditional focus on built environment. We want people to use the park. The goal is to create a vibrant to create vibrancy in the park increase public use while increasing the public perception of Safety Research shows that people report feeling safe and parts when there's lots of activity activity and activation going on. So part of these expenditures are divided into capital and operating we will spend over the next two years roughly $306,000 to invest in operations that's activation and a whole series of things will go through later and then over the next two years will spend about six hundred. $64,000 in capital investments in the park. So the first $58,000 will go to enhance activation City Hall Park including music art food trucks replacement of concrete benches and chairs. These features have already been improved by the Pioneers Pioneer Square preservation board. I should note that any changes to yes or crescent or City Hall Park need to go through the Pioneer preservation board. This includes activation of the activation of Billings way. We will feature eight lunchtime concerts in the month of July in August over the 9 to 10 weeks of activation. We will be using to well-worn tools to get the public out that includes activation as we look at ten of the hierarchy of what's effective safety safety enhance maintenance inactivation. We know that activation and bringing the public at works the best so we'll leverage those. Rules against a creating a better public experience in City Hall Park of the second thing will spend money on is roughly $50,000 on enhanced site maintenance including cleaning of the globe's adding additional lighting tree pruning and all of the enhancements features. That is the other part of that three-legged stool. This also includes revamping the lighting in the Jefferson Ali-A. This is the lighting that I rather this is the alley space between the park in the courthouse already have Cafe style lighting the goal is to get more of that lighting perhaps across the street to the sound transit station, and I'm told that we could have that in place as soon as next week or the week after is so great and I really want to acknowledge Victoria Schaumburg to you. She's been wonderful at responding to questions. Your whole team Christopher has been great last summer when it first came up that we needed to be doing some things differently you had the trees And those clothes cleaned and the King County colleagues there with Carolyn Wayland and our team of Judges that were so worried about the safety of all really stepped up a signal sending a bunch of folks at parks. So the next Toronto funding will spend $75,000 of King County Levy money to transfer money from King County Levy to DeLand. So that deal in can work with a Pioneer Square Alliance to develop design guidelines for any future changes to City Hall Parker Prefontaine, ultimately again, any changes would need to go through the Pioneer Square preservation board? Can you talk a little bit about how that money or maybe another category a bucket of money will be used with our friends with the pilot Pioneer Square Alliance because I know they're putting in $100,000 that they identify to a grants or so. How how does this work together? So that are not duplicating so That's kind of on the capital side and we will work with in coordination with a Pioneer Square Alliance to explore options for connectivity and activation between City Hall Park and Prefontaine Fountain this includes hiring a consultant to work with the preservation board. This funding will support kind of a comprehensive look at options for Prefontaine fountain at with a focus on connections and connectivity. I liken it to an example of moving furniture around in your living room to see how your creator to the best of fit four people. The idea is that what comes out of these recommendations will be funded as hard Capital investments in 2020 $75,000 from the spr operating budget to the Pioneer Square. I'm sorry to deal when to work with the Pioneer Square Alliance to map out those Sign guidelines so they can connect with any physical changes. We want to make down the road. We're also planning to assist in the public life study. This is another effort being led by S. And it really looks at how people use public spaces in Pioneer Square.. Again. The idea is that recommendations that come out of the public life study could be funded next year with a $364,000. We're setting ourselves up to do that and your staff. They got 43 volunteers to come out last month and do those public life study count and it really is helping because where we have for the first time zone data to know where people are and what's going on. Wonderful. So we'll work with us. To complete the public life said here actually transferring $50,000 to us. To complete that work. Oroshi looking at Fortson Square planning and Design This is for s. In the office of arts and culture to propose solutions for Fortune Square. And then just to throw one more thing in your way at Colleen echo-hawk and her design team have been fabulous hand-in-hand with them be $4,000 which will be deferred to 20/20 to implement recommendations out of the public life study. Alright, so any other questions for my colleagues? This has been really important to me personally, and I thank you for your support. So I moved that the committee pass Council Bill 11955 to any questions. Thank you very much. Appreciate it. Thanks again for AC. Okay. Alright. Final item today Bobby Humes. If you would please come up. Deputy Mayor mostly Miss Deborah Smith to do you want to join your welcome to thank you. Well, I suspect mostly will start with you and I both of you will give us your names for the record. But I do want to say thank you Bobby. You answered supplemental questions from our last meeting. I also appreciated your additional resume information because it's so rich with things that we all wanted to know. So thank you for doing that for David Mosley Deputy Mayor. Just nice to be back with you again. Then we had a robust discussion at your last committee meeting and very pleased to be back before you did it again today they have mr. Hyunh provide any supplemental responses that the council would like I would like to Simply notify the council that the I bet a hard stop at 4. Clock so I may need to pass out to Matt. Passed out. But I know you will excuse you in 17 minutes. I also have a hard stop at 4 or just want to let you know for voting purposes. Very good. Thank you. Maybe the shortest meeting in a long time where we have talked with the director to be but Lena. Would you please read that in for me? I don't know if I have appointment number 01370 appointment of Robert Humes as director Seattle Department of Human Resources meeting a couple of weeks ago where we grilled you quite extensively on your background and there was some additional questions and I think that these are all have all been given to my colleagues. So I think when we last left it there had been some queries made about the time between jobs that you've had. My understanding based upon people I've talked to is said they say, yep. It's true that he changed his jobs every 2 years, but it's because he's been so good. He has been tapped to move on into other job. So I don't know if the two of you would like to discuss that further or but I think it's be a good starting point of the blessing I've had to be able to come into rolls. I'm in make a critical impacts And Timely fashion and critical attacks that still create value in the places where I work and to be able to be selected to compete for other opportunities has just been consistent and you will know that their insistence. So I'm as I move on moving within a system specifically with the the United States Army and then with the state of Washington and then even my last role in another system that the kids school district And I know that you were working as HR director in our parks department and we're tapped by the mayor to come and take over as the interim director. Do you want to talk a little bit about what is your experience been in this interim role? Absolutely. My experience in the interim role has been shaped by the the opportunity that I see within the department had to leverage key skill sets that are already there. We have a a great customer service of value-driven approach to how we do work. And I think there's an opportunity to tell a leveraged more inclusive action bringing more books to the table as we make decisions to create that I've been so that's been my my focal point also is to focus externally and how we bling Partnerships across the city to do the work that we required to do through the lens of of races social justice first and then to couch value in a project driven results-based work Council president Harold. Would you like to pursue any line of questioning from the last time to support him a fern affirmatively. I think I made my expectations very clear that I expect from this position in from him personally just to be a leader in inclusionary thinking and diversity that part of the vision for our Workforce in in I think Sarah tapping the potential of that office that has been up probably underutilized Citywide and so we've had our discussion certainly already sport Michigan's would like to leave in 14 minutes if there is no further discussion. I would like to move the appointment of mr. Bobby Humes. All those any further discussion all those in favor say aye and we have no extension. So congratulations. I also understand that you're going to be out of town. So we are going to send this to the full Council on July 15th, if that's all right with everyone. All right. Well congratulations. Bobby has been my pleasure to work with you on our City Employees Retirement Board on the things that you and I have discussed just about looking down the road to benefit employees with other opportunities to work and I'm very grateful. Thank you so much. Thank you Deputy Mayor mostly for coming and sitting through our first four items. Very good. Okay. Well this motion passes the committee has approved this recommendation. So our next meeting of the finance and neighborhood committee will be Wednesday, July 10th. We will take up again the sweetened beverage tax the EDI conversations. I've already submitted questions to the budget office saying let's figure out what if anything is going to be impacted so that we can come back to the table with the full information we want. Okay. Thank you. I hope the meeting's adjourned. Thank you, Lena and Allison for being here.", "end_time": 6425.6}]}