{"format": "raw", "annotations": [], "confidence": 0.954116619512683, "data": [{"start_time": 0, "text": "Good morning, everybody. Thank you for being here for a regularly scheduled Council briefing. I will. Not well this this morning we will have our state legislative session update which is sort of a comprehensive document that will review and then we'll go through a preview of today's Council actions and then we'll end with a fun and exciting Seattle reads and I'm presenting Marcellus Turner Chief librarian and we'll go through our Seattle reads a book or the city. So I'll say more words about the a present report. Once we go around the table to the previous today's full Council actions are all reserved seating. So then so right now, Let me know if you have to actually get on to Olympia. So we want to get your first. Thank you. Good morning. Good morning. Lily Wilson codega director's office of intergovernmental relations are guilty tractor Christina. Lobbyists. So we appreciate all the hard work in Olympia last week. Thanks to everyone who is able to make it down to Olympia. We are about a little over a month left in the legislative session and quickly approaching the next big hurdle this session the April 3rd opposite house policy committee cut off so I buy just coming out this week a lot moving. We appreciate many of you are working with us to The Weeknd on some of our highest priorities. And with that I'm going to turn it over to Karen Cargill our state director to give a quick session update before we dive into individual portfolios revenue forecast that came out last week just high-level numbers for the remainder of the biennium that they're anticipating about 300 million dollars for the rest of the additional 500. 50 million dollars for the next biennium putting an additional 860 $1000000 available funds and there's some mixed responses that we're getting towards those numbers as Republicans were saying that that's proof that no additional Revenue will be needed but the Democrats are taking a position that that still will not be enough to cover many of the needs that will be that they're going to be looking to fix this session McCleary a lot of the mental health issues. So on the same line by the house is really saying all of their budgets today, so we will be seeing their operating transportation and capital this afternoon and the sun will be releasing some of their sis but later this week. I know that we typically send out a little bit of everything each budget. We will do our best to get those all out today, but with three that were kind of an extra layer of complication to work there so we'll get this to you as soon as possible. And I know that a lot of you have different projects that are looking for I'm so those are highlighted. Please just contact us and we'll help. And whether or not they've been included in the different budgets. Any questions on budget Revenue to education at the big one I want to highlight is on page for that Senate bill 50313. This is the school levy fix another there's been several different proposals that have been put forward over there over the session. I'm in this was a new version that was heard last week and this would completely change what happened to create two different tiers for for adopting that Levi Authority. So for district that have fewer than 9,600 students the Levee Liberty lesser of two hundred and $2.50 per thousand of assessed value or $2,500 per per pupil and then for districts with more than 9,600 students Olivia the lesser of 250 / 1,080 or 3,000 per pupil. So that was kind of met with mixed reviews and I unfortunately don't have Seattle Public Schools interpretation about what that would mean for them. But different School District had said that it would work for them others that it did not so they're still working. That I don't think that this is the end of the conversation by any means. So again will continue to monitor all of that and keep you appraised on page six. Senator office has dropped a new real estate site at the Gretna graduated one. I putting this in the education section because this is the first time that she is noted that she would have 20% of the revenue that would be raised to this Progressive route would go towards education Legacy fund. I'm so go towards education dollars that be split to a couple other different accounts that would include the Public Works assistant account the city county assistance in the state general fund. So there had been some other re-proposal that one foot forward in this is the first time that there'd be a piece that would go towards education. So just are at least that percentage 20% but just wanted to highlight that and we'll keep track of that for you. moving on to an environment Sorry about the pages here. That's a question. I ask you ladies were thumbing through about the the the income or the classification of the students themselves in the districts. For example, if a school district regardless as to the number of students if they have a higher number on free and reduced lunch as an example, are there do they go to that layer of consideration as they look at individualizing the legend store Clio? I'm not I don't think that's being worked in this part of that part of it determine the local Levy lid piece. A lot of time that goes into the state the State dollars like the state will give additional dollars for school districts that have a higher low income student group coming in. So I'm happy to confirm that one. Okay, and other environment section so I still got a lot of movement on these great environmental priority is that we're working on the first on our list. Is that engrossed second substitute House Bill 1110, which is the fuel standards bill. So still moving along at moved out of the environment energy and Technology Committee in the Senate on March 21st, and it has not been referred to the transportation committee. This will definitely probably one of the more challenging places at this bill will be up against so we're continuing to offer our support and see where we can be helpful. I know that Comfort on someone's very kind to speak to representative. It's given a bottle of hard work on his visit last week. And then a new bill or not new but a resurrected Bill the third step of your house bill 1257 right below the last bill that was the commercial building performance standard. That bill did not make it past its cut off that has been deemed necessary to implement the budget so was actually moved up the Appropriations Committee last week and it's not in the rules committee at the language does not include the code that we had been working on an adverb the residential energy code allowing us that he used to determine if they wanted to have something that would be more energy efficient than what the state requires. So we're so supportive of a lot of the other Concepts that are supporting it but looking for other opportunities for incorporating dispatch code provisions and another big highlight 61512 build a big priority for City Light that moved out of the Senate policy committee this week and it's out in rules. So we were successful in getting that out of the Senate last year with some good bipartisan support. So we are working to achieve canister moving on to General government. I want to highlight the subject has Bill 1403 on page 10 minutes would be the simplification of the BMO apportionment. Formula. I talked about this a couple weeks ago. This was something that FAS was really involved with long with ewc Department of Revenue and Association Washington businesses, so they could come for with some suggestions on how to simplify the formula are they came to a consensus Bill FAS Joseph Joseph Cuna from FAS came down last week to testify in favor of the bill and we are anticipating executive session for that legislation this week. For wrongful death on page 11 sat Senate Bill 5163 public there was a public hearing last week and executive action was received on Friday. On wrongful death. Are we all speaking with the same voice in terms of Association Washington City city of Seattle on that bill AWC has still opposed the bill, but they are not vocalizing or working against the bill right now. I'm in the last that I want to fight for you is Senate Bill 5376 at some page 12 minutes. Consumer data and privacy Bill. If I let it out a couple times, this is Senator Carlisle's big effort for protection of consumer data being able to delete having some say about what that wear. Their data is being used still progressing and we had received a public hearing on Friday. And so we're going to be monitoring to see when I get schedule for executive session. And I'm going to pass it over to Christina for healthcare. So we're focusing on Healthcare. The first billing address is on page 13 at the top. It's 1394. And this was a related to behavioral health facilities and programs needed to ensure the Continuum of Care for behavioral health patients want to make you aware. There was a striker amendment that was included in there that came from center today and it passed out of the of the subcommittee on 20 seconds of the striker is more related to life insurance license. Sure. I'm not going to put on some licenses and certifications for intensive behavioral health patients and treatment facilities and it requires the Department of Health to create a certification for mental health peer respite centers. So this would be for for Pure run programs for people who are deemed not to need hospitalization, but just kind of ongoing assistance and help and care. How much money is attached to that? I am not sure I can get back to you on that though. I know but if they push behind the spell so and I think one of the sister said that her health is one of the big goals of this legislative session. They keep calling at the new McCleary even though we're still dealing with McCleary. So I imagine there's a strong fiscal note attached to that and then there was an amendment from Senator frockt as well, which requires the Department of Health to consult with Seattle Children's the Mary Bridge in Tacoma and Sacred Heart in Spokane before developing recommendations on youth short-term residential intensive behavioral care and developmental Disability Services. Great to get a wide broad some input from across the state on that one as well. So next I'm going to move to the bottom of page 14. This is Paige. Oh, I guess it's the middle of page 14. Sorry 1870 which is the Affordable Care Act protections this with it several several of the patient protections from the Affordable Care Act into state law the house version pass out of the Senate lung health and long-term service Care on the 20th, and the bill has been referred to Senate rules for further consideration. So it's moving right along and then the top of page 15 Senate Bill 54 32. This is the behavioral health integration of Behavioral Health that relates to fully implementing the behavioral health integration and it eliminates behavioral health organizations and divides their responsibilities between Behavioral Health administrative service organizations to administer the crisis services and the non-medicated services and Managed Care organizations to provide Behavioral Health Services to Medicaid enrollees. It also establishes a workgroup to better determine how Vonage access adult long-term inpatient involuntary care into the community and in state hospitals I asked on just on the previous page order is substitute House Bill 1531 on the medical debt strikes me that integrating the major pieces of legislation you just articulated and including this caring for the medical debt strikes me as being so important for the patients and particularly for people who don't have insurance and it what's startling and I know we've talked about this before is that if you don't have insurance hospitals doctors can charge you multiple times what the insurance has to pay and it's just so completely unfair and there was quite an article quite a good article yesterday and Seattle Times Sunday Times about that. So and if you know anything about it, if you could speak today, if not, if you could just tell me how it's going. Well, I'm actually trying to go through energex notes right now because she is the expert on all things Healthcare. Follow up with you though, too and rather than shuffling through papers been respecting our least I'm letting her know if she wants to call. That's why and what we can do to support his I'm sure she would love to talk and thank you for sharing the article have to go find it about the bottom of page 14 is referent. It's his opiate opioid use disorder and refers to 5380 little bit about that and also the last briefing I made a request around the implementation steps necessary under Ricky's law to bring on drug treatment beds and where we were on that because there are some requirements built into the state law that was passed a couple years ago that says we have to actually have a certain number of beds built and so I I'm just really interested in knowing where we are and meeting that that's what a baseline criteria. Before we can use the authority in that I can speak to speak to 5380. So that focuses on treatment and Recovery pregnant and parenting women, which is the typically underserved population on this opioid overdose reversal medication and people with opioid use disorder involved in the criminal justice system. So it's a wide swath of people that this would be assisting with assisting she's being it had a hearing on the house and that house Healthcare Wellness committee on March 19th, and it's scheduled for executive session on the 27th. So it is moving right along I can get you an updated and now that is dollars the question. Thank you. The question I have around the implementation of Ricky's laws about Capital dollars to to build sylheti. So I'm still handle on where we're at that has been an ongoing question down there to I'm with the with the mandate to have these beds and lack of capital to actually put these beds in order to so I know that's an ongoing conversation. Especially having represented Davis who was the Chief Architect of Ricky's law in Olympia working on these types of issues. It's definitely not been left by the wayside. I think it's just one of those other bills of competing for capital of this point and I think that we'll see a lot of that when the budgets are released what how they'll be all the different cameras will be perfect. So that's that's the answer to the question of what this year's budget has in it, but I understand that from last year's budget. There is there is some projected number of beds that are anticipated to be built this year from last year's budget. So I just it's a it's a multi-year effort that had that that has to happen before again, we can implement the authority so I don't just want to know what's in this year's budget. I want to know what progress we've made with fire budget allocations where we're at in terms of developing not capacity now to follow up on that. Another question on Healthcare. So I'm really excited about three bills that appear to still be alive. I know there's actually a lot of healthcare bills this year, which is also very exciting. I just wanted to say in anything that we can do to underscore support for 5822 which is the evaluation of the physical Universe really excited to see that move forward and then and companion builds 1523 and 5526 looking at additional ways to ensure that there is quality affordable health care of the individual market and to use for very long time. Would we put in the implementation of the Affordable Care Act in the creation of exchange omigod? When was that? Not now almost a decade ago. These are some tools that we've been waiting to use actually greater stability. So very excited to see that move forward and thank you for having it on our list. But if there's anything else that we can do to help move it along or provide testimony happy to do so will keep you posted. Reach out to her and she might be able to steer you in the bus Direction on that to there probably are some members who could use a little bit nuts and it is really exciting to see if any health care bills this far and sessions. So we're making good progress on anyone else for healthcare. All right. We're on the housing. So on the on the bottom of page 17 flashlight, it's fun. And it's the bottom of 60 in the top of 17. This is that the bill that we discussed last time, which of the last season counties to use route to for construction of affordable housing and Rehabilitation of facilities for those experiencing homelessness. It was hurt in the senate in the Senate housing stability Anna for on the 20th, and it's scheduled for executive session today. So it's really on a good path. It's got a good amount of support. We we appreciate drawing our attention to the need for this right away. And it seems like others are very much seeing the deepest. Well, so we're very excited about that. And then I also wanted to touch base on our favorite Bill 1406 local-option Bonville on it. So it continues to be moving along its actually scheduled for executive session today. There was a great public hearing last week Emily Alvarado from the office housing spoke a lot of support on the So we're very excited about it where I'm prepping for when it reaches the Senate budget negotiation points of how we can continually expressed that this is a big issue for us. So they're correct me if I'm wrong, but are you anticipating also the potential Republican support and committee on this till they start so you never know what what could sway their opinion but regardless we have enough to pass out of this. And then the last one I have for you is another one of our favorites. My personal favorite is exemption for homeless encampments in shelters so that it's at the bottom of page 18 59-46 introduced by Senator. When this this is the bill that would exempt under a state of emergency is City to to help put up projects without seatbelt exemptions that would cite Saudi sanctions shelters and encampments within City Limits. It came out of the Senate with a couple of problematic amendments for working on addressing them one is about the space between these encampments in schools. Right now. We have came out of it. I believe within a minute by Senator King to have a thousand feet between these and schools but schools also not just your traditional notion of schools, but there's also Early Education facilities daycares. I don't know if my neighbor is running a daycare out of her house. So it's hard for the city to make sure that we can actually find a viable. Place to put these with that thousand foot limit for working on language around that to bring that down to a more manageable and we do understand and respect why people want to have space but having too much can really live in our ability to do what we're trying to do here which is helping people. I had an interesting conversation this week with someone who was saying, why are we only doing CGA exemptions for homelessness? What my project Taken 3 years to get to the office I said because people are dying. Sorry that's going to Trump everything. So we have other cities are going to sign in support of signed in to support on that. Excuse me, and we have a hearing today. We have we have quite a good lineup set up for this too. And we're literally right now still working on amendments for this another one that was problematic was around drugs and alcohol. So Senator zeiger put this in on the senate floor and it would prevent these camps from allowed camps and shelters are allowing drugs or alcohol within them right now with the exception. That's pretty much how are shelter Services run. We're really concerned about having that provision because there could be an instance like that every 20 years foot and a half of snow that happens and this would force us to turn people away who really needs shelter the whole point of this no matter what the what are we talk with individuals going through? So we're working on removing that so we're even we barely have the boats to do that just in committee. I'm to remove got to be to be able to help people who need help not just a certain section of people can we offer her and maybe they're not interested but the statistics that have come out of 1811 East Lake and how strong and supportive that has been how the community is ultimately come around and thing as a good thing getting people inside and also if there is a distinction between using alcohol or drugs inside and selling I want to make sure that that's really clear because everybody that is operated these the shelters have said that the power Dynamic shifts if anybody is Selling drugs inside the shelter and I want to make sure that there's a distinction between know that's not going to be allowed people are going to be booted but to allow what people need to do. Yeah, I think that overall point with this as we know some people are coming to shelter not not quite sober, you know, they're still trying to figure out if that's a choice they want to make themselves or if it's a choice. They have the ability to make for themselves about some medical assistance as well. Not all of them have caseworkers. We just want to be able to provide a safe place for people to sleep at night that's really important to us. Especially when we have a snow storm or the flooding somewhere. If we eat, you know, we don't want to have to turn people away who are asking for help. That's the intent of this bill and we're really lucky to have some it or when is a champion on this. He is all in on this and he is at a lobbying expert himself. So we're very lucky to have him at work cited for the hearing today. Thank you. Any other questions and healthy, thank you. Mr. President. It just are you done at the what the housing presentation team the city Lobby team and executive for working with us. And that is House Bill 1923, which is about greater density for cities around the state. Thanks to Joe Fitzgibbon first one and then companion builds 5812 which is a senator of Columbo and Bill just want to reiterate and confirm that the city of Seattle is supportive of these bills. We are excellent. Okay, great. And I hope that that clarifies the record for a confused representative Gerry pollet who had indicated otherwise both on his Facebook. And in the Seattle Times. I think that this is really important that were very clear that especially on 1923. We have unified messages that are coming out of the city and a number of other cities. We have Everett we have to, we have another number of other friends across the the state for saying when it comes specifically to addressing the races redlining history that is embedded in our zoning policy. Do you need friends at the State Legislative level who helped who can help lift the floor and I think we've done this a number of times when it comes to working with our state Partners on creating a new floor when it comes to labor standards minimum wage sick leave. These are issues that we never want to take away their responsibilities and and ability for cities to raise the bar above a new floor. I'm so we've allowed for states to do that. Minimum wage and sickly for example of protected safety for workers, right? We're asking our estate Partners to step up and create a new floor here and I brought these two bills last time we met because they're getting a lot of attention as well from our national Partners at the National League of cities who applauded the work that our state legislature is doing as a partner with cities because when it comes to trying to address the housing crisis that we've all been trying to still I'm with the tools that we have in hand at the city level. We're going to continue to have a patchwork like approach. When what we need to do is help raise the floor across the board. So I wanted to say thank you for all of your work on this and I reiterate our strong support and appreciation for your work. I just want to add quickly. Also appreciate you flying some Communications with a representative pull at and will continue to work with him as the chair of local government. I think ongoing discussions and collaboration will be important to move forward. He is very concerned around any pre-emptive language. So we'll continue to my Monitor. And keep you all updated but I do think continuing to engage will be helpful moving forward. Thank you so much fun of my favorite subjects in the world and I just want to be really clear is it that the city of Seattle continues to hold a position that in general preemption is not something we're willing to accept from the state legislature on issues that are really important to us. They may be getting legislated in the state legislature. However, there are I think opportunities for us to evaluate particularly within the context of land use policy whether it is appropriate for us to support language in legislation that effectively sets a floor which technically is preemption because it means that the city of Seattle could not go below that floor. Again, I think in this context in the suite of bills that have been described. I can surmise Kata. It is appropriate to consider and a legislative approach that allows for 4 to be set for tickly in the area of a construction of additional adus and other men men density requirements me. The reality is is that we are hoping to see more dollars coming out of the states in order to facilitate municipalities abilities to be able to build more affordable housing within our communities. The question for me is who's going to do the building which cities are going to step up in our region to actually construct that affordable housing we continue to talk about this issue as a regional affordability housing issue and yet it still falls on us at the city of Seattle to pick up the heavy burden of constructing the most number of income restricted units, and so I Set this mineral density approach does provide us a path forward to saying we're all going to own this equally and have these minimum density requirements so that the dollars that are being allocated by the state are effective being deployed within communities and actually being utilized to build affordable housing in places other than the city of Seattle. And so again on the topic of preemption, I understand representative palat's concerned with preemption. I share those concerns. I think the question is, how can we approach this with a little bit more of a scalpel approach as opposed to just saying I will never have this conversation in a million years and I think I'm understanding that Nuance is something that is ongoing. I do know that represent to pull at his convenience and other stakeholders including Senator Palumbo who is very interested in seeing a Regional Housing solution advance. So we will understand this is a high-priority for the council and will definitely keep you updated as that moves forward and I appreciate Continue to collaborate on identifying what could be I think it's really important good comments on solution for our regional needs as a relates to the housing cap. Just a follow-up question. Are we talking about 1923 said they were talking about right now. I believe 1923 and help make your skin 5812 1797 and just I'll pass out for the council's benefit that Nuance position and the understanding of the levers that the state legislature could help apply for cities that are trying to address density that is exactly the tone of the message that we sent to the good representative and colleagues in Olympia. I will pass out that letter suffix have that as an example and councilmember her bold outline some of the specifics and that bill as well. I'm so thank you once again. And if there aren't any additional questions on housing, I'm going to go ahead and start in on our Public Safety section and highlight some of our major priorities that are continuing to advance on page 20 rape in the 3rd degree sponsored by representative or wall would eliminate the requirement that a victim clearly Express lack of consent in order to prove rape in the 3rd degree that passed the house unanimously and made it out of Senate Law & Justice and has already moved to Senate rules. So it's an exciting movement their sexual assault kit notice also on page 20 House Bill 1016 sponsored by representative called the air would connect survivors providers and penalties in place for hospitals that don't comply with referral requirements has been a lot of conversations here at the Council of all, I know there may be some local movement around tighter restrictions as well and that bill passed the house unanimously and was referred to Senate health and long-term care. On the bottom of page 28 sexual assault House Bill 1166 a representative another representative or wall proposal. This would address the backlog of untested sexual assault kits in Washington state a phenomenal achievement by all of the other cats. And I know many of you work closely on that as well this way to address all of the backlog of untested sexual assault kits in Washington state I Believe by the date of 20/20 if they pass on funds this domestic violence law enforcement House Bill 1225 on the top of I think I might have the page number wrong top of page 18 wrong page numbers gives me a representative Jenkins proposal. This would require to secure Firearms when responding to domestic violence calls and not passed the house 6238 on March 5th and has been referred to Senate Law & Justice. And then I'm Native American women on the lower part of page 22 House Bill 1713 Woodcreek training and liaison positions to improve best practices relating to missing and murdered indigenous women at this is something else member Wireless has been watching closely that has also seen forward movement since our last briefing it past the house unanimously on March 5th was exact out of Senate state government and tribal relations and it is now has met SwaySway two ways and means if I can just make it a few comments forceful. I want to thank you guys for working so hard on this and shepherding this and as you know, this missing murdered indigenous women, this issue has been going on for well over a decade and we started the conversations with First Nations and then the tribes I'm a real big. Thank you to represent her boss Burger. I mean, she's done a phenomenal job of shepherding this through as well as our newly-elected Debra lekanof who I work with for many many years, but I think that we should have dumped at ourselves a little bit on the backs the city Seattle has move forward we had great conversations with Chief best about what this means but to have the state be cutting edge first-in-the-nation. I believe to actually establish. The position is to focus on the data of missing murdered indigenous women, and I know that from our time in Washington DC in February, when we met with Senator Warren Senator Cantwell and Center Murray that this was at the top of their list with Savanna's Act and the data collection and this Council passed an ordinance last spring I believed to work with these SPD and I'm focusing just exactly what this legislation is doing. So, I'm very proud of my state and very proud of my account and I'm very proud of my city and I'm really happy that the tribes also worked with with the state and I think this is why representation from native communities so important. I'm not just for about me but Debra lekanof who's been working on this tirelessly as well. Many other elected native women not just in city and state government, but in their own governments from all across the nation, so I want to thank you guys is this is really near and dear to my heart. So I appreciate it. Thank you for your work on that and congratulations. I'm going to highlight just a few people asked you a question about I haven't had a chance to read the actual language of the bill from the conceptual perspective. But is is there any language in the bill that talks about connection between the law enforcement agencies and County Medical Examiner office has I didn't see anything in my read of the bill around the medical examiner what I have here just in this summary that I wrote up this way and establish the liaison positions as we talked about at within within the state patrol for the purpose of bad relationship building that we referenced earlier would also require the artist wsp. Best practices protocol for a law enforcement response and then would require the governor's office of Indian Affairs to provide the state patrol with government-to-government training. So I don't know the bed training has been developed but we'd be happy to follow up and see if there is any coronation happening with the medical examiner's office as well suggest that that would be a good suggestion for us to consider making haven't had an opportunity to talk to counselor words about this. But when I did a tour of the King County medical examiner's office last year, I had an opportunity to enter into a room with old remains in it and many of them were unidentified and and I and I think you know the medical examiner at least in Kane County has a lot of interest in in reconnecting the family of deceased individuals. In a really meaningful way and I had at the time suggested to him that efforts around and murdered and missing indigenous women and wondered if there was an opportunity to create some sort of connection there that would you not potentially allow for for some of that peace to be found. Excellent suggestion would be happy to follow up with the bill sponsor on that recommendation. Thank you. I'm in a highlight under your safety net and civil rights on the top of page 26 on certificates of discharge representative Hanson's New Hope act and conversations with many of you about ways that we could partner with the stator on addressing barriers to housing and employment on this seems like a really important policy at 2 address. It would expand eligibility to vacate certain non violent criminal records and not passed the house unanimously on March 1st and was heard in Senate Law & Justice on March 21st, so that continues to move right along agency employees harassment lower. Down on page 27 knots House Bill 1692 would put disclosure Protections in place for employees reporting sexual harassment that bill also passed unanimously continue to see a trend of a lot of bipartisan support in a lot of a unanimous vote Sinai many of the public safety and victims advocacy legislative priorities and how to spell 1692 will be heard and Senate state government and tribal Affairs was hurt on the 20 seconds and celery information knowing many of you worked very hard on the Equal Pay opportunity. This is sponsored by representative Dolan House Bill 1696 and would expand on that last year's winner on equal pay by prohibiting employees players from asking about pay history about Pasta House 56 to 40 and has been referred to send it labor. Lgbtq Commission on the top of page 29. That's something I'd ever remember Juarez has also worked very closely on would establish a commission within the governor's office that bill is still moving forward pass the Senate 34 to 1330 for 2:14 on March 6th and is scheduled for a hearing in and was scheduled for hearing and how state government on the 20th. I had to cop a chance to look at both pills this morning that I was concerned about it on this one. I guess. The only thing that I'm concerned about in looking at the bill in the language is that I'm always subject always a little bit suspect when they say I'm looking at the new section Section 3 on page two of the bill when they say subject to the availability of amounts of appropriate for the specific purpose that you are right to be suspicious unless we have money we're not going to do it and that's I have a real problem with that particularly since we have the tribal commission the Asian we have the African American. We have in this has been a long time coming. We work really hard on this. So is there a way that I can go to Olympian strike this how you guys think I think we will continue to reinforce. This is a high priority for you. And the rest of the council I think, you know part of that conversation being continued pressure on the legislator for sustainable Revenue sources, you know, a lot of lot of those conversations will be moving forward as the budgets come out around we can't regardless of the revenue forecast. A lot of those resources are going into our our McCleary obligation still and we need to look at sustainable Progressive Revenue sources so that we have the ability to find the important policy that's moving forward if I can just order me with some information and sharing this with councilmember Gonzalez's comedias. Well, we've been working to tee up legislation Citywide because we've seen Statewide and certainly in this country that people are using their First Amendment, right? In order to deny Healthcare to transgender and lgbtq people and this isn't about surgery. This is about I don't want to deliver your child to fix your arm or whatever. The first amendment has been weaponized and we've seen it everywhere from the Janus case and labor to every other issue and it's not going to end these cases are coming out only out of the South but we had a couple cases in Bellingham with medication Thurston County. So my concern is this commission if we've ever needed it before we need it now because we need a group of people who were part of this community who can relate not only to the state but also to the city what are the issues that we need to be TN out to protect these human rights and how to weave address this issue about whether or not you know, if this is it is along the same lines of I don't want to make somebody. Okay, cuz I don't have you to their quote unquote lifestyle now, we're seeing I don't want to provide health care that we weave without going to all the detail we've been working on that and we're going to continue to work on that. So for me, this is More than just about a commission that happens to one of talk about, you know gay pride month. These are real on the ground issues that are affecting People's Health housing jobs, and that's what I'm getting concerned about. And I don't see that. I don't see that that fervor against this community and using the first amendment. I don't see that going away. So agree with you and will continue to monitor that closely and let you know about opportunities to engage is that moves forward but understand that's a very high priority you guys have you haven't you have on this Wednesday is Papa, day, right? Wednesday at 1:30 in and then let's see through 27 that it's going to be up for. Okay. Thank you can also arrange to have if you'd like to send email to some of the committee members. If you'd like to die would love to do that, or I would help our show up out of showing up does any good reserve your precious time for public hearing versus the executive session to kind of sit in the back and they're doing their business and moving forward with votes, but, you know, if there's an opportunity Vino potentially on the floor love enough to continue to look at ways for you to engage directly and even if that means hanging out with all the lobbyists were lurking outside of the doors, maybe it will drag you down there with us, It was obvious, but I would absolutely not an opportunity to do that. So, thank you. Thank you. And I think if there aren't any further questions will move on to transportation. Transportation on page Thirty just want to highlight the motorized foot scooter Bill and grow subdued Hospital 1772. I did receive a public hearing last week. We did find another for the for the legislation just says there's still some Queen of the council's very supportive of it. But we still have some identification language issues that we're working through with the mayor's office at 8 to be signed and pro and bird and Uber and the other stakeholders that have been involved. So I think a lot of progress has been made on the insurance industry to come forward noted that they had not seen some of the issues currently evaluating the bill right now and looking to see if they might want to put forward in the moment on it. So we'll keep you up race of that and not listed as a bill are automated enforcement effort. So that legislation is self his Dad. We are still looking at opportunities to advance the concept and we are very grateful for all the work that so many of the council members have I done the last week to help Elevate that issue? I'm still working on that and more to come in the coming weeks. And any additional questions, I just remembered that I was looking at the sign-in sheets and I think I completed sign-in sheets. So Everett and Tacoma that I mentioned earlier signed in Pro on the scooter Bell cracked are they are weed is there are we close on that language then if it sits there such as whether or not the removal of identification language is would be sufficient. I am at feel like it's a battle between legal Minds at this point. So we're still working on that. We're still trying to put forward suggestions. I don't know if we're at a point that those but they said they will take it but I know that it'll be see things that is sufficient and we're working on our legal side to to make that work as I'd like to think that you see for their continued position on this and I think their analysis is accurate. I also think that it's really critical as we see today and being the first day of Seattle squeeze 2.0. This is another good opportunity where we could have a multi-modal transportation alternative added to our list of potentials to get folks out of their car. And with the number of buses now on the surface streets hoping to connect phones to those buses, especially the last mile to light rail again, you know, I think it's that The bill has come a long way, and I would love to see it continue to go forward. I didn't say scoot, but I wanted to thank you. But it's okay. Thank you very much for a great report again and go out there and do what you guys are doing. So well, thank you so much. No, I just want to comment. Thank you for organizing when I came down on Tuesday. I was very impressed with just how the four of you interacted with our legislators. Thank you for all your work in Olympia. Room into a preview of today's full Council actions just want to start off to save as a quick report regarding the vacancy in Council position for all of you on Thursday should have received should have a description of an outline that takes a look at all of the historical practices in the ordinances and procedures. Do we have in place for a vacancy and try to neatly lay out a schedule that I want to thank the clerk's office in central staff and Dana and HR for m in many members of our department working so feverishly on this process and so I want to thank them as we continue to do that work. It did go out to the public that same day on Thursday and as we speak today March 25th till April 5th, we are looking at applications taking applications. And if any of you have any questions in terms of what you can do, can you talk to people can you recruit people I would just suggest that you contact me or contact. And we will go through WhatsApp. There's not a lot of specific language on that. So, of course the the process is very public very transparent, but there's no prohibitions for you talking to people in and that kind of thing. I think that has been destroyed or done as well. So, I hope that procedure works and if you have any questions or comments, just feel free to let us know. having said that customers want And your brother? Good morning there. No items on today's full Council agenda from the Human Services Equitable development and renters rights committee the next meeting of the committee schedule for its regular time tomorrow, March 26th at 2 p.m. It will be a short meeting with two appointments to the Pacific Hospital PDA Road. Coke and Doris who they will be at the day before confirmation along with Jeff Nutter the current president of the PTA who will introduce their work to do mention that on Saturday. I was happy to join District a community members and others around the city for the ribbon-cutting ceremony of the African down Liberty Bank building which is an important Landmark affordable housing project with 87% African American down and see and it's an example of the word for the Equitable development initiative can do the ETA is currently very underfunded and but the Liberty Bank building is an example of how many more Community projects could be. Brought to fruition like this if it was adequately prioritized joined. I had intended to want to be part of the conversation around the North Lot PDA having been on the board that creation of the north light housing and childcare and Senior Center is really important for me. So if it's okay with you, I'm sure I'd like to submit a few questions that maybe could be asked about the appointees at in my absence of since I'm not able to join you. Okay? Thank you so much. I'll send it your way. Turn on friend. Thank you. The same. And transportation committee does not meet this week. And there's nothing on this afternoon's agenda. We did the committee last week pass a resolution out of committee adopting the University District Mobility plan, but unfortunately, we didn't get the paperwork ready to get that on the agenda this week. So that'll be coming the following week. We do have an elected leadership group meeting this weekend for Sound Transit 3 West Seattle and Ballard alignment project. The meeting is from 9 to noon. So I know a number of you are on the Alexa leadership group. So and this meeting to be clear is exclusively focused on considerations for both the Chinatown International District station and the Delridge station and so I'm sure that we will eat through all three hours of that talking to the options and understanding the trade-offs and hearing from the public of it on that. So, I'm looking forward to that meeting I'm doing I'll just mention I'm circulating a letter. I handed you all A draft copy of it that have the original here that I'll pass around to get signatures on. This is a letter to the ACLU related to concerns on some bills and Olympia they have about using traffic enforcement cameras for broader surveillance circulate this letter she all yesterday. So I hope you had a chance to see it but it basically States the city's shared concerns with ACLU that are interest in traffic enforcement cameras is exclusively for traffic enforcement of fractions and not for broader surveillance in the letter goes into a little bit of detail about positions on bills in Olympia that that may be counter to that. Turn around that's all for me. So does this letter provide a potential path to resurrect the support allowing for automated traffic enforcement in lockbox areas and bus lanes if it were is Simple and Clean as that, that would be great. But I can tell you is that our team that was just here is working aggressively to find a way to bring the bill that we were supporting back or some some some way to get him some flexibility so we can least pilot those programs. I have talked with Folks at the ACLU and they have a variety of concerns and I think this letter goes a long way to help address the city's position on those concerns. And so I'm hoping that they will this will help them. But they have concerns about what's going to happen in Olympia to that's beyond the control of the people sitting at this table and those concerns, you know, no matter how eloquent a letter we write it when people do one thing or another so this is I don't want to characterize this letter is once we sign this then we're good to go and run the same page as they don't know that that's the same that's the reality but I do think I'm just going to policy perspective at least for myself. This is what I think of how I want to do and I want to make that clear and I think it's helpful for the ACLU to understand it but that is a city policy and if we restricted the bus lane and block the Box legislation to only Seattle the concern is even with our surveillance legislation. The other bill could override the protections that we've already put into practice here in Seattle around the use of surveillance. So I'm I'm going to I'm going to stay at a high-level here cuz I don't know the specifics of it. I think the the fear would be that if we are capturing surveillance data that we intend to use exclusively for traffic enforcement in Olympia bill could make that available for other uses beyond that and whether our surveillance ordinance would Trump that or the other way around not clear on. I believe that we have a good relationship with ACLU around surveillance, you know the city needs to continue to do our work to make sure they were living up to our our commitment but I think they have a different perspective on jurisdictions around the state. So even while this bill may be a pilot for Seattle. I understand how they could grow into something else. I'm causing concern at the same time. It's a really important bill for us is a lot of safety concerns we know and I'm just play rights Advocates along with City been advocating for this and we're just trying to say We understand the trade-offs. We really think it's appropriate to move forward at least with the Seattle and let's continue to work the other issues. I'm sorry, just so House Bill 1229 was it was that the bill we originally supported know so there is I don't have the bill number in front of us, but there was a building that the city was advocating for which would allow the city's right to do the cameras. There's a separate bill, which is 1229 Wychwood. I'm not the expert around 2 to 9, but it would create an opening for those those photographs to be used much more broadly that bill is dead. But you know things can come back and if you just sessions and I felt it would be useful for us collectively to be on the record publicly. And with the ACLU to say, you know, we will continue to keep an eye on bills like that the session in the future to express our concerns. Has no items on today's full Council agenda. We do have a committee meeting tomorrow. And on that agenda is a couple of appointments one appointment to the museum Development Authority governing Council. I'm in another to the lgbtq commission. We're also going to be receiving a briefing and project update on the ship canal water quality project and we are going to be hearing more about the status of that project in preparation for an ordinance coming later this year to lift a bunch of Proviso. We also will be hearing an ordinance proposed by members of the people with disabilities commission related to Televisions in areas of public accommodation and closed captioning. And then finally we are going to receive an update on the plan to act on the council's previously passed resolution on potential solutions to address eviction harms identified in that resolution 31861. I'm just a little bit of a reminder in resolution 31861 the council identified a number of problems that were identified in the losing home reports and made a commitment on behalf of the council to explore solutions to those problems. A number of those issues are being addressed in the state legislation that we've heard about over the course of the legislative session. And so what we're going to be having a conversation about is all of the things that we've identified in the resolution We're also lifted up in the report which of those items have not been addressed by the State Legislative actions that are being deliberated right now and whether or not there are there are some things that the city still needs to do to fill in those gaps as far as Regional committees leadership group. We also have a regional transit committee meeting this week. I have office hours this Friday between 2 and 7 at the Southwest customer service center. And then as far as major events coming this week will for sure. I just want to mention last week. There was the Arts office opening at the King Street Station Subs member that show was there it is as was I yes, thank you. It was a fantastic celebration. Sorry I missed you. But I saw I was just about ready to make a plug for Raven daughter and my niece. My niece is a curator. Oh, yes, the the Arts exhibit was created by the artist Tracy tail and that Pre-K Lan and I really urge people to go over and see the exhibit. It was fantastic and we're just really happy to see that a many years long dream that the Arts office has had to occupy that space both for their offices and also as a public gallery on that it's that is come to fruition and it's something that they've been working on since probably about twenty fourteen. Also this week. We have a launch a community grocery launch workers are beginning their bargaining process that launch is going to be on Thursday. And then also the Washington environmental Council Gala is on Saturday, and I think that's all I've got. We have nothing on the agenda this afternoon for the finance in neighborhoods committee. We were going to have one item and councilmember Gonzalez. This was the office space bill that you and I approved out of the committee on Friday. But since there's a ratify and confirm clause in that document Parks is going to be able to move forward with it. And this will be in front of full Council next Monday. I'm not going to be here. So I will make sure that you've you've got some speaking points to that. We'll ask everybody to sign it. It's our parks department is going to move a hundred and about a hundred fifteen people over to the new building over on Elliot. And this is replacing the space that they've had down near the ice building for the last couple of decades. So I do want just with knowledge and say thanks to Randy angstrom the art space as you described as in King Street Station. It's now on the upper floors and it's quite stunning. I'm very impressed what happened there and congratulations to your niece and it was beautifully and your daughter. Excellent. That's what I'm scared of. Thank you. Mr. President. There are a number of items on today's full Council agenda from the housing Health Energy and workers rights committee. They're going to be for mayoral appointments to the domestic worker Standards Board and two appointments to the Seattle City Light review panel. We also have a resolution. I have the essential staff memo. Thanks to Eric McConaughey for drafting this for us and I want to make sure that folks have a chance to understand what this resolution is. It's a resolution on the budget of the Skagit environmental endowment commission or the seec. This is an agreement established between the province of British Columbia and the city of Seattle as a condition within the Ross Lake 7 Mile Reservoir treaty between the United States and Canada signed in 1980 for the treaties charms runs Route 64, the seecs mission is to ensure the preservation and protection of the natural and cultural resources in recreational opportunities of the upper Skagit watershed. Seattle City light's annual contribution to the funds is based on a fixed amount of power purchases. This fixed amount of power purchase represents the amount of power for gone by not raising the level of the Seattle City Light High cross damn for the treaty the payment of the in the December 2018 amount was 1300. I'm sorry $136,583 for December 2019. The payment is projected to be $139,500. So I am passing out this memo because it is I'm not an issue that we get a chance to talk about Austin and socks one of the things that came from our committee discussion was a desire for committee members and the full Council to actually get briefed on a regular basis. I want to fly dark Council colleagues. I brought some questions specifically about inclusion of on the native Community both on the board and in terms of how the decisions are being made in the area of the impact that it has not only on natural resources. On the directed the cultural environment of the region and precious land that's been being used in that area. So additional information on to respond to some of those questions, but are moving forward with a recommendation to support that here today 124. It's going to be a good opportunity for us to hear from workers in the industry and the desire for us to be able to move forward with implementing the protections at a future point. We're going to have opportunity here from the industry itself as well and I will make sure that for anybody who's not able to come to that committee that we hand out the central staff memo that's created as well as a debriefing to make sure we all have a baseline understanding of that initiative this week IRS. I should say last week. I had the chance to wrap up our D3 tour with a really great to hear from the Capitol Hill Eco district for Wii walkthrough. Neighborhood looks at affordable housing development Tod to heard about the shooting of an individual that I hadn't been aware of almost sounded like execution-style. So looking forward to working with the chair of safety as we think about how more folks are going to be walking around that neighborhood and ensure safety and access to the affordable housing there the center for popular democracy domestic workers Alliance some of our colleagues who are in GC light council member a Landers SEIU 32bj and the fast food Justice workers were going to compare notes on these from coast to coast and really looking forward to bringing back some of those strategies. I also want to make sure that folks have a chance to take a look at an early draft of both. We are going to send to the legislative branch employees and management and to our friends here on the second and third floor as folks know we've been engaged in conversations at the city level. Thanks to the leadership of this Council and the mayor's office. We've created the Office of the employee on we created a new investigation unit for a really outward looking at the various Cities apartments. One of the things that the state legislature did this last year was they passed a resolution creating a table to come up with standard internal for their legislative process for their legislative branch to help protect legislative aides to have standards for elected and to ensure that those who are working the Halls as lobbyists or visitors also feel safe. And I think that what they've accomplished with this year's resolution that they passed which was resolution for 401. One of the first bill passes legislative session was it they took the recommendations directly? Frontline staff and they change their personnel policies to ensure that the Personnel policies were reflective of the table discussions on this mirror is a process that you know, if I had a magic wand maybe I would have said suggested doing last year, but I think it's a really great process for us to now pull together a table come up with recommendations and to identify changes that we would need internal to the legislative branch. So it's a parallel complimentary effort to what I think the executive is doing in the and what we're doing for our city departments, but recognizing the legislative branch is a stand-alone branch that we have a chance to partner with Frontline staff. I want to thank Monica for your feedback on the letter and what we're hoping to do here is to get your feedback. We will send out this letter and draft resolution and give those two weeks to provide us with be back and then the following week we will on begin discussing it ideally in the workers rights committee. This is again intended to be a really inclusive process to mirror what we thought the State Legislative level. What's the share with the hearing examiner's offices? Will Jackson she's on leave right now, but we will be following up there. I can do that. I'm sorry. Mr. President. I think I committed to doing that with you. So I will follow up with them. Excellent work like a soccer ball. Thank you. Just a quick question about this. I really appreciate your moving forward on this you have been a consistent Voice or making sure that this department the legislative department is is setting a high bar and leading my question is as it relates to your reference to our our independence is Does are the changes that are going through the office of the employee and the new Investigation Unit do they not cover our unit or is the issue that you're interested in? This department may be going further and in that investigations would still go through the on bud, but you want to add an extra layer. There's two things. I'm one is at the office of the employee on bed and the investigation unit that's been created ideally as independent bodies not under the purview of either executive or the council or not. Not subject to undo political influence. Those are absolutely available for anybody in our legislative branch to use when it comes to the Personnel policies as you remember Personnel rule 1.1 which really guides our expectations for workers at the city the Personnel policies that we have at the legislative Department. Then what is put in place for all other employees? So in effect in our legislative branch, even though we're independent we often adopted the language that has been changed for personnel rule one point and just mirrored it internal to the legislative branch. The question that were now asking is do we sense those changes have yet to be made to Personnel roll 1.1. Hopefully as a result of the feedback that we get from the new bomb bud and the experiences that continue to come forward from workers in various departments. We will eventually have changes to Personnel roll 1.1 journal for all of the other City departments. The question is what is anything does the legislative team here are our front-line staff. What would they like to see in terms of changes for that Personnel rule. I'm so it's it's it could parallel it or we could also say in a Hayward in a really unique situation here. We got people coming in to have conversations all the time here is where I would feel more safe. If so that that's the that's the doorway. Anyway, she ate a fly. Cast member Bagshaw thank you to say thank you to all of you for coming to our special committee last Friday. We had a long meeting where we were able to talk with Jason Johnson. If you have other questions many of us have submit additional questions to him and he will come back on Friday the 12th to discuss that if there is an interest in having yet another opportunity to talk with him. I encourage you to have one-on-ones. We also can schedule a third meeting on Thursday evening April 11th, if that time is available. So I just wanted to make sure that you all have plenty of time that your questions are answered that nobody feels rushed and that you get back to me if there's any concerns that you have at this point. I can just wrap up mr. President as well. Thank you for your feedback on that one year mark of the 2020 Census count on there going to be a lot of activities Across the Nation. We have the opportunity to partner with our King County Partners, and there's going to be some events coming up. So if you haven't yet heard about that one year from April 1st is our deadline for 4, hopefully creating an inclusive and trustworthy process for a Community Partners and we'll get some more information sent out. One-eyed human interaction referral calendar today. So the following brought you by the Law Department clerk file 3 1 4 4 2 4 of Mount Baker housing to rezone approximately 11000 square feet located at 2800 MLK Jr. Way South from NC 142 n z 175 with an M suffix that application is now pending for the purposes of the council's quasi-judicial rules council members of The Voice Communications with opponents opponents of the project and if you have questions about our Council quasi-judicial rules, please see keto Freeman of our Council Central staff is one of those issues where we put it on the calendar, but it's not planning to come to us for several months. If not years. We also have one item that's going to be today's introduction referral calendar for actions afternoon, and that's the honorary designation of What section of University way between 50th Street and Northeast 52nd Street to be known as honorary Chris Curtis way for those of you may remember Chris we celebrated her retirement from the neighborhood Farmers Market Alliance last August this organization the one that she found it in the early 90s has been at the same location in the University District out for more than 25 years. So it seemed appropriate to try to rename this one little two blocks section though. It's listed it to Boxster only one block cuz there's no as Chris Curtis way. So we'll have members of the neighborhood Farmers Market Alliance 20th this afternoon, although they want to try to keep it secret from Chris. So let's keep it all between the US and the hundreds who are in the audience and watching at home. So everyone get that at home. That's the only item on today's full Council agenda. And since we've adequately covered Friday mornings Sound Transit elected leadership group meeting. I've nothing else that very good. Good morning. Okay. So nothing on this afternoon's agenda from the gender Equity Securities new America's education committee. We do however have a regularly-scheduled committee meeting this Wednesday, March 27th at 9:30 a.m. Here in council chambers. We will have one item on the committee agenda and that is our continuing conversation around the proposed implementation and evaluation plan for the families education preschool and promise Levy. This will be our third committee discussion regarding the implementation plan. And this is a reminder for final committee meeting on the levees implementation plan will be on Thursday April 18th at 2 p.m. In council chambers at the special meeting of with my as my Committee just really quickly for those of you who are not going to be able to attend on Wednesday. I want to make That you have a copy of council Central staff memorandum 12-page memorandum on issues that we have begun to identify related to the implementation and evaluation plan. There are issues that I have worked with Central staff to identify far and we will continue to have discussions about these 8 issues and again in Courage. All of my colleagues to be sent that you are interested and able to also provide us with any issues that you believe exist in the implementation and evaluation planet for the Levee. So that is all I have to report. Thank you. I'm going to indulge me for a moment here to Take a moment. And then Auntie moment. I first woke councilmember purple. Thank you very much for your leadership on the Seattle office of arts and culture for the Yeehaw indigenous event that we had Saturday. I wanted to share with you though what you're hot means it means together. We lift the sky and in another words. This is a long story about when we left the sky. We also lift each other. This comes from VY Hilbert. She was an elder upper Skagit and she was the last fluent speaker which was her first language of the lachute a language and I knew Vai my whole life and I've heard the story that she's done. We talkin about lifting the Sky by it was deemed a Washington state gem if you will a 1989 and she received the National Endowment for the Arts award from President Clinton 1994. I can't stress. What a Phenomenal Woman by Hilbert was and all her work she did with the University of Washington. So this art project that's going on is going to go from March 23rd to August 3rd. 2019. It was curated by my niece Asia tail and Tracy Rector and separate cologne. And also my daughter Raven words Friedman time. She's not only was an artist there. But she was also doing a huge project. I Hands-On project working with children and adults. So I was very proud of her and I want to thank the mayor's office in the executive folks that showed up to kick off the event and I want to give a quick shout-out to the 11 other organizations including tribe that made this possible. There was the for Cultural Arts fun that you really garden and glass the Muckleshoot tribe lived in squalor tribe native arts and cultures Foundation Potlatch fund Seattle Foundation the Seattle Latino film festival. And of course the Seattle Public Library and the nahali Ali Ali funds and the reason why I want to share that is this project has been a long time coming. They've been curating and work on it for well over. Two years and I know that because my niece has been working on it when she was working for the museum in Tacoma. And now at the Seattle Art Museum, so with that I'll move on so for this afternoon's Council agenda, the Civic development public assets and Dave communities committee has four items. First of all the appointment of calling alcohol to the Seattle Indian Health Board 2nd and ordinance transferring partial jurisdiction of a portion of the west human mini Park from the Seattle Department of Parks and Recreation to spu Seattle Public Utilities 3rd and ordinance authorizing the superintendent of Parks and Recreation to execute and accept a Waterway permit in Laurelhurst and another ordinance of the same with the same terms for Waterway permit in the Arboretum and finally Council land-use action clerk file that install allows the installation of seven Athletic Field poles at The Soundview Playfield Park, which basically reviewing we got the seven athletic fields going on and we have other there's like 10 other wonderful. Advancements that they're doing at that Park. So I'm really happy about that though. They're tearing up the told her from putting in the new church council member Johnson is happy about that cuz we've been working with this for well over a year. So it's finally going to happen it also the next Civic development public assets and Native communities committee will meet next Wednesday at 3 at 2 and I'll share more and then of course we have the library Levy committee coming up the mayor presented a new 2020 Library Levy for the city of Seattle last week the proposal allows for the successful Services programs and amenities provided by the Seattle Public Library and the 2012 Levi to continue to serve the people of Seattle. I will be sharing the select committee along with councilmember badshah. As you know, the legislation has been transmitted. It looks like the levy amount is about 213 million. And so I may be providing my colleagues with some preliminary material history and a chronology of how we're moving forward on the Levee. And of course the cost difference. What occurred in 2012 in which the levy was 123 million now? It's 213. There's a $90 difference and we're going to break down. I'm not just inflation cost but what it's going to take for us to move forward with this Levi. It looks like this Levy in 2019-20 is going to still focus on the same issues that we focused on in 2012, which is open hours in Access collections technology in maintenance. And for the record. I want to share that I have not or have I ever not return a library book. I've always hated never ever ever ever have had her had a fine. So I do not need any nasty. That was a joke folks. Thank you can smell worse before we move to our necks and lasses. You're not I'ma did want to mention this Saturday. I'm hosting a celebration of mentors and coaches in Seattle area. Rainier Beach is coach Mike pedicin Columbia City Saturday, and I have tickets for you. If you like to go Michael theory in our beaches coaches coach Joyce Walker from Garfield John and Mike Yost hockey were CA wind youth coaches are four decades. Ceftin Doug Derek wheeler work leaving High School coaches, Al Hairston Garfield coaching O'Day Cochin Al Roberts at Garfield cocho a celebration of mentors and coaches through out to the community for years at Saturday at 6. And then this Thursday. I'm hosting a technology seminar for the Alpha Phi Alpha fraternity, which is the first and oldest African-American fraternal organization in the country started in 1906. That will take place this Thurs. Play so are welcome to come. So having with said that that's our next presenter is that we're going to have Marcellus Turner the executive director and chief librarian and a stash of Brandon from the Seattle Public Library and we're excited to go through and share with our city or Seattle reads project. Wallpaper good morning, and thank you for having us here before I quickly move forward with the presentation. I just wanted to acknowledge that I wasn't feeling very well and I stepped out for a moment and Stitch her on one of your security office came and checked on me. And so I was appreciative of that but I don't know who to send a thank you note to have any of you know, who's over that department. I'd be happy to do so. I see most of the security team when I move through the building coming to meetings and they recognized me and I recognize them but I'll bring him to step out and check on me was really appreciate it though. Thanks for this, Yeah, we're related feedback. Yeah, we're happy to be here. As you know, we're here to talk about Seattle reads. It is one of the opportunities that I'm most happy to do. I don't get much chance to go out and book talk at my colleague says she does but we're happy to present to you. This year's the best we could do. I think you asked me about it last week councilmember Bagshaw. And I will admit that the only title that kept running through my mind was the best that you could do for theme song from author. And so that's why I was hesitant to speak but we're happy to share this with you. I think the team that special needs to run Seattle reads did a very good selection not just in the topic and the content and the author's story but the artwork is very beautiful in this year's book felt with that. I'll turn it over to Setia. So this year as the best we could do by T3, and she will be visiting Seattle April 13th through 16th. So coming up pretty quickly. The book is a graphic Memoir which tells the story of teas family's Journey from Vietnam after the Vietnam War should have been the aftermath of the Vietnam War they came over in 1978 to America and it is just a Markable book and it talks about their immigration experience the refugee experience the impact of energy the impact of War on intergenerational relationships. And it also looks at mothers and daughters and parenting and just sort of this bigger themes. I think a lot of different folks can relate to its one of a lot of accolades. It's been on a bunch of top 10 lists and I got a number of five star reviews from a variety of media Outlets. It was also a finalist for the national book critics Circle award in the autobiography category and that's pretty unusual for them to nominate a graphic novel or graphic that more for that category. And it was also a finalist for the Eisner award which is the comics award and T was born in Vietnam, but came over to the US when a 1978 when she was about three years old. And has lived mostly she was living in New York. And then she moved back to California what you'll find out when you read the book about why she did that but she was a teacher accounting teacher at Oakland International High School, which was the first public high school in California that was for specifically for recent immigrants and English Learners. And that's a passion project for her and then since 2015, she taught at the MFA in comics program at the California College of the Arts. So we're really excited that she's going to be visiting in April. The book is going to be discussed at all 28 of our library Affiliated book groups throughout its been starting in March and then all the way through June and will be discussed and then she is coming April 13th through 16th. She'll be doing a total of seven programs for us five of which will be public and those will take place at library locations or at Community locations for working with a CRS. And the El Centro De La Raza, Santilli a cultural center to host public programs with the author will also be doing to private programs for prioritize audiences. She'll be going to the Vietnamese senior Association and she'll be talking with University of Washington's Vietnamese Student Association, and they've actually invited the Vietnamese Student Association from Seattle University to visit as well for that. We had a lot of Community Partners this year. I'm I'm thrilled. We just had a lot of really positive response from the community. So the Vietnamese friendship Association and have been a key partner in planning our our programs. We've also been working with the wind Museum acrs short run Seattle, which is a Comics Festival friends a little Saigon and our partners at Northwest African American Museum who we've been working with the last several years. And we've done some unusual things this year with the books, you know, every year we have books available for informal ending and this year. We have distributed about 1,500 copies about 350 of those were set aside for prioritize Community engagement. And we also decided to widen our distribution point for these copies to include non library locations. And and that's a little bit unusual ways. We piloted that a few years ago with Northwest African American Museum and just that was very successful, you know going to bring the book to where people are in their communities was a really excellent way to reach hooks that had not been engaged with the program before so we have the book being distributed at acrs at the wing Luke museum at friends of Little Saigon and on the northwest African American Museum this year in addition to all 28 locations at the library. We're doing a few additional unusual things this year for the first time since 2004. We are working to engage non-english-speaking audiences in the program and that came about as part of our community listening. We we convened Community to talk about the program and we were hearing that they wanted us to find a way to engage Elders in the Vietnamese community in the in the program. And so we work to have a portion of the book translated into Vietnamese and we're creating another little discussion guide essentially with an interview with the author and a translation of an excerpt of the book for the community and its will be Distributing goes through Club bamboo and some other locations in the city. We are also finding that this year's election because it's traffic has been a really great opportunity to engage youth in the program and Seattle reads is an adult reading program that we've heard from the community that they're interested in having us. Find ways to connect the generations and said this has been really great. We've we've had an opportunity to work with the youth at the Seattle World school at area Vietnamese language schools Seattle University University of Washington South Seattle and Seattle colleges, and we've also got the youth program at acrs and Wing Luke are involved in in programming with us around this this program this year. We always do an artistic element and this year we're featuring is the playwright Susan Lou who recently had at her opening 140 lb was a huge head on Jackson, maybe a month or two ago. She's going to be adapting the book. Yeah. She's going to be adapting a portion of the book for performance at two of the programs and our friends at bukit Repertory Theater or working with Susan and then Cathy Shay from a job office of arts and culture but in her in her off time, she's a playwright and a director and social be directing the production. So I'm super excited that that worked out and so they'll be too too too staged readings at two of the programs. So the kickoff on April 13th, and if the finale which will take place at a CRS on April 16th, we're also continuing Seattle channel is covering any of those events haven't heard from them yet, but wait a little while I might reach out to them. That's what I hope they're usually cover. At least one room. Yeah, and then finally We are continuing to you know spread the Seattle reads love past the author's visit and so will be doing it a series of additional programs on themes from the book in through the summer and those include a comic series that we're doing with a local Comics artist Meetup. Mahato. She's going to be teaching Comics Workshop said that show people how to tell their own stories through a graphic medium and the three of those programs around the city and then we're also working with short run Seattle to host book discussion and conversation about comics and graphic novels and then we'll be hosting a ocean vuong who's another Vietnamese author whose popular he has a new novel coming out and he'll be coming into an S Associated programming. South we're really excited. I hope that some of you were able to attend some of the programs in April and enjoy the book If you haven't had a chance to read it yet. Just a few thoughts search up number one is the Seattle reads program in such a phenomenal success in it. It doesn't seem like you're resting on your laurels that are you guys are you sort of excuse the pun intended should have written the book on Outreach and just phenomenal work. So I'm hoping she'll Channel 21 as a monitor this conversation could think about how we can go to Showcase all of this out reach the translation the every Vietnamese organization that I was thinking are they brought into Loop you sort of went right there and said we've contacted them. So it is really fine work find out if he's so I think there's going to be one of the best ones and so thanks. Thanks for sharing with us. Thank you. I really appreciate that. Hope you feel better.", "end_time": 5388.2}]}