{"format": "raw", "annotations": [], "confidence": 0.9505469164787195, "data": [{"start_time": 0, "text": "For being here. This is our select committee on homelessness and housing affordability. Today is June 24th. The time is 10:30 a.m. I am Sally Bagshaw. I am one of the co-chairs of this committee. I am joined by council member was council member O'Brien council president Harold council member Pacheco. Thank you and council members who want? Thank you all for getting here and being on time so we can get moving. We first need to do the approval of the agenda. And if there's no objection the agenda will be adopted. Quirino juction, the agenda is adopted we have two items on this committee agenda today. The regional Homeland homelessness governance committee report by Tess Colby. Thank you test for the mayor's office for being here. I want to thank you for your leadership on this Jeff Sims 4 my counsel Central staff. You've done a great report, which is in your packet of material. Also Melinda giovengo for Navarre Palace in this community head of Youth Care will be talking about our youth homelessness. And also Lamont Green from all home. Thank you Lamont for being here. I think I'm just the Olsen. Will you be part of this? Very good and Zachary Wolfe, I expect that you will be up at the table. So we're very happy to have you all so we're going to have public comment. I see that we've got 7 people signed up. I'm going to call your names as always everybody on this list. I recognized appreciate you being here Eliana your first and followed by Kate Gregory and Bruce. I think you're all talking about Regional planning on going to ask you to for the next two and three people to be up at the microphone so that we can just move right on through this so early on a good to see you again, please. Tumnus. I'm sure if your fellow village community advisory committee last month. I appeared before this committee as part of a panel extolling the many benefits of tiny house Villages and I want to reiterate that I passionately support this model and believe it to be one of our best harm reduction tools for addressing the homelessness crisis. However, I'm here today to share with you a letter from members of five different cacs calling on you to remedy a serious lack of appropriate oversight and accountability for this program and to address the current crisis. I order you to read it and respond to us promptly. We accept City funded Human Service contractors to be held accountable by hsd and we're disappointed that this is not happening. For example, Lehigh is not being held accountable for lack of a functional grievance policy or failure to appropriately address serious allegations of case manager misconduct or incompetence when we have refused to engage in mediation with Nickelsville just like public commitments to do so as documented in the October minutes of the Northlake cic and instead abruptly terminated their partnership HST allowed this to proceed despite residents out cries and clear determination to remain Nickelsville communities when cic members have raised our concerns to hsd to the mayor and to you the council. We have not seen meaningful action taken to address these concerns. This is deeply troubling and disappointing. We have seen the life-changing and life-saving benefits of the tiny house model and wish to see it strengthened in expanded. However, unless the systemic issues or uncovered and remedied we risk causing harm to our most vulnerable Neighbors. And providing free text to those who wish to shut down these much-needed shelters. We know you have all been strong supporters of the tiny house Village model and we call on you to take the necessary actions to address the troubling issues. We have uncovered one of these actions is a formal performance audit to increase accountability and success. Another is to direct hsd and Lehigh to come to the table with Nicholasville for professionally mediated negotiations to find a just resolution to the current crisis and I'm available after this committee meeting or at any other time to answer any questions. You might have Kate Bruce and then Alan and I think it's model. High Council Members, I'm asking your support for coordinated coordinated Regional solution with budget authority to provide focused by name services that are Equitable throughout the region. Thank you. Thank you Kate Bruce. You're right there. Thank you Alan. Would you please come up to the next microphone? And then John trevena after that nasty and Lehigh who displays unbelievable and competency today hsd has not sent any specialized people 200v to discuss residence concerns. The question that needs to be answered as what exactly are specialized people. What do they specialize in HST in leaf? I have lied to the city council in order to cover up their mismanagement of and failure to help the people. They are supposed to be serving. Do they have cell. Only us? But if the Seaview council members to date hsd has not responded to a summary of complaints send to HST on April 8th hsd has sent Jackie st. Louis and Lisa Lisa specialized people Jason Johnson speaks about specialized in what residents would appreciate some clarity on exactly what they do so far complaints have gone unanswered they showed little interest in hearing them when he played at a recent meeting about strangers in the Camp Lisa responded. How is that different than allowing Scott moir of the account? This was a response to a complaint condescending condescending inappropriate banter from a city employee movie residents complain about safety issues. And this is the best hsd can offer instead of asking hsd where is a specialized people council members. You should be asking hsd if they know what specialized me the city contractors Lehigh for OVI is 439000 for 2019. It doesn't take a whole lot of basic math to figure out that it's $800 per day Lehigh security. There is not enough money in the Budget for OVI, of course Lehigh could shift money from here to there too much of a difference, but at what cost to OB residents or taxpayers for that matter the contract between HD and Lehigh is very clear and where the money at spend how are you to know that the obligations are being fulfilled Goodwill vouchers were not received by residents last year or this year a few here, and there does not add up to the amount of money Lehigh has received from the city, and the pace in case management was non-existent at some of the villagers yet those contracts revealed at Lehigh was reimbursed for services rendered. It would be prudent for council members of the city of Seattle to insist on an in-depth audit of HST in Lehigh. Thank you very much. I'm John and then Chris Natalie. Thank you Bruce. Thank you. Your time is up. Thank you. Oh, I'm sorry. I didn't understand. So you are Alan and all right Briscoe had a generalization of money spent is just that and does not clearly justify every dollar. There's a reason why we had refused to real expenditures to Nicholasville. There is reason he does not respond to complaints about being neglected by Lehigh during the construction of the Lehigh Village last year just recently at the old are Sean Neal the contract manager for the contract between a chest in Lehi revealed at the meeting that he personally was writing the contract with lehi's involvement last December last December was when Sharon Lee decided to use the mou meetings to assassinate the character of Nicholasville. She had no interest in coming to a solution to mou. That was 95% complete. She was already writing a contract without Nicholasville. So it's just filed down and go corporate abyss of Lehigh. Food is left out spoiling at Ray's Lehigh security refuses to do what Nickelodeon is it for free or kitchen is disgusting water is often drawn from a rubber water hose, which I personally have become ill from cameras have been installed invading our privacy so far three that I know of residents have reported to me that security has secretly recorded residents conversations in the security post. We have removed our donation coordinator just replace him with someone who is granted a host because that would promise to him now. He's moved into a new house and his old house was turned into in the office for the site manager. This donation corner has also approached residents with a scheme to sell donations case management is a lawsuit waiting to happen and I will keep you posted on that. I filed a complaint with Lehigh for their own procedure, but they have not responded that they said they would like plane concerns ethics violations abuse from this case manager and worst of all of crime illegally recording residents with a phone and playing back to other residents. I've been vocal about Lehigh nhsd Emagine Novi. I've been told I will not receive housing. I spoken truth and I feel like done everything in my power to get someone to hear my voice or the voice of voice of all residence. I heard you council members to install. Thank you Bruce John trevena then Chris than Peggy. I'm John Trevino from Nickelsville Northlake and we're grateful Lehigh hasn't taken over a village yet. Cuz we've seen what happened. I'll tell everyone we don't want surveillance cameras cameras and alarms on our gates and we have a mostly amiable relationship with her Lehigh case manager, but our donations haven't all been coming in and sometimes they're late and garbage is accruing. So It would be great if we could get some of that taken away. so well We just want to request date each of you would make a written request to hsd Lehigh and Nicholasville. Sit down and mediate this out cuz it's kind of like being in purgatory. So thank you. Thank you, John. And Peggy, can you get approach the microphone, please? So we're closer. Thank you. Thank you all for meeting especially ones who have taken the time to meet in the past. Right before our particular situation in Nicholasville happened. We met with Council persons who want who who advised us that our fight is with Lehigh. And what we really need to do is just try to do the best to make things work and that sounded like good advice to me and I believe it's what we're still doing. I know I don't think Bruce speaks very well. I hope that he left a copy of that letter for people to read cuz I'm not sure everyone heard it when he was saying in this some some hard truths in there. Body butter Trail and that and I think he's got a lot to say it's not the first time that we leave out of the stupid hair. We want to work with Lehigh. I don't think I don't think it's going well and I I haven't seen any improvements. I hear that that our our model or original efforts weren't good enough to the mediator. Is there a camping mediation because because of this man can't be here because the way that things are happening we at we have to change and I looked at with an open mind. I look like I can't find it. I what what did what did what did we do? What did he do? What did anybody do what do you what are you doing better? I am not seeing it. I'm not seeing it. I wish we could have mediation. I wish we could do could stay Democratic. I would I would love to work with anybody and everybody to make things better and try to succeed for all of us. I urge for mediation if I thought that if I thought that Lehigh was was better and that would that they needed to replace somebody I would I would be here for advocating for that that I'm not as I really wish that things were the way that they were before. The Lehigh takeover is not working though. I thought it was a sad sad place to go to and it's that's homeless people. Thanks. Thank you Chris. Thank you Peggy. And when you say your name, please. Good morning members of the Seattle City council. My name is Peggy hotz and I'm a Nickelsville founder and a volunteer Nickelsville Pioneer. Tiny house villages in Seattle a decade ago having to fight mayor Nichols Tim Burgess and others almost every step of the way in 2015 the city adopted a sanction in camping ordinance thousands of homeless people work toward this end creating and maintaining self-managed and empowering shelters and encampments has been a stunning achievement. It's a respected model for cities and countries around the world. Nickelsville recognizes the good work that Lehigh is done with affordable in transitional housing and urban rest stops at the same time, lehi's idea of what constitutes Democratic organization differs significantly from hours to be fair at system or structure that starts with on-site managers holding sway over every decision made by residence and continuing up the chain to lehi's upper management having veto power. Over everything is not Democratic or self-managed at best. It's totemism. We know tokenism. Excuse me. We know most of you recognize the value of empowering self-managed encampments. We know that many of you agree that Nicholasville should not be unilaterally incorporated into Lehigh, but you aren't sure how you can help us in this chamber a month ago copies of petition asking for mediation between Lehigh Nickelsville nhsd were given to you and all of the parties Lehigh nhsd have ignored the petition because they have nothing to gain for mediation over the last decade and especially over the last 3 months the overwhelming majority of people at Northlake tiny house Village and Othello have shown they want Nicholsville self-management and they want me ta Chien between Lehigh hsd and their elected Nickelsville leaders are asked is simple, please put your support for mediation between the three parties. In writing and share it. Thank you. Thank you. Thank you very much. Anybody else in the audience? Who would I David please? Please take a breath is there anybody else besides David would like to speak? Okay, so you'll be our last speaker. And would you state your name, please? Industries six-figure salaries to keep hiring sometimes suspect unqualified inept employees who have more motivation to show up the city council demanding sellers anything else. But the thing is we need an investigation on all home. Com for using tax dollars to hire out of City out-of-state New York startups who fill in the blanks with sometimes I daresay plagiarize data collecting that makes it seem like there's Authority who were required to put all home.com on the top of the chain when it comes to the authority oversight. These people are just going through the federal welfare Grant book and then putting it on their website if your home as you call all home to tell me to call 211, they don't do anything but change their name and play the politics of racial data collecting oversight for a really Josh Peck social welfare industry the integrity and the fourth Reich diligent efforts of bear-like requirements to solve the homeless crisis that continues as a tray for re-election for certain colleagues on the city council looking for operatives activist and politically-connected a six-figure salaries. You were helping them get reelected and they're not really making an effort to solve the homeless crisis, but we shouldn't have New York showing up to invite city council to go do another big-city Donation Nation cooperation visitation while they're still have a homeless crisis that started because Council withheld a whole bunch of money that Obama sent here to pay off landlord to create a new statistic The Rundown 2. Did it housing it still is shaking down everybody because you guys haven't done anything to disappoint the actual landlord funding for these Shady Banks weed investigation of a whole social welfare and Implement that Capitulating to the status quo that uses the homeless as a career for 20 years. Okay. Well, I'm going to move on to item number one a lot in the Republic, Just wanted to say one of the Republic Commandos refer to a letter that's been circulating that is urging mediation between Lehigh and it goes well, I just want to let you all know that my stuff is making copies for you. Also, you can go over I've already signed it but this is exactly what they are all referring to which as you know that Leah and it goes well. Both made tremendous contributions and rather than lose all those contributions that we ordered mediation between the two parties and I feel like that's the best way forward and I hope you will all join me then and I'll make sure it's sent to you all and give us at this letter that has been circulated know it's in in similar spared. So it doesn't matter which letter U support. It's it's it's all calling for the same my office the transit Riders Union nickel to everybody's call the end of the people who are on the Lord of the various nickel. So they're all calling to the same thing, which is third-party mediation for for settling this location. Thank you, but I do find that letter somewhat impressive and moving describe the need for strong mediation and effective mediation. So can you be a little more specific if you you could be are we planning do we need resources for mediation is mediation going to be scheduled. Are you going to have a committee meeting requiring hsd2 come to the table and talk about the process of mediation? Maybe you could elaborate just a little bit because it sounds like there's a strong Community behind this and it's been around for a couple of months now at least he's concerned. I don't think that it is going to work within the framework of hsg, because that is precisely what has not worked for the community has not been any movement from SSD to address this problem. And I feel like it is urgent to address this because we are in the throes of an unprecedented homelessness crisis, but what are lighter and I'm sure the letter that Eliana circulated. I mean, it's it's it's the same inspected witches that we have at our party mediator that is mutually agreeable to Nicholasville and Lehigh carryout mediation and it does not have to be under the age of the city council in 5 hours before that. It's not because I want the mediators Independence to be reserved and because it will be mutually agreed-upon. It's a it's a it's a it's a good starting point to resolve the problem. If you if it's not mutually agreed-upon that it doesn't work just to give you all an example former council member of Nick Licata has been a name that has been proposed and my understanding is that he has expressed willingness. I might be mistaken about How much willingness and I don't want to comment on that without refreshing my memory correctly, but that's just an example of I think a mutually agreed-upon mediators that we can come up with and that's part of the only example we can come bring up bring other examples as well. I understand you're describing who the mediator would be then a third-party neutral who would be the parties in the mediation and the the mediator would be and you got to make sure that they both usually selected the mediator. and when might this occur The other council members as well. So you all have a duty as well do join me in this report one of the nuances that might be helpful is that this letter is a letter to Nicholasville and Lehigh and as we heard and public comment Nickelsville is seeking mediation. I've mentioned in previous committee meeting that some of us myself included have reached out to Lehigh and ask them to participate in mediation. They are they were previously uninterested. So I think they're right. I think the point that come from verse want is making is this isn't something that any individual can make happen. It's that the parties have to both be willing to participate in the willingness will be impacted by more council members speaking about this and saying that they are agreeing to it. If you don't have to sign on to the letter I just sent out because it's not even my letter letter from Community Advocates that is being jointly drafted. And so I think two to make sure that Lehigh also agrees to come to the table we should make sure that we have agreement on the council about that and I think that's the most sensible course of action to do it because well as you see as you can see has repeatedly ours that we do mediation. So if I can be so bold, what is the Human Services departments role in this? And is when you mediate something, there's going to be some kind of an outcome. I'll tell you something from my understanding a position to speak about this because they are at the receiving end of all of this. It hasn't worked for them. But it's not that he has not done mediation. There are fundamental issues with the way it just had neglected these issues and again that shows he's not unusual party the agency reports to the mayor's office and I don't think that is the correct starting point for Leah and Nicholas about to agree upon because the whole point is to have an independent mediator and I think that who the mediator would be is and is not the main issue here. The main issue is can we have other council members also agreeing that this is the most sensible approach and let go forward. Because there's a hole as you yourself noted council president Harold. There is a big community of Advocates who thinks that this is a sensible Way Forward just want out of this really high Nickelsville nhsd. It seems like hsd I have some some leverage in that their funding much of what we're trying to do. And if the if the allegations are true that hsd's not in compliance to the encampment ordinance for the directors rules and guidelines for the program than even hsd may have some culpability here. So I wasn't session hsd play the role as the mediator. It just seems to me that there's a huge sense of urgency that a mediation process can be done in in next week. It's not that complex to us to get all the parties room in and you could have shuttle negotiations are all in one room how have you on the structure that but it seems to me that Active sense of urgency on this and I was just trying to get a date certain days when we could have a goal next week mediation and then put everything toward it and it's not next week the week after I would be happy to do that right away of that is why we have brought this far because there's a sense of urgency but as a customer her but was saying both parties to agree and I think in that process it does help if other council members also way in and I want to but I want to be careful how we address is because I do want us to keep in the Forefront that both parties Lehigh and Nicholas will have a very strong a record of advocating for homeless issues and track record of having worked on it and results to show for it. So we should make sure that that is not being lost in the process. I appreciate all of this and I also think that human services department has a role to play here if and if they're going to be finding it, so I have not a problem with that. It's a nuts unclear to me what issues can be resolved without having the funding availability and whoever is responsible for making sure that they're operating in a we all agree and you and I can't remember Swan have often talked about the importance of the villages and they need to be able to run in a way that's clean and safe and effective and if it's not that we need to know how and why absolute councilmember mosquito also reiterate our support for the folks who have come every time we've had this meeting. I know it's a lot to ask you to come in for the individuals who are living at Othello the members of the community advisory committee or the comedian visor Council who come and testify before I know this is the umpteenth time. Heard from them. So I just want to appreciate their continued persistence to bring this issue forward. Even though it's something that hopefully would have been resolved by now. I'm I did have a chance to meet with the folks at Nickelsville and members of the community Pfizer Council and want to reiterate my ongoing support for mediation will be happy to sign on to this letter council member still want thank you for bringing this forward and also appreciate that the letter highlights the importance of both of the organizations and to the two council members who have of spoken about the need for hsd2 have an ongoing roll and recognizing the responsibility of the city not to just off offshore offload responsibility for a solution on to someone else. We as the funders should be stepping up as well. And I agree that we're not in the best position to mediate but needing to step into that role to make sure that this is not something that we're washing our hands up. I'm so happy to have this letter highlight the importance of both organizations and to see A revolution on the horizon is is my goal as well. So thank you again for continuing to come forward on part of what I really love about the model that we've heard so much about is the self-determination self-direction that have been incorporated into the governance model and that selfish of self-determination is really critical as we move forward to want to lift that up and let you know that I'm always sinning on cuz you're so I asked those who are going to be on Adam-12. Please come up to the table cuz it looks like we still have this ongoing for a moment. But at least come on out to the table to sort the bottom line. Is that hsd and LHI are simply Lehigh or someone saying we don't want to mediate we want Nickelsville to go away. We are not coming to mediation table if that is the stance that is being said and I don't know for a fact that's the stance that I've been getting anecdotally that that is to Stan's then we need to Daylight the issue and again plow through it because Nickelsville has done in my estimation some really good work over the years of work with them on having to establish some of these enchantments and so so bad at that posture Bible Lehigh nhsd is unacceptable. And so I if customers want wants additional council members to articulate that whatever that Looks like that's fine. But let's get the show on the road with this mediation because a non-response is unacceptable. And even if the mediation doesn't turn out to be successful, I'm confident Regional Mexican different sometimes but they can come to agreement. Let's do it and move forward simple as that quickly. I don't think this dance of the eye that absolutely not and I think we can bring them to the table. I have every confidence and then and I think today's discussion does help so I appreciate it. And if other council members are also willing to sign on to the letter, please let my office know and I think that will really help things move forward and on that basis. I can actually my office can actually work with the people who you are and others who are not here today who actually care about even a timetable proposals from the mediators could be and then bring everyone to the table about mediation and general. Alright, thank you very much. All right, we'll have more conversations about this will understand the issues better. I would like to see you frankly if we're going to do this an issue statement. So I understand pros and cons on both sides before we dive into mediation with that said, let's go onto item number one, so test if you'd like to introduce yourself Jeff, thank you. Good morning. Thank you. President Harold. Thank you committee chair bag Sean members of the city council. I'm test Colby with the mayor's office. And this is one of the regular series of updates that we've been the mayor's office has been providing around Regional governance. We did repair a memo for you. So I'm not going to walk you through that memo again, but I do want to highlight three specific things that I want to bring to your attention that really were going to be where the meat of decisions are going to be made. So the first is the governance structure and by that what I mean is the actual boards the composition of the board how it will be constituted and who will comprise and this is a subject that is begun to be talked about in the council client group. No innovation service, which you know Mark Jones is leading up. That work has been holding a number of workshops in the community to try to get community feedback on what a government structure would look like and in particular particular what the the governing board will look like. I'm so that information has been compiled recommendations have been made and we're going to bring those back to the client group at the July 11th meeting for conversation and reflection. This is just a question. Cuz I'm first of all, thank you test we had an opportunity cancer Mesquite and I sit on the regional on the regional policy committee. So we had a briefing on the county side unifying are homelessness crisis response in from Leo Leo floor. So we got a briefing about the interlocal agreement and we got a briefing about the charger and how that would morph its way into a PDA. I was reading your memo. And so and I correct me if I'm wrong cuz you kept using the corporation for Supportive Housing CSH the memo. Can you just briefly tell me who they are? Cuz I couldn't find it in your memo and then he kept referring to CSH so that I just briefly so we can know who all the parties are cuz we have the county on one side of the city on one side. And then on the Cityside the client group is council member Mesquita O'Brien and badshah and so I just kind of you to just lay that narrative out quickly. So I understand. So CSH is a consulting firm. They are they've been engaged by philanthropic Partners specifically the raikes foundation Palmer foundation and the Gates Foundation to prepare a regional action plan. The corporation for Supportive Housing is a nonprofit that's been around for well over 20 years. Their primary focus has been around Supportive Housing. That's the name any particular they've provided they provided input to an advocacy around the need for Supportive Housing. They also have a lending arm. So they are also providing pre-development loans and acquisition loans for folks who want to build a Supportive Housing. They are headquartered at least be headquartered in Chicago. I think their new headquarters in New York, but they've got offices all across the country and there isn't a formal office in Seattle that they have staph in Seattle who are working on this. So CSH is as I said, they've been contracted to prepare the regional action plan and the regional action plan is really what it sounds like. It is a plan that will be that will cover the entire region of King County. It won't be spaced not intended to be a strategic plan for just the authority but it will actually provide guidance and strategic objectives generally speaking for the system that will be created to address homelessness. And is it the WTO feel Debbie seal and is Anna Olivia Olivia at does she work with CHS? Yes. Could you just tell I think Kim's number worse than the rest of us about those two sure because I have met with Amino briefly with Anna but I had a long meeting with Debbie about six months ago and I was extremely impressed by what I'm good. Yeah, so Anna Leaves is now a special adviser with CSH. She has a long history of working around the issue of homelessness. Most recently. She was the director of the special needs. I can't remember what the full acronym acronym is. But anyway the division in HUD that is the division in HUD that addresses homelessness and she was there for better know for 5 years really working. She she was one of the architects of the current works at Hut is doing around addressing homelessness from a systems perspective and no longer really thinking of it as a program by program dressing Italy by program by program. So we're really lucky to have her on this project. She's recently done quite a bit of work with Los Angeles and in Houston helping them again with their Regional approach to homelessness Debbie seal also has a long history. She's been a Seattle resident for a very long time. Some of you may recognize her name from several jobs ago when she was with the office of housing. She's also worked for King County Housing Authority and she's been with CSH now for many years. She's the Western Regional director. So the two of them are taking the lead on preparing this Regional action plan. Do you have another question cancel my rewards? Just spin I'm thank you again test just to clarify one of the things that we heard in the County's briefing back in June, which I did. I apologize for asking a dumb question, but I want to get our terminology. Correct. We learned that there were some outline City's or cities within King County that were passing legislation or ordinances that would prohibit the determined that use was low barrier housing and what we're talking about is Supportive Housing similar to when some of the outline cities were passing laws to prohibit safe injection sites in the Court held that that was a public health matter and not a voter issue. Therefore they were not in the position to put that on a ballot so to speak. So are we talking about the same terms here for Supportive Housing and low barrier housing? No, sew what I had understood was there was a question around whether or not the sound cities any of the sun cities were passing legislation to prohibit to basically prohibit low-barrier shelters, and I'm not aware of that. I've actually checked in with my colleagues at hsd to see if they've heard anything and so far we can't find an example of a of a city that is actually passing an ordinance or legislation against low barrier shelter. So low barrier shelter is of course the notion that you don't need to have pass any particular criteria to get into the shelter. It's typically a type of shelter that is behavior-based. So as long as you know, your behavior is is good within the shelter. You are welcome to stay in the shelter without any kind of preconditions that council member Juarez when we talk about permanent Supportive Housing you can think about this is kind of the Continuum shelter. Turn the front door to the system and housing being the back door the outflow permanent Supportive Housing is again kind of what it sounds like. It is housing. It is permanent. There is no end date. There's no required exit date. And what makes it unique is that it is accompanied by Supportive Services that are really tailored to meet the needs of the residents. I'm so that supportive services available to Residents. They it's typically client-driven in terms of how they access the service isn't it says it's available for as long as they live in the housing and for as long as they need it, you're welcome zample of an organization that really focus is on that so individuals who come in for providing healthy services for them, but they also aren't necessarily people that are going to be able to live on their own weed like that and for some that's the case but for the other Mini Hundreds that Paul Ambrosius and his crew provide housing for they're going to be with us for a while is typically reserved. If you will for folks who are chronically homeless and that have a disability that makes it really difficult for them to gain housing and retain housing on their own without those services. So yes Plymouth is a really good example to ESC has a number of really good programs in this as well. Thank you. Okay, please proceed councilmember mosquito questions because this is all a moving Target and we're still trying to put together the pieces ourselves. I think we're learning from and I asked from the executive team having conversations soon with the county to make sure that everybody's on the same page. So I did a chair to put your memo up here because I believe we received it this morning it's dated today. So I haven't had a chance to look at it and perhaps you could walk faster some more details just because I think we haven't at all had a chance to digest it. I'm usually for myself drawer and when you get only got through correct the first bullet, is that correct? Are you going to go through it wasn't planning on going through but I'm more than happy to I just wanted to be cognizant of your time and there's another panel coming up. So I'm sure would you prefer. Cicada and I want to thank you for getting this prepared for us on Friday. I think you know everybody is dealing with schedules and in the office and not so if there's some specific things that you would like to focus on please do and you know, our time is yours at this point cuz this is one of the most important things that's going on in our area great. So so again, the one of the things that's immediately going to be coming forward to the client group is this issue of governance the board in particular how it gets composed and how it will get constituted and by that I what I mean is who's what sectors need to be represented on the board and what with their skills their knowledge. The representation needs to be what the Constitution needs to look like in terms of folks would lived experience folks people of color. So there's a number of considerations and these workshops that And is has been conducting really have been around trying to gather that information so that they recommended initially recommended board structure can be brought forward. And so that will be because I said coming to the client group soon the other item there's two other issues really that are of supreme importance in terms of getting us to the interlocal agreement and to the Charter the the second one is the the budget that will the initial operating budget that will go to the authority that will actually of course be part of our annual budget process. But to get to that there is needed to be conversation with the city and the county on the programs that are going to transition over to the authority. And so there's been sort of broad agreement that emergency services programs that sort of everything from Outreach to emergency shelter and transitional housing. But those in one form or another need to transform transfer over to the authority and there's been some discussion elsewhere around permanent housing which in our system is rapid rehousing and permanent Supportive Housing. And so the conversations have been about are there any components any pieces of those activities that are better suited to remain with the county or the city or should everything go over and we're reaching at we're reaching agreement on that which is good. If you can imagine when we start actually talking about dollars and cents it gets you know, if it gets more like a negotiation. Thank you. Can I just interrupt just a moment test council member herbel? Thank you two part question one or one question and one statement the Decision around which programs are going to migrate over to this this Regional Authority that is going is it correct that that is going to be defined in the interlocal agreement. Know what will be defined the the actual well, I mean it could be but the actual programs are not right now conceived as being part of the interlocal agreement with the interlocal agreement will do is it will establish a minimum a base of what the county and the city will invest for operations. So at what point does another lender local women is something that eventually is coming to council I what point does council get to hear what you've negotiated. You said you're getting close and negotiate which programs are going to migrate over to the regional Authority. I'd certainly like a stub opportunity to hear what getting close looks like and you know, give some input to that and then secondly, I just want to clarify my understanding that the governance entity will make decisions make funding decisions. And so I think it's just really important for folks to realize that the run Emendations thus far is that no elected officials will be on this governance for and so it just important for us all to know that that likely means that. Entity will be making decisions about how to TU City funds. So to your first question about when these decisions about what's in and what's out will come to council that that information will go first through the client group and then be part of the early conversation with the council about the Ila and the charter and the actual formation of the authority. So all of that will be up a portion of that. It also will go through the council in your budgeting process. So that will also become clear in the budget process. So but we're not obviously going to wait until the last minute and say Here's the budget and here's what we decided it'll be part of that early conversation to get to an ordinance. Would approve the aisle a so that's the answer to that question. And then the second is the authority making funding decisions indeed. The vision is that the authority will issue the RFP is the request for proposal and then from that make Awards who's going to get contracts much of the same way. The county does and HST does the purpose of forming this Authority is to actually translate transfer those duties to this Authority that said it will not be without influence input from both of the council's again is part of your budgeting process. You will be budgeting in the same way you do now, which is identifying those findings going to tip a specific types of interventions. So those dollars will transfer over to the authorities in this in the manner that they've been budgeted locally. So whatever the council processes and the county council's process is intercourse. Doing our process the long-term goal is that the authority will perform and so I am doing my very best to be an incredible Optum. I'm so the goal is that the authority will perform in a way that the council will begin to feel more comfortable with them and at the end as that evolves and develops. Then there may be interested in giving the authority more leeway in and more independent Authority but I anticipate in the first few years that it'll be closely tied to what the what the budget tells could I add to that specifically about whether or not what programs are being looted or not included in the entry local agree. That's a matter that hasn't been resolved at this point. We would be engaging with our Law Department for advice on that and how we need to proceed going forward. So at this time that might not be envisioned but as we engage in further Stop the process that might become something that is necessary and would be certainly doing our due diligence to determine what needs to be included in the Iowa versus not included and then to your second question about where we're at not process. There are some places where what the county doesn't want to see those are not perfectly congruent sewing and when we include our Capital dollars for housing and permit support housing in particular are not handled exactly the same and said the executives have been looking at those processes and where they can match where they had difficulty matching things like that. So those are items that are still being explored and examine in detail. So that something can be brought the council and at this time are the plan is to present that Emma local agreement to this Select Committee for consideration before then moving to the full Council, but certainly the council would have the opportunity to review all of that beforehand good and I also just like to add that I appreciated the fact that we're now doing meetings every couple of weeks so that we can stay on top of that. Also been very forthright and forthcoming about the workers who might be identified. We don't know yet. But of course the goals are to make sure that those who are employees of this organization will know that they're going to have the benefits in the insurance and that they do with the city and the county now again don't know what that looks like yet, but it's certainly something that's at the top of our list to make sure that the employees are involved in engaged for going forward. I'd like you all so if you don't mind to talk a little bit about the they conference calls and Outreach that you've made the Portland and Los Angeles and I know this issue about should council members be on the board or not be on the board is one that people talked about but I felt that we've gotten a good information from both LA and Portland on their model. Do you have a good you just summarize that I could do a quick summary about yasso LA and Multnomah County, Portland, Beaverton. Are the two models in this country across the country that look the most like what we're trying to achieve with regional governance La is the longest-standing and 2T their their Regional governance entity is the Los Angeles homeless homeless Services Authority and they are funded by the city of Los Angeles in the County of Los Angeles. They are the two primary entities that the founders of that Authority that their governing board does not include any elected officials the exact the county exact and the mayor appoints the members of that board. It's a member it's a bit so bored of 10 members and the they do that in part because they want to have some distance some boundaries if you will between the the responsibilities of An elected official and the need for the authority to act independently particularly when asking for resources, so we anticipate that the authority will pull together a budget of its own submit that budget in. This is how La does it submits the budget to they submit to La hour 30 will submit to us and then our city council will consider that through its budgeting process this first year. It won't look like that but yours going forward it will and that that distance if you will an oversight Los Angeles is found to be very useful Multnomah is a slightly different situation. So the county Multnomah County Portland and Beaverton have come together and they have spun off a nonprofit organization, but essentially the functions of the dollars and the Staffing all moved into the county and that entity then Sans as a part from the county but Fairly houseleek closely-held a part because there are elected officials from those three jurisdictions. They find that that works well, but again, it is just a it's a different model particularly because of the role that the county has the sort of lead entity among the three jurisdictions plays. Okay, let's proceed. Okay. So council member of actual as you alluded to the third big issue, which really is the human resources and Labor Relations piece of this and we are just getting started with the hour Seattle human resources department the hsd human resources as well as our labor Partners in this work and indeed the represent the predominant questions, they are to be answered or what FTE will need to be transitioned over to the new Authority and how will staff either transition that world will transition to that new Authority if they want to and so again, this isn't a mandatory you're in this position. Now you need to be over in the authority part of this is the fact that the organizational organizational chart for the newest Authority will look quite different from what the County's Human Services Department looks like in the cities here. Services Department looks like so they're there have been we are still very much at the early phase of this but there has been questions about whether or not because those positions in the new Authority will be so different weather folks should apply for the position that they would like to be in if your contracts manager in HST, you might want to move into an equity position or to a planning and policy position in the new Authority. That's so that's the one the one big issue and obviously that has significant budget impact implications II is indeed benefits and pension. I'm so we've done some work with law and law has actually engaged an outside firm to help us be sure that we know what we were talking about when we say this but it appears as though it's completely likely that city employees will be able to carry servers over into the new Authority. There are questions about benefits my understand Is when this kind of transition has happened in the past what the what the new entity has tried to do is mirror the benefits that the public sector employees have we the city the county can't just transfer their can't can we can't legally transfer our benefits but we can make sure that the benefits are comfortable. So those are really that the two kind of main issues. And again all of this will continue to come back to the select committee before we move forward with an ordinance. I have a just a quick comment in that is we on within our group have not yet met with our County Council counterparts, but I'm looking forward to that because clearly we have very mutual interest which brings me back to the point. I was going to ask you Sometimes we get so focus on the details about this that we forget to take a step back and remind people why are we doing this and put it was a 2016 one bar poppy issue to report to me a focus strategies people talking about the disconnect between the work the city was doing and the work the county does even though we're trying to do the same good things and all home that we often times. We just start using our resources as wisely as we could so I think that's what got this started. But if you'd like to comment on why the regional plan and even the work that we did last year with one table, I know people were like, oh we want so much more out of this will this is part of the so much more. So if you would just remind us, why are we doing it? Thank you. I mean, I think that that is exactly why we're doing it so that in 2016. There were two reports one was Focus strategies. When was barbed poppies report on both of them came to very similar conclusions, which was that Despite all of the good intentions of the Investments of both the city and the county they were disjointed. They were focused on programs and not focus on system outcomes and they weren't really achieving the outcomes that we as a as a jurisdiction really want to to achieve and the recommendation there was that there be bold leadership and thinking about how to address that disconnect. So one table came together and I know in March 2018 the exact and the mayor came together and signed an mou that said we really want to pursue and understand what Regional governance would look like future Labs came in did that did their initial research and yielded a conclusion very similar to focus strategies and bar poppy which was for us to be successful for us to be able to provide services that are truly cuss. Oriented the customer centered that are truly Equitable and address the racial disproportionality among folks were experiencing homelessness and that move this movie homelessness Investments and homelessness forward in a systematic way there needed to be one Regional governance. And so that the at the end of that reporting process from future Labs again, the executive and the mayor came together accepted that report and kind of launched the work around achieving Regional governance. And thank you and you hit upon something. That is my personal pet peeve is that when the systems aren't working. We're spending money. We're not helping the people who are needing the assistance. We're not supporting them in a way that's going to help them be better to have in the housing than they needed with housing first getting the support. They need whether it's a permanent Supportive Housing and this is a real systems approach. That we're trying to be as a as effective as we can for each individual. It's helping us get to that person centered approach as it relates to the conversation that we're going to be having with the county about system changes to align our outcomes and Reporting. I just want to uplift some outcomes from a previous discussion in these chambers before this committee from a from some panelist that we had at the table and would like to know how best to sort of integrate this input that we've received about hsd's outcomes-based reporting our results based accounting. How that might be modified and negotiated with the county so that we have again these these the shared system of outcomes the three main things that I heard is as my take away when we heard from the panel presentations. Is that outcomes the the the successful outcomes are being attributed only to the last program that touch the client whereas the client may have received the services of many programs and those many programs. Don't get any credit for their interventions with that client. Second later is concerned about the way we collect data and Report successful outcomes that might inadvertently lead to sort of creaming working only with the clients who are most likely to result in a successful outcomes. And so the the rec Station is that metrics of success should be informed by unique barriers that people experiencing homelessness. So different organizations are working with different demographics and population of people some of some of whom might have greater struggles in being successful in their outcomes and insect second lady other piece that folks feel need to be considered in outcomes is the availability of housing Alternatives so that if if organization isn't performing, well, I'm at a particular time when there isn't a lot of availability that should be taking considered into consideration along with those reporting about comes and then thirdly a request that we take into consideration that some of the organizations that were funding and we're measuring for their success actually have some earmarked Services associated with The navigation team that then because those there are earmarked beds and resources. They are going to be more successful in referring people to those services and if they are being measured against other organizations that don't have those Aramark Services those other organizations might not be measured as favorably until just wondering is again the Ila the place where we are going to be able to come together with the county on identifying what these performance metrics are excellent question. So again the Ila as it's currently envisioned would not be the place to do that kind of negotiation around specific metrics, but I will say that the regional action plan is the place where the system-wide goals will be address. I am not sure that they'll go that it will go down to the level of individual program outcomes. What you're describing are really the performance-based metrics in the the Contracting that the city is doing. I will say that from what I understand the way we do performance-based Contracting in the way the county does it is different and so there will definitely be some negotiations around how they how they do their Contracting How We Do ours and understanding both how we combine that but also how we make sure that those individual contract level performance metrics are feeding up into the larger system and the larger goals of the system. And so if what we want is to end up with a sort of universal goal of making homelessness rare making homelessness brief and making it non-recurring then really we need to make sure that we've got sort of underlying if we think of that. The umbrella, we want the underlined pillars to be specific metrics that feet up and make that possible and that's all going to be part of the conversation with the county and the community around what those metrics look like and could you talk a little bit more? I know that Allison eisinger and others that are leaders in this provider Community have been involved in conversations. Can you talk about how they are involved now and your vision for the future? So the provider is have been involved in a couple different levels. The there are some specific work group that the providers have been printed various different providers have been participating in the summer and organizational stand-up us some around governance and some others around Equity. So so those that that's been a platform I will say and this is not this is not surprising. Most of the providers have been most interested. The regional action plan for exactly the reason that councilmember herbal just mentioned which is that plan is really where the goals and objectives and metrics are going to be flushed out and that's what's going to have the most impact on the way. They do business going forward. Thank you. Cancel. Thank you very much. Thank you for reporting this out again. 1 underscore that I feel like this is being done in real time. As we are continuing to have conversations about what this could look like. I appreciate your memo outlining some of the areas where there's some broad agreement. I want to underscore 2.7 brought up just for a council colleagues. I'm knowledge. There's two pieces that I've kind of been staking a claim in the ground around as we have conversations about what this could potentially look like and would love your feedback and thoughts before a final proposal is Stratford from the executive seen one is at regarding funding. We know that we cannot currently serve the 35 to 45 hundred people who are currently living outside in our region with existing fun and the data continues the back that ass up like in the chamber of commerce's report last year showed that we have an ongoing analysis right now that's looking at rev. Resources that I think is coming forward in the next month. Is that right? And Analysis looking at current funding and we're that's all going on that I again thankful underscore that we simply do not have the resources we need. So one of the things that I'm continuing to advocate for that I've heard from community members is that we do want this body to have revenue-generating authority what we know from the conversations in La is that they've been largely successful at both stemming the large increases in the number of homeless folks. And as you heard from Chapman simple a Christian Chapman simple who came in January of this year, they've actually seen a decrease in the number of people living outside in Los Angeles largely because of their large Investments that they put on the ballot and actually creative funding so we know we need some funding in order to address the crisis of homelessness and lack of affordable housing in our city. So one way to do that besides going to the ballot would be to create a revenue-generating Authority. I'm not saying that that would have to be year one. But I think it should be a goal of ours to make sure that there is sufficient resources to match the policy needs that this body will be asked to implement and pursue feel so that that's a big issue. I'd love to continue to hear your feedback on the interstate be a PDA Development Authority. I think gives it some ability to raise revenue issuing dad and generating revenue is a good first step, but I think their ability in the future to text me that I have to pay it back. So I'm going on an ongoing would be helpful on whether or not focused. I feel one way or the other on that the second issue is I am still torn about whether or not it is good practice for us to have a body that has no elected officials on it similar to I think what we heard in Los an Plus they don't have any elected officials on their body. But the body in Oregon does have elected officials on it. I think that the big question for us is going to be who is ultimately responsible for making these decisions. And I know none of us up here want to wash your hands or it'd be in a position to say it's not our responsibility and shrug our shoulders when this ultimately falls on us, especially if we're the ones who have ultimate revenue-generating ability and authorized budgets for this body in the future. So I am still debating a internally whether or not that's something that is a desire of to have elected officials on this body and also want to learn from both Oregon and California and would love to continue to get feedback from you all and members of the community. So I'll just put that out there. Those are my to thicken points that I'm not yet settled. Fashion show show in there. Are there other models out there. There's some camps with electives in some cams without or they're just previous to that. We're looking at it with can you give me a little thing that looks the most like us other way. There's other Regional collaboration. It's typically through the Continuum of Care so it's not so that is a body that has a fairly narrow focus on mostly just the mckinney-vento dollars would like us to be able to move on here to our other panel, but I do want to say this is an interesting question and I know that other council members have raised 2.2 about what their involvement is, so I'd like us to talk and think about how this committee can be involved. So I don't know what that looks like yet. I'm not reaching a conclusion that clearly there is great interest among the council members to be in one way or another participating in these decisions. So it isn't just a delegation of responsibility. If the two of you that you would like one more question as well can plan it says the regional action plan is not an implementation plan for the authority is a plan designed to create momentum and accountability for meeting the community's goals towards ending homelessness. I'm having a hard time conceptualizing how those are two different things. Yeah, perfect question. So the I think with what I'm trying to say here is that it is not narrowly focused on just the authorities. So often times we think about entities having strategic plans and then work plans that follow on to those and they're usually guiding documents for just that entity just that Authority. And in this case, the regional action plan is being created and conceived of as a plan that the whole Community owns so there will certainly be poor some portions of this that will fall under the jurisdiction and zodiac Ability of the authority but there may be other pieces also is where we are going to rely on outside Advocates to help move that work for door are Housing Development community. So it's okay. Cancel Amber Pacheco official serving on the board. Can you elaborate quickly on avoid conflicts of interest within that bullet point? Yeah. So when we went to law and asked about the question of the composition of the board and in particular elected officials, they came back and let us know that there's a a state's attorney Attorney General ruling or decision that is not actually in La per se but it has been stated a couple of occasions that there's this concept of incompatible seats and the concept goes that if you have an elected official on two different bodies and one body is so bored. End to the other body. So in this case the authority will be subordinate to the city council because the city council will be the budget will have the authority to basically budget and transfer dollars that it is incompatible. It creates a conflict of interest and that elected official would need to basically give up one or the other of the seats. So that is that is basically the the information that we've been going on when we've raised the concern about conflict of interest compatible office Doctrine. It's a doctor in the future in General's office has interpreted or pulled out from some opinions and some actual court cases, but it is not something that's in law and furthermore there is examples you can think of that help the door at that are Regional Health Board and things like that where it's the state legislature has given specific Authority that was In our case, I see on Lincoln County to have elected officials on that and that's why it would likely be necessary in order for elected officials to be on it though. There is there's cases of that precedent and that we work to kind of get a sense of how difficult that might be. All right, no further questions. Thank you. And thank you for the great work you're doing on this. I appreciate both of you very much. Okay our next panel if I'm a thank you for waiting for us and I look forward to hearing more about the Youth and Young Adult homelessness update. Very good. I think you all if you would like to introduce yourselves for the record and we'll just start with you Jeff. Hi Jeff Sims on Council Central staff. I'll have a few that can board. Thank you very much. All right, who's kicking this off? I think I am. All right, so I have written testimony for a change. So you all be grateful for I'm sure good morning council members. My name is Melinda think I'm the CEO of youthcare. We're founded in 1974. And you care was one of the first shelters to serve runaway and homeless youth on the west coast since then, we have expanded to 14 sights and serve over 1,500 young people every year and you'll hear in the next presentation the number of unaccompanied young people experiencing homelessness in King County dropped from around 1,500 in 2018 to 1100 in 2019, which amounts to a 28% reduction. The most notable was the decrease decrease in unaccompanied minors experiencing homelessness, which drop by over half and these numbers are certainly promising and a caused B and thank you for the opportunity to speak today about what about some of the reasons why I believe we're seeing so much success number one targeted funding that's proportionate to the need to look at the two populations that experienced the largest decreases and homelessness. Its young people and Veterans. These are also the two populations that have benefited exclusively from targeted and Investments. In the past three years the Statewide office of homeless youth almost tripled the number of Shelter beds for minors in Kane County and the King County Youth homelessness demonstration project as well as best starts for kids from the county have infused additional resources for Youth and Young adults services and support last year McKinsey & Company debunked the very false narrative that we have in this city about there's enough funding to end homelessness if we just spend it correctly. No one seemed to listen to those findings. So I'll say it again chronic underfunding perpetuates homelessness in our community when we write size are funding to fit the scale of the problem. We see results which is why I get to be here today. Number to tailored interventions that address the issue both upstream and downstream make a difference now, maybe you've heard me say over and over again. I'm a one-trick pony in that stew again today. I know what works for young people and young adults experiencing homelessness. I say this over and over again because Youth and Young adults have unique developmental needs which are validated by Neuroscience for young people the pathways into homelessness and solutions out of it are not the same as they are for adults. For example, we know that many of our systems of care foster care Juvenile Detention mental health facilities in homeless shelters become pipelines in the homelessness. That's why the state pass the Senate Bill 65 C8, which tasks Washington with ending the practice of discharging young people from their systems of care into homelessness by 2021. And that's why our State Office of homeless youth has Focus not just on helping young people who are experiencing homelessness, but preventing them from experiencing homelessness in the first place as a result. We now have case managers who work inside of detention facilities so that when young people exit detention, they have an actual place to go we have case managers embedded inside of the alternative Seattle interagency Academy Schools, so they can help students and their families who are experiencing housing instability or who are at high risk for homelessness. And we have family reconciliation counselors who work inside of are under 18 shelters helping to reconcile those families conflict. So you don't answer the foster care system or simply exit the shelters back into homelessness do want to note that almost half of the young people in this year's account reported psychiatric or emotional conditions and over third report drug and alcohol abuse. There are there were also alarming rates of young people who reported a developmental disability moving forward. We need to think about how better to partner with both our DD system and our Behavior Health Systems so that we can stop the flow of young people exiting from those systems on to our streets and into homelessness. So tackling this problem Upstream by dressing some of the drivers and the homelessness is the first part II part and I really want to underscore. This part is that you care is laser focused on reconnecting young people to education and employment Pathways. This is another difference between adults and young people because young people are at the onset of their careers and lack employment skills and experience. The number one risk of homelessness a 340 6% higher risk is a lack of a diploma or high school education or GED when we talked about ending youth homelessness, we cannot focus only on shelter and housing education and employment must be a key part of our strategy so that young people can have the skills to maintain their housing long-term. For this reason Youth Care operates for GED and high school diploma programs and seven employment training programs and thanks to the city support our most rigorous pre-apprenticeship program youthbuild has a 90% success rate of young people transitioning into either post secondary employment with the construction trades upon graduation. And I want you to know that those are good paying jobs one of my clients making more than I do right now, as you know, you care will be expanding or employment and education services in the coming years with a new building on the corner of Broadway and Pine young people will be able to focus on skill development and educational attainment with a goal of entering the workforce are going across the street to pursue a degree from Seattle Central. I want to thank this Council for the including the capital funding for the building in last year's budget and I hope that you'll be a supporter of us and years to come as we fund the employment services that make that building true. A transformative I'm going to wrap up here. I promise I know that I was asked to come here today and talk about success and progress and well, I don't want to end on a negative note. There are two additional things that I want to acknowledge while I have this Platform One all of the research on Youth Development shows that the number one most effective way to help young people move forward is through relationships with stable caring and trusting adults and let me emphasize the word stable because as you know, our Workforce is not stable. So I hope that you all attend the next Council hearing on July 11th about the annual inflation adjustment to stabilize our Human Service Workforce. And 2 and this is the last and most important point. I am pleased to see a reduction this year and youth homelessness. But if we look at the data closely, we actually see a different picture 2018 41% of young people experiencing homelessness were white and 23% were black in 2019. The percentage is decreased by 3% for white Youth and increased by 11% for black youth Latin X Youth and Native youth also saw increases in 2019 each Rising 4% The overall prevalence of Youth homelessness has declined but disproportionality has risen a progress means homelessness is going down for white Youth and up for youth color. Then this is not a success. It is a failure. We know how to reach young people sleeping under the bridge, but we also know that homelessness presents differently for lgbtq Youth and youth color and the onus is on all of us to examine our systems are definitions of homelessness and our services so that they are truly accessible Equitable and culturally responsive. Thank you again for the opportunity to speak today. We have an incredible opportunity to build upon this work based on the lessons. We have learned that young people have unique developmental needs, but homeless is also also experienced differently and it higher rates for different populations of Youth young people are resilient and hopeful and we create and if we create Equitable opportunities for young people to succeed we can prevent chronic adult homelessness, so I'm excited to partner with you and with the county with all of our Community Partners to improve and build on these successes and most important sustain them overtime. Thank you. Thank you so very much. You have always been an inspiration to me, and I'm so grateful to all you have done have a number of questions, but I would like to panel to continue and I'll Circle back good and thank you for inviting us to be here today to brief you on youth homelessness. When they spoke so wonderfully on the current issue that a lot of what we have maybe a bit redundant but we will present none the less and I am also so very happy to be here with are found in youth action board member that will be cool presenting out with us to get with me. That's a very slow-moving one. Okay. I'm sure that you'll see that if one in every five years and young adults experiencing homelessness become financially independent results than the net value of expenditures that would be avoided over their lifetimes as an estimated 61.2 million. Of course, you'll know that it's a dressing using adult homelessness lessons their likelihood of becoming homeless once again, whenever they grow up into a doll head Boy, how are you? Alright, so if y'all want to put on your imagination cats, you will see the Countess in data from our point in time count from last year. So the pick numbers are always an underestimation. So because we of course cannot get any of everybody no matter how hard we try but they do show us the trends over the years. And so we saw our first decrease in overall homelessness and seven years, which is a 28% decrease according to your weight time counts, and we saw our 52% decrease in homelessness of unaccompanied minors for the second year in a row. As I do it the dressing of the Arts have no problems. There should be a graphic that shows some of these factors. I was trying to peek ahead to see it and I'm not asking for a lot of specifics. But if you noticed Trends weather in Seattle proper or outside Seattle and certain more rural areas of the county what trends were seeing. If you have any information that would be sort of curious to know. Yeah, I think I'm on this next light actually talks about some of those trends that we're seeing when compared to the general homeless population. Are you can an adult population have more recent eviction. They also have higher rates of being on probation and parole than the general homeless population and also higher rates as Melinda mentioned of having PTSD and other emotional support needs is what I thank you for that and what I was trying to get at it was Seattle as opposed to outside of Seattle. Are we doing out of the other just training Insurance where where they are has broken out here by Geographic areas Drummond County, but that's something that we could provide. I think that their words are in Seattle. I haven't, you know, it's going down all over across the board, but there been a huge amount of resource. Is put into under 18 Services, which I think is really an important important thing to know, but we can certainly get those to you furniture. Cards to your question about Trends within the city limits. The numbers are trending overall in the same way that they are for the County Down consistently almost almost exactly the same percentages and then when you break that out by population, that's very consistent as well. Bring my sister should have went in where we was assumed. I guess that's very helpful helpful testicle, even though the numbers are down. The disproportionality is up which presents us with some new challenges that we've got to focus on and be honest about I would agree with you council member. Badshah. I mean, I think that one of the things that we know in with working with young people is at them people of color present and lgbtq present differently. They're not necessarily the kids who are caught Uncle chronic under a bridge. And so how do we reach those young people ensure that they can get Services before they go so far down the pipeline that that is hard to get them back into Care. Thank you counselor was Thank you madam chair. I just have a quick question cuz and I could be absolutely wrong on this but it seems like a weird coincidence on this slide where you have the Native American American you have it at 10% and then 1% of general population. That's the same is this just for use cuz this is the same statistic that we use for adults. It's the same exact statistics that Native Americans experience homelessness 10% This is across the board and we make up less than 1% of the population. So you're saying this is the exact same for you sniff American Youth. I'm better at counseling Juarez. This is for unaccompanied youth in adults only. Okay to look at racial demographics in the point in time count when we're doing when we're doing the count. It's a visual count the racial demographics come from the survey. That's true across the board and so there. Generalized for the percent of the population that does the survey their generalized to the overall count percentage. So they are going to be fairly consistent and they are going to fluctuate significantly year to year based on who completes the survey in that particular year and then we extrapolate that to the entire population. So the racial demographic breakdowns are not an exact science in the account in any way shape or form and that's why you're likely to get short of generalized numbers like that. Thank you. Thank you. Please continue to let see me. I know we've had some technical difficulties, but let's see if this will all continue on here. And so like we mentioned earlier we were seeing this decrease and we're giving this to the Target in Investments on philanthropy has been a huge part in this work are providers are doing amazing work and businesses and Foundations and also add No funding from hardwired Sleepy funding youth on the system installation program. But now I'm going to contrast that's a bad and we're going to look at data from our home has this management information system because we know that the point in time count is typically and under count but it gives us a sense of trans. But here we're going to Pivot now to a homeless is management information system data. And before we get into the numbers, we're going to look at these in three aspects first is the system and trees an inflow and and those are newly homeless episodes, but they also include those that have been previously previously house and returned to the system or inactive and then the second column are those that are active in the system and that includes I'm sheltered emergency shelter transitional housing and searching for housing such as an hour rapid re-housing programs and bees also include those that are on our coordinated entry prioritize less and then we'll look at system exit. Which is outflow and this are those who have been permanently house. And also those that are temporal temporarily housed unsheltered exits deceased inactive or unknown destination. And so so here when we look at these numbers and we look at inflow and this is the 2018 analysis. We have approximately 2860 are coming into the system and 2017. It was 2,800. So this isn't changed very much and you can see from this that 84% are newly homeless. There's approximately 11% that are previously inactive and about 5% that were previously house in so that 5% is basically the returns to home so we only had about a 5% of return to homelessness what we look at the outflow those leaving the system. You can see here that this 2018 number is approximately 2889 and 2017. This was 2300. So the system is doing better at housing unaccompanied Youth and Young adults. Don't we look at the outflow breakout? You can see that 33% went to permanent permanent permanent housing solution. Approximately 8% were temporarily housed 4% unsheltered. And here we have 46% that's unknown. And then I know that this is a large unknown number we suspected this all folks who have self resolved or that left the program and we don't know where they went. And so we have some future of data quality improvements that will be focusing on to get a better clear picture on on on those unknowns. But please remember that does include a portion that have self resolve and so and our current are 2018 active number is approximately 1511 and 2017. This was 2050. So we look at our point in time count numbers, which is not an exact methodology. It helps us to understand Trends and we contrasts it. Weather Homosassa management information system data, we can see that there are some improvements influence so high but the system is doing better at housing using adults more quickly. Any questions on this before we move on to the next five? Solid so I'm giving that information given that only a third of youths were confirmed having found housing on their own. We want to sell them for severe launching the end you come with us. Now campaign in the oldest campaign is to reach functional Zero by July 20-21 and functional Sierra with me and that the need to either or to see the need for housing and I'm so this is going to be youth-driven. So we're going to send your customer voice and make sure that the people experiencing homelessness are the ones who have input and how the systems are reforms and how the programs are implemented. So as I said nothing about us without us, so that is the difference between this program as opposed to other models that we've had in the past and we really want to make sure that everything is racially Equitable ads that everything has a star cleanse like whenever it comes to like queer communities and other marginalized Groups that have fallen in the gaps and that's I just really didn't need housing of course because we just really want to do away with all this for personality that we've seen the point in time count. And the any promises now campaign came from the youth homelessness demonstration program, which was implemented program to try and make I'm Oliver model 3 Forum censoring youth voice and Seattle is one of the 10 first-round cities of the whites GP and one component of the program was the youth action board, which I was brought on CEO and it was composed of Youth and Young adults with experience and I joined so that really helped me to get a foot in the door whenever it came to policy reform and realizing that this isn't just on me as an individual and that the system is broken and that we really need to do whatever we can to reformat and fix it. So this is something that I'm very hopeful about Knights and solve the I think we have a slight here that may be missing or lots of technical difficulties today. So before we get into this side, there's a side that supposed to talk about the different why should be funded programs? And so the 5.4 minute we receive from HUD and our community develop a coordinated community plan and the and you promised is now campaign really allows us to live out that community plan. And so there were four programs that are Community developed Innovations to help us understand so we can better more quickly achieve this goal of reaching functional zero and the first is the bridge housing program and that's called the new hot joint component. And so they're to transitional housing programs in the future home of Hope and United Indian tribes of all Nations and those two transitional housing programs return into crisis housing, which were are launchpads into our Rapids. Housing and then we have our youth engagement team is doing phenomenal work legal counsel for you than children Therapeutic Health Services and accelerator y and friends of Youth of the provider is there and this is a multidisciplinary team. It has not only a legal Advocate but it has a therapist housing Navigators Pier Navigators in case managers that works with mine from various systems weather that schools Juvenile Justice System child welfare and Behavioral Health System and our next why should be funded program has the Behavioral Health crisis response and we basically added an additional staff member to our crisis Outreach response system for young adults that provides a crisis Mental Health Services to work without different provider has more upstream and accelerator. Why is the provider here? And then our last white should be program is do you think an adult navigation diversion program that is basically like that you can gauge Mateen but serve. Young adults aged 18 to 24 Therapeutic Health Services accelerator wire the providers here. And again this offers wrap-around approaches to divert uthan in adults from the homelessness System Manager quick question. Thank you for your presentation. First of all, just quickly because I'm kind of a nerd when did you guys sign the mou? When you're on your last leg that all home King County City CLE just descended February. Yes. Please go ahead and continue. All right. I think we're missing some slides here. I am so sorry about this out these technical difficulties. And so with this work of the campaign and basically like what's going on with the Consolidated foremost authority to shift from a patchwork of programs to a highly responsive system of Excellence by creating flexible operating structure. We're also wanting to quit a place to manage effectively and efficiently all youth investment so that we can have a systems lens this work. Additionally we want to operationalize racial Equity throughout the system and one of those I think the most exciting parts of this work is that are used to action board that we have moved Beyond Community engagement with those with live experience to partnership Youth and adults with Luke expensive homelessness are currently experiencing homelessness are helping to design Solutions helping to evaluate and Implement those Solutions. And it's giving us a better understanding of what works. And in and also to bring what works the scale. And so here on this slide looking at some of our progress to date as we mentioned the mou was signed with the which allow for us to form the social zero action team City counting all home staff work on using an adult issues. We're basically for the most part working in silos. We collaborated but we were very much in silos and so City County and all and all home stopped working on this issue are now coming together in a functional zero action team much like a command Central style used to drive reductions and Veterans homelessness. And our youth engagement team in our young adult navigation to version teams have served in and now the number is nearly 200 youth in in adults since they launched in October 2018. So here's our timeline for the any of them with us now campaign. So at the initial funding Gap remedy staff hired and we have our space acquired in our campaign launch happens tomorrow and our goal is to achieve functional zero and I left function with a row because it's not like we know that we can't make it so that nobody ever becomes home was ever again. That's a little bit Out Of Reach for now, but we are not the first city to reach functional zero and we absolutely won't be the last but as Seattle has a history of doing we do plan to reach it and set it spectacular example for all other cities in the nation. Messed up that concludes our presentation. I'm grateful for all the work that you are doing in this realm and I want to come back now and I had a couple of questions. I wanted to ask you, how can you talk a little bit more about youth build having been there? I've been so impressed with a cohort. Is it expanding? I know that four. Time it started off at 30 kids. And then and the people we have done we continue to look for funding for will be applying for the Federal Grant and and hopefully be able to get city support but we need to find a up a more sustainable long-term funds dream for it or outcomes have just been over the top in the last stub for 5 quarts. So and they're working closely with labor. So these young people go to school get leadership training and build we're actually building some of the tiny houses in conjunction with Lehigh as well so that they actually get Hands-On training and they're being placed in the pre-apprenticeship apprenticeship programs up on exit. I just want to put a major gold. Star in your crown on. I just think it is one of the most impressive things I've seen first. I went down and saw them as they were beginning and that commitment and they had to show up and had to show up on time and they learned the soft skills, but then the team the team work and then I came back the night that they graduated it was one of those moving experiences for them for me for the families and to know that these young people were going to have jobs. Like you said before they are not just family wage jobs, but really getting their feet on the ground. So thank you for doing that. Second question is when is Broadway and Pine opening up? I know you and I talked about this week and a half ago a couple years ago. We got the meat out what we are still the land purchase should close in August, I believe and then we'll start on the remodel redesign phase of that with capital housing. So I'm hoping 2021 is my goal, but I have to raise a boat ton. Looking at each of you. Yeah, every little bit helps. Thank you. Any other questions go ahead can thank you for all this work that all of your doing is very meaningful and particularly with I use it's so tragic. It's experiencing homelessness. Is it particularly ology Seattle Public Schools Mission wolf as an example when children are doing the best they could in their homelessness. My guess would be that they're not proud of their home instead of the stigma. They don't want other people to know for whatever reason but perhaps summer say they're saying I'm doing this can I am homeless? Can you talk a little bit about how do you really get to those kids that are homeless and deal with the stigma that I am assuming is associate with that. And is that skew the numbers and is that a big barrier to us getting this kind of work? I mean, I believe or not I was young once Image when I was in school is a lot of kids are so many can talk a little bit about that obstacle that I am assuming. It takes place. I'm a lot of us didn't actually know that we were homeless whenever we have been going through it. And imma some one of the big things that I know a lot of my peers have benefited from was having school staff. So like social workers being educated with the mckinney-vento program and know like what signs to look for and how to provide support to their home with students and we're trying something new model which originated in Geelong Australia actually called the Upstream model now since they started doing it in Canada and that would be having a housing Navigators and have more train stop in the school to be able to spot homelessness and really reach out to the students and try to make sure that they have the support they need before they really enter the homeless of system. I think it's really important to me. I think you're right to get into the schools and fine young people before we there are a lot of issues and lots of barriers for young people receiving services including not meeting a definition that of chronic homeless and being on the streets and literally under the bridge. And so the young people we need to reach most and most quickly are the young people that are in school are hanging on, you know, Couchsurfing all over in safe and unsafe places so that we can get them stabilized before they fall completely into Street based homelessness says if you're experiencing homelessness or your housing insecure come talk to this counts. I mean are we actively Looking for opportunities for safe place for person go as opposed to spotting it or just relying on them coming for. Cuz it's something I mean we could find time and I'm just curious about hotworx in an unsafe environment. I would wake up with many amps on me, but I'm because I was living with family and because I had a roof over my head every night. I had no idea that that would be qualified as homelessness. It was through the school counselor. Just reaching out to all the students and having them have meetings with her that she was able to listen more to my story and refer me to the social worker about getting resources and wondering if they could help us with this body of work too so cuz they're right there in the school then there and when I interviewed several of them for their appointments, they're almost all of our passion about Children youth extreme homelessness in their school. So maybe they can put some structure around. This is well and interests are partnering to utilize the funding that was set aside for youth homelessness in the education Levy that recently passed to design a program to address exactly what Melinda just said, which is the population of you that don't meet the definition of homelessness for the homeless Services come on, but being able to to stop Gap that services for for Youth and families in the school system that are experiencing highly unstable housing, but aren't eligible to be referred into the homeless system and to work with school Personnel to identify those youth and families and get them Services before they fall into the homeless system most of the Seattle public school. Are what they call Safe places so they have the yellow placard that says safe place and that is a direct line to getting services or do we still get you hooked up with them an emergency counselor or into a shelter something like that if something comes up so we try to get out into local businesses and into places for young people are all the rec centers all the libraries. So but those kind of programs which you know are visible and a young person can you know identify with them without having to say hi. I'm homeless, you know, they can just call a number and get some some counseling and support them where to go to get some I want to just again. Thank you for coming I ran into two young people last will I guess it's been almost last summer now, when was from Spokane? When was from Bremerton both of whom where I am guessing getting over 18 19. Both of them told me that they've been tossed out of their homes that they came to Seattle because Felt like they could find people that would be understanding both of them ended up in Youth Care want to say thank you and just how many feel that was to me. And both of them said when I asked what what are your needs at this point? They said they want a job. They weren't looking for handouts. They weren't looking for you know, I just a place to crash for tonight. They said we need a job on the house. What do you want to do? And they said we have no skills. So go talk to Melinda. She can help anything else. Goodwill, thank you all for coming and thank you for my colleagues for hanging in. I know that at 12:38 on a Monday means that you have a short. Of time until we get started again, but I'm and thank you for your work and thank you for participating in this is live as a youth involvement. Very good. Alright, so if we have no more questions for this meeting is adjourned. All right, what are actually related to all your office is on May 24th, and I can see they're about a hundred members in addition to me. Yes. So if if you all can let my office know as soon as possible we can we can make some progress and I don't get to work with you. All right, what I wanted this to have a mediation plan and identify the issues that they can work out. What happened.", "end_time": 6613.5}]}