{"format": "raw", "annotations": [], "confidence": 0.9412841039005987, "data": [{"start_time": 0, "text": "Good morning. Everyone. Today is July 22nd, 2019 in the select committee on homelessness and housing affordability will come to order. It is 10:50 a.m. I'm Teresa Mosqueda chair of the committee and joined by culture council members on the sawant will soon be joined by codeshare councilmember Sally Bagshaw and also joined by council president Bruce Herald council member Gonzalez and councilmember herbel. Thank you all for being here today. We do have a free items on today's agenda a first is a briefing on the human services department for performance metrics update II is an update on the navigation team expansion and the third is going to be in the update on the regional governance Fort group. We wanted to make sure that there was plenty of time for this. I know in the past it's received a short allocation of time and we wanted to give a chance to get into the details in terms of how those discussions are going so far and make sure all the council members have a chance to ask any questions at this point in time before we get into Late summer and fall we are going to take public, today, but it will be at the end of the agenda because we know we also want to hear feedback from the public on those three agenda items and I appreciate you all signing up. I do have one full sheet in front of me and look forward to seeing the other ones if there's folks who signed up as well. We'll get you all in before we leave here today at last I would say the last three public meetings we have had were bus robust public testimony on the need to make sure that we're protecting the ability for those who created on small tiny home villages to have a self-determination and really make sure that we're investing in all of our tiny home Villages and listened to the concerns that have come up around governance. And we appreciate councilmember sawant bringing forward a letter that meaning of a signed onto recently and what we will hear public comment on this later. I'm sure that this issue will come up. So would love to have you provide a brief update come from her salon. Thank you again for a mosquito. Yes, as you said correctly. We had begun a mediation process with the support of many community members and organizations and residents of Nicholasville and although independent members who are part of the various Nicholasville boards and a draft of that letter was for send around on May 26th. And since then we've had a very important select committee the select committee as you all are committee members probably know but if you don't understand important update we had a discussion here on the diets and all kinds of members agreed that this is the productive. This is a productive approach to take on which is a bring together the two parties Nicholasville and Lehigh into a mediation presided over by a mutually agreed-upon mediator. And also I just wanted to remind everyone that. Mediation letter has been signed by not only by the council which is very important but also by over a hundred I believe at this point community. Is auto Innovations depending on who the entities are and we are trying to continue to have those discussions privately with Nicholasville and Lehigh so that we can bring this to fruition and I really really hope that we will be able to do it in the near future and what that said. We also a topic and we will make sure to get to that before the end of the meeting. Thank you, Summerville. Agenda item number one human services department homelessness performance metrics for Griffin discussion. Thank you so much is here in the audience. We have test Colby from the mayor's office and Jason Johnson who are here if we have questions that I understand won't be joining us at the table for this topic for being here at us to get the presentation put up on the screen at this is an issue that has come to us for the last 4 or 6 to 8 months. We've been talking a robust a data set that we can all look to to see how we're doing in terms of Sheltering those who are currently experiencing homelessness. If I was from experiencing more homelessness helping to divert individuals from falling out of their house situation and into the streets and to really show what we're doing with our Investment in some of our most valuable partners of those Human Service Providers on the ground. We have an opportunity. I think to highlight some of the work that we've done in a way that expresses to our public the most important role that we have is public servants is to make sure that the public dollars being put to the best public use and to build trust and to be transparent and how are investing those couple dollars since basically December and I would say maybe November during the budget deliberations. We've been wanting to Showcase to the public where these dollars have gone and to show constituents that we're making progress. We've seen some of the rates decline in terms of the number of people experiencing homelessness outside at least according to the point in time count, which we also know wasn't under count. We seen on credibly important statistics to remember in terms of how many shelter beds we have open a night presented at various points. I know we did this during the budget deliberation Process earlier this year and more recently via email. I've been inquiring about how many enhance shelter beds we have open a night on average. The latest is it that we saw it was 5 and 1/2 shelter beds and one tiny house Village bed open on average a night in the in the city when we have a Regional Crisis that has about fifty five hundred people who are sleeping outside on shelter and only five or six enhance shelter beds open at night. It helps us underscore the urgency of creating affordable housing now and opening additional enhanced shelter beds. There's a lot of reasons people don't want to go to mat on the floor shelters. We've heard time and time again to line up at 6 in the morning and and are to leave at 6 in the morning and then have to line up at 6 p.m. Doesn't create a sense of stability. We've heard time and time again that the more enhanced shelter beds are open. The more families can stay together people can be with Tess items can be put into lockers people can have showers and really importantly Access to case management Health counseling and true holistic Services. That's the importance of this type of data when we see where the gaps are. We can help fill those gas when we know it wasn't doing. Well. We can help direct funding to what's been a successful in our city and we really appreciate the conversation that we've had with the number of the providers in community. I would say a lot of people who've said to us. Yes, we're reporting time and time again on what's what we were at being asked to report on to the city. But sometimes we're not being asked to report on some of the things that we know work really well specifically around if there's a lot of people who said we would love to provide more statistics on who were helping to prevent from becoming homeless. And also they would love to help us have metrics an indicator is on why it's so important to keep your same case manager. We've heard from direct service providers that without the ability to have a case manager on site where the same case manager we end up losing people into the system. Cycling back into homelessness and we're not able to provide them with the robot services. So this type of data is important. We seen this from previous administrations, like even in the governor locks Administration when they did the Blue Ribbon commission and every Department had a set of metrics that they reported on I believe monthly here. We are asking for 8 months for a similar set of metrics and I know Jeff you're going to walk us through what we currently have insurance and metrics that are being reported reporter from the all home. - board provided by the providers to hsd and the metrics. This is just a few of them suggested by provider organizations themselves. So I really look forward to hearing more about and Jeff. I know your sort of filling in for essential staff, but my intent is to make sure that we're working coordination with the mayor's office to get the set of her bus metric. I'm looking at that is dated April 20th from the executive office where there was an acknowledgement that we are working to I think on a joint strategy to make sure that there is a dashboard of a shared interest in making sure that a dashboard is created and a commitment here in writing that we would have updates in May and June July and we don't have this folks from the executive office sitting at the table. So what I'm hoping with our Council co-chairs here is that we can continue to work on getting this I put in front of us and we know that there is working done by each department to come up with a set of metrics that would not just specifically but that is something that would be used for various departments. That's a good for start. So we look forward to hearing more about how those specific metrics as they relate to services to homelessness will be provided to the not just the council but to the general public and I would say the media so that we have a better understanding of where we're doing. Well what issues we can report on how we're incorporating the provider feedback in turn. The new mattress that would come forward and Jeff. I turned it over to you. I had to walk us through what we currently know what we currently have in hand as it relates to a potential dashboard for performance data on how we're serving those were homeless and potentially those who were preventing from becoming homeless and then open up to my colleagues for question. It's working great. Thank you so much for the record Jeff Simms from Council Central staff council member as you noted the last time that this committee discuss this topic was at our April 22nd meeting and at that time and also and conversations every male on with the executive. We were looking we learned about efforts underway both by the mayor's office and hsd to put together dashboards and ways of visualizing and better communicating to the public the progress being made with our investments on homelessness and how they're continually being improved. Since that time let me first I like that during that meeting. There is also a panel of providers that provide input on additional metrics on top of what hsd is currently putting together and measures a part of their contracts that highlighted areas that the providers would like to see also measured or also incorporated into their contracts as measures that they should be having held accountable to do you have on screen right now, if you look at the green box where it says metric suggested by providers that is a high level summary of what some of those are on a walk through each of these boxes in the moment. Also since the council meeting since the meeting of the select committee all how much is a Continuum of Care for King County in Seattle has since up to release its point-in-time count and simultaneously updated its online dashboard has an area that is able then to pull not quite in real-time, but very current data then on what is a metrics about our services in the population experiencing homelessness that was updated. I said since this committee last time to discuss this topic and that is The Orange Box that you see on your hand out and then made the data points that they have now and then we also have been receiving and end in the April 9th meeting of the Human Services accurate about Equitable development and renters rights committee was the last time that we had presented the blue box. Those are metrics that hsd regularly provide city council. Those metrics are manually pull. They didn't have an automated system making a presentation of those data points automatic or something that could be posted online in real-time, but those are metrics that we regularly receive so quickly to go through those you can see that the online dashboard that all home currently has a has four main areas first. It looks at the population of House of the Caribbean that are experiencing homelessness and being served on there's a variety of ways that that's broken down sometimes by population like veterans or youth or families, but also looking at rate than that race and ethnicity and some other metrics. The secondary of a larger look at it to that are serving again with demographic breakdowns. But also they have a Graphic that looks at where people are coming from whether it was a recent stay in a shelter if they had recently been experiencing homelessness. It's our first time and where they exit to Sofia's permanent housing or we lost track of them or they exited back into homelessness main categories. I put it of what is presented by our home is individual performance. If you went to their the all home website, you could actually go to his screen that has every single one of our for example shelter providers. You could hover over that box. I need to see a variety of metrics posted for that individual provider according to the type of intervention it is and that's what's listed. There is the type of metrics that are reported for each provider. They've added or metrics that are specific to Rapid rehousing when you go to their page that looks exactly rapid rehousing there certain metrics that are unique to that intervention that we're really focused on that. They also have online maintain As I mentioned the blue box, which I know this council is very familiar with because they get presented on a regular basis. Our presentation is that hsd freak regularly comes and provides to us and it's dated this provided that includes our exits are permanent housing by program types of permanent Supportive Housing or references to a shelter things like that. The number of households that are served where does individual to go to and then also some race and ethnicity Kohl's the last from date of the we had received on that look at the totality of 2018, and I know there's some discussions to get the first quarter or second quarter updates from hsd for 2019. And then as I mentioned there were a variety of places that provider's when we last met highlighted additional metrics that they would suggest me included such as considering the vulnerability of clients that are served perhaps not as a public-facing dashboard, but at least looking at the type of performance that they are required to me. So if you have a program that's really serving the hardest to serve recognizing that looking at the type of day at the services that a person experiencing homelessness. Ask for an option. We are responding to that focusing on mental health and substance abuse Services, which we know are very important to almond responding to the needs of this population of metrics. I only put two in the box is here but on progress towards housing, so I'm not just a placement in a permanent housing but also perhaps retention and a substance abuse treatment program or returning to family reunification something like that. And then of course some way of accounting for when there are limited number of beds that have almond shelters and hence shelters and Tiny House Villages that might have been impacted the ability to place someone into An intervention like that as it's a high-level overview and I'll defer the accounts for any questions or clarifications you might have. Thank you. Council member baksha. Thank you for your good work on this. Thank you to our human services department. I know this is been something you've been working on into her police are who are helping us as well. I want to recognize something that we have underway and that is our health one project which is our low-acuity work with our First Responders. And one of the things that I've heard from them multiple times is that as we're working with our crisis connections that they need extra beds than any places where they can refer folks weather that's in a alternatives to Harborview. So whether it is Elmore 24/7 shelter, whether it's the tiny homes or whether it's a mental health bed this needs to be coordinated. So I just want to underscore as we're doing this and working on the performance data on what is happening that we also in real-time need to make sure that we Got spaces for people and for First Responders to take those people other than Harborview Hospital. So this is looking both to the past and looking to the Future and I just hope that we can recognize how important this is. other comments from Council colleagues Thank you. I'm it would help me to understand the purpose of our efforts to collectively have a discussion around performance data on homelessness appreciate knowing that there have been some suggestions by providers. But what is the what is the path forward to to update the performance data on homelessness? When is committee last met and also in subsequent email conversations? We were told that there were two simultaneous Pathways going on one was work with the mayor's Innovation advisory Council to find a way to take data that is in hm is that we don't have a good automated way to pull that data out and put it into something that can be visualized and displayed and then also highlighted that time was that were the updates that all home would be making to its dashboard both of those with the ultimate goal of making a transparent to the public. What work are programs are doing the places that programmers are succeeding and are showing there at their effectiveness and continuing to improve and then also conveying the the scale of the problem in the scale of a solution that were implementing. These are changes for all home to make to its dashboard. Is that correct? What was presented at the time were discussions actually that were being undertaken by the executive so hsd or the mayor's office working with a group of advisors that can help to assist with some of those technical back of the house. So to speak Innovations, so you could take what is currently a little more difficult access or hmis data system that we actually have to manually pull a lot of that data at 4. For example, that information that's in the blue box has to be manually pull then compiled and verified and then put it into some kind of an automated online easier to maintain formats and that's the work that is underway that. I believe it continues and it's been delayed at this point. So I think the ability to update this the information that is provided the council that the public sees that's a laudable exercise and it's and it's necessary to improve transparency. But I think as it relates specifically to performance-based Contracting we have we also have a conversation that we need to have about what outcomes we want agencies to report on because there's a lot of concern that there that the focus on efforts to provide housing don't consider a few things like for instance multiple organizations will have an interaction with a client on that that individuals road to stability and as I understand only the last organization who touches that client actually gets the credit if you will For the outcome, so that that's a concern there's a concern also that the the the approach that were that we're focusing only and I'm not suggesting that we shouldn't have is Malcolm X's to housing but it if if we are not looking at the fact that the bar poppy report recommended that we should be serving. We should be focusing our efforts on serving the most difficult to house that there may be a inadvertent perverse incentives on the part of providers to assist the easiest to house in order for those outcomes. And so we also need outcomes designed to incentivize the behavior or the behavior the outcomes for organizations serving our highest priority populations, which are those populations that are hardest to surf. Absolutely. I do want to highlight that sure they were going to have a presentation updating on the regional governance discussions and part of that conversation took over for the mayor's office will be talking about the regional action plan. Am I understanding of that Regional action plan is in many of the what you just highlighted. It will be disgusted that a specific goal with the outline with specific metrics behind it and how we get to those places and it might not necessarily say placement in permanent housing for a program that has a different goal that contributes to that passed from in a housing for an individual on Gonzales. Thank you. Thank you coach at one point. I had was someone in line with what comes from her Bowl was saying that the metrics. I guess one can say all the metrics are not made equal in the sense that it's a somebody if if if our program that working in such a way that there are individuals who are experiencing either chronic homelessness or experiencing repeated bouts of homelessness because the system is keeping them in specific ways. Then that those need those metrics are more complex. They're not simply did you help somebody get into apartment housing and I agree with a concerned that the police are not being caught in our study of metrics along similar lines. The one concern Ave. Haddon Ave in a doctor about it before is that the that the human services department really does not present any meaningful metrics related to the sweeps and about the multiple times about you know, how are you measuring your work on exits Department of Housing and the answer we've often heard in Council. Is that while. I mean, they don't call it sweeps week. Because I think they are sweeps. But the point being that the work of the navigation team cannot be those metrics don't apply because we don't actually done them to her apartment housing be done them towards other options, but the point I think that should not be lost as if this is something that the city is spending millions of dollars on then we do need a way of measuring its Effectiveness because so far all we know is that actually not working and so if there's a way as we look at performance really think it's a good idea and so does have to have this love, you know overview of where the dead are coming from who's proposing the Metro Center on I think As long as it sweeps continue, we do need to insist on some meaningful metrics so that those dollars that are used and I are actually in service of the people who need them. Great plan, I will also highlight that. One of our agenda items today is to discuss the expansion of the navigation team. We recently had at the meeting of the civil rights movement and arts committee a presentation on the latest metrics related to the navigation team are differ from that all of our other programs. There's not a discussion of places apartment housing. How did you report on referrals to shelter will be discussing the navigation team leader at this committee meeting as well as the additional have to use that. I've been hired to support that team. You're just a quick follow-up thank-you. Gojara. I must get a appreciate that they will be there. My concern is at least when I saw what they had submitted to the committee is the same presentation the dead submitted in a previous select committee. And I and I feel like they're not answering the questions. The council has asked them. So something to be followed up on thank you. Thank you, cuz you're a customer Gonzalez. Thank you chair. So really quickly. I just I'm not sure I heard you just say this, but I want to go back and apologize if I'm making you repeat yourself, but I want to make sure that I understand the chart and and what we're trying to communicate with this chart. So in the Redbox is what all home King County system does to publicly share information about the work. County has been doing in the space of addressing the experience of homelessness. Is that accurate? It includes Seattle then because we would have all of our Seattle Investments that are than entering data into hmis would also be part of what all has capturing right, but that's that this online dashboard that is reflected on this chart with in the red box. And I apologize for all our friends who might be color blind can't see red, but it's the box that says all homes on my dashboard the I just want to make sure that that system and that dashboard production is owned by King County not by hsd or the city of Seattle the correct. Okay. So then we move to the right side of this page. We see the blue chart on top. Which is title data provided the council by hsd and then we have the green box that says metrics adjusted by providers as it relates to the the blue box. What I'm understanding is it this is data that hsd provides to the city council but doesn't necessarily represent it in the form of a dashboard similar to what we see on all homes website or than materials. That's also correct. These are presentations that are by the data is pulled manually and put together as a presentation for a counselor that Committee of the council and those are the metrics that are in that is not put on line is not updated in real-time. There's no web page that you can land on and look at that. So so he is policymakers sitting up here in our staff including Council Central staff get sort of this Rich data, but it's up to us to figure out how to translate it and it's up. Ask to figure out how to or if we communicate it in a particular way to the general public and taxpayers is that accurate? The presentations are in committee. So there is a presentation by HST, but it is receiving the data in the updates. There's not any way it says I'll be up to the council to give me to get the further. Okay Gaston by providers is that is the are the various data points or suggestions that are listed in that box in the lower right hand corner is that captured in the data and reported in any way in the data that we see listed either in all homes online dashboard box or in the data provided the council by hsd box. Are some metrics minutes though kind of the purpose of what I put together here is to highlight some of the areas where there's not overlap for the council members spiders. Those are literally just suggestions. We are not capturing that information anywhere currently either us or all home. Not that's not a hundred percent true for nipple. The vulnerability score of the client service would be captured. I'm not aware of any location where that's currently presented or made public date on Services requested. There. Are you could say that there's some places where we capture it for example, and I was sent to the council regarding the navigation team on a quarterly basis does talk about types of services requested in and engaging with clients in the kind of Outreach that they will accept but generally speaking. These are metrics that are not being captured for all program system-wide or presented in a uniform and consistent way to the public think that what I what I was struggling with is trying to figure out what we were comparing cuz I wanted to make sure that we were comparing Apples to Apples. So it sounds like what this This chart is it is intended to communicate is that it appears that all home King County has a more transparent more consistent standardized way publicly sharing data related to Performance of Investments that the county has made it in the space of homelessness as opposed to the city who has some of those components but not all of those components and we appear to be reporting inconsistently correct. The county of bones are management of the HMS Data Systems. So many ways, they are the possessors of the database and hsd collaborates with the county to get that data. Okay, and that leads the last in line of questioning or point. I wanted to make it which which is helpful for me to get a better understanding and framing of what What were the what were seen in evaluating in this single page presentation in that syrup helps frame for me some of the comments that council member Herbalife was making a few moments ago. And I think that her points are valid in terms of one of the purposes or a purpose of the work that we're trying to do here is is not just counting the widgets but really getting a clear understanding of why we are creating performance measurements and that doing the exercise of creating performance measurement is critical to accurately reflect are expected outcomes that are evidence-based and a line with strategies that we have supported in the past that are shown to end the experience of homelessness for individuals. And I think that's what I was hearing council member herbold articulate is that there are lots of different purposes that we can use God of war and there's a lot of different purposes that we can come up with performance data and metrics for but one of those things has to always be centered and how are we developing performance measurements that will again accurately reflect our expectations of outcomes that are evidence-based and aligned with strategies that we know will help to end some experience with homelessness or and make it a short experience to the extent that it is an experience and I agree with that. But I also agree that the additional purpose to that which I think is exemplified by this chart is that I have been and I think members on this Council have been and certainly the public has been very frustrated. With what I would consider to be inaccurate reporting by the executive nhsd of what we've already done in the space of Investments of of human of homelessness services. And so we have had most recently in the last 2 years multiple examples that we can point to that either overstate or understate what are outcomes have actually been in the space of our investments of homelessness. And so I see this as also an attempt to really get on the same page as it relates to what data is being reported out to the general public. So it's it's not a moving away completely but it's making sure that if we are going to continue to count with its that that is being done in a consistent standardized way so that we can trust and have confidence in the data and information. It is being provided to us in the blue box when we do see it so that we have a high level of confidence as policymakers at that information is accurate because we have all had experience up on this diet of it not being accurate and the Ripple waves in the Lac and the end of mistrust that engenders in the work that the city is doing in the space has been incredibly detrimental to our ongoing efforts to be serious about addressing this crisis around homelessness. And so I just want to make sure that my understanding of sort of how I thread the needle there on that last point is is an accurate intent of the co-chairs and the council and and is supported by Council Central staff analysis of what we see on this chart. Thank you, summer Gonzalez. I want to underscore my appreciation for your comments and all the council colleagues who spoken on this this is precisely why we've been asking for 8 months for a dashboard to be provided to this Council. We have seen robust data presented in multiple forms throughout the budget process and I would argue about last spring and summer as well as we talked about the need for additional Investments and making sure that those Investments were going to the evidence-based proven practices that we know to be successful because they've been generated and led by Our Community Partners. I want to thank you for articulating that a point again and underscoring. I think the full Council of interest in this concept of a dashboard. I'm also going to hand out some of the early preliminary thinking that we have shared with the executive that summarizes some of these points and in slightly different way. I'm what you can see here is information that we know to be already available such as exits to permanent housing length of stay in shelters potential returns to homelessness entries from homelessness utilisation. But then we also talked about the ways in which we can better capture some of the ways in which were serving those who are experiencing homelessness looking at. The number on average is something that I brought up repeatedly versus the number of mats on the floor that are open on an average night. The number of people who've been moved from unsanctioned encampments is really important for us to understand and where they've been moved to every time we hear about asleep or we hear about people being moved out of unsanctioned enchantments. The biggest question I have is how many of those people got access to enhance shelter because they're more likely to enhance shelter than if we were offering them a mass on the ground other items that we've talked about our in those last two categories these come directly from the Human Service Providers, you know, for example, we talked a lot about the little cutie visits how many folks are getting a needing access to mental health treatment and maybe even just wound treatment would be interesting to see if we can capture that information again, I mentioned at the very beginning Stays on the ability to stay on your medical care or to stay with your case managers came directly from the sum of the providers the ability for kids to stay in the same school to create a consistency. I have been critical and been raised by some of the providers as well. These are just some examples but I think what you've heard from us and I'm going to look at our friends from the executive's office what you're hearing from. The whole council is a desire to see this robust dashboard provided so that we're not in the impossible position of trying to Cobble together the very important data points that we do see from the various reports that have come forward either the reports during budget the report small home the reports on the quarterly updates on from the navigation team and just general hsd data are critical for us to have in hand and ideally in one place. And the last thing I'll say on this is as we look to create a regional governance structure for serving those who are experiencing homelessness and preventing people from falling into homelessness this type of Baseline data. It's really important. We will have a conversation later about what that Regional structure looks like. But I think it's imperative for us as policymakers those who have the responsibility of holding the purse strings for at least a portion of large portion of what will come forward to know where we're at and then to be able to measure where we've gone and where we need to continue to invest in. This is about good governance and transparency and being physically wise with our dollars as we sent her those who experience homelessness and how we're evaluating our successes and not to be punitive to any of the provider's but to really lift up the work that the providers have done. So we're making sure that the investment goes to the right places and we have two other items on our agenda. See, no other comments on this issue. I'm going to go ahead and say thank you Jeff for presenting us with that spreadsheet. I think the message has been heard loud and clear that we would like to continue to work on a robust set of data and metrics so that we can evaluate how we're doing in one place, especially as we move forward with our regional governance efforts and funny say thank you so much for reading into the agenda item number two. In the item number to navigation team expansion update for beef and discussion and Department of parks and rec. I haven't heard from the Seattle Police Department has Kobe from the mayor's office Jason Johnson from hsd Justin's from Central staff. Thanks for hanging out here with us. Still. I'm Coca-Cola Brian came in very early and I didn't get a chance to know you for the record. Thank you for being here as well. This is an item that has to attack monsters background on the expansion of the navigation team member provided by Central staff Justin. Thank you Jeff for providing that memo for us and human services department presentation date of June 2019 by hsd. I don't think we're going to go through all of the details of the PowerPoint presentation again, but I do think that folks were going to highlight some keep him. If I'm not mistaken before we get in and then I have some opening comments. Casco Bay mayor's office Jeff Sam's Council Central Staff office Jason Johnson Human Services Department navigation team So why don't we go ahead and let you jump into your presentation and I'll save some comments for later. I know we are on a short timeline today and really want to get through all of these items. Did you taking us off your sugar be happy to offer some initial comments? Very pleased to be here today to discuss the navi navigation seems work and the capacity increase that we've laid out this year. The team of course has reported previously to the to the committee and this is an opportunity to discuss the team's ongoing work to the full committee. And we had thank you for inviting us to do that. It is no understatement to say that the navigation team saves lives the people who make up the navigation team come to work every day to do some of the hardest things the city asked City staff to do the approach to work with compassion patience and care for the people. They are trying to help I've seen this personally as I've gone out with a navigation and as I've gone to Villages and and shelters, I guess the most start example of that was during the snowstorm when the navigation teams literally work 24 hours a day to bring people in to temporary shelters that we set up and the feedback we got from some of the people who were brought in by the navigation team to those temporary shelters is they didn't know if they would have made it and so Team saves lives since they took off as she is made Investments that allow the team to add critically needed staff and resources which will be previewing reviewing with you today many departments including the Human Services Department of Public Utilities Park and Recreation Police Department contribute to this body of today's presentations highlights these increased efforts which work in concert to both the unsheltered and the sheltered Community. I'd like to know Jason Johnson to provide background information. But thank you for the navigation team's mission is twofold Outreach connecting people to services and shelter and removing encampments that post public health and safety risk. The team has made thousands of contacts out and out in the field building up a list that helps us match people to resources and shelter hundreds of enchantments have been removed from public property addressing very real public health and safety concerns. I want to acknowledge that many of the members of the navigation team are in the chamber today. I just want to personally think that team for their efforts for getting out everyday and engaging in a way that is not just compassionate but is resource minded and helps make those connections for folks that are living outdoors. I really appreciate their work and honor their work and thank you for being here. today when the team started in 2017, it was about 22 people out of 22 individuals represented multiple departments as well as Evergreen Treatment Services. They were field coordinator police officers operation manager's contracted Outreach workers. In 2018 thanks to Investments made by the mayor and Council the team added support functions and increased capacity through data analysis administrative support additional field coordinators and in 2019 the addition of system Navigators, which I'll discuss a little in in in more detail a little later. So this is q1 data. We have presented this information at a previous committee, but I think it's important to highlight what the overall navigation team data. Looks like we'll have data to coming soon and expect a present that back to Council in the coming weeks or months. The individuals engaged are unique people team members talk to and interact with contacts are number of conversations that have occurred think of that is the volume of work that's being made in the field individual people can be contacted multiple times or just once Referrals to shelter are duplicated these referrals to shelter represent 203 Unique Individuals. The team has been focused on obstruction or Hazard removals in quarter one to ensure that sidewalks and public spaces are safe and opened everyone 72-hour cleanups have been focused toward larger more complex removals like the trolls Knoll. Referral to shelter information we've included a breakdown of shelter referrals and in q1 report and will do so again and cute to enhance shelter and Tiny House Villages Remain the most attractive shelter resource for people living unsheltered and there are on average 17 beds available to the navigation team Everyday Number the last time we checked in on this and I double checked out on that two weeks ago was that for last month's data there was 5 enhanced shelter beds open and one tiny house Village that open all night for average. Where are we now getting the 17-member? And again, this is part of our desire to make sure that we're reporting consistently the last time I had the chance the opportunity to share this committee. I asked that question as well and at the time at the table, the number was given 40 and then we learned in retrospect that it was actually that 6 number. So where is 17 coming from at this point? 17 is the total is the average of beds available on any given day when the navigation team is deployed to Sara Lee. Okay. Thank you for that clarification. That's very helpful. All right with new Investments the navigation team was able to increase its capacity to further its mission system. Navigators are new to this body of work. These are in-house Outreach workers and they are available at all of the cleanups which include the hazard an obstruction work and they are available to offer services to individuals living Outdoors. They're also available on weekends to connect with people and also are helping Seattle public utility with their RV work. This is an overall increase in the team's Outreach capacity and Fries up reach from Evergreen Treatment Services to conduct Outreach in advance at more locations. We've also added more field coordinators which allows the team to take on more specific concern such as removals and litter pickups, which helped make Seattle cleaner and safer while leaving encampments in place. There is also improve coordination with the Seattle Police Department. This means when Community Police teams and bike Patrol offers come across someone who is in need of help. There's more overlap with a navigation team. This includes connecting people with Services storage of belongings referrals to shelter and cleaning up obstructions. Also just ate that weekend coverage is now possible due to this expansion thanks to all of these working efforts working in concert together at the team can make referrals to shelter on weekends, which is a new element to the Outreach team. The team can also clean up garbage and removing cabinets on weekend. So this is a expansion over the five-day weekday services that were in place before thank you believe it's the one previous to it on the data slide on the first quarter 2019 report. So I just want to highlight that for referrals. I'm in contacts this first quarter 2019 report shows. Significantly fewer referrals to shelter. We have 222 referrals to shelter for the first quarter 2019. Whereas the first part of let's see last year. We are looking at 432 referrals to shelter. I'm sorry. No, that's a comparison of this last quarter to the previous quarter and that's actually half the number of referrals Shelter From the first part of last year simerly numbers of contacts. We have 244 contacts for August 2018 to March 2019. It was about 1800 contacts now, it's 1564 contacts and some are way it's less than half the number reported quarterly in 2018, which was more about 3,500 contacts per quarter simulator. And we mentioned earlier the number of removals who actually received 72 hours notice and that ongoing engagement of Outreach has decreased and I don't know if there's a relationship there between the Rams and the increase in obstruction removals that don't require Outreach and this pretty significant reduction in numbers of contacts and referrals it has been said we had we had a briefing on these numbers in in my committee folks pointed to the fact that this is. Of time when the storm occurred but from my understanding of what was happening during this storm, there was more engagement and people were working 24/7. I'm trying to reach people during that time and trying to make referrals to shelter. So I am I am concerned that Despite the fact that we have consistently responded to the marriage request to expand the navigation team. The numbers of people who are being engaged referrals to shelter seem to be shrinking in size. Cummins yeah, I went to maybe go to the next slide where we talked about the expansion efforts and the numbers for the month of June so that you'll see that the Schaffen improvements have been added since fall of last year, but with the addition of the system Navigators this navigation team is operating at a higher capacity across the board. So I'll specifically pointed the data that's on screen. You'll see that garbage and waste debris is up. Roughly Thirty tons, when compared to monthly average site inspections used to do 25 a month on average in June. There were a hundred and sixty-five that were conducted the 72-hour removals doubled in June when compared to monthly averages obstructions and Hazards are up litter pickups are up as well with the team doing more litter Puck of pickups in June then the rest of the year combined. Are reducing hazards in encampment sand in surrounding community. So I think this either we've only had the expansion in place for 1 month during the month of June. I want to come back and show, you know, full Q2 data, but I think that what we're seeing in June with the full team operating the way we ate we intend we're seeing a much larger increase in production and keeping space is clean, but also and being able to engage the fox interim director Johnson. Thank you for this presentation. I want to go back to the question that councilmember herbel Das though and this is again precisely why I think a dashboard that looks month to month is important. Thank you for the indicators. You've included on this last slide, but when we say navigation team, the intent is to navigate them somewhere ideally in to enhance shelter and what we don't have On this sheet here we don't have in this table is where they've been navigated to I see the bullet points above that says that there is 20 total referrals to shelter again the type of shelter that were talking about whether that's enhancer mount on the floor is important to know and the 22% referral rate is an indicator, but we don't have anything to compare it to look at the 222 referrals to shelter that councilmember herbold commented back on for the quarter one 2019 report that's an indicator. But then again there's nothing to compare that to so ideally what we would have in this chart and I believe based on the other day that you provided it would be possible to pull but it would be helpful to see what those numbers look like month after month where those individuals have been referred to whether it's man on the ground or enhance shelter and how those numbers compare month-over-month anecdotally. I've heard the same thing that Deputy Mayor Mosley commented on. We saw an increase in the number of people referred to shelters. Ideally be helpful to know again what type of shelters but you would expect to see that increase in the month. I believe of February that helps us understand where were serving folks. How were serving them and where they're being navigated to sew in this navigation team operation. Can you comment on where people are being navigated to and specifically to the question that can remember crippled ass. Are we seeing a decrease in the type of navigation to shelters that are coming from referrals from the navigation team customer her load that I capture your question correctly? Yeah, so we met just last week and to look at the data and it seems like most of the engagement folks are complying. Meaning they are are are moving their selves and their belongings out of the right away and are not necessarily engaging on Services conversation with the system Navigators. So for the most part when the navigation team is called to an obstruction or Hazard. Most of the folks are complying right then and there and are not engaging in discussion about services that said we were prepared to have those engagements. We want to enter into that dialogue and the navigation team is prepared to I offer up a wide array of services but not everyone is interested in having that discussion. Calling I'm just concerned that we've hired system Navigators and that navigation isn't isn't occurring in those in those particular types of obstruction removals. And and that these are folks that we have focused to help people in those instances and because of the nature of that that interaction is not happening. Agreed this is the point in time where we have the chance to interact with folks. Will you I think anticipated that the entire team would be involved in those conversations and a council member Swan and I believe we're reaching for the microphones if anybody else and then perhaps you can comments on that just very quickly. I just to reiterate the points already made by other council members that we're really not seeing the kind of data. We need to see and also it's not it's simply not good enough to say that the city is going to spend millions of dollars on a program that nobody can quantify the results off and that the best you can say at least as far as what you're saying right now is that the people the homeless community members complied with the navigation teams instructions to not be in the obstruction areas which in a credit to them even though they're facing such a brutal experience there. They are, you know participating in that requirement, but that's the claim of the navigation team is I mean the so much money is being spent on the navigation team not to get Human beings away from business obstructions or other obstructions. It's the claim is being made that it's helping people and I don't with all due respect everything they are mostly I don't think you can use what the navigation team to do in Distortion snow storms, which is absolutely critical, you know, bringing people into shelter during that time, but I don't think you can use that to then make generalize claims about the effectiveness of the navigation team. It's about what is happening over all year after year and it's just, you know, I reached a point where there's presentation of representation in both my committee and a select committee and also being at all these committees and we're not we're simply not seeing the results and I just feel like numbers are being spawned different ways. And and I and I'm not alone. I see a lot of people not in here. We've had a lot of feedback from could you do memes through letters and phone calls that They just don't see what the navigation team is accomplishing. I'm going to ask him to Mayra Gonzalez to make her, and then I believe I may be helpful to hear response at all. Three of those comments come through Miguel Sure actually don't have a comment. I have some questions if you want them to answer these questions first. I will commit my question my line of questioning to memory and circle back after they've had an opportunity to answer these specific questions or feedback from the comments that comes from her bowl of myself and have made just in terms of how we are actually helping to serve Folks at the point in time which were asking them to move out of the right away having bites in repeatedly over the last few weeks and seeing individual sleeping by the railroad tracks down in SoDo. I know how important it is for people to both get out of the right away for their safety as well as the safety of the public. So I guess we agree that that's an important component, but as we're serving Well as we're meeting people in their current place, are we serving them with getting them actually into the care that we promised through this team. Let me just say one thing and then I'd like to call on SPD in parks to talk about what they've been doing with the instruction the first of all our Mantra and our training while our bike and Community officers has been perfectly fine for you to stay here your equipment that is obstructing the public right-of-way can't That stuff that has been our absolute approach all the way through to public right away. You can stay here as long as you'd like your tent that is obstructing a wheelchair. Like my neighbor can't stay here. And secondly, I would just say that the officers that the bike Patrol and Community police officers that have been engaged in this always have when they are able to have a specific engagement with a person and offered services and the system Navigators are always available to come follow up on that referral. Can I tell you, thank you. A good morning seen a picture from the Seattle Police Department. So when we were talking about a rastar rest that is that is the last resort that is not there for the first option on our rest and like the deputy mayor had just stated it was about the property and blocking the right away ask us we want to move that property. It's not about the person it's about the property. So people can use the sidewalk for its intended purpose as we're looking at and on personal observations. I've gone on many on the weekend work as well. We call for the systematic Navigators navigation team does do a deeper Outreach were centered around the unhoused are we do assertive Outreach in that case and I plan on seeing where we've actually called system Navigator every scene that I've been on. That we have called for the system navigator to assist us and they've done excellent work. Thank you very much. Did you have something else and just thought I could share a little bit about our experience since the 7-Day coverage in the system Navigators came on board as you know, in addition to supporting the 72-hour notice claims in the right-of-way work. We also remove obstructions or hazards on Parks property and that could be anything from having campers take over dugouts and play fields or restricting use of P patches. Recently. We had a great partnership with the SPD officers the system Navigators and the biokleen contractors that Lower Woodland where those picnic shelters have been taken out of use right before the busiest List It season where we also have not only family and community events. But we also a star summary for special populations summer camp there and the team came out. It was one of our first experiences with the system Navigators who already knew the campers by name. Engage with them very well and shared a lot of insight with our staff and going forward with the activity that day. So we have had a good experience with them and we have some of the hardest working staff in the parks department here if that do that small But Mighty work. So appreciate third their time and the partnership with these other agencies to get the public spaces back for public use absolutely think you are coming just some additional questions and in need of some clarification as it relates to the system Navigators and the role that they play and when they play it so if we can go to slide whatever because I don't either not numbered that one. Yes, so the first bullet point on there says to new system Navigators positions to conduct advance and day of Outreach to encampments including connections. The services and shelter is such as Tiny House Villages enhanced shelters and basic shelter. I read that correctly, right? That's what it says. All right. So I want to emphasize that my understanding of how the system Navigators work is related to doing advance and day of our reach to encampments that are going to be subject to a 72-hour notice of removal. Is that accurate? No, not always they are available to join when there's any kind of obstruction Hazard. It could be a same day. I can be a plan depends but it is it they are not restricted to only a 72-hour large clean up. So when you say that they're not restricted to a cemetery clean-up that just means that there's nothing in the law or the policy that prohibits how they are used which is to be distinguished from how they're actually used. We should we still have a contract partnership with the Reach team and still very much engaged am on our plan 72 hour or more clean up. So there is an engagement to prolong 2 days long engagement with that. The reach Outreach team is is is used as a member of that at the navigation team win. Their sites are identified the navigation system Navigators are an additional resource and often are on-site the day of a clean. But they can also be a resource to park staff or SPD or the utility staff when there is an obstruction to a public right-of-way and the individual needs to connect to services speak candy. They are okay cuz cuz you keep saying they can be or there's no restrictions on trying to get a clear answer on whether they are in fact being utilized in the method that you have described as it relates to the uptick in the number of sweeps that are being deemed as obstructions in the right-of-way and therefore not entitled to or subject to the 72-hour notice when you make those calls and when and how they respond that's not my question. I didn't ask when you make the call and asking if you in fact utilize the system Navigators in the way that you've just described as it relates to obstruction and people who have already been deemed to be in in obstruction. the right of way Yes, and that's PDM Parks make that call and they work in partnership with this system navigate her. So I was saying there in the best position to speak to it what that looks like on the ground, but I want to get to the point, you know interim director Johnson. I heard you say that in the instances and I think we need to be really careful here. There are two different categories of of us can't make cleanups that are occurring that fall under the auspices of the navigation team won are the things are are the encampments that are still subject to a 72-hour notice and those are treated on a different track. The others the other track is the track that is not subject is not subject to the 72-hour removal notice because agencies have determined under the end ours that they are an obstruction to the right-of-way and impeding the intended use of those public spaces, whether it's a park or a sidewalk whatever the case might be just I'm not engaging in a debate with you or any of you at the table about that particular component. I am just honestly trying to get an understanding of how the system Navigators are used in those to various tracks. And so I heard you say a moment ago that You haven't really needed to use system Navigators in the obstruction scenario because they're complying and or are not interested in engaging in services. Let me see if I can and so the question is directed to interim director Johnson who made the comment that because in the instances of those individuals who are deemed to be obstructions and received no notice they are complying I either voluntarily willing to move out of the space. There is no need to use system Navigators at least as it relates to in advance of the cleanup actually occurring as I just want to make sure that I understand that that is what in fact it is occurring. What is occurring is that when SPD is engaging with someone who is causing an obstruction on public right away. They immediately contact the system Navigator that's system Navigator is made available to the individual and the Navigator is engaging with that individual to see what services that individual needs. Sometimes. Those services are storage of belonging. Sometimes those services are a variety of connections to different kind of services. It's not always to shelter but the services that are offered also include shelter. So we are very much engaging with and calling on our system navigator to be the ones to have that conversation with individuals whether it's sort of Destruction hazard. Whether it's in a park on a sidewalk and we are also including an engagement with the system navigator on the day of some larger plan 72 hour claims. So walk me through the slides that you have in his presentation that communicate to me or the public the instances in the timing of when a system that Navigator is utilized in advance of the removal occurring. Yeah, so ask your question once again. So in this instance right here on that last page, which I think is what you've pulled up. It says system Navigators 91 total engagements 83 Unique Individuals. So that means a one of the 83 or sum of 83 ring gauge more than one time rates. OK unless I can point it says that there were out of those 83 Unique Individuals who receive 91 pool engagements 20/20 total referrals to shelter for 18 Unique Individuals are really only 18 individuals receive the referrals to sub form of shelter. So I am trying to understand at what point are these are these is this data in under the system Navigator's Point are those four individuals who were subjected to the 72-hour requirements removals or are these for individuals who were removed as a result of a determination that they were in an encampment that was presenting an absurd? Action consistent with and are rules. Separate them out for me. I would have to get back with you with that data, but this is inclusive of both those activities but specific to the system Navigators. Okay, so by when do you think you can get that follow-up information to me? Okay for setting aside difficulty by when do you think you can get that information to me? Probably by the end of the day great. I look forward to receiving that information. And I think I think it's really important for us to make sure that as we are receiving and publicly reporting this information that we're being really clear as to work that system Navigators are doing which of effectively replaced reach to get a really clear understanding of whether they are effectively navigating people through the system. It's important for us to understand how many of these folks are engaging in this herd of obstruction context and how many how many of these folks are being engaged and what the outcomes are as it relates to those who are in the story of 72 hours lower removal contacts. I just think that's an important that a point for us to understand. Future. Thank you very much come from Gonzales. Looking down the line for additional comments on this. The one of us, and just really quickly because interim director Jason Johnson wasn't there when we discussed this before I think it was in December hair bows committee about Rich & Sons concert in Gonzales brought that up. Just wanted to read a couple of extracts of the letter that reach road to mr. Johnson on January 16th of this year in which they say that we each have serious concerns about being the primary Outreach team embedded in the navigation team and that the work of the navigation team is often not in alignment with our programs. Meaning reaches values are generally accepted Outreach best practices, and we would like to have an Outreach contact that is more similar to the other agencies contacted by the city for Outreach Services. And then one of their concerns at the navigation team work is focused on shelter referrals many of which are not inappropriate not an appropriate fit for residents in the encampments our staff Regis. I've Been Told. How to dye shelter offers even when they're rarely accepted rather than developing longer-term alternative housing plans are also increased other that navigation team has to do is increase designation enforcement of emphasis zones obstructions and Hazard and that reached out have experienced increased mistrust from client as they see the Reach team associated with rapid and Kevin removal and more law enforcement. We do not need see a movement in navigation team operations towards more trauma-informed person-centered Outreach as well as discuss. / I just wanted to say that in in as part of our meeting proceedings today because I don't believe that the Human Services Department of the navigation team as a whole have really responded to reach has very significant concerns in any way whatsoever. And I and I really don't want them to be forgotten. We need some responses. Maybe not today, but soon what was the date on that letter just so we all have the letter was dated, January 16th 2019. Thank you very much. So I'm going to say thank you for providing this data. I want to space first. Thank you to the incredible work of the Soaps that the department of Parks and Recreation for all of their work. We know that they're there their supposed to be audience and their selves or potentially watching and please express our appreciation for their ongoing work at parks at thank you to SPD for your words did knowledge in that thing without a house is not a crime and that you really are looking for ways to help make sure people are out of the right away. I appreciate that and for underscoring, I think maybe you can clarifying that this council's I'm not interested in time hands of anybody, but also that we recognize the rights for people to be able to continue with our lives if they're not committing a crime and it is not a crime to be homeless. So thank you for under Find that point and for being here with us today. Thank you to you both and advanced. I'm a test. I feel like we left you on the end there if you had anything else to say, I know you'll be at the next presentation, but interim director at Johnson and Deputy Mayor Mosley appreciate you getting back to us on the specific data points on engagement as comes with Emma Gonzalez and others have commented on so that we can have better data on how we are connecting individuals whether they would are within the 72-hour notice or not within the 72-hour Dino notice to True systems Navigators and looking at the outcome from those interactions and also to my point earlier to providing in this last slide hear an actual example of where we are navigating folks to that would be very helpful as we look at month-over-month data and especially as we transition to our next topic, which is the regional governance effort to have to Quick question are we have seen Reports online of this sea attend report a tent posting that are occurring across the city. I do not believe that this was the intended use of the find it fix it off and I understand that this is not a poster that's been generated from the city of Seattle or the hsd department so just to reiterate and clarify for the record the city is it correct that the city is not paying for the use and printing of those he attend report 1/10 posting. This is not an hsg document. This is not a city initiative. This is not the intent of the find it fix it app. And when someone does use the app and it's inappropriate way, what is our response to people who've tried to use the app in this inappropriate way? Is it is it being captured in some way? And are we doing anything with that data the find it fix it app is FAS is function, but you can use the find it fix it app to report all sorts of things from pothole to litter. But also if they're you know is a someone that you're concerned with who is sleeping Outdoors. It is also a way to get that on the navigation teams radar. So it was through the find it fix it app that we can be alerted to someone who's in distress and needs a connection to Services the medical unit that comes on. I talked a lot about it folks who might actually need medical services. It doesn't this does not feel like an appropriate use of the app. And is there a better? For us to actually is a city not use the app in this an appropriate way. Yeah, anyone in medical knee with medical needs should call nine-one-one not to 311 and find it fix it app is is not for medical emergencies emergencies in for emergencies people should call 911 us outside of that. I just don't think it's appropriate for the study to formally or informally sanctioned members of the public to call Define effects are used to find it fix it app to report homeless community members that's just not appropriate because that it contains the implication that homeless people are the problem and then that needs to be fixed and I think that this I think what needs to happen is the human services department of the mayor's office executive have to find a way to let it be known to the public that that is not how we look at homeless people that's on the city's point of view and The end dude that there's another way that people can let the city know. Thank you for clarifying that that is not how the city intended to use the find it fix it app that this is not City generated posters and then we don't condone the use of the find it fix it up in this way and maybe we can follow up with you prior to the next meeting or not. But before the end of the day on how we are doing a better job of informing focus of the rights that you just talked about appreciate again you underscoring the difference between obstruction and trying to find a place for folks to live safely and look forward to working with you on the multiple data requests. We talked about this morning. Thank you so much. And I think we're going to transition to item number three if that sounds good. Okay, great. Go ahead 40 that item three original homelessness governance governance update for roofing in discussion. Presentation today Tesco before saying at the table from Tracy Radcliffe and thank you again for staying until Dark Tower Johnson. I don't think we need to do a Fishel introductions that I just set your set your name today. We have included in this agenda item a central staff memo. Perhaps we could get the memo online just for folks who want to see it in the audience select committee proposed timeline the proposed to regroup of functions that would stay here at the city or potentially be moved to a regional Authority and the regional action plan overview that test is going to provide for us. Do you want me to see if you open them before turning it over to you? I'm looking at you test. Is that okay with you? I just want to say thank you to make sure that we all feel comfortable with the both the proposed timeline and the conversation as it's evolved so far and 1 underscore that no decisions have been made as as we've engaged with conversations with r Hollingsworth the King County Council and archon colleagues up sound cities who are leaders elected leaders in various other cities in the county of underscored repeatedly that no final decisions have been made yet about the creation of a regional governance committee. And as we've been meeting there was just one meeting last month with some of our colleagues both from King County and the Sound City Hall underscore that we all need to feel comfortable with moving forward as a collective body. So want to make sure people hear about today from both the presiding share of this select committee and as an individual who's been participating on what we call the quote client group recognizing there's no actual individuals who experience homelessness on that client group. The client group is actually us is Council colleagues, and there's a similarly name group King County Council who has County colleagues on that group to get informed on the various conversations that are occurring between the two executive bodies and with the various researcher. Is an entities who've been evaluating the possibility of creating a regional governance group similar to what we've seen in Los Angeles similar to what we've seen in the county that includes Portland multi-county apologize to her friends Morgan. So appreciate their presentation here today and test for run through with us, the various elements that are in motion. It's been challenging I think to identify on paper a document that incorporates all of the moving parts and appreciate your continued work with us to try to make sure that we can visually see how this is all going to come together. But there is a real commitment here. I believe from our Council and the colonies that we've talked to you in King County. No one wants to move the deck chairs around we want to see true transformational change and reductions and duplication streamlining service and most importantly that we get those indicators, right? We will know we are successful when we continue to If you were people who are sleeping homeless and not because we swept them out of sight not because we sweat poverty out of sight, but we've truly created shelters and hand shelters and housing for both. So that is our indicators of success, and I look forward to hearing from you. Terrific, thank you very much for that introduction. That was very helpful. So indeed my presentation this morning is about giving you a sense of the work that we've been done doing today 8 and more importantly the work that we have ahead of us. So chair Muscat I mentioned we have a client group that has been reading that has been meeting frequently and back to the clan group has been kind enough to agree to meet slightly more frequently as we go into. What is really the the last Sprint to get to Regional governance. Let me let me start by talking about the work that we're doing about actually standing up the new Regional Authority in order to do that and I've mentioned this a prior meetings. We need to Louise at the city and the county need to enter into an interlocal agreement. And in addition to that the county will be passing a charter that actual Does the legal work of standing up the entity our Law Department is working with Pacifica Law Group because they have substantial experience in setting up these kinds of entities probably development authorities and in doing that they are working first on the documents of drafting the document specifically the interlocal agreement. But also the charter I will say that the key aspects of the interlocal agreement will be an agreement with the county regarding the board structure and that really includes the board structure and includes the kind of experience and representation that they will bring to the board that governing board will if you think of a nonprofit that governing board will be in the same vein as a board of directors for a non-profit, although the PDA is not a number. In terms of providing a policy guidance in fiduciary responsibility for the entity moving forward. The other thing that we're looking at is an advisory committee structure that would ensure that there's a broad array of voices experience and perspectives that are represented in the overall governance structure. The Ila has some specific information that it will contain. The one of them is the Baseline number of ftes or Personnel that the both the county and the city will transition to the Azure Authority and that bass line is likely to be based on a minimum number of people that are needed to staff basic Administration functions such as HR and I T, but also to manage the contracts that will be transferred. To that end in terms of the the contract that will be transferred and the administrative functions. The Ila will also know the budget that the county and the city will be committing to it. And again the the initial commitment from both the county and the city really is again for sort of Baseline administrative functions and the contracted programs as are currently currently considered to be transferred and I'll be talking about that in a second. And then finally these documents will identify where the authority will actually be located and what it'll take the stand it up. So in preparation for providing this very specific information hsd and the mayor's office has been working with h Are HR department supposed to the city's HR department, but also hsd's HR staff as well as labor to develop Communications plans for HSI staff and a transition plan to move Personnel to the new Authority. We expect to have that completed or in a in a final the plan itself in a final format towards the latter part of August critical component of doing this work is developing a new job descriptions and a basic skeleton of what the authorities organizational chart will look like. So as part of their scope of work and is the national Innovation Services is preparing the first drafts of these for consideration. Once we have job classifications, there will be a crosswalk between current between our current hsd job descriptions and the new ones that are considered and that's really important work in terms of figuring out what the crossover will look like between those and existing job descriptions. Those new ones in the existing HS on the subject of contracts and programs HST in the county have come to an agreement about the programs that they think should be transitioned over to the new Authority and I believe you have a copy of a memo that's dated July 11th that actually shows you individually all of the programs that are considered are under consideration for transferring over the short answer to that question is basically all of the All of the crisis response programs will be transferred over with the exception of will so the crisis response programs will be transferred over including everything from prevention to support services related to permanent Supportive Housing the main programs. That won't be transferred transferred are what are considered Upstream prevention programs that are in essence anti-poverty programs food banks. For example are a good example of those kinds of Upstream anti-poverty type programs. We we also are not considering sending over the navigation team. However, the Outreach function of that. We are thinking about putting in the new Authority and that's really because as was discussed today the Outreach in advance. Of doing any kind of navigation work is extremely important and we feel like that should be part of an overall Continuum of Outreach Services, which would actually be one of the responsibilities of the new authority to ensure that there is good good coordination among all of our Outreach contractors has their distress with than any questions. Okay. I have a few questions about that that I will be following up with you on specific specifically as it relates to what would the role of a navigation team be with a potential joint government structure is intending to consolidate our services for those who are experiencing homelessness and preventing homelessness. It seems like there is a direct Nexus there. I'm so I think this is the first time I'm hearing that Interim director Johnson jump in should I need assistance with that? So we understand the navigation team to be critical is for in terms of the city's response to addressing homelessness and specifically helping folks who are living outside get access to shelter another source other resources as has been described before you today. The navigation team is a program that's unique to the city of Seattle Seattle. We are not aware of other jurisdictions that are interested in that that have the resources for that interested in the same approach that we are taking. So that's one of the reasons that we feel like it's important for the city to continue to run that program additional leave us the navigation team involves. Interdepartmental team, and as a result of that we really feel that it is appropriate to keep it within the city infrastructure. Okay, thank you. If we have other questions on that will follow up with you and offer one reframe, I think that at the beginning you said by the executives have come to agreement on what will be transferred is it accurate to say come to agreement on what would be proposed to the council's on? What would be absolutely certain so they are making a recommendation this the chart that's on the screen in front of you is part of that recommendation. And in order to get to this recommendation County staff and City staff needed to work together. So the other piece of this work that has been discussed before this committee previously is the regional action plan and I just want to remind us all sort of what the regional action plan is. And in fact prior to this particular presentation today share mosqueta, very appropriately noted that the regional action plan one of its most important functions will be in establishing region-wide performance metrics and then being accountable to the achievement of those metrics. So the plan is being developed by a nonprofit named CSH and they are in advance of preparing this document and providing a draft to us doing extensive Outreach to stakeholders across the county this is original plan as the name implies that is addressing homelessness region-wide so csha really made a big effort to make sure that part of the Outreach is with providers and organization and government staff and the sound cities Association to reach really all perspectives, the regional action plan will be a community plan. So it won't while it will be informing with the regional action or skis me the regional governance does it is not the sole jurisdiction of that us. Already, it's intended to provide action-oriented Solutions and really taking into consideration the information that they've games through the community engagement process through data analysis, and also looking at the 10 goals that were brought to us last year early this year from the NIS report that they did last year. It will lay out metrics and Milestones and and a methodology to track those it will note who is accountable whether that is an agency a provider or in some cases individuals that are accountable for meeting those metrics and meeting those specific established goals. It will provide recommendations on sequencing of the achievement of those goals and I'll talk about that in a second as well. It's doing so CSH is working internally to do a lot of cost estimates. So obviously a plan that doesn't have a company budgets and cost estimates really doesn't get us very far down the road. And so those project costs projected cost for interventions will really service and underpinning for the budgets that the He will seek their budget Authority. They will seek from the city and the county and any other jurisdiction that becomes a member of or a part of the regional entity point. I think everybody is interested in success. There's no question in our minds that providing services and having more housing is really the goals to the goals that were trying to achieve. How do we have some confidence that no matter how much money we budget we're actually going to be able to move forward to accomplish these goals if that's an excellent question. I think the intent of the regional action plan is really to provide us with short-term medium-term and long-term goals and them the actual steps in order to take that into it to meet those goals. The first thing that the authority will be asked to do is essentially create a strategic plan. Of its own and an annual work plans that will be informed by and be an alignment with the regional action plan. So that those early goals will be about establishing plans and procedures for doing exactly what you have described which is making sure that there is a clear and transparent process for tracking a progress in the midterm. The goals could be and again this hasn't been decided that the could the goals could be tracking for example reductions in the amount of time folks spend experiencing homelessness. It could also be looking at ways in which we can reduce the number of people who are coming into homelessness and increase the number of people who are leaving to permanent housing the long-term goals, I think are really the north star and the long-term goals could For example goals to achieve or make meaningful progress towards reducing homelessness among specific populations. This is an approach that communities take all across the country. It has many different names. But for example, there have been a number of campaigns if you will about reducing the number of folks who are abused or veterans or unsheltered specific populations so that they can be targeted so that the the progress towards achieving those goals can be tracked and tracked publicly what we expect of the newest Authority is that in much of the same way that all home has created a dashboards that both provide system level analysis and and metrics but also dig down into the intervention level and program level we would have Axios or t to be able to do this and because it will be a regional authority to be able to carve out data as needed for the individual jurisdictions across the county test. Thank you for that. I know that's were all anxious to see that. I also want to acknowledge and what can county is done around familiar faces and we are also doing some of that I think digging down and making sure that we know for each individual that were touching are we making Improvement is that person just getting soda shuffled around or are we saying that were able to address the individual needs that person centered approach we all been talking about. Yeah, and that really is the one of the reasons that we're excited about the authority as Mark Jones as previously described and I'm happy to reiterate it as often as I can. The authority will have the responsibility for ensuring that client voice that Customer voice is at the center of all of the work that it does and there's both the need to make sure that those people who are experiencing homelessness and who have prior experience with homelessness are a part of the authority in addition. We know that there are populations who are disproportionately represented among homeless populations and making sure that we are taking an equity lens and that the authority in every step of the work that it does is looking at both the needs of customers and that disproportionality meeting the needs of customers and having meaningful impact on disproportionality will be critical for the success of the authority. Bank accounts member bagshot any questions, I didn't mean to interrupt you two, you're both. Okay, because actually that was the extent of the update that I wanted to give today and Jeff. Thank you both very much for being at the high number of meetings that we've had both internal to the city and with King County. I'm are there any other comments from you on terms of framing Next Step? I'm if we could go to the time frame that was also outlined in the memo any additional comments from you things that you like us to have on our radar app needs to come back to the select committee for their consideration as well. The Klein group will see a draft of that in August, I believe but I think we would expect that the select committee would also like to see a draft draft and final draft particularly as they consider the Ila and the charger. I think we've talked to him. That's a little bit more bills out time frame for sent it in the client group. So we will share that with our Council colleagues. I would love to check in with our Central staff with a council colleagues here not here today about the common around potentially retaining the navigation team to me. I think it just raises a few more questions that I haven't had a chance to ask you about. So I'll potentially follow up with you afterwards about what that looks like an additional questions about the rationale. Thank you. Obviously, you're doing so much work on this and I really appreciate everybody table for just digging in and we of course are working on a fast-track schedule because as we've all talked about a number of us aren't going to be here next year and we would really like See this move forward in 2019. Also, I just want to say thank you. You've been a fantastic co-chair appreciate working with you and also council member Jeanne kohl-welles and Rod dembowski. I'm John McDermott were with us last week. When we got together from King County and Nancy baucus from Auburn has been a wonderful copilot to all of this and I just want to raise again that sound cities really wants to be involved. They would like as much as possible to be on the front end and not here at the tail-end. Oh, by the way, this is it. This is it and here it is. So if we can just reach out to sound cities as well as work. Just keeping them informed of what's going on. Thank you, and thanks it comes from the Grove to thank you for that and thank you very much for that presentation as I know there will probably be more questions as we get into the later part of the summer and as we carry out the time line message. Presented want to make sure that everybody feels well-informed including not just cancel Collies but the public speaking of the public we have the remainder of the time for public testimony. Thank you all for waiting. Thank you. No problem. Really interested to hear your feedback on what you potentially heard today as well. So we will go ahead and move into public comment and every day if you could also give us a minute-and-a-half on the account on the at timer recognizing that we know folks have a lot to say and you may have written comments. So we're happy to accept it was as well. Thank you. And thank you all for being here. And I apologize for that. Okay, we will pass on note that I know that it's available online. So the first three people to testify orange ROM Smell I'm sorry Jerome think it's okay. You tell me how to correct this. Thank you so much. And then behind you will be Aaron Goodman and then Jhene cool vag check. Thank you for the writing it out for me. I'm sure I need help with it. Still welcome. Thank you for waiting for us one second so that we can get you the full time and think it comes over her world for sticking around and we look forward to hearing from you. Go ahead. Go ahead and go ahead and bring it to will try and get to everybody. Go answer. Yes. I just wanted to come. And Cher. But I feel this is the only solution to this homelessness problem. And I feel like that is just it was time for 5 minutes and two seconds. I'm going to try to get it all in cricket talk to folks in these 10 camps and homeless shelters and and the blue houses and all that and got their feedback and I talked to doctors and chemical dependency specialist police officers and so on and so forth. Let me move on here. So Washington State owns 27 + Acres over on McNeil Island. Is that correct? Okay, and there's also Correctional Facility there as well. We we just need to do a little building and I represent our life. Sorry. I'm jumping all over the place. We would like to build a drug addiction Center there. And we would like to build a mental health center there. As well as in Sanford Center for alcoholism and job training center. We also like to build housing for 20,000 people and that's just green cards. That's just the same thing they have here but in the circular motion and the only difference is that we would have showers we would have toilets that kind of thing. And we would like to have a brand new Ferry. Designed just for this purpose that is to transport large amounts of people okay to the island. Cuz I know you put on I'm so sorry sir. You owe me three minutes from last night really need to have Euclid if you have one more summary statement or one more summer. I would like to see Seattle in the state of Washington be the model for the nation and bring it back though. It's lost brothers and sisters from drug addiction and put and bring them back to be productive citizens. I would like to see them connect and reconnect with family members and friends and stuff through the treatment program that we would set up over at Mcneil Island. This is worth more than the richest at Everybody's Talkin about here. Okay? Okay, Jenny, Jenny. Did I say that wrong Bruce? Hi Bruce. I happy to take your summer as well when you're done. Thank you. Good afternoon councilmember. My name is Bruce gogoll on the elected Nickelsville. Tiny house Village a fellow was bum rush by low income housing in DuPage Security on April 8th, 2019. And they have occupied us ever since we are on strike in a recent interview with my Northwest radio reporter Carolyn. Asario Sharon Lee director of the low income housing Institute describe my testimony and the testimony of many other people from Nickelsville over the last 3 months is badgering other Lehigh management staff has told me that your response to our testimony was meaningless. We are management at a recent meeting told residents that they would not negotiate with Nickelsville and in no way would they come to mediation the refusal to complete. Emily you that is 95% finished is negligent considering the crisis in Seattle. It's time to end of Stranglehold Leah has had. Only on Nick a little but you council members Sharon Lee is a coward who hides behind organizations years of good work. She's using past success. Her present failures agency is responsible for allowing Lehi to monopolize sanction encampments HD every step of the way has violated the city ordinance ignore the director's role and its allies with Lehigh are guilty of many of the false allegations against Nickelsville is hsd for bullies and have targeted the truth it is they who have lied to the city council to themselves last Friday, at least I can save us an agency staff person who worked Under The Sweep star Zack St. Louis until he quit on Friday told to share work or something very shocking HST staffers and Lisa Gustavus and told him that hsd was shutting down shut down a fellow too. If we didn't fire our staffers for good measure she told to share worker that hsd would never renew a contract with Cher for indoor shelters. If they didn't fire the specific person on Friday Nichols going riding offer another agency staff person the opportunity to review all the bar paperwork at Nickelsville a fellow anytime and anyplace that is the same offer that director certainly has ignored. Business because it would disprove many of her allegations transparency. She seeks is within her grasp tissue has chosen to ignore it's time to end up being real but it's bad or not. Please insist on mediation between hsd Lehigh and then if they keep refusing physics both both to and sanctions, thank you. Just might be by Heather Staples and Peggy. Jess Just smoke. Okay Peggy. Do we have Peggy? Hi Peggy. I don't know which one is better for back surgery and hear me. Good afternoon council members. My name is Peggy hotz and I'm in Nickelsville founder in a volunteer a month ago. We left these Chambers excited and optimistic after your Express support for mediation between Nickelsville Lehigh and hsd we scarcely had time to exit City Hall before Lehigh and hsd dismiss the council saying they had no intention of mediating with Nicholasville a few days ago. We were told by a share to worker would met with hsd Stafford Lisa Gustavus. And that HST is planning to close Nickelsville a fellow unless we fire a particular staff person. According to discuss Davison Nickelsville Northlake, which is running spin splendidly by the way will also be closed. How is this helping the homeless people who live there. I will remind you to that when hsd closed. Titan Springs Gustavus and promised that everyone would get housing and they did not only about half of them just yesterday. I spoke to a woman who's living with her partner and Othello Village formerly from Latham Springs. Wooden the adult thing to do be to sit down and talk face-to-face with us with a mediator and since when does Lehigh excuse me does hsd get to dictate who the service providers choose to employ how arrogant how shameful for Human Services Department Stafford to threaten and Bully the very people they're supposed to be helping and protecting. Does hsd treat every service provider this way? This is a rhetorical question because you know the answer or only the two small Grassroots organizations run by homeless people who speak truth to power. Please take the steps necessary to stop this madness and get hsd and Lehigh to mediate with Nicholasville. Thank you. Thank you Peggy. And I'll follow up with you as well afterwards. I'm Heather Staples Teresa Barker. And then Amy. Hi there have her Staples. I'm the managing director at impact Hub Seattle and a friend of operating a business and having a homeless community in front of her business and I'm here actually to speak in support of the math team because unfortunately our business was one of the first co-working spaces in Seattle. And now it's one of them. This is one of the most competitive communities for doing what we do our staff has a whole lot of compassion and interaction with the community around us. We work closely with UGM. We work closely with Chief Seattle Club, but unfortunately without the knob team support we were losing our customers to the point where We're sailing and so I really appreciate the city supporting our company and supporting our ability to be a part of the Pioneer Square community and we have found the NAFTA mean to be very supportive and respectful of the people that they interact with. Thank you. I'll go Pines and then Eliana Scott and councilmember how bold and other council members. My name is Teresa Barker we've responded little bit and I'm a little nervous. So I did want to speak today on the work of the knob team in person and have a chance to share that so as you know, I'm a resident in North Seattle and area Bourbon and Kevin Parks. When I first heard about the cities named Team, I was really skeptical. The problem of homeless encampments actually seems insoluble to me and I'm I'm an engineer but over the last 2 years at community on all sides of the park has worked with the city in this problem with met with twice with raw, but our former council member SPD parks. And at one of those meetings the nap team member came and spoke to us and what we learned in our neighborhood is that they are the knob team approaches campers with compassion and a hardtail desire to provide support and assistance. They listen to their stories the advocate for the unsheltered person to find them shelter to connect them with services and to build a relationship that leads to trust which is what we're hearing is why so many times the services are turned down as the lack of trust due to trauma and these individuals lives. We really want them to move forward with their lives. We have a neighborhood group that provides a hot meal once a week on 265th park and ride that was modeled on the Rainier Valley meal and We are exquisitely aware and how the vulnerable these individuals are in their tent. There's no locks on tents there. It was from health issues from bad weather from criminals who prey on them. So in our community engagement group we have approximately 150 residents and all sides of Ravenna Park, and we support our community does support the navigation team and we believe it should be expanded to provide more services. We also need to say that saith enhanced shelters and a boatload of affordable housing has is needed to replace what has been wiped out in the past decade. Thank you. Thank you very much. Welcome. Hi. It's Amy Hagopian. I live in the central area. So I'm here today to notice the failures in mayor Durkins homeless strategy, which I appreciate that many of you did in today's meeting as well. Especially the newly accelerated sweeps and the extreme disarray and which the city's Department of Human Services finds itself with frayed relationships across the city staff who disrespect key staff vacancies and staff resignations. Now in a weekly basis most importantly the loss of Tiffany Washington who headed up homeless strategy, but then Springs tiny house Village was wiped from the face of the Earth. This spring is Peggy said Sending half its remaining residents to the street. Rumors are the city hopes to eliminate more villages. 11 years ago in Nicholasville organized Seattle's first democratically run encampment that sought to remain in a single place for more than 90 days. Nicholasville understands homelessness is the result of the mail distribution of power and wealth homelessness homeless people need to organize their own communities with their own rules and ways to enforce those rules on a public health faculty member at the UW my graduate students spent winter quarter this year interviewing almost every live everyone living in Nickelsville for homeless encampments. They found nearly two-thirds of Camp residence identified strongly is Nickelodeon's Nicky Nichols Hills accountability structures and processes build community cohesion. They help individuals develop valuable skills at they help them develop agency in personal growth. I worry about this cozy relationship with Lehigh and hsd I think Lehigh views its best alternative. To a negotiated agreement as continuing on with this relationship edging Nickelsville self-governance off the table. This Council has asked for mediation at its last meeting and yet nothing has happened to advance that idea and I recommend you insist. Thank you very much. You will be and then John trunnell Eliza Nessie earnings for the mispronunciation and the village community advisory committee. I have a lot of comments but I have prepared if you could pass on my thanks to the other council members. I have never felt so well represented by the council as I did with the questions that were asked to take. Thank you very much last month. I shared with you a letter signed by 11:00 CST members from five different cacs, which expressed our concerns about lhsd has fallen short of our hopes and their oversight of The Villages and our urgent request that you take action to address and to bring about mediation between H, St Lehigh in Nicholasville. You're caring response. That day was really amazing and then to a lot to me and more importantly to the residence. Who's the voices have been too long ignored in these conversations. So thank you. I'm trouble but despite the conversation several of you have had with each and Stanley High that the situation has worsened over this past month and HSE staff person has clearly stated that hsd intends to shut down a fellow Village when the permits expire in September if residents continues to insist on maintaining their self management system, and they also intend to shut down the Northlake Village in this homelessness crisis shutting down branches of the city's most effective harm reduction option is a shocking disappointment. We have also chosen to publicly and privately scapegoat one Nickelsville staff person erasing and disrespecting the voices an agency of the residence of Northlake and the fellow Villages the picture they paint Bears no resemblance to what I have observed and I am very troubled An agency responsible for serving the needs of so many vulnerable Neighbors in a number of contacts is refusing to recognize the dignity and autonomy of these Brave determined folks. I believe the approach HSE has taken has encouraged these erasers and pressured service providers to ignore individual needs and voices in pursuit of Tidy metrics, and the appearance of progress. I ordered you to identify what steps you can take in finding some just resolutions. We're eager to work with you on this, but need your leadership to move forward. Thank you. Hi there. Hi, my name is kolya. I'm from Seattle, but I currently live in Los Angeles, please to address the remaining two council members. Who care to hear what Seattle thinks about this? So I came to this meeting with a couple fundamental questions. None of which were really answered. The first one is the concern. Of the most marginalized people in Seattle more important than the desires of the most powerful people in Seattle. other folks who profit from the gentrification that causes homelessness Now that question wasn't answered that gentrification was never brought up. What we saw today was a discussion of how to manage the Fallout from gentrification. So until everyone on the council is willing to make a personal sacrifice. The Challenge and limit the power of people who cause gentrification and profit from it we won't address the issue of homelessness. So my second question is what is every council member willing to sacrifice in terms of social capital. potentially their political careers to advocate for the folks in Seattle with the least social capital to that end actually propose a new metric or the online evidence-based dashboard. Number of relationships you have lost or tarnished because you have upset powerful people while advocating for homeless people and you could operationalize that through number of angry emails. You've received or loss of contact people no longer answer your calls things like that. I just something to think about as you go forward. Thank you. Thank you. Thank you. John followed by Lisa. Hi, John. Good morning council member. My name is John trevena from I live in Nickelsville Northlake and I was here at the last meeting of the select committee on homelessness in June. Nickelsville Northlake, we've managed to remain a self-governing village and do our own security saving the city about 270,000 a year if you compared to other spending over to Othello, so you guys have already heard. About the hsd the rumors going around about shutting down the non-compliant Nickelsville Villages so-and-so want mediation earlier, which we appreciate but it just seems like hsd and Lehigh are going to run out the clock till jello. The leases are up. So I don't know if this is possible. But but could the city council vote and the HST Nickelsville in Lehigh get together and do mediation instead of asking we have at least two people who are like Gravely lifelike have like life-threatening illness in our in our village for them to lose their houses would be in it would be a disaster. So anything that Council can do to remove the impediments and static and Fries between these three Lehigh. HST in Nicholasville, and get this done in our lives a lot happier. So thank you. Thank you for your testimony. Hi Lisa. Thanks for waiting. Hi, I'm Lisa nitz, and I'm here to speak in favor of the mares navigation teams and thank you to council member was Kate and her bold for the opportunity to address you and also for your terrific questions on impact metrics which are critical and having the matchup. I'm here representing. It's a steak in a real estate developer and property manager with a history and Soto and Pioneer Square. We owned and managed to Starbucks Center and restored Union Station in Merrill Place restored the Cadillac hotel in or founding members of the Soto Bia and and the alliance for Pioneer Square and we've always had a commitment to investing in neighborhoods and working collaboratively with neighbors on public-private Partnerships and addressing issues facing the neighborhood in order to support safe healthy and thriving areas. We are on June 14th purchased a property at 3rd and South Washington in Pioneer Square an abandoned lot and building and we're putting in a two units of Workforce housing and a retail entity. They are and we break ground this summer and open in 14 months. So as many as 160 residents will be coming and going starting a year from now in that area along with having a retail store operating in the first floor. So I wanted to thank some are for stepping up to navigation teams, which has led to significant health and safety improvements in that area accessible sidewalk Swift obstructions removed and accessible roadway for driving with a strict instructions removed and garbage cleanup, which I think are going to be very helpful to increasing the hell. And safety of that area. We're looking forward to working with our neighbors to collectively and collaborative collaboratively address the needs of the area along with the city by taking a systems change approach results and long-term health and stability and vibrancy and safety in the area for all the old is essential to bring this about. Thank you. Thank you for being here and thank you for your testimony and waiting. I want to thank everybody for staying and testifying and folks do have written comments or you want to send you something later. I appreciate you doing that. I don't see anybody else running to the microphone. Okay, sir. Go ahead and have you? And then you'll be our last person to testify by the cops around the city 2 cast of 911 calls because being poor is not a crime that is being treated like a crime and we need to address that but the thing is like when the emphasis patrols are going through which is also proof of the war on the poor. They don't seem to have Outreach, you know, they're really it's like and the city council. I believe made a wall that said if you're an individual not three people in a tent encampment you don't get the same notification or even a 24-hour notice. So if you go to the store to the bathroom whenever you come back yourself gone, there's no Outreach there. And I know that that Deputy Mayor said that has come along and start scaring people away. He says we can call. use the data to manipulate perceived success, but it doesn't address to soak human shelters and services and and I just pulled the microphone a little closer to you that one that's closest. Play one quick message s you put together this new whole committee here in King County. Please do not forget those with current lived experience involve us include us not a PhD that was homeless for 20 years ago. The people who are living here in Seattle. Now that have experience with an AB teams in the other teams as I have experience include us and don't forget about that because sometimes a project or program or something comes on and they looks great sounds great, but for someone who's living in the car and a carpenter comes around, it just doesn't work. It's not going to work. So include us. Thank you very much! Thank you. So that concludes our public testimony today. Thank you counselor more horrible than all of our other accounts of calling supershear just Public Service Announcement. The next select committee meeting on homelessness and affordability will be on August 12th at 10:30 following Council briefing and thank you for the day for cheering for us today and all your good work. We will do some follow-up. With the individuals here who've expressed concern about the mediation as council member, so I won't mention of the beginning. She has taken lead on helping to coordinate folks will follow up with you on the report that she gave this morning and then also all of the questions and good ideas that came up from the council discussion will make sure to circulate that and provide it to the public as well with that. Today's meeting is adjourned. Thank you all so much.", "end_time": 7999.1}]}