{"format": "raw", "annotations": [], "confidence": 0.9256622520787222, "data": [{"start_time": 0, "text": "Hello. Good evening, everybody. Sorry for that delay. Those were watching on Seattle Channel when it what's been going on. We've been trying to get her microphones working, but welcome to sustainability Transportation committee. It is Tuesday, June 11th 2019. It is now 5:37 p.m. My name is Michael Brian and chair of the committee joined by my colleagues council members want thank Sean Pacheco. Thank you all for being here. And thank you all for being here. It's a lovely day outside. I appreciate you taking the time to come try public comment. We have one agenda item today. We will be discussing an ordinance and then taking have a comment on that as part of a public hearing notice. We're going to start the evening by doing a brief presentation and overview and I'll invite Ali Ford of the legislation before us and then when that presentation is complete, we will proceed through the sign-up sheets and everyone will have I'm up to two minutes to write public testimony Vol repeat these rules when I get there in a second, but I just want to give folks a heads-up, so you will have two minutes if folks want to come as a group, which would be 3 people or more. You're welcome to come up to the microphone together, and then that group collectively would have five minutes to speak. You can have one person speak for 5 minutes or share it across the roof, however you want, but if you're participating in a group or individually you can't do both, so you'll have to decide if you want to be part of a group or speak individually, and with that. I'm going to go ahead and read an agenda item want to being staff today by the grateful and thank you all for being here or not volunteers that staff Staffing the clerk in the meeting, but her voice is out. So I'm going to read in agenda item. Number one is Council bill 11954 for an ordinance relating to land-use and Zoning amending sections to three. 44.01 1232844280801423284428017232844020. Go to 3. 4 4 0 4 1 2 3. 4 5. 54523. +84-880-022-3848. 032-238-8480 3/8 and 2/3. 86007 of the Seattle municipal code to remove barriers to the creation of attached and detached accessory dwelling units and that a floor area ratio requirement in certain single-family zones with that. I'm going to turn to the presentation table and Allie asked you to introduce yourself and then we'll jump into the presentation. Alex Mucci Council Central staff how we thank you for being here. Thanks for all your work on this if you want to just jump in the presentation that be great. I will start with the following units often referred to as a to use data is detached accessory dwelling units often referred to as backyard Cottage or Carriage Houses attached Adu is Garden Apartments basement Suites at cetera. So attached to those that that are part of the the main house and detached are in a deep in an accessory structure somewhere else on the lot. So tonight I'll provide a brief overview of counsel bill 11954 for that was introduced yesterday that represents council member O'Brien's proposed legislation as I walk through some of the slide sections of the proposal that differ from what has been presented in previous previous meetings are slides that are have a light green background or some people have called that blew. It looks like rain to me. I'll describe a few potential amendments that have been identified by council members to date they'll be more discussion and put a potential vote on those of the next committee meeting on the 18th, then we'll move into the public hearing and then as I just described The Next Step would be to discuss potential amendments and potentially vote on those amendments and the legislation at the June 18th meeting and then the earliest that the council would take final action would be July 1st. So they proposal would increase the number of accessory dwelling units are allowed on a lot to to either too attached accessory dwelling units or one attached into detach The Proposal is slightly modified from the previous iterations that there is now a requirement that in order to add the second ATU the structure would have to either meet a Green Building standard or be affordable to households making less than 80% of area median income. The maximum household size. So today not more than a time-release unrelated people can live on a lot in a single-family Zone and that's regardless of whether or not it's just a main house or a main house and an accessory dwelling unit. The Proposal would allow up to 12 unrelated people on a lot if you have two accessory dwelling units. And to stop me if you have questions on the way. There are a few changes to minimum lot size and the maximum square footage for a detached accessory dwelling unit today. You cannot build a detached accessory dwelling unit on lots that are less than 4000 square feet in my area The Proposal would reduce that to 3200 square feet and it would increase the maximum size of accessory dwelling units to 1000 square feet. Height limits for a detached accessory dwelling units there minor modifications adding a few feet for Lots based on the the width of the lot the one change here from the previous version is that if you look at the table on the right under the proposed changes previously, we had three categories less than 30 ft. Then the what is now the 30 to 40 ft category was 3250 ft and then greater than 50 feet on based on some feedback from Builders and how construction the construction industry work two additional fee in the 40-foot lot with rainbow allow for more practical livable space for detached accessory dwelling units. So that's the change their in addition The Proposal with allow a few extra feet for 4 in height to a facilitate Green Building strategy. So like 11 Green roofs in that type of thing. The Proposal would increase the maximum rear yard coverage allowed on a lot. So today not more than 35% of the overall can have to be covered by structures. There is no change proposed to that overall standard, but in addition to that 35% maximum, there is a requirement that not more than 40% of the rear yard. So there we are about 25 feet of the lot can have structures on it. This would allow an increase to 60% rear yard coverage if it is a one-story structure so would facilitate a single-story structure for Aging in place and mobility issues. Under the existing regulations one off-street parking spaces required for an accessory dwelling unit and one off street parking spaces required for the main unit. The Proposal would eliminate the proposed that required parking space for the accessory dwelling unit. But Property Owners would still have to maintain the parking space for the primary. Under existing regulations a property owner must occupy either the main house or the accessory dwelling unit for at least six months of the years or needs to be their primary residence. The Proposal would remove the owner occupancy. And the proposal would introduce a floor area ratio in most single-family zones of 5 or 2500 square feet of floor area, whichever is greater. So the floor area ratio is the relationship of the size of the building to the size of the lot for area that's in basements or any floor area in an accessory dwelling unit would be exempt in addition to proposal would exempt up to 500 square feet. And in addition to a detached accessory dwelling unit 500 square feet in any accessory structure. So that would include a detached garage shed that type of thing and existing homes. Could they already exceed the limit could expand One Time by up to 20% of the existing floor area? The Proposal that was introduced yesterday also modify the effective date for this specific provision rather than the normal 30 days effective after the mayor signs, it would have a six-month effective day in this is addresses a concern we've heard about delays and being up the submit building permit applications for new homes to the Seattle Department of construction and inspections and Loud people who already have plans developed to still continue with those proposals. In addition to the specific changes, there are few other Provisions in the proposed legislation Burwood add tree requirements when constructing an Adu if the lot is already deficient in what is it would be required for a fir trees on a single-family lot and would provide flexibility for preservation of existing trees. It introduces some flexibility from for conversion of existing structures into an accessory dwelling unit on provides more flexibility for where the entrance is located provide some exceptions for projections like Dormers that had interior space and also adding a provision that would require annual reporting on how do you Productions and would ask that the Seattle Department of construction and inspections in the office of planning and Community Development would conduct a survey of a t u owners in occupancy within 3 years after implementation. So that's a quick summary of The Proposal as it exists today if there no questions, I'll just briefly describe some describe some of the Amendments that will be developed and discussed in more detail at the next committee meeting. The first is a proposal by councilmember O'Brien that would request that sdci at the time of Permitting provides information to the homeowner about what it means to become a landlord in also provide training for new landlords as this will sort of open up a new landlord. I guess industry is not the right word but a new crop of landlords potentially. I'm a proposal from council member purple that would prohibit short term rental used in adus constructed after the effective date of this ordinance. I'll know that this amendment would require introduction of a new bill, but there will be another notice required. So they'll be time between the committee meeting next week. And when the earliest date that the final on the full council could vote Council member herbold has another proposal that would require ownership of the property for 1 year primer prior to permitting a second accessory dwelling unit. This would be an addition to meeting the Green Building requirement. But if they were I'm choosing to go the two with the affordable unit route, they would not bet that one year ownership requirement would not would not apply. And this is the proposal that was contemplated in the preferred alternative to have a 1-year ownership requirement. Got the first president Harold is considering an amendment that would require a parking space only when adding a second accessory dwelling unit. And then number v i c I failed to put the name there but council member O'Brien is considering an amendment that would allow the increased rear yard coverage for conversion of an existing accessory structure. So as I mentioned previously The Proposal would allow more rear yard coverage for single story a to use this would allow a person who has an existing structure in a rear yard to expand that existing structure rather than tearing it down and rebuilding a new structure to have a little bit more yard coverage. Even if it is more than a single story structure and then there are few proposed changes to the reporting requirements one would be too from Council president Harold to provide additional information about any parking and packs that may be identified after implementation and consider any amendments that may be appropriate appropriate including considering Geographic based parking requirements Lessons Learned after employment. Have a pilot program that will provide loans to complete an Adu or create more habitable space for low-income homeowners. This is a pilot program that is included in the housing funding policies that are currently being considered by the council and would provide about 5 to 10 loans over the next year to low-income homeowners were interested in either converting a basement or an existing accessory structure to Annex to an accessory dwelling unit may help them Funko construction of a new accessory dwelling unit or just creating more habitable space within their existing home and then a proposal from cast member O'Brien to report on use of adu's from for short term rental use so if if the amendment that would prohibit short term rental use his past this change would not be necessary if that amendment is not adopted this would provide information about how much short-term rental use activity rack. Play seeing an accessory dwelling units in whether or not Council wants to make a change in the future based on that information. Natalia thank you. I'll read the last Light. Thank you for clarifying questions or if you want to talk to any of the Amendments, that's fine, too. I would love to have my memory refreshed on what the FBI is said about the anticipated number of Jews. That would be developed. I think I'm as far as I was looking for it myself as far as saying that only 2% of lots that could have them under the current regulation have them but I haven't gotten any further than that. So under the existing regulations, we would expect about 1970 accessory dwelling units over the next 10 years with the proposed changes. We would expect just over 4,400. So more than twice as many would be constructed. The 10-year. In addition to that we would expect about I'm five hundred fewer teardowns over that same. So 4430 wide see white over 10 years over 10 years based on these land use code changes. There's other changes and you know other work happening out there in the market that may increase production as well. But from based on just the land use code change and then I'm reminded that there is one additional potential amendment that I am working on with councilmember Pacheco, which would be looking at opportunities to either require and incentivize space for bike parking on Las to ensure that people are thinking about designing these spaces for people who used bikes as their primary mode of transportation to that will likely be may be an option for discussion next week as well. Alexander questions for Ali I see none. We will excuse you Ali. Thank you so much for your ongoing work on this and your presentation tonight and we're going to jump into the public hearing. So I will go ahead and open the public hearing folks signed in on We Had A and B sheet. So I will alternate between those two sheets and work my way down the list the moment we have about 80 folks signed in so and just a reminder if folks will have up to two minutes if you want to come forward as a group there is a slot on here to indicate that but I'm going to come forward if you come forward three or more people will make sure if it 5 minutes up on the timer and try to do that. And again just reminding folks in case you didn't hear earlier you can participate in a group or participate as an individual, but you can't do both. So I'm going to start off with Marc coat followed by Phyllis Dugan and then Ellen Milne Hello. My name is Marco. Di. I live in Judkins Park District 3 I'm testifying in favor of adopting the proposed ATU legislation as written. I'm the executive director of Parkview Services a nonprofit organization based in Shoreline Washington that develops and manages single family properties to rent to extremely low-income people with developmental intellectual and developmental disabilities. Parkview currently owns 15 properties in Seattle that how is 61 people and I'm proposing adoption of the proposed Adu legislation as it would lifting the owner occupancy requirement would allow us to develop up to 20 more units on our existing properties. Great. Thank you. Thank you Mark. Hello. My name is Philip Duggan. And I live in Pinehurst and D5 My Father James Duggan still lives in my childhood home on Queen Anne district 7 we're looking at options to build a backyard Cottage together for a while. Now. I'm going to strongly support all the changes that you've looked at. Many of them will help make this new home a reality. The project is very personal to us my opinion. My father should have retired years ago open that selling his home and building something smaller in our backyard will give him enough left over to help make that happen. So we're making difficult choices include losing up my childhood home the home. He's lived in for 40 years were not the only one facing towards difficult choices though. These changes are helping put us in control of make those changes better make those choices better allows him to plan ahead on something. It will let him Asian place for many years to come and have a multi-generational family in the neighborhood that I love. This won't be the case. We have to find someplace else to buy a ran to the current prices in Seattle. You won't have anything in his budget and he certainly won't find something where you can be sure. I can still afford it in 10 plus years from now, you could end up having to move for out of the city or county where we won't see each other nearly as often, even the changes that are required to make this project possible are still things. I support many of them. Give us the flexibility to make this project better in the development standards. That would make it a bit larger with a second bedroom. So in the future, hopefully far in the future of it be easier to rent out to a family and a side note. I know it's not in the Yeah Yeah Yeahs, so it's like to be considered but I told you to look at options for multiple detached a to use in gigantic yards like mine in the future and I'd love to host a home through the block project as well. But what I'm already doing this I'm having to choose between helping my father and helping someone who is homeless, but I have more than space. I'd also love for you to look at opportunities for others facing such as front yards. Even if it's in front of the setback with tiny houses in really small structures, it makes him part of the community. So these houses joined together so you can help hope you support all the proposed changes and remove barriers to Creation 8 news. Thank you Stacey self. Elena looks like you have a group for one second. You're going to be followed by sorry Sanam hugs hugs failed and then Ruby Holland and then patients mulatto. Thank you. Hello. My name is Ellen known thank you for the work. The council has done so far to address housing affordability. I'm here tonight with my parents Gary a retired civil engineer and Janice a teacher. The Northwest has been our home Ian Tire life. They raised me to believe a community and compassion and that's why we're here tonight. Thank you for listening to our story. I called Seattle home since 1997 and I rent on Capitol Hill so I can live car free and walk or use transit to work shop and live. It's why I chose my neighborhood over 20 years ago and why I want my parents to join me in Seattle 10 years ago, my parents downsized they sold their house in Maple Valley that they were tired too and spent the next decade traveling in an RV. They've been able to spend Winters in warmer climates and Summers and it's a climb Seattle with their grandchildren, but my father turns 78 this year and my mother 74 both Drive last but use Transit regularly and then the last year we've been having tough conversations about next steps for their future will my brother and I both Renton Central Seattle neither of us are in buildings appropriate for our families to live with us. They want to remain independent for as long as they can they're in good health or physically active. They're not candidates for assisted living and after living in RV for the last decade their space needs are modest a backyard Cottage somewhere like Queen Anne or Capitol Hill would be perfect a walkable neighborhood near grocery stores library is in a church Community with easy bus connections to their doctors on 1st and Cherry Hill, but under the current restrictions on adu's there's simply not enough cottages for people like them to rent. I want to be there to help my parents, but they gave me to make that happen. We need more rental options and all our neighborhoods reducing the barriers to the creation of adu's will help make that a reality. Please pass this common-sense reform and help our city and my family my parents want to be your neighbors. My name is Janice million in 1970. My husband I build our first home a duplex in an l-shape design on a corner lot in a single-family residential neighborhood Zone by a progressive City to encourage housing density. Since then we have lived in other ownership housing configurations from a second duplex and various sized houses in four states along the way we owned and managed for 30 years of 10 unit apartment building reading to University students. Most recently. We have travelled much of each year and a 375 square foot RV having touched on over 46 in our Journeys because of these varied experiences. We have come to appreciate Urban Kansas City locations that provide affordable housing in neighborhoods that are walkable to desired and required Services when Ellen asked us to consider Seattle as our next housing location and explained for those proposed added Adu zoning overlay. We included an Adu in Seattle to our list of future options. We are urged passage of the Ada reform their thereby adding additional creative. Solutions to the housing needs of Seattle. Thank you. Thank you. Thank you. I'm the one with a sloppy handwriting. What is your name? Sean Hosford Varsity. I've been trying to do in a DUI in our neighborhood in Broadview the last four years and I've been held up by the building department because their solution for Broadview is that I have a 10000 square foot lot and I put a backyard Cottage there but I have neighbors down the hill for me and we have water problems and underground Springs and Broadview. And if I did that it would affect the neighbors down hill because I would cover impervious land. So I chose not to do that because my parents taught me to be a good Community member and I've been waiting to put a carriage house on top of our garage for 4 years now. So I really really urge you to pass this in that time of our living in this house for 29 years. We had our daughter live with us. It's a very small 1930s house about 1800 square feet right now, my mother-in-law lives with us. My mother has moved in and out of our house three different times. We had my brother-in-law to live with us once and we've had a friend live with us come with us, but I want to provide affordable housing in our city. I am aghast at a as a third-generation Seattle native and somebody who lives on Stolen indigenous land. We don't do better for each other. It just makes my blood boil. And so I really urge you to allow me to provide housing that is so needed in our city as you can see when you drive the freeways for people who need affordable housing. Thank you. When second patients you're going to be followed by Michael Austin and then lower lobe Bernsen and then Kelsey Hanlon record. My name is patience malava and I am with the Housing Development Consortium of Seattle King County and I am here today Festival. Thank you for all that. You have done to bring us this far to me reducing berries to enable production off accessory dwelling units is a low-hanging fruit tool that we should be able to pass without having to spend three years or process. So I hope that this is a time that we are going to was the Finish Line. Our members are working across the county across the city here providing housing even in single-family homes you had from my Kodi one of our members with Patrick services are providing housing for people who are low and moderate-income and with special conditions. Throughout the city they have 15 properties that could be having more capacity with accessory dwelling units, but they have not been able to produce those units because of the existing. It's because of the owner of Japan see because of the ostrich have packing requirements us being able to at least those are barriers. We will be able to see more production and we really appreciate the addition of the option for a non-profit developers to be able to play in the space with the availability of them being able to produce income restricted homes, really appreciate the language and be supported legislation and hope to see it move forward. We also have members while working in the city working on a report to look at how accessory dwelling units actually at 2 in enabling homeowners to get supplemental income. That's what the report is here will be able to provide with you. There is stated that shows that this is a tool that really helps in. Crack in the housing crisis, and we hope that you will take it up and see across the finish line. Thank you. Ruby I apologize I skipped over you so Ruby's next and then you'll be followed by Michael Austin and just for folks or tracking the numbers they signed in Ruby's 3A. My name is Ruby Holland. Ethnic cleansing is the planned removal of ethnic or racial groups by force or coercion from a given territory by a more powerful ethnic group Austin with the intent of making everyone the same race ethnic cleansing of non-whites is common practice in Seattle the Chinese explosion of 1886 the Japanese internment of 1942 and the mha of 2019 this time we won't go out quietly into the night will take the social media and alert the world is that racist Jenny durkan and her powerful cartel is carrying out a campaign of ethnic cleansing against non-whites in order to create an all white Seattle. We won't let up until we put it into this Gorge. I'm asking all people young and old to join our social media campaign. By contrast the Olde Bryan ATU plan can bring families together bring back the middle class and can bring the homeless seniors college students and Working Families off the street the benefits of adu's outweigh the negatives. The main objection to adus is old school thinking anybody with a truck and nail bag will buy homes and convert them to rental Marty Kaplan 2017 news for thinking with the truck and a nail bag. We can create our own adus Ruby Holland 2019 my solution for Marty Kaplan create an Urban Village in his neighborhood and declare them at high risk of displacement. I promise you they will fall in love with I do's and Dad news appreciate your effort. From itself. Thank you. Thank you for my pretty Michael. You can follow Ruby and I appreciate this opportunity to provide our comments on legislation to promote the production of accessory dwelling units in Seattle strongly supports this proposal as a Diaz and data to support many the housing goals and policies of the city's comprehensive plan and can provide Alternatives in single-family neighborhoods for a variety of different household types cluding singles families of children and multigenerational households. We believe that I need a construction of adu's could provide more flexibility and accessibility for new housing options route Seattle many of the Planning Commission previous recommendations, especially removing the owner occupancy requirement modifying the code to allow for more than 180 superlot removing the requirement for off-street parking and applying floor area ratio for area ratio limits on developing and single-family Zone. We also look forward to working with City staff as they continue to develop additional strategies focus on affordability, and it's actual Equitable ATP production including creative financing approaches uncoordinated simplified construction process. Those lips those additional efforts can have a larger impact of beers to a TV production are removed by this legislation. Again, we commence the leadership the council member O'Brien and the work of three staff from the office of planning Community Development as witty as well as Council Central staff will work closely with community members to identify those proposed policy options again to find commission supports the current proposal and it hurts a council to approve the legislation. Thank you. Thank you, Michael. Laura has next in Laura's going to be followed by Kelsey Hamlin and then Marty Kaplan. I just wanted to say how much I support this proposal. Me and my family live in a quadruplex it started office, and maybe you were in a former garage, and it's allowed us to live in a walkable neighborhood that we wouldn't have access to. Otherwise. I want more people to have that opportunity. Thank you. Speaking on behalf of more. My name is Laura morante in Queen Anne and I got involved with Doctor Cottages because it's an intergenerational issue and I group an intergenerational household when my parents when I was 5 my parents my grandparents built in addition to my grandparents could live with us and provide childcare when we moved from New York to California the same thing happened and there was a transition in our life and having a d u down the block when we were make building the new edition for them to move in allow them to live two houses down until they can move in with us. And so my entire life it was completely normal to live with me and my grandparents my brother did the same thing. So my brother moved in with his kids with my parents and so that kind of living has allowed them to stay together in Santa Monica very expensive city. So I got personally involved for that reason and then as a housing activist, I see it is one to install the toolkit a lot of like cliches, you know, one more strategy if we don't do this. 2000 families at this is family housing. That's two thousand families. That won't have housing in our city. And for those two thousand families, that's a big deal. Even those who drop in the bucket of what we need more has hundreds of members online. We've had a number of events. It's a really diverse group of folks in terms of class and race and identification and abilities. This is a really good option for folks with disabilities that you can place and to build at Ada accessible unit and any barriers that we put in place. I really caution Council to sparse if any at all because everything we do is one more family to can't live in our city. So please be careful with your amendments and more fully supports the legislation and everything that is said tonight about inclusivity in these communities that are off-limits to families right now could be said about duplexes and triplexes and more. So when more talks about back or Cottages were looking to the Future Sure, and adding other kinds of housing like you heard Melissa lives in a quad with her family. So these are the kind of housing options that we need in our city. Thank you so much. a clock Kelsey Kelsey Hanlon and sustainability think tank for policies are often portrayed would likely make someone not as engage think of these policies are wanted in Seattle. I'm here to tell you. Otherwise, I didn't realize it until I start working at sightline, but my father lived in a garage apartment after his first divorce and my mother-in-law Suite after the second I was around nine years old and then 16 years old at those times and I obviously didn't see any difference between those homes and normal homes that my dad was middle class the whole time yet. He definitely needed help from his friends with those convenient more affordable homes in order to get back on his feet. Now I also know it is cut emissions by nearly half per household energy materials and transportation of materials and transportation compared to a including modern mcmansions about small spaces and asking about the children I say to you is it not more important that children have a planet to live on again as a child. I really didn't have any qualms and neither does that when it is give property owners more autonomy over their financial burdens and their friends with her family's needs. Like my dad's with me options 80s country accessible housing with no stops and accessible features, which has more housing for aging residents and or those living with disabilities unrelated note when I become an option replaces a modest home. It's a sign of what does unfortunately exactly what city policies incentivize across 75% of Seattle. That's right three Force. It is our one small steps to curb such extravagant space taking by the wealthy. They instead make room for at least one more household on the very same lot. Marty Kaplan your next and Marty you going to be followed by Marty is number 5 be so we followed by 6 day, which is Jerry Bartlett and then Bill the Samsung Simpson who's 6p and then Bob Morgan is 7 a We have a girl you have a group. A good evening. I'm Martin Henry Kaplan architect and share of our Queen Anne Community Council land-use Review Committee. Thanks for the honor of representing our community and thousands of concern Citywide neighborhood leaders and seattleites consider before acting reducing and impacting the property rights of over 350,000 citizens who reside in our single-family neighborhoods in our appeal of the adequacy of the avoided weighing in on the legislation directing that decision to you instead critically the first sentence in her decision reads given the groundbreaking nature of some of the features of the proposed legislation is impossible to know whether know some or all of the ill-effects claimed by the appellant will come to pass. This sentence is extraordinary as she admits to significant uncertainty regarding potential unstudied and unmitigated impact from this legislation. Be clear. We share similar goals in finding responsible solutions to smartly accommodating our growth as you know, I am a long-time density as I helped craft the current legislation allowing Adu Citywide by serving as a Seattle planning commissioner between 2004 and 2012. We found to a three-year trial. If the input from other cities that informed our research and legislation met the measure of smartly adding density in a manner that respected every Seattle light and we invited neighborhoods to our table. The Proposal before you today dismantles these regulations that guided our research and founded the current code no sit in the USA has proposed the unprecedented changes that are now before you. Instead of Neighborhood Impact input and partnership you chose to rely upon planning Advocates and computer modeling to measure potential impacts to never every neighborhood and citizen. We ask that with any legislation you direct a trial. Within a limited area to confirm the unsupported conclusions presented with an e is and then he is concluded there would be little if any impact impact associated with removing the owner occupancy requirement Number One issues that concerned citizens neighborhoods relate to the obvious unrestrained speculative destruction of affordable homes, unprecedented population displacement and increase in housing values and taxes Nationwide impact studies expert opinions coupled with common sense underline to see significant Improvement concern. Under this proposal every property over 3,200 square feet can convert to investor-owned Triplex Beckett of development, otherwise called multi-family, which has been expanded to MHL ready for two impacts associated with the moving parking requirements allowing three units for Lawton 12 people living in one property. This one-size-fits-all policy completely ignores differentiation infrastructure capacities and all else that should inform the largest change and land-use in history increases in densities, utilities and people should respect obvious differences in concurrent infrastructure and be allowed in located where best accommodated one size does not fit all the number three impacts from a associated with restricting the size of homes to point five f a r This proposal ignores The Taking of private property rights and in fact strongly encourages Mega buildings that the legislation purports to prevent. Among many problems under this proposal for instance a developer can take a 5000 square foot piece of property build a maximum 2500 square foot house and to attach 1000 square foot 80 years and a 1750 square-foot basement yielding a 6250 square-foot box on a 5000 foot lot. Is that what we want? I don't think that's what you want. But that's what you can do under this proposal. Additionally this limitation will force families out of Seattle and only promote maximizing non affordable market-rate condos. There are many more issues of concern that we will address in our accompanying letter. We ask that you thoughtfully consider the important amendments and I'll give to you after in a second. Please note our appeals. We're focused upon process and lack of community input only we wholeheartedly support many options available to revise the current codes and we do some barriers to building a to use however, neighborhoods have been shut out of the important work in crafting respectful Equitable representative and economically viable policies. Let's not be Reckless. Let's do it. Right we got one chance. Let's do this together 350,000 neighborhood residents deserve. Thanks a lot. Tyson is a box for comments. And I apologize folks were given cards when you signed in for your slot. And when you're done, if you want to drop the cards in the comments lot to will make sure we get those back when we reuse this. Let's see. You must be Jerry on Jerry Bartlett ability for people to talk about what exactly this rule in ordinances is talking about. I believe and I support this this ordinance, but I do from a different perspective because I think it's in the right going in the right direction. But what I'm concerned about is that I'm concerned about solar infringement and I don't see a lot of issues really focused on the fact that currently live in a house and there was a make a house built next door. My son sets at 4 in the afternoon, not 9 The plants on my property the trees on my property or suffering because they don't have direct direct sunlight that was originally upset about that from a personal perspective that my plants were suffering because there would be less CO2, you know take which would reduce, you know climate change related issues. But then I look at the mega house in the mega house is really more like a parking lot. It has a black roof that absorbs heat and does nothing for get energy. If I had solar panels. I wouldn't be able to actually even use the sunlight. There's a lot of exemptions to the housing rules like overhangs and sidewalks and driveways in Adu parking. The basically makes these houses in these areas. Not not plant uptake possible to put the trees that are being planted that are replacing Hundred-Foot furs are tense of dogwoods that go into a concrete Basin and you can't plant something that has a bet a bigger wood structure. And so I just want to really focus on the fact that whether it's this new ordinance or the existing ordinance that we focus on the value of carbon and carbon sequestering by the plants that are currently in our community. Thank you. Thank you Jerry. Bill Simpson Hi, my name's Bill Sampson. Thanks, though. Things were given the opportunity to speak. I live in District 4. I'm in a single-family home. But I live in why you would call a basement apartment. It's on the ground level near the top of the hill. So it's technically a basement apartment this kind of ground level and on my neighbors have a mother-in-law apartment in the back of the house their house and so I volunteered a lot with this year at 5, which is how I've got involved in this housing issue. I volunteered a lot on this year's like housing and transportation and energy and all three of these issues really connect to each other this year that we support war against housing options because that cuts down on emissions from Transportation which are the biggest, you know, cause of Admissions and Seattle and if people live in Bordeaux Areas, that promotes more walking the more bacon more public transportation. And so this from both more safe healthy and sustainable communities. And so I think I support this legislation especially as a follow-up to the mha policy that was recently passed Moses Seattle still single-family zoning, and so I think they're doing a doos and Daddy was and backyard Cottages are good way to add more affordable housing options in single-family areas of it. Thank you. Bob Bob Morgan's next Bob's going to be followed by Sarah Swanberg. And then Shelly Cohen and then Karen De Lucas numbers on Bob Morgan. I do not support the proposal except for the anti mcmansion Fair limitation that it contains. Thank you pack too much together to swallow it once but I suggest three amendments. If you do go ahead with this legislation would be the change the name of the Zone. It's really a triple family Zone and the title single-family just isn't accurate anymore to I'd like you to require a reason process in sub areas. To apply the new Provisions there was a great Seattle City council member named Sam Smith and he had a phrase he used it was called the meat ax approach that apply to proposals like across-the-board percentage budget cuts because they don't consider how they affect different circumstances differently. This is me taxes owning. There's no regard for area characteristics such as topography. Like I've open space parking congestion typical large sizes it with exception of the SAR limit and I think you should require a sub Barrier Reef Zone in order to put this kind of a significant change in the city 3 maintainer occupancy requirement of the proposal for one year after the ownership requirement. I think that's going to be a piece of cake to work around for any self-respecting LLC with Venture Capital backing that's not going to be a problem at the conclusion that the proposal where we do staredowns is based on an unfair comparison to be fair. You need an option with Nick Mansion killing fa Our limit added to our current single families on and then see who has more tear down. So I think we get a different result. Are the opponents of this proposed to run concerned about affordability? There's not much chance of this house is going to be affordable a thousand square foot backyard Cottage rent for about $2,500 a month mcmansions. Yes, you can pair to that but that's a red herring because that can be addressed other ways. You're just going to make some rich developers even richer with this to other opponents of the new changes who feel lame. Council should not vote in such significant changes to our city. I say, please make it out to candidate forums and get pledges if they will repeal this legislation if they have to thank you. We are going to Shelley. Sarah yes, you're right Siri your first and then shall I thank you. Hi, I am Sarah Swanberg. I have been on community associations for 13 years and Northeast Seattle and I've been on to standing advisory committees during this time. I hear terms like character livability. Urban Triplex used as a verb. These these are all terms that I've come to believe over. The years are are used as kind of a Call of arms of white people. To maintain the air rated neighborhoods that exist in the city so that the a rated neighborhoods remain good meaning white and that are schools remain. Good meaning White. This legislation won't necessarily bring more brown people into my neighborhood, but certainly and certainly having this legislation might just make all the white single-family home owners in my neighborhood more rich, but it certainly will send a message that the city wants to do something about the racial inequities that exist here. So for that reason, I support this legislation. So one thing that I would like to see is an amendment is that there are a lot of 80 use that exist without being permitted and I think that it would be helpful if those people could be grandfathered in so that it can all be legit. Thank you. Play the song. Hey you're up now. Cheryl Brian and council members for the record. I am Shelly Shelly Cohen Cohen, and tonight. I'm putting on my real change board of directors hat. Real change exists to provide opportunity and a voice for low income and homeless people while taking action for economic social and racial Justice. You're meme. It's mr. Chair. can do that there are they will allow projects nonprofit projects like the block project which is an amazing project and those who aren't familiar with it become educated because If they could single-handedly solve homelessness, it won't. But it could because your goal is to get one dwelling unit in the backyard of each resident residential Block in the city of Seattle. I think there's like twice as many residential blocks as there are needed for homes and you're reducing the minimum size and allowing to do a to use on one lock block would do it by then courage you girls other nonprofits that are doing similar things a little bit different but still can assess the importance though is look at other ideas that can further allow adus in blocks in community. The block project is community and that's what we are. All here for is a real Community to make real change, don't you? Thank you Shelly. Karen is next Kennedy followed by Walter Walsh then Nancy Helm and then Jessica Dixon, Dora, Madison Valley neighborhood. Is a little bit closer. I'm here. I'm also a member of policies over the past several years the American Institute of Architects Seattle chapter supports council members O'Brien's ATU legislation without amendments legislation that address what we experience with our clients as a biggest barriers to Adu construction today. We also strongly support the far limitation home size that we both incentivize density in the for multiple families living on a single lot and promote good design by encouraging designers and Builders to create a mailing address space and functionality issues. Encouraging additional adus is the gentlest type of infill we can provide all of Seattle neighborhoods Works to address especially specifically affordable housing availability. This is a needed stuff to start to open up all of our neighborhoods to everyone in the city approve this legislation and its key components. I also would encourage you to hosting a tour of 8 on this Saturday formation on AIA, Seattle. Walter good evening. I'm Walter Walsh University of Washington law professor and an owner-occupant for grandfather duplex and see single-family zones University Park at 3 amendments 1 encourage. Co-op split ownership and ban Adu condominium ization provide their ownership of the principal residence and either or both of its accessory dwelling units may be split only by establishing a residential Co-op as defined in the Seattle Cooperative conversion Ordinance. Do not allow split ownership to a condominium to before Adu permit issuance require non-occupant landlords to record The Covenant of compliance with the Seattle Co-op conversion ordinance when selling rented adus before sales the public of any rain today to use as Co-op units non-occupant investor landlords must comply with all their code obligations as developers including offering tenant protections expand the CFE Co-op. Inversion ordinance to should rent single-family dwellings as well as rented adus in single-family dwellings and do not allow single structure Adu triplexus under the same roof and single-family zones. Does that fundamental change will jeopardize the entire Adu ordinance restore counselor O'Brien's 2016 alternative to the single-family dwelling laws may have one attachment detached Adu duplex means a single structure containing only two dwelling units neither of witches and they do you put the code defines triplexxx much more simply and without any qualifications as a single structure containing tree dwelling units the land use code does not define double Adu Los with statues of triple axis, but it certainly does Define double A Adu love without tattoos as triplexus if allowed to sing, Structure containing a primary dwelling and too attached a to use would fall into both definitions single-family dwelling unit and XXX. Thank you. Thank you Walter. Nancy Hello and Nancy Howell. Thank you for this opportunity and for the work that you're doing on behalf of our city. I live in a single-family neighborhood. That's just outside both the Green Lake and the Roosevelt Urban villages. We need more people in this walkable bikeable Transit rich neighborhood making it easier for me and my neighbors to build a to use and Dad news is the minimum we should be doing Seattle is a great place for Baby Boomers like me to age if we have lots of housing options great Transit and the ability to walk to Parx restaurants stores excetera. We can give up our cars move into backyard cottages and live well in age diverse neighborhoods, I fully support the square footage limits. Removal of owner occupancy requirements and elimination of off street parking requirements. We need houses for middle class not mcmansions people who want to build more units on a property shouldn't be limited to the properties. They live on and if storage space for personal vehicles on the public right-of-way is a problem then s. Needs to do a better job of managing that resource for years is way too long to wait for this Common Sense reform that will make our city more livable and more climate-resilient. Let's do it. Next train to hear from Jessica Jessica. You're going to be followed by. CB Richard Schwartz, then Lane young and then Brook Broad and Jessica just refers to a tracking card. She is 10A. 37 thanks for being here tonight. I'm a resident of the Finney Greenwood neighborhood and I lived there for about 30 years in a single-family Zone. I live in a multi-generational house on a single-family lot. I live next door to a grandfathered in a duplex with a for poor people upstairs to go downstairs a family upstairs and a couple downstairs. I live across the street from six young men living area for a small rental house and they're sharing bedrooms. And I'm glad it's a storytelling units are exist in the city of Seattle. In fact, I've wanted to build an accessory dwelling it into my backyard for 15 years since the original legislation was passed and have done plans and thought about it, but I've never we never had enough money the kind of money it takes to build an access. Throwing you in it. So I was interested in the city proposed last year tweaking the parameters that is allowing a little bit more height and removing the parking requirement, but I'm here to ask you that you maintain the owner occupancy requirement without the same place. We are opening up our neighborhoods to speculation by REI tees and Global Investors. I'm worried about the impact that this will have on our neighborhoods including the lots of trees and permeable ground which not only affects livability of our neighborhoods. But ultimately the health of Puget Sound and that's not the same. Thank you more time on your side if you're good with three or more. So if you want to keep it 2 minutes, I've come back to bed. Otherwise. Richard Schwartz Good evening. Seems like we have a bit of an echo chamber go in here today. So I'll take the opportunity to offer some a different angle, but an important one it's for late last Friday afternoon. I received an email notice about this Public Relation to an extremely significant piece of proposed legislation. Just two business days notice for something so important and seemed very appropriate. I quickly read through the proposal Zelda said if I had any questions, I should call staffer Alicia it councilmember O'Brien's office so it for 10 I did. So I told you what my question was. I need to speak to Alicia, but then she was gone for the day. I didn't ask what the time frame was removing proposal forward as for future public comment. She said I would need to speak to Stafford the day. Sent a result of the time between the notice coming out late Friday and public hearing. I asked Leslie what I should do to get my question answered before the hearing. She said she could have Alicia call me Monday morning. I asked if there was something she could do to be sure at least I got the message. She said she would put it directly on her keyboard. So she would be sure to see it Monday came and went no call today came in a no-call. So to summarize very short notice is given for a very important during the people who recited as the ones to answer questions and not available the promise with him to get back to me before the meeting is not fulfilled. So I decided to forsake a beautiful Sunday afternoon Sunday afternoon to come down speak about this today. It's because an election is coming up if you're an average citizen and can't call the city and say hi. I'm so-and-so fan Amazon or hi I'm so-and-so for the Cascade bike club or hi I'm so-and-so from Vulcan. You should probably expect to have the same experience. I just described If you think you deserve more respect than this from your city council members and other City officials, you better start cruising the candidates in a very specific manner about how they plan to be more responsive to little guy. The situation is just another small example in a consistent pattern on the part of civil City demonstrating a casual disrespect for people that is supposed to serve. Is it any wonder that many citizens reach the conclusion of the Cities before. How's it going bald men simply window dressing and as a result drop out and give up on the process. Finally. I just wanted to do with myself and my number is the members of my community. I found that you are you in your office or going to respond to concerns of the Rays not as preciate it. Is Richard? Next we have illenium. I'm leaving Young and I would like to express my support for adus overall and most of the provisions proposed. I particularly appreciate the attempt to use cfar limitation is a bulwark against raising smaller homes to create disproportionately large structures. that said I concur with Marty Kaplan that the the deal seems to need a little work that I didn't understand previously. I am here. However too strongly opposed to removing of the owner occupancy requirement for all of the reasons articulated so far and some which will be coming. I'm sure I see you're creating an environment where properties can be passed on to heirs as a Perpetual income stream regardless of whether they live across the street across town or across the country removing them from the local market for generations and removing pride of ownership at the pride of ownership and sent him to maintain these properties. I would strongly strongly encourage you to reconsider that one provision. Thank you. Brooke Brooke Brooke, you're going to be followed by Greg Hill then Delia floor and then Jessica west rim of increasing our ability to build a mother-in-law's granny Flats backyard Cottages all of that the ability to rent an affordable to live here in Seattle and make a life for ourselves as artists as teachers and nonprofits and more back in 2008. I moved back home to Seattle to work on the Obama campaign. I wasn't making a lot of money and needed to find a place quickly so I could get to work. Luckily a family member had a small basement apartment that I could rent cheaply I knew I could count on this affordable option because years earlier my sister lives in this very same unit after she got out of college when she was just starting out and working a minimum-wage job. Now. I'm home. And once again little basement apartment has been available to help out yet another Family member last fall the house that my mother my late mother and stepfather had rented for over 30 years was scheduled to be redeveloped. My stepfather is on the waitlist for senior apartment, but it could take years for a place to become available. So once again it is that little Adu to the rescue, my father is able to stay in the neighborhood. He has lived in for decades and I get to keep a family member close by this is just one example of how adus provide affordable housing support intergenerational living and help make our neighborhoods welcoming to all kinds of people adus are not a new idea into neighborhood character for decades. Let's build on what we know works by making it possible. For more people to have access bypassing the most flexible least restrictive legislation possible. Thank you. Greg thank you for most families buying a house is our greatest investment. Existing Adu, Dadu ordinance was carefully crafted by the opinions of many people to provide more housing while respecting neighbors and families. It recognizes that contact and scale matters trees Mater Gardens matter. The Proposal recognizes that the majority of families do not want to be contractors and they don't want to be landlords. So the solution is get rid of them. How will having Seattle homes owned by investment portfolios for people who don't live in this state or even in this country? You've never been here and don't plan to visit. How will that make our neighborhood stronger? And how will it create affordable housing is not going to For the past years, we've heard that if you build a dad who you can pay off your current mortgage. Where's the performer for that? It's bologna. This proposal favors the wealthy not families, not the poor. Thank you. Delia Hello, thank you councilman. My name is Delia Flores ain't your council member O'Brien and staff for the thoughtful legislation and for responding to community concern as you will know Seattle's racing social justice initiatives attended to lift up the voices of those most haunted by past actions and policies and using racial Equity to Quick kid has seems to have them form your work my friend and neighbor Ruby Holland has encouraged informed and supportive people across the city at risk of displacement not only in her beloved Central Area neighborhood, but throughout the city as well and she's a advocated for people who choose to stay who wish to remain in their habitat many Seattle homeowners for tickly the elderly and people of color receive weekly or even daily offers to purchase their home by mail phone and in-person. My hope is that the proposed legislation will be a tool for long-time Seattle residents to May remain in their home to provide affordable renters for friends and family. Members who might otherwise be priced out and to counter the trend toward homogeneous neighborhoods unaffordable housing housing and real estate speculation. I hope it provides a preferred affordable housing for young people and families and residents who've Lost Oak not only for homeownership, but even for affordable rental housing. End of a few blocks from Ruby on a block that's zone for both single and multi-family properties. It's a mix of owners and renters long-term rent renters are an asset and contribute much to our neighborhood. They know who lives here. They know the history of the neighborhood in our Collective place in it. They garden and block watch and take care of one another in their homes, whether their apartment or houses just as Property Owners. Do I don't want our Fair City to become only a playground for The Wealthy. My life is Fuller and richer was friends and neighbors that come from a wild cultural and economic demographic. I especially appreciate the new provision concerning floor area ratio is limiting the size of structures in single-family sounds we raised our son in a small mocha sons in a small multifamily property on the same block for 25 years 1200 square feet it was enough for us and it's even enough now when they temporarily moved him as adults. Thank you. Jessica you'll be next in your followed by Peter Ruiz and then Jonathan zegers. Good evening counseling staff. My name is Jessica Wesker. And I'm here to speak as a member of welcoming Wallingford on behalf of edu reform. I'm going to tell you a story tonight about my friend to her housing situation. She needs to remain anonymous. I will call her Victoria Victoria bought her 1939 Craftsman house for the purpose of running transitional housing in her community. She has has the housing unstable people who have suddenly lost their leases people saving up funds for security deposits people leaving live in relationships and people escaping unhealthy or violent housing situations such as domestic violence. They say at Victoria's home rent-free for up to three months giving them some time and space to get stabilized. If you would walk past Victoria's house. You'd never know. You were looking at it independently owned and operated transitional housing to transitional room upstairs into or in the basement East transitional bedroom fully-furnished. There's a community pantry and the rooms are fitted with a mini fridge which helps those who may also be food insecure and it has a small backyard Cottage that's also used for Restaze since its beginning just six years ago. She's been able to assist 47 people experiencing housing insecurity. She's assisted 17 in individuals in 2018 alone, Victoria wants to ride more transitional housing, but she doesn't have the space to provide a parking space her lot of big enough with another open area and even have Plumbing that runs mostly to the backyard, but like many Seattle homes. It's still close to the sidewalk atop a hill, which way is also planning for her future as well. She wants to build a handicap accessible unit. She suffers from chronic health issues and knows that as she ages. She won't be able to navigate her stairs. Tell Victoria. We need to remove the parking requirement allow multiple structures and change. The number of unrelated people allowed to live in the space in the end what we're looking at or impactful yet modest changes to the current policies regarding backyard Cottages in basement apartments with these few changes people like Victoria can continue and expand upon the community Assistance. They already provide. Thank you. Twitter all thanks to the comment on cd11 9544 My name is Peter Reiss architect have been working throat Seattle for more than 30 years. I'm a supporter of accessory dwelling units is a vehicle to provide more and more affordable housing in the context of stable residential neighborhoods most in favor of most of the proposed changes that relates more generous development standards and easier in the requirements for on side parking. I am however strongly opposed to the proposal to eliminate the requirement for owner occupancy of properties developed with a t use my view the elimination of an owner occupancy requirement. Wooden Siri open up all single-family neighborhoods in the city to small-scale multi-family development and it would practice undermine the following policy objectives that we as a city are pursuing first of the issue of equity along with the primary goal of providing more housing building adus has a secondary goal of allowing homeowners to participate in their economic benefits often allowing people who might otherwise be priced out of their homes to stay when the owner occupancy requirement requirement goes away the single-family housing market. Opened up for those entities with access to Capital to further concentrate the ownership of communities in the hands of the few seconds was the goal of building strong neighborhoods neighborhood strength grows over time older residents. Give way to young families newcomers. Bring fresh ideas of longtime residents are free to age in place. When home becomes a 3-unit rental property with an absentee landlord opportunities for new homeowners to move in disappear safe. Neighborhoods rely on strong relationships between neighbors and homeownership is a strong contributor to those relationships. And finally, there's a question of affordability the Turner Center for housing Innovation and Cal Berkeley recently surveyed Adu owners in Portland Vancouver and Seattle and found the resident homeowners who rent out their units at below-market rates approximately 58% of the time and that rental increases are less frequent than in commercially operated housing stock without the requirement for owner occupancy that affordability Advantage would go away in the vagaries of the commercial rental market within Sue closing. I'd like to reiterate my support for most of the proposal legislate most of the proposed legislation. But only if requirement for ongoing owner-occupancy is unambiguously retained. Thank you. Jonathan Jonathan, you're going to be followed by Pat Griffith and then Louisa Miller and for those tracking Jonathan year 14 a Hi, my name is Jonathan. I'm a proponent of a to use and planning on building at 1 in my own home. Thank you for working towards these goals videos are a great thing from many perspectives economic environmental and they helped to create a diverse housing stock reverse housing stock is important in helping to solve some of the problems. We're currently facing. I'm an architect. I work on both multi-family and residential projects. I've lived in here in Seattle for over 10 years my concerns with this spill are the affair restrictions being exposed as part of it. This would effectively cut the development potential of single-family zones of 2/2. That's a drastic change that could have effects on property values and make creative potential inequity larger homes will still be able to be built. You'll just need to be more privilege to own a larger lot or multiple lots to do. So in this way and F are restriction would have more of an impact on owners of smaller typical Lots. We're growing city and we need to be building creative projects that encourage A diversity of Home type for a diversity of Lifestyles many of the single family houses here in Seattle or over a hundred years old and in need of Maintenance and sustainability update the way I see it. There are answers to addressing Seattle's need for home type diversity. But requiring smaller homes won't make that better. It will just make them smaller and less functional for homeowners one solution could be an SAR 0.75 which would limit the largest homes but allow the homes of the average size. They're being built today. If you want to go to your house with an Adu facilitate multi-generational housing or have room to run a small business from home square footage to do it. Personally. My vision for the future is one where homeowners. Can I have an Adu and space for all of those things in an efficient package that doesn't impose our neighbors. Please take more time to consider this essay are restriction and what it would do to our city. Thank you. Hi, my name is Pat Griffith. And I'm a 45 year Seattle resident. We live on Queen Anne in the same house we built at the end of the Boeing depression 44 years ago. I support the concept of adu's but I filled this proposal goes too far and too fast it goes I had has inadequate guarantees of affordability. And it does not guarantee that the units will not be converted to short-term rentals. It encourages investor ownership at the risk of pricing out first time home buyers and families who will build and sustain neighborhoods long-term. You only need to take a drive down MLK or Rainier Avenue and see all the investor wants to buy your home signs. We have the capability now with backyard Cottages, but we do have an issue because I understand about 40% of those are being used for short-term rentals, and those do not help our housing stock. We need housing that people who actually live and work here can afford. Crunch the numbers a little bit because as us someone else earlier said that many home owners aren't necessarily willing to become landlords that we've been landlords before rents Madison, but we understand the the issues that on that something that many families are retirees are not willing to do an 80 year old is likely to cost $200,000 or more and it would include months of construction and inconvenience for both be owners and I and neighbors principal interest taxes maintenance in a reasonable return on investment would bring the monthly rent required for about $2,000. Meaning of tenant would have to have an income of about $70,000 a year. That's more than most teachers daycare workers students artist and non. Profit workers aren't I would urge you to go slow on this proposal work with neighborhoods to achieve a workable and affordable solution. And please don't rush this through before our new council is elected in seated. Thank you, Richard. A Louis Louisa Miller is next starting give you warning on Louise's going to be followed by Angela Compton and then Mark minor. Who is here? Okay, Angela. Sorry, I missed Ira Appleman. Is Ira here? How are you in that and then it'll be Mark object to this lame duck City council's continuing war on single-family neighborhoods, which violates RC w3670 a 07 to requirement that single-family housing be protect previously the council eliminated single-family zoning and urban Villages now Council bill 11954 for incentivizes two additional adus perlot removing parking and setback requirements making single-family. Neighborhoods de facto multi-family neighborhoods. I appreciate the Freudian slip from staff that drafted the summary and fiscal note 4G, which says about the bill quote. The long-term goal is increasing hosing options in single-family zones unquote residence. Pose by having single-family become multifamily without their knowledge or consent then they get hosed Again by being called racist for valuing single-family neighborhoods in 2015. Mary Murray try but fail because of public outcry outcry to eliminate single-family neighborhoods and promised the city wouldn't go there again. I offered the following exhibits to support my view the draft Haller report and letter from co-chairs linked linked to the Seattle Times that claims quote single-family zoning is no longer realistic or sustainable on quot and quot Halla recommends that we abandon the term single-family Zone on quote and the July 29th, 2015 Murray statement that he will not recommend pursuing the house. How are recommendations to change spent single-family zones and finally the article on what happened at that time? Seattle up zoning proposal collapses like the Mariners this city council should not break. The mirror has promised that single-family zones would not be changed as recommended by the house committee and I always wonder why if you think this really has public support rather than the support of a few public interest of public interest of the special interest. Why not have an advisory vote to see what the what people in single-family neighborhoods actually think. Thank you. And Mark, you're going to be followed by Angela Compton and then binge bloodsworth. Have a good evening. I was born and raised in Seattle in the Magnolia neighborhood when I was 25. I married moved Ballarat then to Edmonds. I return to Seattle in 1993. I live by choice in a 10-unit condo in the East Queen Anne neighborhood. What is a neighborhood? Webster defines it as a a section lived in by neighbors usually having a distinct characteristic and be neighborly relationships. Your Adu bill has the section part, right? But the distinct character characteristics and neighborly relationships part is wrong. If you push this bill that unique character of each neighborhood will be destroyed the relationship between vested homeowners. Will it Road as a steady flow of strangers fill every backyard? I choose to live in a multi-family Zone neighborhood the sound of thousands of single-family home owners did not They purchased a home with an expectation of a certain quality of life. Which includes safety Serenity convenience and space space to breathe and Park. These values that they chose will be Stripped Away Death By A Thousand Cuts if you pass this Adu bill. I also find the methodology using cherry-picked computer models to justify Broad and sweeping changes in neighborhood zoning troubling. A rush solution to a complex problem usually does not end. Well, I think this is the case with your Adu bill. If you allow this bill to become a law, your legacy will be a disservice to the citizens. You took an oath to represent. Thank you. I don't see Angela. So I'm going to pass over Angela 2 and we'll go to binge watch worth. followed by Clinton and then Brian Wilson Brian is 18 a for those tracking Where We Are Hello, my name is French Wadsworth have lived in Seattle for 27 years have been a homeowner for 20 of those that I've lived in a rental house in Maple Leaf. The house was originally originally purchased 5 years before its Career College and read it out to help pay his mortgage tenants and to be frank the house looks a lot better than several of the owner occupied houses on the street. However, given that the house is not owner-occupied, we can't empty 11000 square feet in the lot is close to 8900 with a back alley in cottage is about 450 square feet. That was very little impact on the neighbors has plenty of space on the lot for parking no trees. We need to be removed and access off. The alley will make the comings and goings of tenants quite discreet. However, the current owner occupancy requirement is preventing us from using this space as a rental given Seattle's housing crisis and the need for more affordable housing in the desired single-family neighborhoods. It's tragic that we have a vacant home on our property and could you to pass legislation as written get rid of this owner occupancy requirement and let's provide more opportunity and single-family neighborhoods. Thanks. Glen's next Hello, thank you. Cancel. My name is Glenn Dinger. I've lived in Seattle since 1967 over 50 years. I moved here with my then single mother. We lived in a studio in the green lake neighborhood nestled amongst other houses. And since then I've lived in 10 different Seattle neighborhoods including Capitol Hill Queen Anne Ballard Wallingford in the U District. I bought my own single family house in 1993 and Maple Leaf. I've owned it for 26 years, and I'm now one of the longest residence on my block. I know most of my neighbors and most of them know me both owners and renters. I fully support the city's preferred alternative. And most of the people I know which includes my neighbors also support it. The idea that neighborhoods don't want this is just a false narrative pushed by a small vocal minority of folks that want you to believe that they speak for the neighborhoods. For someone like me that hopes to keep my house into retirement. This is a useful tool to help me use. Tell us a jump place by downsizing in place. And I think it's important to recognize that Seattle's history of zoning was built on two pillars one pillar was classism. The other pillar was the automobile industrial complex. I prefer that my elected leaders find other pillars on which to Shapers zoning policy in the city. I've called home since 1967, please vote Yes. Brian you're going to be followed by Jessica rogerio and then Glenmore. Michael Brian this is your legislation now. So I'm going to talk to you. It was simply a measure at Murray's plan to eliminate single-family zoning. Then you called it work force housing and encouraging backyard cottages and then all of these name changes for the same legislation was confusing and made tracking your legislation nearly impossible. I asked you or intention when you receive $1000000 to study and then refuse to spend a dime on completing code required dpd reporting add a new production was that ignorance or intention when you became the council's KY activist environmentalist in 2015. Did you ever think that you would receive more than 600 citizen suggestions on how to make your draft environmental impact statement better? I want to see defended the legality of your Eis and argue neither the merits nor the all-important content of that environmental impact statement to choose whether to consider what to consider you still on the sidelines and was that ignorance or intention focused on increasing pepper housing in transit deficient card ghettos, when you received overwhelmingly more citizen comments, which urged you to keep the owner occupancy requirement for what your legislation removes that requirement and when you refuse to answer your legislation with hundreds of participants at your so-called Community engagement meetings or intention when I was told a multi-family Zone that raise questions about your motivation for this legislation. I was told you bought all three houses next to ears to pop your house from density and development and not raised more questions about Your motivation, but when your household try to block a 5 unit multi family from going in next door to you. I think we all understand your motivation and probably your lack of ignorance on those previous points for Michael Brian next door day dues development and density are good for everyone. But Mike O'Brien, so I invite you and no to this legislation. Thank you friend, Jessica. I shouldn't be here right now. I should be grading undergraduate essays. I should be analyzing data riding up results for praying for my next experiment or otherwise working toward my doctoral degree in cognitive psychology. But alas I'm here I'm here because the owner occupancy requirement on 80 units is threatening my current housing. I'm here because should the owner occupancy requirement on a d unit stand. I may not be able to find appropriate housing I can afford which puts my education and future at risk I shouldn't be here right now, but I'm here to put a face to the renters who is housing restrict who these housing restrictions affect and for the opportunity to stay in my current housing and to keep Fremont a little funky. Thank you. Hi Glenn, Glenmore Glen your 19 a going to be followed by Dee Dee developer. Fry's I wish I could say it is eloquently is our architect friend who spoke earlier about The truck pull the microphone down. Are you? I wish I could speak as eloquently as our architect friend who spoke about the occupy the owner occupation requirement. It was perfect. wormate we're Shepherds of a small portfolio so we could be in the development business if we if we wanted to But it's not a business model that I see is working for us. But from a cost standpoint and an environmental change in the neighborhoods. If as you push to your pencils. And cost out what it what it takes to put together a project. Most people will turn away and that leaves the door completely open. Today LLC development money from out of town and there goes our neighborhoods. But I could be I could be that developer, but I can't. In good conscience do that. To the neighbors that were we're going to impact if we want to have a date date you or a project and four for any homeowner if that's a business model that works for them. Go ahead. I'm fine with the rest of the rest of the but lived live in what you create. My name is mr. Oliver is my name suggests? I make a lot of money by building houses and selling them for help because other developers and I will become significantly more wealthy because of it or not requiring that homes be owner-occupied since that would stop developers from developing your property in addition to requiring order occupancy and to ensure rent stay affordable city council could have required low-interest loans to build an Adu if the rest were kept affordable and not exceeding 5% of your increases what you didn't do that and for that developers. Thank you. You could have written the Adu legislation to limit additional building too attached adus in the same footprint to save trees and open space. We develop Bruce. Thank you for not doing that. So you can now build far more and larger more to self for more money. There's some with all the development that's been going on. There's currently difficulty finding construction workers and housing tradespeople expanding a to use will make finding those work much harder and more expensive developers have the money to hire those workers, but most homeowners don't and for that reason we developers are again. I'm thankful that you don't require home occupied units. It is also will increase the values of houses, which will increase taxes making it harder for lower-income people to stay in their homes because they cannot afford the taxes developers, of course have the money to buy the properties another benefit for Developers. Total benefit for developers South Seattle. Also South Seattle has the highest percentage of people of color and most are very low density. So lot of the development that's going to happen is going to be in South Seattle displacing the people the people of color Who currently live there and for that reason developers also, thank you for doing this Adu legislation. Thank you. Next is Joan welser, Weiser and Colleen McAleer and then Emily Johnson. My name is John wiser, and I'm requesting city council rejects eb-1 19544 is presented because substantial revisions to it are required to properly account for and mitigate detrimental impacts. It would have on the existing single-family stock in the and the Vitality of our single-family neighborhoods fatal flaws and CB-1 19544 are due to inadequate scoping Direction given in the underlying resolution 31609 issued in 2015 and Blaze blatant disregard of Judge Tanner's direction for completing. Annie is with appropriate scope including studying the adverse indirect impacts of the legislation. Resolution 31609 simply directed consideration of strategies to increase the availability of affordable housing in Seattle in her ruling requiring the city of Seattle complete. Annie is on its proposed backyard Cottages initiative judge Tanner directed study of the adverse indirect impacts. The legislation would have on housing and cause displacement of populations that subsequent he is eife is scope was too narrow because it did not consider or offer Mitigation Of The Social and economic impacts that these new larger and more densely built non-owner-occupied dadu's and adus will have on the existing remaining single family housing stock in that neighborhood after the adus and dadu's are constructed. Judge Tanner's Direction was not followed because the impact on the owners of the existing single-family housing stock Who Remain after a Jason and nearby a d u n d a do development was not studied. The city of Seattle has allowed D Adu construction since 2010 and in-law apartments since 1994 consequently Decades of adjacent single-family assessed property valuation records are available available to study and to extrapolate from the city failed to consider any actual resulting economic impacts on adjacent and nearby single family structures remaining from these existing adus and DJ dadu's and did not extrapolate these impacts do to the proposed larger and even more densely constructed adus proposed increase increasing the allowed number of unrelated occupants to 12. Proposed construction of dadu's and a to use on even smaller Lots the proposed elimination of required on site parking for 12 occupants analysis of each of these proposals and the cumulative impacts of these proposals is he's an essential component to a properly scope T is thank you. Good evening in thanks for hearing are around, It's a couple things I've been person with numbers as well to a Seattle has built out and absorb much of its plant growth Target for the growth management act and that's our Mantra. That's what our state requires us to do and gosh we've done it. So here we are now we're tapping into the single-family neighborhoods 2200 households more than 4,000 people last year. We've had on board permitted in built 1070 residential units for about two thousand more folks coming by right adjacent. Our neighbor that scrape. These are located near Transit and there were walkability. Now this proposal would add two or three times as a population into the same pipeline. So last year in our pipelines literally clogged with paper products are sewers were shut down and E. Coli was spilled already into unionbay in the sewer system. Handle, the single family residential pipes for that money new folks. Let alone this is before the ad changes in the regulations LCC has long supported Adams and accessory dwelling units as an option. And we ask that the existing regulations be retained owner-occupancy is number one being a good neighbor and billing neighborhoods require a skin in the game garbage cans noise reasonable app and building relationships with neighbors and violation. You're not going to get a police officer to respond or just too doggone busy and there's not enough of them. So it takes him cornered me on sight couple other things that I should not be increased. It's interesting. That's so just to talk to the developers of homeowners to see if that would be okay with him for Access and finally on for debility. These units will not add to the housing stock. They're expensive to build you have to get Bank loan, and that goes down to the new Farr requirements because if you have to add an accessory dwelling unit, you got to get to bank loans now, and it really is a blockage where people have access to owning a single family property to have to build a main house and and I need to get a bank loan for 5000 square foot lot to make it pay. Thanks for hearing. I am Ali you're next and when you're going to be followed by Adam Kendall and then Mike stockler stackler, Maybe. So I'm here today to speak in favor of a to use and to thank the council but especially you Mike for being stalwarts in the four years. It's taking us to get here. But the truth is this is such a baby step that I'm struggling to feel the enthusiasm that I'd like to feel at the fact that it seems to be on the verge of passing Seattle has a housing crisis. The world has a catastrophic climate crisis does already approving Community devastating ecosystems and killing hundreds of thousands of people every year and it's getting much worse here in Seattle or omissions have been rising in recent years primarily due to driving the fact that some people can't put these two things together and understand that we need to welcome more people into walkable. Urban neighborhoods well-served by transit is a travesty. It's heartless do they think their children will care more about easy parking than they do about stable food systems. Do they think that we shouldn't make room for the children already displaced from drought Parts communities in Central America? Density means that frequent Transit is economically sensible density means that people have carbon footprints that are a quarter to a half of those in the suburbs density means we're committing to being a city that grows and changes and makes room for people and density means we're healthier and that local businesses can Thrive to fight to preserve your neighborhood and Amber is both wrong and self-defeating. So thank you counsel for listening to the overwhelming majority of people who support this baby step. We need bath Lemoore Housing Workforce house at nothing more affordable housing Workforce housing and market-rate housing. This will make Seattle at a modest modestly gentler City and will be a pressure relief valve on a rising Regional Regional Admissions and a rising housing prices when this is done. Let's get the get to the real work every making our city and into the beautiful welcoming Progressive place. We know that it can be young people worldwide are demanding their right to a stable future and we owe it to them to do this as quickly as we can. Thank you. Adam Adam No, one important single family housing is bad land use if I'm correct when you would do the cost of a single family house like half the cost is actually for the Claus Land the property single-family housing crazy urban sprawl and artificial scarcely of land which drives up the cost of language drives up the cost of housing single family housing is bad for climate change. It's bad for a walkable Transit friendly cities and induces driving if the other words dance is New York City, we could support the current population on just one third of this base at the city currently takes up which would make housing way cheaper. Seattle where is dense? As Paris, we could support three times as many people as we currently do on just half the land as today and that would be more walkable and Transit family and with that other half of the city freed up. It could be used for rewilding Parks. We could even return it to the indigenous Aslan reparations abolishing single-family housing along with other D. Gross policies such as abolishing intellectual property surveillance prisons military, please Monopoly the state cars and other things would result in the housing being at least 33% cheaper house care at least 66% cheaper. The overall cost of living would be reduced by up to 80% and Emissions would be reduced by over 90% then in comes with actually go up. So basically why Hairsay there anything that makes City dancer is good. Looks like this is a group will give you five minutes and you guys going to be followed by Zach no stall and then Susan Ahern. I think you cancel. My name is Mike Steckler and I'm here with my son Michael Junior and my daughter Alexandra and we call her cupcake and I'd like to talk about affordable housing and affordable home ownership in Seattle at but I want to talk about my own personal story first when I was 25. I I got out of college and I I was ready to start my life and I want to buy a home. So at the time I just met with a realtor looked at a few houses made an offer in a month later. I was mowing my own lawn and washing my own windows and talking to my neighbors and getting involved in my community. As time went on I met and eventually married my wife and we decided to put our two houses together and buy one house that we always wanted. It was a house in the Wedgewood area. We ended up. I'm sorry. We there Wedgwood house is actually on a plot of land that actually used to be a giant Orchard and in the twenties with all the people moving into Seattle that Orchard was divided into a building Lots in our home was put on one of those lots. We had our children in that home. We raise them in that home. They all went off to college and came back to Seattle and got terrific jobs in the city. They love. And then they moved back home. They want to be home owners, but the cost in Seattle is too high. When the kids were small we bought a little rental house down the street. It's a modest little two-story house with an attached garage on a corner lot and a big backyard with this legislation. We could build another small modest two-story house with a detached garage in the backyard and we'd like to sell that house to our kids. with the mommy daddy discount and then they could be homeowners. And and if we wanted to see our kids we could just walk down the street. We wouldn't have to get in the car and drive across town and all the traffic and we wouldn't have to get on the freeway and drive to another city a city that they might be able to afford to buy a house in and the worst thing would be that. We would avoid seeing our kids or are potential grandchildren. Because it's an inconvenience. So I urge the council to pass this proposal for dadu's and and I especially want to thank Michael Brian for proposing us and seeing it through. Thanks, Mike. Thanks, Mike. Zack group in Austell own a home with my wife and Rainier Beach and I urge the council to adopt the least restrictive ATU legislation possible. It'll help us address our housing shortage. It'll mean that fewer of my friends and neighbors will be priced out of the city and I won't be able to see them as much I don't like that. It also helped us fight climate change personally. I really want to build a backyard Cottage myself. It'll mean one that I can run down. But if this legislation passes particularly with the lower parking requirements the lot coverage change and the increase in square footage. It'll mean that on my property I could build an ADA accessible unit which would mean in the future once my parents or maybe my in-laws get to the point that they need to be in a Assisted Care Facility, they could live with us and Asian place and I think it'd be really cool to have in multigenerational household, which is not currently possible. I'll pass it to Danielle. My name is Daniel Wallace Southwest Seattle. I'm here to support the changes in legislation because I believe it is one crucial step in addressing our housing affordability Crisis Center City. It's one small step of many more that we need. I think it's no accident that at the same time in our city. You were seeing skyrocketing housing prices were also seeing an increase and then our neighbors becoming homeless and in a City built on land use policy. If you have much to do to counteract these money in justices, I personally am fortunate to live in own and a 770 square foot house and I am Call that these datu changes and ATU changes might enable me to. Build an Adu or did you in our garage to house my parents one day or potentially contribute to the affordable housing stock in our city? the proposed changes allow access to neighbors who wouldn't otherwise have access to my neighborhood. They would have access to better for Transit used to watch that walkable resources and Community running heard you to support this legislation with minimal changes and especially consider further legislation. Angel Ringgold, I live in 770 square foot house as well and district one but it's legislation is great for my family and for the flexibility that we need a different stages of Our Lives to continue to live in this house to continue to live in this as a part of this community and expand it to welcome or neighbors to our home and into our neighborhood overall, You know, I'd also like to specifically address the owner-occupied amendment potentially, you know, we have a Neighbor Next Door who lives in another 770 square foot home is a great neighbor. Is that a small family? I'm thrilled to have them looking over our house when we're gone quite frankly. I probably take better care of the yard than I do, but I'll let you know. I'll be okay with that. He's a renter and I'm glad that no one put it on her occupied requirement on his single-family home. I think we should not do the same with with Adu legislation. I think is very important that However, we get units the city needs more homes again. I come back to the homelessness crisis and there are a lot of claims that wheezes. If you aren't doing enough to handle that, you know, there are a lot of causes of homelessness and homelessness requires our Humanity in our compassion, but basically homelessness is not enough homes. This legislation would add more homes. It's a drop in the bucket. It's not as much as we need, but it's a step in the right direction, and I encourage you to pass it with minimal restrictions. Thank you. Thank you all. I just want to clarify that there has not been an owner occupied unit Amendment proposed the amendment that proposes an ownership Amendment. So the requirement for the property to have been in ownership for a year before the development of a second a second unit. There is not a requirement for the owner to live on-site in the in that Amendment. Obviously, there are other folks that are asking for unoccupied today to those. Are we we know there's no plan amendment that I'm aware of. Susan is going to be followed by Carrie Bogner and then Christine Hanna Susan your 23A. So if you're tracking longer numbers, that's where we are. Thank you. Thank you Cheri O'Brien council members. There is no question that we need to increase density in the city providing more housing and more affordable housing. Hence. The city's recent up zoning and enlargement of urban Villages for the last 10 years. Backyard Cottages have also been allowed on most locks the city's proposed legislation following the appeal at the adequacy of the environmental impact statement raises many extremely troubling concerns first and foremost the wholesale elimination of every single family neighborhood in Seattle, one of the most attractive features of this beautiful city, and I have lived throughout the United States. We have many varied and distinctive neighborhoods beautiful neighborhood the deputy hearing examiner and her decision regarding the appeal at the adequacy of the Eis throat. And I quote given the groundbreaking nature of some of the features of the proposed legislation. It is impossible to know whether none some or all of the ill-effects claimed by appellant will come to pass yikes. Should we simply proceed on Blind Faith? I think no other city has ever attempted making such sweeping policy changes. We should be wary without a complete thorough in-depth study of all the potential impacts associated with zoning tripling densities and the elimination of every single family neighborhood. This proposed legislation with which threatens to turn the city of Seattle on it and permanently altering. Neighborhoods should not be made by a lame duck city council over summer vacation. We as Citizens deserve better accountability and stewardship. Let's be smart creative and not act impulsively suddenly turning Seattle homes into rentals and displacing families who want yards. Thank you. I am Cary Booker. Thank you so much for this hearing. I've lived there for 25 years. I have a 1985 house. It's way too big for me about four years ago. We put an Adu Uniden because we saw their taxes increasing and we wanted to stay where we were four years ago that ATU which we rent below-market. We've had the same people in who are multiracial for the last four years and years ago. They are expenses today at 60% or taxes have gone up so much. We would like to retire in place. And so having a second will help a student and we would we want to stay you want to stay in Seattle and if we can't do this, we'll have to move. So thank you for the opportunity to speak and thanks for this legislation or whatever you call it. What college station? Thank you. Christine Christine, you're going to be followed by Matt Hutchins and then Andy Katz. Hi, buddy. Thanks very much. My name is Christine Hannah and I'm here in support of the proposed legislation may be other folks that talks about the environment on social justice and affordability reasons character reasons for this legislation focus on personal reasons for me. My husband I bought our 1908 home in Ballard in 2002 and it's got 1400 square feet of living space in a 7 on the square foot basement and me. To Korean Boys in our in our needs space have increased and the substation will allow us to provide flexibility to cyberspace needs her family when we need it and when are kids leave for college or otherwise fly the coop? Abilityfirst rent that space which valve is pay for their college education save for retirement and pay for the inevitable medical bills that will come with aging on that note. Whichever you would like to do that in place. I'm not know between my husband died. We have four sets of parents thanks to divorce. We fully expect that one or more of them who vary in age from 7284 and mostly live in other parts of the country. They will they will need our care when we are when that time comes we would like them to because we'd like to be close to them. I need to go to Seattle and we would like our children and their grandparents really know each other. They really can't afford to buy a place here or to move into an assisted living Place. Some of them can't and we know that really the only option is for them to live with us until we need the flexibility of this proposal would make possible. We lucky we bought our house at a time when it was relatively affordable, but our little place is now so expensive but despite that our household income is over $100,000 a year. We could not buy the house that we live in today and I think about the mini 30 Say something so I work with and how the idea it would like to buy home. They would like to raise a family here. There is no way that they can possibly do that. It's so far out of reach it seems impossible. So I really strongly disagree with this legislation would push them out. I think that the effect may be the opposite because the only way a middle-class family can afford to buy a home in Seattle's if they have the option of renting additional space that that may be possible with this legislation. I know that we would happily write an Adu or better cars to a stable long-term renter. If we didn't need the space ourselves and the possibility the legislation could increase the diversity in our neighborhoods would be a hugely valuable contribution to the Future Seattle. So thank you for bringing this legislation to this point. We've been waiting for three years to see it happen. I hope something like this can happen very quickly. restaurants line I'm at Hutchins. I'm an architect and member of the housing task force and also organized with more options for accessory residences. Although I am a dad my kind of got into a housing advocacy because I wanted to have a place for my daughter when she was born to grow up and be able to live in the neighborhood that we love when this process started. She was a toddler and she is now in first for first grade. So I hope that we can move fast on these issues so that we might be able to build a place before she's in college. You know often times we've heard that this is some sort of a one-size-fits-all a proposal but it's an architect who designed many of these I can tell you that there is no one size eight one of these ends up being highly customized to at sight and response the owner and what the other wants and say no to her ever liked and so we see long ones. We see one's a jog around trees. All these things are really really important to homeowners when they're doing a sort of DIY development for the housing that they want to provide for their family or friends for rental and I so I would like to encourage you guys to make sure that we're preserving as much flexibility in this legislation. I'd like to also see the regional Institute of bad on short term rental because that's actually one of the most important ways that people start to finance these it's kind of one leg of the three-legged stool between long-term rentals short-term rental and and family and friends so, Don't get rid of that because it's it's key to the biggest difficulty is financing. So I just wanted to make sure that we're focused on just providing more homes for people for our neighbors. Thanks. It's not. Tell any early next you going to be followed by Mike Hendrickson, and then Jesse Simpson has been but this is terrific ordinance thinks. It's a long time coming. It's a great start on filling in missing middle housing. I can't stop the Feelin James Duggan's family story there. Also. I'm a renter in District 3 on First Hill. I have a mom who is in a single-family home. She's in her seventies and there's would have been a race against her mobility issues to figure out a living Arrangement where she can be close to family have her independence. Maintain her ability to get around with potentially bad knees and declining driving skills, and an Adu ddu option would be tremendous of the family are the several times tonight. It's not a new story. So it's been a long night. There's lots of posters to want to talk. Thank you for your time. Have a great night. Mike hello. Thank you for allowing me to speak and thank you council member O'Brien for spearheading this I don't agree with you on everything and I've seen your reputation sullied. This evening. I want to thank you for spearheading this. I am a realtor and a day do owner. I I my partner live in Maple Leaf. Thank U council member patchell and And this is this proposal is something I strongly support without Amendment. Housing is very complex in Seattle today. And in response to many of the things that I've heard heard this evening. I'm changing what I'm going to speak about because I seen this from all angles. We sold houses to Developers. We sold houses to individuals who have purchased purchased the home just to build date our first tenant in our day do bought a home and decided to build a day do and then we we sold the house. It didn't go to a developer. It went to a family with aging parents who they wanted near buy them clothes last month. This is the reality of this individuals making their decisions about their housing and it's good. We would like to Asian place in our home. And so we've created additional space that we would hope to eventually permit as a third livable space rental space on our property. Our intent is not to be absentee landlords that give wealthy at the expense of someone who would maybe want this house it is to age in place and to be able to afford and stay in this city. I thank you for this. I support this please pass this ordinance. Jessie going to be next to give me followed by Claudia Bach and then Barbara Quinn. My name is Jesse Simpson and I volunteer with Capitol Hill Renner initiative and show the cities I grew up in West Seattle and now runs on Capitol Hill all too often. I hear from friends and strangers alike that they can't afford to live in Seattle. They don't feel like the city is for that many more sales in the midst of a housing affordability crisis, and we need to do everything we can create more homes in the city. I support Adu form for they will produce thousands of desperately needed to homes though. Obviously, it alone is insufficient to meet the to address. This crisis has provide options for more people to live in our residential neighborhoods. They help seniors Asian place, they help with inner generational living with his heart all these great stories tonight. And if the financing is done, right they can even open up opportunities for low-income homeowners to remain in their communities by renting out space or even condominium eyes and selling it off. I ordered you to pass the SAT reform as is and Max. That's the number of homes we can create. Thank you. I thank you council members for the chance to speak with you tonight and for all your attention to affordable housing in our city. My name is Claudia Bach and my husband and I have lived in our home in Ballard Crown Hill since 1989 racing are now grown children and modest 1918 house. I'm here to share my story and a sense of urgency that you pass this legislation as the cost of Seattle Housing has skyrocketed. We've looked towards finding a way for our school teacher daughter and her musician husband to stay in Seattle and a way for us to age in place are detached garage is in serious need of repair and Our intention has been that that effort would be joined with the construction of a da do with the plan that we would move into the dado and our children would move into the house are our hope is to find a way to keep the house as an intergenerational family asset downsize. Appropriately preserve the character of our neighborhood and locked into creating a backyard Cottage with renovation of the garage and building in a way that's attentive to the to an existing very large cherry tree and to our neighbors being fully respectful of those things. We've been trying to move forward on this for more than three years now stymied by the strange restrictions of the current zoning that have made building a small but reasonably sized backyard Cottage connected in some way to the garage. It's been virtually impossible to do so. The delays in finalizing Adu legislation are particularly challenging for us as we are dealing with a reoccurrence of cancer for my husband each time a decision, and this legislation is delayed. We are filled with increased frustration because a critical component in making this construction affordable for us is that we use his experience in construction to control costs. We are in a Race Against Time since his cancer is now terminal and I'm sure we are not the only people in our city face of a variety of challenging life situations where delays are more than an inconvenience. We need your help now, please I urge you to pass common-sense reforms that will let us move ahead and provide more abundant and affordable housing in our city. Thank you. Barbara Harbor you going to be followed by Paul Chapman and then Patrick Taylor and then Ryan Rosenberg. Brian is 28 be good evening. I'm Barbara Quinn. I'm representing here tonight University Park Community Club. I have I am actually a fourth-generation Seattle light but have lived in my own home in the University District for 43 years. I am speaking only on a subjective owner-occupancy and I'm here to tell you about boots-on-the-ground experiences with developers buying and managing properties in the U District versus computer model kind of tea is interpretation we have Experienced developers constantly wanting to buy our homes. I get offers from real estate people with interested clients. Sometimes those offers even have an earnest money attached to them when I get them in the mail. We have also experienced. Developers coming in even with strawberries saying this is a family and then it turns out it's not a family. It's been very difficult for us to live with abs and see absentee landlord people in general we of course have the University of Washington is a total source of rental income day or night and all year round so that maybe more of a problem for us than other neighborhoods in the area, but they will often come in chop ounces into small units. It's very difficult to get the city to enforce their own zoning at this point leaving us skeptical of the city's ability to do that with developer ownership people who are going to build and then move away to who-knows-where. We've experienced vandalism. Late night party noise trash and even one incident of a gunshot wound at a party in our neighborhood last year these these are things that would never occur with owner-occupied. Somebody living on the property and one of the units we don't really care which but somebody who's their boots on the ground making sure that the neighborhood still stays livable. The other thing is that often the developers come in and out bed young families who would be our neighbors in the neighborhood and increasingly to on a good note. These houses do have accessory dwelling units in the house. Isn't it provides a way for these young families to be able to afford housing that they otherwise would so there's a lot of good things about 80 elders and Daddy was and so on but really really they've got to be one unit occupied by the owner. Hi, I'm Paul. I live in Wallingford. You looking into the face of the so-called evil. Rich developer Tech trash. I'm building an Adu right now so I can walk him or neighbors into Wallingford of the rent that I will likely lose me money one day. I like to build a backyard Cottage so that I can move in there or have my children move in there. I'm all in on the SAT reform. Unfortunately, will Vancouver spend just for months to expand housing from 3 units per single-family lots of 4 units a vocal minority of delayed this much-needed reform by for years. So thank you the council and thank you, especially to make a brine for surviving kind of the Seattle process and driving for this important legislation. It's now time to pass this reform. I encourage Council to reject to reject amendments that make it harder to build a to use. Thank you Mike for considering amendments that would help educate landlords and requirements. This will help us new landlords do the right thing. Please reject council member Harold parking proposal will prevent housing from being built. Please reject restrictions on short-term rentals. These will prevent new housing. We already have adequate restrictions on short-term rentals in addition. I encourage Council to consider now or the near future additional changes would make it easier to build a t use including reducing permit fees and delays is coffee thousands of dollars to permit myadu versus would have cost me to build a man cave with a wet bar consider removing sewage hookup fees for Cottages as it had thousands of dollars to the cost consider options to use financing consider removing Dex from lot coverage limits. Let's do the small step in the right direction so we can get on to read legalizing for floors and corner stores across the city. Thank you. Patrick Taylor Patrick here Rosenberg Why are you here? Okay moving along see Karen Gibson. Chad Miller Kai Chad's coming. I'll call a few more Mark fultz Don. John Bunnell and then Justin Allegro Good evening, My name is Chad Miller and I own a home in Madison Valley. I currently live with my partner in a home in Mount like I support the resolution is written in the early nineties. I moved to Seattle after I was on us on early discharge are honorably discharged from the Navy and the time I was solidly in the lower end of the economic spectrum of his wealthy City. I read it on Queen Anne for 12 years and a grandfathered home that have been converted to three apartments. That was not owner-occupied this type of housing provided me a comfortable home for 12 years, which I use the GI bill to attend Seattle Central Community College University of Washington and work for a long time before my first home I search to find and purchase a home in Madison Valley with an Adu to support my housing costs and also provide the opportunity. I had received earlier in life to a diverse group that could enrich my neighborhood and enrich my life over the years. I've run into artists too many racially diverse people a few years ago. I met a wonderful partner and we moved into her home and now I'm left with a home that I can only legally have fill this leaves me with the option to sell the home as is remodel it. Two more financially attractive megahome for me to sell or to continue to personally lose money all of these options reduce the opportunity to adding more diversity my city 75% Seattle is currently zoned single-family. This is economically unattainable by the first people. I want to be included as my neighbors. Once again, please pass. The resolution is written and please continue to include the owner-occupied exception. We need to we need the Full House and practice legislation legislation will provide. Thank you. Thank you chef. Clark mark Hello councilmembers. I Mark fultz I am a homeowner and a founding member of welcoming Wallingford. I speaking in support of the accessory homes legislation that legalizes more homes across the city great neighborhood. I moved here with my family in 2008. But the cost of a home in my neighborhood is prohibitive because the only zoning only allows expensive old homes to be torn down and replaced by even by larger and even more exorbitant ones this keeps people without well from being able to live here instead. We should be keeping the homes we have and allowing all kinds of new homes in my neighborhood and neighborhoods across the city. Here's a picture of what my house looks like. It used to be a duplex. There's a shed in the back that could easily be replaced for the backyard Cottage or maybe a block house that would allow another family to live in my neighborhood or only one is allowed down. I would be willing to return to get below-market-rate especially with incentives or help with permitting and things like that. I think this would be a really cheap and effective way to generate more affordable housing across the city accessory homes are great because they allow more families to live in high opportunity neighborhoods, like Wallingford near Parks schools and where they work their families to live alongside their kids. We've heard lots of stories about that earlier or parents and those who own their homes can afford to stay in Seattle by generating income from their investment as we've seen in Los Angeles and Vancouver. There's a large amount of pent-up demand for accessory homes. I asked you to pass legislation that allows as many accessory home soon as possible to be bailed so we can all benefit sooner. Thank you for your time. And especially thank you counsel number O'Brien and your staff for for seeing this legislation through. Thank you. I accidentally skipped over Greg. What actress Greg here? Alright, then we go to I'm done. Justin all right, I'm hanging 1 second Justin. We just read a few more names off since it looks like people are finding out a little bit Jovan Sherry Newbold Danielle Wallace and Andy fessler faysal. Thank you. My name is Justin Allegro. I'm from upper Queen Anne and I'm here to offer my strong support for this legislation and thank you for your leadership and moving it forward and I believe you all know the merits of this legislation as well as I do so, maybe I'll just tell my story my father-in-law died in 2011 and he left my wife a trust used it to buy a single family home near Caldwell Elementary School for kids and though we make this a little more than an area median income between the two of us. We do not have a mortgage. We bought that straight up doing nothing but resting on that intergenerational privilege, my home is now valued at 1.3 million dollars in no way is every long-term home owner or renter in this city a similar beneficiary of intergenerational wealth as I am when power and privilege keeps and play status quo political benefit people like me are the only folks will see accessing our housing stock in the future. Single-family home owner 2 miles from downtown welcome dramatic zoning changes to incentivize more housing Supply in Creedmoor rental opportunities in my backyard. I don't care who owns a home I care about all my current and future neighbors including the 50% of my neighbors who rent this is not a dramatic proposal and the least we can do. It's just the least we can do as the current ATU policy is not sufficiently providing housing. I'm asking that you disincentivize teardowns and remove requirements for owner occupation, and I really appreciate the hard work over the last 4 years that are you all done. I'm to go to sport. So, thank you. All right Sherry. Cherry then Joe then and even Danielle. Hello everyone, and thanks for staying with us this evening and allowing us to speak. My name is Sherry Newbold and I just like to share three really quick stories this evening first. I'm a homeowner in Greenwood and I have a dad do at my house and I love it and I've rented it out long-term to someone for the past over for years. I would also love to add an Adu to the basement of my home. We have a small home, but we don't need all of that space. Secondly, I have the fortune. I'm very fortunate that I own a small rental house in West Seattle and it's about 700 square feet and is at the back of an 8000 square foot lot, and I'd really like to be able to convert that house to add a do and add a modest house at near the front of the lot possibly with an Adu attached to it if I could afford it. Which would double or triple the amount of housing on that particular lot? Bird I'm a residential architect that has designed / 2080 using dadu's can tell you from first-hand experience that all of the proposed changes are very much needed to make the is more easy for people to build and less expensive. Many people including myself have been waiting this long slog. For this legislation to pass so that we can move forward incrementally adding housing to our city. Just think I could add two or possibly three units myself. Please pass this legislation as written and make it as easy as possible for people to add a TV using dadu's. Thanks. Joe Right, Andy. Danielle Hi, my name is Andy Cecil. I'm a homeowner in Queen Anne and this issue is difficult. But it's also really important and it in my particular case. I was happily retired in Napa California. Three years ago drinking wine at the taking wine making classes at the community college. My daughter called you this year in Seattle and says I need you and Dad for this family stuff. Well what parent could resist so we started looking for homes up here in Seattle and didn't know where the kids are going to live there rent on Queen Anne where they going to leave work. We live I talk to catch her cheating from our coming to the city that we saw house with a daddy behind. So we look for another year on the west side of the hills. If you try to sqft lot there's a really old thousand square foot house there that you wouldn't want to live in and there's plenty of room for the dad in the backyard. So it plan to build a second story. Kids could live there raise their family we could live in the daddy and we spent six months with architect submitted plans April of 2018 with sdci and we're still waiting for approval from the worst year plus in my life, but that's probably for another hearing the issue. Is that for this. We tried to design it with 800 square feet. You can't live in a tenement square feet. The other 200 square feet would allow us to have a second bedroom. My daughter could come visit friends come to visit. My wife could have a place to do her quilting. The issue is I don't want to park a car in the front of my dad have flowers in a garden on our streets on the westside of Queen and there's plenty roof of car is actually the neighbors want more cars because we're always sends all kinds of cars and trucks across the Hill Park cars on both sides of the street tropical slow down. You know, let's let's use our let's use our streets for parking at work for the other issues. I sold my car and take Works great for me. If you can't give me space in the house. Give me some height like you having this room. I live in a small space. Let it be high. But let me just quickly to some of the concerns about this from those who live on Queen Anne Investments are home. I understand their concern anything for them. Did Aaron doughton dolls for the house? I had to outbid developers. They couldn't go that Hadid to make a lot of money from your investment. So then I spent another $200,000 in renovations got another million plus a million dollar investment. I know I saw signs you can do that is for 250000. You probably can but in our neighborhood if you want to match the house, you want a Counterpoint the neighborhood you spend a lot of money and it's going to be a nice place to live next to all of our neighbors are really supportive. I don't have that kind of money. I'm going back to college now Seattle Community College Study program. My daughter-in-law are also going to buy in she's a nurse practitioner work 12-hour shifts in pill Hill her husband toils in the hallways in one of the major corporations here in the city and you know, they're going to take the $5 plus loan if they weren't doing that that you're buying a house in Bremerton. Where is that? This gives him a chance to buy into the City and later. I tell my daughter dad who stands for Dad and you so let's make that come true. Thank you, Mike. Thank you councilman. Alright, thanks. You stuck it out where they start lots of names to make sure we get through so many folks who left Danielle. Whitney Whitney I see when he's coming so Joseph. And then Alicia Ruiz David Lawson Summer Hansen. We are up to number 36 Whitney Wright Whitney Rearick. Hi, I wanted to talk a little bit about the homeowner perspective but it is slightly different way. I have a partner and he is one of those dreaded Tech dudes. We're really fortunate to buy a house in a neighborhood that we really like. We been renting there and he bought a house last year and he would really like to build a daddy you in the backyard but because of regulations because we've got an apartment in the basement. We can't here's a guy who's got he's finally making some good money being a tech dude, and he wants to do the right thing. He wants to be a landlord and I think his vision is to you know have basically three units in our single-family Zone and then we go someplace else and maybe do the same thing and then we would be developers. I guess. I don't know and I guess I keep hearing these people demonize developers all the people. I kind of wonder who built their houses in the first place, but Anyway, we keep hearing about how evil developers are. Well, let's figure out a pathway to help people do the right thing and build more housing and more modest housing and affordable housing for me. This is the way to do it. So I encourage you to add maximum flexibility here resist the urge to require a parking requirement. I live in this neighborhood that has lots of apartment building springing up on the arterioles nearby. I can still park my car for free on the street. It really isn't a problem. I reassure you. And just on that note to since I'm wondering I might as well add that I don't think it's fair that we keep putting renters on the arterioles. I think that we need to allow our renters low income people to live in a single-family zones. What would you be most County zones I suppose but live in areas that the rest of us do I think Brenda should be a little walk out and help me garden, maybe play with my dog with me and not have to live on a big Speedy arterial. Thank you. Joseph Alicia are you Lisa jump right in there? If we miss someone you can just come in and out door, but I'll keep reading names off of King and Snohomish County adus provide an affordable family friend in housing solution that can be easily build an existing neighborhoods. They are also a great tool to stop displacement as owners and renters realized Financial incentives to stay in their Community used to create the greatest positive impact on a community. It is essential that there are no owner occupancy or parking requirements as an example California's recent AG reform did the way with these requirements and it led to a 30. Increase in a deer permits. So it's very promising and we thank you count remember O'Brien for leadership on this issue. We support this we do have some we have room for discussion on the far acquirements, but we will provide those in a letter. Council members that is forthcoming. Thank you. David Lawson summer Henson Alright summer you be followed by Cynthia Johnson and Janice Brown. I think Call Affordable and diverse housing in Seattle. And it's a great way to make effective use of the space that we have here in the city. I think the proposed amendments are a great start to make it easier for young people like me to to afford living in Seattle beautiful neighborhoods. And I urge you to consider the addition of allowing. Tiny houses on wheels in backyards as well. My name is Summer Hansen and I'm a small business owner. I have a community-focused shop in Ballard, which encourages the Sanibel living and I live in Fremont with my boyfriend Michael Works in construction to help our city grow. I'm very passionate about sustainable living and see I love living in a density because it allows me to use public transportation. But right now my income doesn't cost that doesn't cover my cost of living and I feel like I'm throwing money down the drain by renting not to mention our rent is increasing substantially each year. I want to be financially stable and able to invest in my own home like the generation before me. I want to be able to comfortably commute to my place of work we heard about this public hearing today because the two of us spent the afternoon at the Seattle Department of construction and inspections trying to figure out how to make our dreams come true. We want to build a tiny house on Wheels as a creative project and an investment in a more stable future. We can't afford to buy a house. We can't afford to buy a house because of the land prices in Seattle and this would be an option for us to own a home without necessarily owning land. It also would be a really great way to offer an easy and quick way to make income for homeowners who won't necessarily have the energy that we have to build an extra home. So I urge you to consider this and thank you so much for all of your hard work. Cynthia or Janice Hi, thank you for this opportunity to speak to you. It's great that we have these new. I do have some reservations so about not having the landowner responsible the homeowner being involved. I lived in the u-district in the 70s fights on the street as the woman said before and I think Unless you have boots on the ground you're going to lose that and I think that it's fine to have a d used to use increase the density in the flexibility, but we have to change that. The last thing I'd like to say is since we're going to allow the mcmansions to keep going for another 6 months. I think this issue should wait until there's a little bit more input a Seattle City The Seattle Times did say that we should wait until the lame-duck city council is out. So I think we're maybe going too fast, and I think there should be some minutes to this proposal. Thank you. Janice since you're going to be followed by when I read up some more names here. We're up to 37 38 Michael Camp. I also Olson Francis Costigan Charles Costigan Shane Nesbitt and Pat fell. Go ahead busy night and Janice Brown and I am a condo owner. I live in Russia. I've lived there for 16 years. I'm in Northwest Native grew up. I've also lived in Southern California and some of the things that I'd like to touch on I have to do with more of a macro view when I first moved back here 25 years ago to take care of an ill mother the growth management act to just been incorporated into our area and that was to contain the growth in the suburban sprawl what's happened with that now is that all of the people that moved I sold been kind of developments for many many years. I'm a real estate broker. And now we have people that have moved to suburbs who want to come back into our city. That's exciting. The kids are grown. They're off to college. Let's go have fun in the city and our sister city across the lake doesn't have much of a nightlife. So there is there isn't an enticement with as good as we've gotten as a city and I was here when the last of the people turn out the lights and it was not a fun time and change happens constantly. Nothing ever stays the same and when people complain to me about change and growth I say compare it to Detroit and you nothing is Flatline you later go up or down and I think you'd much rather be on an upward trend for the a DUI highly recommended the people that are worried about developers coming in. I promise you there's not enough money to collect enough little Adu spots to make anything there no roots that are going to come in and invest in this kind of thing. It's going to be great for people that want to have someone to age in place. We have two story houses where people have mobility issues. It's perfect to build way to put a relative on a one-level place to Asian place because no one wants to go into assisted living. Thank you. Michael Elsa Francis or Frances Father Charles Shane had fell Alex Preston Bonnie Williams and Richard Ellison, Dr. Get ready. Thank you for the opportunity to talk to encourage affordable you talk from personal experience, very recent at ages 34 + 37 my partner and I are far from able to afford to buy a house in Seattle, but just about a week ago. We moved into a backyard Cottage and Victory Heights has been life-changing inexpensive studio apartment in the heart of Capitol Hill seeing a quieter a healthier lifestyle. Hoping to also save some money. We are now paying less for rent for a much. Air quality of life living in a much more energy efficient space built from largely repurposed materials where we can grow a garden as safely bike and walk to stores and Recreation. I'm just a block away. What's the square footage of small the high ceilings and windows at your cottage and allows for a lost for storage space living in a small are peaceful space means we accumulate less than allows live simply and spend our money time and energy and other Mormon. Afraid of I know there are many people my age who do not have the option to buy in Seattle are facing skyrocketing rents and less than desirable living situations and would embrace the opportunity rather than move outside of the city and Moore housing your Transit and more small housing options are critical during dual housing and climate emergencies. So I proposed amendments to remove barriers construction and allow more people to stay in Seattle contributing to its vibrancy and resiliency. Thank you. Charles Alex How far did they get Bonnie? Hello, my name is Alex Preston. I am a renter and a service industry worker in North Seattle and I'm through today in support of environmentally responsible land use policy that will promote Saint next income neighborhoods in all corners of our city legislation being discussed today will bring the city closer to meeting its housing and sustainability goals as we Face parallel affordability and climate emergencies. We know that keeping so much land is don't strictly for detached single-family. Lots only is very costly from a carbon footprint standpoint. And it is also exclusionary by Nature. The city's Planning Commission has reported that more flexible zoning., dates of variety of living situations is critical point for keeping folks in place in our communities as well as it is necessary to help mitigate the enduring impacts of historical racist land use policy decisions moving barriers to residential infill strategies. Will allow more people to live close to jobs cultural manatees and small businesses, and it will improve the city's walkability and in particular eliminating requirements for vehicle parking will ship priority away from vehicle storage and toward livable well-connected communities, and so as someone who would like to call Seattle home for many years to come and someone who would like more neighbors with a variety of backgrounds. I hope that the council will adopt the video format supposed. Thank you. Thank you. Richard A. Bonnie Thanks for your endurance tonight. Anyway, I am not supporting the legislation. I do support the current code. I think it's been crafted very carefully. I know that there are some barriers that people would like those barriers to go away parking is probably one of them, but I want to bring up the FBI is because in the FBI is the parking study as I understand it was only done 5 miles away from the core of downtown Seattle so that I don't think all neighborhoods are the same and I think that anything close to the core is going to be more overwhelmed with additional parking waivers or or the requirement eliminated. So I think that people need to understand that are 5 miles from the court can impact neighborhoods quite a bit. We in Wallingford have a lot of overflow from UW and Are peas easy to handle some of it but not all of it. And as we continue with mha apartment buildings, they're allowing. No parking in a we get more and more we get light rail, but still, where is it going to end, you know, and we have to have some kind of plan other than it's all going to work out fine. So I also I have seen some cute backyard Cottages. I mean well designed and I to me a cottage at 800 square feet is a cottage when you start doing two story a thousand square feet. I'm sorry to me that's not, you know, bring the Mother-in-law in or a child or whatever. They're really banished to families. I get that the affordability aspect is highly exaggerated and it's not that you can't get into a neighborhood like Wallingford because there are duplexes and smaller part buildings all over the place. I'm surrounded by them. I think that you need to remember That neighborhoods with mha on March 18th opened up 69000 additional capacity in Wallingford 700 single family homes were eliminated. They were converted to low rise. Why can't I'm not as I understand your legislation, it's City why I don't think I'll single-family home owners want to be landlords want to pay higher taxes for that increase capacity or have the 2500 square-foot restriction, which also restricts a remodel of a home of an older home. So those are things that I really objected to I think the coach should be kept as it is without you know, there's a way to put Cottages experimentally maybe into the urban villages with all this increase capacity. The single-family zones went away their RSL their low-rise 12 people to a lot to me that's multifamily and that's where it belongs. Okay. Thanks. Let's see Richard. Going to go beyond that. Oh, I skipped over you saying I'm sorry. And then Angela I see you're called you about an hour ago, but you can get enough to Shane and then so after Shane, let's see if there's a Richard Allison Joy brothers real brothers, maybe J plaza near Brittany Bullock David morang and John Duff. Thank you for having us today. I'm just here to say I'm in support of the day 208 legislation. I've been trying for three years to build one on my garage the garage interior or square footage counting for the overall Dadu square footage ice timing me in that time construction costs have gone up significantly. I'm fine though doing the due diligence. I've done here. I do want to say that there's a lot of daddies in my neighborhood and those people are so my favorite people in the neighborhood. So thanks for sticking out chain. Hello, I'm Richard Ellison. I've spoken about trees before and I'll speak about trees again, Everett and Seattle. Gro dancer and still save a streak canopy. Why should we save the tree canopy? That's a good question. Well. It's going to be hotter tomorrow than it is today. It's nice and cool in here, but it's going to know it's 85 degrees outside right now. So how hot is it going to be tomorrow? Will they say 86 or some say 90? In May in April of 2019. We set a new record of nine days of rain in a row seating 8 days of rain in a row another year. in last year we set record Heat. Of 86 degrees in May temperatures in May of 86 degrees one day and 83 degrees in May. This is the hottest. It's ever been going to be this year. The record heat is expected to be you again set tomorrow. So do we need trees while they only provide shade Pride habitat, they provide things to protect us from the urban heat island effect. If it can happen KING 5 news says that in 2018, we had 11 days above 90 degrees out with a new record. It was only 12 Days 12 days with the record in 2015. We didn't quite break that last year 11 days over 90 the hottest day in Seattle was a hundred and three in July of 2009 again are trees important or big trees in Port. Yes. They are. Why they well the washing Department of Health says that hospitalization for heat-related illnesses in Washington is about 25/213 per year with 50% of the people 65 years of age or older quote extreme heat events heat waves are predicted to happen more often and last longer due to climate change. You are a person trying to deal with climate change your facts, right? Okay. At the recent urban forestry Symposium in Seattle your time is up, so he's wrap-up record. A Seattle Parks representative Michael yard, Rick said that the urban heat island effect makes its 17 degrees hotter in Seattle than the rural areas. So we're saving saddles for protecting the trees out in the rural area. So we're going to burn ourselves up here have increased mortality here. Thank you. There's a lot more to be said on this issue and I really urge you to read about it. If you want to put comments in the Box game do that too. I put my slip in there first. I'll send Angel a good evening. Thank you all for still being here tonight. I know it's been a very long night. I got here at like 4:20 today. So I've been here for a while also said thank you for letting me speak again. I am very supportive of the proposed. I do daddy legislation and would really encourage you guys to pass this legislation. I grew up in Seattle and I seen the way that Seattle's been changing and I think that this talks for the entire region and I think that one thing that's Been noted tonight and I think like needs to be emphasized is that for every home that we're not building in Seattle? We have to build somewhere else in that creates sprawl. We need to be building up our cities and making it an urban livable area. So that way we can preserve our Green Space at our farm lands in my lifetime Issaquah has basically disappeared from the forest land. That was when I was a child and if we had built up Seattle thoughtfully and if we had really thought about with the way, we were building our entire region and community that is Forest land that we could have saved today that we could all still be enjoying instead. There's multimillion-dollar homes over on that land where there used to be Forest land as long ago was 5 years ago. If not sooner in addition to just the environmental impacts that this legislation will make I also supported on a livability standard. I am a first-generation college students or and actually first generation high school graduate and either of my parents graduated high school, and I'm really worried about Their future. My dad is currently housing in stable in Spokane my mom and my stepdad pay more than half of the rent one runs and South Tacoma, and I don't know where they're going to be in 20 years and 30 years, and I would really love some day. I could be a homeowner where I can have a backyard Cottage or mother-in-law apartment or my parents could live so that way they don't have to be homeless on the streets like so many of my most vulnerable neighbors that I know the peace hospice legislation. Thank you. So Britney you be next to make house more name is just a doubling back Josh Brothers jail as lavender Ron Chambers Jonathan David Norma ring Erica Bush Nancy ritzenthaler after I am the chair of the Sierra Club Seattle group, and I am also here to talk about climate change. We have long been supportive to use really excited to see this legislation moving forward 80 user important to combat are interlinked climate and housing prices from 2011 to 2018 Seattle rents Rose 59% and home values by 85% is his push more and more residents out to the suburbs Ramos must strive to reach jobs friends and cultural amenities. Altered Angela mentioned development pressure in the suburbs also damages or eliminates vulnerable Wetlands forest and agricultural land. in a time of climate crisis refusing to act on these issues in any way we can is a dereliction of Duty Increasing people's freedom to create a to use let us make space in our city for more neighbors just makes it easier for people to choose to walk bike or ride the bus. It was his address our need for more homes with small energy efficient buildings, and it lets family stay together and seniors age in place. It helps us to continue our mission of creating a city is accessible and sustainable for everyone, and I'm really excited to see it happened. Thank you. Good evening. My name is Josh brothers. And I'm fortunate to be a 20-year + resident here in Seattle. I own a home and live in the Portage Bay neighborhood. I really do love living here and want this to remain my home. Unfortunately, I'm concerned that that they are limits are really going to prevent me from keeping this as my home. I'm fortunate enough to live a relatively modest home. It's about a hundred years old my wife and my two children when we moved into home Our Hope was that would be able to do construction because of the way the home has was set up to accommodate us in our growing family. However, the point five f a r limit is going to prevent us from making that expansion on our home to make it a space that we want to live in. We're not looking to create a mcmansion to create a massive house. We're looking to expand and remodel to create a space that accommodates my family and the growing growing nature of that. I don't really don't want to leave Seattle. I don't want to live in the suburbs, but these limits are really I think going to force me to do. Sidearms the council that truly think about those limits that far limit and think about either increasing that limit or eliminating it completely to allow families like me to remain in Seattle. Thank you. My name is Erica Bush. I'm here to support the regulation on behalf of the committee on homelessness. I'm also a homeowner in Delray and I'm originally from New York City and I live on the most diverse block. I've lived on my entire life. I have neighbors from all over the world. There are amazing and they're all ranchers for the most part and I moved to Seattle because I think it's one of the most beautiful places I've ever been and I moved here because I was able to have a garden and I was able to have green space and I was able to sort of celebrate the outdoor is no way that I couldn't do on the east coast and I want to be able to allow other people to come to the city and do the same and an affordable and diverse way and I think that this would allow that to happen and so I I support what you guys are trying to do. I really thank you for your effort. And I think that it will continue to make the city a place for people like me and that came here to find other people that live Greenery. Thank you. Thank you honorable Council for listening to us today. My name is David Murray an architect of Magnolia objects to accessory dwelling units, especially those often described as quaint backyard Cottages or granny Flats tucked away in a daylight basement. No one objected to homeowners with rental revenues, especially if that means all rental income will avoid those folks being displaced. So what is there to be concerned about to follow the city council not be around to explain the city's increased Urban temperatures as a result of losing sales tree canopy the appeal on the Adu dismissed any concerns relative to the tree canopy swing. It doesn't matter yet. Seattle is 1/10 worse and worse than the nation for lots of the urban heat island effect, the satellite or Maps prove that increase surface temperature would results from areas with your trees. What is the matter here while two-thirds of Shadows trees are on single-family properties for these tattoos and additional accessory dwelling units will be built two-thirds vote. We take down the trees what happens to cells tree canopy the current stats for development today on single-family Lots show that the tree canopy is is losing an average of 25% currently single family is like 32% or something right now that lots that are developed are all the way down to about 24% What does that tell you? We have a problem on our hands that we just can't glanced over and say hey we're providing additional housing. We also have to accommodate the trees. Thank you very much. Thank you, David. I'm going to read off the last three names that have signed up and then anyone can come up in order. So go ahead and set up the Mike Nicholas Michael Maddox and Calvin Jones. Say hi. I'm Nancy ritzenthaler and I'm Seattle native live in West Seattle. And I'm also have a rental house in Seattle that we have had in the family for about 25 years or so. Thanks so much for all the work that you've done on this this this is just excellent really good good Community work. We need density for social justice for housing for Transit and I've been interested in today. Just hearing the different Arguments for why that isn't a good thing. What I've heard is a bad developers. I've heard renters are bad people. I've heard we're losing and I'll lose all the trees and I just don't believe that that's actually correct. I don't I really don't think those are going to come to pass. First of all, it's if it is very expensive to build an Adu we are going we have a tiny little Detached garage in a 1400 square foot house on 11000 sqft lot. That's 7500 minimum. So you can't subdivided. So we're going to do an Adu on on the detached garage. It's going to be it's going to be expensive. It's not something that is going to be something that a developer would go and do that. They would actually either side of a kind of huge houses on these Big Lots and that's that's that kind of huge house that spans the whole rent a little detached garage and building on top of it. We're not even going to to take down any trees to do this. It's it's really I think it's just not at not a canopy shouldn't be that much of an issue. Developers. I don't know. You know, what are we a bad developer? Because we have a we have a rental house and we won't we ran it out and we live somewhere else. We live in the same neighborhood our rent. Is a great there, they're really good neighbors to our other neighbors. That's just not the case. Short-term rentals, I actually I think I've mentioned this before in emails like that. I think that you know, there is there is a possibility that we could take that detached garage and short term rental it and that is a possibility. I will have to be really careful. You might not get it quite as many long-term rentals as you expect from from this legislation, but I think I still think I supported L stands the 1 amendment I would make would be what we like to do is we'd like to make it high enough so we can actually see a view over our little single-story 1400 square-foot Rambler. We have a second story right now the does the height limitations for a 54 square foot are equal or greater to the given Heights. So if we can change that just to kind of actually I think it's well, basically there is an equal or greater than and we want we would like to suggest that that you remove the Greater than put equal there is that makes sense. So on that 50 square foot of 50 foot wide lat and also streamline permitting that'll really help that'll really help people not have to spend so much money to do these. I just don't think we're going to have developers coming in and end up buying up properties and in doing this. I just think that's just not going to happen. It's expensive to build these things. These are these are things that for you know, people that have their grandparents and in their their cake and thanks. When is Nicholas the evolution of this and I'm grateful for that? So I didn't sell for 7 years and I'm not living in enough to be one of the tech dudes around here until I can afford a house here. And and when I look for a house was hard to find a house that actually fit in my need which was not a big house. I didn't I didn't care for a big house. I want you to a smaller house. And you know, I just me and my girlfriend I don't need to have an old house. And so I look for a small house and it wasn't that easy. So I'm buying a house. That's about 2,000 square feet, which is more than what I need. On the 8000 square foot lot with the hope that one day I will be able to build an Adu that we more in line with what I what I want to be held and what I want to live in and so I will the new role I would be able to build a 1000 school today. D'you which allows me to have a small second bedroom so I can have guests over in and and have a normal family life and that would be great and I could run the bigger house for a family that she needs to be Aerospace. So I think I think this is great one thing and one thing that I think is interesting is is the tree canopy thing is I love trees and I you know, I want this to remain and Nobody's talking about Green roofs. The green roofs could help significantly lower the effect of the island that the city has the house green roof, and it's expensive and it's it has a cost and it it hopefully will look good. And so I would like to see more in the long-term not part of that that rule. In the sentence before to be a green Rose, maybe blower fees for permitting or something. I got that helps people Finance is being rude because they're expensive to build nothing. Thank you. My name is John So and I've lived in the same neighborhood for 31 years in Victory Heights and I have a double lot. I'm a homeowner and I planted 12 trees and two blocks from my house. about two weeks ago a developer came into a forested lot in ripped out every tree in the entire lot not 5ft from the border, but the entire lot all the way to the to the property line and he dug down two to three feet at the headline and made a beautiful straight line sculpture right along everybody's property line and he took out trees that were nested among all these other Conifer trees and so it's true weave in the residence have A blessing that are trees are filtering or air in cooling Arps are City and the neighbors that I know if I'm 30 years are furious at this developer and he took out one tree that had almost a hundred and fifty rings and he did that in the center of where these two big mansions are going to be put and he could have avoided it but he ripped it out and he had the stump removed as fast as they could have within three days these trees were taken away and the poor couple who border this to the north are now their entire lot. Is now gone from a shade part shade environment to a full sun. And so how how is that vegetation going to to make it tree roots have been ripped up on all three borders. I'm at work work Furious. My time is up. I appreciate the work that you people have done your you if you've got a heavy load and we're no longer living in Ward and in the Cleavers. I mean, we've got to think of new Solutions and appreciate what you've done yourself. Thanks. l o i r on Chambers and owner-occupied the book walkable cities he talks about backyard cottages and he's got five points of why he loves them. And one of the points is if anything goes wrong, I'll take four minutes 5.7. He says if anything goes wrong the owners there. You handle it then and I got to say I really like that idea. Let's keep that in there and not just for one year, but keep it in there. I see Michael Maddox here on forward Calvin Jones anyone else who I've somehow skipped over your name. You didn't sign up. Come on up the behind Michael. Give me good evening council members and thank you for staying here this evening at my name is Michael Maddox. I am a resident of the Eastlake neighborhood where I live with my 16 year old son. I'm a fifth-generation Washingtonian born at Group Health on Capitol Hill House Seattle. Is that just as my son was we live as renters in a 50 plus unit apartment building with no owner occupancy and we don't have gunshots. We don't have noisy party switch have a really great community of folks who care about each other and we walk to the bus stop we walk to grab the great grocery store the great restaurants and turn the amenities that we have things. We don't get to walk to his much is Parts because one of the things that we do see in the city of Seattle is that Parks the best parks in our city of Magnuson Park like losing ran over by car Keke we see these amazing jewels that we have it we have for nearly amazing investment in this city for decades. Are typically surrounded by detached single-family homes disallowing opportunity for families like mine. He cannot afford to purchase or even rent we hear often that 20% of those detached single-family homes are rental units we can even rent them because the cost is too high this allowing us the opportunity for those great gems throughout our city is the public health issue as was mentioned earlier by Whitney Rec. We see so much for density focus on arterial roadways mean that we are breathing in the air of cars. We're breathing in the air all of the congestion throughout the city of Seattle in Eastlake neighborhood, which was rezoned from single-family to Air1 tell are three twenty-five years ago and still has a significant amount of detached single-family houses for rent underneath I-5 Square breathing that in this is a public health aspect as well as an access to Parks an opportunity issue with respect to the developer, So we've heard a lot of tonight. I think that we as was noted that housing throttle city was all built by developers developers build houses what happened but the Developers Are building the high-rises mid-rises throughout the city of Seattle. We're looking at what can be done in our detached single-family areas with low density housing opportunities for family size units were looking at places developers like a square peg construction Welch Bush Tire spokes were exiting incarceration leading to its significantly decreased. This is the good type of developers that I believe we want to support as a community. I know that many of your support of this for years. It's been on the docket since I enable first ran back in 2015. It's very important. Please get this legislation done so we can move forward greater housing diversity in our city. Thank you. Hi, my name is Calvin Jones and I'm a renter in District 3 and organizer for tech for housing. I'd like to start by addressing some of the night. It's been a little couple things renters don't need homeowner babysitters and should be legally allowed to live anywhere homeowners are allowed to live reasons that allow renters to move into your neighborhood. Do not constitute property theft and renters when they move into a neighborhood don't damage the neighborhood character. They only had two it around my neighborhood and I stumbled across three new mansions that were built at the corner of 29th. And Denny look them up on Zillow and there are 4000 square feet and selling for over 2 million dollars a pop and not a single tree on any of the three lots. I think in the midst of a housing crisis, we have laws that virtually guarantee this ultra-luxury, man. Size housing in 69% of our residential land and that to me is unconscionable. I like to dream of a world where this legislation had already passed and we instead of three luxury Mansions. We would see three more modest single family homes and six more accessory dwelling units. So that's six families that can live low-carbon Lifestyles riding the number 8 in the number two buses that are right here by six more families that gets you all enjoy the absolutely beautiful tree canopy in Washington Park Arboretum six more families that can patronize the strip on Madison Madison Valley and six more families that we get to welcome into our wonderful City. So thank you so much for your work on this number O'Brien. I encouraged the passage of socialization as strong as possible form, including the ability to build to a to use out without the owner owner requirements and let's go even further. Let's legalize more types of Housing and our exclusive single time zones and raised more Progressive revenue for affordable. Thank you. Hi, my name is a coral I've lived in Seattle for 2 years. Now. I'm from North Carolina. I recently went home to see my parents. And the first day I was back. My mom was complaining about my neighbor who is doing a power washing his house from I think noon till 9 p.m. So if that's what neighborhood character is someone let me know cuz I've been around for my whole life. I started thinking about, you know, the lifestyle that they lived when I was being raised my dad drives half an hour, maybe 45 minutes to work each way. My mom works, maybe 15 minutes away and living here and when they visit me they absolutely love Seattle and it's appointed fried for me is like, yeah. I really love Seattle to so I started thinking about how could I live in Seattle another from North Raleigh North North Carolina, if anyone even knows we're in Raleigh North Carolina is the idea house in Seattle is Maybe live in the backyard and be able to you know, not to close but you know it close enough then now we can see them every now and then they can see the grandkids and you will have separate and seperate, you know better, but I think that would be a really great thing for us to have. So thank you so much for having this legislation to kind of give us and put us in a position where more people are going to be able to be in these situations where they support their family or they can support people who want this to live in these 80s. Thank you. Then I would like to testify today. I think just about everyone out there seeing his testified. All right. See none will go ahead and Float close the public hearing. I want to thank you all that was three and a half hours at just about so quite an endurance race. I am I know some folks were here an hour or so before we even started to get signed up. So I really value the comments across the Spectrum and I really appreciate the respect you all showed for each other today. So thanks for being here really quick timing update. We are going to be back in my committee a week from today. So on June 18th at 2 p.m. At that point, we will myself my colleagues will take up this legislation consider amendments are we talked about some of the Amendments a little bit today that myself and my colleagues are considering to the base legislation. I was possible the other amendments will come forward my goal would be to pass something out of committee originally had hoped that would go to the council before Council the following week. There's some additional land use notice requirements of will be putting out on my And so the soonest we could vote on legislation would be the two weeks from yesterday. So, you know three weeks from yesterday two weeks from next Monday. So July 1st, so obviously if things come up that we need to do more work on other amendments come up and gets more complicated that would slow down. My goal is to have this done by July 1st or really close after that. So I mean whatever phone we can get it to the council. Thanks again for all your work. Thank you for sticking out the whole way you made it. Kelly Staffing us all the way till the end and without will be adjourned tonight.", "end_time": 12090.6}]}