{"format": "raw", "annotations": [], "confidence": 0.9454896334055308, "data": [{"start_time": 0, "text": "Greetings and welcome to the August 13th meeting of the Civil Rights utilities Economic Development and arts committee. It is 9:30 a.m. I'm Lisa herbold on the chair of the committee and council member representing District 1 West Seattle and South Park on our agenda. Today. We are going to start with public comment and then we have a briefing item from the Arts office on the social impact of the Arts study and also being joined by folks March fun. And then we will have discussion of a number of bills the first being a bill to harmonize Seattle's just cause eviction ordinance in some of our other tenants rights laws with recent reforms made in the state legislature specifically related to eviction reform. We are likely to vote on that bill today. Then we're going to get a briefing only on two additional tenant rights bills won a related specifically to tenant liability for damages in the instance that the damages were created by a person who has engaged in abuse of the of the tenant and then finally the third tenant bill that we're going to be looking at is a bill related specifically to the rights of a primary tenant to have either a roommate or a family member live with them that is not on the lease. And then finally we're going to hear a report from Seattle Public Utilities Saint report required by prior ordinance in this report is on our waste prevention and recycling efforts here in the city of Seattle. And so with no objections here. I'm going to approve the agenda and we'll move right into public comment. Sex thank you know if 6 people signed in and we'll be keeping time if 2 minutes and he'll let you know when you have a minute left 30 seconds left. And when your time is up and I read both names into the record and if you could line up at both mics, that would be great to start with Joelle craft and Joe Albi followed by illenium. Hi, my name is Joelle craft and thank you so much for being here first day and thank you Lisa for putting this in. I'm actually with a protection order right now, but TV protection order that didn't go very well. And so this kind of thing is is very important to have the present from survivors having to be charged for rental damage my sheets as I survived but I still have court to go to and there's so many other things that I'd this is the second time. I've been out of the house as Wendy survivors leave an abusive relationship finding stable housing is one of the most important things to figure out and if I didn't have that I'd still be there and the last time bones were thrown at me. I've never been hit but that doesn't mean that's not going to happen and there was damage in the unit that luckily I didn't have a lease on but I know so many people. So it's really important that, you know, make sure that it's possible for the survivors to find a keep stable housing, but if they're in debt to landlords, we know that that's not possible and further. We should punish them for the choices of their abuser. I shouldn't get punished for him choosing to throw a phone at me three times against the wall, and those holes in the wall should not be my responsibility. I already have enough on my plate. This is the second time. I've been out of the house and but I could not be here. It's very important. We shouldn't punish DV survivors there already being punished Enough by their abusers being punished Enough by people wondering why they didn't leave a read three books in less than a day and I have ADHD. I don't read a book in over six months. And so this is very important and you really need to pass this legislation today, and I appreciate you putting it out. Thank you. Thanks for sharing your story. Maryland M will be followed by Mario cousins I might need a little more time cuz I'm any commenting on two pieces of legislation. But I'm a small time 2-minutes landlord. I'm troubled by the language and conceited person is not on the lease. It's too broadly written and it appears to deprive the owner of the right to determine who will occupy and live in their property and get is that right to the tenant in violation of state law Bill 119 598 supposed to ship the cost of damages on to a landlord. This is troubling but even more so when coupled with 119 606 and previous cancel actions that eliminate every chance of landlord has to limit their liability. So the bill would give 600 1966 Gibson tennis the right to move anyone in with them at the start or mid-lease without being added to the least. Technically. I couldn't even tell that person that they're trespassing which I have done for tenants at a tenant in an abusive relationship in the past landlords are also prohibited from checking criminal background. So we can't check to see if the new boyfriend has a long and violent criminal history history of protection order against Or the pimp are drug dealer even so if a tenant moves their new boyfriend in and he causes damage the bill does not actually connect the damage to the act of domestic violence. It's very broadly written section. 72403 H1 allows attended to claim an exemption for any damage at all in the unit regardless of whether the damage occurred during an act of domestic violence is also no specific specific language saying that the domestic violence has to occur during occupancy. It could have been long in the past. But this person caused. It. It doesn't require that. They're being arrest or conviction for domestic violence. Simply an informal statement. There is no cost threshold limit exemption and it doesn't allow deposits be applied to damage first the domestic violence perpetrators even have to be a tenant. He could just be an unknown guest and the landlord would have no way of tracking that person down. So this has the potential to be very costly for landlords the talk last week about creating a hundred-thousand-dollar find to help Harvey ranchers avoid accountability for their predatory action doesn't create any kind of funding for the tenant or the landlord to seek reimbursement. The $27,000 damage caused by the worst tenant we've ever had this ordinance just as a blank check that the landlord has to pay. Okay. Just want to add one thing. I have a lot of construction constructive comments, and I will submit them in writing, but I'd really encourage you to include landlords in the development of legislation that we're Sky stakeholders in my pay attention. I have valuable input and I'm willing to an available to work together on Solutions Merrill cousin without by Gene Owens. Hi, my name is Merrill cousin and I'm the director of the Coalition ending gender-based violence and on behalf of our 35 plus member organizations who provide services to thousands of survivors of Domestic and Sexual Violence in Seattle. Every year. I'm here to express our support for Council bill 11:19 at 11959 a tenant experiencing domestic violence for from liability for damages done to the property by her abuser the ordinance lays out all the reasons for this this legislation domestic violence is a precursor to housing instability for hundreds of survivors and the financial hardships that tenants are who are held liable for damages can lead to a Cascade of events that including eviction bad credit history loss of access to Section 8 and other forms of housing assistance and inability to find other rental housing and all too often homelessness. And as the Seattle women's commission and housing Justice project report that cited in the legislation find Women and Children of color and especially black tenants are most disproportionately impacted by these impacts. I've heard countless survivors stories from Advocates about the stories of survivors who experienced this and the domestic we know that domestic violence is a pattern of course of control and that users can often cause damage to rental housing property not as part of an active assault on that partner, but as a way to economically control them in this is all too common when the Survivor is trying to leave and protect herself and her children. So we had we would actually like to see the last strengthened in a couple of ways one is to expand the definition to more closely mirror the language in the state law and Non intimate partner and non household member sexual assault stalking and unlawful harassment and and other looking at other things. We really want to thank councilmember her balls for your leadership on this and look forward to working with you as landlord organizations to address their concerns as we move the legislation forward. Ketones be followed by Isaac organista. Good morning. My name is Gina Owens and I'm an 18-year member of Washington. Can I'm also one of the newest members on the Seattle renters Commission. I'm here as an individual today in support of council member her boats tenant protection legislation and will address the bill that allows tenants to live with a roommate. The bill is critical towards preventing housing instability and homelessness, especially for young people like my granddaughter. My oldest granddaughter who is 20 is currently in college and works part-time. She could not afford to live by herself. But by living with me she's able to focus on her studies without the stress of living and finding a housing and paying bills. She cannot yet afford. My help is affording her. a smoother transition from childhood to adulthood Further when she does move out, she will likely need to live with roommates because the space that are rentals in the cities are so high. Ensuring tenants have the right to live with roommates patek's families and the working class. Please support this legislation and keep people house. Thank you. Isaac organista believe it is followed by Sochi make a bitch. A good morning. My name is Isaac. I'm with Washington can and I'm here to support the initiative regarding at 10 protection in the right to live with a roommate Summer Rental here in Seattle. And I was a full-time student here at the University of Washington recently graduated and school was expensive to say the least so looking for housing with just another Financial nightmare. I have to face and with you can't open it cost of higher education already at the Forefront. There wasn't any real possibility I could afford to rent a place on my own because I'm broke, but the only way I could afford it was to live I did. What are more your folks did I found a roommate cuz that's the only way that in all honesty people can afford to live in the city cuz that's where we're just trying to do just live and survive. I'm not asking for six figure salary. I'm not asking for all of these hi nice classy things, but I'm just trying to make enough to live. And the fact that I'm living paycheck-to-paycheck and it's only done because of living with roommates. It's living in the city is trying to survive here is expensive and the fact that if anything happened God forgiving God forbid something happened to my parents and they had to live with me or with my siblings and the fact that I could be kicked out because of that and space tell Melissa. Wow, I already graduated and I'm facing all of these dad's and just trying to survive it's it's sad it's scary and it's stressful. So that's why I laws and policies need to be in place of actually help students actually help people actually help the folks are living here. They're just trying to survive in this try to make a living out here in the city. It's for people who never had two extra people who are living paycheck-to-paycheck and not for the folks. We haven't had to worry about where grocery snack on or if they're going to have enough for the rent or bills. So that's why I just thank you in person for mashed friends including Spell I'm making sure that y'all support this plan, and thank you. And the last speaker that we have signed up is so to make it. When is Mission and Washington, can I just touch a little bit on what the landlord briefly talked about which I will also say I question the sincerity of wanting to work together with folks if they are not going to even stay for the full public comment. But anyway, so why this isn't the landlord isn't liable for the damages the perpetrator that is liable for the damage on the TV bill and I think that's common sense. Like no one is asking for someone to destroy an apartment unit and the person who does that is a person should pay for it. And this came up this whole thing even came up because there was one tenant last year who an abuser came over to their apartment and beat them severely and there was blood everywhere and they were charged for bodily fluid cleanup is thousands of dollars and that money is on their credit report and they couldn't find housing because of that which is As I said earlier, just creating a cascading effect of just really detrimental impacts. So this bill is very important, and so a lot of appreciation for bring this forward and for moving this and then also for the other bills, they're also very important, and it's really critical for people to be able to live with you no family and roommates in order to both afford this city as well as to deal with emergencies that pop up. I mean I think about for myself. I have an older brother with disabilities and if my when I suppose when my parents passed away that he'll live with me and if that happened while I was a renter, I want to be able to immediately have him move in and not have to go through some long drawn-out process or risk the landlord saying no, and so this is just really important for families and really appreciate y'all question is Ford. Thank you. So that concludes public comment. Thank you everybody for sharing your stories and I will move into the first item on the agenda. The social impact of the Arts study. We recognize that we've been joined by Council in Brooklyn. We start with some good morning Calandra Childers with the Seattle office of arts and culture. I am Sarah Sigman with Arts fund and I'm Katie Corrado with heart send us off. So it's my pleasure to be joined by my colleague Sarah and Katie from artsfund. They'll be presenting on the social impact of the Arts study that they completed this last year and we were Partners on that study. And so it's their study to prevent that we wanted to represent how much we supported and appreciate the findings of it. I think, you know, we've partnered with artsfund on economic impact studies in the past and those have been great. They've they've had really good information that we can use but I was really excited about this social impact because I think it really give some back up to the to what we already know which is sort of the intrinsic value of the Arts and it really backs up in in really specific ways the the values to our community when we do invest An arts and culture 2 of the specific areas that that I get called out in the study or around Arts education and cultural space and and that's really helpful to know that the the Deep Investments that the city has been making are really backed up by a really good data that show that this that these Investments helped drive a really healthy vibrant cityscape. Thank you appreciate it and maybe just a little bit of background and it's already part of your presentation. Keep talking a little bit about what a social impact study is as compared to obviously any comic impact study indicate that you are measuring I can answer it is part of the presentation. So I'm having to go through the presentation is not in fact touch it on that, that'd be great. And thank you Clara. Thank you for that question that that already excites me that we're going to have a great conversation. I'm excited to be here to it to share the findings which really talk. How the Arts create public value and what I hope to do is share the findings of a brief overview of them and then along with Katie and Calandra answer your questions and how conversation Hearts Run has been here for nearly 50 years and we are deeply invested in the health of this community. We see first-hand that the powerful impacts of our Region's cultural nonprofits and is clever inventions for over 20 years. We've tracked the economic impacts of the cultural sector how the sector supports tens of thousands of jobs attracts cultural tours who wouldn't otherwise come here and generates 2 billion dollars in business Revenue. I really enjoyed sharing those findings with you the last time we did the study and hope to keep that conversation going but it's Calandra mentioned significant as these numbers. Are they only tell part of the story. Do we knew art of a much greater impact a social impact. So we set forth on this new research project, which is a first-of-its-kind to clarify. When I say Arts. I'm talking about nonprofit organizations in all of their activities their programs are events and classes both in and outside of their traditional venues. So one of the things that we begin with and talking about what we discovered is a contradiction, which I called them is perceived value of the Arts when we first began our research, we found a surprising disconnect and how people in our community perceive the Arts 79% of people believe arts benefit their personal well-being and 60% cite the Arts as a factor in their decision to locate here. But only 28% think the Arts promote social change at a community level. It's only 28% who see the benefit Arts have two people Beyond themselves. So why do we call this a misperception because Arts have social impact as well dive into our study shows that ours are a viable powerful and proven tool to affect positive social outcomes. It is reinforced by the pool all too often. They are unacknowledged and therefore underutilized as part of a Community Development strategy and I will clarify when we say social impact. We are talking about the ability of Arts to advance Community priorities. So we focused on three key impact areas each intersecting with the social issues and Community needs facing are reaching their broad buckets because the needs are brought Youth Development and education health and wellness and neighborhood Vitality a focus on Equity runs across these three themes as we examine how hearts are a mechanism for supporting Equitable outcomes. Over the past 10 years a significant body of research that connects art to positive social outcomes has emerged we reviewed over a hundred and fifty of these resources scanned 200 King County Arts nonprofits and profile 210 Regional case studies as I mention. Our social impact study is among the first in the nation to really take a look at Arts Impact across social issues and it offers us a good deal of new information to digest some of the highlights. I'll be covering are also in this summary brochure and if you're interested in a copy of the report, we're happy to leave it with you and your spouse. Let's start with Youth Development and education with Kelly and her mentioned in our findings clearly show involvement in the Arts can improve academic and social outcomes for youth lacrosse socioeconomic status and across ages. So let's take preschool Youth and help at-risk students an arts-integrated preschools better regulate emotions than those in traditional preschools the high school Youth and how students who take art and high school have higher SAT scores than those who don't in fact the day of show students with sustained Arts access not only have higher test scores and GPA but also lower Dropout rates and I think the city's own Creative Advantage Program is a powerful example of how they sustained impacts are transforming lives in the Seattle Public Schools. Neurological research is also showing us how Arts strengthen the parts of the brain where executive function is developed which improves goal setting and follow through And the data shows positive impacts are especially strong for youth from low-income backgrounds at-risk students involved in the Arts are 23 percentage points more likely to attend college than their peers 23% So knowing that low-income youth have the most to gain and yet all too often have the least exposure to Arts programs creating this access can help close the opportunity gap an example of urban artworks provides Justice involved youth on probation job training in life skills as they install murals throughout the region. These are kids who are trying to move out of the juvenile justice system and art is creating an off-ramp from the school-to-prison pipeline and it's staggering data point 83% of urban artwork don't re-offend. Not only are they out of a pipeline. They are out in the community giving back. To know on the health and wellness, we find that both in and out of medical settings Arts can improve both individual and Community Health in primary care and Behavioral Health RN music therapy are widely recognized and implemented strategies. In fact Nationwide 45% of medical institutions offer some sort of Arts programming that's nearly half the institutions in the country with 80% of those saying that they do so to benefit patient recovery across any number of medical conditions Arts can help lower anxiety and reduce dependence on medication and a medications shortened hospital stays. Aging adults and those with diseases that cause dementia show particularly favorable Health impacts, you likely know Seattle theater Group by their wide range of shows at the Paramount the more and the Neptune Theatre's they also run a countywide program called Dance for Parkinson's be on promoting the flexibility the confidence and the strength that Parkinson's patients need the physical interaction offered through the dancing reduces social isolation isolation, which is otherwise known to accelerate a decline in Parkinson's patients and put that in Greater context for an aging person social isolation has the negative health impact equivalent to smoking 15 cigarettes a day. Arts can be a powerful antidote leading to better lives longer lives that are lived. Now on to Neighborhood Vitality, which I think is particularly relevant in a region expanding as quickly as ours when Arts are present. There's a documented increase in neighborhood livability community identity and social well-being this builds Community cohesion and can help bridge cultural divides research specifically ties Arts participation to a shared sense of belonging and pride. And in fact Arts participants are more than twice as likely to volunteer in their communities. Public Safety also comes into play here research shows that the presence of Arts and Cultural spaces in neighborhoods correlates directly with a rise in foot traffic and with an increase in property value in Seattle itself with a case study in the research that that generated those results these benefits they extend to Arts participants and non-participants alike. In fact cities with high concentrations of are not only have increased Civic engagement and social cohesion. They also show and prove child welfare outcomes along with reductions in crime and poverty and the results are magnified in low-income neighborhoods. Give me some examples like path with art come in path with art works with 750 homeless and formerly homeless individuals each year using art and music as a means to support and Empower these vulnerable populations Forge connections and trust and transform lives another powerful example profile dinner report can be found in the Youngstown Cultural Arts Center, which I would imagine a council member her both your way. It's serving as a community Anchor Point in the Delridge neighborhood Youngstown and its fellow building tenants invite neighborhood residents in to participate in community food. Justice dinners after school recording studios Movement Dance and so much more. It's a cultural space that brings arts and neighborhood together a place for Multicultural and intergenerational neighbors engage with one another around issues that matter 2 as with all the examples I've mentioned when we talk about Arts Impact. It's important also recognize the Arts aren't working in isolation nor are we suggesting that they do? So in fact in King County 84% of Arts nonprofits report partnership outside the sector that's more than four out of five Arts organizations working together with schools with Refugee and immigrant organizations with City departments with senior centers Hospitals and Clinics environmental organizations. And so many more we uncovered substance use disorder clinics partnering with improv comedy hospitals were bringing art the patient bedsides and others who are incorporating Arts into physician training and homelessness social service agencies who rap artists throughout their programming because in their words the Arts provide their clients with Community connections that strengthen their ability to stay house. The results are clear when art is integrated with another intervention and in compliment to traditional approaches to social issues. It makes people more successful. We're talking about new possibility here and an aspect of solving Community challenges that really isn't currently acknowledged the public benefits of Arts. What we're talking about is how hearts are a strategic proactive investment in community if there's one thing that I hope that you take away today and that we all do is that Arts are not a charity they are a strategy. So what can we do first off invest as the data suggest both investing in the Arts and supporting policy promoting Arts access and affordability have positive Equitable outcomes that Ripple throughout a community this can mean directly funding Arts providers and programming and incentivizing others to do so this can include furthering Arts education and access to the Arts, especially in the K through 12 years with programs like David advantage and it can mean investing in new cultural facilities and the preservation of existing ones and it definitely means advancing policy aligning with these goals. Geographic expansion is also a specific way in which you can advance Equitable outcomes and we're desired impact might extend beyond the boundaries of the city partnering with organizations like Arts funding so many more with a broader Geographic scope maybe an Avenue. Another key approach is partnership Partnerships are key to all the success stories. We on Earth and you can leverage your positions as city leaders to make introductions across sectors and open doors for new collaboration. Another key way in which you can take action is to invite Arts voices and arts based strategies to the planning tables that are shaping our City's growth when you sit down at a policy planning table and we were at the the last create a meeting. So I'm just going to reference the items on that agenda be addressing any of the items including environments Community outcomes are community outreach Equitable policy Etc sitting down to start to tackle those issues think about including a voice from the cultural sector at the outset and design programs and Creative Solutions that are incorporating these powerful contributions that Arts offer. At the core of our son's work. It's the belief that art strengthen community and our social impact study proves it. I really want to thank our sponsors including the office of arts and culture for investing in this research and critical conversations like this one, and I want to thank you for inviting us here today. I hope this briefing will provide and that and the data itself provides useful data and tools to support you and more meaningful not more in meaningful public investment policy and strategy, and I really look forward to answering your questions and work with you to move this forward. Thank you. Thank you so much. And I also want to thank you for coming back after our long and he attended the last time we have incredible respect for the word that you're doing. And in fact appreciated the opportunity to experience Ed info. So a couple questions one. Can you give me give us a sense of how you picked the three themes that you did this deep dive in and then secondly. I'm wondering does the data reveal particular I think about like the city for open space. We have a gap report or we've identified where the gaps are. We planning, you know in just like looking at for instance the health and wellness theme 45% of medical institutions Nationwide offer some sort of Are We Done an analysis of medical institutions locally to see what percentage offer Arts programming here knowing knowing and understanding the health benefits because if we had that information it would then reveal I think through identifying if there are gaps opportunities for Partnerships to fill those gaps in so I'm just I'm wondering if and I'm just using that as an example. I'm imagine you could do something similar for all three of the elements to a large extent we have done. So with Youth Development education The Creator advantage and our goals to get Creative Advantage and all the schools in the school district, but just trying to Grapple myself with how we use this text. Let me answer your first question first in terms of how we identify those three priority areas there they were a few Really key aspects informing that one is we had an advisory committee across the sector advisory committee that also included Randy angstrom the director of the office of arts and culture included folks from corporate partners and included Civic partnership's Business Association of nonprofits Etc. Really a wide-reaching and also County leadership and we were there for gathered in put across sectors is the top priority areas in challenges facing those sectors. We also looked at the National Conference of Mayors and what are top Civic issues facing cities including this one looking at each end has and we are looked at the this was a King County study. So we also looked at the King County priority areas in the executives plan that said we also we're looking to where there was a longitudinal data across time. As I mentioned. There's been a wealth of data generated over the past 10 years. We wanted to build upon solid data. So we wanted to make sure that there was A significant amount of data across time as well as intersecting with issue areas that we knew were facing this city and being addressed by cultural organization was kind of an amalgam of those those key areas. The reason Equity was pulled out is that it intersect with all of those theme. So rather than having a specific focus on Equity as a subject area and intersects so much with all of them. We also had two secondary intersectional areas which were business and the environment and so we dive we drove into how Arts intersect with those two areas as well. But business is not separate from how art Advance the next generation of thinkers in education nor. Is it a separate from Hell Arthur building neighborhoods in helping to recruit top talent. I'm so that's how we selected those to your second question. And I also invite Clan Wren Katie to join in on this that is what we like to do. Next. This was the first study in the region in the among the first in the nation really diving into the FEMA areas. We did conduct a geographic landscape scan of where programs are being offered that really Loosely aligns with where population is, but what we want to do when we do the study, the next time is also either across the subject areas or in particular. Let's say the one you tackled also gather data from that sector from the health sector we partnered with Swedish Hospital on the study. So we have some of their data in terms of how they're integrating arts in their programming, but we like to do that across the sector. Yeah, I think we know anecdotally that there are organizations like Swedish that have really great Arts programming but we haven't specifically partnered with a lot of those health and wellness organizations to really dive deep and that I think really relates to serve the history of of our office and really being focused on supporting the nonprofit sector and so that's really been that area are focused. But with the work that we've been doing on the creative economy, I think we're looking a little bit more broadly and more sore landscape analysis about you know, if it's for-profit or nonprofit or Community groups. If we don't need to fit somebody into a category in that way that we have in the past, we can really look a little bit more expensively as to how the whole landscape is being supported and I think this is a piece of that puzzle. Yeah for sure because as I would see it there there are other ways that the city can partner in order to meet. Objectives related to Arts programming that doesn't necessarily mean we have to fund them. So I think that kind of asked and that includes entities other than nonprofits his is useful because you know, we do a lot of work here on the council as it relates to regulating and requiring public benefits of large institutions that are nonprofit and so A master plan requirements for including Arts programming if she wants to expand is not necessarily something I would think of normally but it might be a good thing to think of as a public benefit for are for-profit partners that the city has an interface in regulating on occasion. Absolutely. I think the the questions of public benefit are ones that we'd like to dive into deeper and just knowing you know how the city continues at its influence to to get it some of these areas of community impact that we're really interested in that don't necessarily have to be direct funding going out the door every time. I'm so can you talk a little bit about the next you mentioned? You're going to be doing a second phase of following up on the study. Can you not go there but that our goal moving forward is to really continue to do the critical economic impact work and then pair that with the social impact work. So we are just under way with the next iteration of the economic impact study. It will be informed by some of the issue areas that we've been uncovering while rolling out the social impact studies. So will you know, we will gather the numbers that are important numbers tax benefit jobs created cultural tourism, which has such a big draw and will also likely dive deeper into areas of affordability perhaps of cultural space and what the ramifications of those challenges are the cultural community and the community-at-large perhaps affordability. I'm of space for artists or housing that type of thing. I'm so the conversation will continue to evolve. We also hope to then Do another approach to the social impact study identifying more of these Gap areas with more specific data collected to this region this first study involved a significant literature review to establish the Baseline for what the research is having conducted that and in fact, all of our materials are open source their available online for other municipalities other regions, in other areas across the country to to build upon we can now build upon that and dive deeper into the data collection and Analysis here. So if you've touched directly upon where we like to go with us, and we would love to do so in partnership with with the city and with counties I'm also really interested in and then they appreciate customer herbold asking a question. It's been a few years since I've got an update on public school funding in arts. And I imagine it ships to the economy got better, but I don't know for sure. I'm assuming that most private schools have robust art programs for students in that probably correlates with income for households. I know for a while, you know, if you lived in a welfare neighborhood with a strong PTA those households worry about the backfill Arts programs that got caught in another neighborhoods with with without is less wealthy neighborhood in less resources in a PTA make it less exposure. And so, you know the types of Gap analysis to figure out where we want to Target our investment of the city and then can be really useful and also curious How may be more qualitative and quantitative the ways in which our impact youth? I can imagine, you know a young person who gets exposed to music early in their school career and ultimately gets to go to essentially Ellington and performing with the best of the country on National stage 7, you know, just the the powerful experience that has and so, you know the opportunity for for folks that maybe maybe struggle in school and other aspects and I'll send find something that they are like successful in and then I can imagine there's so many other folks that are never going to achieve an essentially Ellington show or a major art show whatever it is but still just the ability to to use their mind in different ways is it doesn't show up necessarily on the news at night and I'm curious to know is is the 6s has a little bit of both but are the things that we should be looking for. Are we looking for like Opera? Needs to find someone who's really struggling and really lifting off the top or is it like know, you know even any talk about it in the Healthcare System. I can imagine lots of senior programs to you know, probably rarely are these seniors going to achieve greatness in arts at this point? Maybe there's some examples of what happens but for the most part it's just it's like it's a good measure of success and inspection Roofing about youth Do you want to go first or so? I think the great thing about Arts education is that it really provides. We will we found is that it provides these skills that go far beyond just learning to play the violin learning to painter learning to sculptured 21st century learning skills that are all about collaboration and communication and growth mindset and they're all the skills that we need kids to have to be able to get into the careers that we know exists. So right now there are a lot of people coming in to Seattle because the industries in Seattle are not hiring from the local group here, but we know that an Arts education provides the skills that will allow students to get those careers. That's the creativity. It's the it's all those skills that allow people to it's not just I'm sorry. I'm not being super articulate. It's not just teaching a particular tactic. It's the abyss. To grow into the the new areas. And so we know that we're not necessarily going to train up people that are going to go play for an orchestra or you know, become somebody that sells million-dollar paintings, but the Arts really teach these skills that allow people to get into these careers that we want them to have access to and so it's really important that we provide that access to everybody and it isn't just the students that have you know, what happened to live in a wealthy neighborhood where they're able to get that access but that every student in every neighborhood has that access from day one and I'll throw some data behind that as well as we stayed in the study and IBM study that indicates that creativity is the number one skill that employers are looking for in their top Executives and it is the most difficult to find the one which cannot be automated. So as we are moving into more and more Automation in the workforce that is that is the one thing which cannot be automated there will always be a highly valued core human skill and widths So many of these Innovative companies making their homes here creating a Workforce that can support and sustain and evolve that is critical. The other thing I think when you mention qualitative, I do think it's a blend of a qualitative and quantitative and that that's really what our approach to the study has been because another example to a young person. I'm one of the case studies we profiled the Seattle arts and lectures and they do a lot of data collection from from the young people who work with them and have collected a lot of feedback that essentially says you literally saved my life the rates of young people who are contemplating who have mental health challenges for contemplating suicide are increasingly. They're expanding at a horrifying rate, especially in the junior high to high school rates and their young people have offered feedback to the program that they participated in saying you made me feel heard. I got to tell my story. I feel like I matter that's making a difference. Thank you. Thank you for coming and sharing the story. I really hope that there is more that we can do to increase that percentage of people who believe that art and culture. It has a social impact on our goals as a community. If there is something that I can do to help get that 28% number up, please please let me know. I think that should be on if it's not already a real focus of this effort is really changing people's hearts and Minds about who the Arts Impact Beyond just their own personal appreciation of the Arts a wreck a real recognition that they're helping us meet our community goals. I really appreciate them that invitation for partnership you as our elected leaders are the Amplifiers who are the voices people listen to and if we can find ways to really work with you to share that messaging or Bradley. I think we really can make a difference. Don't recognize that we've been joined as well from council member Pacheco. Thank you for joining us. First item to place decal item to is countable 119584 an ordinance relating to residential rental properties conforming the Seattle Municipal Cubs changes in state law on renting section 7 point 240200703022. 202-080-2220 61602 220-618-0222 10030 and 2290 to 120 of the Seattle Municipal Court, You want to kick us off? So this bill it's Constable 11958 for it takes the changes that were made in the legislative stay session earlier this year and incorporates them into our code and so the two bills that passed through legislative session worst NFL 5600 and House Bill 1440. They made a variety of changes some of which we need to incorporate in order to align our code with state code. And so those changes include extending a pair of vacate eviction notice from 3 days to 14 days. Changing the definition of rent are definition of housing cost was essentially the definition that the state adopted swords to aligning our specification of food that is consistent the cenacle 5600 also required that any payments made have to go to rent first before they can be applied to any other fees also gave judges more discretion considering the circumstances of an eviction. That's not one that we need to align in our specific code, but it's something that the that bill did. Apple 1440 required that landlords must provide a 60-day notice of any rent increase in our code. We had provided 60 days if rent increase was over 10% or more. Otherwise of the 30-day notice the substandard eyes to all rent increases being a 60-day notice and lastly, just provides an exception for affordable housing providers. Who who's that rent based on attendance income? It's all the changes went into effect, July 28th. And by aligning our code with the RCW just make sure there's no confusion around what law actually applies right? So we mean when we say harmonization Bill, it's making sure that our legislation here in Seattle is not in conflict with state law and in this case state law is already in effect affect sense the end of July our last meeting. We had a presentation from the Seattle Department of construction and inspections. And they've given us an overview of what they had done to notify Property Owners of these new requirements under state law and some of those stuff they took they took it included using the rental registration and inspection ordinance database they have in order to notify the only 20,000 registered landlords of these new obligations under state law and they've also been doing some landlord trainings at after they can't they visited this committee last they said that they were going to actually going to be doing additional landlord engagement after that last meeting and they're developing future landlord curriculums training curriculums and enfagrow Graphics to be used on the city's renting NC. Website as well as in those in those trainings. So given that you know again, this is just harmonization with existing state law. I have no further questions and ready to ready to go. I'm ready to go very straightforward and it's so grateful the state made some changes made were changes that were lifted up as a result of a study that the Seattle women's commission LED on and presented to us last year before the legislative session. The council had passed a resolution identifying what our priorities were up from that from that that was commissioned study called losing home. We identified a number of items that we had committed to work on if the state legislature Had not worked on Happily many of those items were taken care of and we're going to be after this boat dovetailing into some of the other items that were in that report that were not addressed at the state legislature because they were very focused on the river the eviction reform pieces. So what that I'm going to move passage of council Bill 1195 at4050 favorite I-95 84 will move on to phone Council. Thank you. 303 is countable 1195 98th and Ordnance relating to rental agreements and tenant liability for damages or leaving a tenant experiencing domestic violence from liability for damage. The landlord's property caused by a perpetrator of domestic violence and amending section 7 point 24020. 724030 + 2 2 2 0 6 1 7 0 of the Seattle municipal code. Asha you want to give us the background on this bill and explain what accomplish is? So Capital One 19598 comes from a series of the issues identified in the losing home report and that was in this committee back in September of last year. It was a report by the housing Justice project. And these Seattle's women's commission that was essentially looking at an analysis of eviction causes processes outcomes who was being impacted how they were being impacted and one of the issues that was identified in that report was the financial hardship that tenants who were survivors of domestic violence face and so in discussing those all those issues in resolution 31861, which is resolution that we the council adopted earlier this year which outlines the findings of that report at the actions taken during the last Budget season and the items that Council wanted to address in the short-term the issue the issue of the financial effects for these tenants was brought up and during discussions that resolution a simple staff memo had discussed various options for creating resolution. One of those was probing landlords from holding a tenant liable for those damages. If the tenant had a protection order in place against the person causing the damage another option was holding to 10 hours from holding the tenant liable if the tenant filed a report with a qualified third-party describing the property damage and the domestic violence and that report was provided to the landlord. And another option was to cramp medication fun that would cover damages caused by perpetrators of domestic violence. Those options weren't intended to be mutually exclusive or the complete list of options at that council could take action on to resolve this issue. But those first two were incorporated into draft legislation that was discussed at the committee meeting back in March, and so the In Capital One 19598 do include some of the items that were in the draft legislation. So this bill is intended in a lot of ways to measure the state law which allows survivors of domestic violence to terminate the rental agreement without further obligation if they provide the landlord notice and proper documentation, and so this bill essentially states that the Senate cannot be held liable for damages to a landlord's property. If it if that damage was caused by a perpetrator of domestic violence with proper notice and documentation. And so the tenant would essentially have to tell the landlord that they were a family or household member was a is a survivor of domestic violence and that the damage that was caused to landlords property was caused by that perpetrator. They would also have to provide documentation to the landlord either in the form of a protection order if the production order had all of the elements that are described in the legislation or a report to a qualified third party that contains the following information. So it would require tenant or household member notify the qualified third party that they were I'm a Survivor of domestic violence when the violence or property damage occurred where it happened a brief description and that the tenant or household member inform to Call 5/3 party of the who the perpetrator was the legislation defines a lot of those terms that defines a qualified third-party which is essentially the same definition as is used in state law except with the addition of case managers at social service agencies just to make sure that any potential person to whom a person is reporting domestic violence is covered if it wasn't one of the things that based on public comment and that I should make clear is that this legislation is intended to apply not just in a circumstance where the damage is caused during an act of domestic violence, but even if they wouldn't qualify legally as a incident of domestic violence, as long as the damage is caused by the purpose. Of domestic violence that would be covered under this as well. Can you restate that? I don't understand the difference or the tension you're making so many times the definition of domestic violence can be even if a person is put in fear of assault and so property damage that's caused during an incident of domestic violence can be you know, if somebody if a perpetrator to throw something at the Survivor for example, and it hits the wall instead that could be a could be defined as an incident of domestic violence, but in circumstances where it's not entirely clear whether something would legally qualifies as domestic violence, but the the person that is causing the damage has been has perpetrated domestic violence in another incident if that person were to create property damage that wasn't specifically in the legal parameters of the definition of domestic violence. They could still be held or the 10th would still be exempt from liability in that case. So it's not it's mostly to make sure that even if the legal piece around what an incident of domestic violence is isn't exactly clear. The burden is not on the Survivor to prove that this was especially when the perpetrator has already been established that the property damage happened during one of these incidents and is this is the approach that were using does it mirror the approach in state law as it relates to not being liable for broken leases or not giving proper 20-day notice in a month-to-month agreement. So the state because the state law is conditioned on just the incidence of domestic violence as opposed to any other incident being included. It doesn't actually count for this sort of circumstance. The state law is specific to It's any AXA constitutes a crime of domestic violence sexual assault unlawful harassment or stalking. And so if that incident occurs, then that's the direct link to the brightness a rental agreement in this case because the property damage can occur outside of one of those circumstances as long as the perpetrator is somebody was committing domestic violence has committed one of those incidents that the triggers the property damage and for the other I get what you're saying. It's not an apples-to-apples comparison of state law because we're talking about a different set of circumstances were talking about damage right as opposed to somebody's right to terminate their lease agreement or to leave a month-to-month agreement without giving 20 days advance notice as it relates to other parts of of the proposed Bill definition of domestic violence with the triggers. Are are there is it aligned in other ways and the reason why? What is important is that the the principal and state law is still a principle of liability, right? It's difference between liability for damage or liability for breaking a lease was still a liability that landlords have a right to assess from from a tenant and if under state law there the standard is no there is no Financial liability under certain circumstances in the case of of domestic violence, then it I think That those those that same framework in those those same definitions and triggers are are are useful as a guide for us in extending the limitation of liability in the case of Damages. So this current bill is uses the definitions that was in the draft bill on that dress bill with John before the changes at the state level happened around the definition of domestic violence and family and household members. So the intent was always for the this built-in mirror the definitions in state law and so on the intent of the intent to align those can be done through Amendment at this point. So the difference is that the domestic definition of domestic violence extends to non Family household members to the the difference in definition between intimate partner and family and household members. So all of that will will end up being imported into this bill through my medicine. That is to keep it as closely aligned to as possible. Thank you. He thought to question Sia. I have a question on Imports on overheard. The landlord is not responsible for the damage. But that the person who created the damage is responsible is is there anything in this is that just existing case law or is there something in this legislation that strengthens our case? So what does this look fellows currently drafted? It removes liability from the tenant but it doesn't specifically place that liability on the perpetrator. And so one of the things that I'm currently researching is looking at how that how that shift and liability would apply at the state level. One of the things that I'm currently researching is at the state level the it's very specific that the record of the report we shouldn't name the alleged perpetrator of the act just that the person told to qualify. Third party who that person was and so in that circumstance the landlord doesn't doesn't necessarily have access to the name of that person which would make liability a little bit difficult. But in balancing the the privacy and the safety piece of it. I'm I'm trying to figure out what that looks like in terms of how to bounce those factors and that is something that you all may have to figure out policy-wise which way because if we're contending that it's the perpetrator of the domestic violence that is liable, but we're prohibiting the landlord for a text to save that information. It makes it really difficult for the landlord to exercise their rights to go after the perpetrator and the other item that exists in the state law that is not yet reflected in this is limitations around how those reports can be used as evidence against a survivor of domestic violence and I'm trying to align what that looks like in terms of the the ability of Criminal or civil proceeding for what that the evidentiary value of what that report is. So that's also ongoing research. That's outstanding. I look forward to hearing with the research learn you learn in the research and what I heard you say is it made me some policy decisions to make and sell one of the things that will be helpful for me and I'm looking to fix in the audience who have expertise and DD is to think through what the implications would be of exposing the perpetrator's identity to the landlord from a liability perspective. I think that makes a lot of sense. If someone did some damage they should be held accountable to it also care about the recovery of households in and if there are there negative consequences of what are kind of theories of change are within the domestic violence world. So some feedback on on that if if we may be faced with making some policy decisions to try to be as well-informed as possible. Text Mel. And so we have this coming back to committee on September 10th and will have potential amendments discussed at that at that meeting. So when would you like to know the next two weeks would be really helpful. Any other questions thoughts? Going to the third item related to tenants rights Council Bill one 19606 and ordinance relating to rental properties restricting a landlord's ability to limit the number of persons residing in a rental unit prohibiting the use of conditions that are applied to persons residing in a rental unit who are not tenants and amending section 7 point 2402090300 of and adding new section 7 point 24031 and 0322 the Seattle municipal code. So it's somewhere to the previous Bill about domestic violence that we just discussed. This bill came out of the losing home report that was in this comedian September one of the items that were identified in that report on spoke to the challenges that money at 10 and space in affording rent. So sometimes we can restrict a number of people that are allowed to live in the unit or there additional fees or conditions attached to adding a roommate to a unit or landlord just unreasonably reject a request for a roommate and so and identifying those issues when we discuss resolution 31861 earlier this year. We identified several options in terms of how to resolve that issue. Then the options presented at that time or to require that the rental agreement provides a tenant a right to live with me to get family members after an additional occupant and subject to maximum occupancy limits. The another option was to our car that if a tenant wanted to add a tenant or student at a roommate to the rental agreement the landlord couldn't subject That person to screening criteria that was stricter than the screening criteria used for the original tenant couldn't impose any additional fees except. These are rounds actually running a screening report in the last 2 prohibits a landlord from unreasonably rejecting request for a roommate. So cancel the one 19606 incorporates a couple of those items. Essentially what this bill would do is required that any rental agreement that is entered into after the effective date of this bill would allow occupancy by a tenant tenant's family or household members an additional person who is not attend family or household member and that additional persons family and household members essentially subject to occupancy limits that are established by local state or federal law. The term family or household member is defined in the bill as it stands currently the same definition that we used in the TV bill, but it may be worth considering whether to amend that to align with the state level built around an intimate Partners, but it describes a variety of people that meet that definition. The Proposal would also restrict a landlord from changing lease to limit the number of tenants allowed in the unit after someone has moved out and so is actually it for example if three people live in and they're all splitting the rent that's our rent is Affordable to them and one person moves out. This would restrict the landlord from saying you can't move another person and you know, you have to handle the rent just the two of you and so it would limit the landlord ability to do that. So that rent could emit remain affordable for the people living in the unit. As mentioned in the the potential options around this bill. It also prohibits landlords from imposing any new conditions when somebody moves in so they couldn't they couldn't require a sticker screening criteria for somebody that's moving in the screening criteria that was used for the 10 of them selves. The last piece of this is that the proposal contains 1 exemptions for federally assisted housing units because those housing units can be subject to regulations that require a landlord to deny 10 and see if the member of the household is subject to a lifetime Sex Offender Registration, or they've been convicted of manufacturing or producing methamphetamines on the premises. So those are the major times of Castle 11966. And so I have a question about the the prohibition on landlords and posing a new conditions when a family or household member or roommate is added to the household. I mean you could be example of structure screening criteria for additional person or persons and the landlord use the tenant. So the roommate or whether or not their family member or unrelated roommates still with have to be screened by the landlord not necessarily has a right to still screen them depending on if the person was being added to the lease or not. I think is that the operative difference. I'm so if a person is going to be added to the lease as a tenant, so someone that's in a relationship with the landlord and the person were to there would be strict screen porch screening report where to go through with that person would end up being subject to the the rules around who is allowed to be a tenant who isn't based on the landlord if the person is moving in but isn't planning to to be party to the lease agreement then sure a landlord report but because of the right to have your immediate family, for example There's nothing that could really do about that screen report so they could still run the screening but they could not use the screening report to prohibit a tenant who is not on the lease for from being in column tank cuz I think we have some different definitions. Yeah, we're not on lease the right to require all occupants to be on the lease under his proposal in this proposal is mirrored in I think many ways. Mirrors in many ways similar law in New York, is that correct? Yes. That is it's a little more specific around if there's 110 or there are two tenants in the rental unit 5 similarly allows additional occupants dependent children of the occupant rather than the immediate family, but it's it's the 210 and or the space occupied Castle 11966 is a little bit less complicated in that it just requires the occupant and then there immediate family and one of the other issues that was raised in a losing her wondering if we deal with if the person who is on the lease passes away the rights of the non lease. Signing occupants to stay it. Is that something that we address here? That's not currently addressed in this bill, but it certainly could be addressed by Amendment issue and that also was something I think that was raised in the report. I think this is really important legislation as we heard and public comment. I'm in the cost of living in the city the National Low Income Housing Coalition shows that the average necessary wage to afford a two-bedroom apartment here is double the minimum wage. So it really I think points to the need of folks to be able to have roommates and we also know that 46% of Runners and thus are in the Seattle region are cost burden meaning they pay more than 30% of their income on rent. So By extending the right of leaseholders to have roommates when they're not their family members or otherwise, I think it's really incredibly important to addressing our affordability challenges in the face of thank you for your work on this. A quick question on how the the addington's plays out riding. Landlord rents to a single tenant, they are the tenant cuz they've signed on to the lease based on square foot definitions and other things let's assume that this this unit is capable of Legally housing for people. So the tenant has the right to bring in a family member and they can bring in one of the roommate. Okay, and then that roommate could also bring in family members say one family member now, we're up to four as those as a tenant ad says roommates is there requirements that they notify the landlord that they need to get on the lease and become tenants too or they just the requirement to notify landlord is not currently in this bill. It certainly could be out of that is a thing that you all think it's necessary, but it's not currently required that anyone notifies the landlord in. I'm sorry. I did your second question of the that sorry. I'm just the that you need to be on the lease. If it's a written agreement is an oral agreement then it's a it's a bit of a more fluid situation just because the tenant landlord relationship exists an oral agreement. It's just not clear if it's not written. So we're using the term lease to include month-to-month agreements. I'm thinking but I'd be curious to hear from folks in the audience have been working on this to to Think Through the implications either way in the case. Where a case where a landlord has a tenant there only aware of the single-tenant but tenant dies and then some other people claim will we have a right to stay here? How would the landlord even know if they've been living there or not if you know And you know from the landlord's perspective. I would like to the principal here I think makes a kind of sense but I do I am interested that the landlord should know who's there. That's probably a variety of reasons. Why knowing who who is in the tenant who is part of the living on there, This would be helpful. So figuring out how to do that. I mean a notification without the An accompanying right to to exclude would be useful to consider the requirement that a man should inform the landlord within 30 days of the commencement of the occupancy by a person so there it's not without precedent. Yeah, I know, you know if scenario, you know, you live in a place of friends in hard times. Hey want to come across my couch turns out after a few weeks it this might be a longer-term deal. Whatever that that would look like but to just formalized on some way would be helpful. I think so funny. I'd be really care to see the language to be personally little sensitive to how that's defined or what we do. I just from both putting personal experiences and just how that in itself in the context of where people right now are just really just trying to find a place to live. So I'm just curious so one additional person who is not a tenant families family or household member. Why one as opposed to two? For example, let's just say so we were just talking about the scenario of domestic violence. You see someone who needs help or sheltered and so forth and she provide to Consumer Brands Point. Hey, I need a place to stay but I have a child write my child 17, not 16. So I'm trying to I guess why did why did we choose just one additional person who is not a family member? You have your immediate family and then if you wanted one roommate, you would have the right to that if it was going to be more than one roommate. It would be a discussion with the landlord about whether there would the occupancy would allow that if the landlord is okay with that, but it really is a starting point. and again, the one roommates and bring family members in and so in the case if you're trying to shelter a friend who's a victim of domestic violence and they're bringing family members in that would still be Great, thank you. Again. This also will be coming back to us at the September 10th meeting of the committee and hope you can join us then and we'll be sure to get ideas for amendments to Yasha. IJ dad at 5 is the 2018 waste prevention and recycling report. and you know time for change Could you slow Seattle public utilities on the solid waste line of business here the annual waste prevention and recycling report. So first I got to get this closer. Thank you for inviting us here to present the 2018 waste prevention recycling report. I'm so this is an annual report to council where we are. Basically I'm talking about the progress that we've made towards on reaching our recycling targets. We also highlight programs from 2018 or the previous year every year and then we also talked about what we're going to be doing in 2019. We calculate separate recycling rates for both the municipal solid waste and then we for the construction and demolition debris and Municipal Solid Waste is single-family multi-family commercial self Hall. I'm sectors and then Basically, that's what we're focusing on today. I'm sitting on the side of right now is a lot of numbers this represents the the data that we can highlight basically are Citywide recycling rate declined in 2018 slightly by less than half a percentage point to 56.54 per cent the big highlights are that the total Citywide waste generation in 2018 was actually down by 4% each points from the previous year. And then we're actually 21% below are zero waste Target, which is based on the 20. 06 or 2006 what we export for disposal. So we're 21% below that zero waste Target in 2018. And then if we look just at our residential sector which is our single family and our multi-family sector are per capita waste generation number is at an all-time low of two points 1/6 or 2.16 pounds per person per day. So that's an extremely low number when you look especially National. And is that I'm going to love this so that includes garbage and recycling. Is it also cool composting to composting and recycling? So I'm waste generation and we'll look at a table is when we talk recycling hear it includes both the recycling that goes in the blue cart and also the composting that goes in the green card. So it's those two combined. I'm equal our recycling number with respect what we look at in the report. So what is this mean? And what does it look like? I thought this was a good craft is to give you kind of an idea of where we are. So first off when were talking about a recycling rate, that's a Target that we set and I always talk with my staff about where you hang your Northstar you tend to focus your resources and you tend to focus on but it can sometimes distract you from the big picture. And so instead of looking at a Northstar only. Let's look at the constellation and we're in the process of trying to look at what are the stars in the constellation not just the recycling rate which is a waste based rate. And so this picture gives you an idea of our population which is increased approximately 30% over the last 10 years, but I'm even though it looks like we're somewhat flat we're actually doing pretty well when you look at how much population this is residential only but our population has increased so dramatically a recycling rate has gone up and And our overall waste generation has remained flat. It hasn't gone up as you would normally see with such a population increase and such an increase and just economic activity in this area. Tuesday night agreed I focus on the percentage to the EV number to one point that look at that. It's absolutely not the thing that I really care most about and I think the per per capita tonnage overall and the breakdown between what's what's landfilled in what is recycled is the numbers that probably more important. I think. Yeah. I'm in the report. I mentioned that the state is moving away from a recycling rate Focus there actually this year they announced that they're going to stop. Cracking the recycling rate per se and they're going to be focusing on waste prevention and waste prevention is really what the top priority is its waste prevention and then reuse and then Recycling and so we have programs that focus on waste prevention and and reuse and then recycling but we tend to focus publicly a lot on just with the recycling rate is but when you look at the overall generation if we can keep that down and decrease that even better even more you may see the recycling right? Let's go down a little bit but overall we're doing better and we're doing better for the environment. I know one of the most maddening things in the world is all the packaging that comes with the stuff. We getting our life. It makes you feel any better about it when it's recyclable packaging but it's still not good and you know one way to make a recycling rate look right is just to make sure that everything is packed and 18 cardboard boxes and that just drives up the tonnage of recycling and makes the number look better. But clearly that's a bad outcome and conversely, you know, as manufacturers delivery folks. Whoever retailers reduce their packaging. That is a really good thing yet. I might pick her number look an issue that reduce the amount of packaging and then as we are dealing with the changing nature of packaging you'll see a more and more situations where the packaging is. What is recyclable where is a cardboard box we can easily recycle some of the more flexible packaging now is not as easily recyclable. So those are things that we're dealing with and I talked a little bit about this and I go into a little bit late waiting. Yeah, yeah. The ability to make our numbers look better because of recycling packaging that is more lightweight but it says you say that is recyclable. Right? So we have several on several occasions passed legislation that set recycling goals. We set 60% recycled Gold by the year 2012 and we did not hit that. I'm in February of 2013. We passed another bill setting recycling rates again 50% by 2015. We haven't had that are we considering a new metric and trying to set goals for meeting those metrics? And then in that case would it be would we be looking at a per-capita waste usage metric? So we're in the process right now of amending are solid. Management comp plan our comprehensive Solid Waste, plan and so through that process. It's only amendment. It's not a complete revision but through that process for looking at what are the targets? What are the metrics in the targets that we should be looking at and that will come to council probably an early 2020. So we've been in the process of doing the analysis looking we know we look at programs that will help us achieve our recycling right? But also are there other metrics that we really should be focusing on so that is something that will be coming. We will be going to the mayor's office and then coming to Council in the near future will probably be putting it out for public comment later this year or to the queue for some time. And yes as part of that process were looking at what are the other metrics that might make more sense a Morgan. I'm Department of ecology. Ecology has done a lot of work on what are the different things that you should be looking at from an environmental point of view and it tips it on that had a little bit. I think that's why Department of ecology Washington department of ecology is changing how their focus is. So we're trying to lead the way from a local jurisdiction point of view on are there other metrics weave should be focusing on it. And I know that our partners of hurricane County and our partners that all the other jurisdictions that we interact with regularly a really looking to us to lead the way in this area. I also want to mention part of this population when you're looking at it is changing where people live we've gone to where people are primarily in the residential sector in single-family, where were more and more moving into multifamily and that's also part of the challenge of keeping a Recycling rate up. So I'm taco and we have talked about that in this committee. Right as it relates to what we can do as The Regulators of the development of multi-family housing to help address what the outcomes are from people moving into different types of residential settings in the numbers of people who may have been recycling in single-family. They're being increased numbers of people who we need to help to recycle in in multifamily. And so yeah and another part of this to as we have people moving in from areas where they didn't have recycling or they had a different solar angle. So I like to talk about think of a tree and weave and it's a fruit tree and we've gotten we've gleaned all the fruit off the the low-hanging fruit, but we're try Get up to that hire hanging fruit, but we're constantly having to go back and get that low-hanging fruit and keep doing that and then figuring out how to get up into the tree branches hire to get that hire hanging fruit. Whether it's a recycling right or whatever kind of environmental goals that we set you're going to constantly having to strive up and that takes resources and it takes effort send it takes commitment. So and I appreciate that our recycling contractors are help with that as well. They engage with the managers at multi-family buildings and share with them their observations about the recycling stream and offer resources for how to increase compliance of the residents of that of that housing, but I do think we need to do more again as The Regulators of Construction of multifamily housing to to make it easier for tenants to recycle by requiring the inclusion of I'm access to recycling garbage and composting containers on every floor of a building located in in a way that we know will increase participation in recycling. We just take up before I move on quiz take a quick minute to talk about where we're at on that. So um and STC I have been working with stakeholders and collecting some new information since so obviously the council is very interested in that specifically asked if there is some technical details in the code as well that SDC INSP you are working with stakeholders on a package to send to council which I believe we're expecting potentially have some time this fall here in September with our contractors and then the community to we work with a number Community groups that, especially focusing on the multifamily sectors. So what are some of the factors that are impacting our recycling rate? What are the main factors as we did a home organic survey in 2018 and during that time we calculated that we were overestimating how much was actually being managed on site? By people in their backyard so backyard composting or on-site composting and so I'm when we're doing our annual report, we make calculations or estimates Based on data that we've had in a extrapolate forward and we were overestimating. So we had a 2500 ton decrease it just right off the top because we had been overestimating based on the survey results. We found that out. I'm another thing we mentioned and I think you mentioned councilmember her about the light waiting of recycled materials materials, though. We may still be diverting 100 plastic bottles there light waited to the point that they take up the same volume, but they're significantly less weight. So when you have a weight-based recycling rate that will just naturally decrease or look give the impression that you're not recycling as much even though you actually are diapers. The same number of bottles on we also have improved messaging. So I'll talk a little bit about the China blue skies next but because of the China blue skies situation, we have been working with our regional Partners. We've been working through a responsible recycling task force that we were part a partner in I'm out of that came a regional group that's working on messaging where we're trying to do unified messaging across the region on empty clean and dry basically teaching people how to recycle right and then also not be I'm optimistic recyclers and maybe now we're making it out to his people are thinking more about what they're putting in and so they may be diverting materials into the garbage even though they are technically recyclable. So we may have gone from optimist. To may be a little pessimistic that again these are speculation these last three or kind of it while the last year of speculation we don't have hard data that shows this but it's kind of that when in doubt throw it out. Where is Weed really like when in doubt look it up and then people actually put it and make it empty clean and dry and prepared China blue skies. The media coverage was extensive in 2018 it we had a lot of negative media Across the Nation a lot of recycling programs retracted significantly, you might have heard about to, I'm debating whether they were going to cancel the recycling program completely or not until the residents rose up. I'm so that negative messaging that was out in the media. We have a feeling may have impacted our own customers questioning whether what was in there blue bin was actually being recycled. I know I get asked about that all the time and you probably YouTube is it really getting recycled people on airplanes people on you know bus if he said they'll just as well as it really is and what I want to emphasize more than anything is everything that has gone in the blue bin that's recyclable in Seattle has been recycled. We have not landfilled any of our recyclables. So I want to emphasize that for a customer so they know we're doing and that's because we found domestic Market we found domestic markets. We also take the economic risk in our recycling contract. So we pay our recycling vendor solely to manage the material and then they sell it but we take the risk of the cost or the commodity and recyclables are basically a Commodities. So I'm yes, we take an economic hit over the last year. We're not making as much money off our recyclables, but we're still making money and we've worked very hard at finding domestic market. So we have changed and we had a presentation to you about a month ago. On the market we've changed to where about 75% of our Market or materials were going being shipped overseas to where about maybe a quarter of our materials are being shipped overseas. So so I think might be a related question as it relates to the light waiting. We are measuring our success towards our goals by Bali. I mean by weight not volume. Yes. Why is that and would a shift to a volume based measurement? Also potentially have an impact on the economic return. So that's something we're looking at in the plan. But why do we do that? It sees in a 30 years ago when recycling rates were starting to get rolled out and that's how tons are how we work in the industry. It's easy what you pick up its way that the transfer station or its weight at the vendor and then it shipped in it and Bales are based on tons. So they're not really based on volume. And when you have a compacted material versus non compacted volume gets tricky things that we're looking out though or capture rates and other through a capture rate might say will we know that a hundred bottles are going into the market we're going to do a study waste composition study at the end where we're actually boiling down into how many bottles actually made it into the recycling so we can do capture rates we can do curbside where we Take an entire neighborhood and we study at the curbside. So we're looking at the possibility of doing some of that capture rate work and there's other metrics that are coming out in ways to measure that we're learning about so we're that's part of what's going to be wrapped into the Comm plan. And I guess my question though is not looking at these different metrics not just for purposes of setting goals, but also to address some of the economic impacts if we are if our contract allows us to see if he can iMac risk is around a measure that is currently based on weight. Is that you, Chris reduced if we if we're getting compensated for the value of our recycling based on volume if that ends up probably not I I can't answer that off the top of my head to be quite honest, but I think the weight bass is how the industry works and so I'm not sure the volume is a practical measure, you know, it's like a commodity the materials the Plastics the paper is bundled it's weighed and then it's sold and they in the vendors or the the ultimate user said that material is buying it based on this. Bale of paper and the quality of that paper though determines the price that you can get for that paper. So the cleaner are material is that's what really has that has a significant impact on the ultimate economics think so some takeaways. from our study none of our recyclables or landfilled we worked really hard to look for domestic markets and open more domestic markets. We are still continuing working behind the scenes seeing if we can't bring more in the street to this area. And when I say this area, I don't necessarily mean just Seattle but to the Pacific Northwest where we can all benefit from those vendors who can process are materials and use our material. So we continue to do that and early on there were reports Republic having recyclable material that they couldn't move what ended up happening. So I'm Republic reported waste paper that they had stopped were stockpiling Waste Paper because of the material not being the price for the material had bottomed out Republic manages materials from all over the region are material only makes about that makes up about 40% of what goes through that and Some of the material that they were taking into their facility. I do believe that they land filled but the material that was coming from Seattle. We ensured was still getting sold on the market. Even if it was only $4 a bale as opposed to the $80 Avail that it was selling that because again, we're taking the rest as we're taking the rest. So we are we're paying them solely to process a material through the armor sword it regardless of what the ultimate in and so we took the hit and how do we verify that? The product is not going to landfill? So Hans Van Dusen who you know who am works with us. He is in constant contact and weekly on he'll go down and visit the Murph he verifies they give us reports on a weekly basis. So we we have that kind of and we also have some inspectors. We haven't done this a lot but more and more we're going to use our inspectors to kind of verify that the That's basically that personal. And what about when the recycle materials shipped to another country? How do we how do we verify in those instances? So that's actually been something that's was identified in the responsible recycling task force as problematic on there have been nonprofits that have tagged material and you know, there's in the electronics Arena that's pretty well-known. We're actually coming up with some protocols right now through the responsible recycling task force to try to figure out how can we verify that the material was shipping to Southeast Asia or other are actually being used in two or put into products and used as a feed source. So that's something that we actually have had a hard time with but we're trying to figure out protocols to do that. Yeah. Pretty much. I've covered all these already. So what are we doing now? What our actions were taking now? So we're targeting contamination and improving the quality of the recyclables. We're working really hard to expand on the domestic markets in for recyclables. We're expanding Outreach and education where we really working on that Regional basis. So I'm something we're well aware of is that people who work in Seattle don't necessarily live in Seattle and people who live in Seattle don't necessarily work in Seattle. So you have a lot of welchol cross-border movement. And so the more that we can work as a region and with our regional Partners to have common messaging the easier. It is on the customers who are using our system and the and the employees who work here to do the right thing. So that's something that we're really trying to work on. We're working with the property owners and managers to increase Accessibility convenience is really key. Not only in multi-family, but in commercial properties of all kinds and then we're expanding our food program. We have a lot of work that we're doing in the food rescue Arena. Am I am very excited about what we're doing in that we're working very closely with Mary's place and Industry even people who didn't realize there were in the food rescue world or could influence that like the transportation lab up at the u-dub. We're working with them to try to improve moving edible food in the hands of those who are food insecure and need it we're all so we work diligently of trying to translate or material or trans crate or material into other languages and in contact so that they understand it and it's useful for those where English isn't your first language and there were partnering. We're partnering both with r Local jurisdictions were partnering with are ngos in the area and we're partnering with the industry in general. I'm like the Plastics industry were working really closely with right now with respect to our bags were going to pull the bags out of the curbside at the end of the year and we're working with them to deploy more drop off locations and so will be back with more on that later as it relates to playing bags from curbside recycling imagining that there's going to be a robust patient campaign that is p is going to be doing enough. Yeah, we're working on that right now. It's actually going to go region-wide. So we're working with our regional Partners to come up with the common messaging and I would admit anticipate that it will be launched later this fall so that everyone's ready and knowledgeable about what to do with her plastic bags and film because it's not just plastic. We do have a plastic bag on hair but still there are plastic bags in our system. But also the film if you go to Costco you go to any you get things wrapped in film. So also what to do with those materials. And I guess it's a question. When I really appreciate the the regional partnering and you know, it's hard because there's always new materials we change our rules and then you look at them the mix of different jurisdictions across the region. I was doing some Landscaping in my aunt's house in Kirkland. And I found out after the fact that green is actually the garbage bin over there and took a little resourcing on the driveway which isn't so fun. But whatever had to work. I know that in Seattle, we probably have tens of thousands people that are so in the recycling could they talk to me all the time that know all the different things and every time something changes and what goes where and what is the weight restriction because we have the ethic which is awesome. But as you mentioned people are coming and going and lot of people don't don't track it by closely. So the things we can do recently will be really helpful. I'm curious what kind of dialogue? You were the industry has with someone like Amazon and I see you know, we get plenty of stuff delivered from them and I noticed the packaging shift overtime REI to you know, that they do a fair amount of retail. And so I think as you mentioned the cardboard boxes are fairly straightforward and at least that's nice that we know exactly what to do with them. And it seems like that's fairly valuable materials be recycled. It's a little frustrating though you when you get a shoebox put in another box at the exact size the same size of a shoebox and you think I got two boxes to recycle. Is there a way that someone could just designed the shoe box to be the shipping box and when you know, how do we do that? And then I also see the shift to more like plastic bags and things are delivered in and again, this is where the optimistic recycler shows up in me. Like if this is this a plastic bag, it's not quite where it supposed to go the bubble wrap things that are And so and I and I imagine that imagine that a company like Amazon is making decisions based on their economics probably both the cost of materials and the wait for transporting things on airplanes and all or however, they move stuff around to the both but they're also probably in closing costs on our system as they do that and a minimum we should be having conversations, especially since we have something retailers based here and Seattle to talk about what they're doing and I imagine they all have, you know, environmental leaders within their company. I don't know what those conversations would look like, but the third man had his conversations and even considering, you know, imposing fees to just recover costs me of the reality is that in the Plastic Bubble Wrap cost less money in our system and we want to say if you want to shift to that because it makes economic sense for you. That's fine. But we're going recover the economic cost you're imposing on us. I would be interested to be part of that conversation to tell us their analysis and what they're doing, but obviously that's becoming a bigger source of of the extreme weather is being recycled or not that we care about I can tell you that we do talk with Amazon and a lot of the Big Peach. Companies that are based here Starbucks Amazon Costco all of those on companies we talk to regularly about the packaging. We work closely with groups like the product stewardship initiative or very involved. I'm with a number of initiatives and groups and nonprofits are around the country that also are working with them the recycling partnership and and so we're working a lot of people think of the recycling stream and and I always say, you know of Seattle has control over a small slice of that stream we have influence and we're really trying to use that influence up stream. I'm where the products are designed and developed and that's where the Amazons and the other companies and that's where the products to worship initiative comes. We're also working with our local jurisdictions, and at the state level on ideas with product stewardship, you'll hear extended producer responsibility. I'm extended producer responsibility is kind of a the closed-loop the circular economy. I'm where we're working on both the national local state-level. I'm looking is that practical we were involved with helping right legislation. It became a study bill this last legislative session where they're going to be looking at the extended producer responsibility for packaging and whether that's practical to ghost a trot wide that would actually push the cost that currently our customers are paying us to manage at the curb with push those cost to manage that packaging upstream and the producers would create it's similar to what's NBC British. Columbia has a product stewardship extended producer responsibility BC recycles program. We've been watching that really closely and basically it pushes the costs up on the producers and then there's no Free Riders to so it's so You know right now it's not just Amazon. There's a lot of other companies. It's not the Starbucks. There's a lot of other companies. So trying to make sure everybody's at the table and everybody is paying into the system and it's been very interesting but we are definitely working upstream and trying to influence how products are designed and that they be developed in a way that a uses recycled content and B is more easily recyclable and see maybe doesn't even need to be there in the first place and maybe you can be reduced and actually see comes first. On that note. I just want to lift up in addition to my earlier mentioned about composting recycling access for multi-family residence were also going to be working on some Pasta Production measures executive has some proposals as as does this committee that we've discussed before in previous meetings and was lifted up yesterday and the Seattle climate action plan is to Enact legislation that will reduce single-use Plastics and we had intended to have a presentation here today to discuss other every other week garbage collection. We had invited a city administrator from Renton who's been doing every other week garbage for 11 years now to share with us their experiences am they were unable to make it. We also we're going to be joined by 3:50 Seattle. We're going to have them come back at a subsequent meeting when the time works for everybody. The product stewardship initiative is that at and industry-driven or advocacy group or is it a blend really their primary industry and actually the executive director actually just recently moved to Olympia. So we're having more easily meeting with her and discussing but yeah, it's an it's industry-driven in a response to knowing that they need to do better and they need to be more environmental and what can they do? So yeah, but it's a non-profit one of the things that I would be intrigued by if it were possible to see if someone from that initiative to come to the table perhaps with the peer advocacy organization like Sarah wace, Washington and navy someone from British Columbia. I know that my sense is released in Europe to have a lot more lot stronger than I close the loop product stewardship laws. And then a company like Amazon have a large presence over there and so is often times we are here we can't do this in like but you are doing it right across the border and it just don't want to do it but it might be nice to have a conversation and see if there's a role for Seattle to play in accelerating some of the ideas that are already working elsewhere. But but even with product stewardship effort came out of state legislation what we've been working a product stewardship in different pieces, like painted study or something, but what's coming at what came out of the legislation for packaging is there's going to be a study on his extended producer responsibility viable for state and what would it look like at a state level? Cuz it actually something like that works better and a larger macrocytic situation on because of just you talk about packaging and that crosses. What is really quickly he mentioned Europe most of Europe has extended producer responsibility. They also have what they call modulated systems. So the people are paying in based on whether container looks like and then they're they're paying less if it's more easily recyclable and it contains or if they're paying more if it's harder to recycle. So that study it's when we expected. I think they're just starting to go out but Department of ecology is charged and I believe it should be done by the end of next year, but I can get back to you on the specifics on I was hoping you were going to say before the next legislative session cuz I think that we could help set the table if there was a study to assist in your and others advocacy of the state legislature, but it sounds like it's not going to be a little optimistic but I think maybe before then next I mean, I think there's still An opportunity to have that kind of a conversation, even if it's not about the results of a study. All right. There's nothing further its 11:35 and the meeting is adjourned.", "end_time": 7015.0}]}