{"format": "raw", "annotations": [], "confidence": 0.9369569955412874, "data": [{"start_time": 0, "text": "Good afternoon. Thank you for being here this morning. This is a special meeting of the select committee on Civic Arenas. I'm excited to Chariton the absence of the co-chair councilmember war As We Wish You a speedy recovery. I will do introduction and in a minute after I go through some other administrative item. It's Monday May 20th. And the time is 10:47 a.m. We started a little few minutes late because I briefing went over again first. I like to approve the agenda. So there's no objection. The agenda will be adopted. Interjection, the agenda is adopted life goes to the public comment section will take public comment on item that appear on today's agenda and that one person sign at mr. David Haynes. Mr. Haynes come forward and speak up to minister to talk on our agenda items this afternoon. City Council vote on city council needs to reject the permits for permanent tie-backs and renegotiate this horrible deal to co-op Key Arena using a hundred million dollars of taxes to dig a hole 15 feet down into the concrete. The LA Consortium is using Seattle as an inflated business write-off while denying Seattle 21st century world-class venue. The fact o b g is cutting a hole in a rooftop to distract with a view of the Space Needle justifies tearing the whole Cold War concrete structure down and replace with an advanced 21st century world class venue Northeast Shady rinky-dink Arena unsafe cuz the rooftop is already cracked spackled and repaint it on the corners. Also the amount of dust inside the arena will never be clean proper. There will always be dust inside that venue potentially ruining the first generation of pro hockey team Seattle Council should put an injunction on the LA Consortium and renegotiate. Deal to replace the entire venue. No NBA team will ever play under a 60 year old cement slab of rooftop that looks LSD inspired by cartoon on The Jetsons yet. Timlin Wiki an OBD is allowed to get away with buying the Integrity of the city council resulting in a circumvention of Arda might deny democracy wiring up a city council member this Shady deal has already been sensationally inflated for business write-offs into falsely Asher Council if it's a billion dollars, it must be world-class reject a permit out of principle. We don't need an artificially inserted Foundation to take place of an already cracked cement structure. Also Timlin Wiki and OBG is endangering the people at Folklife with his toxic dust plumes with big green balls that don't capture the toxics renegotiate this deal. Why is city council voting for Tyvek suit should be more scientific and Engineering not political there circumventing certain unsafe realities. Because Goldman Sachs involved. Deal. Democracy in action there. Okay, that will close our public comment comment section and we'll move to our agenda items and thank you all cast members for being here before we do introductions does have the items 1 2 and 3 read into the record. Could you just want to read them into the order that I was going to read them? I think the construction schedule update the second item on the agenda is the arena at Seattle Center Financial due diligence report. And the third one is an update on the Seattle Storm lease modifications. Okay. Thank you for that. I think Linda was at the helm ready to read those introductions first begin. Jerry Bruckheimer investor Tod leiweke see you and Johnson was OBG Okay, thank you for being here. So let's kick off the first item, which is a construction schedule update and let's proceed. Very good will thank you very much. It's a little bit of History cuz I think it's important for the council to take stock as to what really happened and when it all happens in pieces, sometimes it's hard to stand back and really understand what took place. So indulge me on a few slides. I'm just a little bit of history. But the last time in Arena was built in Seattle. As1962 is a part of the World's Fair and it served a great purpose. It was not a very elaborate Arena was a flat floor but it facilitated at World's Fair and then five years later the sonics came and great things did happen under that roof, and we were all proud as a community but it was realized that Arena simply wasn't going to get it done a flat exhibition space was didn't constitute. So 1995 or renovation was done and the renovation did some things but didn't do enough. And it wasn't very long after that the word started circulating around town that if the arena wasn't fix things could happen eventually perhaps an NBA team leaving. I was running the Seahawks and lo and behold and 2008 that very thing happen. Community sensibilities were such that it was a Rubik's Cube in as we did so many things in this community. The one thing we seemingly couldn't get done was to build a new Arena and there were significant challenges and doing that. It was an asset owned by the city and was in real Decline. And now that we live on Seattle Center grounds. We fully realize how many of those stakeholders were dependent upon this city council figuring this out and it was an ass that not only a declined it was starting to really negatively impact Seattle Center and its final year of operation. We had less concerts at our Arena than they did in Des Moines Iowa. The community was deprived of many acts that just simply skip Seattle because of the loading docks word adequate the building was into my eyes. So we had to you made the right decision because the arena belong to where was but it had to be fixed. It had to be not only ready for events that had to be ready for NHL and NBA and that was extraordinary League complex because the current footprint at 400000 feet didn't allow for a modern to Reno and it's Landmark status would allow you to go out or up. So we had to create the first Subterranean Arena really in Expanding for 400 800,000. The other challenge was privately financed. This is not what happens games go to cities and say if you don't do this we're going to leave the city simply said those buildings going to be privately to finance that. What was one of the landmarks. The city believed all those things could sit on my lap and and so in 2017 the city issued an RFP and this is a picture of this is actually one of my favorite pictures because of the next picture that's coming but this is the current status of the of the building and you see a back of house that has an Antiquated loading dock that loading dock caused a lot of shows just to skip it was a terrible entryway into our park and you see an old Antiquated building but dreams do come true and this next image shows that dream coming true through the courage of lots of folks through the unanimous support of the city council in two years this spectacular building will open we believe it's the only Arena at a park in the world. We believe that it's defendable that this will be the most if not one of the most beautiful Arenas in the world. It's scales it fits. It has no back of house. It has a beautiful in Freeway, it looks tan from 408 hundred thousand square feet and every man woman and child in. This community will have a reason to go and celebrate under this roof. I'm going to talk more about those events in a moment, but to my lap desk and Jon Snow's build many things in our community, and we were very very fortunate that he this past November came our way and is Layton Construction, Spokane. But I think I love this picture because it shows the footprint and it emphasizes that we really are part of a group of tenants out there and we're spending a lot of time talking but with them as we do our work, but in addition is Todd mentioned if you look again North is to the left the south end of the building which used to be loading dock and blocked off by old buildings that becomes a wonderful fantastic entrance to the building and alongside Thomas Street, which is long been talked about at the pedestrian street a huge important entrance to Seattle Center. Everyone working on this project. The entire team is their pumped on a daily basis. We have the best designers of Arenas in the world. Mortensen is consistently one of the top Arena builders in the Country CA icon has managed the process more than any firm and we have a strong mechanical electrical engineering firm Emilia. A wonderful team and from my standpoint. I live through the history of the building. I went to the World's Fair. My first concert was in the Seattle Center Arena. I went to the Sonic since when I was 10 years old, so to me having this building at this really sweet location and memorable location is a key thing that makes it work just gives you a little more look at what the building did is Todd said it started out at flat. So if you look at the line there the plaza level that's what we existed until 95 when the decision was made to go down and it went down these 38 feet. But what it didn't do was go down from drip line to drip line. So if you look again it was in there or expansion that got into the 400,000 square feet. What we are doing is building a solid back of house going down from drip line to drip line in really increasing the square footage in the bed with built-in almost doubling it and which means that I'm a Fan Experience standpoint all the facilities. We need I will be there in from approaching the building. I think this is really important to get so it will be very approachable become but you'll be coming at the plaza level and then once you're in you look to go down so will be a very intimate ball. I think it'll be without a doubt and one of the best in the country. But before we build this brand new Arena under the iconic roof, we have some work to do and we're in the process of doing that right now. So we are currently doing the demolition of the building because again, all of that will go away and then we will go down another 15 feet hot to haul out about 600,000 cubic yards of dirt, but this is a interesting phase and people are hard at work on the site right now. We have about a hundred and twenty people on site working right now on the demo. This looks to the South showing some of the buildings that have been removed already. It's at its peak will probably will have over a thousand people working on the site. This is another great feature the building. I think, you know beyond the iconic roof. We are taking all of the glass out of the building categorizing it hauling it down to a warehouse in Canton and then we will bring it back and reinstall it is part of the landmark status status of the building. So again from people like me to walk in that building where they were 10 years old, it'll it'll feel a lot like that until you get inside and then it's time to rock and roll so to speak and it gives you a sense of justice how fantastic that would the bull will look coming in on that Plaza level and one last feature I did want to talk about is the back of house. We will be bringing in a tunnel from the Block south of us. They will go underground to eight loading docks rather than the two that are there right now. And again this this allows the building to be approachable from 360° and we're very very proud of that. The reason we're doing all that is too grey world-class events for our city and create a place for every man woman and child want to come and we've talked a lot about the NHL in the NBA but this is going to be we believe one of the top concert venues in the world. We have that on good word from the largest live entertainment company in the world Live Nation. They love what we're doing here acoustic lie. They love what we're doing the creative back a house that will be perfect for the artist and we are as excited about that as we are any other part of this project of how great this is going to be from a music stand point because of Rd parentage and music we deserve nothing less. It's going to be spectacular for basketball. We study the sidelines. There's four basketball Arenas only in the NBA are side legs are better than two of those for this is a rendering of the storm and we are so proud of our partnership with the storm. And and we think this is going to be a defining moment not just for the storm, but for the WNBA, this will introduce to them all sorts of new opportunities to serve their customers to serve their fans at a world-class Arena and we couldn't be more proud. We're hoping that their their Championship way is will rub off on our other team. It'll be coming to the building soon that I do want to say that we we're we're fully committed to the NBA playing in this building. We think it'll be perfect. We think of his building a bed around in 2008. The sonics wouldn't left and we're intent that this building's going to help bring the NBA back. We built an economic model. We build Sidelines we build locker rooms. This will be a great home for the NBA. Customer Brian, did you say there's only for dedicated single NBA? Where did NBA's National tenant? And so what are the reasons the sidelines are so fantastic in this bowl and this bowl really was developed out of Principle as we only put in one ring of sweets and it was Temptation privately-financed English to put in a second ring of sweets to help them the economic model, but what that would have done is would have dramatically changed the bowl and a key signature this building. We think it'll be on the exterior one of those beautiful buildings in the world, but the interior bowl is going to be absolutely magical it will be Steep and it will remind people of the great buildings that existed in the day and you can see the Steep Sidelines here for a storm game. We also going to post a hockey team and this is showing the sidelines of that steep Bowl. You can see if you do ever to go we suggest perhaps not the upper deck but there's a beautiful glass window on that North End where people will actually be able to look at and do you what's happening in the arena and it's we've started to get better renderings and more literate in the red Range Rover realizing just how spectacular the tolls going to be and it's you know for the fans to sign up for tickets Dave. They weren't yet aware of this and so we're so proud of how this is unfailing. Let me back up just one more time and work we're going into Vaporeon animated Acoustics were going to invade other things are one of the Innovations to see here is to scoreboards one over each basket one over each goal and we think that that makes more sense than the big long gated scoreboards, which tend to buy for Katrina's and the reason you're coming to an Arenas to be with your neighbors and your friends and to celebrate and I felt those big scoreboards diminish that instilled us the first arena in the world to have two dedicated scoreboards. Backdoor hockey the fan smoke March 1st a year ago, 32,000 depositors stepped up and gave life to a franchise and we had to convince the NHL that we were nhl-ready and that sure helped. This is our ownership group and I won't introduce to my right Jerry Bruckheimer. Jerry could be many many places today, but chose to be here in Seattle and Jerry if you want to say a few words, I'm so excited about first of all the city and the enthusiasm from the fans and then just the with Tim and Todd doing this. First of all, no tide was was instrumental in the Seahawks and helpful in the Sounders. And so I think that's that's exciting for us. But also Tim is built some of the great franchises. He brought to Stanley Cups to Los Angeles to The King and I know you'll be part of choosing. Our Management Group for the hockey team and I know with his great leadership. We will get an NBA team here also, and that's exciting part of the project for all of us to bring bring a team back here. Other great things have happened. So Seattle did not have one sheet of ice this beautiful city of ours and that was a recreational ice. It was people who want to curl it was a young boy and girl dreaming of Sunday figure skating in the Olympics and we just didn't have it. So we were very proud of our ownership group to commit to building our project at the Northgate Mall little Act is the centerpiece of the Redevelopment of Northgate mall, and we have a brief video here. We'd like to show if we can chew it up again. Seattle a city that's world class in Fort Worth in a city with a deep connection to the outdoors. It is fitting that it should have a state-of-the-art and I sent it is representative of its Community build within City Limits. This new training facility will be Seattle's first home ice in decades three NHL regulation will offer the opportunity to serve as a gathering space for our lice Sports community. Whenever native Timber beams it will embrace the natural light in the merse the Publican the experience of Hocking while integrating Pacific Northwest inspired architecture. A best-in-class said he Joe Walker room and training area will ensure top talent just recruited and retain this facility will expire to impact the sport of hockey in the Pacific Northwest for generations to come this facility is your Seattle and that's under construction and we're hoping to break ground next January. Just for the record. There is a sheet of ice in Seattle with the Granite Curling Club. Find a hangout. And I'm sure they'll welcome additional curling facilities in the city of So if no questions know the questions will move on to the next agenda item prices or sometimes positive surprises. If that's not surprising that this far in the construction. Is it going as smoothly or there been any unanticipated? We say we are we worked really hard to understand this site and so so far it's really progressing exactly how we want I'd be exaggerating if I didn't say that holding that roof up while we're building the building will have his challenges and you said but we have a really smart group of structure engineer as we brought it another pair of group. I feel really good about where we are. Certainly the price tag is greater than we thought but I'm so proud that our owners have not cut 1/4. I'm in a fact we think the rain is going to be better than anyone ever imagined. So we're very proud of that. Excellent. Alex really quick on the you showed the the glass viewing that from the outside yes to watch the event but you'll be able to see the spirit of God is Spirit of the event. You can't see the base floor people cheering in the light is a neat feature to have someone be able to where you can go down and look into the building were down by four. That's where I might go and just watch and see if the crowd starts sharing again and I'll go back yet. Excellent. Thank you. pressure canner the second item on the agenda Is the financial due diligence. Peace? second item Can we go? so on audio and hopefully on video here in a moment after I get through just the slide show at which is only just once once live here. I'd like to introduce David Abrams with Inner Circle Sports and a quick reminder. Mr. Abrams was retained through our city attorney's office to provide Financial due diligence of the memorandum of understanding between the city and the Oak View group. And as you'll recall when the Oakview group for submitted its response to the request for proposal over two years ago the cost of that. Project was approximately six hundred million dollars and by the time the city executed the development agreement last September that cost had risen to seven hundred million dollars and then this past March we learned that the cost is now between 900 and 930 million dollar range. We've been hearing some information through the media that the costs are continuing to rise and there hasn't been much talk. However about who's paying for that and as we've been consistently messaging throughout the last two years the cost of this arena is solely the responsibility of the developer. It is privately financed. And so I just want to make sure that I'm emphasizing that point here. Okay. Mr. Abrams will be providing his assessment more specifically he's going to talk about the memorandum of understanding and how that work has led to his being able to answer questions such as does the arena have enough funds to complete. This project is the city protected if the project costs go up again, you know past the 930 Mark and does the general contractor have the ability to complete this project and once the arena is operating. Will arenaco be able to fund its debt service. So with that I'd like to put mr. Abrahams up on the screen. All right. Good. Thank you David. Go ahead. If you would like making introductory comments if you'd like. 20 months ago. I started working with the the shity on on several topics the initial engagement with the city between the city of Seattle Inner Circle Sports was to review the memorandum of understanding between the city and Oakview group to determine whether there was a transaction that could be accomplished and under the the guidelines that were were asked of us in during that negotiation process and I did that in the first few months of my working with the city on the summer before last. Once the city then turned into its memorandum of understanding with with Oak View group Inner Circle Sports work with City staff to negotiate along with the legal team and you're outside legal counsel and other Consultants to lease and development agreement between the city of Seattle and Seattle Arena company LLC, which is the developer that is under the umbrella of Oak View group. So we spent quite a bit of time discussing issues related to financial sufficiency their ability to obtain the appropriate capital and the ability to finish the project as well as look at the financial models and come up with a algorithm or a financial Financial methodology that would both give Comfort to the city and repay the city for income that it was already receiving. Seattle Center and so icy been there. So I am assuming that he could speak to that if if need be so that was the second leg of our due diligence the third and probably the most complex leg of the due diligence. Once we agree to the lease and the development agreement was to review Arena codes compliance and with certain conditions of section 10.1 of the development agreement as a condition to demolition of the existing Arena or at least part of the existing Arena and construction of the new Arena as well as additional due diligence related to the closing on the arena codes financing. So I think the most pivotal issue from the city's perspective and from our perspective in working with the cities did arenaco have the capital build equity capital and debt Capital to complete the project as you were told a few moments ago. The project has increased since both in scope and cost and so this was a Moving Target from time to time to determine whether there was the ability to both borrow and put enough equity into the project to make sure it was complete protecting the city's interest on a number on a number of levels including making sure the project was going to be complete making sure the project was going to be built to the specifications that the city agreed to and lastly to make sure that the operating capability of arenaco was such that they would have a sustainable business model and could pay their Debt Service and not an end as well as pay the city for their obligations. So with that I will start of step back and let you ask questions or if you'd like to hear more about specific issues. I'm happy to do something. Thank you David. First of all, nice artwork in the back of you there. How has the first things for the diligence? And thanks for protecting. Our interest is is what predict protect the public interest getting financial information getting are you do you feel as though you're establishing a relationship that the financial information forthcoming you're able to adequately do your job or has it been somewhat less than ideal into the ability to review certain confidential materials of the developer their lender there construction management company that were Not in the public domain and I spent a fair amount of time reviewing a number of documents on the cities that have along with the city's external legal team and report back to the city my findings and I found it OBG, but it again there they were going to quite a bit of change in the project scope in project, but they were willing to provide the information to us. It wasn't always the simplest. Sometimes we have to go to their lawyers officer to their offices in New York City to a review documents, you know physically in front of us and couldn't take them with us. So from that perspective, it was a bit cumbersome, but I believe that everything I needed to do my job was made available to me and I'm Not only was I able to review on numerous occasions when changes were made to the project. I was invited back into review specific documents and had the ability to ask questions. Of the developer of their lawyers of their Partners including mr. By bonderman team about the hockey franchise as well as the league and and the construction management from so I feel that I I had all of the tools at my disposal to give good advice to the city. Thank you David were there I assume you're finished with your remarks in this is just Q&A. Okay, any other questions from any of my colleagues for the good of the order cushion, you're grabbing the mic is just like to just conclude by saying simply that Mr. Abrams has deem that Arena code does have enough funds to complete this project and that if the city if the costs were to go up that the city will be protected correct and that the general contractor will have the ability to complete this project. That is correct. And once the arena is operating Arena KO will be able to fund its debt service. So all is in place of the 10 .1 conditions actually. Tube for the city to close with over with arenaco and 4 Arena Cove to close with their lenders in so we were in agreement with all those points that Kirsten brought great. Okay. Thank you. Don't remember her bolt review, but I'm interested to know whether or not there is any within that due diligence review for the delivery of the Arena project whether there is consideration about how in cost at increased costs associated with that project impacts the Northgate project at all. I haven't I think they're two separate projects and so but whether whether or not you know, David, I think that some of the lenders and developer than investors may have their hand and both projects. Could you answer a council member the overlap for the increase in cost in one would impact the other do a little work offline to figure out that that issue thanks for bringing that issue up. I'll make it closer Mark unless I can smell Brian just want to reiterate and I don't know then if you're comfortable, hear it all too, but I appreciate all the work up front and on going on this. This is the the moment where I feel like worth most exposed. We've we've stopped operations of the existing Arena, you know in a couple years when that is complete and it's up and running. If for some reason the this ownership group decided to walk away from it, which would make any sense. We would have a something operate. We could either write choose the operator ourselves or easily find someone to come in. But at this moment, you know, you see the exciting photos of the thing that's partly torn down. That's where I think we're most exposed again. I want to be clear. I have the utmost confidence in the arrangements going forward that we're good, but that's I just wanted to check to see from the budget office. If it is, you know, we're confident internally. The pieces are in place a lessee. No one would start a project like this if they intended to walk away nothing. I've heard today and flies other than the fact that the cops are going up a little bit as one might expect on a project this big. I'm the Killin It seems there and the security seems their report back on this very issue. Just to tear it down and they promise I'm going to have the resources to rebuild it. But you really want to be sure they do before they tear down which is what we have done. The scale of this is exactly in any case. I have the flexibility of Darien. So we do have that precise conference. It's already moved forward. Can they do what they say they were going to do and show them the moment that they agreed to have get their capital in place to be able to to to finish the project. That was one the second one was allowing them to draw on their lines of credit are there loans from their lenders until they had access to the capital? I think we were holding our breath a little bit. How do you say that someone facetiously but it's concerning that if they didn't have access to that lenders Capital that would have been an issue for us. And so we felt that the controls were in place the amount of contingencies in place the collateral that is put in place for the city in the event that there is an issue where sufficient to handle any cost overruns from where we start today and that's the last sort of hold your breath moment is when they open. I mean we're all going to be looking with great interest over the next two years during the construction process in the city will have open access to information along the way to make sure. That any issues that arise will be front-and-center before citistaff. Thank you David Katz America's Alles. I just wanted to take a moment to thank everybody who's been working on. This project has to acknowledge that as a city council. Of course, one of the core functions that we have is to exercise their oversight function particularly a very significant capital projects of which this is one and I appreciated directors dad's direct questioning to mr. Abrahams around these are the things that you are supposed to answer for us. You are answering these in the affirmative for us. And now we have a green light. I was wanted knowledge that I heard from Mr. Abrons that he has access to confidential information that is not publicly available. And I think it's important for us as part of our work around transparency you to also acknowledge that that information is not available to us either and to the Royal we of the city of Seattle family and this Ravens is our high. Subject matter expert and he is you know, he's got to adjust his own set of eyeballs on this confidential information. I just want to acknowledge that it's an interesting situation for us to be in as a as a council who has ultimate Authority around oversight and and it requires us to to give mr. Abrahams a significant amount of trust and confidence in his skillset and in his ability and in his independence to provide us with the information that we need that tends to be conclusory and nature as opposed to seeing his math and the formula that he's using so I have a little bit of discomfort with that but I acknowledge that it's appears to be inherent in these types of transactions, but just for the record want to make sure that I express that little bit of anxiety and also sort of that tension that exists in terms of our oversight role and what feels like a pretty significant delegation to mr. Abrams out that rule. Thanks for those comments appreciate those comments. So as we as pretty good segue to go into the storm lease modification. I did just get along and say that for four again. Mr. Brock. I'm going to be here. Thank you very much. He's got a few more hold your breath moments during this. We're I'm sure you're happy that we're still concerned about your eye on the situation here. There's serious Capital at stake here. But again the structure we've tried to set up with with with councilman Gonzalez for the admonitions. I think it's the best model to where we've hired showing in the pinna to make sure that we're protecting the Public's interest in again thus far they've done everything that they've committed to do and I'm very pleased with how this is done rolling in the the ownership group of made them their selves very accessible to me. It's about access and getting good information. So, thank you David. I need David offline. He continues to be contacted us since his contract is through the city attorney's office. So let me know to answer questions through Kirsten and that and just to make sure everyone understands the nothing was done in the Blind and it was apprised of every decision or every bit of information that I did I had and so the legal team both external internal your city staff were all kept in the loop on on all matters. And so well, I relay my industry knowledge and experience decisions were made in his jointly. Not not not singularly and so always in the best interest of the city with no conflicts and always making sure that we are upheld to the to the standards that you asked us to perform to through all of the documents that you agreed to. Okay, thanks for making sure we don't have nine independent collars and we go through the system that we've established get us move back. Let's move into the storm lease. Thank you so much. I wanted to preview for you a piece of legislation that will be bringing you shortly that would seek your approval for some minor modifications to the lease agreement we have with the storm and in particular the potential payments to the storm do they cost and lost revenues if they can relocate their their games for at least 2 Infinity part of the three seasons, so just a little bit of History here and then I'm going to talk to you about the changes that we are proposing and their changes that we think are necessary or advisable in the context of rather than outside and we think that's in the city's interest in the near-term and then also in the longer-term to preserve the storms fanbase as they become one of the tenants of our new building. So just here just a little bit of History. 2017 negotiated the council approved a long term use of even for the for the Seattle Storm 4 Key Arena or board successor. Arena few will be around Sue 2028 potential is not the likelihood of the renovation occurring and the team being displayed. So we anticipated this in the original use agreement and coming back to you for some tweaks. So what we can to enjoy the benefits of that long term tenancy, we had to be reasonable reasonable and protecting them from the financial losses. They could occur in Quran for for being his place while we remained the arena if you will, so that's that's the core reason behind the city. I'm going to step up with some financial assistance to the storm. So pretty original agreement. 2.6 million dollars per season plus a small amount of if there a playoff games and I like that in a second and that that money was designed to both offset direct costs. So we going to play both in Everett for some games and also on the u-dub campus at the arena and then also they face the prospect of lost revenues. Is that what they're not the fan base with travel have to be out of the city wasn't it and using an open question and then to highlight the changes were going to bring you are going to focus on the first two seasons 19 and 20 cuz it's for those two seasons that the city is directly on the hook up for 2021. Reno developers will be on the hook and that was part of our negotiations with them was to create incentives on all sides to try to get to work done as quickly as possible so that there was further delayed at the developer. Does my Turbo bullet under the city's agreement with Seattle Arena that's under the current agreement prior to any actions would pay the up to 2.6 million for 2019 and 2020 that correct answer to 2.6 million. Is that is that sort of a reimbursable requirement given that we don't know what the actual costs are and we wouldn't want to pay more than what the actual costs are. So we have at least ounces Baseline that they were they were paying at Seattle Center, which we know well that is part of what the revenues were and what the revenues are and that's the difference between know so that we're actually beginning to work out the details of how that that verification will take place, but that's exactly that's exactly what this is a reimbursable. And you'll see as well as I walk through this the original structure and the proposed new structure. Both are not just a blanket payment. They were designed to have incentives given that that that that the storm is in a position to both the control cost and potentially to minimize the lost in revenues. You want to be sure that although we look the city was going to step up and help them financially like check the day to would be incentivised if you will do the right thing. So with the NHL Seattle about the terms of the agreement going forward and a witch that on the left you a little box that describes the original terms describing you that the season level payments through the capital structure exists for individual games. So if there's a partial Spicewood in season 3 it might be per game rather than on this preseason scale with the fundamental and centers and structure of the same. So unoriginal we were in particular offering significant financial compensation on the on the revenue side or expectation was that the storm was the best position to control on a car outside is it would be directly negotiating agreements with an arena out of the city was what we had originally anticipated not hard to think of them being either can't or Everett. So relatively Less Conversation available on the cost side, cuz that was completely in their control the day we losing it again revenue and I wasn't necessarily much that they could do about that. So that was a place where we felt the city was. Best position if you will to offer assistance on the revenue side, but we said was for the first $850,000 we would cover 100% of their lost revenue. And that's for your question. I was a calculated is how much they were turning on average at the Key Arena vs. How much they would end up taking in and we have to find the streams of Revenue there that are relevant for the comparison. So we going to cover all of that is not their fault that you will think I just placed at the same time for revenues above that level of all other Revenue again with the goal of giving them the incentive to try to try to maintain those revenues and in total we said that we would pay a total of 2 million dollars in a small amount for playoff games on the cost side the total we cover the first $500,000 and 100% Is it going to what's the sense that but I first 500 wasn't going to be anything they can do about it. That's what it was going to cost relocated a minimum above that we would cover a share and he and that was capped. The cost side was Captain 600,000. So the total was essentially 2.6 million what we discovered since and it's really exciting possibility of playing at Arena make it still called Alaska Airlines apologize. I'm picking bugs in the room that's critically embarrassing than anticipated because I got is not air-conditioned. It turns out when I sing about our elderly fair weather here in the Northwest University hadn't found that need to date. So in order to host games for the for the summer and university has agreed and has been worked out to install temporary air conditioning essentially using the the air circulation system that exists. There's nothing else to eat the building in And the compressor if you think about it and an air conditioner located just off just outside the building that will bring air into that circulation system. So the storm recognize that they were going to face significant City of Lemoore cost than had been anticipated and at the same time allowing them to play their or having them here Mr. Noble slide in the slide on the previous Slide. The question I asked was whether or not those bullets represented the current agreement. And that's a two-point that discusses A 2.6 reimbursement looks to me that this slides says that the reimbursement is 2 million currently and the proposed new reimbursement is 2.6. That's not correct. So that the total driving causing problems. So the total cost is 604 total of 2.6. Perfect. We were trying to incentivize them to stay in the city. There's more cost in the city and less lost Revenue so that the situation has flipped there and as it turns out they're not going to just play in the city. They going to do a little bit of both. So simple simple simple for everybody and better incentives for the city of keeping the games here and helping us maintain that fan base for when they return better just to group together again providing comprable incentive. So but will cover the first significant share of combination of revenues and costs because there's nothing they can do about some share of this and then beyond that will provide for them will help cover the cost would give them a reason to try to keep those costs something less than the full 2.6 but we haven't changed the total just just the arrangement about how it goes. Thank you, and I could go further, but I don't know what we're doing here. We never anticipated originally and this this will open that possibility without increasing the city's Financial Risk. Any other a premonition tell me a little bit about the storms reaction assume this is all the receptive to stay there at the table that plays with this current revision. Yes, you know, the original didn't didn't really fit this model and we assume and it writes it that we'd want them to try to do the best. I could to play games here in the city. So they are we working very closely with them and they are strongly supportive and it is still is the think of AAA Alaska Airlines Arena at HEC Edmundson Pavilion. I got the best of all worlds. Did you have a question? A couple questions. So the is the incentive to stay in Seattle and better than this or is there different languages that's out there taking on increase cost to avoid lost revenues make sense for them. And then in the previous Arrangement, it didn't really write that they were only to get covered so far on cost so and and revenues are relatively open. So we are going to cover the Lost revenues in a larger share and I wasn't what we wanted and it certainly isn't what they wanted. So this works better for everybody and you've implied that it might be a mix is that for Geographic diversity or is that they're just some dates and unavailable you supposed to use a can with u dub their preference would be to play as many games as possible here. There are issues at the beginning and end of the season in particular. Robustly in session if you will find some conflicts over the summer as well. And then the other shift on here is the percentage of reimbursables Above That Bass 1.3. Was there any specific not to that or somewhere between 80 and 65 simple seems like a value in all of this as well. So this will have to be formally approved in the form of an ordinance or is it required to go through when when might the timing be on that? What are you looking at getting lawyers to put in the proper form and get you a bill? So I think we can get you a bill in the next couple weeks. I was in order I would be appreciated by all. Okay, anything to add in closing I Christian or we good? Insight as to why the proposed agreement changes only relate to the city's obligation for the first two years and not for the years that follow. The reason is the storm in discussions about their long-term partnership and it's felt like I made more sense than for them to think about that third years and years are following that broader context but not that we really needed to going and we'll keep you updated as well to take send feasible that they also reinforced what I hope our our shared interest to have the obligations incentivize games being played here in Seattle. I also have that picture to maintain and build on the same and he's assured me that they understand that in that interest. We love our storm and so as a presenter comes forward and I believe we need to have this read into the record so we can vote on it. Items for resolution one88 a resolution amending resolution 31857 providing conceptual approval of significant structure team permit to Seattle Arena company LLC to include the construction of permanent tension tiebacks in portions of Thomas Street East of 1st Avenue north and west of 2nd Avenue North and the long occupation of these permanent tension tie backs in the right-of-way to enable the renovation of Key Arena at the Seattle Center. Okay, Marshal when we start with introductions, you guys look pretty sure she got your game faces on here and let's try to light it up or Marshall Marshall Foster. I'm the director of the city's office of Waterfront and Civic projects of Transportation. Thank you again for having us. We're covering a lot of ring the ground this morning and I think this is your final item. This is actually an amendment council members to a resolution which you've already considered the key thing that we're doing this morning is making a modification regarding the term permit on Thomas Street at one of the important aspects of the design that you saw from. Mr. Li Wiki and Ken Johnson is this idea of really reclaiming Thomas Street as the front door of this new Arena. And in order to do that. We are putting much of the back of house functions that access for low. Unloading for broadcast trucks for moving in and out major events and concerts below ground so that the Public's experience of arriving at this Arena and arriving at Seattle Center on Thomas Street will be a great Urban Plaza space essentially very different from Thomas Street as you exist as you experience it today, if you can picture walking down Thomas basically chain link fence and loading docks in order to do that. One of the things that the building has to do is create a structural wall along the north edge of Thomas Street as well as build an underground tunnel from the site just to the South which they also control and in order for that wall to work functionally structurally. It has to use a system of tensioned tie-backs. And so I'm not going to go too deep into the weeds of that but you actually see these all over town. When you see construction. You see the excavation of of some of our downtown sites tie-backs are Basically a steel structural system that pushes from that wall. You see underneath the the soil behind it and create structural strength. So that that wall as it goes down is holding up that that Walt Earth behind it. So in order to really capture the opportunity on this site, they need tie-backs that extend under a portion of Thomas Street begin. This was anticipated but as we went deeper into the design process, the precise details of those tie-backs are now known and that's what this amendment would do is come and get the exact plan for those tie-backs reflected in your in your resolution. Without further Ado turned over to Amy Marshall noted in December of last year you providing conceptual approval for the tunnel as it is under, Street and just a quick thing about turn permits there for long-term occupation of the right-of-way you off in the buildings and Sky Bridges downtown The Pedestrian tunnels between buildings all those require a long-term permit as approved by city council. So there for a long. They're significant structure is and so that's why we take you take these types of permits to council for approval on the project proposal you in the red you can see what you've already conceptually approved. That's the tunnel and in the yellow notes the area of Thomas tree that will be affected by the permanent tension tie backs. Temperaments are two step process where you at, the first serve 1.8 where we are today Council provides conceptual approval and that gives the developer comfort knowing that you're generally okay with the idea as a project moves forward gets more technical designer approved and all that sort of stuff. We will bring an ordinance to you and that is the actual permit and that specifies obligations of the permit holder which will be Seattle Arena company LLC it name has a bond associated with it names the terms if the city ever needs to revoke the permit there's information in there. It requires Council actions actually revoke the permit. So since it's approved by Council you have other body that gets to revoke it and I'm working to bring that ordinance on this project. I'm at the end of construction for your approval. And that's all I have do people have questions about that a lot on these times come before us. If you revoke this is in the building fails, so it's technically revocable, but now I assume that is so we have some turn permanent that are for 99 years and I had those conversations will be happening on that. It's it has to be a temperament because it's not a street vacation Street vacations allow the permanent transfer. So that's just the risk associated with this in the sorry. I was if you got a new way to pretty sure wall or something. I got to assume that every project happening. It's really in the downtown core right now is using tie-backs to hold those walls up, but I don't recall. They were doing a ton of these terms permits for tie-backs. Is there another blanket ways happen or something? Those are usually the tie-backs are usually contained on the private property and not in the right way. And these Kydex will be in Thomas Street. And so that's why we need to have a turn permit for them to pursue for them to occupy that portion of the right away so that it sits can handle this truck for a load of the soil that the end of the project are detentions and they just become look like little pieces of Steel in the right away and tell them they're going to stay permanently tension. So they'll be part of the structural wall, which is the difference for the explanation of what a permanent tension tie back was. I did rely on Wikipedia to figure that out in preparation for this meeting any other questions before we having a slight a minute we have to make our friend Caitlin such. Sewing exhibit change more protective just a technical Amendment to the nether. No further questions any other statements you need to explain on this? Okay. So let me let me amend the exhibit. So I moved to a men's resolution 31888 exhibit a by substituting version 2 for version one is there second Scared me there for a minute those in favor of substituting exhibit a please don't I I know the motion carries a resolution is a mended and having said that I moved that the committee recommended option resolution 3188 as amended those in favour the recommendation of the council to adopt resolution 3188. Please go to know the motion carries and resolution 3188 will be forwarded to the May 28th city council meeting and as we close if anyone didn't want to make any closing remarks as you can see something very pretty plain. I just want to thank both our team and Marina Cove folks and for the viewing public that are so excited and supportive of this huge project moving forward. So these are exciting things for our city and our region. So thank all of you for being here know that we stand adjourned. Have a great rest of the afternoon. Thank you cards from very much.", "end_time": 3812.8}]}