{"format": "raw", "annotations": [], "confidence": 0.930801427328443, "data": [{"start_time": 0, "text": "Good afternoon, everybody and will begin High IMDb. Hey guys, this is a meeting of the Civic development public assets and Native communities committee. The day is March 20th is 2 p.m. I'm canceling rewards chair the committee and I'm joined by council member Bagshaw. Thank you for being here today Cancer Americans. Alice is excused for today before we begin I want to briefly go over the agenda today in the chairs report. First on the agenda is a reappointment of Colleen. Echohawk-hayashi. Remember the Seattle Indian Services Commission and she'll be joined by Senator Claudia Kaufman, and I'm glad they're all here. After this, we're going to hear from our chief librarian and his turn and his team on the library Levy annual report from 2018 and 2012. See all the voters improve access to critical educational and literacy resources for every resident bypassing a 7-year 120 million dollar Library Levy report will include the status of capital projects performance measures and much much more. I understand you have a PowerPoint for us today and also included in our information packet. And for the public is a copy of the 2018 annual annual report annual Levy report. Next we'll invite parks to discuss three ordinances up for potential vote items for if I will be presented together items 4 and 5 are we guarding Laurelhurst and the Washington Park Arboretum regarding Waterway permits, and then we have another ordinance regarding Department of parks and rec transfer jurisdiction to spu regarding a parcel of land and finally we're going to spend some time on The Soundview Playfield Improvement project. That is our last item on the agenda the land use code for the land use codes feel Invincible code title 23 requires us to hold a public hearing. So after I've invited up Central staff and our presenters to walk us through the legislation. I will then open it up for public hearing for this ordinance. This is not to be confused with our general public comment period that will be held at the beginning of the agenda. So what we'll be doing today is what we have into public comments one to the items on the agenda and the second public comment period will be open. Find Soundview Playfield Improvement project. So if that will move to public comment, and how many people have signed up to gain? Okay, so let's call out or two folks and move forward. David Haynes Hi Seattle needs a better leadership at the Board of Trustees. And the chief librarian should be replaced specifically for never opening the taxpayer finesse public libraries for 21st century times tens of millions of dollars have been squandered never opening neighborhood libraries on Fridays after getting $60 extra to open the library's years ago when confronted Marcellus Turner said he thought Community only wanted Sunday's open not Friday yet. He only open libraries on Sunday for four measly hours. The Librarians are getting paid double time doing half the amount of offering or there's a lot of noise when they first open it up cuz it's all rushed get he promote a lot of racism at times and some perversion when his offerings at live at the Central Library. In fact two managers David valencio and Marcellus Turner protect. Morning viewers who ruined the computers if you complain about poor no viewers, they will kick you out for bothering others about it. Security when you ask Marcellus for an appeal. He just reiterates the rules of David valencio. They should be replaced and we needed investigation of why the chief librarian can close to Central Library whenever she feels like having a meeting with staff and why he never open the library's before 1 p.m. In the afternoon and why it's so And why is it so noisy in these modern libraries with a warehouse concrete Echo and Librarians beeping in books without dialing down the volume that we're never checked out but taking credit because somebody may have moved it from the shell stew noisy. Thank thank you sir. Who's next? Alec Zimmerman Set the clock. Hi my sweet sugar come so I want speak about agenda number to about lately because I live in same district. What is Yukon? So where is District 5 little bit confused about your decision about forgiveness a stealing book for all my life and I know about books and I know sometimes I buy with prices so your opinion about support stealing book very surprised me since you acting like a pure criminal support criminal you are People caught stealing book when I'm talking about poor poor minority. Could you still book for 5:10 or 4:50? Tell you talking about professional. So you're going to see inside the library is steelbook. What is very unique very complicated and find this book second time. Sometimes not possible Library cannot deliver it to me this way to Unique book. So you can survive support a criminal is very surprised me. This is exactly why but I see what school five times crime Court recognized constitutional right and open public meetings. Five times you support me. What is a Kum Kau Council Gonzales, Kansas City, Kansas Chamber after vla five-time constitutional law in court approves this in your letorney you are Council boxer attorney Gonzalez like right now on speak to everybody in Seattle stand-up my friends. That's it. Wonderful. So why don't you come up here? And again, let's start I'm going through items of business. So I'll have the time you read item wanted to the record and then we'd like to invite our presenters up at the table so they can and do some cells appointment on 239 appointment of Colleen. Echohawk-hayashi as member Seattle Indian Services Commission for terms of December 31st, 2020. crate So I'm going to let you do the introductions and then we'll go ahead and will start conversation. Go ahead Kenny. and Colleen echo-hawk Thank you madam. Chair at this time like the present for your approval of Colleen echo-hawk for the members to the Seattle Indian Services Commission. She would be representative of by the governing Council. The commission is governed by five members one appointed by the mayor for appointed by the members of the board all confirmed by the city council. This will be her first term. She is the executive director of Chief Seattle Club has an extensive involvement in the community of Seattle and we believe that you would be an excellent representative and we highly recommend her appointment. Not to mention she comes md5. I'm not in chair for considering this appointment. We are super excited to have calling alcoholic join our commission. She brings her a wealth of experience and understanding and knowledge within the community as well as our vision. She shares are for the future and how that selling a Services Commission has first of all, thank you Sandra Coffman for being here. It's always a pleasure to see you and you provided leadership for many of us for decades. Will you and I go back a long way, but it's wonderful to see you at the Save table sitting next to our sister calling alcoholic and everything that you've done for Indian Country including your family. So it's an honor to have you here senator. Well, I am very glad to be here. Thank you so much for having me good to see you again. I just want to say this is Echo your comments about Senator Kaufman, you know, I'm a busy person but when she asked me to be involved with something I want to be involved because I believe in the leadership and also believe in the importance of this work that we're doing at the commission. So I'm really glad to be here. I'm looking forward to bringing some of some of her learning with our project in Pioneer Square around building housing to this work and just working alongside some really wonderful people that are already on the commission. So I think it's going to be good weekend. I'm calling I'm thrilled that you want to do this and thank you senator for putting forward your name. It's always a pleasure working with you and I'm delighted about your housing project is going up. We're working on around and with you to see if we can move that forward both for the construction. And then also what your community Gathering space the vision you have for that and how that ties in with your community health is fabulous. So I'm all over this appointment. Thank you very much. And if there's anything we can do for you or the two of you want to come and talk about what that particular Board needs. I'd like to hear that Kenny. Thank you very much. You can make for running this. Thank you so much for bringing out for it because I was just whispering to Claudia on the back of out. What and wonderful support you been to me the Chief Seattle club and the native Community also psychically around the work that we want to do in Fortson Square to really develop that place to be a wonderful spot for all community members and Especially think about the possibilities of having visions design embedded in that part you and I've been having lots of conversations about that and you were just incredible allies. So thank you so much for working Q council member. So let me just say this. First of all your appointment pack. It doesn't do justice you and your sister Abigail and your family are all born with law degrees or something and you've been involved in India all women want to add have been so good in our community in dedicating not only your personal life, but your professional life for the betterment of native communities, whether we live in the city or on the reservation or wherever full The View have advocated not only at the city level the state level a regional level, but you've been in Washington DC working hard for my missing murdered indigenous women for the savannas. Call you cough and you've been great, Sandra Coffman and all the issues that you tackled when you were in Olympia. We work closely with you. It's wonderful to see I'm calling here following kind of in your footsteps about picking up. Do you know the torch and as you know, we need to leave and Indian Country we try to have people behind us that we Mentor that we want to see them continue the work and I also just want to say that you know, Colleen has been phenomenal not only with her work at Chief Seattle club and Sheltering in sheltered in providing social services, but also your work on the community police commission your work on the waterfront with us on every aspect you have been a place that I can go to to just kind of talk about what are the issues. What how should we be addressing these and I always appreciate your wisdom. I don't always lose everything you tell me to do but I listened enough to know when I want to get something done and then I get my buddy to my right here on board, and I also want to thank your family because I know your husband and Children also sacrifice a lot of time with you because you're out doing everything in that every meeting and omad is involved in the community as well. And I know you have a brother that's involved in Illinois who your brother. How is the hope I was watching this five girls and there's no brother. And so it's it's my pleasure to have you here today. And before we wrap up and go to a vote. Is there anything else you want to add anyone else? Now thank you for the very kind words. Okay, so did we read that into the record? Did you do it already did it? Okay. So I moved the committee passed the appointment of Miss Colleen. Echohawk-hayashi. Let's move for a vote all those in favor. Say I suppose know the eyes have it graduations on the motion passes will recommend full counsel pass appointment for Miss Colleen. Echohawk-hayashi, and thank you again. Thank you. Thank you. Thank you. I'm a mess kit. Alright, let's move on with the rest of our items of business. I'll let Nikki know what's in our next item the annual Library Levy report. Go ahead item. Number two is the annual report for the year for year 2018 on the library Levy. So we have all of you here. This is great and I'll let you guys introduce yourself and then I will let you walk us through your PowerPoint and we'll see if we have questions and thank you for the time to give us this annual report and thank you so very much for this opportunity. I'm empty. I'm your Chief librarian and joining me are a couple of people who'll introduce themselves Jay Rich president of the library board. I'm Janos shorts Library Levy administrator So you want me to get started? So can I also want to acknowledge that there were some rather unkind and uninformed comments that were just made if you feel free that you want to talk about how you don't just willy-nilly set Library hours feel free. Otherwise dive into the presentation. Thank you for acknowledging that I'll let the library's work speak for itself. Thank you. So we're happy to be here to talk about the 2018 Levy report and this shows all of the work that we've done over the last couple of the last year and as introduced I will give a few minutes to Jay Rich is the president of the library Board of Trustees to speak first. Thank you, Auntie. And thank U council member whereas in council member banks offer this opportunity. I first let me Begin by thanking you both and the whole Council and the mayor for your support of the library's over long time and it's really an honor in today quite a pleasure to talk about what we've done in the last year with the Levee proceeds from the 2012 Levi. As you know, the library board is a five-member citizens were established by the city Charter with fiduciary oversight over the operation and management of the library and we take that role very seriously and also appreciate the accountability that it requires in the transparency that it calls for the boards committed to ensuring that the Levee proceeds are used as they were intended and with full transparency and again accountability as that is done. I'm really proud of the amazing work the library has done and how they've used the Livery the Levee. Proceeds consistent with and in furtherance of the will of the people that you may remember the 2012 Levy was passed with a 64% approval rate and that was based in no small part because we received Common's from thirty-nine thousand people at the time to help put together the Levee package and it included for primary components more materials more hours more technology and maintenance of of the 27 Branch Library facilities. And we're going to hear today how we've use those leverage in furtherance of those four goals in this part of our ongoing Outreach to the community in 2018. We went back out again and did a scientific survey of both Library users as well as non-user 26,000 in total to get a sense of how they thought the library was doing and whether our priorities and their priorities were stacked up and I'm happy to report that there was overwhelming and could Used to be overwhelming support for the library as well as those four components which really formed the basis of what the library does what the levy does Bolivia's you may know represents about 24% of our operating budget. It is a very significant item to us, but it also was enough money to really shape programs and what we offered though. I camp that help remarked that the rest of the operating budget the 75% comes from the general fund. And so we really appreciate that support as well as in the same way as we reported out the 1998 bond issue where we build out the library. So we have been committed to report out the results of the levy proceed. So the board receive detailed reports on a quarterly basis of where the expenditures are and how they lined up with the priorities and then on an annual basis, of course, we report to you and that's why we're here today and to contextualize what we do we put out and put on our website as all this material and operating report in our operating plan for the library that shows how the 24% relates to all of the funding sources that we have. So there's a rich body of material available to the public and to you too. Frankly. You know what we're doing and also hold us accountable. So I just told you that the same conclusion are Levy Investments have enabled hundreds and thousands of individuals of all ages and backgrounds and economic backgrounds to to improve themselves and take advantage of the library. But in addition it's built Community between and among members of our city by connecting people through programs through advanced and was shared spaces. So again, thank you for the opportunity to give the report going to hand it over to empty to actually go through the details. Thank you and thank you to the board for their support of the work that we're doing if Library really happy to be here and share with you the highlights of our 6-year of the seven-year-old have a we've been doing lots of great things and you'll notice that I'm only scratching the surface as I move to that. I'd also like to thank you councilman more as for your leadership as committee chair of a library's I enjoy these visits with Enjoy me explain to the difference between a rat and a squirrel but is always true is always true. I'll move into the report. I'd like to give you a brief overview of what lab voters to approve the levy the people of Seattle love their libraries as evidenced by the library's for all building program in 1998, which demonstrated widespread voter support for access to learning and equity and opportunity. Unfortunately, the prolonged recession put that access and Equity at risk from 2008 to 2012 as the economy worsened Library patrons grew frustrated must have had 27 libraries were closed 2 days a week. I book budget was being cut her technology infrastructure was aging and the entire Library System closed every year for 1 week due to budget cuts. Just as people are in Greater need of Library resources. Those economic realities set the stage in 2010. We conducted a Citywide survey about Library services and we collected nearly thirty-nine thousand comments from members of the public to inform our plan the plan reflect that the Public's priorities for essential Library Services the council approve the library for all for the 2012 August primary ballot and voters overwhelmingly supported it in the past six years. We've been good stewards celebrity funds keeping our promises to voters to find core services and support emergency priorities. We conducted another public survey in 2018, which J Jets reference which we made available online and and branches in a different languages. And this time we got feedback from more than 26,000 Seattle residents of users at nine years is a life to represent the city's demographic mix the survey indicated strong public support for the library and confirmed that Seattle residents still want the library to invest in the core areas funded by the Testing Landing which includes open hours investments in collections and technology and keeping the facilities clean and maintained. The seven-year 123 million Levy supplements General $5 for opening hours book materials technology in building maintenance from year one. The Levi has supported nearly 5 million of ongoing Library services that would have had to be cut in 2013 is part of the city's response to that conomic downturn and is Jay reference. There is 25% that now accounts for the levies budget and I want to talk about that now. As I move for the presentation will provide details about how we have met each Levy promise in 2018 and I'll also describe a library work is changing and how our ties into the city's priorities in particular. We help close the opportunity Gap and provide Pathways for people to be successful in life through a services to Children students and adults and especially vulnerable groups such as new immigrants and people who are in securely house and those cannot afford access to the internet at home at the library as you might imagine is on the front line of Seattle's homelessness homelessness crisis is one of the last remaining places that are free open and welcoming to all people and I'll give an eye to Christopher who would say the same for parts behind me from internet access to looking for housing job in medical care to a safe place to read a book use the restroom or participate in the program. The library is there for people in every neighborhood We both love it to respond to the needs of Library users. Those needs her changing off and in ways that feeds we could not have anticipated and believe it or not. We're changing to respond to what the patrons want from us people told us. They wanted the library to have a larger presence in the community and we now have a community engagement team and he and have refocused a staff throughout the system to find ways to provide program services and resources for people need them for the library staff and administration community and engagement is the key to the way we do business. We take every opportunity. We can't learn more about what the public thinks of our services are Services impact their lives and what we can do to improve opportunity for every Seattle resident Librarians from every branch in the system routinely spend time with Community groups at day shelter Farmers Market schools and Beyond bring Library services to where they are learning about their needs and bringing their feedback back to help us make smarter decisions. People also want to access more material online in 2012 digital materials accounted for 10% of that total circulation. And now it's more than 32% We expect this trend to continue as new formats are introduced and Technology improves. In addition free access to library Wi-Fi has become more important as patients use their own devices and the library provides laptops and tablets to for people to use inside our locations. The library has extended our Wi-Fi access throughout popular hotspot lending program and in 2018, we secured a favorable contract for data service with T-Mobile which allowed us to offer more devices and provide hotspots to City sanction homeless encampments. Thank you for your support in helping us expand this program. Is that what is that? When we did that included we expanded to was Andrew Lofton is ahead of us. So with that program we partnered with Seattle Housing Authority to provide hot spots to some of their residents who did not have internet access at home and in there so doing we're providing the kids. Schools with opportunities to have Wi-Fi hotspots for a longer. Of time than we offer the general Patron who comes in and checked it out as I would have booked which is for 3 weeks. We have them for a loan. The form to get a kid through the school year. So that is the way we've been partnering with them and that's been a very successful program for thank you step up to it and FHA has been a great partner with us in that effort and thank you for acknowledging that can't cover everything in here. So your appreciate that thank you much and she know more and more Seattle residents are in securely house dance to are struggling with addiction in the library is working hard to serve these patients who have a high level of need as a result of these issues everyday. We connect pokes to Supportive Services with the help of Community Partners both inside and outside of our buildings and that includes our community resource specialist, but the impact Increase needs a library facilities is certainly felt in addition to an increase in support of service Partnerships. We have also needed to grow a security and custodial services to ensure a libraries continue to be safe and welcoming places for all who need us. Just want to acknowledge how important that is and last year the parks Foundation. I'm sorry the library Foundation that put up money for your first two huge difference. When I talk to people in the library said this is where they get their help said, we have a lot of nonprofits a lot of service providers, but they felt comfortable there so well done and thank you. Thank you staff has really been successful to the patients who are in need of it, but also to our library staff who are not necessarily as familiar with all of the services that are offered and we can connect him in that way and it cuz well serve everyone statistics are number of active patients continues to increase up 14% since 2012 Samuel L e r new library card holders is up significantly over a pretty lady level. We offer more library programs than ever before and we are seeing an even greater number of patients participating in them. Thanks to Levi. Plans for additional open hours and Staffing we are able to offer more educational classes workshops and other programming inside our buildings and out in the community. We've increased the number of program that we offered by 43% during the Levee. Patients are increasingly relying on digital materials. We are proud to have one of the largest and most circulated Digital Collection among public libraries in the nation. I think we're number 3, you may have. And just switching it a bit you may have noticed at the bottom of the table. We have some down arrows those declines reflect changes in how patients use the library in Sesser down because patients can now access so many of our services 24/7 and in 2014, one of our very popular branches and D5 Lake City was closed for 6 months. So the population down turn during that period was felt. We also recognize that fever fewer people are using a desktop computers because more of them are coming in to use our own device use their own devices in access the internet through a free Wi-Fi. And while the number of computer sessions is a standard Library measure. It doesn't really tell the story of how we provide important digital access and this is especially true in historically underserved are underrepresented communities where Reliance on digital access to the library is much higher Levy funds have been able to library to respond to changing Patron needs. And now I will move into each of the four components and I'll do so rather quickly the first promise that we may have us to keep our libraries open when patients needed them while we've been talking about some of the patrons are accessing have Services outside of our regular business hours for many members of our community increasing Library hours is key to providing access to learning an equity for kids going to homework help after school immigrants and refugees to take ESL or citizenship classes for those who need access to buy desktop computers laptops or iPad having access to our facilities is more important than ever as we were developing the 2012 Levy are patients told us. They wanted libraries open more hours and in particular we heard from working parents and families that they need it libraries on weekends by expanding hours. We reduce barriers that prevent people from getting the resources. They need to succeed with living resources. We've been able to open all of our libraries on Sunday and it had it Friday hours to fix locations. And we are open 52 weeks a year. And so we are quite proud of that work. Access means different opportunities for our patrons at different points in their lives for parents with young children. It is to Play and Learn baby and toddler story time for elementary school children is homework help and summer of learning and for teens and young adults is service-learning an adult tutoring a program to help close the opportunity Gap and repair Seattle children for success in school and beyond for job Seekers retirees and other City residents the library office of pre safe space we heard over and over again throughout survey comments about the importance of the library as a place in the community. The second promise that we may have us with collections to provide a robust collection of books and materials the community's widespread interest in books isn't surprising given Seattle reads started here and often top the rankings of the nation's most literate City in 2017. Seattle was also designated as a UNESCO city of literature last year with the help of 3.3 million of Levi support. We had to fix t3002 titles with a special Aunt for the maintaining a diverse and inclusive collection for the past three years. We focused on adding titles that provide greater access to under-represented for including those from people of color affect sexual minorities and other marginalized groups and we've made significant progress in getting patrons the materials. They want faster through floating clocks. And if I can just add X Librarians have recommended it is an amazing program. Should I go that someone doesn't mention pic pics and the gentleman? Andrew is the one who runs I program for us. So I'll all of that praise and recognition goes to him and his team but it isn't the collect. The selection of materials is down to a collections department. We have a team of about five staff who work on that they get recommendations from other staff, but they also see how the circulation of the books on hold or trending. Okay. So if there are a lot of holes on books we order more so that's how they do it. Yeah sure that and like I said, it's one of the biggest and so there is not a place I can go that no one says something about people fit. So I previously described a patient's increasing interest in our ebooks and audiobooks and we continue to add new electronic materials in late 2016. We added digital Comics through a service called hoopla and in November 2017. We began offering streaming movies through another vendor call Canopy the new Services. We introduced have been very popular. Patrons and in 2018 nearly 33,000 patience download a digital Comics music or movies from hoopla and more than 6,500 patients of stream movies through canopy the word even bring a services in a different way with electronic formats. Many patients still prefer the physical book as evidenced by the popularity of the pic pics program, which we launched in November 2017. You know, I think we're a lot who were who straddle that River and have one foot in the printed one in the digital but it's good to see a print book when you walk in a library. It's really good since lunch. We've offered nearly thirty-two thousand copies of 192 titles in this collection and have circulated these books more than 250,000 time that just shows you how popular peep pics of Antonia take 2018 pig pig books were checked out a total of two hundred thousand times over 40,000 unique patrons checked out at least one pic pics book in 2018 and believe it or not. Even though we have that great number going on circulation of children's print materials remained steady, which supports families Early Learning efforts across our community. Let me promise 3 improve computer and online services. The library is adapting our service delivery to the way people use technology today. And we're working to ensure our patients have access to the digital to buy need my patients need to register their children for school on the Seattle Public Schools website apply for Medicaid long-term care food assistance or child care online or check out our stream are extending a collection of materials that can come to the library to use our desktop and laptop computers access a free Wi-Fi or get Tech help from a staff. We've expanded the number and types of devices available for a patient's to use to help bridge the digital divide and for students and jobseekers access to desktop and laptop computers for homework and job applications for our services throughout surveys. We have heard from many patrons that they appreciate the ability to check out the Wi-Fi hotspot and use the internet and it's especially important for those who did not have internet access at home. Last year, we launched our new redesigned website which serves as an entry point to All Around online resources, including our catalog of books and materials are research databases online courses from London, and Microsoft imagine Academy our calendar of events and classes and much more. The last time we overhauled our website was in 2003. So you can imagine much has changed for a new design with the public and put it every stage of the project. We did multiple rounds of research and usability testing to understand how people use the site and we engaged and accessibility expert test the site to make sure the fight work for everyone and since it's launch we have gotten recognition anytime we go out about how well that program runs how great our website is and the process that we used. Finally, let me promise for maintain buildings for the Next Generation with Levy funds. We are able to clean carpets and upholstery wash windows and pressure wash sidewalks on a regular basis. We're also able to fix reels and makes safety improvements to our branches as needed and yet even with higher levels of funding from the Levee they've had to redirect both capital and operating funds to keep the filters Clean safe and functional and even still we are not able to keep Pace with a heavy use of some of our facilities. We have 27 libraries throughout the city and they are treasure Community Resources. As I said at the beginning of the presentation are libraries are one of the last remaining places in the city that are open free and welcoming to all people that's also places are libraries on the front line of some of the city's social issues such as homelessness and the opioid crisis as the number of people who are in securely House Grove with see more people spending their entire day in the library. They have patience with few other options and use our facilities for Hygiene purposes. We also facing increases in alcohol and drug use and inappropriate behavior in 2017. We add a custodian security staff with Levy funds and we've recently installed Sharps Containers to collect use needles in the restrooms at all library locations, and we're adding two additional Security offices with one-time funding from the general fund in 2019. In 2018 the Levee accounted for 23 of the library's total spending and 25% of the library's total budget is Jay mentioned in his opening report remarks. The board takes its fiduciary responsibility for the levy and all Library funds very seriously. This pie chart summarizes our Levi spending by Levi promise how large a slice of the pie in 2018 went to maintaining our facilities for the next generation and preserving court services to the operating fund. This covers. The ongoing Library Services. I would have had to have been cut in 2013 as part of the city's response to the economic downturn. In 2017. I invited the public to join me in a series of community conversations to discuss current and future Library Services these conversations focused on technology and access as well entire libraries new strategic Direction, which is our blueprint for future decision-making. I continue these conversations in 2018 to discuss the future of libraries and share the results of our library programs and services assessment survey, which we conducted in Spring 2018 as described earlier earlier. We received over 26000 responses, including over 11,000 open-ended text comments about Library services. Are public engagement through the survey in our community conversations has provided information about the types of service changes enhancement and expansions desired by Seattle resident and help move us toward the library of the future patrons told us they want it more open hours more Collections and continued support for those who need our services most. This input has helped. The mayor's Levi renewal package that we will be presenting to you at the select committee on the library Levy next week. And with that. I like to close with a brief video about the importance of our computers and online resources for our community and then open it up to questions. I Know video here Council merit badge I wanted to be in this video. I don't know why you didn't ask. Who wants to call Eric? What are we doing this with questions and then I would be great. Cancel this is so important and that you've pointed out and others have two including the Seattle Times a couple of days ago just have criticals libraries are and I'm wondering if I could just ask you this question, which is you talk about oversight and accountability and I have all the faith in the world in you and with your bored. Can you talk about how the the money that you are watching? Do you have that tell me about the sense of how you are making sure that the money is spent wisely. I'm in the second point of to this is how we have our population around here has increased in a really quite astonishing way. And when I hear people say we have to do more with less love that argument, but when people are asking for more demanding more and you are providing more it takes more resources. So if you could just talk about your role as the board chair and then the great sure. Library board meets at least monthly and we get monthly reports on all of our expenditures and Chris is here and provides that end in the context of that. We're watching various trends of usage. For example, one of the things that's hidden within that data set. That's so important. Is that as the E materials the electronic materials have grown in used from 10% to 30% and some of the books or the hard copy things have gone down. The thing we have to understand is that the ebooks are three to five times more expensive to us. So while we're trying to respond to that, we're also looking at the trend lines or another implication for example has been brought to our attention is the use of e-books means that people who overstay the borrowing don't pay fees. And the reason is that the e-book disappears and expires dilemma of having a line item of serious eats going down because we're using more ebooks. So we are watching all of these Trends and all these issues on a monthly basis and asking fundamental questions about whether this is a short-term or long-term a a 1-month problem or a trend. How are we going to deal with it? And it was looking at all of those issues that help us decide what the ask could be for the the next Levy so it's not only doing more with less. It's even doing the same at higher cost. So even in Missionary increases to even sustain what we're doing which isn't enough. He's going to cost more money. Yesterday I spent some time in Olympia and one of the people I saw was Senator guy Palumbo and I mentioned this to him that the cost of e-books is gone up significantly and he was as well as I reacted to when you first told me quite surprised at how much it's not like a little bit. It's like you said three times 5 times as much about what efforts have been made to approach Publishers or Amazon or whoever is responsible for this and is there a library discount that it is negotiable? That is an interest that all Library share it's not just the Seattle Public Library that is challenged by the cost of economic materials. And as you might imagine we're looking at it as an industry as well when they both came on the scene a few years ago the Library Association, which is the governing Association for all libraries in the in the country as well as some of the regional libraries came. The other to talk about opportunities to approach publishes to do that as you might imagine with a print material when a book is greatly loved that can remove it out of circulation and that puts libraries in the position of having to buy a new copy which is how they are Revenue continues in the scenario of a material that doesn't occur with a challenge though. Is that as much as we have these conversations with Publishers they are at this moment focused on how they increase their bottom line because they are really struggling with that as well because an electronic material does not expire does not die in at this as much as it's greatly loved. You don't see the wear and tear on it that you would with a print material. So there are a continual conversations with him trying to do something but we've found more useful and Andrew is participates in these conversations often is working with publishes to focus on the licensing requirement that they give us it's not. Surly that we can reduce the cost of the electronic material that is something that they pretty much cleaned too but the license is what determines how we get to use it so in some instances they may say you got to buy the book for two years and then you must buy it again at the end of the job is to work with him and say hey what about giving us three years instead of two years for the cost of that item or looking for other opportunities to do that? And so as a collective Andrew will represent Seattle Public Library in those conversation and other parts of the country bring send representatives there as well. So we try to have those conversation at that level to do it that's things to be our best in road to addressing that are we online? What I'm doing at the library. I'm working on some music and come up here to pack my stuff because my living situation working on my Excel sheets are very my presentation. Check my email in some of the documents that I'm expecting if they come truth and I will print them off. I'm you to do some job search three to four times out of the week in my grandkids their wonderful facility here. I love our libraries. We see the public library is a place where you can come and get free instruction a place where you can come and get free resources. So we want to build a place where you can also come and get technology skill set. By focusing on Equity during the website redesign project. We dress language barriers and you'll still try to address that issue of people having an equitable access even to technology. It's a matter of human basic right to have an access of websites for all people have done a lot of web accessibility testing and consulting services to the library. I am looking is the web page is accessible to people with vision impairment. So the end result with the website is that we know how a website that is accessible to everybody no matter what line services you can learn a language through our services. You can learn how to program a computer. We have lynda.com that has all sorts of instruction on Computing how to use programs. We added music films videos TV shows that you can download or watch online digital literacy classes a little creativity classes. This is my phone. It's a smart phone and it's smarter than I am and I didn't know how to use it and they put on a class of how to use the new technology. We specialize in information literacy. So not only showing folks how to find information but how to evaluate that content. The thickness Survival Guide is a 2-hour class that we have out here at the Central Library. It's essentially just an overview of misinformation and disinformation and how you can evaluate and have best practices with engaging in online information. 101 take a piss off at weekly in most locations. And so they Court regular NL Central Library to offer three times a week. It's your computer to make sure it doesn't have anything. We just help me troubleshoot basic Tech questions with their computer phone to email social media and the tutoring is preparing me to go further in my goals, which will be technology and onto back to college again, the library also offers free Microsoft certification exam and currently we offer Microsoft Office specialist and Microsoft Technology associate exam so that you can take for free at the library through a partnership with the Washington State library and you can sign up and hopefully get better jobs as a result of it. We really believe in narrowing that digital divide for the citizens of the city. We like to provide job resources access to social services from local state and federal. Apartments amusing the housing resources that they have internet access, you know where I be completely closed out from the world and you know, I can talk to my family and friends and stuff like that that helps a lot to have that access and not have to pay anything's free. Right we both created the network including Wi-Fi. We replaced all of the available public computers in the system. We upgraded size of the monitors. We've offered upgraded printers copiers and scanners at all. The branches we have meeting rooms that have been expanded upon with wide screen TVs. We also have the flex Tec equipment or people can check out my pass on laptops and use a draw the library. As far as creating music goes it's super expensive. There's not a lot of places around here that have biss where you have your mic and your music program. It's really he's for the patients to have free access to the equipment is very encouraging for the Youth in my area lot of patients have been coming in to use it as a interview room table to check out that they check it out after front desk to bring it in and put it on top of the screen and then able to protect themselves and be able to see the person that's interviewing them and vice versa. I like people to come the library are homeless and they have nowhere to go and no lawyer to charge their stuff for fill out applications. It really helps them so that way if it dropped they have for stuffed Church a lot of us take for granted that we can just pick up our phones we can go online we can see what news is happening. We can call our family we can email. It's important to remember that not everybody has that same access the public library has Wi-Fi hotspots available for anyone to check out. These are small devices that connect to a Wi-Fi signal and you can take them either to your home or outside the building and it will keep you connected through our Wi-Fi hotspot Outreach and programs that we have at the library. We are able to build those people at give them some support and stability said that they have the same opportunities that we take for granted Seattle Public Library is dynamic. Did the people need Seattle Public Library is my future? Sound, thank you that I'm marketing online services team really work hard on that and I was just noticing that I see one of the patients who's in the video everyday and next time I need to thank him. I didn't realize he was but it is a great video but it really speaks to how we unpack the community in different ways that I just sitting here talking about it would not show although talking about his excellent you doing my job that is so well put together whoever produced it say, thank you, please and I These are useful to get let people know I had no idea but you're fake news to share this committee before me and me now in the last three or so years. I know a lot and I've learned a lot but I just learned some more and so I'm going to take you guys. I know how hard you work and I don't I don't think sometimes the community or the city recognizes how many services you provide and that libraries of the 21st century are not like they used to be. I mean, we just I get so tired of saying we're Beyond just booked, you know, the digital divide and I really like what somebody said in there which I think I'm going to use and steel I'm telling you now is that libraries are the people's University because they go there for everything with your looking for a job with your learning A language with a book. What do you need to sign up for Medicaid whether you need Social Services, I mean, I'd sometimes wish I could just have like a menu of life. Besides checking out a book this see these are all the things that we provide and we should provide is a democracy and a community. So I want to thank you guys for that. I know you're bored work so hard. Will you do you guys, you know, you're a volunteer board? Yeah, and you raise money and you get out there and you haven't given up and we have a lot of community groups like that like one comes to mind immediately like Friends of the Waterfront civic-minded people that are committed to providing essential governmental Services Central governmental Services because they care about their city, so I want to thank you. I think what you've demonstrated in this is your passion for equity and we talked about the digital divide. I mean dance goes cut some many different layers and available for people and then having the help to whether it was the gentleman that was doing it working on an Excel spreadsheet or I love the music video who knew that you could do that. But this is what I think we can emphasize I think so too. Great and we'll see you next Thursday. You will see us next Thursday. I'm going to leave some brushes for you and your colleagues with a 2018 report. Thank you. When does the Seattle reads book get chosen book has been chosen and we will be coming to you next week or sometime as well for them. I think we scheduled it. I just don't recall. Maybe it's April 1st at we come to bring it to you if I could have been chosen the title. It's something I should not have said you do this thing for a week. She'll be here for we could title is the best that we could do and it is by T Bui and I believe it or not. I read it two weeks ago to The Graphic novel this week in addition to the story that it's hell. It is beautifully Illustrated and she did it herself. So I think he will do it. Even if you're not a fan of graphic novels you will be amazed at how quickly you become immersed in it because it tells not only her story about the history of her travel from her country of Vietnam toss. Thank you much. Stephen King you want to read this to record so we can get going? Item number three Council Bill one 19475 and ordinance relating to the Seattle Department of parks and recreation in Seattle Public Utilities transferring partial jurisdiction of a portion of the West Ewing mini Park from the Seattle Department of Parks and Recreation to Seattle Public Utilities for installation maintenance repair and operation of a combined sewer underground microtunnel Associated internal underground pipe stacks and electrical lines and finding that transfer of personal jurisdiction meets the requirements of ordinance 11847 7 which adopted initiative 42 guys want to do your introductions. I'll say a few words we can get started your case about the council Central staff. Louis Webster Seattle Parks and the submarine physical. Did you write this one? I see your name on here, and I think it was really prepared by spu. Was going to take them. I'm looking at my Quinn and Stephanie's Accord. Okay, so that is helpful with the information. So thank you. I'll let you guys go ahead and begin. So we're here to present another partial transfer of jurisdiction. Whenever we do property transactions, we come here to seek authorization. This transfer is between Seattle Parts in Seattle Public Utilities my want to thank Mommy car out the director of Seattle Public Utilities and her staff as was mentioned earlier this transfer fits within the provisions of I have 42 and we think does not violate public park and recreation you so with that I will kick it over to mr. Webster. Thank you. And yes, you're driving on the left. I have to go that class. I know I have to. if it weren't for my children, I would know what I was doing, but Okay, so here on the screen now shows where the West Ewing mini Park is and it's on the screen here highlighted in yellow shirt of halfway between Fisherman's Terminal and the gasworks park is over here Civic University the south side of the canal and it's actually made up of that. You can see on the slide over here. There's 3rd Avenue West Street and which is controlled by spu has this middle part sew here and the parks parcel is the triangle off to the East and really the subject of this transfer jurisdiction is just as use area. Hatched area on the right lower right of the the picture. So spu is doing their ship canal water quality project under the national discharge elimination system permit and the federal consent decree that you may be familiar with and a part of their plan is to install a micro tunnel under the Ship Canal to convey Wastewater from Fremont and Ballard. To the King County sewage treatment system and their on advancing the slide. Quick question. Maybe. I'm just a little backwards about where this is going. But with linear Reservoir that's going in on the Ballard side. Does this connect to that is so it's it's actually coming from the south side. That is the North End of Queen Anne to that hook up with talking about Fremont. Is it how does that work? Cuz Fremont's on the same side as free Motors on the Northside, of course into the I've been working a linear Reservoir, but that's the SP you made your project is going in so it's so waste is coming from feet Fremont. into the the reservoir and from the north end of Queen Anne underneath Hood Canal to the reservoir. Correct a picture as well. So do the physical strengths physical constraint SP. You must bore microtunnel 35ft beneath a portion of the SP are partial Parks parcel futility will not be detectable in the park but appurtenances exists and will be located in a Jason right of way. So they're there will be things visible on the surface. They're not on Park property. It's all beneath this park parcel and So there are no utility features planned on the surface of the parks parcel SP. You will obtain a revocable use permit for the creative construction and park property will be restored restored. So that's sort of a judgment call. I think in this case because of the Civic good, you know this sort of ended in because there's no surf we try to make the decision that this was okay to do the 2 in terms of operation of the two users are not incompatible that the way beneath the surface stand. Will allow the part to function. So this is the next slide that shows this really shows where the new is the new microtunnel that they will be building. And again, the the you Siri is just the very corner here. We're at boars underneath it will come underneath the parks parcel and then to facility in the street right of way there. This is a cross-section showing the ship canal. In fact, and the UC area is just this very small area that is beneath the parks parcel on the south side of the ship canal. You may ask her why a PTO. Jyp toj is a mechanism that we use. It's like an easement some mechanism that assigns long-term property interests to different a city departments that allows spu to install and maintain its equipment without the need for a separate Parks permit site site will be restored. Of course the existing Park made up over those three Parcels I described is very small 2.3 Acres, but it affords a unique view of the ship canal in the surrounding area, you know, I would call out for a pth a partial transfer jurisdiction. We have typically only done this with other City Department. So we wouldn't do this with a private commercial operation. That's correct. Operation and then the last bullet point here is that it is consistent was proposed is consistent with that word as one 18477 witch doctor. Thank you for this. What's the schedule? I think it's I'm going to look to spu. Are you asking construction schedule the time we're going to start digging and that would might impact the park to the time that it's restored. Tough question. Sorry, I'm just saying that it's 36 36 months. Don't call the on the outside Doesn't doesn't we don't need the exact details, but I was just looking at was is it starting in summer of next year, whatever Christopher just at some time in the future just circle back and and tell us what the schedule is going to be in what people can expect in that area code 011-9475. No further discussion. All those in favor. Say aye has no eyes have it motion passes. So will forward this to full Council. Thank you. Thank you. Thank you so much while you're waiting for the next people to come up. Thank you very much for your help. And I can't remember where I saw I just want you to know once again Parks has been so helpful to me. They put together a a project plan. We're going to look out for City Hall Park and yes or crescent me on it this week and then there will be opportunities for plenty of public involvement engagement. So thank you and thanks to your staff really appreciate it up as that is her her project. So I'm guessing she has been in contact with you. I support her 100%. Record and then I'll make a few comments and they will move toward item for. Items for Council Bell one 19477 and Ordnance authorizing the superintendent Parks and Recreation to execute and accept from the Washington State Department of Natural Resources on behalf of the city of Seattle a water a permit for water weigh one in Laurelhurst and item five Council Bluff 11948 to an ordinance authorizing the superintendent of Parks and Recreation to execute and accept from the Washington State Department of Natural Resources on behalf of the city of Seattle a Waterway permit for water weigh 380 in the Washington Park Arboretum. So my understanding is that we have to water wave permits one at Laurelhurst someone at Washington Park Arboretum. We're going to just execute a Waterway permit from DNR that would be the state that these are five-year terms and is a little bit more information regarding Laurelhurst and their Community Club in a little bit more information regarding Washington Park Arboretum, and I just want to emphasize that these are both obviously public open spaces for public purposes. So we'll focus on that and then we'll move to What you want to vote for both break, so I'll let you guys go and talk. Volume separately then okay with that great introduction. I'll just kick it over to chip Nevins who will buy a lot of detail Evansdale Parks and Recreation. So we have to our way permits. Just a little background me. We have over a dozen different agreements with Department of Natural Resources on properties that are adjacent to our Shoreline Parks as soon as you all probably know that DNR controls most of the shoreline and so that many of our Parks utilize DNR land and their three types of permits are three types of agreements. We have water wave permits with her every kind of like platted roads in the water. We've got aquatic easements which are Water outside outside the shoreline like in the harbor area and we have East Upland easements and so permits are limited to five years which is why we have to come back. So often to renew these other other agreements last up to 30 years, but State Statute allows he's going to be every five years. So the first one we're talking about Waterway one. This is in Laurelhurst and until 2014. This is a permit that was held by the Laurelhurst Community Council and in 2014, the state change their insurance requirements that did not allow the community community club to actually hold the easement hold the permit and they requested that Parks hold it in their behalf. So we worked with the friends of water weigh one have an agreement with them where they maintain it. they mow The Lawns they do all the all the work on the property and we hold the permit with DNR. This is been going on. Obviously, it's five years now and it's a well-loved park. We have a neighbor matching funds the community got a neighbor of matching fund Grant to renew the park about three years ago this new basketball court there new lawn restore Shoreline and so we would like to renew for another five years. Okay. So what we'll do then is on why don't we if there's anything else will move forward on this one of them will do that will do the Laurelhurst one first and then we'll do the Washington Park one second. So we already read them both into the record. So let's move with I'd like to move the committee pass Council Bill one 19477 has moved and seconded. No further discussion. All those in favor. Say aye those opposed. No eyes have it motion passes and will forward to the full Council. Thank you. So we'll move on to the Washington Park Arboretum. So as you can see, this is a quite different type of water weigh their there is there doesn't the waterways around the city. Some of them are Uplands. Like what I want. Some of them are completely submerged like Waterway 3A. This is just south of Marshall Islands. It's it's all open water and it looks vegetated but it's really mostly Open Water there and it's a weird shape because I got truncated it got cut off by 5:20 and so this at when When 5:20 we have permits with 520 we had to redo all are easements and Waterway permits with DNR to have control over the property. So this one is just up for Renewal. It's not it's for public use of though. It's just part of the surrounding. No one actually uses that you can vote on it, but it's just part of our control five-year term as well. Correct us a stupid question and there's no use for public purposes. I don't understand why what did it if it's open but why we need a permit from DNR, so it is I'll try to explain it quickly when we did the 520 agreements. There is a number of properties that were impacted part copies are impacted and they had to be replaced as part of section 6 f What is a federal rule on Transportation projects packed in parks? And in order to get that 6s replacement, we had to have control over the entire area that was affected. And so that meant we'd had to have a way to renew our agreement to D&R so that we legally had control over those properties and the 6th app replacement property if you remember is Portage Bay Park over in the U District and that is what we got for the impact of 520 on this what's the status about now? It's under construction cleanup expected opening more or less. Oh, I think sometime next year. You sure. Okay. Good. Let's move I move the committee path Council Bill 11948 to the motion has been moved and seconded. No further discussion. All those in favor. Say aye aye. No eyes have it the council bill or ordinance passes and will submit it to full Council. Thank you chip as usual and thank you for all your hard work. Seriously. I don't see very often anymore. So it was crazy. If you were part of this too. It was really good stuff, which is bigger the next One Ok Soundview Playfield or to the record. Doing what many things today. I know and she's writing me notes at the same time. Writing you notes item 6 Council 50314403 Council land use action to allow installation of 7 Athletic Field light poles. At the sound view playfields in 8000 cubic yards of grading for the removal of an existing Turf and installation of a new Synthetic Turf Playfield. So with that I'll have you do introductions. I have a few comments. I want to make and then we'll Jump Right In which Woodson Castle Central staff Christopher Williams Seattle Parks. So my understanding today because this is a initial Phyllis and more on the is it is a quasi-judicial. It's not okay. So I will do the presentation first and which thank you for the memo dated March 15th, cuz that explains a lot to us on The Soundview Playfield Improvement project. And so then will be entertaining amendment to better reflect our actions today in conjunction with sdci and S. And then move forward on whether or not to Grant the clerk file as conditioned. So with that has anyone signed up for comet oh, we have one person they left. Okay. So apparently clerk file 314-4031 %. Alexander man who is not present? Okay, so mr. Zimmerman is not here. So we will close public comment. Let's go to your presentation. All right. So just very briefly. This is land use approval for that would allow the parks department to install seven field lights that are above the height limit for the zoning that Soundview Playfield is located in and Carly is going to have a presentation on the proposal and then when she's done I have a simple and then to change the title to better reflect what you're actually acting on. Great. Thank you. All right. So let's start with location Soundview Playfield an existing City facility is located in the Northwest portion of the city at the corner of Northwest 90th Street and 15th Avenue Northwest the entire Parks about 10 acres in size and it's located in a single-family Zone. I'm so Seattle Parks proposes 7u field light poles and fixtures and they range in height of between 70 and 90 feet is 7080 + 93 + 73 + 80 + 1 + 9 + 90 It's a little bit difficult to see in this site plan, but and I don't have a laser pointer. I apologize, but we get card copies in front of us to okay the small yellow boxes. Those are the location of the seven light poles and they're located around the place filled the existing play field. I'm so a sec. I we issued public notice and we received it at a handful of comments. We did receive support words of support for the light field or for the field by themselves as well as some concerns about impacts to traffic parking and then the turf the turf at South artificial turf travel in packs to the surrounding property. Craps table Seattle Parks issued their determination of Nantes significance under the State Environmental Policy Act that decision in July probably get into this talk to me a little bit about the public involvement. Did they have opportunities to come in and express their worries about light in the residential areas? And then what you did to address at SOS DCI had our public comment period to week,. In which we received the written letters. Nobody came into my office, but I believe Parks did so we had three public meetings workshops. Earlier and I started maybe two and a half years ago. Now looking at the improvements planned and went through them and we even have a clause which we never get the light right to actually have that on video. Thank you. Great. So here's just a cross-section of the park itself are the playful itself rather just give it an indication of those light poles relative or in in context understanding choose that that is in not in violation of single-family zoning that that's So the maximum height for the zone is 30 ft. Right? So you're you're compliant with that high limit. Okay, I read that wrong and I apologize. Sorry. It's so 7219 Highway 436 family, Sony. Okay. Alright, so let's see So based on the development standards in the criteria the approval criteria all the applicable policies. Sdci finds that the proposal does me all of the code requirements except for height, of course, which is the subject of this lady's approval and that Seattle Parks has demonstrated through the light and glare analyses that they submitted to us that the height as well as the shielding of the fixtures themselves are sufficient to appropriately reduce light spillage and glare. And that we do sdci does recommend approval with one condition. We recommend that Seattle Parks obtain a construction management plan prior to construction with that start with s. Yes that permits us. And the approval through us. And that plan one cute include items like construction worker parking plans and a haul route plan as well. So when are saying is that it's this goes beyond just to seven light poles and the the replacing of the turf at least correct me if I'm wrong for meeting, you know, there are a bunch of other upgrades that are going to happen at this park there. I think I kind of like 10 to the chicken in this is coming from just for the viewing public. This is going to cost around six point three million and this will come out of the refunds yet. So about 5.5 million will come from the park district and about 740 2000 will come from read so it includes elements like the Synthetic Turf feel replaced. Lighting Ada seating another site improvements play field Improvement program, which which Parks does and so good job. That concludes my presentation. I'm happy to answer. Any questions. Thank you. Soccer field baseball diamond and Field Guide EXs EXs is great have a construction schedule on this. This will go out to bid in April 2019 and we expect construction to begin from early summer through December 2019. So you're going to have the you going to have the besides the bleacher seating a batting cage? See Will's all kinds of good stuff site improvements and hands Landscaping improved play filled with accommodate baseball t-ball softball soccer and football, so good job. Something else for me because we're back. So I got all this from Wish by the way back to I'm just I'm trying to respond to neighborhoods and I'm sure that we will be hearing something more but somebody says oh it was two and a half years ago since we had our last public hearing things have been just moving along sequentially. Is there anything you want to tell us anything? We should know about this before we vote just the aspect of the project that you're acting on is the height of the light poles and the light study seems to indicate that there won't be a effects on surrounding properties and so everything else and we're just doing life bowls and I need to get back to your question. So the lights would typically stay on until 11 p.m. We would guard against lights being on when there's no activity on the field which really can irritate neighbors, but we want to work with the community to make sure that we have the best implementation of this. And I know that over the years that people have just cried for more space and cried for lighted space. So thank you for doing that. Just being sensitive to the neighbors about the the lights in the times are on and off but I know you always are so thanks. Thank you very much. That's great. So we have like three procedure matters that I need to walk through. So list you want me to do it start now with the very first one on making the final committee recommendation and then when you want to if there's more you want to add, okay? Okay, so I go first last shelter, right? If there's no objection the council rule will be suspended to allow the committee to make a final committee recommendation to the city council on the same day. A public hearing was held on this item directions counselor suspended we will now proceed to committee recommendation. So I'm going to let you speak with an element, correct? Okay. So the way these actions are set up a clerk file was created very early in the project in the process and often the title doesn't reflect the final Council action. It's me. It's so in order to make it clear that the council's approval. It's just about the light poles. I recommend changing the title to reflect that and the language that our lives apartment recommended was Council land use action to modify development standards for a city facility to allow the insulation and 7/8 Ledic light poles at The Soundview Playfield. Unless you want me to read into the record, but I think you just did but the change would be so I'm just going to do that. I moved to Minsky's me clerk file 314-4032 update the title of the clerk file. All those in favor. No eyes have it motion passes and let's move too. Well that's supposed to say the updated title better captures the scope of councils action. Okay. So with that, is there any more discussion now, we can move to the final vote of the amended ordinance. Okay, so the motion motion, so what is the motion of make? Okay, great. Thank you. I moved to Grand as a condition clerk file 3 14403 Ocean has been moved and seconded all those in favor. Say I suppose know the eyes have it and we will recommend the full Council Grant as a condition clerk file. Thank you. Thank you guys. Thanks for your work on that. Thanks to the law department for helping us as usual. All right, and so just hold on just a second before I move to adjourn the next meeting of the Civic development public assets. The name of communities will be Wednesday April 3rd, and was that we stand adjourned write. Thank you guys. Thanks a lot for coming. Thank you very much. And again let your staff.", "end_time": 5362.3}]}