{"format": "raw", "annotations": [], "confidence": 0.9439563630400477, "data": [{"start_time": 0, "text": "Alright, good morning. Today is Wednesday, May 22nd 2019. It is 9:32 a.m. This is a regularly scheduled meeting at the table or my colleagues councilmember, Teresa Mosqueda, and thank you for being here the morning. Thank you so much again for being here. I'd like to really quick chairs report and I like to specifically provide an update on some of the work being done by the city and the aftermath of yet another spike in gun violence in the Central District. I know that all of us have been following it very closely and also hearing directly from constituents at my staff and I have been in close communication with many local residents in that area including those who attended last week's African American Community advisory council meeting at the Garfield Community Center. We have also been in communication with About her ongoing commitment to community engagement in the Central District at which has been an ongoing body of work in her office as since she has been elected and I really appreciate the ongoing work the inattention and that has been paid to this attention by the executive. The mayor's office is coordinating multiple departments, including SPD and City Light to route to re-engage with community members and to do a neighborhood walk of some sort and visit and a visit to recent locations of where shots have been fired as City staff including members. We'll brainstorm possible crime prevention through environmental design Solutions and improvements to the neighborhood, which is something that the neighborhood has been asking for particularly in the blocks around 21st and 23rd Avenue and Avenue and Union. I anticipate that this community engagement will take place over the next couple of weeks at the same time as it is continuing to invest Bolster many Upstream interventions and gun violence prevention programs through its Summer Youth Employment Program as well as a revised and expanded safety request-for-proposal formerly known as the Seattle youth violence prevention of geography is currently open for nonprofit organizations to apply for Grants on cities. Excuse me on the city's Human Services Department website application deadline for the safety RFP is on June 13th at 12 p.m. I'll go ahead and I will be publishing this additional application information in my newsletter this week. So folks. Can you keep an eye out for that as well and continues to have additional emphasis patrols assign to the central district? We heard that in committee a couple of weeks ago on top of the seven other emphasis Patrol isn't commercial areas that are being deployed during the month of May additionally spd's gang unit continues to investigate the recent incidents of gun violence in the neighborhood some of which they believe our relay. Events associated with ongoing at Gang Related issues if my hope that the mayor's office and the relevant departments will come before my Committee in the month of June. I hopefully by June 12th to give us a presentation on some additional concrete steps and interventions that executive plans to implement in the immediate future to stem the violence were seen in the Central District in so for those of you who might be doing an interested in the subject and want to know more you can reach out to my office at 206-684-8802 or you can email me. Gonzalez. That's with a z at Seattle. Okay, that's my charger port happy to answer any questions. If any of you have any okay, we will go ahead and dig into the rest of today's agenda as usual. We will start with public testimony. We only have one individual signed up for public testimony today as a reminder each person that I call up is his testimony for up to two minutes on an item on the agenda. And actually before he public comment I now have to ask for the another to be approved, correct? Okay. So if there is no objection the agenda will be adopted. No objection today's agenda is adopted. So now we will move into and public comment. Again, each person is allowed up to two minutes at the end of your two minutes. You will see the red. Light flash and I will ask you to conclude your remarks your public testimony today. It should be on a topic on the agenda. If you go off topic on the agenda, I will gently remind you of the council rules require you to speak about an item on the agenda. So that means I will go ahead and check out all the time or only speakers with signup is Marguerite Richard. Good day everyone. I'm kind of fixed in my spirit because I don't see the monitors on and I don't know how often that occurs, but that's what I mean by Logistics and I don't I'm not a child. So I don't need to be spoken to like a child and my clear with that. Okay, so moving right along. You have something that's very. Close to me, but I don't go there anymore. She mention the advisory Council to the police and I'm saying right now that all of them are ineffective assistance is being rendered at said time of the other situation is the domestic violence that occurred in my community over off of 3rd Avenue West in Mercer, and I didn't see what happened. But I came up at the time when the news media was there and when they flashed it on the news, it was somebody that people consider a non-european. That was the deceased. So I'm still very much concerned with all these different reform methods that people say that they have in place to deal with people. That look like me. being gunned down I don't see any change in terms of what I 940 was supposed to have done in relationship to people this is National mental health month. So they said possibly that he might have some substance in him or he might have been a little bit off-kilter and a lot of circumstances. You don't know how they got that far. Somebody can go and have a tragic accident and end up with a a brain stem problem the agenda to ask you to read agenda item one into the record. And while you do that if you were here to join us at the table and conversation around Vizsla, I'd ask you to make your way up. Agenda item one Council Bill one 19513 and ordinance relating to the city of Seattle is Paid Family Care leave program for briefing discussion and possible bone. Awesome. Thank you so much. Thank you Roxana. Okay. I am really excited about this conversation and our consideration of this bill. So we'll just go ahead and it really quickly start with a round of introduction. So everybody can tell us their name and and then we can go ahead and add goes to the runner show. My name is Danny turn on the deputy director for Council Central staff. Rachel Alder Beatrice's mother Aaron Alder Beatrice's other mother great. Thank you so much for being with us today. I know you're from both of you Rachel and Aaron Inn in council chambers before a couple weeks ago. When we Advanced up Proclamation under the leadership of council had to declare he was May 13th as a day dedicated to be in her memory and her grit and her Legacy. So this is a continuation of that conversation and opportunity for us to really take and an opportunity to look at some policy solutions to the issues that your family had to deal with as a result of a bit of a gap in our existing Paid Family Care leave policies. So I wanted to structure the conversation in a way where we could hear directly from Rachel and Aaron. Worst and haven't give you all an opportunity to just share with us what your experience was and then I'm happy to have the mayor's office and sing us a few bars and then I'll kick it over to Dan to kick off a conversation around some of the policy solutions that we've been able to identify so to both of you. Thank you so much for being here and for your courage and willingness to speak out about your experience. That's what it takes for us to be able to really understand how to modify our laws to make sure that they are truly meeting the needs of our employees. So really appreciate that. So, please take it away. I just wanted to say thank you so much for having us here. It's really powerful to think of where we were a year-and-a-half ago. And that now we are sitting here at this table making change. I'm in honor of little be so I just want to say I really appreciate you hearing us great. Also, just want to say thank you if you guys heard us out what you've heard us out for a long time now for the last year-and-a-half. I think Dan here has a little bit of our story there that is perfectly worded. So we're just glad to be here. Thank you for inviting us great. Awesome Adrian. Would you like to have some remarks Gonzalez and members of the committee Rachel and Aaron for coming forward and telling their story. It's it is the way that we can change City policy and the mayor really appreciate you being willing to be courageous interior story and actually changed our policy to truly support our employees here in the city. So we just really want to thank you for that that opportunity to do the right thing and really follow the values that we believe as a city. So the mirror is very proud to submit the legislation even though it's despite a very tragic situation for you and I and some of the other stories we have now heard from our city employees and we appreciate you hearing this bill today. Also in addition Protech 17 has been also very supportive and making sure that we pass this legislation. So I want to make sure that they get highlighted is one of the champions of this to this is just an opportunity to fix a very much-needed Gap that we didn't realize we had in our city policy with regards to when a situation like this happens with a tragic death just days away from giving birth that the folks didn't have the opportunity and not just Aaron and Rachel but other city employees didn't have the opportunity to really take the time that they needed to care for themselves care for the family in this tragic situation. And so the mayor of felt it was important to fix this Gap and this is the legislation that you have before you today, and we encourage your support and fully supported through the city council process and passes legislation in honor of be Thank you. I'm so damn. You want to walk us through the legislation as it currently stands? I think what I have to do first actually is new for a substitute on this Council Bill if I understand the procedure correctly, is that accurate that I do not have words for this. Okay, so I don't order to be able to have a conversation about the revised version of council building 19513. I'm calling back to make a motion to to adopt the proposed substitute. So I'm going to move to amend Council building 19513 as described in the proposed substitute. It's still early though. It's against of those in favor of the substitute substitute version bow tie in the bill has been amended to allow us to have a conversation about the substitute Bell. So Dan, can we go ahead and have a conversation about the substitute bill and I really quickly customer and Pacheco. Do you have a copy of the substitute bill? Is it the one that says uploading? I'll be happy to do that. The substitute legislation would change the Paid Family Care leave benefit to provide employees of the city of Seattle with up to four weeks of paid leave following the death of a child. The city currently provides its employees with a variety of types of paid leave but circumstances left Rachel and Aaron Alders family without direct access to paid leave when they needed specifically during a difficult pregnancy is all there had used up nearly all of her accrued sick leave and accrued vacation leave when their daughter passed away shortly after birth is Alder found that she was not able to use the other forms of paid leave for the purpose of grieving her family's loss. The proposed legislation is not intended to address every one of the many types of challenging circumstances for every type of family situation rather. The bill would address the actual Gap. It was experienced by the all their family the proposed changes would mean that all city of Seattle employees would get up to four weeks of paid leave if they have to grieve the loss of a child some of the key. I proposed changes in the bill to the existing Paid Family Care leave benefit are as follows. The bill would add a a new qualifying death as a triggering event allowing employees to use up to four weeks of paid Family Care leave. It would also Define this term qualifying death to me. Neither the death of a child or the death of a domestic partner or spouse from childbirth or from complications related to childbirth next it would require that Paid Family Care leave the used within 12 months of a qualifying death. I am finally it would allow employees with a qualifying death to use PayPal Paid Family Care leave without drawing down sick leave or vacation leave balances, but for other currently allowed uses of Paid Family Care leave employees my Stihl drawdown sick leave to a maximum of two weeks and vacation leave to a maximum of one week before they can use the benefits. I'm the executive indicates that the law will have minimal physical impacts that can be addressed with an existing resources and the city's reserved for the paid parental leave and the Paid Family Care leave backfill. We don't have a mechanism to identify exactly how many employees this might impact in the future, but it's thought to be a relatively small number. Great any questions about the policy through the bill and a questions? No questions that will move the comments. You want to go first, or do I have to note that as we're talking about the changes to Vizsla the sun is shining directly on the piece of paper as if there is on the table. So I just I feel like this is a huge First Step that you guys have been fighting for a for the last year-and-a-half as you talked about. We will keep fighting with you to make sure that we continue to amend the laws and make sure that every family is able to not only have access to the time off that they need to grieve in the event of the death of a child but that when that occurs to a family over all that we will continue to extend this I'll leave benefit to them. So I do think that today is a really great day to highlight the fact that these life lives on in. This document without your hard work we talked about this last time you were in Chambers, but without your hard work your dedication. Advocacy your tenacity you to say that we are not going to just accept. No for an answer i c e p t e r. Sorry Protech 17 sitting behind you Sean's here without the full force of your story be story of the Union continuing to say no. This is a gap that needs to be addressed and needs to be addressed now. I don't think we'd be here. So I'm a huge amount of appreciation for your dedication for your courage to keep telling the story cuz I can't imagine it's easy to tell it over and over again and for all the families that now don't have to go through the trauma and the unconscionable pain that you all had to go through not just with the loss of a child, but then to realize that you didn't have that protection from your own employer to take time off. We are making significant strides today, and I think that there's a really important changes that you heard from Dan that I wanted. Lift up a little bit that I think are really key to making this policy at work. The first thing is we want to underscore that for all of our employees now in this city. I'm in the event of a qualifying death including of a child and spouse domestic partner that has had complications that resulted in death due to the birth of a child. There is now leave that's available and the second and third things are the bat leave does not have to be taken. Once you've drawn down your sick leave you no longer have to expend to the rest of your leave in order to be able to take this and it doesn't have to be taken concurrently, right? So that really makes it and its own important bucket that families can draw from in the death of in the incidence of a qualifying death is really critical because imagine, you know of having to do that drawdown situation that it sounds like you had to do during pregnancy and then to do that afterwards. We just wanted to make sure the leave with their I think you said in the Likely event or in the unfortunate event that it is there and hopefully nobody ever has to use it then it's their I'm so those are the second and third things that I think we're really important eliminated the drawdown of the sick leave and vacation leave in the event of a qualifying death and eliminated the concurrency. And then finally, I think that this it's worth mentioning that when we talked about pulling stories to the table light and literally having folks who have lived experience at the table, you're your voices have really resonated. I think one of the things that we seen with a paid leave in the past and this is true at the national level is that we have not taken into account all the various scenarios in which people made me leave and having women at the table having people of color have any members of the lgbtq community having folks who are experienced experiencing the discrepancies in our public policies and in our Healthcare System when you think about women of color specifically who have higher rates of Death after childbirth we are now bringing your stories to the table and changing policy. So they're excited about this first step. And I know you were talking about your next imagine. We will continue to be here with you as you take on the next I was at the casino for fast as they was talking about such a freaking to look what you've done and just a year-and-a-half you change major public policy for the largest employer in the city, and we will keep working with you. So thanks to both of you. I also just want to look right past the Gap there and and acknowledge. They've been working on this with you all for your and a half and I'm Protech 17 really excited about this day. Thank you so much metal chair bank account number Don't make any remarks at the strength in pain, but also just occur to takes it just come polar. So, thank you. Great comments on excellent job of the policy that have changed since the bill was first transmitted to city council and we feel really strongly that this substitute version of the bill is is really well-crafted and I cracked it in a way that is really going to meet the needs of parents who hopefully will you know, if they find themselves in this unfortunate situation will hopefully be able to do you have a much better experience with navigating the benefits that are offered at the city of Seattle. Also just want to express my deep gratitude to both of you and acknowledge the fact that you made a decision at some point to say something in to talk to someone about the gap. And without that being the spark we wouldn't be sitting here today. And that's really really important to acknowledge and to appreciate you all publicly for Having the courage. I'm too in a moment of Crisis that have sort of the wherewithal to be able to say, you know what this is wrong and we need to stand up and and this can't happen to other peoples are really grateful to you both really proud of where we're at now and really excited about being able to vote this really important key policy and fix to the pet Paid Family Care leave policies that the city has and so that we can really truly meet the needs of families moving forward and I was really proud of you the primary sponsor of the city's original expansion of Paid Family Care leave. We had only previously had paid parental leave and when I was elected I had committed to expanding those those are family-friendly policies to include Family Care. And and I mentioned to you both when we met in my office last week that never in a million years that I imagine that this this benefit would be needed in what is supposed to be a moment of immense joy, and I'm sure it's still wet. And I know it still was a moment of immense Joy, even though it was only 36 hours, but it was a short. Of immense joy and never in a million years that I imagine that it would only be a. Of 36 years. I don't think any of us had thought that that could be possible. And so I really appreciate an opportunity to fix a gap in an oversight in our policy that was not intended to be there ever in the first place. So thank you both so much for all of your advocacy and your work and really looking forward to seeing what else you're going to bring to us. That'll help us do right by our city employees. I think we really pride ourselves and in setting the standard of what good employers look like especially as one of the Lord Best Employers in the region. It's really important for us to make sure they were they were setting the standard high in treating our our workers as well as we can. So I really appreciate it. All right, so that being said if there's no other to the one more I always I just want to say, you know, I know both of our offices were working very closely with her. Thank you so much for your changes are tremendous changes to the base legislation in a very quick. Of time a significant important policy changes were really appreciate your quick thinking so thank you and thanks for all the calls you answered and and time you guys took to make this work very well said thanks Dan. I will move that the committee recommend that the city council passed Council Bill one 19513 as amended second pay all those in favor. Say aye. Not opposed notes tensions the motion carries in the committee recommends that the city council passed Council Bill one 19513 as amended to apply ourselves every once in awhile. We will be in touch with you as shortly after I did have Committee hearing we obviously are a very proud of being an employer who has many many employees including herself who are represented by our fabulous labor unions and we are working with a lot of partment to make sure that we are staying true to our standards and obligations around notification of items that might need to be subject to bargaining. So depending on and on what advice and counsel we get from our La Department in terms of how long notice needs to be and how sufficient the notice has been thus far that will determine when we can consider the bill in front of full Council. So we Will certainly be in touch with you cuz we want you all to be there and we certainly want your family and friends who I know have been a rock for both of you to also be present in the room if they're available. So we will be in close contact with you about the date ordinarily. It would be on Tuesday the 28th, but will again be in touch with you to confirm those details. Thank you so much. So we will go ahead and move to our second agenda item, which is just a briefing and discussion and I'm and if you are here to present on the domestic violence intervention projects, I'd ask you to make your way to the table as soon as Gomez reads this into the record agenda item to domestic violence intervention project for breathing and discussion. Thank you Santa Good morning. Good morning. Welcome. Alrighty, so why don't we go ahead and begin with introductions and Technical who presses the advanced button on the drew the chair closest to me. Long time with the Seattle Human Services Department mayor's office on domestic violence sexual assault. I'm Julie Huffman, and I supervise the victim Advocates at the Seattle City attorney's office record. I work in a DV unit. Well, thank you all so much for joining us this morning. I have the pleasure of sitting on the domestic violence prevention Council and as a council member and a chair of this Public Safety Committee, so I am familiar with this project of huge importance and interest of the general public to understand how this project is. I interrupting the cycles of domestic violence. I think it's a really Innovative projects and really excited to get an update in Chambers about the work that you all have been doing together. So, please thank you very much for having us here. Just to give you a little bit of background. The reason that were involved in developing a new treatment model for domestic violence is because back in 2012 and 2013 the Washington State Institute on public policy did a study of domestic violence batterers treatment domestic violence batterers treatment with sort of the traditional model a 12 month minimum one-size-fits-all. Everybody has to do the same program model that's existed for really like 20 years and the Wisp study which didn't actually look at Washington State programs looked at other programs to determine that is really inconclusive weather domestic violence treatment as as designed was working and from that point forward courts across the state including Seattle Municipal Court really were struggling to figure out what to do and there's been this notice will vacuum at the same time on a Statewide level. There is a development of revising the Washington administrative code to try to Domestic violence programs more flexible and into that vacuum Human Services took the lead on trying to develop a new program. So I'll turn over to finish the history portion of our presentation. So thank you so much for this opportunity to present on the TV IP Seattle Human Services Department mayor's office and he has a super excited about this project at the convening partner as mentioned. It fills a gap for the region and so as a convener, we are excited to be part of this we're excited about it also for number of other reasons as a funder. It allows for us to really provide a holistic approach to ending gender-based violence there also components of this particular project that are exciting. I think one piece is really addressing the diversity of the city of Seattle and it's growing population and race and social justice because the model itself really is looking at a client-centered approach or an individualized approach vs. A one-size-fits-all better Intervention Program. We also really liked it for Fact that it is a partnership between government and community members. So this partnership includes not only La Seattle Human Services Department Seattle Municipal Court City attorney's office, but also a number of nonprofit organization such as Collision ending gender-based violence is Salvation Army ACU T&T Asian counseling and referral service and King County Public Health as mentioned. This is typical of Gap that I was created by the way surf report the wedge surf report was really a study of 11 programs that use the Duluth model on none of them was in Seattle and all of them were very standardized. The second piece was that in acknowledging that there is a huge calves community members we can service providers as well as better intervention folks and a CD Seattle folks have come together and really feel like we need to have a response the Colorado model with its component of the inclined Center was really attracted to us. It's also a best promising practice model now. Emily and so we really wanted to learn more about it and adopt it and bring it to Seattle. So exciting pieces that is that of as of June. We had a soft start for this project and we hope to have a full-scale project starting in January of 2020. So with that I really like to have my colleague share more and details about the project. So when is things that came out of the base of a study is that domestic violence is the single greatest predictor of future criminal acts and the single greatest predictor of violent crime in addition. Someone who second victim of domestic violence is significantly more likely to commit future violent acts then someone who then someone convicted of other types of violent. So there's a real need and at 2 looking at the Seattle landscape In The Last 5 Years, there's been an average of 1800 or more domestic violence cases that are actually filed in the court Sanibel court has the largest Municipal Court in the state. And so we we deal with domestic violence on a level really more than anybody else that are filed 2017 to 2000 but I'm still consistently in Last 5 Years. It's at least eighty hundred cases. So that's what's filed. But Julie happened. Can I get more information on what actually happens from the prosecutor side actually file a minority of the police reports that we receive Seattle's a bit unique in that we have a group of victim Advocates that reach out to the victim in the case and talk to them about whether they want a court intervention before we file charges now that is very important. We give that input to the prosecutor and the prosecutor makes the final decision. But I will say during the years when we did not have a domestic violence Intervention Program to order people to it was it was a difficult for victims to say that they wanted to be part of a court process cuz what would be what would be the point of that most of the people that we work with and we get in a we get over 3,000 sometimes closer to 3800 reports every year and what we hear over and over from the people who are affected by domestic violence is that they really just want the violence to stop they want the behavior to change they may have kids together with that person. They may have a strong relationship with that person sometimes and other in other ways, but they really want the behavior to stop and as a misdemeanor Court, I think I am usually very proud that were able to offer that as an intervention. It doesn't always have to be jail time doesn't always have to come with a conviction but more often it involves. Bring somebody to do treatment that maybe they had thought about doing before but with that little extra nudge from the court, they might actually be able to follow through in and complete the victim Advocates that you're referencing are. Those are those collocated with the city attorney's office or somewhere else. So we are we are in the city attorney's office. So there are Community Advocates and then there are legal system Advocates and we are legal system Advocates the difference being that we do not by law have confidentiality. But our role is to help victims as they're going through the criminal process. Make sure they know what all their victim rights are and then we also work really closely with the prosecutors to try to Taylor an outcome to the criminal case. That's really going to affect that family and how many victim Advocates currently work at the city attorney's office. We have nine. It's eight point is 8 1/2 FTE. Okay. And what's the ITaste load for each victim Advocate they get about 30 30 to 40 new reports every month. And so at any time they can have about got you think I'd have these numbers. I'll memorize but it anytime I think they could have between between 40 and 60 open cases and some and we we try to keep the same person with the same advocate. So I'm cuz a lot of these cases repeat. We keep having the same people come back over and over and so are Advocates. I mean it at times we we hope this doesn't happen very often, but unfortunately it does we will sometimes have an advocate work with the same woman or the same family for you know for 5 years. So and do you owe taxes are doing victim and advocacy work across the the county and the city including our friends over that King County sexual assault Resource Center. For example, is there a coordination between victim Advocates of the city attorney's office in organizations in 2K start, for example, absolutely. Is a lot of coordination I think we recognize the complementary roles that we each play where we can have because we're in the criminal process. We can have more influence the prosecutor and we can speak in court for victims. If they can't make it downtown. It's kind of hard to make it downtown. And so we play that role that we recognize that our Community Partners play a much different role that involves confidentiality. They can help with family law issues. They can you know, they have a much broader range in terms of their role. And so we we feel very lucky in Seattle that we have a great group of domestic violence services to refer to a Phi is doing great work. There's a lot of very specialized specifics on Services Northwest network is another so we really do work hard to have we have relationships with all those agencies and dude. Make sure that that we are referring people and connecting them to those Community Resources. We understand the criminal justice system. I think everyone does now is not going to solve these problems alone. So we really need to work together. That's great. Thank you, Julie. So there were a couple of other valuable points that came out of the Wisp study. One of them was that if you have a domestic violence program that incorporates mental health and chemical dependency treatment that there's a 33% reduction in recidivism in the reviewed programs that they had the traditional batterers treatment model did not actually normal incorporate that and the second thing that came out was that if you have an evidence-based approach to treatment with intensive supervision through case managers such as probation counselors that and a wrist needs model that takes into account. The individuals need that that can lead to a 16% reduction in recidivism deserve separate Concepts, but they've been significantly inform how we approach to domestic violence intervention project. This is based on a Model that was developed in Colorado in 2010 that really looked at individualized treatment. And so The approach that were taken to make TV IP most effective is one to provide an individualized treatment model that will hopefully give the individuals the tools that they need if there's no health issues or chemical Inc issues. That's all Incorporated in the intervention that's being done. Secondly. We are recognized in the individuals needs in a way that no one really has done before we are also bringing a victim's voice into the conversation which is something that's not done in Colorado. We're doing it by way of community Advocates as well as in some cases the actual specific Advocate from the city attorney's office so that That part of the intervention conversation and finally we are very conscious of the need to make this research-based sew in the soft pilot phase that we're doing this year. We're developing all the different data points that we want to establish so we can be clear what's working with isn't working. You'll hear more of that in our presentation, but we are trying very hard to correct the problems of the past by one developing and taking the date as it's being collected collecting the data as it's occurring as much as possible so we can actually do a real-time analysis and be set up for more detailed research analysis to follow at this point. I'd like to have mr. James from probation discuss the actual steps involved in the D VIP program. The program is to in the treatment is to individualize the treatment in one way to individualize the treatment is what we call her domestic violence risk and needs assessment and that assessment is completed at the treatment agencies. We working with two different treatment agencies in the Asian counseling referral services and control in treatment Therapies. So the rich need an assessment, it takes into consideration several risk factors individualized treatment the risk factors include safety concerns for victim safety department store has children other family members any prior treatment that has been completed and not completed. It also looks into unemployment mental health issues dependency issues. The goal of the risk assessment is to assign clients to intervention level. There's three different levels of treatment. So that's the goal of the risk assessment to sign these individuals 211 care. There is one aspect what we identify as significant critical risk factors. Those are risk factors that may include, you know, any you sort Brittany reviews of weapons in the present president or pass incidents any suicidal homicidal ideations threats significant, 90v criminal history. Any one of those factors of automatically play someone in the highest level of care. So if I can add one of the challenges, of course in a risk needs assessment is are people honest about what their issues are cuz this is all self-reported. This is also will have access to all the police reports that can be gathered if there's a civil processes that have occurred where their statements made them all all that criminal history all that stuff be provided by the end of the day. It really requires a degree of honesty a front one of the things that makes our program unique is the City attorney has agreed to an immunity agreement. So anything that a person says during the risk assessment or even in probation cannot be used against them in the crankcase and the city's not going to file charges based on anything that they they say, so we're hoping that that will also that that will assist them and being more honest about the actual issues. They're dealing with an example of that would be for example, the first significant critical risk factor having a weapon or access to Firearms. So the immunity an example there would be if you're not supposed to have a firearm Or access to firearms because you have a pre-existing conditions of release or whatever the case might be or you're just legally not allowed to possess or be near Firearms. Then that office would allow the person to acknowledge that they have access or current possession of a firearm without being charged for that violation or a different set of laws rap in in that in that context. I know it's complicated and he doesn't control felony prosecution's right or mr. Anderson is here who could probably address this more clearly, but the reality is a statement made to a evaluator in the circumstance. I don't see how it would go beyond context of that room, but I'm city of training can only offer immunity to cases that they can file. But I would I will just break when you come up so we can actually the audience can hear you two. That's okay. We should have probably had you on the occasion that anyhow, we didn't want to overwhelm you with the city county task force necessarily file felony charges to remove the firearm. So that information would be used to if I had a prohibited possessor is to reach out to try to get contacts that remove the firearm not focused on which is really our Focus here and them being part of this TV IP program that that's our consider that when we were when we are approaching this world. Reducing harm to victims and are less focus on the criminal prosecution, which is kind of what we see is our portion of Criminal Justice Reform on the front end rather than on the back end of a firearm from being utilized in a way that is going to really create death or bodily injury. Majority of the information that's taken into consideration in a domestic violence victim Advocates note to make come from the victim statement. So if there is mentioning of a weapon, Oregon you was in the incident or at the victim in her statement indicated that there was a weapon use or gun or he has access to Firearms that's taking into consideration doing the risk of needs assessment as well. So after the session is complete. Add assessment then goes to what we call the multidisciplinary team, the multidisciplinary team also known as the MDT team includes the treatment providers in includes probation and includes system victim Advocates include social worker a mental health counselor. If an individual in the in the program is already engaged in services for mental health and or chemical dependency counselor. If an individual is already engaged in the chemical dependency Services, the goal of the multidisciplinary team is to one Everyone has to come to a consensus and consensus on Intervention level in the treatment plan. We also are it's also important to note that we NBT team is to ensure the progression and continuity of care based on the individual's needs. So we look at the risk assessment. We come to an agreement. Define analyze the treatment plan and intervention level we meet monthly to discuss progress of different participants in the program. Another goal of the MDT team is to address some. Compliance issues without Court involvement. So if you have a client that is struggling to pay for treatment, we really try to wrap around as much support around that possible to put them in a position to succeed. Different parts of participation that comes from various sentencing types we have could be pre-conviction agreement template order of continuance could be at the first sentence or other plea deal with with the prosecutor or it could just be imposed as a condition of sentence which is more like a suspended sentence fair to pay for treatment will not automatically result in termination from treatment. We Really utilize the court the community resource center in which my colleagues will discuss with talk about more detail later room, but we really really utilize the queen Resource Center to wrap around as much support around individuals. If they're struggling to pay we have employment programs that we can refer defendants to allow those employment programs come with stipends. What's a finish the program. So although the point of it is to put them in position to be able to pay for treatment because we really value treatment then we understand how difficult it is. There is no funding for treatment unfortunately. So the treatment has the highest paid out of pocket until we really try to wrap it around rep as much support around them to help them pay for treatment if that is a reason for her not complying. The cost of a treatment is dependent on dependent upon level income. The lowest end is $25 a week at the cheapest we have vouchers that we give to clients that have little to no income or maybe on the fixed-income. We have a voucher in that doctor discovers the assessment cost outside of that treatment is anywhere from twenty-five bucks a week to talk about $50 a week. Depending on your income. Can. What 50 $50 a week is $50 a week. And how long is the program so so the program is broken down into three different levels. Why do I don't you just answer your question? So the treatment is broken down at three different levels of intensity level two is medium intensity level one is a minimum of six months and he's all weekly sessions a minimum of six months level two is a minimum of nine months and level three is a minimum of 12 months and these are all these are all weekly sessions. So, you know, if you add up twenty-five $50 a week for six months nine months to 12, what's it could be relatively expensive. So we try to incorporate as much support around that need if it isn't need in a barrier to someone being able to complete the program. Is there a sew in the King County Superior Court certified harkening back to my days of practice which aren't weren't that wasn't that long ago that he does but I know that there was a huge effort particular from the access to Justice Community around being able to establish a program to allow folks based on income tax really be able to get complete waivers on the front end of of Court related fees. Can you just talk to me a little bit about the thinking around why we are imposing a fee in this case for people who could benefit from this program pup who may not have access to resources to actually be able to pay to participate. I appreciate that there is not a you know. That termination of treatment for failure to pay for failure to pay for it. But I guess I'm just a little curious about sort of what are the consequences if you fail to pay in are we creating inadvertently creating dad for folks are participating in this and always done a lot of work around Legal Financial Obligations as well and just want to just want to get a better sense of what are the actual consequences for an individual that that gets behind on their on their server requirements to pay and then sort of have a sense from you all about your thinking around a potential opportunity for for Weaver's in in the circumstances were people really can't afford it so I can address that comment is first of all at least in C on this record under the RCW and are the 35225 which is just specifically addresses are Court we Routinely wall suspend fines and fees that are that were authorized to suspend pursuant to our own legislation legislation affect municipal court. So in terms of any fines Arby's in might be posed as part of the Criminal Case by the court, those are almost always suspended or waived. So the question here is the treatment provider and what they can do one of the things that's unique about our VIP program as they've agreed to not cancel someone simply because they're not paying but treatment providers are in the business of you no pain or staff and obviously financially supporting themselves. So they are not able to point time unless we, you know, come forward with the plan and to subscribe I'd subsidies and I don't think they're able to completely Remove the obligation but I brought Tanya tassin up here from Seattle School probation because I think she can probably answer more specifically what's happening on the treatment side with that $25 a week that they're not paying. What do they do with that? Honey. And I'm the manager for the domestic violence unit for SMC probation. One of the things that happens with domestic violence treatment is unlike mental health treatment and chemical dependency treatment. You can go with through your insurance to get that coverage. There is no coverage like that for for domestic violence treatment because there isn't there's not a diagnosis involved with it. And that's where I know. It's it's very unfortunate and it's really sad because we think that folks should have access to treatment no matter their income. So there's a gap. There is an existing health insurance coverage at specific TV. I believe from the the history of the domestic violence movement. There was always pushing against making this a mental illness and I'm trying to look at it more as a as a chosen. So there's I think it's and maybe that will change over time but I think that that is part of it that they have really not wanted it to be seen as a as a sickness but more as a behavior that is chosen and reinforced by the by the community is a c t and t and Asian counseling and referral services in his for hitting batters. So folks will refer to these two programs have either a zero fee or sliding-scale fee based on there and come so we really want to be able to increase participation for everybody regardless of their financial situation and both of us programs Ashley participants of this particular project. So it is really unfortunate that we can offer it to everyone for no fee. But our bar service providers have to be able to keep the doors open programs have folded. There's actually currently only two programs within the city of Seattle right now that provide that service so there's there's limited limited money out there and there is also you know limited funding opportunities for these agencies Wellspring Family Services previously offered it and they've now decided it's not part of their their business model really unfortunate lot of them were just closing down. Can you speak to you whether or not they're used to be Federal funding for this and whether that's doing deliver the years has there been state or city funding County funding through public health or has always been a gas. And it's just now getting kind of delighted. Is there something that has happened at the national to the local level or do we need to step up? Cuz there's always been I guess there's always it's always been there previously was sound mental health used to offer a program as part of their the wraparound services, but it just it just wasn't cost-effective for them so that there's just always been a gap and it's really unfortunate because it's it's important treatment. I think one of the questions you might ask is why haven't we come and ask you to hand over money to to pay for this and then it's a little bit of a chicken-and-egg. We're trying to develop this model. We can't really show you progress much because and so we are hoping down the road to be able to come forward and make some proposals but we want to do it in a really well-informed way. And so that's kind of why we haven't eaten yet. We're still about nine months are almost a year into this Pilots off pilot and next January hoping to make it a full pilot. We're putting the research pieces in place and so forth then and I mean perhaps we should consider presenting something that's more interim to the council to consider and we'd appreciate your advice on that. If you think that's what we should do if there are two service providers, correct where the two service providers located and where Where do you see the majority of your cases or individuals that are being serviced by the program? Okay. The servant the agency's Northwest Family Life is in North Seattle Asian counseling Referral Services is right off of Rainier and MLK and it's throughout the city and outside. The individuals were being serviced zip codes or the residences. Not right now. And I'm just speculating majority are from the Seattle area specific or particular area a part of Seattle. It's kind of hard to tell at this point. We haven't really looked at that data buy a really good point and we will actually look at that data. So there is a real interest by the city council. Obviously, we know how 7 cancel based districts that are done when we look at the network of service providers across the city in a lot of different bases. Not just this one is important for us to make sure they're not we're not creating inadvertently creating artificial barriers to access the treatment program by locating the treatment that is offered through this program in in areas of the city that might not correlate to where people are actually living and would more naturally organically connect with those services. So we don't want to create a pop-out effect by uniform. Who lives in Inn on 45th in District 5 to go all the way down to that could be a significant burden cuz we are all acutely aware of Transportation needs and and pressures of Transportation in terms of moving around the city. So if there's a way for you all to go back and evaluate the data and provide us some follow-up information on where the actual people who are participating in the program are located relative to treatment opportunities that I think could be really helpful information for us. The last June so different agencies are now having to get recertified to be able to do domestic violence treatment at the same time. We're reaching we are actually reaching out to Northwest Family Life to Lost bronze and other groups. So we are trying to reach out for cultural. As well as Geographic issues part of it is also some of the groups have to get reassessed by the state. So I think what we will actually go back and try to see if we can gather the 9th of the ZIP code data in particular and see if we can identify cuz I think it's really diable again. This is why things were trying to do in the soft pilot Year's like what data should we look at and that's really important really appreciate questioning in the space. I think it's super important. We know that in North Seattle and particular there's a massive amount of what number was refers to a service deserts and we certainly don't want to contribute to that concept through this project. And since you are all in this off pilot phase it's a good opportunity to be more intentional around those particular Geographic concerns, and also in addition to that. I think you bring up a really great Point around how there aren't a lot of people who are Actually treatment providers are actually doing this type of treatment. So getting a better understanding of the inventory of the ecosystem, that would be I think it important additional layer to the data that were asking you to produce so that you don't hear back from us. Then we're like, this is crazy. Why are you only doing this and X place and my constituents live up here? It's helpful to have her to the full texture and context of of why treatment providers are in a particular location versus another have only funded and really prioritize victim services and this is not looked upon as victim services, but I would really asked us to really look at reframing the sandwich. That's why I'm excited. I'm going to use the word excited many times during my conversation here because this is an exciting project because of the human services department and our office is interested in this because we really see this as prevention because these folks are going to return to the Communities and you know, the intervention is one piece of it, but where it really connects to Human Services is that we also fund Outreach education and Community mobilization services in which we are looking at phase two to really 3 comes out to really connect it to the services are offered through this court-mandated program. Great, so we are little overtime. So I'm your problem. I'm going to encourage us to move through the rest of the slides a little quicker. Successful completion. So as we discussed previously about the risk assessment in the MDT team. We now get to successful completion of treatment that requires offenders to meet the core competencies as outlined in the newly revised wacken that it's that's up there explains what those core competencies are the talks about the revised or not to revise for the required cognitive and behavioral changes that clients must document through various homework assignments to complete the treatment. I Echo that treatment completion of treatment is not based upon how many groups you've attended or how long you been in a treatment program? It's really about you meeting those core competencies and you Documenting, you know that the required cognitive and behavioral changes to homework assignment. There's various homework assignments that participants are given to complete the well the treatment program and I forgot to mention this earlier level four is the highest level of treatment if I'm up for my understanding and you guys can correct me if I'm wrong. There's only one counselor I believe in there is only one provider in the state that is authorized to run a level 4 group and knees are individuals that that needs their needs May exceed what a traditional domestic violence Intervention Program can provide so they score really high on that domestic violence risk and needs assessment in these individuals are usually just placed on probation to monitor. I repeat offenses or other conditions like mental health or substance abuse. Thank you. Could you talk a little bit more about how the provider desert that you just explain with only one provider at level 4 compared to other states. How do we rank in terms of access to high needs treatment? So actually can I eat can I just something inside? So the level for folks are like the serious sociopathic folks and if you put them in a group they will actually distort the conversation the urban impact get more tools out of it. So it's not a very large percentage baton. You can probably address enter project right now and we have we have not come up with any any level for that require a higher level of training for level 4 level before there weren't different levels. And so I would imagine just over a time that people will start you know, that people will become certified. I just think it hasn't quite filled in yet, but the change And it does so there's a separate screening tool that's used to identify that population. It's the psychopathy screening tool and these are individuals who are incapable incapable of having any type of remorse for their behavior, or they may have extensive criminal histories and diverse criminal histories or multiple victims in multiple partners are problems that predates or is not related to substance abuse or mental health issues. So these are individuals again, like I said earlier that there needs kind of supersedes what a traditional batterers program can provide down. Could you talk more broadly then about level of access how we how are region compares to other regions in terms of access to level 1 through 3 care so I know I don't know if other states are. Have these different intervention levels to include a level four. In the state of Washington in terms of our pilot project, but like my colleagues indicated earlier, we haven't really had a level 4. So it's kind of hard to tell you what that looks like. I think it's a more perfect cuz we're innovating here. So we've taken pieces of models from other similar types of projects and other places. I think judge Eisenberg mentioned Colorado in particular. So it's hard that have another Apple to compare this to right now, especially with the wax just being revised. I don't I'm not I think we're truthfully on the cutting-edge Statewide in terms of creating these news 3 levels on all four levels. I don't think other states many of them are even at that pace yet so I can I can Briefly summarize the want to think that makes it unusual you've probably heard about drug court or other sort of intensive therapy to court Square sort of a middle ground where we do set specific reviews 60-day review to see if the Assassin Done a half year review to see where they're at in the program and a full year review and then subject of reviews that's in part to see how they're doing. It's also in part to gather the data at those different stages so we can help set up research down the road. We don't have MDT is able to address a lot of minor infractions. If you also why we have the ability to set expedited hearings for say a new criminal law violation, or they walked out their big walked away from treatment or they significantly failed to comply with probation. Our goal is that thing that the NDT can really address individual needs as much as possible without having them come back into court. We got to the next slide. I would just say that accountability is part of the the expectation here just like with chemical dependency or mental health, but we're really we're really focused on progress rather than Perfection and we really trying to Taylor Responses to individual so that you know, it it's it's definitely incorporating a harm reduction model of okay this there was this misstep. What can we do to get you back on the path? How can we facilitate this without having to you know, it take more serious action, so We also are in addition to the research that we've been capturing. Her data points were also asking people for their specific feedback. Like we're calling them story logs and in court now, I'll ask her judge Gregory who's the other domestic violence judge will ask, you know halfway through the year. So, how's treatment going? What do you think and people are telling us some really great positive things and there's a couple quotes that we've included that you'll be able to see where they are. Like, you know, I didn't think I'll call I thought I'll call my alcoholism is my problem but this is really giving me really valuable tools or this is helping me with my family Dynamic. We're getting some really positive feedback and we're tracking all that too so we can provide that kind of data. I think just lying if you want to finish up on the next steps slide. I'm so the next steps is that we are looking at an independent evaluator to be located at SMC and this will allow for us to do evaluations in pre-sentence report. So there has been a job posting already. So any day now that position will be filled next steps also include that we really want to be much more connected to the community. So this is Phase 1 to phase two really include some of the providers that are office actually works with and fun in terms of community mobilization and especially for our agencies that work with specialized population to come on board. So for example, Casa Latina Somali ask for his mother nation gender Justice League's those are some of the folks and which have shown interest in being part of this process of moving forward the full-scale evaluation program begin in January 2020. So we're really hoping to we're really excited bout that process and something that's not on the slide button which Hazard role of convener that were supporting its really locating Federal. Funding to support this project is moving forward as well. So we're actively looking for federal funding at this point. Great write any closing remarks or questions? I just want to add that we're all so very much aware that there's gaps in terms of cultural competency issues. You know, if you have a counseling session with 12 individuals and one person needs a Spanish interpreter one person needs a Chinese interpreter some very complicated and how you provide that in the community. Those were things were looking at also lgbtq treatment. We really need to actually develop a model. There's not really true that there's one provider who apparently has had sessions in the past but doesn't actually do it. So these are all things were trying to address gaps a reminder address so we can you know provide services to everyone acknowledgement that happens in an important first step to figuring out how to modify the program as we consider bringing it to scale in a way that is actually going to be responsive to the realities of who is in a relationship with each other and and also sort of making sure they were able to That provide the treatment to folks whose language is not English as a first language and and other sort of cultural competency issues also come through as it relates to gender-based violence and how In some cultures it is unfortunately very normative to engage in those behaviors and really sort of acknowledging that a treatment has to be people focused and centered in order to to really work for other cultures who who don't come from here. So we really appreciate the intentionality around wanting to address that complex issue. Thank you very much work. Last one is thank you for your suggestion to bring back to us some interim either funding or policy strategy some sort of left with this feeling of wanting ask you something in the immediate. And not really knowing how we can help especially given the funding Gap given the provider Gap very much interested in hearing what those recommendations maybe it's kind of the distinction conversation. I guess that's happening around where this Behavior falls on the mental health. And especially when we acknowledge that if it's not treated early Escalade much like other types of mental health counseling you want to get folks in early and just even acknowledging a level for we would have nausea someone who falls into a level for treatment. What is clearly in need of mental health Counseling in is not I mean does not have access to the behavioral health treatment that they need. So what you just follow up with us as that conversation of all this because I think that seeing this as a healthcare issue or a lack of a mental health issue could really help us as a society that are addresses issues earlier on and that I think perhaps even fill in the Gap in the Hills. What are we seeing failures in the past though? I thank you for raising that. I had not realized that was a conversation that was happening in the advocacy or provider world and look forward to hearing how that conversation of all this and how we can potentially help Advance may be more Innovative thinking around that a PowerPoint presentation. We were talking about those issues budget. I think I do think if we have any if we want to make sure that the data that you are all are collecting is actually going to show a picture of meaningful intervention in an upstream fashion to prevent this behavior from occurring and you know, we really need to be serious about equipping people who are participating in those treatment programs even in a pilot phase with Rachel available to them to be successful and financial barriers can be a significant impediment to the richness of the data that I believe that the program could collect so we should certainly have follow-up conversations around what that might look like within given an existing resources that could could be helpful in this might be a great opportunity for us to engage some of our private Partners who might have interest in this space who would be willing to perhaps engaging a conversation with us around grants as well any closing remarks? Thank you very much for your time to thank you so much for being with us. We are running a little behind and as you can see your audience is now full of all of these beautiful people. Welcome to tag council chambers that I know many of you will be joining us at the table for our last agenda item, but for now, we have one more agenda item. So I'm going to talk to us about the third agenda item, which is the court Resource Center to make your way up to the table is Roxanne. I read this into the record agenda item three court Resource Center audit update for breathing a discussion. Wonderful get to see you all again. And I know that this is a long presentation with lots of slides and we're running a little behind today. So I'm probably going to ask you all to sort of jam right through it just for framing I mentioned at that Council breathing back in 2016. I had an opportunity to tour the court Resource Center was really impressed with some of the war that they were doing on sort of a shoestring budget and having a scrappy like nature and really wanted to get a better sense of how we could generate a set of recommendations that could actually help the court Resource Center become a better resource and better structured and organized so that it is able to fulfill its Mission and really wanted to get a better sense of Sir. What is the theory of change and that purpose of the Court Resource Center was also part of what was feeling my interest in requesting that the city auditor's office. Conduct an audit in collaboration with a court Resource Center on to really begin the process of identifying sort of where where are some of the system issues that could be tackled to really create a much more successful program. And I'm and I'm really happy that we are here now 3 years later and and I am excited to get the update about the implantation of some of those recommendations and really started here a little bit more from you all about how the court Resource Center has flourished in the aftermath of of that of that audit, so that doesn't have a. Being done. I will go ahead and ask each of you to introduce ourselves for the record and then I will hand it all over to you for the presentation welcome. My name is Anita crawford-willis and I am one of the judges at Seattle Municipal Court and I'm Carol Bell Daniel, and I managed the court Resource Center. My name is Betty McNeely. I'm the programs and services. Seattle Municipal Court, hi. I'm Judge Faith HS was Seattle Municipal Court Gonzales. You kind of did my whole apartment and I are going to kind of walk you through some of our enhancements the short version of our journey that we've been on but I'd like to start by really having one of our judges speak because she's due back in trial at some point here. And so we're going to have just crawford-willis talk about how she's able to use the CRC and how it it weaves into the work of her court and then just chest will speak later in the front and the processes well Graham, and I hope you will hold College Eisenberg to account for the tardiness As she said, I'm in the middle of jury trial, but I didn't want to miss an opportunity to come and talk with you and share my thoughts. And as I think compliments councilwoman Gonzalez said that about how the last presentation trying to provide a wrap around to help people be successful, but that is exactly what the court Resource Center is and that's why I from the very beginning my I turn you on the cord is something that I've been involved with committed to passionate about and as I'm out in the community when I see other groups that I think could add to our court Resource Center than I am. You don't talk to them and pass them on to get them involved for me. Either is not a day that goes by that I do not reference to court resource center and refer people to go to the court Resource Center. We have so many amazing programs and partners there and they'll talk about those later. But everyday I I refer people to go to the Resource Center, sometimes I even make it a part of their sentence because we have some classes like I will hear someone say well this is what I want to do when I get my life together. I want to find out what I want to do in the future in the class that deals specifically with that helping people come up with goals and how to set your goals and then meet your goals. I had someone yesterday who was was Taft and it was because she said she didn't have clothing and I refer to our court Resource Center we have clothes that are Court Resource Center. We have food at our court Resource Center people can get a bus pass just basic needs people can get meth at the court resource center. And so it's a valuable tool for me just for the basics for anyone using From the Bench, but even for other things help for getting employment help for getting their license back on a variety of things that Court Resource Center serves and so I'm excited that we're getting the word out and even and Ken Watching with our outreach program that we had held last week, you know that's connected with our court Resource Center many people will be referred back there to continue the things that they started at the Outreach, so it's invaluable tool to me. I totally believe in the court Resource Center. I think it's something that the court is part of our mission to provide that for people that come before us, but not just people that come before us but to the community. I just want you to know that I appreciate we came you you funded us so that we could expand and we are using that money wisely other things that you ask Carol and Daddy to do they have been doing that, and I know that they'll be able to present that to you later. If you have any questions for me follow up, please feel free to reach out if you want to come over. I hope that you all have been over to visit our court Resource Center. If you haven't I would invite you to come over and visit our Resource Center. Go with that. Thank you for your time. And I'm going to go back to my jury trial. Thank you for joining us. And I'm sorry that we were running so late and they won't be able to sit with us for a time to appreciate your testimony at the table today. Thank you. And one more thank you. I'd like to to make while we're here. We really value the experience. We had with the auditors office and I'm not sure that's how people phrases all the time but it really gave us an opportunity to look at what we could do to further Advance our our mission. So we do have someone here from the auditor's office today if there's any questions of Virginia Garcia, but I just wanted to kind of mention that and then Carol's going to kind of do a quick overview of what we have going on. So great. Well out of the six recommendations that came to the out of it audit we really saw five is being our responsibility the first three here to increase the accuracy of the Court resource Center's client data to ensure adequate coverage of the Court resource center and really part of that and number two was to work better more collaboratively with the human services department. The third was to improve our understanding of the Court resource in his client demographic as well. And then rolling in the number for really relying on that data and making sure that it wasn't self-reported in relying on with the clients were saying when they were coming through the doors in the fifth one was to Monitor and use the court Resource Center client demographic data to inform our decision-making. So when all of that we took those recommendations and we kind of re-engineering how some of the things were happening in the court Resource Center. and the first a bad being launching a new database July of last year and regularly training all the users of that database so that they can accurately enter all the information. We worked in partnership with the human services department. We were able to secure $88,000 of grant funding. I'm just for the term of 2018 were actually really the second half of 2018 and will use those funds to help enhance the court Resource Center in terms of understanding understanding the client demographics. We looked at data elements that include the income employment their language their educational attainment levels. And we also change from the documentation that were using for clients when they're coming in and making sure that it was user-friendly and that we have a more guided process more like in the information from them. We were able to hire a person temporarily to cover the friend asked to do all of our help guide the client intake process. Will that's something that is still kind of a work-in-progress for us because it was just temporary funding that we got from HST for that but just looking at where we are since the audit we got seven new Partnerships. We have Hepatitis C project novels Pioneer Goodwill the center for Human Services Cowlitz Indian tribe Goodwill and we revamped our relationship with the YWCA. That's great. Some of our program enhancements before we were doing an employment class. Now, we've kind of taking it to another level we're working with two agencies. That's Pioneer and Urban League. Both of them have employment Readiness programs that were able to directly refer clients into so they come in they'll do an orientation for anyone that signs. I am so that be the public or any Court users that are interested in either attaining better appointments or just basic employment or job training skills. We also have our life skills class, which was originally just being held at the court. Now, we've taken outside the court walls and we're having it twice a month Ashley wants happening right now at Seattle Public Library. We have the self awareness Workshop that continues to serve Court involve clients as well. We have our marketing materials, which we believe is a little bit more user-friendly than the information that we provide his clients before really outlines. All that is available to him whether it's the employment workshops or housing food stamp food stamp benefits food clothing hygiene things like that. And is this online or is this a paper copy about feels great. We did we are in the midst of revamping our web presence as well. And this is what I database really looks like when we're using it on our side and tracking all of the client information kind of small for you to really fantasies that like we want to know everything from all of the information that they're what it is that they're seeking and what they actually were able to obtain when they were there. One of the things when when you came back a few years ago in Kennesaw. We're doing on our kind of shoe string. I like the word Scrappy that was excellent. One of the things are really like relied upon where are volunteers and that's how we kind of managed without assign staff to the area. And so we wanted to let you know that we've continued with the support of all of our volunteers and our insurance it come to us. We have almost 15 different universities and schools that people are coming and doing their internship at the court and so a one of the really one of the states that happens for many of our students is at the CRC, so One of the things that we realized that everybody doesn't want to come to us. So we are working on our Partnerships external to us. And so we have some relationships that really referral basis whether they're referring clients into as Aurora fire referring individuals out to them like an agency like Aurora comments. Maybe they are able to give one bus ticket to a person but we're able to give them so that were firm down to ask to get some of that wherever there are gaps and services. We kind of working partnership that way. And as you probably really familiar with is a reason why our warrant Outreach events, and we're really kind of changing the name of that because it's gone Way Beyond just warrants yet started out the first two times just looking at Lawrence and how we could help individuals with that but is everyone comes out and they're sharing with their needs are we're expanding and building on the services last week's events. Almost 2 weeks ago. Now we served over 250 clients and actually gave them the things they needed and when they walked out of there, they said they were able to accomplish more in the hour to that there then they could in a month's worth of time because everything was there a readily available to him and we had everyone they are from the division of child support the King County up program Goodwill. Was there providing employment-related Services King County Metro the Orca program. We had someone there that was working with people that I get tickets for are citations for a riding. The light rail or on the bus and are able to resolve on and we're actively working on how we can better meet the needs of individuals that are coming in needing support with relicensing or some of their citations as well. And so you all are helping with not just municourt tickets and resolving knows but I'm hearing that you're saying that you're also addressing the needs of people who are getting tickets from Fairburn enforcement on transit system to have a representative come out and support with that too. Well, or if people have multiple to tickets, which is not unusual into fractions in Federal Way in Seattle different parts of King County. There is a Consolidated program that will he kept really really busy and at our event recently that took place at Garfield Community Center. So we've done our fifth event so far last event there prior to this was in Delray. Which was very successful Garfield Community Center and we're starting to do some Outreach right now for the next event. We always bass parks department community centers for many reasons one. It's so is really worked out to leverage other City departments and to be able to use that infrastructure that's already there. And so next event you'll be hearing about soon will be coming up and we've moved them all over the city of Seattle. I think one of the things that we looked at with the community centers does having a place where it's kind of family-friendly user-friendly people going to the community centers already. So there is a comfort level. I know we still are working on the concern that this might not be legitimate thing. We're we're really there to resolve warrants because of things that have happened across the nation and other forms, but we really want the community know that were there to support them and hopefully move them along and out of the Criminal Justice System. You all have come a long way on these workshops in events. And I think the first one you had maybe 50 people maybe 50 people and to go from that to 250 people last week. I think Timmy shows that that the legitimacy of the program and sort of the trust that people are starting to develop in the fact that they can go there and actually hit What does opposed to it mean a ruse where they're going to get in a busted on a warrant is it's working. There is within those communities is a super important part of continuing to Bill Belichick Embassy to make sure that folks aren't too scared to show up and receive those services. So well done. Thank you. Oh, I'm sorry cuz we're Pacheco. Well, I can talk about that. So it when I'm in the jail, a lot of times folks are just like I want to get out and so particularly at the time of sentencing. I will ask them what's their goals? What's their plans wants to get out and a lot of times they will talk about the stresses of not having housing or maybe they had to get to a job and now they've lost that job. So I get to hear a lot of different things that's going on once they are released and so I will refer them to CRC. So for example, they all say well I'm unemployed and then they'll say will you know with my history I probably won't be able to get a job. I'll say wait hold on and then I'll go to the computer everyday CRC send us information about who the providers are there showing up that day also about Career Fairs. For example, the Urban League maybe doing An employment fair and then I'll talk about here. This is the date. This is the time and they're giving people second chances. They are actually looking for people who have your history and the the attorneys are so used to me providing that information. They literally start giving information to the individual as I'm speaking to them or even before I start speaking because I'm trying to make a direct connection. Another thing is about our branding one of the things I emphasize is that is not a program just for those who are in custody, but it's a program that's for the entire community. So we anybody can come in and utilize it cuz I think there's some fear-based that the fact that the program is housed within our courthouse. So I let them know is this is actually a program that's available to anybody. So that's kind of how you see it work in the jail particularly with when I'm running the jail that day. Great many follow-ups council member from just a little experience of being a victim of wrongful arrest flyer information inside of inside of the King County Jail about Bail Bonds, but a number of men that I met that night. I knew we both knew that they were going to likely lose their job and it didn't matter how any of us have gotten there. It was how can we figure out a way to support them? Get them some stable employment so that cuz they're all organizations out there that are helpful and supportive. And so that's why I found curious was why bail bond information is available next to the phone, but but not Information Form places of employment order flyer some notification Because by the time you go from your release to your court date, it could be several days. And so that's why I thought to myself it actually physically sits on a table with all the other paperwork. So when they're getting their paperwork for their next court date also what the core conditions are. I'm making sure that they actually have a brochure or the document in hand and then I explained to him what it is. This is four years ago, but we're trying to make this not as oh by the way the CRC room trying to make it as part of the profolio of information that they received before they walk out the door. Another Sly really that focuses on the human services department support last year because really it was key to as having an administrative specialist. I could stay out that front desk as well as securing some different operating equipment that we needed and Sopranos Shane's light signage. We have a couple retractable signs that we have that we use their internal at the courthouse. So people can know where the court Resource Center is. That was a big thing when like when you all came over and told everyone said we need to sign we really don't know where you're at and then we're able to take that also went to the community when we're doing different events. We want to be able to show you some of our numbers real quick. And so if we forward to CRC utilization and demographics, you noticed it's only over an eighth month. And that's how long we've had our new database in place, which is really increased us being able to validate the data is being collected. So during that time. Over three thousand oaks came through the CRC we projected where were averaging about 4,000 people a year that are coming through in and utilizing services. And those are all individual visitors not visits but visitors we break that down a little bit but usually I think it's going to let Carol speak to it. But the majority are unique visits. There's some people that come back a couple of times which we encourage so that maybe a little bit more about I guess in there. Music continues to be more the majority of our clients coming through her mail 70% you'll see there and the majority of them still are reporting that they're either unstable or home. Also, we know they are that are Court clients nearly 80% are folks that have current involvement somehow in the court which leaves about 20% return on court clients. In terms of racial breakdown about 40% of them are white 30% being African-American Hispanic and 9% And we have about 12% that are under are unreported. And again with some of these. There are certain things that as were screen in the client's skin doing the intake form. We don't require we tell them that we would like to send formation why we want the information then we'll just try increase our access to service then to have an accurate data, but we don't require them to provide information on their race or their sexual orientation. All of that is optional. Do you have any any any reason or any sense of why is proportionately were we're serving more white Caucasian white? individuals as opposed to black half American Or Hispanic Latino when they make up the majority of jails, you know, I'll say that everyone that comes to the doors of the Court Resource Center having me of the Court have the opportunity to come in. There are some people that will Avail themselves to Services a little bit more easily than others. I'm in some people you want to stay around and participate in other activities such as coming to the court resource center and being able to access some of those services and some of them don't I really can't explain but I guess that is something that will continue to look at in our research and in terms of the client demographic that we could probably report to you out later. If there's a policy of pension funding in terms of Outreach something that could be helpful. Just I would say is a recommendation for us a little hard for me to draw any conclusions from related to disproportionality without knowing without knowing a little bit more granular detail about the jail population for example, or the Court involve population that is coming to SMC. I suspect that comes more pacheco's statement that it appears to be disproportionate in terms of accesses accurate, but it's hard for me to draw a clear conclusion based on just this slide. So if you all have information related to the demographics of the court involved clients that are sort of the overlapping or over that we can overlay this with that could be helpful in evaluating whether or not there are some additional support says identified by customer Pacheco. They could move the needle on on those access issues and what this homeless population looks like vs in North or South Seattle things like that that makes a difference sold those different pieces and we do have other than some information that is now Reported in here today that we'll be able to share with you all really have wine the work of the resource center in two are more traditional probation work. So anyone that comes to us on formalize probation the first thing one of the first thing that happens day one, is there connected to the resource center. So that also is going to be interesting to look at in regards to numbers. So we'll keep that in mind great super helpful. So just in terms of utilization and demographics, you'll see that about 75% of those that reported in the income of $20,000 or less. So they're either from 20000 to no income. We're looking at the top 12 Services. The first thing people are looking for a really when they come in his clothing. Then the next thing they're looking for his food. So we're either able to support them with food stamps through DSHS or food bags that either we managed through different donations or agencies, like emergency feeding program provides who bags whether that's a snack pack for a full grocery bag depending on the client and where they live and what they're able to transport with them is how we decide what will provide them but nobody goes away hungry as long as we have food. Now looking at this piece of housing. We have a 538 people that came in looking for housing. It's an interesting thing cuz we don't have housing but we have referrals like most of the community and so we are trying to work more closely with agencies that maybe have a direct vent space or have some kind of fast track in two different forms of housing. Maybe that's true employment-related program like the Urban League or they may have some type of housing associated with Employment Program. And just in terms of our visitor experience. We're really working on this piece of doing exit surveys and that's follow up with clients. Whether that's who your phone email her while they're right there in the office to see how they felt they were supported through what we were able to provide to them. So 83% said it was either somewhat or very helpful. Just looking where we are for 2019 and what our priorities are you can see right there in this dinner is we really want to increase individual health and stability of all the clients that come in we want to be able to provide and use data to inform our decision making we want to expand. The number and availability is On Site Services. We want to improve operations and Service delivery, and we also want to create increase accessibility and Community engagement. And then we've given you some really some numbers to look at on what are internal goals are on Improvement. So it's like housing assistance. You don't we really have an ambitious goal when there is no housing dedicated to us, but we want to be able to connect people with it is as much Services as we can. So these are our internal kind of goals that we have and we will be measuring those as well. I really wanted to leave time for judge chess to kind of give you a little bit more of his judicial perspective cuz I think that that has been so crucial to kind of having this project move forward and what we're doing. So one of the things that I like is that I get up a way to offer More Than Just Words A lot of times the folks that come in front of me. Don't see much hope and they don't have much. As way of leaving personal items and so before this judges were left with just a sentence and I hope you don't come back here. I actually now am able to say this case is over at this point. However, we are here to continue assisting you. Through housing, you know, babe referrals the job programs food clothing and not just now but in the future as we all know that when a person is in the system. It takes years months to change about the things that got them there in the first place and they need a hand up and that the core can be seen as a tool and instrument to help them move forward and not come back. I remember talking to a gentleman who was in front of me who had not had employment for years and he was sorta like, you know what my history I'm just never going to get a job and I was able to say that is not necessarily true. There are agencies who offer their second chances and because of the information coming out to the CRC as I've mentioned earlier I could talk about the agencies such as the Urban League and to give actual dates and times his face literally lit up because I didn't just say there's this agency out there. I'm like, no they're having an employment Fair they are is going to happen. I actually can also tell them who's employing like UFC. I had a conversation with one another person. I said Courtesy car. QFC is looking for Courtesy clerks. They are going to accept applications through this method and I think the level of trust is different because I can be that specific about what I'm talking about. And I also think I'm highly encouraged on the fact that your attorneys that are in the room with me help assist me and giving that information to them that they are feeling this is an important service for the community to have and that just kind of solidifies the trust. And so I guess I would be very sad. If I did not have the CRC in my toolbox, especially on the jail calendar. I really would. Thank you. I really appreciate you sharing that that perspective. I have been a fan of the CRC for for quite some time and I really appreciated girls willingness to partner with me on having the city auditor do the evaluation. I think I think you all have done tremendous work and really risen to the occasion in terms of implementing the recommendations of the city auditor's office and I'm really going to be on that frankly. So I feel like the community resource center on start using that now the community resource center and it has really been a complementary and good addition to the the suite of services provided at the court and now within community and I'm really hope to be able to see an opportunity for a mule to continue to live. Those relationships of community-based organizations that really helped to build the trust and legitimacy of a program that is located within within a courthouse. So really really appreciate your all's work and effort and you know, Carol and Betty you all have done really tremendous amount of work on this on this program and I really appreciate it. And and I'm sure that will can you all will continue to innovate and and really think about how to continue to do Improvement to the programs, which I have referred to as program enhancements. I think it's I think there's a lot of continue to opportunity here to continue to meet the needs of people who are already coming into contact with a court so really appreciate it either, sir. I'm thinking about him terrible as one of those things. We had a chance to talk about when we visited in my office was the desire to have sort of what we're calling the vacation event. I know that that framing could potentially lower people and they think it's a vacation of it but someone specifically focusing on vacation of past charges would be really exciting. I know you offer a tremendous amount of services and I think of the chair and I were chatting about it might be interesting to see how many people had access to Social Services after they left your vent. Like utility discount program food stamp is specific to just the vacations that may be causing severe and limiting people's ability to get those employment position. I would love to follow up with you about sort of a vacation only event and we can put some really cool graphics on that and people would come to their vacation event. Dpd public defenders there their civil side, and there was three attorneys there throughout the day and they were meeting they were one of the busiest tables we had and they were meeting with individuals about people wanting to expunge their record other matters that may be that they had some questions about that may be holding them back from future goals. And so that's a new edition this last go around very successful and will continue to expand on that, but they were a great partner with us in this event. That's wonderful news, really appreciate it. If you haven't had a chance to go visit the community resource center strongly encourage you to do that. It's literally across the street very easy to get there and Betty and Carol are some of the nicest people you'll get to spend an hour or 30 minutes with so really strongly encourage you to take them up on their tour offer if you Chance to do. So thank you all so much for being with us. I really apologize for the delay in time. And then we're going to go ahead and move to our last agenda item. The last agenda item is a presentation on ready to work. There's only about eight slides colleagues. So I anticipate that we will end close to about 11:45 if that's okay with you all sure. Okay great. Perfect. So if you are here to present on our last agenda item, I'm going to ask you to join us at the table while rexanna reads this item into the record coming up one. Agenda item for ready to work for breathing in discussion. Thank you Roxana and Glenn. I apologize that we are running over time. I know you brought a big audience with you, which we always appreciate and because we are running behind a little bit. I'm going to ask that we try to end today at 11:45. So that is in about 15 minutes cuz I know where to start losing Rod committee members. So thank you and welcome to all the students and teachers should come through so we have some more folks coming up a slide presentation and go right to the students and the teachers and a graduate of the ready to work program so we can follow up communications on the on the side, but I just one side maybe real super quick and we should This is a little slide. You can refer to later to kind of see the evolution of the ready to work program which began in 2015 as a result of the advocacy from the community for beginning English language Learners. And since then the program has grown with the support of the console and the only other background I would give is who are partners are in the program and that were running a combination of ESL and employment programs community neighborhood-based. So let's just turn it right over. I mean introduce Alex Islands from a CRS name. So if we can just go around and and everyone say your your name and then we can go ahead and hand it over to the students and teachers. My name is Yasin Malik Soldan's formation counseling referral service. I will keep myself from But let's make sure that microphone is on is it is light green on the stem. Brass, and I can go over and help you. Okay? My name is Emily Muhammad. I'm also from literacy source, and I teach the level 1 level 2 class at atrs. My name is Sammy. I'm from Southwest arrive to work student. My name is Elaine, right? I am in the teacher at in West Seattle with literacy source. Hello. I'm a student from the CO2 laser or sauce. I'm student it service. My name is Megan Dalton. I am the teacher for level 3 ready to work with literacy Source will welcome to all of you really appreciate you taking the time to join us here know that you've had a busy day going around city hall and whatnot. So really excited to hear more about your specific experience in the ready to work around which I am a massively huge fan of thank you for your support to the whole city council. We really appreciate it. So I'm going to start with yes scene because he needs to get back to his job. And yes scene is a wonderful example of how we can impact people's lives when we have the time to work with them for the long-term, that back in 2016. It was a one of the wrist walk student at that time. It wasn't have any work authorization. So I got a lot of support from Job training classes, then when I get to my work authorization that got me the first internship in order to get back to my accounting feel that was a huge thing for me after that. They get that for me to apply for my first accounting job. So I got a lot of support. I know that when you are new in in in in a new country, you don't have any landmarks. So the where my Landmark so dead that led me to get know my permanent job, you know as an accountant today, and I want to stay where you're working now, so the help me to For the translation of my credential because I have a friend diploma soda help with my credentials. Nesto. So that you can use that credential here in America for employment in the field that you were trained for school. So he's back to work again. His profession is English is obviously excellent. He also speaks to Molly and French and we believe he's a huge asset to the city of Seattle in this country and we're so glad that we were able to work with him. That's great. Thank you so much for being with us for sharing your story. It really happy to always really happy and excited to see the successes of of the Investments that the city of Seattle makes in organizations likely resource and others who really help acrs excetera who really help us make sure that we are focusing on Workforce Development with a really strong lens on what Means to support and Empower or immigrant Refugee community members to be there. Cells into really be able to contribute fully in the things that they love to do and you went to training for accounting something I would never be able to do myself and really appreciate the fact that you participated in the program and are here to share your story with us think you know, that's so great either going to make me cry and if you have to leave no worries, you can leave whenever you want and I teach for the north section of ready to work. I also used to work with Alex at asrs teaching that class for the first two years. I love this class and I love being able to work with so many interesting and intelligent people from all over the world and I feel fortunate to be a teacher and curriculum developer for this program. Easter day, we talked a little bit about City Hall and the city council and what it was in preparation for coming here and we discuss representation and representatives and today our representative for our class who is here to speak about her experience is Jiang thank you saying today's at Hollister to share my experience here and I feel a little bad ass my broken English. Sorry your English sounds perfect to me science 15a 2015. I don't speak English a lot because I'm here with my family about right now. I live with Adele song before I'm came to the United States added a university education and I worked as a music teacher for 15 year olds in primary education, and I don't have any experience experience with my in English. So keep on Saturday for English. Wow, that's my especially important sofa one of the reasons I could get out of work like Ray increment. Another of the reason I could have got together as a support to my children teaching him. I don't know where I have for this until I went to the Lake City Library. I found a I found the information for my dear by chance. They are about to leave school. I was like they accepted me. I have been studying their over a while years before I have a job and let me see and prepare for a job also could land a lot such as wind and about a job application writing resume using computer searching a good job title. safety as a turmoil and the soldier so so I will keep going on and turn my class to study. We also learned many ways such as raising a story about a texting conversation with my classmates Writing Practice Sol. This class is range and a flexible very like this class. So I think it's a necessary on the important and I also learned the sharing caring respect and a helping each other in literary Source all my teacher and my tutor if I can. I'm getting more opportunity and the chances. And I know I can't remember skate unfortunately has to leave a little earlier and she has a complex. But thank you so much for being with us today. All right next to my name is Megan Dalton and I teach the ready to work South level 3 at Rainier Beach library something that I think is very special about the ready to work program is that we teach English language skills combined with workplace Readiness skills and college pathway planning. We really want our students to get good jobs sustainable jobs for their families and to be able to plan their Futures the Futures that they want to have. So that's very special not every english-language program has that combination of different kinds of planning and job help and English all together. So I feel very honored to work in this program. I also have the honor of introducing my students that equal she is representing. Our class from Level 3 Rainier Beach. I am from Sophia. We just need to get that microphone a little closer. There you go. I am sorry. I am done. I am from Pia Pia. I'm done at that. I haven't even chatted for 20 years. I love to cook and do it to work. We have you started writing reading listening sentence speaking against file. It just collateral take the about food safety. I wanted to to curl it. I want to get the job. I want to have a family my tutors had from you is reading my sister kept me writing stating my understanding my music on. Thank you so much. Hi, I'm skinny. I'm Elaine, right? I teach the ready to work West for Grandma to the level 3 for Wii star the newest ready to work program. We started in April of 2018 and it's held at Neighborhood House in High Point are classes unique because we are able to offer not only the case management that already to work classes offer, but we also have childcare on site and because of that a lot of students are able to attend the class and come regularly, which I think is really special. Another special thing about ready to work is that we are able to be flexible and reacts to what's happening in a community. We can adjust our summer schedule to figure out how people are going to be able to make it to as many classes as possible. And I think that that's a real asset to the community. I'd like to introduce. I'm at Buda. She's been a student in my class in September and because we have childcare his wife is also a student in our class. So I'll leave it to Ahmed to explain what we've been studying this. Gracie Hi everyone. My name my name is a minute. I'm from Ethiopia. I am living in Seattle South Southwest Seattle Washington. I have a for children. I live I'm living with my family. We are learning with learning for writing spelling reading word Amore sentence. And I took I took test on the computer charging. I get a food worker card my future goal is I want to be a store team leader at Whole Food Market store. Yeah, I study English spelling word writing composition and more sentence in a lie. I want to say thank you you too, all Seattle City council leadership because you support for a comfortable and a very well as the children in the gas car, and we organized teacher. Also my we love our teacher. Thank you Elaine and Kelly. Thank you. My name is Emma Muhammad. So I teach the level 1 to class over at a CRS. It's a beginner level class. Also, we learn basic computer skills such as typing sending emails accessing Google doc. Some of the projects that we've done in. Our class is a timeline of basically their short-term and long-term career goals of what they want to achieve. Thank you. Thank you so much. Anything else anybody wants to add I know we don't have time right now as we were talking about representation and being a active Community member we had came up with some questions for the city council if there have been times. So maybe we can email you the questions that we has talked about because I don't think we have time for each person to ask a question, but they did have questions about their neighborhoods and their communities that that we would like to absolutely welcome you back as well so we can have an opportunity to have a face-to-face to so I will take my cues from glenna's to an opportunity to be able to do that next time we do it we could also prepare a more comprehensive report about the impact of the program the outcomes and What we've learned we're happy to take the questions and answer them for for the class. I think that's a really important part of civics and just education around making sure that everyone understands how you can access represent. You know for people in the audience who are here. I'm I'm really proud to be the daughter of an immigrant myself and my parents came to this country in the 60s from from Mexico and they came here with no money. No understanding of the English language my mom and dad both taught themselves how to read write and do math in Spanish because they only had two weeks of Education back home. So I understand what it means to make sure that we're supporting are immigrant and Refugee families through Workforce Development education opportunities in a mastering of the English language. I was my mom and my dad's translator and interpreter. For everything and I still am still speaks. She speaks some English enough to get by but I still have to have to help her with her paperwork. And with I'm really complex hard doctor visits for example, and so I really understand why it's important for the city to invest in you and your family is in the success of your children and some really excited to be able to bring my own immigrant family experience to City Hall to be hopefully a good representative for all of you and your children and your family so really excited and moved about the stories that I've heard here of success, and I know that there are so many more in the audience that we didn't get a chance to hear really excited about continuing to support this program. And and for those of my colleagues cuz we're check if you haven't had a chance to visit one of these classrooms highly recommend it is inspiring the amount of But you all do and the hope that comes with his classes is is not measurable by any report that we could ever produce at the city's I just really appreciate the teacher in the students commitment to this resilience program. Anything you'd like to say Abby in Children of immigrants and so just a mindful of that. I know that I speak on behalf of you have your office into work? And so when those doctor visits to come around or whatever I can be of service to her everyone knows I'm pretty sure everyone in this Council probably knows about Bella that I have for my mother but I say that just in terms of all of you. I wish you all the best of success in the program and I'll be coming by soon. Thank you so much for the time and thank you because part of this was part of the curriculum as well. It was to bring attention to the program to the council give you a bit of an update. But also it's part of the learning and engaging in Civic life in addition to learning and working. I really appreciate that. So we're going to go ahead and adjourn today's meeting. We'd love to have an opportunity account of a check if you have some time to after the cameras turn off gather together and maybe take a group picture. Does that sound okay group picture time? Alright. So with that being said we are adjourned. Thank you.", "end_time": 8356.7}]}