{"format": "raw", "annotations": [], "confidence": 0.9130473391311925, "data": [{"start_time": 0, "text": "Good afternoon, everybody. Thank you for being here for regular scheduled full council meeting the March 25th, 2019 city council meeting of the full Seattle Seattle City council come to words 2:00 p.m. My Bruce Herald president of the council with a Turk. Please call the roll president Harold today's introduction and referral calendar will be adopted. Are no objection it is adopted. There's no objection. Today's agenda will be adopted. I no objection today's agenda is adopted the minutes of the March 18th. I was 19 City Council meetings have been City Council meetings have been reviewed and if there's no objection the minister be signed. Interjection, the minister being signed presentations. I'm not aware of any presentations safter noon. Which will then lead us into public commented? We're always delighted to come down here and spend some time with us or this time. We'll take public comment and items that appear on our agenda for the day or hour introduction and referral calendar or are a 2019 work program in I'll call you out in the order with which you sign and we have statute limit your comments to two minutes and I'll call to name child of the time and we'll start off with mr. Alex Zimmerman followed by Toby Mills. Saint Joseph Chicago my daughter shooter Auntie smart crook criminal in Killen Minor by Alexandra Raisman people photo City Light So for less than a year of experience a post with every conditioner ciproxin with the 300 people as people come between interest only person of interest small career this exact so we need change right now. So she feel like right now for the last few months every meeting you start talkin about spending in better room menu meeting like a 10 million dollars cost only one. Department City Light Department, spent $10 in bedroom talking to people I don't have sense. Social situation right now by simple is exactly what they want to explain to you for many years you choice of people for the commissioner. What does absolutely in the integral to you you by definition criminal right now I give you a classic example. Go to Mikado boxer Gonzalez 2003 year. Can you sit this? You know, you're not supposed to be said when you violate constitutional law. Open public meetings act and light Gonzales v x u y u. Do you know who we're definition? You posed to be lose every your license. Why is it here? So right now speak to everybody stand up America Clinic next to Toby and then a debolina from Fusion say she has it been in binary. It's actually Tony and Mike will probably not very well. I don't follow you. My name is Tony Mills on my recently moved to Seattle up on Seneca. I'm pretty much here just to introduce myself and let you know that I am hoping to become involved in working with the city council to help make changes that are in dire need in a city or homelessness. And you know, I watched a couple videos in the March 11th be always very very disturbing the disrespect that citizens were shown that tried to speak and I hope that's all. DeYoung outcry from citizens and social media about the poor Behavior by our city council members will bring awareness and a change because you are here to represent us not yourselves, but you're at the citizens and if we're only allowed 2 minutes, your undivided attention would be the least expected with that said I look forward to working with my district and dumb and coming to more meetings and getting to know each and every one of you. Thank you for your time and for your duty. Show following devoleena will be good Leah Paskey Pescador. I apologize for Julia. Good afternoon, My name is Nancy and I'm a policy analyst going to be social with Puget Sound Sage. I'm here to speak today about the threat received by Garden City Council Members and stuff over the past few years our staff leadership and Coalition members have attended and given comment at over a hundred City and committee meetings Racine Council exam public comment. Well beyond the required length of time to make sure that every comment is taken and every voice is hood release the council members stay focused and deep listen to what all the speakers how to say, which is reflected in the policies that comes with has moved. Listening is most effective when he does Cher live experiences with those who speak which speaks to the importance of having a diverse city council as we have now more than ever before Council reflects who lives Works sprays and plays in our city and communities, especially with new leadership by women of color on Council and counsel stuff. Our city has a stronger ability to listen and act than ever before we have witnessed this council's commitment to engage deeply and to invest in comprehensive solutions to our most pressing issues. We stand with you. Thank you. Thank you. Should I apologize for sliding your name? Once again, and Patrick Burke will follow you. Good afternoon. My name is Julia parshuta. I'm also a policy analyst with research with Puget Sound Sage. I'm also here today to speak about recent threats the council members received at by Council and their staff over the past few years Seattle has emerged as a leader and inclusive democracy. We have a more representative government than ever that reflects the intersecting identities in our city those most impacted our leading in policy solutions that makes sense for their communities and we're moving big bold policy. Our democracy is under threat just in the last month. We've seen escalation of threat to the life and well-being of our elected Council and staff undermining counseling staff Authority particularly that of women of color and the blatant promotion of hate against people of color people experiencing homelessness people with diverse gender identities immigrants and refugees and other marginalized groups. These attacks are not just random individuals. They represent a coordinated effort led by right-wing think tanks and media. Open is designed to undermine the inclusive democracy. We fought hard to achieve Seattle is better than this while we have a lot of work to do to unlearn white supremacy in our culture. We are a city that Embraces real democracy Affair economy and human rights. We're not going to allow these attacks to undo our City's values the same with you. Calling Patrick Burke will be the honorable. Michael Fuller last week to validate. Why you think I remember where is his reaction was appropriate the factors of a better chance to start a YouTube career in these doors. And you do in most tech incubators to be honest. I brought two transplants into this room to show the disconnect between you guys and the public comment section just to show what like when people are moving here what they're experiencing on the street with her seat on the street and then come in here and only to see you guys being looked out like looking down and it's really disheartening. It's clear that there's a there's a problem with the current format. I think that every system that every citizen that comes to those doors has a right to be looked at in heard by their elected representatives equally no matter who they are. If something is driving you to your phone instead of hearing us, then we're always in our time. We should see you I would like to see those that have claimed to be Progressive and change the status quo Explorer how to make pop it, twerk. Everybody but more immediately take a stand and declare no more electronic used during public comment and then be a leader make a charter rule while you're at it right in on ordinance. That doesn't allow our elected officials to check out because I already have one foot out the door. Following the honorable. Michael Fuller will be medical Winkler show. Yes, it's honorable. Michael Fuller to I Jewish. Bruce Harrell, I got a problem with you. I think you abused your Authority and power over we the people and this is extraordinary abusive chapter 4230 open meeting at I don't know against Marvin Lewis Richard for exercising up first. Remember, I due process equal protection over the valley Northeast 48th on to 100. Admission. Rg24 02000089843608 freedom from discrimination. And United States vs. Lee 1882 Chinese Exclusion Act of 1882 would violate United States vs Lee 1882 This is not the changes are the drink black in our new generation of death 2077. February 2015 42.1. Thank you very much. Thank you very much. I know I understand that. Thank you. Thank you. Okay, thank you. I appreciate that. And then our last two speakers will be Michael and then Christian hairstyling. Daphne at City Council Members, I'm speaking as my coin collection. Thank you all for your support last week of a project that we're working on. I actually do that as kind of an ongoing support of the efforts in the Chinatown International District over the past few years to try to maintain the place that a lot of his collar heart home. We may not live there but that's really where we emotionally live. And so I want to thank you. I know that we have a city council member that stepping out pretty soon and want to thank them forth weird things like companion legislation, but also weird other things like helping us eventually get a bathroom built-in Hing Hay Park helping really push forward on issues of community preference, which people don't know yet, but they will soon and we'll figure out how to make the community last for us. As a private citizen as my coach in resident of District 2 witch sound so much like the Hunger Games living on Beacon Hill. I wanted to thank you that somebody who just lives in the community who whose daughter goes to high school here. I just want to thank you all for the support that you guys don't get too often. You guys actually have pretty nasty jobs sometimes and I understand, you know, it's great to see you guys out and about in the community. You guys are super accessible because for some reason you guys do drink coffee you guys do to do your town hall meetings. You guys are out and about I know where certain people going to have breakfast coffee. That's you councilmember Harrell in the district and I run into you at times that are in their kind of like embarrassing for me. Like when I'm buying a product that part L drugs and you guys all figure out what health conditions I have but I feel that you guys are more accessible to us than ever because you guys look more like me than ever. So thank you. So that was the Qin. Thank you. Thank you. And our last speakers former council member Christian Harris. Tell her thank you for joining us. Here to speak to the amazing job and roll you have a city council members. I know that times have been extraordinarily hard of late and I just wanted to speak to the fact that there is this larger meta-narrative right now. It's wholly against this body. It is unfounded. I had the pleasure of working besides so many of you on this diocese and I know for a fact that when folks are looking at their phones and their computers often times, they're keeping notes of what's happening in public comment the referring to sections of the agenda that folks referring to their looking up really good documentation and making sure they're taking out because we do take those comments. Seriously. We did go back and talk about what people had to say, you did have emotional reactions when people share to you the very realities of what their living through and that in a time of technology. I think the last thing we need to ask of our body is to move away from the tools that help you document what you're hearing from us and that it is not Surprising to me to see the what happened with this viral video. I know the kind of actors in our city who are spreading that video and spreading the lies about that video while we'd have not always agreed. What I have seen is folks actually deliberate and discuss ideas that they may not agree with which may not even be from their own body or constituency by District. What are important for the deliberation? And I also wanted to say it directly to you present Harrell I have seen in real time. When I served beside you how you took a stand around what the balance of public speeches both for the council members and for the general public and I totally appreciate the fact that you all have been able to have a balance of making sure there is Free Speech. Both frases citizens to share the very real things about what happens when you make policy decisions, but also being aware that you are citizens to have free speech as well and it is your job to be able to talk about a varying spectrum of ideas coming from your constituents without being attacked and I would also like to know what the actors who are doing these attacks. Is not lost on me that these sorts of attacks never happened before the diversity both of Ginger color and ideas were on this Council to me. The backlash you're feeling speaks to the fact that you are representing us in our body that is closer to representing our city, and I thank you. Thank you. Thank all of you for your follow-up comments. We appreciate that and will move through our agenda. So we'll go to the payment of the bill section. So please read the title. Council 11946 if a reminder pay certain claims in ordering the payment thereof, please call the roll on the passage of the Bill O'Brien 9 and favor not oppose real person. Please read our first agenda item Gonzalez and Elizabeth hunter-keller as numbers domestic workers Standards Board for terms of February 28th, 2021 appointments of Teresa B Hillis and Lani K Todd. As member is domestic workers Standards Board for on December 20th 2022. Council member mosquito 6/8 through 1271 to take the domestic workers Standards Board first, please. Yes, please. Please proceed appointment. Thank you. Mr. President I apologize for the confusion. I do need a second on this given that we are making the formal move today versus the recommendation. So they have been off for have been moved and seconded believe appointment 268. This is the appointment is still a member for domestic workers to be a member of Sylvia is a mother a grandmother a domestic worker and immigrants and a community organizer at Casa Latina. She's been a domestic worker for more than 15 years. She's participated in many many meetings to help create. I'm not just the domestic workers Bill of Rights what she helped to help draft last year, but she was also a lead organizer and fighter in the $15 minimum wage campaign here in Seattle and the curing across Generations campaign for home care workers her work at Casa Latina and in partnership with the city of Seattle has been invaluable and she gets here with us today appointment number to which is 01270 appointment of Elizabeth hunter-keller as a member domestic workers standards. She is a domestic worker employer of a housekeeper and Nanny. So as a higher entity, she is very passionate about passionate about making sure that domestic workers are treated with dignity and respect. She's also a resident of district 6 appointment number three is number 01269 in your materials Teresa Hillis to be a member of the domestic workers Standards Board has been working with us for the creation of the domestic worker policy as well. She helped us dig into the policy details and offered a policy lens from the employer perspective. She is also a member of the nationally-recognized moms Rising entity and we are very grateful for the number of hours. She has helped dedicate to Donnelly crafting this policy, but her commitment to the domestic workers Standards Board, she is a resident of District 2 and finally number for on our agenda. Today is appointment 01271 appointment of Lani K Todd as a member of the domestic workers Standards Board she and I've had the For a number of years on Health Care on labor standards issues. She's currently serving as the legislative and public policy directorate seiu775. I had the opportunity to work with her in a previous position when she was at SEIU 925 finding out for childcare workers rights and improving access to affordable child care across the city. I mean across the so she brings experience on policy change advocacy and really Creative Solutions and as a mother herself, I'm really excited to see the experiences that she's going to be bringing forward to the board as a district 2 representative and moved in second. Are there any further comments from the dice? If not all those in favor of confirming the appointment, please vote. I vote no the motion carries and all the appointments are confirmed. I do believe we have Miss Gonzalez here with us. If you like. You can share a few words with us and if there's no objection we can suspend the rules. I'm not trying to put pressure on anybody, but I would be honored if you want to share a few Thoughts with us. CB in Vanilla Sky Sunway almost Inaba circus comprar me some weekend. I am very excited. I know it's a big commitment. solo para decir esta bajo indice de Lucha una Luz Al final Del tunel work to be nominated for the standard board and is not only work for me. But also representing all of the other domestic workers to be a light. I seen that since when at the end of it to have a light at the end of the tunnel e l gracias Mis companeros A lot of my friends could not be here today because they are working the most common element of the road is what I sees appointment. So thank you and we continue with the sole of Dolores Huerta. Yes, we can. Thank you very much flashes. Okay, let's read the next to agenda items 5 and 6 together as member City Light review panel for turntable 12th, 2021 and appointment of Chris mefford as member Seattle City Light review panel for term to April 11 2020 president on these two. I will also move to confirm appointments 1272 and 12734501272 Mikel Hansen. We'd like to have him as a member of the Seattle City Light review panel. Mike is the Chief Operating Officer for safe Corporation a long time to visit some family owned and operated business with a long history of community engagement managers more than 4 million square feet of commercials and data center properties and over the past 15 years. Mike has been active. City Light management and has participated in numerous strategic planning and design sessions. He's going to be a great addition to the review panel. I don't never 6 on our agenda is appointment 01272 appointment of Chris mefford as a member of Seattle City Light review panel. Chris is an independent partner in Economic Development two cities counties governments and businesses over the course of his nearly 25-year career in Seattle. He has worked with elected officials and leaders in the Region's most important businesses and he strives to provide an objective transparent and balance Viewpoint that serves the Region's economic social and environmental needs an interest. We are also very excited that he wants to bring his energy resources expertise to Seattle City Lights review panel. Very good any further comments or questions? How much is make a comment before we vote? And that is when I say this to the two appointees mikkel Hansen and Chris mefford that if the the the the thrust Behind These important positions should be that they get the information needed to make decisions and I say to them that if they do not get the information all the costing information the pricing information the allocations excetera to look at both the rates in a racetrack sure, then they should come to us as a council because historically one of the challenges both with SP you and I see like the rate pair the rate funded organizations. If you will leave the city is that they have this the the this information that they use to figure out the rates in the compute the rates sometimes a sensitive and sometimes guarded and perhaps intentionally or unintentionally, but what we try to do or is try to create this panel that has access to the same information that the Des. Who makes it the departments at such they could protect all the repairs were there large companies or people on fixed incomes are really struggle to pay their bills. And so I wanted the public to know that the C Light review panel. Again. This is not a commission to superficially look at information, but they should get all of the rich information that we are entitled to his policy leaders. And so I want to thank these two people per serving. Okay, neither, So then that okay all those in favor of confirming the appointments, please vote. I suppose both know the motion carries appointments are confirmed. Please read the report of the housing Health Energy and workers rights committee approving the proposed budget framework commission for its fiscal year 2018 through 2023 that we opted. We have an opportunity to advance resolution. Is really about an international treaty. I handed out at Central staff Memo from Eric McConaughey. Thank you again for providing that comprehensive analysis for our full committee partner or counsel Partners just very briefly. This is regarding the Skagit environmental endowment commission or the seec which was established. The Ross Lake Seven Mile Reservoir treaty signed in 1984 between British Columbia and the city of Seattle of Seattle and appointed by the premier of British Columbia. The seecs mission is the preservation and protection of natural and cultural resources and recreational opportunities of the upper Skagit Watershed through advocacy International cooperation and strategic partnership has and more importantly travel representation on this important for which we're going to get more information about I believe the SEC administers the Skagit environmental endowment sign compromise of international. Sorry of the compromise of initial contributions from Seattle and Beast of 4 million and 1 million respectively an annual supplemental payments from both parties based on power sales the SEC prepares a budget on a five. Recycle which requires approval by the BC government and the city of Seattle finally the SEC funds projects ranging from a recreational enhancement to educational an ecosystem science. That's what we're finding today in formation to compare the projected 5 your budget going forward with what was expended in The Last 5 Years will be critical to help answer the questions that the council currently has. Thanks so much for the approval of the budget in 2015 to 2018 via resolution 31568 and 2015 this resolution approving the 2019 budget and we recommend it for the full Council of Passage. If not, let's poke those in favor. I'm adopting the resolution, please vote I buy those opposed vote. No the motion carries. The resolution is stopped in sure will sign it. Please read the report of the Civic development public assets and Native communities committee. And Native communities the committee agenda item 8 Castle 1 19475 Elaine to the Seattle Department of Parks and Recreation and Seattle Public Utilities transfer a partial jurisdiction, maybe portion of the West Ewing mini park for the Seattle Department of Parks and Recreation to the Seattle Public Utilities committee recommends about past. So everybody pay attention as a joke everybody. I have never ate this legislation would transfer partial jurisdiction for the sub surface area of parking Recreation and Landscape portion of the West Ewing mini Park from Seattle Department of Parks and Recreation to Seattle Public Utilities. This allows the construction of a combined sewer underground microtunnel from Ballard Fremont Wallingford and queen and neighborhoods. The storage tunnel would be 2.7 miles long between Ballard and Wallingford to temporarily hold Pete combined sewage close at exceed system capacity in addition to transfer mean Requirements of Seattle meets the requirements of Seattle municipal code and federal water quality regulations. This is necessary because there is no reasonable and practical alternative location for the underground microtonal and Associate internal facilities. And if the city does not utilize the West Ewing mini part parcel for the alignment of this microtunnel, it would require significant engineering and redesign and increase Capital cost for a new alignment the committee passed unanimously and we recommend that the city council passed this bill today. Or not. Please call the roll on the passage of the pill. Herbal Johnson, where is O'Brien president? Please read the next agenda item of Parks and Recreation and accept Washington State Department of Natural Resources of a half the city Seattle a water wave permits for Waterway one in Laurelhurst. Can you recommend simple pass legislation authorizing state that State Department of Natural Resources DNR permit for water weigh one Waterway one is a piece of waterfront property use as public open space and is maintained by the Laurelhurst Community Club through a memorandum of agreement with Seattle Parks and Rec. This permit will have a five-year term comedian Civic development public assets and Native communities minion Animas recommendation that the city city council passed this bill Not please call the roll on the passage of the bill. 9mm favorite unopposed Washington State Department of Natural Resources on behalf of the city Seattle and water a permit for Waterway 3A in the Washington Park Arboretum to recommence it will pass in a state of the legislation authorizes parks to executed Waterway permit with the State Department of Natural Resources the term of this permit again, as the reformer permit is 5 years and the committee recommends this passage today. Any questions or comments not please call the roll on the passage of the bill. Juarez eye mascara Orion Swan sure will sign it. Please read agenda item number 11 to modify development standards for a city facility to allow the installation of seven athletic fields light poles at The Soundview Playfield to the committee recommends that the council land use action be granted is conditioned. Council member. Where is this Soundview light or The Soundview Park project has been working on it for a while and I'm actually pretty excited that this is going to finally happened. The proposed facility is a city facility is defined by Seattle Municipal Code. 2384. A Seattle City council has the authority to wave or modify development standards for a city facility under the code Parks has demonstrated that a proposed light pole height is necessary to light the Playfield sufficiently and that the height of the polls are reduced light spillage and glare Parks has demonstrated that the lights Village and glare to the Jason Residential Properties will be further mitigated by shielded light fixtures and existing mature trees. Am I should add that there are 10 other improvements that are going to go on in this park including the removal and laying down of new Turf a construction management plan approved by the sales department of transportation would address construction impacts related to construction traffic parking noise and Committee, I'm certain about public Assets in their communities pass unanimously and we ask that the city council today at. Clerk file 314-4003 as granted questions or comments comes from a job. So I'm just want to say thanks to cancel my rewards for getting this one across the Finish Line. We first put this in the budget in 2016 folks and we can hang out in 2019 simple little things like this. Sometimes take a lot longer than we want them to butt and exciting investment for folks who are anxious to get access to our Playfield all throughout the city is the turf in the new lights. There's so many other amenities including making it Ada accessible, which those are all things that we push rod for super happy about Excellent any other questions or comments before we we will file this file does the clerk file? So those in favor of granting the council land use action as conditioned please vote. I don't suppose both know the motion carries the council land use action as Granite as conditioned and the chair was signed the findings conclusions and decisions of the council. Please read agenda item number 12 item number 12 appointment 12:39 appointment of Colleen. Echohawk-hayashi as member Seattle Indian Services Commission Return To December 31st, 2020. The committee recommends the appointment to be confirmed customer West thank you. This Cruise me great pleasure for three reasons, but one of the first is coming alcoholic is a wonderful person in French Indian Country. However, I used to serve on the Seattle Indian Services Commission and I was legal counsel to them for many many years. So I'm familiar with them as a PDA and public Development Authority in which they can assume dead and issued it and do great things and they have So getting back to Colleen Colleen is a leader among the native communities and a tireless public servant for the city of Seattle. She serves as the executive director of Chief Seattle club and Human Service Agency that provides for the basic needs of its members many of whom are experiencing homelessness Seattle Indian Services. Commission is a public Development Authority whose main purpose is to Carry Out programs to improve the overall living conditions of American Indian and Alaska natives in King County such as housing income job help placement eviction prevention and other social services. I can think of no one more qualified and well suited to serve the commission on a few other additional notes of Colleen echo-hawk has worked tirelessly with my committee our committee on the waterfront issues. She's a member of the community police commission. She's also on the kuow board. I work with Colleen and her family on many Community issues and pin particular as of recently state and federal agencies and organizations along with her sister. Abigail alcoholic at the sale Indian Health Board on missing murdered indigenous women and girls calling like most of her family members have dedicated their personal and professional life for the better betterment of all Native people all of our relations, wherever they live Colleen echo-hawk, is it up and coming leader and all besides all of that? She's a very kind and good person and on a personal note a special. Thank you to her husband Matt Hayashi for the sacrifices Matt and his children have made to allow calling to serve on so many committees and do so many things and we know that we can't do it alone. We need a support system. So a shout out to Matt. I think he'll appreciate that cuz I know when you're a mother and your kids are young and you're trying to do all these things at once. You definitely need a partner that is there by your side. So with that I'm hoping that this city council again will appoint and confirm Colleen echo-hawk to the Seattle Indian Services Commission. I was going to say a few favorable things about Miss echohawk-hayashi, but you didn't leave me any to say I just agree with everything you said so I look forward to supporting her those in favor of confirming the appointment, please vote aye aye those opposed vote. No. The motion carries appointment is confirmed. Let's move to the adoption of other resolutions. Please read the item. Resolution 31874 providing an honorary designation of University Way Northeast from Northeast 50th Street to North East 52nd Street as Chris Curtis way, dutifully remember this last August when we had a chance to celebrate the retirement of Chris Curtis, who's the founder of the neighborhood Farmers Market Alliance in the early nineties Chris got together with some neighbors and friends and about fifteen different farmers and decided that they wanted to find a way to allow those Farmers to sell directly to the public. They sold their produce to 800 Shoppers on their first day in 1993. And now the neighborhood Farmers Market Alliance run 7 outdoor markets support 725 local Family Farms and attracts over half-a-million Shoppers a year those of us who are in those farmers markets know what a wonderful place it is to build community and the U District farmers market is one of us not be old. Best ongoing neighborhood farmers market in the United States the district for nomenclature here for Chris Curtis way will apply to a two blocks section of the Ave between 50th and 52nd. Even though that's only one block long. I'm it doesn't change the name of the street just installed one of those great honorary Brown signs and and gives the recognition. I think she rightly deserves for her 25 years worth of service on behalf of folks in small family farms and those of us who want to get access to their good work and good good from around the city as I mentioned this morning my friends of the neighborhood Farmers Market Alliance are really hoping that Chris doesn't spend her retirement watching the Seattle channel. So then tries to keep this on the low down. So when you run into Chris around town, please don't mention to her, but it's not going to take too long for us to unveil this at some Saturday morning at the use for Palmer's market and I'm grateful to you all for your support. Are there any further comments or questions? Look forward to Spring Chris as well, but a treasure. Okay, I'll move to adopt resolution 31874 resolution be adopted any further comments those in favor of adopting the resolution. Please don't die by those opposed vote. No the motion carries the resolution stopped and share with sign it. Is there any further business coming for the council? Hearing none We Stand adjourned and I won't have a great rest of the afternoon.", "end_time": 2460.1}]}