{"format": "raw", "annotations": [], "confidence": 0.9236398046556623, "data": [{"start_time": 0, "text": "Good afternoon, if I could call the meeting to order. Welcome to this meeting of the Seattle City council Human Services Equitable development and renters rights committee. Today is Saturday March 16th. The time is 1:21 p.m. I apologize for a slightly delayed start, but we wanted to give a little bit of time for community members to come in. For those of you who may not be aware that Seattle City council committees are shared by a council member but also have other council members as members. So if other council members from the stomach they show up then we will make sure to have them be part of this discussion, but so far it's only me and you all so thank you all for being here. Before we get to the agenda. I wanted to say a few things. This committee is being staff today by Edvard own policy analyst from my staff Sasha Somer Jonathan Rosenblum, Nick Jones and Adams in Kowski. What all Community organizers work in my office? I wanted to express solidarity from myself my staff and socialist alternative with Muslims everywhere in New Zealand in the United States in Seattle and District 3. We condemned the attacks on the mosque in New Zealand and we join everybody who is fighting islamophobia white supremacy and terrorism. Let's build International solidarity of working people of all religions ethnicities and cultural backgrounds for a society free of bigotry exploitation and oppression. I wanted to thank rev Jeffrey. Who is hosting our community meeting at his church today and for himself being a strong advocate for affordable housing in the central district for having been part of the struggle to tax big business and for being a fighter Against Racism and oppression. I also wanted to let everyone know that we have interpreters here. We have the Vietnamese interpretation happening on this corner, and I don't know if The Interpreter wanted to raise your hand or stand up. So everybody would know. Thank you, and we have mandarin interpreters on this site. I believe you. Please send up some people see you. Thank you for those who are providing interpreters. I believe you also arrange for childcare, but I don't a child care or appear. So if you if you want if you are here any childcare just talked to one of my staff members and they will tell you how to get to that place. We have two items on today's agenda. The first item is very much in connection with the location that we are having this meeting is not a coincidence that we're having this meeting in the Central District. The central district of Seattle has been a microcosm and macrocosm and an epicenter of the struggle that Ordinary People are facing throughout not just yet all but in the Puget Sound region and indeed all along the west coast all the way from Vancouver BC to Los Angeles, California, which is the struggle for affordable housing and the fight against homelessness and would be as seen in the Central District over the decade is absolutely dramatic. We saw many decades when black community members black working-class people had nowhere to go because of racist redlining and they were pushed for the south of the city. They were pushed to the central district and they build our communities here. Now, you have a different kind of redlining which is economic red. Meaning if you got a for the Sky High Ranch, then you don't get to live here because the only way housing or homes are provided to people currently is the for-profit market. So you get a home only if you are able to pay the exorbitant rents that are that are charged by the whole of the law of property management corporations Wall Street, real estate speculators and corporate developers. And so the discussion that B has slated for the first agenda item is the question of renters rights and evictions and displacement from the Central District. We will be specifically talking about the struggle that is being faced by the residents of the Chateau Apartments, which is located a few blocks from here on 19th. And for who are in danger of being displaced out of their homes and evicted from the central district and some of them facing the price. effect of homelessness our second agenda item is a public hearing on recent legislation placing moratorium on the development of mobile home parks within the city of Seattle. Moratorium has already been voted into law and today's public hearing is simply a legally required step in that legislation to Bill do that after the discussion about the shadow 10s. It is fitting though that we have a discussion of Halcyon as well because the example set by Halsey on working-class homeowners who successfully resisted their own displacement. It's a month ago shows that run ordinary people get organized. We can fight back against displacement and evictions and we can stay in our affordable homes and communities the neighborhood is different and the types of homes are there is different. How's your residents are mobile homeowners Shadow residents are renters, but in both cases, we are talking about Working Class People and low income families. And the prices of the resident of the Shadow are facing is precisely What the residents of the house Ian faced and are still facing which is that of a Seattle and if you did sound region that has seen rents rise to stratospheric levels and first become unaffordable for the majority. Rentals just take a couple of numbers rents have soared 155% in Greater Seattle since 1998. 155% imagine that in your head what that would mean And the Risen 59% since 2010. And I know a lot of real estate and economic pundits will tell you in the newspapers. And in the news shows on television that rents are not writing that much and now it should be good for renters. Well, let me quote Mike Rosenberg from the Seattle Times who says that it is wishful thinking to hold for wrench to drop more than a little since that virtually never happens. Doing the same. The city and region have also become a profit-making machine for corporate developers like Vulcan and like Cadence that's at issue here today and also for big businesses like Amazon. On average one person or family is evicted from their home here in District 3 every other day. Think about that. And that's number account only for the formal court-ordered eviction and doesn't include the many more people who are economically erected from their homes that is people who ended up moving not mad because I had an eviction on your record. But because the rent went up beyond your ability to pay and they just got pushed out either out of the neighborhood or out of the city entirely and in some cases, we know people have become homeless because of friends and in fact, Nationwide studies recently have indicated a very very strong correlation between Rising Ranch & riding homelessness. So let us not buying into this completely dehumanizing met that if somebody became homeless it because they didn't get their life together. It's because of social conditions that they're subjected to We will need to build the movement for rent control and a massive expansion of affordable social housing by taxing big businesses like Amazon, so that people are no longer priced out of their homes no longer subject to the never-ending greed of the for-profit market and so that they are affordable homes available to anybody who needs them. We will also need to get organized to read his displacement like the residence of how she on did and like the residents of Shadow are doing right now, and we need to unite in our struggles. And there may be residents from the house you on here today. I'm I'm not sure if you are then I thank you for being here in solidarity. We also have resident members of the Vietnamese senior Association here. If you can just wave who also has you are in solidarity with the Chateau residence and the Vietnamese singer Association members are also fighting for affordable housing and Healthcare themselves. The shadow building just to give a little bit of background and then we'll go to the public comment The Chateau building is your as I said in the Central District couple of blocks from here. That's 21 apartments homes that include 14 that are contracted with the federal Housing and Urban Development unit a department to be affordable as part of the Section 8 program that HUD administers That is a little different from the Section 8 Choice voucher that we usually hear about where a renter or family has a voucher, but then they have to find a landlord to accept them. In this case in the Chateau the Section 8 subsidy directly attached to the apartment. The other seven homes in the Chateau are also relatively affordable. They're not under Section 8 they are what I would call Mark and available affordable homes, and the residents in those seven home also need affordable homes in their neighborhood alongside the Section 8 recipients once this building is demolished. At the end of 2017 Cadence real estate, which is a real estate company with a hundred and eighty-five million dollar portfolio purchased the shadow building. According to their mission statement and this is this is on Cadence website. You can go and look it up they say In our view that is in Cadence's view ideal properties are dated an appearance and have several deferred maintenance items. This allows us to reposition and stabilize at Market rates. 9 plain English what it means is that we go looking for. Buildings that are not in great shape that have maintenance issues that have low rent and then we buy them up we demolish them and build luxury units in their place. And I'm not doing this as public service obviously. in in an article published in the Puget Sound Business Journal about Cadence real estate. There's a sentence that says Cadence aims for net investor returns in at least a 20% range for deal know what that means. It means that for every building that they demolish and put another one up they aim to make at least 25% profits. That is a huge profit margin even as profit margin School. This past winter Shadow residents receive notice from Cadence that they were canceling the Section 8 program and someone else in the neighborhood noticed a poster for the legally required meeting. I mean Kaden, why are legally to do an Outreach meeting for plans that they have to demolish and redevelop that building and they had this meeting scheduled during the snow storms recent snow storms. I mean, I'm not blaming the snow storms on Cadence, but but they didn't reschedule the meeting but that's but but that's not the main issue. The main issue is that the tenant did not even know that they're building is slated for demolition much less about the meeting itself a concerned Community member and activists email my office saying hey, I just saw a notification about this don't you think we should be joining with the tenant and absolutely be agreed and immediately. I just asked my staff members to that meeting even though it was a snowstorm and even though it was hard to come here. My job members are dedicated enough that they went to the meeting. But what they found was that there was no tenant nobody there except for the developer representatives and my staff there was nobody at that meeting nobody else and then we two days later I asked my staff members to go in Dornoch this building because we wanted to find out why there are no tenants and honestly at that point I thought they weren't there simply because of the weather conditions bad when we don't talk and talk to the tenant to be found out that they didn't even know what was happening. They found out to my office. It shouldn't be this way. But following that they have had but then it's have had notifications from the from the developer for a toner. And I don't know if you have printed those notifications and made them available. But if not, we can make them available because they're publicly accessible. No, it is it is my honor and Delight to say that the tenants are refusing to just accept this as just as always their faith know that they are fighting back. And they have come up with your own list of demand for Cadence. They will be reading them out loud. I don't have to go into it because they will be speaking themselves before that. We have public comments or Dad. Could you please read name and each speaker has a minute and a half and I know that is often not enough, but please make sure you stick your time so that we can get to the main agenda items of the committee so that we can actually stay together before people need to leave for their families and jobs. first first three speakers Mike Andrew followed by Tim Lundgren followed by Meghan Murphy if you hear your name and stand in the depuy so that we won't spend time. For you to come up. Kim and then Megan Murphy I might be under I'm the executive director of pasara Puget Sound advocates for retirement action. Thank you. First I want to thank councilmember sawant and her staff for having this hearing and for having this hearing in the community where it's easy for people to get too and not forcing folks to go downtown to City Hall to express their views. I also want to honor the Chateau residence because they are fighting for all of us. I'm here particularly because housing is a real crisis. For all working people, but it's a crisis particularly for retired working people for seniors. As you know, a lot of your audience can tell you Even if you were lucky enough to have a good union job and to have retired with a fully funded defined benefit pension. It's still difficult to live in a city where housing prices are as high as they are in Seattle. If you're trying to get by on Social Security alone. It's almost impossible. Ask anybody. What seniors need is? To be able to be secure in our homes to know that we're going to afford to pay the rent and the rest of our bills and to continue to live in the communities that we have been. Amongst our friends amongst people who are like us amongst people who speak our language. Without the risk of finding out, you know, 30 days or 60 days or even 90 days. But suddenly we're going to have to find a new home. Thank you. Good morning. You hear me? I am Kim Lundgren. I am from the Vietnamese senior Association. I am here today to support the Chateau apartment tenant who wouldn't be a victim of this blessing. Thank you city council members of one who always fight for the people who have no voice. We need you. We need your help to stop this eviction and this blessing from the Central District this eviction and displacement to thank you. Megan Murphy is next after Megan Murphy comes Devon Silvernail followed by Ruby Holland followed by a meet our space because of negligence from DHS. I was diagnosed with a really debilitating disease and I lost custody of my son. So in a way, I died inside of my self and what do you do with the pain when the people who are trusted with power don't do a good job with their power and because of their negligence of their job, they totally impact somebody's life and very hurtful way. So when I move to Seattle, I immediately grabbed onto all the activist in because my grandma and my aunt for activist and we have to organize because the people with money have a lot of power and I think more and more people have to get involved in housing Justice because vulnerable people being placed on the Street is morally wrong. And it needs to be easier for people to do this. If it's online communities that have more of a waiter that somehow I'm so glad we're here today because Section 8 vouchers have become kind of like a a thing where you become segregated and they were meant to integrate people into the community and there's no longer units where people can integrate into multi-class on neighborhoods. It's become the stingray year and I think we need to fight for more Section 8 money and more richly funded richly multi-tiered communities of different incomes than it needs to become a reality and not just a dream we think about when we're angry. We need to gather together in the hurt and change things. Hello, everybody. Hello person wants and they can seats that we have here today. My name is Devin Silvernail. I'm executive director be Seattle. I'm also a member of the Seattle renters commission and a District 3 renter The Chateau residents are my neighbors. I'm here not only in solidarity for them, but I'm here to speak to the people who aren't here today. Although that water looks amazing right now, but I'm here. I'm here to really just ask them to support not only the folks of the Chateau because you know, they are an example of what's happening in Seattle an example of what's happening in the Central District. But the entire city is a whole we need to do things to help tenants. One of the people on this committee has a tenant and we need to do things like increase our tenant relocation assistance. because it's criminal it honestly is how how how little people get $3,800 does not help anyone move. Let alone a low-income person and we have to we have to fight for things that can keep people housed like rent control. We have to come out and support our neighbors and we have to tell bad landlords that they can't ignore, you know, the things that they have to do. So I just want it urged the folks that aren't here that maybe might be watching on the Seattle Channel later to just listen to these Neighbors come out and support them and then push for greater protections to help these folks. Thanks. Good afternoon. My name is Ruby Holland and I'm very honored to be here. My family purchased a home in the central area in 1963. And I actually grew up in this church. However, homeowners myself included home owners of color senior homeowners are also facing displacement here in the Central Area because of the MAA. Mha which will be voted on Monday. I'm up zones threaten to displace us out of our homes. They want us to give up our homes. So that developers could build apartments in which we cannot be able to afford to live there. We need an anti displacement plan council members to White will not help us she's voted for yet. Another hubzone. That wasn't he an amendment. So we've been asking her. To help us. She's been turning a blind eye to the senior homeowners of color in the CD while she helped the homeowners and how she on we all have the same issues. We want to age in place and we need help. Thank you. After a meet our comes Saba followed by Nathan. Do you leave followed by Imaging Williams entire? I work with the tenants Union of Washington as an education counselor. I were here in support of the Chateau tenants all the folks Play Sitting facing displacement from from the Central District. I'm really should support the work that your office has been doing this to really stand up for the tenants in your District. I really appreciate also the amazing copies of the things like their mission statement from the website for Cadence. I think it's really telling when they say things like we do a great job of you know, repositioning multi-family assets which really means kicking people out of their homes for profit. So it's important to have those discussions and a name that that is Even if it's legal, it's completely immoral. Also. I really this letter is incredible that the tenants sent to delivered to the Cadence real estate. I also appreciate that. They urged and invited Chris Garvin bear Johnson, John Garvin to come to this meeting and explain themselves. And as far as I know they are not here. So thank you for all of your work. Thank you to the tenants for you. No fighting this even facing facing displacement from your homes and we stand with you. Hello. My name is Saba. Tekle yargus. My mom is the owner of saba Ethiopian cuisine on 12th and yesler and we are facing gentrification. But that's not why I'm here. I'm just here to show support for what's going on in the community as we've been facing our own issues and thank God for cuz I'm in their team for helping us. We've been hearing about more issues of even old customers. I had to move out the neighborhood and so on and so forth. It is really disappointing and it's sad but you know, we're not powerless because we can speak up and keep showing up keep speaking up and keep sharing cuz that's where I paralyzed if we have nothing we have our voice so keep continuing and we believe that things can change. Hi, my name is Nathan Daly. I'm here on behalf of my friend Terry Justice who lives at the Chateau. Obviously, I'm very concerned about the reality that all those folks are looking at given what's about to happen? It's not a good look for a business to throw people out on the street and these folks need to be embarrassed and what we're doing here picking up and speaking out and embarrassing them is a good thing. We know we have a crisis of housing in King County in in Seattle in particular not to supply issue in part. So developers can be part of the solution but this is not being part of the solution. So what they have an opportunity to do is change the way they are showing up instead of embarrassing themselves and come and sit down with a resident The Chateau and have a conversation about how they can help doesn't mean that development can't go forward if maybe they can come to some kind of arrangement. But what they should be doing is good corporate citizens is engaging with the people, who are How to be affected by what they're doing and showing that they Care thank you very much. Imogene Williams is next after Imaging. Is Queen Bee followed by? Robert skins album by Miss Richard I don't live at the Chateau, but I do live. And Capitol Hill and I do care about my town. 85 people live at halcyon when I realized how much trouble they were in they wrote to a lot of people in the city. And council member. So I want is the one that responded took the leadership. And save them. Temporarily at least at least let you know. They're they're rescued. Maybe not permanently, but it's better than it was. Now there was some interesting articles in real change. Portland Portland created a Zone like there's these housing zones and you can build a grocery store in this kind of Zone and you can build a home in this other kind is Jon Jones Portland created a special Zone and put the mobile home parts in a special Zone. And they were saved and there's lots of them. We don't have lots of them. We have all sinned and one other little tiny one probably got 10 or 15 residence. Portland did that why do they have that kind of leadership and we don't are you satisfied with that? No. That's hundreds of affordable units. Do we have somebody in our town that doesn't care if we have any affordable units or not. We're close to that. When people are threatened with eviction when they're homeless. We lose their talent. You know, they aren't teaching they aren't taking care of a child or a senior. They're just freaking out on how much does it cost to get a tent. How do I get a tent? How do I eat? How do I keep warm? You call that a brain drain. It's not good for our town. the most important thing in our town is us the people are the resource Boeing is here Microsoft. They're here because of the resource, which is a people. or after talk about bullying two sentences How can I maximize their profits? Build a plane in South Carolina. No labor unions has the Dreamliner. bar stools but the plain looking fly. Send it to Everett the finest Arrow machinist in the world and that they think heard it and it flew. But that's boring for you. Thank you for your time. Good afternoon, everyone. First of all giving honor to God in this beautiful place in space. Thank you Jesus for allowing me to be here to speak today. I was at home kind of hesitant and I want to say to council members who want. Thank you for being our voice on the Seattle City council. Thank you for standing up for people and I'm not here to speak for my organization today. Cuz some people know me as a member of Will and the leader of women in black. I'm here to speak for me and my heart queen beat king Rios. I feel Seattle is a beautiful place that has beautiful people in all colors all shades of forms of fashion. We have to learn to care and love about one. Another than what we do. There's so many homeless people living outside Dying by violence and people don't even know about them. Everybody is human lives matter everybody counts and I just want to say thank you for being a voice for the people people real voices, but people just being here speaking up and speaking out. I just thank God for giving me a voice today because it really hurts me that this is the richest city in the world from fires anywhere. I've seen it just learning different things. How can we not care about our brothers and sisters? We got to olbia voice. I've made a choice to be a voice when it comes to homelessness and housing and everybody else that lives here to be a voice to Thank you so much guys, I'm ever so on and I love you for my heart. I just thank you for all that you're trying to do for people who are less fortunate people that need somebody to be a voice to fight a city. Like this is Rich developers coming in taking over put some people outside. I live in downtown Seattle right on the waterfront and it hurts me everytime. I see a homeless person sleeping outside standing vigil across from City Hall but innocent people I just thank God and I thank you all and I thank you so much and God bless you all and thank you for hearing me today. And is being sign said all Bill City on housing. Next up. I'm not sure if I'm reading it correctly, but I believe the names Robert skins. Maybe I'll maybe it's Richard. Afterwards is I miss Richard followed by The Honorable Michael Fowler and you want to help the residents of the place, but you stopping a developer is not helping the people of Seattle. The people of Seattle is what we need is more cat right housing you stopping every single development in the city of Seattle is driving up costs it cost $300,000 to make a low income housing unit. That's never going to be affordable. We need to stop and reduce all the all the housing code in the residential housing code. We've been talked about five to six years that this is going to be done. This has never been done. We never change this house and killed we never gets be be able to build more housing and every time that somebody tries to build something somebody like you tries to stop it. I'm all for helping the people there and I'm all for helping them, but I want to help them find new places so that we can build 73 housing units at seventy-three people here. Can you get affordable housing so they can work at Amazon. So they can earn a living wage. They can earn a good living cuz that's not that's not that's people here making that money. That's not just people are wealthy Amazon is investing in the u-dub. They're building a branch there to train People Like Us the train us so that we can get jobs at Amazon so that we can work at Microsoft so that we can make hundreds of thousands of dollars that we can advance our self. How do you expect you're going to go up going to work minimum-wage? The rest of your life is going to go to college who's who's putting the money to the college? It's unaffordable because every time of developer wants to build something she stops it. If you let developers come if you let developers come to cost $300,000. Pause pause me for one second that cost $300,000 to build a low income housing unit. Everybody knows that's wrong. That's not because of materials. That's because that's because we need You have to let developers build. Do if developers never Builders never going to be the only way low income housing can be built is with multi right housing. That's the only way. Starbucks so we can continue so we can continue on with the other speakers will give you baby. Did you finish your point? Are you okay? Alright. After Miss Richard Comes The Honorable Michael Fuller followed by Shirley Henderson. I'm good day everyone. It's I'm black today, and I'm going to stay black. And if you don't understand it, then maybe you shouldn't even be on the planet because everything seems to systematically oppressed us repressed us depressed and supresor and I don't care who's up in that City Hall. It seems to come up again over and over and over again and it's time out you want to know something about this neighborhood? Yes. I was raised in this neighborhood, but I don't live in this neighborhood anymore. And I don't like what this corruption has done to black people continuously doesn't and you asked for our support. You're not getting mine. Okay until I see a magnificent change. Okay, that's ordered by the man upstairs. Okay, you know, I don't believe in God what I do and I think it's time out for this hate. You see what I'm saying? When you don't get in line with what's supposed to happen? That means you're I hate you could be charged with a hate crime to cuz you can fix a whole lot of things that I've seen that you haven't done and you repeating this stuff over and over again, and I'm fed up with it tired of it or Fannie Lou Hamer. She been dead how long she said I'm sick and tired of being sick and tired and it's tiredness is still lingering in this city in this racist town. Yes, I'm not honorable. Michael Fuller to White cures private attorney general Jeep you was deed yours. This homelessness. It's sickening and you're stepping on my toes. So why don't you understand. I'm trying to decrease homelessness, so you want but you turn around increase homelessness when your tell me when you're running for city council, and then I got in town need to take an organized crime Control Act, October 15th, 1970 President Richard Nixon controller on August 24th, 1954 that was signed by President Dwight Eisenhower. Ana rtw point 24.2 100.000 4.0 8000414381210000000 don't let me see answer. What is starting their abuser 9.30 6080 and 42.52 out of 200 million activities incompatible with public duties and 49.63 freedom from discrimination and the Jones versus margin company June 19th 68 what we have here today. So why is a failure to communicate 1952d conspiracy? Call Urgent Care in 10 years in prison that $250,000 fine three years supervised release the color of law to want one year in prison 253 your supervisor. At least now, we spending $338 billion dollars on one of the rides undocumented alien veteran sleeping on the street, but I'm on Jenny durkan light brown on right to Black lives matter, but this is not attend. next upcoming Shirley Henderson followed by Horacio Perez Morales followed by to get when Yes, I'm Shirley Henderson and I'm a small business owner in the central district and I'm here to stand in solidarity with Chateau residence. I think there's a lot of confusion amongst those of us in the city about who's responsible for the displacement and discrimination in this District particularly, which is one of the fastest gentrifying in the city and I'm not just here as a small business owner. But as an active Community member as a socialist and I think there's a lot of folks that can afford to pay in the city that are not paying their fair share Amazon is one of them Cadence is another that wants to take from those of us who don't have to increase their profits and it's disgusting to see this issue with cadence where there willingly displace Individuals who have spent their entire lives and a building. I was a building manager for many years and I saw the strain that so many folks went through being on a fixed income living in a place for their entire lives and wanting to die in that place and forcibly being evicted to Direction. And so I think the demands that we have on this letter or the least Caden's can do they can absolutely afford it and I think that we also as small business owner in the Central District. We have a lot of people of color owned businesses. We have a lot of queer businesses and I think we need rent control. We need Mass expansion of affordable housing Municipal he builds that we can fund by taxing those who can afford it business and we also need commercial rent control, which is absolutely doable and I thank councilmember sawant who is stood effort tirelessly and fearlessly for those of us who don't have a voice. Thank you so much. after Horatio comes win followed by y Ken Garrett followed by Jacqueline Wu Hi, I just want to say a few words are kind of really like going what the what the person before me just said, I'm actually not from here. I'm from Tacoma. I'm coming here from as a part of Tacoma Tacoma tenants organization committee better know if anybody here is familiar with the tiki tenants, but that was a huge issue and we want a lot of really good reason. And I campaign what I'm here for. What I'm here to discuss it, there was a whole 7 months in which these people are in limbo and didn't know what to do. I'm also here as a part of Tacoma Democratic socialists of America and on top of that. I'm here. I'm here as a member of the Puget Sound. I think we really need to stop looking at our region as like our bio region as the small little kingdoms is little fiefdoms. I'm tired of seeing people who can't afford to live in Seattle come down to Tacoma and then the people who can't afford to live in, because those people were displaced have to go move the Lakewood Spanaway and all and all these other places around. What I want is just more communication. I I know that you have access to it to two circles that we don't really have access to and that's all that's all we're really asking for. I'm asking my council members to speak with other townships and I really hope that there can be some type of open communication because it if not, we're at this point where it where we're running out of people who to blame. I want to blame Amazon my want to blame everybody but it's the thing is we need good leadership and we want and we want to follow up. We want to follow good plans with the people are ready. Thank you. Very sure before you go. Just wanted to say for sure, but I don't know how many people here know. Thank you for coming from Tacoma. We absolutely need solidarity among people who are struggling all across this region to your voice is very important and appreciated and I'll tell everybody you don't don't do it right now, but let's focus on the meeting, but when you go home Google Tikki Tikki tenants struggle, and you will see that they did indeed achieve and incredible success and that was because they got organized just like the shadow 10s are getting organized and please be in touch with know how to talk to Adam of Jonathan in my office, please before you leave and I hope you can stay for the whole meeting. I agree. We need more communication. Communication is not between corporate politicians in Tacoma and corporate politician in Seattle. The communication has to be among the working people across 34th, and we can build movements. Thank you. So next up is is tired when tea yet I might be saying that wrong. So next is why can Garrett followed by Jacqueline who followed by David Parsons? a good afternoon here third-generation community building in the central district of represent africatown and Hitter stands, you know solidarity against predatory development in our community. Our next Saturday is going to be a grand a ribbon-cutting for the Liberty Bank building which is 115 units of affordable housing. You think that's a very, you know positive thing as a step in the right direction. However, when the phone lines opened up for leasing up the Liberty Bank building on November 1st thousands of calls came in and shut down the line demonstrating two things that demand for housing in particular the demand for people black people who grow up in this community lived in this community that have been displaced for this community desires to come back to the community and be where they have Roots at soda needs to be 10 more of these buildings in this community and throughout the city and it has to be a balancing of the market rate. The market rate development is not making it cheaper for affordable development. They keep I mean look at the communities where there's a lot of expensive housing. Is there more affordable housing in those communities as well. I haven't seen that so we need to really look at the fact. Deal with it. There's a very large amount of resources in this region. It's a shame that a region as this rich and resources that models itself to be a city of the future can allow this level of an equity and equality displacement happened in the city. And this has to be disrupted because of this is a model of the future to export to other places. This is not a model that works for the majority of people right? Everyone is not going to be a developer at Amazon. Right? So so you have teachers you have childcare workers you have you know security officers you have people that are loading boxes. They deserve to have a place to live is where I shouldn't have to communicate 3 hours a day be stressed out and I'll be able to pick up their children spend time with their children. You know, what others just enjoy, you know heaven on Earth, right? And so this is something that has to continuously be elevated as a crisis a human rights issue in this city, which is to be Progressive and liberal. But we don't see a lot of people benefiting from all these opportunities, right? And so that needs to be put on the top of the agenda. Are we support the residence cybercafe? We want to see Equitable development Solutions so that the community is not being displaced and pushed out. So that's what we want to say today. Thank you. I'm sorry before you speak if you haven't signed up already to speak and you really want your voice hard, please either sign up there or just come up here when the last speaker is done. Kenyatta, how many year? I thought I could get now. And the Vietnamese when I didn't die. Hello, my name is dick man, and I'm very venomous and I've been here for many years and I'm here today to support I miss Kwan. Yeah, let's go to Aladdin. How much is 2000 Port every thought every efforts by miss one and I do wish that everybody have a good and happy day? Good afternoon, everybody. Next up is Jacqueline Wu. Good afternoon, council member and the residents and family members of the Central District. My name is Jacqueline. I'm a member of the Chinatown International District Coalition. And I just want to say we stand in solidarity with the members of The Residence at the Chateau and also of members who are potential of being displaced as well. We strongly believe that we need more affordable housing there needs to be a down Zone and all the areas that are vulnerable to displacement and we strongly believe and hope that you put a moratorium because so many of our neighbors so many of our community rubbers so many for small businesses are threatened with displacement and cannot afford to live in the city and the city is built on immigrants is built on the backbones of working-class people who have been here not just for years, but for decades as well, and so we strongly We need more affordable housing. We need a down sound. We need a moratorium. So, please free strongly and for you to look into these options as policies. Thank you. After David Parsons comes I got another sheet at here, John. Are giraffes found by Dan Kavanagh? Thank you. My name is David Parsons. Thank you for accepting my sign and then give me a chance to speak. I am the President of UAW Local 4121. Where are Union at the University of Washington that represents? Thank you. Represent over 5,000 now 6,000 workers that are student employees and postdoctoral researchers Advanced students who are in training to get jobs. I'm going to come back to that in a second. First of all, I want to just shout out and thank you to the tenants who are living at Chateau and would please ask that we all give them a round of applause for their Courageous organizing in in this struggle. It's not easy and on behalf of my union. I want to let you know that we've got your backs this housing affordability crisis that we are facing as a city is structural. It is substantial in a recent survey of our membership. We found that a full 82% of our members are reporting being rent burdened 82% of our members are paying more than 30% of their wages in rent only and a substantial portion of them are paying more than 50% of their wages in rent. This is an unacceptable current salutes its situation. This is an unacceptable outcome. I want to thank council members to want for her leadership. And again, I do want to thank the tenants for organizing and putting up such a great fight on to struggle and then we're going to win. Hello, my name is John rogaris. I'm a neighbor here in the Central District. Thank you again for putting together this meeting for My neighbors to talk about an issue. That's very important. My concern is I feel that this has become a bit of a animosity. We're talkin about a struggle one group versus another Amazon needs to pay or the Chateau is doing something horribly awful. Where is as an owner of a home here? I feel that I'm as much part of the problem. Then I bought a home obviously. Someone else doesn't have that home now. And I'd like to go back to work two different people said that we're talking about two different sized. It has been shown that building low-income housing cost about $300,000 per unit and white king brought up a great point that we are a city of immense resources and so as much as I would say that yes a group like Amazon should definitely invest in making this the greatest City that it can be at helping those who cannot afford to live here. I'd also say that Microsoft is on the east side whose connector buses. I almost always get hit by they should pay and then also people like myself. I'm happy to pay a bit more in taxes if it takes the burden off my neighbors if there's ways to organize us as the citizens of Seattle to actually help our fellow neighbors and residents and that's what something I'd really love to see from city council is what options could be done to active. Viking put it the resources. We already have here in this city. Thank you. Our last two speakers are Dan Kavanagh and Emerson in District 2 and a member socialist alternative and I'm here in solidarity with with the Chateau tenants. And you know, I'm just really struck by a reasonable. These demands are I mean asking for Cadence to pay moving expenses ensuring that each household, you know, I was afforded the opportunity to move to, probably sized incomparably priced Apartments Austin TX to fix repairs and you nice or not unreasonable by any stretch of the imagination. And I mean, there's no question at Cadence can afford to pay for these things. But the question is right, like will they so that's why I think it's so important at work here building this movement and I think you know, we need to keep building movements like this for things like like rent control and for it for taxing the rich taught to build affordable housing. I really do think you know, we shouldn't put the burden on on working-class homeowners. We should put the burden on the people who have a huge amount of resources who aren't paying their fair share like like Amazon and big business to feel truly affordable units. I think we need a mass expansion of social housing in the city and I think it's really really Brave that Chateau tenants are are standing up to fight fight for themselves in and you know, your fight is my fight. So I'm here with you and let's keep the building this movement. I know that you called someone else's name. My name is Kimmy Monet. And I was one of the first people here today that signed to say something. So that's why I'm stepping up now. Affordable housing for the disabled and the disenfranchised here is extremely important. I think possibly a way that we can start getting the housing that we needed a resources that we need are from the developers that are coming here and building these apartments in and Sky Rises and all these different malls and things if they would come in and either financially contribute to a fund that would help the homeless or help the low income or make sure that their development includes. The disenfranchised that's my opinion, and I stand with all of you that are suffering from the way our city. I was born and raised here in the way. I city is being destroyed by greed is ridiculous and United We Stand and divided we going to fall. Thank you. Thank you for speaking and I apologize for what? I don't know what happened with the name. So if you could We going to be gone we can locate where you sign so far public records. I need your name. So if you I don't see unfortunately. We didn't see it. I don't. It's possible, but just to be sure that you make sure we have your name. Yeah. Hi there. My name is Emerson. I've lived in Seattle almost my whole life. I've lived in Washington my whole life. I'm a member of socialist alternative and I wanted to first I think we should give all the Chateau residence a round of applause for the incredible bravery. But they have shown standing up to their landlord and the developer that's trying to displace them. That's not an easy thing to do and it puts them in a difficult position. When you are a group of ordinary elderly disabled working people standing up to a multimillion-dollar corporation who thought that they could get away with sweeping these people out of their homes and who knows where else and I think that just goes to show the incredible movements that we are capable of building here and Seattle. I think as many have said before me there is still much that needs to be done. I think we do. We do have an enormous amount of wealth in the city and that welcomes from developers and that Wells comes from businesses like Amazon and we fought fearlessly last year to tax those big businesses to build the desperate. Need for affordable housing and they were killed it, and I think that we need to fight again to put that tax back in place so that we can regain that money that we need an order to build affordable housing necessary as liking said about the affordable unit that's being built here in the Central District thousands of people called and it's already filled up. We need a massive expansion of social housing. We need rent control on and we need to allow for the people and the city or on the streets to be housed. Thank you so much. So next up to you that signed actually if somebody signed you out, but just check you off on the list and then if not it. Okay. I'm coming in a little bit late. So I'm pretty sure I'm sorry. I'm coming in a little bit late. I'm pretty sure some of what I'm saying already been addressed. I heard was a lot of good intentions and big hearts, but what I know is not only do we have those who are suffering and we also have those who are on the brink of suffering. Do you have homeowners who would love to be able to pay a little more in taxes? But can't I would like to choose how that money is being spent, you know, we'd like to give it back to the community in such a way. You know, they even made me think about I enjoyed being able to pay a little more taxes to have more trees because I live close to a park but I know as a homeowner and being a single parent barely being a homeowner that yeah, I get to I get to enjoy that Park but let those taxes go to a little bit further and I'm barely holding on to that home. with my two kids You know too little young African-American boys, which begins to make us a statistic right? We're just above the statistic and what would really help if you can't really understand the parameters and boundaries that are going into our policies that maybe there's policies that need to be changed to help you know, or how do we become a little more Innovative if we understand what the boundaries are with a policies are what are the challenges in being able to add funds or get the funds and how those funds are distributed. So you just have to do a whole lot of reading that is some of that reading this done and some of the programs that have been suggested and thrown out and reasons why those things have been thrown out are presented in such a way that simplified and the people who have this these innovative ideas. The people who are being impacted they are informed and presented with that information you get Innovative thinking people are able to think outside the box and bring those country. So then you're coming here and not with complaints with Solutions, right? And I would love to be one of those people who come here call. Sorry. Good afternoon. Thank you for being here. I just wanted to say that as a Seattle resident. I was born here 1960 and grew up just on the north side of the red line that existed. still I am here. in solidarity with the Chateau residence and every single effort that we made along the way and a commitment to fight for that. So, thank you. Can you come can you come sign up on the speaking list, please? Thank you very much. all this opportunity 2 on half of my clan I'm capable I do. I'm not Santo reasoning. I am a provider of Mister pump a disabled person besides your door used wheelchair all the time. I'm here today to support him and I would like to ask new building on the mister. Caden it's the Kaden who is the lucky person who? I'll be at the corner of that building. Tree Top Court Mister pump it to be a first priority person because he's disabled. He cannot find any place to go because he I live in this building since 1980 is a 39 years old or 13 39 year leaving there. So he might concern after he received the letter from the new owner who is keep talking to me about how to find a place to sleep. So I helping him but Is hard to find play to? all for him So the way I see this is out of my personality concern. I would like to share in my concern in this in this room today. the way I see that right now the other meeting in the in the Chateau building office other day. I heard some someone talked about 400 people have section 8 voucher cannot find any place to leave. No, no. I mean Okay. So I'm finished soon you mean okay? Okay, I heard about that then I have a 400. Honda people have 6 8 8 voucher and cannot find play to leave. This is an issue that I see between Cincinnati and individual owner of business people need to solve this issue Seattle is a beautiful city population popular city. We have Bo Ingram Micro shop. We have a lot of people are widgets and city of Seattle from foreign country. But when I take a look at Street in the city a lot of homeless people and I think we need to if these things to keep going on a lot number of homeless to the street is not good. So we would like to between business people and CD need to have some kind of Idea program to help the homeless people and poor people. Thank you for everybody who testified in public comment? We want to start with the first group, which is the strength of the Chateau. We're going to come and join us here. We have them ready. Under the shadow tenants were going to join us here as well or people being shy. Okay. Okay, just for the record. Can you both just state your name briefly and then you can Good afternoon, everybody. My name is Darcel Johnson in 2003. I was married and living up in Blaine, Washington. Write Last Exit going to the Canada. When my husband and I was walking on The Pedestrian crosswalk the car struck on us. My husband was killed and I was in comatose a for few hours and 4 days in the hospital for days in the ICU and two weeks at the hospital. I had TBI traumatic brain injury. After the accident, I could not see any employment. I have daily headaches. Sometimes I just need to stay home. After the accident on 2008 my parents movie moved me down here in Seattle and live with them in tattoo apartment and they help me out. Until I could get back to my feet. In 2015. I married to my best friend Warren and he's here. Will you please turn off? We live in apartment 309 in tattoo apartment. And we love our neighbors. It's very quiet close by to the store close by to the my medical care and close by to my parents. We all love our parents. My dad was recently diagnosed with stage 4 lung cancer. to make a long story short was undergo for chemotherapy all the time my mom. She just had knee surgery. They depend on me. if card else is going to Domo bus out. I don't know where I'm going to leave. Going to help my parents. The manager presenting Cadence only told us that they're going to stop the Section 8 HUD by end of December 31st, 2019 the even going to demolish the building. The other tenants and I want to pay for the relocate all the planets in tattoo Apartments. They kind of just move us out or just give us a voucher some of the tenants of live there in decades. here for 30 years or more new tenants are seniors and summer disabled. One of the tenants is 93 years old. That's why we want kids to relocate us when they demolish the building. It didn't always used to be this way. In fact for many years my uncle. On the tattoo Apartments. He treated the Penance fairly. But he has to sell the building a little more than a year ago. And that's when the cat is bought it when my uncle was in fact living at the Chateau. When the Cutters took took over and they raise the rent on on him so much. That she had to move out. We are we are going to ice a tattoo to stand up for our rights. Against Cadence and we were glad to see so many people friends. tenants and Neighbors support our cause this is our city. Neighborhood and we will fight for the right. Live here. Thank you so much. Good afternoon. I'm Renee Holmes, and it's nice to see all of you here. I want everyone to give yourselves a hand for coming in today. Cuz we're all in this together. I struggle at the Chateau Apartments for affordable housing in our neighborhood is just one example of the housing crisis that's impacting so many of us in Seattle. I take care of my mother Gordon. She's live at The Chateau for 30 years. She's 88 years old and this is her community. Her church is down the street on 60th. And for her doctor. Mary curiel is right up the street at the Country Doctor. She's upset and she's hurt to think that she's going to be kicked out of her apartment because Cadence wants to tear it down and build 72 small units. Our family came from Arkansas and settled in this neighborhood in the forties because this is the only area we were allowed to live in mother. Gordon has seen her friends pass away and her children sell their property for pennies on the dollar. She seen the neighborhood change so much whatever I take her out. She says I don't recognize this neighborhood anymore. And I said don't worry cuz it's still changing. I never thought the change would come to our door staff. A few weeks ago shamas team came and knocked on all of our doors and let us know that Cadence real estate was planning to tear down our building of one two, and three bedroom family units and rebuild 72 studio and one-bedroom efficiency units. It seems that Cadence had held a planning meeting right after the big snow, but they've neglected let any other residents know. As you know, we are a diverse group our new neighbors Kelly and Stewart. They just moved in they were living in their car and various shelters before they finally got into the Chateau. They have to toddler age children, and they just had a baby boy a couple of days ago. Maybe you shouldn't live in shelters today. Our eldest resident is mr. Yang. He's 93 years old. He's retired painter. He lives with his wife Linda. She's in her eighties. They lived at the Chateau for decades. He said the developers will make a lot of money, which is their right but they must also consider the rights of the tenants who live there. That's only fair. Mr. Hong another longtime resident. He works two jobs. He's a mailman and he drives for Uber. He said his American dream is dead. He said the rich just keeps getting richer and he just keeps on working. We just want to stay in our neighborhood. It's sad that so many of us have already been pushed out. The developers seem to just cure about Prophets. What about us the people? We're still very thankful for Shaman or team Sasha and Jonathan because they came and they really care what their help they helped us organize and we did meet with K on Thursday the 14th. We all went to the meeting it together. We we presented our demands together. Incadence knew that we were serious and I also want to read you a list of Demands that we presented to Cadence. We said we The Chateau apartment tenants demand that Cadence relocate all of us to new apartments in the Central District. If we choose to continue living in our neighborhood with affordability and accessibility specifically Cadence will pay for all moving expenses up front for each household Cadence agrees to ensure that each household is afforded the opportunity to move into comparably size and comparably priced Apartments where we move our choice alone choice about where we decide to live and we want to continue living in our Central District neighborhood than kaydence will accommodate us by finding available affordable units in the neighborhood. Cadence will meet all of its legal obligations to pay each household under the tenant relocation assistance ordinance and also will pay each household like dollar amount because they have offered to pay us $5,000 if we move when Cadence builds a new apartment building on the Chateau side if they build it, we want them to designate 15% of the apartments to be affordable units in addition to Thank you. In addition to any units that are affordable through other City programs as affordable housing dwellings Cadence needs to sign a legally binding agreement in accordance with all the terms specified above providing the same terms to all households and additions cater to agree to make immediate repairs to the apartment building fixing but not in limited to the broken outside lift repairing all of the crumbling stairs fixing the gate. So it closes and there's a list that's coming. So anyway Cato said their hate it's also said that they're not planning to tear the building down right away. They said a few years. So I asked for that in writing because you know, they can say one thing and do another. John Fenton of cadence said he'll see what he can do. We just want Cadence to do the right thing because enough is enough. Thank you. We are I wanted to ask a few questions to the the dentist Roselle and Renee. But and also to Eduardo what what the what the options the tenants have been for that. We have to community supporters here who we've invited to the panel to speak about what they are and why why does your in solidarity with the So please each of you introduce yourselves for the record and then speak. My name is Robert Jeffrey on senior pastor. New Hope Church in before I start my remarks. I just want to say that I think that the the proposal to Cadence should be a model for all developers moving into any occupied area and that that proposal should be adopted by the city council as as a model. What should happen? Also, I do not hear the pledge my support and you know, we're going to stick this out. The progress of civilization can never be at the expense of the poor. economically challenged at the expense of the sick at the expense of the infirmed we have to find a better way. Personally, I'm not against growth. However, I believe in managed drove not the survival of the fittest. Which is the law? Which gives fourth chaos? mini stroke take seriously. The long-term Investments made by those who have historically occupied Community built small businesses institutions in the potential to benefit and the potential to benefit from increasing equity. The Buy Low sell High mindset of Wall Street should never be by blindly applied to the Legacy and the situational condition of human beings. to do this the biggest ball tomorrow at its core and not in the cultural intellectual and diversified future of this municipality. Men's Grove also take seriously. The fact of unintended consequences in this instance is the explode explosion of homeless of the homeless population in Seattle men's Girl sets up human and Community agreed-upon practices in event of Citizen reload in the event of a Civic citizen relocation manage growth believes in the equality of all people. Whether they're developers, whether they're poor whether they're sick. No matter what their condition is it whether they are informed we need intelligent civilized managed growth. That's why we pay our taxes. That's why we pay our property taxes is why we paid that's why we pay sales tax. That's why we elect officials. Do intelligence civilized. policies that just don't look out for people with money But look out also for people or infirm poor and of different colors than they might be. This what we are experiencing here is being experienced all of America in Watts Harlem in every native Community throughout this nation. People are being displaced not just black people, but all mine are mostly minority in poor and infirm people. There has to be some logic. Some reason put to this why not start here. Why not start now in Seattle, Washington I want to thank councilman to want for all of her tireless efforts. I know that there's been some disparaging remarks against you about people color, but I don't I want to say this as a person of color. I applaud your integrity. I applaud your hard work. I applaud the service that you give to the community regardless of color regardless of money regardless of anything. I think you're a woman of high intellect and high integrity. I wish we had more people downtown like you. Just because you're black doesn't mean you're right and we see that in the policies coming from City Council. Thank you. So thank you for that. That was thank you for that Pastor. Thank you. My name is violet lot of time from the tenants Union of Washington and I'm the director there. We see this every day and this is not the norm for Seattle received buildings by buildings are being displaced gentrification at its worst. So listening to this is heartbreaking and so I'm here to to support the tenants when it comes to the tenant the tenants Union always want to be that I'm a support because this is what we do in our everyday in our office is on Rainier Avenue. Thank you. Don't remember so want because here's the thing. We know that some of these problems can be alleviated from rental increases by paying your fair share of taxes. I'm going to just say it. I probably pay more taxes than Jeff basil probably. So I want us to be definitely probably the problem stemmed a long time ago where in the deep hole of rental increases Seattle is a hot market for developers all over the world to come in and buy this land and so here's the thing. There's nothing wrong with growth absolutely agree with that. But the thing is it shouldn't be on the back of the tenants at all. And so what are the the number one race and I'm going to say this because a lot of people won't say it. The number one race that are being evicted. Yes are people of color but it is documented that the black people are the number one who are being evicted and I got to say it a lot of people who say it. So here's the thing. I think this is a good way to say, how can we push policy to stop developers coming into communities who have is established ourselves in the community and said, this is our community. You can't just come up in here and just pushes out there has to be legislation that you're welcome here, but not at the expense of 10 to be evicted. to be evicted the homeless problem is not decreasing 2015. They said that the homeless problem will be no more. Listen. That was a lie from the get-go. I don't know who came up with that plant. Oh, I'm sorry the city of Seattle did the mayor or something. It didn't decrease its increasing and we see a lot of these developers are adding to the problems of housing the rent increases the people who are suffering are the most marginalized vulnerable communities here in the state of Washington low income people with disabilities people of color black people. And so I want us to see this picture. Yes, you can come into the neighborhood all she'll be welcome whether you're white or black with a thing as you have people who have stayed in their place for 40 plus years. Where are they going to go? Where does the city have a plan or the developers have a plan for we're here. We're going to displace 30 for black people 34 Samoan people 34 Filipino people actually know we'll just give him a notice which is legal and say bye-bye in 90 days. You got to find a new place. Here's the thing. We can't just talk about it. And we we have to save ourselves by saying enough is enough and start pushing fourth policy that will stop this outrageous practice seriously because it is outrageous. Why do I know and why do I get the experience doctors of the tenants Union? I do this everyday I was I was raised up in Seattle for more than 40 years you guys. So Rainier Avenue don't look like Rainier Avenue downtown don't look like downtown I grew up where there was people that look like me and black people walking in Columbia City up in downtown. It don't look like that no more. There's no Equitable. There is no Equitable race in Seattle. All the people that look like me. Show me someone and people on the board. They're getting pushed out. And so I say this respectfully to everybody who wants to stay here and shouldn't be on the backs of us the tenant who look like me. Thank you. And you do all the panelist for making a very important introductory remarks Violet was just saying about not only the overall prices of housing affordability homelessness addictions displacement. Absolutely. It's affecting the vast majority of ordinary people in Seattle, but as she correctly said if you break down the impact by race and by community and bigender, you can see that just just horrendous the disproportionality that how especially the black community has been impacted and I wanted to draw your attention to study that actually we were we just covered in my previous committee meeting earlier this week on Tuesday to the select committee on homelessness richest culture, which I could share with other council members and at this meeting last year's day. We had a doctor Tim Thomas was a researcher at the University of Washington who is available from my account website, but this study is a very unique a new study were just looking at all the court date on eviction. And like I said in my comments earlier, this is a small subset of the people who are actually facing economic eviction to go. This only takes into account those who had a formal eviction order from the landlord and then when 10 challenges of the cold, so it's even with the small sample what you see is disproportionately black working-class people being impacted single mom house was being impacted and another word that Violet was saying those who are already facing other oppression in our society those who are already the most vulnerable are also facing the the the sharpest brunt of the housing crisis and the irony of ironies and this is and this relates to what David Parsons the president of the Union that represents. Student said in the public comment is that those are doing the research themselves are facing the crisis of housing affordability in a mention that because dr. Thomas was a research at u-dub during his presentation at city council chambers on Tuesday said I even I with a PhD don't make enough to do full fill the rent that are being forced upon us and he has to double up with the roommate. So imagine what is happening to childcare providers teachers custodial workers Library workers and so many other people who are doing the work of the city without whom the city would collapse in a single day, but are not making even the wages that are you the researcher might be making so this is a massive prices were facing Violet also brought up an important point. Tenants Union, so I wanted to ask a question to Renee and Roselle would you with the dentist that shadow be interested in connecting with Violetta and Amy Tower and seeing if you want to build your own Tenants Union in chateau? Yeah, yeah. Thank you so much so much and Jeffrey for the comments he made because he has seen having lived here for many decades. He has seen what has happened to the central district adult the whole of the central district has basically become denuded off at the black community because they're being pushed out so father and father and inside outside the city limits you see black people being disproportionately impact by homelessness as well. And we see the city council the majority of the city council and the mayor constantly attempting to cut funding for homeless Services, which again disproportionately impact our black community members shame shame shame on them. It is absolutely unconscionable for them to be doing this when the crisis is at the greatest to come back to the specific questions of Chateau. I hope you all are able to hear my Renee was going over the demands that the tenants have represented to Cadence. I want to ask a few questions do that as a policy analyst in my office to explain what what what are the next steps that are possible for the tenants and water is in other things of the city council can do know the water to let everybody know. We did invite Cadence the developers to be at this meeting. We not only invited them be our judge them to be at this meeting, but they sent me at my office and email yesterday saying they were I think they said they were unable to make it but Yes, they yes at the meeting that the tenants had fell onto on Thursday night. The developers said we will think about it, but they but they are not you're not that I'm really surprised. I also wanted to let everyone know that we are getting the help my office is getting the help from the city of Seattle's office of Housing and the department of construction inspection. These are very hard-working employees of the city of Seattle who work on Code Compliance, you know, if you if you're a renter and there's something wrong in your home if the shower is not working in the plumbing is not fixed if the heating is not working then you can contact my office and then be we get the help of the Department of construction inspection to address those issues. They're very good about addressing those issues and they also administer the relocation assistance program, but I agree with the speaker to spoke in the public comment that the relocation assistance is nowhere near what People need when they are displaced and of course as I said, they should not be displayed in the first place. I invited City staff also to join us. They they sent their apologies, which is understandable if they are unable to make a Saturday meeting, but I also wanted to stress that while they were unable to make it. We my office believes it is it was important to have this meeting on a Saturday afternoon in the community because otherwise public voices are not hard in City Hall. And I have to say I have to say too deeply unfortunate the northern continent or bother to show up and there seems to be a track record. When we do meetings in the when I do community committee meeting in the community where hundreds of people are here accounts and numbers are not here and I think that is a problem. I think we should demand that our elected officials Listen to As which means they need to come into the community and listen to Ordinary People and I hope that we will continue to Manning that but on the issue of cadence Can you die can you go over some of the issues to specific things that that the tenants are facing and what they can do? So I one of the things that we've been asking me office of housing about in the and HUD to Seattle Housing Authority in the Bremerton Housing Authority because they administer this program was weird that the temperature temperature just yes, it's about these demands that these really important demands that the Chateau tenants have made that Cadence needs to basically find an equivalent place for people to go at the at the same rent in that sort of thing and just taking a step back. Developers in Seattle are not making it their responsibility. Usually, you know, when they when they go in their displaced people, it's somehow somebody else's problems. But imagine if we set a precedent here that actually is the developers responsibility to find a place and equal place for people to go when they displace people and if we do that here that we can do it the next time I'm there next time. Cadence on the website says that they that they have over 30 building large buildings like this. There are there laws were so in this building. There are some units that are part of this Section 8 program in there some some units that are not for the innocent are part of the Section 8 program the Section 8 allows that to be transferred to another building if the building if the if Cadence agrees and at the other building agrees Caden's Owens 30 other buildings do they own buildings in the neighborhood can they can they offer units in the neighborhood they could even theoretically transfer transfer this Federal money to building set. The city is funding right now in the area, but this is something that the that the residents have asked Cadence to come to them and then to say Where could you where could they go? And that's something that that it would have been best if Cadence had agreed to come today and make a public commitment to do that people should ask them to do that, but they have the power to to transfer that to an equivalent unit that and it needs to be one that actually works for the rest NC. We we talked to many people who have specific ties to this community in this neighborhood and that's Mobility needs in that sort of that sort of thing and it needs to needs to work for people and for the other units that that's the the seven homes that are not part of that program again Cadence owns buildings. They can provide Other Homes at the same rent same size. They can provide that if they really thought it was their responsibility and it's up to us to make it their responsibility. I'll stop there. Can I ask a question of do we do does a city have a way of finding out what other building skating zones in the district or in the vicinity? And if not, can we ask the author? Alaska don't know and I wasn't wanted to let everybody know that if you haven't already signed this petition, please I mean if you support the Chateau tenant in their struggle, please sign it some of you may not be supporting him that you're right. I don't agree with you, but but just know that signing this petition means you stand with the Chateau tenants India Indian struggle and that you stand with them and demanding that Cadence find find alternate affordable and accessible homes to make sure that the tenants are not displaced from the Central District. So did Canelo to ask you what the what has Cadence offered so far for Cheval? I just also just to let everybody know the fact that the tenants have got organized and made their struggle public that itself has been an incredible step forward because that is put pressure on the developers. They don't want to show up the meetings if they can help it. They don't want even the names known what they want is to quietly make all the profits that they that they make, you know when 7:10 and don't say anything and they just quietly move out that's what happened. And I know somebody in the public comments said that I'm stopping every developer from building to building getting too much power to me that hasn't happened. As a matter of fact too much of what happened. What happened to Shadow is what's happening. We just small businesses ordinary people working people are getting pushed out and I also think it's important to Acknowledge that a working-class and middle-class homeowners are facing similar struggle and that we should unite homeowners and renters together in a struggle for affordable housing. And so I just wanted to say that the fact that Cadence and it's a real estate property manager Washington real estate the fact that they felt forced to respond to the tennis itself is a testimony to the tenants or getting organized and it's not because of me because of the tenants good that God organized that this occasion spelled afraid that if they didn't respond at all, it would look really really bad. So the fact that the developer even responded I think we should recognize as a step 1 Victory for the tenants and then on top of that they said they were the tenants sent a letter to Cadence which I don't think we read out but we can make me I'm sure that's available publicly. They sent a letter to Kayden saying we need you to meet with us and for a few days. We don't hear from getting the dog, but I think of other tenants get building public pressure they heard from Karen that they would meet with them. So they met with them on Thursday night and it wasn't just representatives from some different. Reno hired Corporation the Cadence principles themselves with their which again I think is testimony to the success of the tenants have had in putting pressure on Cadence. So on Thursday night or my shopping done the tenant spoke directly to the owners of cadence and said you need to do this that was a quite a powerful thing to watch and so so Cadence has made some offers to the tenants that could you please explain to us what they have offered and where how does that stand in relation to what the an intellectually demanding? So when we first went to the initial Outreach meeting in the snow storm before the before the residents of the Chateau knew that this was happening at that meeting at the we asked about about what Cadence intended to do about displacing people and at that time they talked about the relocation assistance that by law they have to provide. That's a little bit under 3900 which is which if it's just about moving that's one thing but then we have to deal with higher rent and that disappears in the moment. After the resident started organizing then the then Kayden said that they would provide additional relocation assistance. They said they said they would provide $5,000 additional relocation assistance. So that the actual that's exactly from what work. I think that the residents have done already that was on the table originally in terms of the most important demand about having somewhere to go right now. The main things that Kayden to say is that those rest in to have who are in the section 8 units which is not all of all threats since but those residents who are in the section 8 units there when they are displaced then instead of being in a Section 8 unit. They'll get something called a the Section 8 Choice voucher, which is what most people think about when you think about a Section 8 voucher where where You wear sha where the Seattle Housing Authority gives you a voucher to help pay rent, but you have to find a landlord to to accept it and that's obviously people don't want to lose. But if you have that that does not guarantee that there is a landlord that will accept it. And right now that we've learned from the office of housing. There are over 400. There are over 400 people with those vouchers from the Seattle Housing Authority right now looking for a landlord to accept those vouchers. So I talked so at the meeting on Thursday and previously many of the residents pointed out that that is that that is not sufficient and that by the way, it's something that happens by law. Anyway, Seattle Housing Authority. Does that automatically that's Cadence Cadence doesn't play any role in that that's just something that people look at anyway, so what Cadence has not agreed to do yet? It is actually fine people a place to go. Write a ya in the place that works for them, especially. The letter that the tenants wrote to Cadence urging them to come to this meeting and also their List of Demands. Are we passing I'll be able to pass them out. At least as many as we have I don't know if you have copies for everybody. Let me know post this on my console website so you can look at them. And if you if you especially would like to have a copy raise your hands or John's on Menaul to give it to you. Renee Andrews elegant. Can you tell me how many of the Denon sign this letter inviting the developer to come to the you speak it was 19 how many how many is 21? Okay. And can you also tell me one what what are your thoughts from the meeting we had with the developer on Thursday night. And what do you think about what they have offered so far? Well, I think that the meeting made them know that we were organized and they took notice at first they thought that they could just sweep it under the rug and make us go away. But now they know that we are organized and we are going to fight this. And also we ask them to write a letter no to make us a proof that they going to do whatever they had. Toys R Us on Thursday they kind of just say yeah, we going to relocate you but in the long run we're waiting and nothing's going on. So we want their handwriting. Thank you. What do you think of what they've offered witches worship all the tenant relocation of this is not offer. So to say because it's the law if they don't follow that they're breaking the law but beyond that they're saying that they will give $5,000 to each tenant for Cheval regulation for your organizing to because no developer is going to part with that kind of money. However, they are demanding it. But do you think do you all think or do you think that your fellow tenants wherever they stand do you think that that would be enough or do you think that your demand that you have said where you said that Cadence? It is Cadence has responsibility to find alternate affordable and accessible homes in the district. You think that they need to fulfill that as well? Absolutely. Definitely. Yeah, we want to stay in our neighborhood as we as I stayed at my Aunt she's lived in in this area for for all of her life. She's 80 years old now and in this is her home, she doesn't want to move. I mean she doesn't want to be uprooted from the neighborhood that she's used to see what she had an operation four years ago to save her life. So she does want to just live the rest of her life in the neighborhood that she's accustomed to. I wasn't wanted to acknowledge the Reverend Angela Yang Hozier can use this way or something that everybody knows she's the pastor at the Bethany United Church of Christ in Beacon Hill and I mentioned her specifically because she has joined the struggle of the Chateau tenants and she was also at with them at the meeting with the developers on Thursday. And one of the things she said, which really I felt was important was that even though she represent the congregation in a different part of the city that she felt her voice was important because most communities in different parts of the city are facing this crisis and that everybody needs to be in solidarity with the Chateau Dennis because if they win their team and then that will be a tremendous boost for the struggle as far as well. I also wanted to acknowledge Red Robin Jeffrey said which is that the demands of the tenants Chateau tenants have it can can and should be a model for watch what a renter should get when their buildings are being demolished and when they're being evicted and that the city council should adopt it. I think that that is really interesting idea and that we will be following up on that. I wanted to just point out how powerful is ideas because 4 in a situation where for-profit developers by law because this is totally legal. I've been with many of us may think it's immoral but it's totally legal for them to demolish affordable homes and then build new homes, which and I as a German Jeffrey said we are not against new home. What we want is a city that's affordable for everyone. We want a nice city that's affordable for everyone. So I'm not I'm not opposed to nice buildings. I'm not opposed to density, but I want it to be accessible an affordable. Everybody regardless of income it shouldn't just be for rich people. What I wanted but I wanted us to take into account because we know we're coming to the close of this meeting. We cannot close this meeting without outlining next steps for ourselves, which is that what the what the tenants are demanding witches. Cadence full fill a responsibility of moral responsibility to find the tenants alternate accessible and affordable homes in the neighborhood. That is not a small thing. If you look at the power imbalance between the big developers and Ordinary People the developers are not required. Let me be clear that demand it is not legally enforceable at this moment. And that's what Reverend Jeffrey saying that the city council should make it legally enforceable, but at this moment it's not And it will be very difficult to win a law that that is legally enforceable because it will take a real fighting movement to win. So at this moment the Chateau that has are showing tremendous Courage by including this demand and not just saying, okay, I'll accept whatever little money I can get it now whatever happened to me happened to me and they're standing together in the morning. This is an incredible thing. Why because it goes to the heart of the business model of the developers. The business model of big developers is to demolish affordable homes, and then Place luxury homes in the end. Play in their place. And as well as a luxury doesn't let us leave me the unit on the Judy to just meet the rent or so high that only rich people can afford them. So this is very very it's a it's a crucial shift in our struggle that the Chateau tenants are demanding that because it is going to the heart of the business model of the for-profit developers and I say that boats to give the tenants their credit but also to emphasize how difficult it will be for them to win this game and let alone making the city law under estimate the struggle that we have ahead of us. And for those of you who have B-12 come here in solidarity with the shadow tenant in solidarity with everybody was facing the housing crisis. Please be aware that this is going to be a hard thing to win. It is going to be a fight and for those who have said or may think why do we approach these issues with animosity? Why don't we talk nicely? First of all, I think we are all nice people because we stand with our neighbors. So that is a nice thing to do. However, I want to be very clear it is not the tenants or those who are advocating for them who are engaging in animosity. The real animosity is having a system which this is dispenses with Ordinary People completely discount their humanity and says we should be able to do whatever we want to do in order to get our 25% profits. That's the real animals. And if it was merely a question of asking these corporations nicely then we have done that a million times and what I thought God knows any time we have want anything it is because we fought for it but let us never be ashamed of fighting and let us reject any accusations of animosity. Like you're not being nice know we are being nice to the people who need us to be nice which is the vulnerable in our community. And so I wanted to come to the conclusion of this meeting but my first outlining summarizing what we have achieved today what we have done today is brought many many people from our community together in solidarity with the tenants because they're not going to win this on their own. So that is a very important step forward. We have held a city council committee meeting in the district and it is late. I hope you all noted that this meeting was very different than most City Council meetings, which are in City Hall. Okay, that's fine fair enough. Most meetings have to be there but most of Discussion in city council meeting is completely inaccessible to Ordinary People because we don't know the terminology. We don't know the jargon and that is why I have deliberately organized this committee to be accessible to everybody but everybody knows what we're talking about talking about affordable housing vs. Developer profit, very simple. There's nothing mysterious or jargon about it. We're talking about our basic rights. So what are the next steps one? Please make sure that if you want the shadow 10s to win their fight so that we can go on to build future victories and please make sure you signed this petition. And yes, please sign this petition and please expect that you will be contacted by the tenants are my office in the near future the next day or two because we need to keep building despite. Today's meeting was a great step forward and I thank you all so much in a really for coming today because without you all there is there is no Shadow struggle, but it is hardly going to be enough. We have we have with the courage of tenants and you all have we have put Cadence and the cities political establishment on notice. But putting them on notice not going to be nappy. We want to win. We're not here just to make public speeches and statement. We want to win real victories with means affordable housing for them. So, please expect expect to hear from us in the next few days because we will need to do many more organizing actions. I also appeal to you all those of you whether your home owner or renter if you're facing a struggle if you're if you're a renter in a building and your building is facing a similar struggle like Shadow or something else if you right now, but if you reached out to your landlord or property manager many times that I've come to fix the problems in your building and they haven't done that. Please contact my office because we not only want to help you fix those problems have those problems fixed, but we want to Bring you into you know into the into part of the organizing because without all of us getting organized we are not going to win the crease or rather than being individual struggles and individual buildings. Let's bring all the buildings were facing this crisis together if your winning if you're living in a single-family home, but you and I are roommates or housemates are renters and you're facing issues still you should come to us and we should talk to each other. If you are a small landlord and you support rental struggled because we've met several of them. Please get in touch with my office because this movement is not in antagonism towards landlord to support your renters, if you support if your landlord and you support rent control and I've heard from any of you if you support the idea of building publicly owned affordable housing and then please contact my office so that we can continue building the struggle and then the last part of make it in terms of what the obligation of my of my Council Office I said outline we will continue to be in touch with the opposite. He's office of housing the City Department of construction inspections about to get information about Cadence and buildings and also to make sure that the problems that the that exist in their building or Faked like a Renee said the lift is not working the little children disabled people who walk on the stairs, even though they need a lift because they have no other choice if you want to make sure those problems are fixed immediately, and we will also be in touch with the federal Housing and Urban Development Department in charging them to come to Seattle, Washington, DC. What does and will not be an easy task because the Housing and Urban Development Department today arrest reports to Donald Trump and not only has her face Decades of cuts for affordable housing under Donald Trump. Those cards have been dramatic and hard also suffered during the shutdown. So I don't know what results we will get but we will continue to Richard Hardon to meeting with us. But the more you all raise your voices and build a unified movement the more it will enable me to actually succeed in that endeavor and we will make sure that we keep following up with the tenant and don't talk to you while renters and 1/2 former Tenants Union, please either contact my office or violet or Amy from the tenants Union. Let's get the city organized. Let's win a real bill of renters rights. Let's push back against the economic redlining of black and brown people like make the city unaffordable City and Light. Wendy's individual struggles and also fight for rent control and for taxing big businesses like Amazon to find a massive expansion of social housing, which is publicly owned affordable housing. If you don't remain in our children don't remain at the whim of for-profit developers. Thank you. I'm sorry. I'm sorry. There's one more item that I forgot about witches public hearing that we are required to have by law, which is on the already passed legislation protecting the house you own mobile home park with their temporary moratorium on the destruction of mobile home parks in Seattle to make sufficient time for the city to put permanent housing protection zoning Protections in place. As I mentioned. This is a legally required during the legislation is already in loss of not disputed, but by law required to open this to public comment if anybody wants to speak on that issue not on the Chateau wish you please let me know. Sing nobody wanting to speak on that issue. We will close. Thank you. Thank you. Thank you Megan Murphy for speaking on. And if nobody else wants to speak on the house you own issue. Then I will go ahead and close public comment on that and we will adjourn the meeting but not the fight.", "end_time": 7429.2}]}