{"format": "raw", "annotations": [], "confidence": 0.9414096575672344, "data": [{"start_time": 0, "text": "Good morning, and welcome to the June 25th meeting of the Civil Rights utilities economic development in arts committee. My name is Lisa herbold on the chair of the committee and council member representing West Seattle and South Park District 1. I'm joined by council members to want and O'Brien and it is 9:39 a.m. On our agenda. Today. We will start with a public comment and then move into the two items of business on the agenda appointment reappointment to the lgbtq commission and a briefing from the human services department on a navigation team 2nd quarter Proviso report adoption of the agenda. They were high and posed with the agenda is approved. So yes, we can start with a public comment no comments. So then first item of business. Agenda item one is appointment 01376 limit of Byram Simpson as member Seattle lgbtq commission for a term to April 30 2021. Thank you. Express update please welcome and start with some quick instructions. I'm Erika Pablo from the Seattle office for civil rights in public great. So yeah, I stopped to Seattle lgbtq commission and their job is to advise city council the mayor and City departments on issues pertaining to the lgbtq community. This week is the last week of Pride and so the commission and the city can control people participating in the pride parade on Sunday trans pride is on Friday. So the commission will be tabling there in Trinidad encourage folks to apply for the commission. Fantastic and Byram is a council reappointment to make sure you want to say a few words. Can I buy run has served a two-year term on behalf of County Commission. They are currently working at Youth Care and their interest span from therapeutic provision for Youth and Young Adult experiencing homelessness, and they would like to continue to serve in the capacity of lgbtq commission that impact queer and transgender people and people of color and that's why they're excited for this appointment. And Byram is actually a reappointment the the agenda and the cursed child does not reflect that so I will move to amend appointment 1376 the appointment title Itself by removing the word appointment replacing it with the word reappointment. What's the temperature in post and I will move appointment 13 to 76,000 and posed no staining and we can let them know that their reappointment will move on to full Council on Monday. Thank you very much. Thank you. Agenda item to is navigation team 2nd quarter Proviso report. Play Musketeers. That's alright, everybody get their comfortable seats in their orders will do a quick round of introductions and then Justin placental doubtful do an introduction Today Show staff Tiffany, Washington Human Services Department. Thank you. Therefore we're going to be discussing today is the second response that hsd has sent in response to Greensheet 1495a for that was the Greensheet the provided funding for the navigation team. There is Proviso and not calling for a set of data to be reported quarterly as well as some follow-ups on the report prepared by the city auditor for further contact on that that the city Auditor's report was first prepared in November of 2017 and outlined a series of checkpoints as they refer to them or areas to obtain further information regarding the navigation team there been a series of responses from hsd that have also and also further reports. I analyzing those responses or expounding on them that they are Thursday auditor's office is also completed that if that continues over last year and then this latest quarterly reports. I've been response to the Greensheet as well as the one that was provided in January continued to ask you to study for certain metrics are certain checkpoints to be responded to and general what we Just recover the data that was submitted it just you will go into the details of it. I just had a little historical context across the majority of Demands. You see a decrease in outcomes are measurements and that includes removals Witcher down 35% are referrals to shelter which are approximately half the number for Mike this comparable time last year and also the number of contacts made which are approximately half that likely has Sam's not only from policy changes or approaches but also because it during the winter snow storm, which was during the. Of recovering all removals were suspended and the navigation team was focusing on Zach's tivities on making connections with individuals to bring them into Shelter From the weather Thank you. I'm in so this report will cover about about a dozen different data points. You can see them on page 3 of hsts report ranging from total number of contacts made quarterly to updates on new shelter resources that have come online and then further here a little bit about as Jeff mentioned the checkpoints that the city auditor has identified along with hsd and their progress to addressing some of those recommendations and that I'll let you keep it off. So I just want to emphasize that the 2019 Proviso is a combination of new reporting on performance metrics and revisits the Auditors 2017 observations of the team. FAS where the program used to reside in hsd have been responding to the auditor's recommendations for 2 years now and that time frame a lot of things have changed which makes reporting challenging and there are a dozen of checkpoints as the council member describe that we could discuss during the presentation, but we're just going to focus on key data points in Proviso checkpoint. So the q1 data in the Q2 report is what we'll be talking about today. I want to we submitted this report on May 16th and just want to call out that quarterly consistent quarterly reporting is new for the nap team. So we were reporting in the past, but it wasn't consistent me and every quarter. So jumping into the performance metrics for January through March of 2019. What we see is the individual has engaged the 731 individuals engage are unique people that the team talk to and interacted with the contacts are the number of conversations that have occurred. It's into its individual people who can be contacted multiple times or just once so the difference between one and two is one is unique into could be duplicate and then the referrals to shelter are Unique Individuals that accept a referral so it could be so those are receive multiple referrals. referrals Excuse me, referrals come from come from the police officers on the Mavs team or from the the Reach team. That break down right now that doesn't work currently trying to integrate the ticket. And one of the things that we talked about during the budget process was figuring out what we can do to learn more about the outcome of those referrals. You can only know what is able to be reported by or or what it is reported by the shelter receiving the referral but do we have we done anything to to try to ascertain the numbers of people that were referring that actually accept the shelter referral that they've been given Yeah with the added capacity with a data analyst were able to now use little hmis data to eat those that were referred if they actually kind of enrolled in a shelter how long that is. It's a little more complex because those that often I don't consent it's hard to tell but they go into so we are in the middle of doing that and I'm going through 2019 and looking and trying to get all of that basically the code to match those so we are in the process and hope to have that later this year. But if someone doesn't consent, of course I can picture for you, but I'm assuming that if if it we are counting it as a referral at least at that level they are consenting lyrics consenting to accept the referral wrecked what happens between receiving the referral and the shelter itself. It's a whole other ballgame, but still it's important for us to know of the referrals that you give how many People actually end up in a better place than where where they were staying PS2 the encampment removal. So this next slide is a gender breakdown and it's up here just to show that we're capturing the data, but it's too early to analyze any Trends here. Same with the race metrics. It's too early to Define trans and analyze many of the demographic data sets, but we can see is what is in most data is there's disproportionality. And then we also want to know that the race and ethnicity categories are set by Hud. And so when you say it's too early to analyzing data to come to any conclusion, you just talk a little bit more about what you mean. Like, is it a sample size that makes it more able to be analyzed and if so, what what is that number of those are engaged and seeing some Equity around there and then of course those that actually see the referrals and then as you mentioned actually stay in a shelter so part of this is that longer-term analysis we're doing for this year as things you actually stays at a shelter and if there's this personality possibly and getting folks to shelter And these numbers? Do these numbers reflect contacts or do they reflect referrals and not engage not people engage but contacts correct in what one Milestone we did make that will change this demographic date a little bit from the previous years is that we change a practice to now not marking proceed race or gender gender identity which was happening before and so you'll see there's a little bit more data not collected and that's intentional that it's not folks that are identifying other folks as a particular race or ethnicity. So we're really truly trying to have them identify themselves and not have any perceptions. Okay. So what we what you see on this slide is that enhance shelters and Tiny House Villages were made in the most attractive shelter resources for people living in sheltered. I think we all know that it's not shocking what we are finding though is that tiny house Villages are generally full on a daily basis. So there is often more enhance shelters available than tiny homes. The 28% referral rate is for Unique Individuals. Not all referrals made. So when you refer to people who eventually accept a referral to shelter, how are you how you quantifying that term eventually? It just means that they could have been contacted engaged 50 times before accepting shelter. Because the contact category is duplicative. So is there a is there a number I can average number of times? But it's reasonable to assume that of his 28% that eventually accepted a referral to shelter some of them except a referral the day that was offer. So it would help to know what range that eventually is and you know, maybe get a sense of you know, what percentage are accepting shelter when it's offered and how average number of engagements is that is necessary in order to get people into shell. Thank you, Jehovah on your On the performance matters, I mean all of this is your presentation on performance metrics. I'm not sure especially on your slide where you force talk about performance metrics. I'm not sure if you can pull that up. I have a separate questions about the the race and social justice the house, but just overall. Anakin this is not a new thing. But I but it's troubling to me that it continues to be this way that we're in comparison to virtually every other service that the city contracts with who are required to have actual metrics in terms of transitions to permanent housing. How is it that the navigation team always present stuff like this where individual people engage contact made what I mean? Honestly doesn't tell me anything. What does it mean? Like what happened? Was it a contact experience where the homeless person actually weather without the services that were offered to them were something that they were able to accept or not. That's a different question, but was it a friendly experience in the first place? We have no idea. I mean, this is very very opaque and I appreciate you making an effort to address the Proviso requirements, but I just don't think this is enough. It has to go much much deeper. I mean in addition to the point that you are horrible doll already made. I think you have to explain what does it mean individual people engaged contacts made? I'm in this of these are just words in my view in any other thing that I'm concerned about is when you say I understand how you explain the difference between the individual people engage in contacts made in that the individual people engaged metric is like unique people individuals, but it's only unique us to a given sweep. Right? It's not if you can tell me that it's Unique in the sense that some of the same and cam plants are swept over and over and over again. So in that sense, this number is not capturing unique in the sense that probably they have been but those individuals have been spotted before and I would request you to say that that's not true because I know it's true we have in my own, I've had homeless individuals who have told us that he told the council that they are swept their same and camping and slept over and over again, so they would show up again and again, Again, so I'm not even sure even if this Force metric was in anyway useful to me, which it is not I still don't think it is unique and that sounds and I think that Continuum needs to be analyzed because if the same person is being swept over and over again without ever any solution being provided them then what are we achieving by spending money over and over again on this week if you know what I mean? So I think you also have to have metrics on how many times the same people have been swept like you keep a record of that keep a record of the same and camping for example, the Ravenna and camping how many times has the eye I know it has been swept at least five or six times because I'm saying 5 or 6 because this was a year ago when we had them in our committee to probably been swept again. And also I think you we have to have a rigorous requirement to trace transitions Department housing because otherwise, it's cute in a you're having your you're asking other services to provided metric. You're not using that metric for your lawn service. I don't think that provides as it's like we know scientifically speaking. We don't want to compare apples to oranges the same metrics across-the-board find that you're including these metrics, but you also have been to the metrics by which other services are having to comply with and then one other question I had. Before the Race and social justice toughest. Can you explain what has happened with to reach my understanding is actually why don't is it? Okay if we have Jeff just quickly explain what we believe has happened and I think Shadow can I answer the first question and then I want Ali to answer the second and then we'll go to reach so you bring up a really good point in terms of the Continuum which is why we actually don't prefer to take a program out of the Continuum and do a presentation just on the program because it doesn't make sense. So there's a homeless Continuum and Outreach is a piece of the homelessness continue oven so we have how many agencies contracted for outreach Urban League Youth Care. Chief Seattle club, we have 15 Outreach agencies. None of them are paid or measured on exits to permanent housing. They're paid on the same thing that the nap team Outreach has paid for which is number of contacts and number referrals to shelter. So you think of it as a pathan. So then they pass the Baton to the shelter they get the people in the door once they're in the door. Then that shelter is responsible to get that person into permanent housing along with case management. And so when you present the nav team Outreach separate from all of the data that you would refer to when you said you saw the whole Continuum, it is very confusing because it shouldn't be I agree with what you said. I don't have anything but the Continuum I was referring to was the sweeps themselves like a service provider. So they go out and make a of the report. It does say that all HS defunded Outreach contracts require cointracking and Reporting on the same performance commit right in and includes exits of households that enter permit housing. So it is a reporting criteria, but then you go on to say that that's what it is. Then you're not rich agencies that are also shelters. And so they report that noelridge provider has the ability to track data on outright service refusals, but it clearly says that Centage of household to enter permanent housing is a is a data point and it's my understanding from some advocacy that I did a couple months ago that it is well with with reaching and with ccs that it is actually a data error and we can send you a contract Jeff and Outreach contract. You won't find exits to permanent housing in that the attachment to the hsd RFP that is computed does not have for outraged agencies as corrected. It does not list exits to permanent housing focuses on referrals and outrage contrast me. It's just for the Outreach providers are there might have been an error here where there was a cut-and-paste or something but other contracts are actually pretty by to do that and I can follow up with the attachment therapy, which is what all grantees that receives a contract all of our country. It doesn't tell a full picture. I think what I hear you saying and what Ali was trying to say is We have to figure out a way when we have a non consent law was as we should how did than Tai who went to permanent housing how someone went through the whole Continuum from start to finish and it's just something that's nuanced. But I think that's what I'm hearing is like what's the story of a person did one of these people end up in permanent housing are they better off because of what happened at the beginning and so do you want to talk about duplicates? And I think your question council member was it doesn't tell you how many people were removed over and over from an encampment. Was that your but even otherwise he would be even better if going to a different. And that is one of the things we are starting to do in 2019 is we've kind of always had identifiers for those that we see on a regular basis. So we are able to undo placate those an instance where they're not willing to give names or we don't have a clear identifier for they are they may get counted a couple times but in our system as it is when they have a meaningful contact with someone and get information then that person is in our system by a name and then the next time they see them they will attach that the next engagement contact with them to that record. So we are able to dig down into actually on duplicating and seeing how many times which is I wrote down how many times people are contacted at various places we can add that to analysis and start looking. And then reach you were going to share a previously previously. I would say to this time last year Rich was contracted to provide Outreach Services for the navigation team and they had approximately a case managers that would go both when there was a 72-hour notice provided for in a camera to be removed. And on the days that a Fennekin I would actually be removed and then the changes that has happened over the last few weeks. I'd say is that reach no longer has Outreach staff that come on the day that is sweep is actually taking place. They would only put come to an encampment when a 72-hour notice is provided increasingly there. If you do comparisons this year to last year more Camp encampments are not receiving that's every two 72-hour notice which means that reaches not engaging with those encampments and said I was shared a few weeks ago did rather than not taking the the funds provided in the budget to expand reach his contract and have even more Outreach staff. He has hired two people directly that they term describe a system Navigators and those Navigators come on the day of our that an actual encampment removal takes place and her performing the type of Outreach Services that UTSA reach wouldn't provide a previous than honoring reaches request, which I think is reasonable haven't been an Outreach worker which is they don't want to be Associated on the day of because their credibility of an Outreach worker is key. And so they want to do all of the pre Outreach but on the day of the clean they've requested continuously to not be present and so we've hired two people to be present so that they don't have to be So what that effectively mean, since there are very few 72-hour cleans happening anymore. That reach isn't doing the body of work. So reaches both apart of Outreach specifically for the national team and Outreach generally as it relates to the 72-hour cleans being done reach is very engaged in a very small way with NAB teams work at this point. It doesn't so, I understand what you're trying to ask. It doesn't work. That way. There is a population of unsheltered individuals rights that all Outreach is responsible and personally gauge with regularly, so we can't make a hypothesis of how much reach is talking to somebody that a nap team member is eventually going to ask to to to move I wasn't I wasn't suggesting that reached is not engaging with individual separate from The navigation teams work I'm saying that they're not engaged in the NAB team because the nap team isn't doing very many 72 hours sleep City any longer and so yes in the course of the war at the Outreach work that they do they will come into contact and engage with people that the NAB team determines on a separate track is an accountant that is slated for removal. I don't question you. I feel like it's a fine line and it could possibly set up a narrative that's confusing. It's not that's not that clean if I could add so reach still is meeting with an AB team on a daily and weekly basis. They are still working with an apt to do Advanced Outreach two sites sites that either are going to be prioritized removal or sites that they are just visiting a part of their tinuum work. So they're very much still making contacts. Those contacts are still the new reflected in his dad. Are there just not going to be there on the day of a 72-hour clean? So for instance, let's just take an example of the troll Knollwood. I think I got a lot of publicity. They would still be in this hypothesis. They'd still be they would still be responsible for doing the Outreach beforehand. So in the weeks leading up to it, that's still be doing those visits and then in the 72-hour window, that's still beating visits. The day of the test Navigator should be there in case individuals want to take up an offer of shelter service of the navigation team removals are not the types of removals that you're describing. They're not ones where there's multiple days of about real hair removals that people are given 30 minutes notice and there is no advance notice from 10 things. So the first thing is you're saying that there's not there are less 72-hour cleans, which I heard you say then there were at this time last year. I don't know if that's true. I can have a check that. That doesn't have a direct bearing on Outreach or not Outreach. So I'm trying to you're making two points and you're combining them together and they're not necessarily combined together. So I'm trying to understand. I don't understand it just rephrase a little bit kind of what Tiffany is saying and is that reaches concept is that they want to cover the region? So when an accessibility or right of way does come in because there's less time that reaches already been there, correct. So I think yes, they do have a focus for the 7 2 hours there are less and so the expansion of over asking them to cover is larger now is not focus on just 75 playing this. I know that these five areas often have people that come stay there. We are asking you to go there because if accessibility or right of way, you know clean happens and they would have had Outreach all along so why don't they I agree they're not there's less 72-hour cleans. We are asked them now to cover a larger base someone something does happen. They have had Outreach and they have had multiple outrage and they wanted that opportunity to have meaningful engagement. Overtime and not just you know, somebody was right before it happens. And that's not a really great Outreach strategy. So agreed that the work on Sunday 2 hours as last but we were asking them to do a larger coverage and everyone possible in areas to ensure that people do get multiple because of the other strategies company understand the specific role of the navigation team. So reach reach does a lot of stuff for the city that the broader Outreach that you work with weed in the case of where there is a 72-hour notice. And so I really appreciate the amazing work reached us and when they have the opportunity to do it there working with some really challenging conditions and I think they do do some amazing work. Will you said that they said they'd meet with a navigation team. You said daily weekly car? Which one is it? Well, I firmly believe it was daily. I just came from outside the planning side. It's over. My understanding of some of the theories of change around and maybe I'm using the term 3 of changing correctly here. But of how the navigation team was working historically was was a couple things are going on one is that there was in this we're going back a few years here, but they would identify specific places for whatever reason they're really decided people shouldn't be here for a while. I was right alongside of freeways, you know, there was saying we cannot have people here and there was a commitment that we need to have really good shelter options for people we do that now when you're in a moment in a new tiny house Village opens up and a new low barrier shelter opens up and there's a new permanent Supportive Housing about you have a range of options you walk into a site like that. He gives a notice reaches their people have a variety of housing options that and hopefully there's lots of good fits there and people, you know, when that works that works really well my sense. I'm not perfectly there still people that will refuse and not ready. There's a there's a ride every But the moments when we have multiple good shelter options are pretty rare and at least for a large population and so so it feels like the navigation team has shifted from this targeted model too much more where we're just feel like we're back on our heels a bit and we're constantly going back and sweeping places. Mostly. They were declaring his emergencies. I can't quite tell if the definition is shifted over the last year or two or if it's just that there's a certain area of the sidewalk in front of wherever it just keeps getting me populated. We come back every 3 days and just a game of cat-and-mouse but you know, we can engage in that thing and you guys are making your decisions on what you're doing, but it does feel like the the resources were spending on the on these issues. Looks like it's working when we look at the system is the seventh time to see perseid walk. They don't come back and here's how we manage that or is there is there something else going on and do you want to still the same way that you described it from before the nap team can only go out and do 72-hour cleans if there is viable shelter options open and so yes, the number of Shelter beds that people want to go to dictate whether or not they can go out how many 72-hour claims they can do. So we got an average of 17 shelter beds available on a daily basis and we know that we've invested in building more shelter capacity and but yet were underperforming on successful shelter referrals. Are we is there any is there a lesson to be learned about balancing investments in new shelter beds and specifically enhanced shelter because as we've seen before the acceptance of shelter is much greater when there is availability in an shelter as well as I believe tiny house Villages. So acceptance rate of fire if they're tiny and enhance shelter. The acceptance rate is higher if there's tiny house Villages and enhance shelter. So are we using that knowledge to come up with a plan to continue investment and more enhance shelter and Tiny Villages? So there's another we're in conversations with the executive office right now about the ability to switch anytime basic shelter 2 enhanced witch is which we did a lot with the path to 500 West arrest people service providers to their limit. And so we're we're doing another like look through to see is there are five beds two beds went like what could we do to take to transition basic shelter to answer? Some of them building restrictions are barrier. It's just not possible. The other ones scattered sites like Sharon will like church shelters can't be so that I think the stock of basic shelter has dropped. Tremendously that's on the converting existing basic Shelby or what about the I don't have any information on building you in and she'll drive this time. Do you have you guys heard anything? Couple thousand shelter beds / tiny house Village slots / Eve antenna camping spots to eat with the population of the universe there. I just want to provide a point of clarity hear the 17 figure is just the 17 beds safer spaces figure that's only for navigation team set aside. So those are only four places that the navigation team refers to exclusive First Presbyterian navigation center near tiny house Villages that does not reflect the entire system and I can but not prepared to speak about the vacancy rates. I didn't grab it. But I just have to figure is basically what the navigation team has offered at has at their fingertips on a daily basis. I believe you're asking what are total capacity of enhanced basic shelters in tiny house Villages together. All those beds on a given night. I want to say that's in the 2002. I appreciate the clarification of of this number 17 the point I wanted to make was trying to get a sense of of how much baking soda do we have in that system in my senses? The vacancy is incredibly low 17 is only the navigation team. They're probably other vacancies outside of its own is my math is going to be 70. Mm is less than 1% less than 1% vacancy and you know trying to you know, a hotel professionally managed with Juno online booking systems and credit cards can't manage to less than 1% effectively it again. I can only imagine that it's you know, there aren't a lot of damage. We've seen all good people good Solutions when we can't bring them on and so, you know, I know a big effort with those Shelter Systems is through foot and to get people into housing. And so then then I assume as soon as we do that in the bed open against the room is ready to turn the bed is ready to turn to get back in the system and it fills up probably punch in the most sophisticated system. They mess up show up and they've overbooked right because they're banking on a percentage and they have two three databases doing that form right about the navigation teams work being dependent on there being available shelter best refer people to is that only for the 72 Removals or is that also for the obstruction removals both have referrals but I think when you have instructions and right away, it's about the stuff not the person so the person doesn't have to leave but they can't have an entire sidewalk blocked so that people pedestrians have to step into the street as I did when I was coming from the train to get some other doesn't have to be any available shelter beds in those instances, but you're not making the person leave you're only making this stuff going we follow the stars and the system Navigators and the field coordinators and the Outreach workers. Try to make sure that they offer everybody no matter what whether it's 72 hour or obstructions offer them a place to die and I'm saying in those instances that there are that these 17 average shelter beds that are earmarked for that. They're not available that there's that there's no that the The vacancy is 0 you still will go and do those obstruction removals situation. I haven't encountered in two years were there is not a bed to refer people to so that is why this is to be there for an obstruction removal in the event that someone says Hey I want to go inside or hey, I want to get connected to my case managers that says Navigator is there to make that connection and to Tiffany's point right now? I can't recall a time where there was not a single space for someone to go through all shelter expanded to the second floor. There's there's basic shelter beds are there is a spot for someone to go. We will make it happen. But when it comes to following the end, are you are correct where it in of the 72-hour removals, do you have that component where we do need to have the bed set asides? I think the way that does body work a sort of a sort of groan is that your larger encampments which represent a whole host of complexities with on the people. Find logistic sides. Those are going to be approached with a 72-hour rules. And then you're smaller ones such as snow blocking sidewalks on 4th and yesler or down on 2nd Avenue Extension South. That's we're going to see more destruction working stiff knees point. It's about the stuff about stuff blocking. So I went one thing. I just want to mention before we move on is that Jeff mention this but the winter storm data is not reflected in the data sets. It was an emergency situation and it was about making sure that people were safe and inside. So this slide is about the auditor recommended that we should track reasons for refill refusal to service council member. I think you mentioned that fly to go most of the day to hear reflects unknown or other. I think not wanting shelter was the most response. Was the most responses that we got for someone to climbing is not wanting shelter. So there was a 186 total refusals. We don't know why someone doesn't want shelter other than we don't want shelter or I don't want self shelter some other responses. We saw was folks don't want to live in a communal space. They want a specific type of shelter enhanced most of the time tiny Villages or they've had a negative experience with shelter and just don't want to go back into the shelter system. So is there a is there like a list of reasons that they check when they're asked so it took first quarter to kind of get all the database setup and the options and training all the officers and reach that so we are now collecting more specific data on why we will be able to see more supporters progress reasons for refusals of services. Obviously as you yourself are noticing to the data the rate of acceptance for an on shoulders are tiny house Villages. Daniel religious is greater than other types of shelters for obvious reasons so is isn't I mean I shouldn't shouldn't shouldn't I mean the dividing the department shirt and the mayor's office should be forced looking for? Spend those options before continuing to do the setup as a matter of routine doing the sweeps as a matter of routine because I called him sweet because they are inhumane and ineffective when you don't have somewhere by able to go to and viable cannot be defined by the department of the city Bible is what's viable for you as a human being, you know, where can you go with your pet with their belongings and so on and repeatedly on the committee members have dog has as I'm sure you all know already that they don't accept other shelter options because they are temporary often. Do you know sometimes not often but at least sometimes you've heard that their belongings are stolen because they have to put them in storage and then there's no sometimes our livelihood. What you know contained in in the belongings that they have and so if they have a secure place to go to where they can have all your belongings are family members with them the end if it's a place that actually transition Them into housing and jobs, then it's viable. So I just I just wanted to know I mean, I know you said that you're the man you're working with the executive but what it was exactly like what What's the progress? What's the timeline? We should expect this year in terms of expanding those tiny home or in an shelter option so that these are no longer sleeps but actually humane shelter options for people to use and then transition to better conditions. So I don't have a timeline but Ali and her team are working on some cost modeling. I'm just looking at how much it would cost for multiple enhance shelter options. It's very expensive, but I think we agree with you that it's worth it because people will go inside if they feel like they are have some sense of dignity respect privacy. Absolutely, I would I would urge you to convey to the mayor's office. Also that expense. I mean look at how many millions are being spent spent on the sleeves and that is not in the absence of actual options for people to transition to a it's wasted money. And so if we're talking about expense, then let's actually put the money you hair. It gives us the results rather than doing something that has proven over and over again to not work because it doesn't work for human being so bad. I think I would urge you to use that approach and I just want to go back to something around Effectiveness. I do believe that the nav team is effective for the simple fact that if we're going to ask people to move on to have some sort of Humane arm there or Staff there to be there for them when asking them to move on and providing Services case management and shelter options. It is effective. I think that what you just brought up in terms of I think we all agree the executive reason I agree. We need more places that people want to go to but when I drive up and I see reach out on the street, I see Jackie out there. I see August out there. They're out there sitting down talking to people and they may not even be able to help them at that moment as well had said earlier but they're always out there talking to people whether there is going to be clean or not. I do I don't want to confuse between the the kind of Outreach that Outreach and other organizations do intensive just talking to family members and we do that to a man. I don't have any services to offer but I will adopt them as human beings. I don't want to confuse that with the sweeps. I mean I would hold you to keep that that separate and I'm not talking about reach as a waste of resources and talking about this. Basa resources and also it's to me so strong indicator that read as you yourself said Tiffany that reach does not want to participate on the day off because their credibility is on the line. What does that tell us that tells us that Homeless committee members are unhappy about the sweeps for obvious reasons and reach which has a good reputation with the homeless can remember because they have a provider Humane approach. What do they have services to offer or not? It it's a it's a Humane side of the approach that they don't want their own credibility question. And so they have dissociated from the day off so that to me that should be an indication. I mean, how is it that you're missing all these in the kitchen and I say when I say you really did directed at the mayor's office. Obviously, you're you're working under our directive. So I think reach so, dr. Marshall who does gang violence prevention in. Has a training called alive and free and it talks about the disease of violence. And so for those of us who grew up with the disease of violence, which he believes can both be predicted and treat it have traumatic experiences in our past as it pertains to police. So growing up. I didn't like police. I didn't know why I didn't like police it was because of the disease of violence and that was an incorrect. That was an incorrect characteristic on my part because I needed to be I needed to heal the trauma so that I can engage with police officers in a way that was healthy not negating. The fact of things that are going on in society reach doesn't want to be there on the day of clean nor do any Outreach workers when I was an average worker because they are very aware that people that live on sheltered people that are underserved often times have trauma as it relates to police and so their credibility isn't about we don't want to be around cleans The credibility is if client someone so sees that I have a relationship with the police that might impact their ability you want to talk to me because they think that I'm a give their name to a police officer or I may do that. And so I think I just want to be clear about reaches practice not to be present on the day of clean isn't specific to the nav team or casting judgement on what happens on the day of clean. It's more about what we are taught is Outreach workers. Pertaining to making sure that we get the trust of those populations that are underserved and so it's just that I just want to make sure they have never said to me. I don't want to be present because I don't believe in cleans they're saying I don't want to be present because I want to reserve my relationship with clients who have had less than positive experiences with the police officer weather individually or they've experienced it through their families. I appreciate you giving me that giving us that information. That's very helpful. I do think though that I mean I want you and I'm sure others 1 to go by statistical evidence, but I have to say it is stunning to me that anecdotally we have never met anyone who said that hey that time when the knife theme game that was the one that was what helped me, you know, obviously it is I agree with you that it is not straightforward to follow the person through the to the Continuum as you I agree with all of that, but it is troubling to me given the millions that you're spending on the sweeps that not one anecdotally. I know one person and and has not happened. And on the flip side. I've had countless people talking about the traumatizing experiences. They've had and it is not Trauma from childhood or anything like that. It is ongoing incidences. So I would urge that we understand that it is not past experiences that are making them feel anxious about it is their ongoing experience. I'll just leave it at that story. Did you have something that you wanted to add that I think that you know was brought up earlier that we are doing less clean the 72 hours and some of that is that and we are saying that balance. So I think that we are recognizing and hearing what you're saying about the people and those that are getting chosen for 72-hour cleans. Do you have purpose we had a child going into a site walking in a neighborhood community child. So there are reasons but we are seeing the numbers declined because we're trying to be more intentional. Having places people want to go and that instead now you're saying the other right of way at a sidewalk being cleaned cuz those are now providing dangers for Community people walking to work and so we're seeing some of that shift and I agree that we do need to have a viable play and it is a larger systemic thing about all the way up to permanent Supportive Housing. So I just want to say I hear you and I think that you are seeing the number shift so and I last 72-hour clean so And you know, I think it's interesting to observe the shift in practices and to focus on those true obstructions and and Hazards and reflect back on a piece of legislation that counts member O'Brien proposed a couple years ago, which also had a sort of zero tolerance policy for those types of obstructions. We had a differential a different a differentiated definition for Parks than what you're using. I think, Brian you are proposed ordinance focused on active uses of parks where you're not making that distinction but the enforcement approach as far as where where the city could be expected to be doing immediate removals is awfully similar to what we were talking about. Then you brought up the issue of Of the reaction that people have to the presence of police in this work inside. Just want to highlight. Once again our ongoing conversation that we had yesterday in my office as well as I'm at this table back in February on undertaking the Staffing assessment including looking at the inclusion of uniform Patrol police officers as as part of the navigation team, and I look forward to continuing to work with you on completing that data point that was due in August of last year. It's it is really important. I think to Stew as it relates specifically to the the cost of of the navigation team in analyzing. Again, the dollar spent as well as how that Staffing configuration impacts the the theory of change and if you could could you just talk a little bit about how the theory of change has has has changed from when we started doing this work? There's there's some added language to How we evaluate this is a successful intervention or not spend a few months with the team and the different components. So I'll reach SPD and the field coordination group together and kind of jumping off from the original 2017 theory of change kind of Revisited and we did it in a results-based accountability framework with a little bit different than a logic model that was originally presented. And so what we did as we did it you start by who was that you're trying to impact and make a difference for we can help you narrow kind of your your strategy and your focus. So we started with that and you're not only is it the community, you know the house committee. It was also those living m in the living homeless. So from there you want to say, you know, what is the desired result? What is it you want to change for these folks really there or There was a discussion about really at the round of people at the site to be cleaned. Do we focus because some of that started growing larger and larger right that individual person on a corner was going to be included in the impact on here. And while we do what impact that that again as a larger Outreach in the Continuum that Tiffany was kind of talking about so kind of houses Target kind of who were talking about and then from there you just said what what are the strategies that you're taking that we would take to get where we want. So we're really starting with the end in mind or the logic model often. You say we have this many police officers. We have this when you feel coordinators, what can we get out of it and said we start with what is a change we want and then how do we get there? So I multiple conversations around that and then the activities that sell then very and from what we wanted to do was be accountable hold each entity and I called kind of SPD and ID and I'll reach etcetera accountable for their parts list. Ugly and what we wanted them to impact and where they crossed over but before it was everyone was expected to do have Outreach goals. Will the field coordinators. Their main goal is to ensure that the hazards get clean and Country maintain the site and stuff and stories. And so it was really hard to tell when you're trying to evaluate a team trying to tell kind of what can be improved in what can't so by holding accountability with the activities with a various groups and some of them may be so officers and reach both have Outreach accountability, you know, what kind of contacts in referrals but yeah the storage and making sure you're on site to mitigate any hazards and address that is field coordinator so that I can get themselves and kind of got into some color coding therefore. We're we're we're going to the accountability so I could have it all work. Well together it then it does not going to work. So then it kind of gets to your point in the back where the results with accountability has three ways to measure its Effectiveness and its impact. Is 1 is a quantity. How much did you do quality? How well did you do it and impact who's that are off and how are they better off? So we really try to dig down into each one of the entities work and find some accountability measures so we can actually evaluate and see how things are going. And this was done at end of last year as kind of a revamp of a kind of how we think about the work and how weird dressing and Howard and a lot of this also on the high-level is now why there's more metrics in the quarterly Proviso report is we didn't realize that we needed a stronger data collection protocol around that and a better way to analyze it. So I'm with the added capacity of the DNA analyst that you all helped provide you with any of us are now Institute a lot of that in this first quarter 2019 in the second quarter to start giving you better metrics and evaluation violating kind of the impacts. How long has your team been working the date of portion with an attitude since they moved over? So I personally started working as the navigation team moved over as kind of an expanded role in my position the actual funding for the data analyst income until January 2019. So we've I feel like we've come a really long way since then and you know, you will see you hopefully more fruitful of our efforts after later this year before we talk more about the theory of change and how you're analyzing the data that you're collecting. I'm just reminded on the diversion piece. This is a another city auditor checkpoint that called for the Elation of diversion services and understanding in March all members of the team were trained on diversion poaches and a centralized diversion fund was created in 2018, but the report doesn't provide any information indicating. Navigation team has accessed that fund. Can you talk a little bit about how and if they are accessing diversion funds and reach itself has always had access to Diversion and it did Billy get to do that and the centralized fun came on at the very end of the year. So we are now working with Innocent The Navigators came online. So we're trying to work through Logistics of them being able to provide a diversion Services through that cuz we're already has it. And so many of the other providers that we may work with has access to the centralized fun. The data is self for the entire Continuum change the way it was collecting the data and tracking it within the system. So we just have not been able to really get down into the fine details of where the nap team did diversion yet as the entire system Continuum is Still working with trying to capture the diversion. How comes home? Building changes and some gifted funds were for a part of people who correct and agencies directly for diversion. So there's multiple alarms right now, but the date of assistant Navigator seeing like oh you have a safe place to go in Montana that right. Now that logistical things figured out right now how they do that through the funds that are available. So I'm hearing two different things when I'm hearing that the navigation team does have access to the diversion fun, but We don't we're not able to report on their use of it. And then I thought I just heard you say the opposite of that which is we haven't figured out how to give them access to the diversion fun. So reach themselves have always had accident team months ago. So they themselves got getting trained and getting access to that. So reach is considered part of the navigation team as an Outreach providers for that. So I guess that's where I was talking about. There are two tracks of diversion happening and the reason in the database correct me if I'm wrong that it's hard to report is because in previous the system was calling diversion a program to enroll in now it is What's the change a service access to so you don't have to refer someone to a very specific place to get diversion diversion continuing wide as now being available to every possible provider that were able to what is how many how many cases? The diversion approach illuminated the homelessness situation of a person whether it was somebody moving to Montana because they had family there and they just needed the money to get there. Do we have any numbers in Continuum while we are working with King County's valuation team to look at the entire system of those that utilize diversion and where they come back into the system or not. Are you looking forward to for navigation team specific or general but not working and it's not just limited to the navigation team in general. How much does that help? The reason I'm asking is this I mean, we we want we want to make sure that every Ausable Avenue is presented to people because clearly people face different situations. Yes. I want to know the numbers door regardless because I don't want us to love ourselves in into feeling that okay, we're providing the Virgin River range of motion paper. I mean, I'm not putting you in general and I feel like well without any numbers because I don't want to go around shouting one thing over another especially in light of the statists the overwhelming statistics on the other side, which is the rising rent is also causing writing homelessness. So I'm not sure how much of that can be dealt with in that way, but it would be useful to have some numbers of some kind to have some mandolin and happy to send your office the 2018 numbers and the outcomes for diversion and again it is it is definitely just one strategy that works for some folks. So happy to So I think this the last Light and then if you have any other questions is the underlined language on the sheet at sites be cleaned. Is that the change in the in the theory of change? It's always at site to be clean. It's always we never we didn't call it out specifically enough before it wasn't it didn't say at size to be cleaned. It was just navigation team work. And so we try to make a very specific to what's different. The words. Yeah, those words very specifically have not been in the other kind of of what the goal of the navigation team was ever questions on there. So just the last Slide the cute supervisor report had nine checkpoints and compass in a 23-page report with supporting documents. So we just pulled out highlights of work report it in the queue to Proviso. And so that's what you see on this last lied. So I guess I'll pause and see if there are questions about that. I would just love it. If you also serve touched upon the other part of this report is we've agreed to combine the audit checkpoint reporting with the Proviso report the data reporting. Can we go through some of the highlights? They are as well. I think there's some good news. Pacific ones you want to I think I think highlighting the the ones where you've made some significant progress I think is a good place to start. I think one of the things I wanted to highlight is the auditor definitely kind of talked about the data collection processes in the storage of the data and Analysis of it and the support of the Alice that were provided. We are making some pretty big improvements to the navigation app, which is our data storage tool collections were able to implement right away for not using perceived race and gender gender identity. But instead making sure that we only collect that's a told us collecting reasons for shelter refusals. So all of that has been definitely think that the auditor had wanted to see and that is fully kind of moving along now. I'm having better data around shelter vacancies and availability of the day of that is going to be able to attend to the navigation at 2. So we've made some big strides with the added capacity and our data and I just want to add and I say this every time I sit at the table just because of my previous work. Criminal justice, I want to just stay how good it is to see that there are the group of police officers who put themselves willingly through trauma-informed care undoing institutional racism who care about folks that are unsheltered as much as the Outreach workers that are out there. And so I think that that's a tremendous. That's a tremendous highlight and you have made it says we'll make trauma-informed care assessments and we're training is mandatory for all lab team Outreach workers field coordinators and their supervisors. Does that include the police white but it was actually scheduled and everyone but it is mandatory and then one of the other items that we've talked about that I'm looking forward to ongoing conversations is how We can Implement some of the principles that are part of a sort of an emergency pipe response to. To the work that you do and it's I'm trying to remember what ICS stands for. And we're all drawing a blank incident command system. Yes. Thank you Mom and that there are particular operational protocols that are used and we're going to continue having a conversation about how you're not to move your work over to the EEOC, but how to integrate those principles into the into the work that you do and then finally in addition to the Staffing assessment we're talkin with executive about the resources that are available on the part of independent third parties to do an outside evaluation of the work and make recommendations for again how we can have Fidelity to to our theory of change for people and space. And then lastly I just want to make mention that I have a pretty long standing at this point request from from April as it relates to the pilot and the purple bag pilot. I've asked several times whether or not that pilot could be from from from hsd's perspective operationally not from a funding perspective and spu's capacity, but I would like to know whether or not there are barriers limiting the the nav team's ability to deliver the purple bags in those locations that are not necessarily scheduled for immediate removals because they're obstructions, but in those locations that you're going into that Large accumulations of garbage and that that's the reason why it's rising to the top. I think I can work with spu on the operational side of expanding the pilot in the funding necessary. But what I want to know is is it are there any internal barriers to the NAB team? I'm acting as a sort of the deliverer of those bags into that. Thank you. I've no further questions really appreciate the tough work that you guys are doing out in the field and the work that you're doing responding to our inquiries on an ongoing basis. Thanks for your continued patience. Absolutely. It is 10:52 a.m.", "end_time": 4398.4}]}