{"format": "raw", "annotations": [], "confidence": 0.9367117440700531, "data": [{"start_time": 0, "text": "Good morning. Everyone. Today is Thursday, May 16th. 2019 will come to order it is on the Committee Member bagshot and councilmember horrible customer Juarez is excused for today. And we appreciate all of them if they're not here today. So we'll go pretty fast. We have counseled reappointment of Ali Abdul the late to the labor Standards Commission the appointments of Jillian, and a to the Capitol Hill housing Improvement coalition to reappointment in one appointment to the housing Levy oversight committee and a briefing on Fort Lawton rezoning administrative. And I think this is going to be a very heavy meeting focus on housing focus on housing and health issues when you don't have a home it's hard to be healthy. We focus on labor issues and when Don't have a job. It's hard to be able to afford a healthy home and we focus on energy to make sure that everyone has the ability to turn their lights on and on that there was able to afford it as well. So that's what we focus on here at the housing Health Energy and workers rights committee. I did that explanation for our new friends who are in the audience. I want to welcome everyone who is here from people Elementary School 5th graders for being a huge round of applause for everything you're doing today. I understand that you're here looking at the three branches of government. And what are the three branches of government? legislative judicial thank you so much for being here and you're a student or anybody else who's here would like to come up and sign up for public testimony will have the chance to hear from all of you who like to say something. You'll see a little clock up here. So you have within 2 minutes to say your words and will let you speak into the microphone and then you will say your name and what you're here to share with us. Thank you for being part of this legislative branch in our legislative Chambers here today. I'm one of nine legislative members and I represent the entire city is so that's all seven hundred and twenty five thousand people here in our city. If you think about this legislative branch compared to the DC legislative branch, I represent about the same amount of people as the Congressional members. Do you folks know who? Congressional member here is in Seattle for Sunset is in the House of Representatives. Yes, she's here in Seattle anybody else? Go ahead and go to the microphone. Oh good. We're really excited to have you. Thank you so much as Aaron house. She's our legislative aide who works on I'm housing Transportation energy all of these things that make it possible for us to live in the city that we work and study. So why don't you go ahead and get started? Okay. But we are excited to have you let's hear from the friends add the Master Builders Association Alicia Ruiz. You're welcome to come to the microphone. Thank you so much for being here today. My name is Alisha Marie's today representing the Master Builders Association and enthusiastically support the rezoning in Fort Lawton. Thank you. Thank you so much. We're really excited to have Fort Lawton in our community and her folks in the viewing audience. We do have agendas at the front of the table to you're welcome to grab some of those on the next person that we have to speak is Simon Rosenthal Rosenthal. hifiman Hi, I'm starving and I'm in 5th grade. I think that homelessness is too big a problem in Seattle. I think that many people have problems that cause them to become homeless that could be helped with some of the money going towards encampments when there are not enough authorized encampments for homeless people in Seattle instead. I think that there should be more Apartments. So homeless people can have housing before dealing with other problems also, they could get an amount of time where their housing is paid for so they can focus on getting a job. Unauthorized and can't miss people could go to them and help them with their individual problems and get them into housing. These are my solutions to homelessness. Thank you for your time. Thank you so much time and I agree with you 100% next we have tea on leaf. Hello, my name is. LOL council members. My name is Tia and I'm in 5th grade. I am here to talk about homelessness, which is a issue. I think one solution to homelessness SUV instead of building more buildings. I think we are we could build shelters or apartments that homeless people could live in I care about this issue because I passed by a homeless people about every day, and I feel bad for the front them my parents don't give money to homeless people, but in my heart I want to give money to them or help them in some way, but by talking to you, I have a chance to help them or at least I help make it better for them to live. I hope you I hope you still keep thinking about this issue. But thank you all for coming and talking and taking time off your schedule to be here. Thank you so much. Damn. The folks were going now by councilmember herbold councilmember Lisa herbold represents the Southwest which is West Seattle. You can see it right here through these windows and she's an alternate to this committee. So when somebody can't be here she comes and we works together a lot on human rights and labor issues. And the next step is Angelina Zoo. Hello, my name is Angelina zoo. And I'm in 5th grade. I'm here to talk about homelessness in Seattle. I think one solution to homelessness could be lowering housing prices and having empty business space be used for for homeless. I care about this issue because there are so many homeless in Seattle. I heard that Seattle's in top 10 cities with most homeless, that's not a good sign of people want to come to our city then we'll see so many homeless what they want to live here and there are so many youth homelessness in the city and some people don't care about how children are those live on the streets? This is why I'm speaking to you about this issue because I can thank you. Thank you so much. next next week Carmelo Jordans Hi, my name is Carmelo recently. The homeless population has been growing. I think there's a solution for this problem is instead of making so many buildings use that space for authorizing cabinets or make more Apartments. I care about this problem because almost every day pass homeless. I think do they have a place to go and most of the time the answer is no, so if there's any more otherwise encampments or more Apartments, Stoney to wherever they're going to sleep. Thank you. Thank you so much. Susanna Chan Hi, my name is Susannah. I'm 11 years old. I got a Maple Elementary School. I'm in 5th grade. I'm very excited to be able to meet you for the first time. I'm here to talk about homelessness. There are more homeless out there every day. We need to help them. There's more everyday filling the streets of Seattle. I mean solutions that will work. I have Solutions my solution is how instead of building more building we should use those spaces to build apartments or third eyes and cameras for homeless. We should build it around town where the stores are, still have jobs. They walk many hours and Miles just to get to a place they get very tired everyday for walking so long Anita R Us. Another solution is at 2 not sleep until home has find another place to stay if we sweep in 24 hours how much will even looser original belongings while we sleep the more stuff homeless lose if we are going to sleep then give them at least two to three days 24 hours isn't enough time. The thing I worry about the most is about the kids that are homeless some of the kids are there. They try to survive being homeless, but at the same time you're trying to get good grades in school. We really need to stop the population of homeless. Thank you. Thank you so much. Anthony Santiago welcome Hi, my name is Anthony recently homelessness has been becoming a huge problem Seattle hundreds and hundreds of people are gay homeless everyday whenever did they lose your job or take drugs and drink alcohol? Fortunately, I saw a Sound Solutions to the huge problem one solution to this problem is to have authorized encampments for groups of homeless people. The reason I prefer authorized encampments much better than shelters is because shelters don't have privacy space where people to put their luggage and no privacy. We sometimes need some time alone even homeless people under the solution is to have leftover building star used Morphin apartments for homeless people. For example, Amazon has has been planning to give an office for homeless people of using this office is to make half of the office of the place for homeless. Able to live in the other half of plays to four as a workspace some people like the idea building apartments on top of stores and other workplace idea to do we don't do anything to help homeless people would get out of the homeless people to get out of the streets will never get to do stuff. We ever want to do like having the Olympics in Seattle. Thank you. Thank you. I'm sure as my name Teresa. Hi, Theresa. Welcome. I saw mine without an H. But you have an age so people will know the difference between us now. Go ahead Theresa. My name is Theresa. I'm in 5th grade elementary or talk to you about homelessness their encampments in the city for homeless people in the police. Tell them that they have to be out by 24 hours somewhere else. Having one solution to homelessness could be that the city is almost people place to stay late to go to their job and he showers and pizza fries and a cancer can fresh close to get money and they can buy their own house and they will have to stay there and watch some neighborhood enchantments. They're probably houses. and you got it. send you have to leave there and they have to good job, They don't have a place to go. That's right. Thank you so much Teresa. You did a great job. The next person we have is Josie. Hi, Josie. Hi, my name is Justin Bieber. I want to see navigate to talk about the homeless issue. I think I should be more soup kitchens and more resources for homeless people and I think they should not be any more sleep to for homelessness. Thank you so much. Josie pajamas. The last person we have is Tanya Leroy. Hi, my name is Tanya Leroy, and I am a maple parents and there's a lot of suggestions about housing for homelessness. My concern is the housing inequality, I guess in Seattle their Spanish director eyes with homelessness with ranch prices, they directly correlates and if we somehow bridge the gap of people who lose their rent, I become homeless as they wind up on the street and have no income. They somehow need the resources to develop to be at we can give him a home, but they still need to be able to earn $150,000 a year in our work in order to live in Seattle. So some kind of bridge needs to be made to tend to that to really eradicate homelessness in Seattle. Absolutely. Thank you so much. Was there anybody else who wanted to testify today? That didn't get a chance to sign up? teacher Marcia. Welcome to Jumanji Avenger Safety Council Members. I'm just I feel so blessed to be their teacher. I think that they have some really great solutions that just come from common sense and and I hope that we can listen to this next-generation cuz they have some really really great ideas. But thank you both so much for your work on Council and plus your service to our government. Thank you so much for all of you as well. So I want to thank you for being here. I know you took time out of your class schedule to come here today. I want to thank councilmember sawant and Ted who's in the back. Thank you so much for arranging to have folks on issues here. We divide them up in the various committees. As you may have seen a council members want works on issues related to homelessness and in our committee we work on issues related to housing health and workers rights, as you heard House member herbold works on issues could wear that kind of development utilities an art of pressing issues in the city as you can tell him there's only nine of us Everything You Said Today is 100% accurate and many of these ideas that you've talked about our things that we would want to put into moss and we will keep working to change the law. So that we can actually have more housing you takes about two or three sometimes four to five years to create a actual home the door the roof the building that we want to move folks into and then want to provide them with a counselor and other support services. Does that they have health care as well? In the meantime, you're right we have to do more to make sure that people aren't sleeping outside so that there's not families and children and workers who are sleeping outdoors. And you're right. Somebody said earlier. I think it was Anthony. You said sometimes people just need a little known space and going to a shelter doesn't give you that alone space. So we're going to keep working to make sure everybody has their own place to call home whether it's in a tiny house so that they can get into a larger house later or making sure people have the enhanced shelters that they need. Some people have lockers and bathrooms in a bed to call their own right now. We have only six bathrooms in the entire city for people to use if they're sleeping out. The United Nations, you know the United Nations that looks like human rights across the entire glow. They said that you need one bathroom for every 20 people that would mean we need 220 for bathrooms and we only have six here in Seattle. So we got a lot of work to do to make sure that there's bathrooms and showers and and counselors and Healthcare and with your help and good ideas today. I think we're on our way to him to make some progress, but it's going to take a lot of us working together cuz we need that Revenue to the resources that you talked about to make it possible. So huge round of applause for everything you're doing. I hope the whole city heard you this morning so much. Teacher Marcia if we hear can we take a quick photos Aaron? Are you here? Okay, guys come up here real quick will talk to the diet. Hey, do you want to? Oh, come on parents Hi, how are you? And one shoulder lean and was once home. Thanks for coming and talking to us. Alright so much for being here today and agenda item. Aaron McQuaid move on to the first item of business. If you can at this time, let's have our labor standards advisory commission reappointment to the table if we can have all join us if you're here. Okay. I don't want to come up and say anything. She's not here. Either. When we move to and please join the table by Stephanie and Kelly said the grace and anybody else is here high on this topic. Appointment number 01313. I think the microphone might not be on for you. Try that again appointments number 0 1 3 1 3 0 1 3 1 4 and 0 1 3 1/2 members of the housing Levy oversight committee. Wonderful. Hi, guys. Thank you so much for joining us. If you want to do a quick introduction overview. We're really excited to have folks coming forward to be part of this body really said about the reappointment and the appointments to the housing Levy Levy oversight committee and perdita. When are we do quick overview? And then let's hear what you guys went up to that something. So I'm stuck in Alaska with the office of Housing and I'm going to do just a little overview of that housing Levy oversight committee. And then I see said we have to re appointments and I'm joined here with Kelly Larson who will be a new appointment. I'm so the housing Levy oversight committee is made up of 13 members whose mission is to monitor progress of the housing Levy programs. And then also review and provide recommendations on our housing funding policies and the housing Levy administrative and financial plan what you'll actually here about a little bit later in the agenda. And it's made up of folks from a range of fields within the house and community. So we've got a funders affordable housing providers Architects developers residents who runs the gamut and you'll see that here in our reappointment. So I'll go ahead and start here with an Malone who's a reappointment through the term of 12:31 2021. So am alone is a business development officer for affordable housing investments at US Bank Corp where she's responsible for originating low income housing tax credit investments in the North West End Rocky Mountain States. She's been with US Bank since 2005 previously serving as a relationship manager in the bank's commercial real estate division where she originated under Road and manage a more than 250 million dollar affordable housing portfolio. I am alone also serves on the board of directors for compact capital and holds an MBA from the Foster School of Business at the University of Washington and a ba from Western Washington from Washington University in St. Louis. So that is a our first reappointment. Appointment is pradeep. And she is also that's also be will be for a term for to 1231 2021. So pretty it is the executive director of interim Community Development Association a community-based organization in the Chinatown International District. The organization's mission is to advance social justice and equity for Asian Pacific Islanders immigrants refugees and low-income individuals. Pradipta leads intrams work in Housing Community Development leadership development and social services and is active in the community and currently co-chairs the CID Community stabilization work group focused on sustaining portable housing small businesses and service organizations in the community. So I do have heard already. We've got to kind of pretty diverse perspectives represented their on the housing Levy oversight committee. And so we are very excited to bring forward a new appointment of Kelli Larson today and Kelly is represents the permanent Supportive Housing and homelessness perspective and read a little bit about your background and then give her a chance to talk if she'd like to sew Kelly Larson is the chief program officer for Plymouth Housing where she oversees Services provided to Plymouth residents and leads policy program development and strategic planning initiatives. Kelly has participated in numerous Seattle King County and all home homeless planning and policy efforts bring expertise related to operations of permanent Supportive Housing and the support services needs of chronically homeless adults. Prior to joining Plymouth Housing and she worked as a King County program manager with a focus on funding coordination policy and planning and oversight of permanent Supportive Housing contracts. Kelly has a master of public administration degree from the University of Washington and his work for organizations dedicated to international human rights immigrant rights and labor rights. Welcome. Thank you so much for being here Kelly you and tell us a little bit more about yourself and why you're interested in serving. Yes. I'm looking forward to this. I believe housing is a human right? The housing Levy is so critical. I've been involved in this community for over a decade. I'm inspired by my family who immigrated just up the hill from Japan and their experience in this country. And that is what drives me to be doing the work of social justice in my career. I believe the cause that Plymouth is engaged in any homelessness is one of most important causes of the sit this city faces and I just believe are the solution are intervention of Supportive Housing is one of the most effective impactful ways to help people who are most vulnerable in our city, so that is my lens and perspective that I bring to the housing Levy oversight committee, and I'm really fortunate to work with you is amazing staff people at the office of Housing and my fellow committee members. Thank you. Thank you. You for your willingness to serve as well as all that you've done in the housing realm over many many years and just shout out to Plymouth great great piece in the times about the Supportive Housing projects that you or bring it on online and specifically The Genius of leveraging the funding from Health Providers, and their interest of there are shared self interest in ensuring that folks who need permit Supportive Housing and other Weiser are using up Health Services in our hospitals that there's a strong interest in getting those folks into into permanent Health signs of a really excited about those projects and thank you for all that you had to do. Thank you. It's very exciting. Do you have any thoughts about what some of the biggest challenges you think the housing Levy oversight committee will face in the near-term. We hear a lot about the operation and maintenance dollars both drying up and not being sufficient and that's one big challenge. I know obviously we have the challenge of not enough Revenue to build as much as it housing as we want for some of the big challenges that you're interested in tackling on the committee. Those are two of my top three. My third is a dog and focus on zero to 30% area median income the lowest income bracket the most vulnerable people in our community at Plymouth. The average income of our tenants is 11% Ami, so there is a huge need for housing for that group of people that are between 0 and 15 and that really should be the work that the housing Levy is focused on with the need of course of the income tranches. But hey Sally council member back Shaw. We just wanted to show it to each other in the neighborhood all the time. So yes continue to find more resources for that income triage 0 to 30% Emi and dedicating space for operating maintenance, which is critical a really really important part of it and we could also build more housing we can do 0 to 18 months or in the ground and up with the building. It's the all the time to get all the resources together. So we get more resources we can build faster. We have the o&m we can actually make these buildings work long-term. Well, thank you so much. Thank you for joining us customer bagshot. Thank you any other comments or questions? Okay. We're really excited about this as you can tell Kelly has a long time commitment and engagement with the housing and housing as a human rights committee. I should say principal in District 4 And and is a Mero appointment resides in District 3. So we have some really excellent local knowledge that will be added to the housing Levy oversight committee. If there's no more comments or questions, I'd like to move the committee recommend confirmation of Ann Malone. If I die as a member of the housing Levy oversight committee, we will move forward this recommendation to the May 20th full council meeting nice to see So, I apologize for the change in the schedule. Let's go back to agenda item number one. If we could please be joined at the table by Aaliyah Abdul and if you would like to read agenda item number one into the record agenda item number one appointment 01186 appointment of Alia Abboud as member of the labor standards advisory commission agenda item number to PLS and if we could also be joined at the table by Kenny Pittman and Gillian Conn. Agenda item number to appointment 01282 appointment of Jillian Cronauer as member of the Capitol Hill housing Improvement program governing Council. Hi, Julian, how are you? Good to see her. Thank you and Kenny once you come on up here and welcome. Thank you guys. If you want us to start with introductions from this way down and we'll have to do some introductory comments that said before we get started. I just your name for the record but Jill Cronauer Cronauer. I'm Sarah she make I work at Capitol Hill housing where Jill is hopefully about to be a board member. Can you put an office in a government relations? Okay, wonderful. So we're here to talk about the Capitol Hill housing Improvement project appointment and Candy. Do you want to get us started here to 2% Is this joke an hour to the board for confirmation as an appointee to the Capitol Hill housing. She is currently the Chief Operating Officer for Hunter Capital with specializes in preserving in historic buildings. And they have a very large footprint in the Capitol Hill First Hill neighborhoods and she brings a lot of experience. I've been doing that since 2008 and it one time and maybe still is the president and chairperson of the Capitol Hill Chamber of Commerce and brings a lot of experience to the board and with came highly highly recommended. Excellent. Thank you. Do you have any comments about Capitol Hill housing before we go into Jill's remarks just a little bit more background knowledge. We own and manage 49 buildings across the city of Seattle and we provide affordable Housing and Community Development as well and are affordable units offer. We have a range of affordability. We have some subsidized buildings 30% all the way up to 80% Welcome. Thank you so much for being here jail until the living more about yourself and why you're interested in serving on the Capitol Hill housing Improvement project. I've been working in Capitol Hill for almost 11 years now and through that time have worked with Capitol Hill housing on and off through different Community initiatives. They've always been a great Community partner. We office in Capitol Hill in and have nine properties on Capital as well. I hope to help bring some knowledge and support through Property Management development and also budgeting and more.. Any questions. Thank you for doing that work. Excellent. Okay, great. I will really excited about your appointment and very excited to continue working in partnership with our folks at Capitol Hill housing. Are there any big challenges that you also want to talk about? That you are looking forward to tackling with this appointment has a really impressive daunting Pipeline. And so kind of just helping, you know, get our arms around, you know, making sure that were set up for success. Great Cummins, but in spite of that pipeline. I want to thank you for your ongoing commitment. It is a filling the community's interests as well as this council's interest in ensuring that we move forward in building some senior housing for Elgin TQ. Can I know it's been sort of fits and starts and getting it going, but I'm really pleased to know that it's moving forward. We cannot be a major city without housing for this population any longer. So thank you so much. I completely agree any other comments with our work around age friendly Seattle. So thank you for doing that. What are some other comments I'd like to move that the committee recommend the confirmation of Jillian. Cronauer Cronauer, thank you. As a member of the Capitol Hill housing Improvement program public Development Authority. We will move your recommendation to the full council meeting on May 20th to not required to be there. You're welcome to be there, but we will speak highly of you and the work that you all do. I very excited to have you and thank you for waiting this morning as we got through the kiddos as well. I was enjoyable Yahoo is a appointment. So there's no need for her to be here today. But just so that you folks know. This is a appointment to the labor standards advisory commission and is a council reappointment currently living in North Admiral District 1 Elliott is the owner of Quick Service restaurant where she oversees the team of that 137 +. Aaliyah has worked very hard to provide her employees with educational opportunities and the safe and welcoming workplace for everyone. She is very active in the community and volunteers for the school district and the national Helping Hands. This will be only his second term serving on the commission any of anybody want to make any comment with with Aaliyah. She is labor standards advisory committee appointment that I put forward at the beginning of the creation of of L sac and really enjoy both her perspective from development and economic development Focus, but also really caring deeply about her work force and going above and beyond. Set the minimum requirements in that has has really I think helped driven the conversation forward about what it means to be a high road employer. Excellent. Thank you. I didn't realize that you are with the original know nominated or would you like to move her appointment? Thank you. I would like to move appointment of Alia up due to the appointment. I will second that all those in favor for this of every appointment on Monday if she is listening to her and we will speak highly of her as well. So thank you Leah for your continued commitment to the labor standards advisory commission and while she's doing that. Please join us at the table and we will go ahead with introductions in just a moment. Agenda item 6 and 7 cd one 19510 and Ordnance related to land-use and zoning and resolution 31887 a resolution adopting and approving an application for Surplus Federal property at Fort Lawton. Welcome guys, thank you so much for being here before we get started introductions and Trace if you want to lead us down to Kenny and then I'll make a few comments Tracy Chapman Avenue Seattle Parks and Recreation station that we have had in this committee to create 238 new affordable homes along with ample parks and open space on the former for Lawton site, including an initial initial overview of the plan of the office of housing on April 16th. And you so much Emily did not get a chance to say thank you to marry them before her leave of absence and if she is watching from vacation or somewhere sunny, Team that has put together has been an integral part of making this housing come online that we were able to celebrate and highlight and our last few committees. So thanks for all of her work. Please do pass on our appreciation for her tenure here and for all that she'll hopefully continue to do on housing an affordable issues on that, but also Emily, thank you for your leadership on this we talked about here. Just the three meetings that you've come. We didn't talk about the 14 years prior to that and I don't know how many meetings if you start not just Community, but how many that we have had here somewhere in the city council chambers, it's extraordinary and I'm really glad that we held the course and then we've gotten where we are and working with the school district for their 6 acres for the active probably feels that they're going to be building at some point. But thank you so 14 to 15 years that you guys have all been working on the so thank you so much. And so today we're looking forward to having a little bit more of a comprehensive overview with a reminder that we do have a public hearing on the Redevelopment plan and resume legislation on Tuesday, May 21st at 5:30 will be right here in council chambers. We want to remind people that childcare will be provided. So bring your kiddos and the discussion and possible vote on the Redevelopment plan will be on June 6th here in the housing Health Energy and workers rights committee. So, what's that? Okay, so this is a light presentation in terms of slides because I think the primary focus was to answer questions that folks have raised council members have pointed to in the previous meetings particularly around some of the parks and open space component the Seattle Public Schools component as well as some questions around future infrastructure and planning needs around transportation and other and other infrastructure purposes. So as a reminder, I'm not going to linger on this slide. This is a vision to provide as you said up to 238 affordable homes arrange of permanent Supportive Housing housing for Louis working people and permanently affordable home ownership for low-income households on approximately 9 to 10 acres and then parks and park related uses that include approximately 13 acres for Passive Recreation. Active open space on approximately 526 acres and been a maintenance building and if you have questions about the maintenance building we can pause now or I can just keep moving. Okay? Seattle Public Schools component on during as we had mentioned when Fred podesta was here at our last presentation during the S. We had a significant amount of comments from the public of having an interest in creating educational uses out as part of this Fort Lawton Redevelopment plan. And so the opportunity to use an active multi-purpose fields and the Seattle public schools and city of Seattle share an interest in providing multi-purpose athletic space. It is an e that's identified by us and it is an educational need that's identified by the school district. So what this plan does is it allows for the opportunity for Seattle Public Schools to submit an application for the purposes of a conveyance for approximately 5 to 2. Takers that they would use to create those multi-purpose athletic fields and accompanying this Redevelopment plan. An application is an ordinance and an mou you between SPS Seattle public schools and the city of Seattle that would outline what's some of the roles responsibilities and timeline would be relative to that Arrangement and a few things to highlight in this case. The Redevelopment plan identifies that the this exists as an opportunity for SPS, but also acknowledges that in the event that SPS chooses not to go ahead with this conveyance that Seattle Parks and Recreation will proceed so that we can ensure the public benefit that has been outlined in this industry development plan that this will likely be the subject of a joint use facilities agreement. These are the agreements that are regularly in place with this Seattle Parks and Recreation. Because as I said, there is a joint need for active Recreation space across the city the memorandum of agreement that we have negotiated with Seattle Public Schools outlines even more specific details, and it says that they have the right to submit an application to the federal government the Department of Education specifically for the five to six acres for educational uses. The district will decide for the terms of this agreement whether or not they want to go ahead with that acquisition based on the terms that are approved by the Department of Education as in some of the other conveniences. There is a chance that the discount is not a full disk. It could be an up to 100% depending on the approach that's taken by Seattle Public Schools. So if they are not interested in the terms that are provided by the federal government. Which would call on them to provide more resources than they might otherwise want to based on the appraised value of the land. They may choose not to participate in this deal and this memorandum gives them the exclusive authority to be able to make that determination financial responsibilities are outlined in this memorandum of agreement particularly for the purposes of pre-development in caretaker cost. So as you all know the federal government has this has taken a long time and I'm one of the ways in which we maintain our good standing with the federal government is by virtue of a lease agreement that sets out responsibilities that we need to accomplish in order with them on this property and part of that is paying for costs associated with the present infrastructure Safety and Security at the site and so this Memorandum acknowledges that SPS is responsible for a quarter of some portion of those pre-development in caretaker costs up to an outlined amount of $249,000 is set because this MOA will be supported by the superintendent and then upon their trip the application. Should they choose to go ahead with the conveyance? They will then take board action in order to accept the acquisition of the site and at that point the board action could allow for an increase in proportional pre-development and caretaker costs attributed to the Seattle Public Schools. If the district elects not to acquire the property as I said previously this mou create MLA creates even more explicit understanding of the timeline by which they need to make their determination so that we can ensure that our Parks and Recreation Department can go ahead and have the outcome of multi-purpose athletic fields at the site. The ordinance that is submitted along with this memorandum outlines that the Department's and the Seattle Public Schools can go ahead and enter into an MLA substantially similar to the one that's presented to and hopefully supported in adopted by you all. And that legislation will be transmitted. We think of the next couple of weeks. So we'll have it in time for the June 6th action by the committee timelines for Action by the school district. So this is not going to be here. You got you got to take forever to submit your application forever to develop there are specific time line by which they have to perform those different functions, which I think is good opportunity if they choose not to to to step in and in the absence of them decided to move forward before then mayor Burgess was before he left one of the things that he did and November of that year 2017 was to sign an agreement that of the school board president Leslie hear a signed also and it had multiple things that the school district was going to do and it sounds like we're stepping up here. And they're stepping up with them around that 6 Acres but there was some other things and that agreement and I'm wondering whether or not we're still discussing those elements. I'm not in a position to to talk about. I am not on the front lines of the negotiations more broadly with Seattle Public Schools about satisfying the terms of that Emma way, but understands that for the purposes of this specific Li night, we've reached an agreement both of us both Seattle public schools and our side are the executives feel that this both satisfied that agreement a good opportunity to get back to you on that for a while and I know Emily this is not this is not in your bailiwick. However, I think there was a sense within the city anyway that we had agreed to multiple part and carving out one part and saying we're going to do that, but then the other parts are not addressed. I think it's of concerned. So I'd like and I think Marshall Fosters working on this and I know Fred protest in his new Is as well, so I just would like to flag that I think it's still important for us to go back and look at the terms of the agreement that we signed in November of 2017. Make sure that that is all moving forward. I want to be your lifeline. I'm so we talked about in the last presentation the various components of the plan and the application to the federal government. And then there is a technical process by which we would go ahead after adoption of the plan by the city and Adoption of the plan by the federal government that we would proceed with actual applications for conveyances. And that is a complicated process. I wanted to be clear that all of the descriptions of acreage that we've used for the purposes of presentation will be corroborated by virtue of a survey and an appraisal of the site that will be done prior to the conveyance process. The lease agreement stipulates that we will request for the Acquisitions will submit our request for Acquisitions to the Army by January 1st 2020. That's a deadline in the least and Does conveyance has will be several they'll include the component for homeless and Supportive Housing that will come from HUD. They'll be a negotiated sale and that means we'll be paying market value being really clear about that for the purposes of the affordable rental housing. That's not a technical eligible conveyance. But we believe that it's really important increase diverse and supportive Community. I'm the public conveyance for Habitat for Humanity for the purposes of self-help homeownership would come through the US Department of Hud again on the public conveyance to the US Interior Department for the Parks and Recreation uses including the passive park space and the maintenance building for the opportunity for the Seattle public school. It would be a conveyance through the Department of Education that they'll be seeking and in the event that it's not it will go through the department. Interior to satisfy it for Seattle Parks and Recreation and then also important to note that presently the mean right of way running throughout. The Redevelopment area is a private right of way is owned by the federal government Texas way and so will also have a public conveyance for the purposes of turning that into a public right-of-way. And that concludes my presentation lovely. Okay, great. So that the goal for today is for us to really Identify some of the issue areas that have come up in both presentations before meetings many of us have been part of the community discussions over the last few years longer on this issue issues that I heard about in community and then also was discussed on the Seattle channel was the desire to sort of right size or reduce the size of the parking lots for the park maintenance facility and desire to try to reduce the foot friends of a surface parking lots. It does it did seem to resonate a little bit. And so we do have a ship here from the office of from the Department of Parks and Recreation looking forward to hearing that sort of your analysis on Reduce the size of the surface level parking are surface parking lot so that we can create more park space and ideally more areas for natural habitat. Thanks for being here. So your right is a big is a big parking lot. I don't think anyone would just agree that it's a lot of Paving out there. And so we did look at so the intent of the department has to move our Central West crew there with Associated equipment trucks and materials. And so we looked at other facilities that had the same level of service and we feel very confident that we can reduce the parking area by about 30% 30% is about an acre. I think there's about three acres of parking there including the building is about 3 acres and it it it seems like we can take about third off and what that would look like we think it would look like taking the you know, the northern hundred feet and kind of Corporate in that turn that green incorporated into the hillside above obviously we need to make sure that vehicle circulation and drainage all works. But that is the intent. Can I just ask a question? Skip to the hundred feet off the pavement you plant what native trees are consistent with what's already there or do we know I don't know why we haven't got that far in discussions. I think the community wants Greenery and I would assume that would be tearing up the pavement and and planting consistent with what is already in the hillside to the to the north that I don't we have I don't know exactly what we'd be planting their habitat is that this would be an additional place for the Blue Heron to be able to travel through and live in so I assumed that it would be trying to every populated with natural habitat and crate them space does that's correct. So, I mean the the whole Qantas Ravine and parts of this part of Fort Lawton are identified as Heron habitat, even though the heron Have since moved to Commodore park that is all is all part of the Heron habitat and they're so yes, we would be planted it natively so that we reach out to our friends with Aaron habitat group make sure that they're included as we're moving forward about what they would recommend that we plant so that they've have some input and I think simultaneously that there is quite an organization round bird watching in Discovery Park. I'd like to invite them also to provide us with their recommendation. So if I can just ask we do work with her and help her quite a bit. So I'll make sure they're involved but you're right. There's a big burning population Burger population. I raised we do take those issues seriously, and we do try to find remedies for them in this happens to be something that's near and dear to my heart trying to remove a surface level parking spaces where it's not needed. I think this is a great example. I want to give our Council, He's a heads-up that as we get closer to amending both the bill and attachment you putting forward a Amendment 4 section 5.2.4, which is the park Maintenance building to at acknowledge that Seattle Parks and Recreation has analyzed the feasibility of reducing the parking area. And the addition would be based on usage requirements at other similar facilities. As you heard at Seattle Parks and Recreation has determined that it can reduce the parking area by approximately 30% The intent is to convert the northern approximately a hundred a hundred feet of the parking lot to open space, but the exact configuration will be determined by the Elation and drainage constrain. That out and we should also maybe potentially add in consultation or an in discussions with our Community Partners as well have been working on this issue. I'm sure you will buy this just specify here. No, we're sending love and we really want to hear what the recommendations are. Okay for a folks from Ms. And Metro can be here today. But thank you so much for being here from s. Is also a desire to make sure that we're increasing Transit options and serving the future Fort Lawton community and residence and would love to hear more about the process that both s. And Metro will go through to analyze additional Transit needs in the area as we have increased population encouraging books to get out of their cars. I thinking about multi-modal used but not only that especially for our seniors and families who will be living in this area and then wanted to make sure that access to Transit is it is both address head-on and is a important issue and that we're doing is specifically for the population over moving in is in critical. So thanks for being here today and for sharing with us any of the process that you will go through. analyze new Transit needs so. I just want us to be late again. I am a representative of the Department of Transportation not King County Metro. So I will be speaking to what they have in their adopted policies and plans and so are the main document that will be using that Metro uses to guide their service decisions. Is there King County Metro service guidelines, which is a part of their strategic plan and this document outlines how they add reduce and restructure service and guys a lot of their service decisions. They make investment decisions. So they add additional service based on several criteria the first and foremost when they look at is a passenger crowding, so it would rather overcrowded they will add service to meet that demand the second. They look at schedule reliability. So when buses are chronically late, they will try to address that the third criteria that they look at our what are the Target service levels for a corridor. Add to Define that they base it on three criteria productivity, which is a combination of jobs and households. So this project will add household social Equity. So the number of low-income and minority residents along that Corridor and Geographic value what connections does this route provide to Regional centers? So that is where that is the quantitative process that Metro goes through to assign Target service levels looking at the Fort Lawton site. There are two routes that serve it 24 and Route 33, both of those have identified Target service levels in King County Metro service guidelines and their 2018 annual system evaluation report. The Route 24 is identified as a very frequent which would have 15 minutes service in the peak and off-peak. This is a goal that Metro has assigned it is not the current frequency. But what matter does is a compiled list of what they think Should be given the productivity social equity and Geographic value and as research resources are available. They will allocate those to increase service levels on those corridors Route 33 is as a Target service level of frequent which would give it 15 minutes service in the peak and 30 minute service in the off-peak and night. Both of those routes operate generally about every 30 minutes with some increases in the peak. Cramps with both of those targets are increases from today's levels. This is consistent with metros long-range plan, which they defined as Metro connects, which establishes a 2025 and a 2040 Transit service network. Both of these routes are identified in that in the 2025 Network and then there are out. There is an additional route in the 2014 at work. So they have long-term plans to continue to serve the area and to increase Service as resources allow. Great question. Thank you for bringing up the point that they're going to be significant number of seniors in this new development. Is there an opportunity to look at like the access Vans or some of the circulators that could be different than just the 24 in the 33? I'm just would like to ask that we request Metro to take another look at that because it's especially if we've got people that for walking is difficult to have to walk a few blocks to get to the 2433. If we could plan ahead about these the access band type. I'm not saying it's got to be that but something where we've got circulators that come and come ride into Fort Lawton pick people up. And of course by 2035 will have a nice light rail against down to drive us but between now and then we got to figure something else out. I will follow up with them like you the other piece about that is that you know, one of the changes in the Redevelopment plan was moving from having housing for homeless families and really converting it into the psh model for seniors and part of that acknowledgment was the way in which services are delivered is different and the ability to provide really targeted services on site for the population for seniors kind of changes some of the transportation needs for the people living there. It doesn't mean that people won't travel but because many of the services are provided on-site the needs are a little difference in Catholic Housing Services is aware and has done before the fundraising and other opportunities to use Vans to serve populations in their senior buildings. And that's something that we have talked about. So that one of the issues that has come up in the past is grocery stores and the Closest one is the QFC down on dravus and and close to 15th, but it still is a big slap. If you don't if walking isn't easy for you. So it's something I'd really like. This is Catholic Community Services is looking at that we've also talked about having a mobile grocery store and maybe this is an opportunity cuz we talked about it. It it going to Magnuson park with some of the low-income there and maybe this is an opportunity to Pilot something like that, So the Metro service guidelines by which they decide to add additional resources crowding reliability and then the third one correct me if I'm wrong to service frequency Bulls set. Yes, and the you're the one that we're focusing on for purposes of Fort Lawton is the The service frequency goal, right? So that's focused on the frequency of a route. At different times of the day. Correct so might my question about that is are these surface frequency goals based on current use of those routes or is it based on projected future use of the routes sort of both and I'll elaborate. So those three categories that productivity social Equity a geographic value is that first step in the process in which they look at kind of the potential of the route and what writers could be there, and what connections it serves and then they have a second step in which they look at what the current loads are on the route to see if they need additional boosts. And so that second step is an opportunity to increase service levels, even further above and beyond the potential based on current utilization and So within the context of potential was it part of the analysis that this What site would be developed with this density of housing know so the system of equation evaluates this system jobs and households that are in one place or in the Better Built today. So they're all based on the current year. And this is an annual evaluation at Metro does Metro service guidelines also provides guidance on planning for upcoming devel and they do this Citywide. So as things are coming online. They do take that into consideration when they look at service levels and any service decisions they make Any other comments or questions definitely will do I'm just going to go to plug in right now while we're talking about frequency would love to be part of the future conversations as we look at what frequency Transit actually means ideally having a 10 minutes between buses coming as I think a really great way to make sure that people can rely on Transit. I'm no matter when it's coming. I'm very excited to be moving from one area that came every 20 minutes to an hour an area that has best service every 10 minutes and it makes my life a lot easier and I think I'm as we think about people getting to doctor's appointments or it's her there's kiddos schools or to work at making that Transit frequency change soon. Do you know when Metro or S. I will be engaging in Surrey evaluating the frequency measure. Has its own definitions of frequent other with a defined as very frequent is 10 minutes. So through the funding of the Seattle Transportation benefit District 71% of Seattle household actually have access to a 10 minute or better route within a 10 minute walk at their house into the city has really used voter-approved funds to improve frequencies above and beyond. What is establishing Metro service guidelines, Okay, Greg and then I don't know if anybody can speak to this purchase details of the the play field for the schools, but also and Analysis of whether or not new school Services would be needed any comments about what the school district school board will go through in terms of analyzing the need for new school services with the population increase frequency. Their analysis. I don't know if it's annual when they when they look across the city of what schools needs are. I know that for the purposes of the site that the schools are interested in considering this a potential land banking for a potential school at a hypothetical time. And in the event, of course, they would have to do their own environmental analysis and it would be an additional process in a negotiation with the federal government to convert to that use in the meantime. It will be the school's the educational to use on athletic fields, but they are contemplating that as part of their rationale for engagement and this opportunity will come and see you like to make today. Okay. I have a question about a process not a regular member of this committee alternate so we know you're watching every time anyways listening. So this isn't the first time that we've had this specific resolution before husky already. We will have yet another public hearing. This will be the first one for this round on the 21st. And then the final at least at this point proposal is to come into committee on the 6in boat out the resolution and then the result of organs and then the ordinance to adopt them away with SPS. And so I'm as it relates specifically to the resolution. I understand, you know, obviously there's been a lot of negotiations for many many many years and this resolution. Moving forward a plan that has been subject to that negotiation. And I know we don't want to upset the apple cart, but as it seems like this, is there going to be sort of an issue ID section of this of this discussion. This was it and this was the only issue that any other committee members have raised to me. So unless there's something else I didn't hear about the public hearing and I apologize for not being there, but I'm going to be out of state looking at Looking at a retirement system. So it's not like I'm out fulling around not going to be here to listen to the public on this topic. But if people take copious notes and let me know if there's anything that comes up at the next upcoming meeting on the 21st. Thank you. And then I just looking back over at our meeting minutes from before from the April 16th meeting or the May 2nd meeting of the question was if there's any additional Central staff memos are summaries we would want to send those out to cancel again. So we did send out a memo that she'll be getting attached to this agenda actually just before the first committee discussion about the schedule and the contents of the delven plan on so we have to do it as we're talking about this just a reminder for a full Council as well. There is a binder that was created will make sure that that gets recirculator that we paying each office and that Producer that we bring the memo around I will also bring around my tiny Amendment here. And if you do have any other questions, please let us know before the May 21st meeting which is when will have the next public meeting and then as a reminder, we'll have a discussion impossible vote on the June 6th meeting at here at that house on Thursday. Thank you for all of us. I want to say especially thank you chip and to the Department of parks and rec for your quick work on helping us analyze whether or not we could convert part of that parking lot two more natural habitat for our friends who are feathered and otherwise responsive to community concerns that are coming up and seeing this is a real win-win. So we'll see all of you on the 21st. If you're able to come to the public meeting. Otherwise, we will be back here in council chambers on. June 6th for final at work for a possible though. Great. Thank you. Getting Emily Alvarado. I'm always impressed by your presentations and thank you for being here. So articulate about this and you are often the front line for office of housing. I've been at many public meetings where I watch you successfully navigate some people with different opinions. And so I just want to acknowledge that and say thanks. Thank you very much and thanks for being here with all of the answers to the questions that we pepper you with about Metro over which you have no control. I appreciate it. We appreciate being brought into the conversation at this point. I think we're going to go ahead and move into our last item of business and Aaron. If you'd like to read into the record item number 8 regarding the administration and finance plan and we'll be at the table with Emily Stephanie and Tracy again. Thank you guys so much. Agenda item number 8 Seattle Housing Levy administrative and financial plan for years 2019 and 2020. Excellent. Thank you. So I will come against you guys want to record and then I'll have a few of them comments as well. So we're very excited to have this conversation. I'm coming up with something that I've been looking forward to for over a year. Now as we've talked about opportunities for us to have true truly Community oriented development be the first and foremost thing that we think of when we create new housing opportunities has updated every two years and this is an opportunity for us to recalibrate how we administer the city's affordable housing dollars based on the housing needs of both the community and the future residents. This proposal is a plan for 2019 and 2024 office of housing program. Displaying relates the office of housing Levy funds incentive zoning payments mandatory housing affordability of humans as well as other funding sources that the city of ministers for the creation of affordable housing. So this is truly our kind of moral compass for how we will use all of our housing dollars a few notes on the timeline after today's briefing in discussion will have a briefing and discussion of potential amendments at the June 6th meeting will also have on June 10th the final housing Hills Energy and workers rights committee discussion and possible vote and then potential for full Council vote. Either that day or on June 17th as well. So we have three future meetings potentially plan for this. Our office has heard a great deal about the desire to make sure that they're include their voice in the area of plan making sure that organizations rooted in and led by communities mostly impacted by housing unaffordability and displacement have truly a seat at the table. Let their voices and words are reflected in the plan as we move forward. Some of those priorities are going to be reflected in our conversations today and today's update the first being supporting community-driven displacement and harmonizing. I'm sorry. I let me say that again supporting Community Driven development and harmonizing. This policy was Surplus land disposition policy that we passed last year in our committee on prioritizes community-driven projects for city-owned Surplus land. So let me see that really briefly again last year. We said that public land that is so blasted is underutilized should be prioritized for affordable housing and the community said absolutely we support that. However, we are struggling to get the resources that we need to be able to actually build on that land. So yes creating a policy that Reserve Surplus land for affordable housing is great in your disposition policies, but we really want to work on the ANS plan to make sure that we're at the Forefront of getting these dollar so there can be more community-oriented development especially for organized. Patients who are helping to serve those who are historically more at risk for displacement. So really excited that that conversation from year-ago continues and their words are reflected hear it going forward the second issue that we continue to hear about his support for Community preference and affirmative marketing strategies and this proposed update really prioritizes community members with historic ties to neighborhoods for new affordable housing in areas with the hot with high risk of displacement. So this is something that I know Kelsey over her both has been working on. We're really excited that we're going to have elements of that in this anaplan as well. And third. I just want to highlight that one of the things that were looking to advance in this policy is creating more resources for acquisition of existing buildings, which we've heard from affordable housing developers is an increasing need a very much more cost-effective way to increase affordable housing as the cost of new construction becomes more expensive. This is true both for our nonprofit housing developers are folks who are working in community and Camille organized. Are beginning to get into more affordable housing development as part of their commitment to the community and also from the Seattle Housing Authority said the sheer cost of land and construction is so overwhelming that for them. It's much more effective to look at purchasing of existing buildings and making sure that they maintain affordability and update those buildings that they're great options for the community which also helps with some of her displacement as well as well. So the comment already heard we've already said thank you the office of housing. I just want to say thank you one more time, especially in this time when you have so much going on. I'll continue to have you at committee and you continue to be present. And so thank you so much for your time and attention, especially to the priorities that are coming from our office as we've heard that the need for including the community voice is much much much more. Then just about putting those words in the document but being intentional about making sure that we're convening and creating opportunities for folks to actually co-write the policies together. So just a quick overview office of housing was here to give a report on the 2018 housing incentives meeting aracari investment meeting at the April 18th meeting here at the housing Health Energy and workers rights some of the highlights. I'd like to mention to ground Us in this conversation today in terms of how we administer the 2019 and 2020 dollars on revolve around the fact that in 2018 the city invested 68 million in our rental housing program to clean an additional 1197 affordable home City dollars used affordable homes are leveraged against other funding sources, including County state and federal dollars over $5 of public and private Investments. Okay for supper every $1 5 that's a good Roi. Okay, leverage $5 of public and private non-city funding for every $1 of City Investments and by leveraging against outside funding sources. Those homes were created at an average cost of drum roll, please $50,000 or $300,000 per unit. But these dollars the average cost of creating these affordable units with $56,000 800 cities contribution. The price is still the same unfortunately, but the $2,000 I think it's just really important to highlight the amount of work that the office of housing has been the importance of having folks to understand. Having folks to understand. How how do you say dollars can be leveraged against each other and the incredibly cost-effective ways in which we can do this. When we do partner with our friends at the national level at the state level and at the county level so the meat of this presentation and then I know are calling says I'm coming some questions to ask you a question just a structural question the legislation that we will pass approves to policies cracked. One of them is related only to the financial policies related to The Levy and the other is to all of the office of housing administered programs that correct exactly and which is which financial plan is related specifically to the levy which is required by that organism and our housing funding. Policies which attached to the administrative and financial plan our our broader department policies faded. Thank you so much for us. And then I think we have some questions and ideas would like to throw in their great. I'm so excited to present our administrative and financial plan and housing funding policies. As you said, this is our moral compass and what we are doing is we are balancing many things through our policies. We are balancing a commitment to delivering for multiple populations providing homeless housing as the young fifth-graders mentioned earlier one of our proven solutions to homelessness creating housing for a range of populations seniors people with disabilities. It is our way to achieve our Equitable development and anti displacement goals. Balancing those populations with an interest in affirmatively furthering fair housing creating housing across the city. We are including in these policies our commitment to stewardship. We are making multimillion-dollar investments in real estate that we Steward for at least fifty years by our incredible asset management team. And so part of that includes the hard work of ensuring that these are financeable and that they are sustainable assets in our community and all of these issues come together and then get Incorporated in our intense regulatory agreements and loan documents that we execute with our partners. So this is not just moral at a high philosophical level, but then emanates down into the documents that we make sure as we are stewarding our public resources. Well, so keeping that in mind as we move forward as we like To use these documents as a moment in which we can provide Clarity we can clarify our policy goals. We can make improvements to the way in which we administer program. We also want to be clear that they're not the moments where we can completely move a ship. We are doing long-term real estate development and investment and we want some level of consistency to ensure that we are creating cost savings and timeliness in the community. And with that I'll turn it over to Stephanie gave most of what is on the Side sub in my my job really easy here, but to answer your question and response to your question comes member herbold. Here's kind of the outline of what the administrative and financial plan does and then what the housing funding policies do in my notes I'd said that the anaplan is really our guidebook for how we manage the OHA housing Levy programs. I like more This is well will start using that one but really want to point out here under housing funding policies to reiterate what Emily said is that we are focusing here in this update on providing clear policy Direction while also having the flexibility to do implementation that is responsive to a changing market conditions and and the funding environment. So we want to stay Nimble while also making sure that we're staying true to the priorities and values that the city has for these these policies. Okay. So looking then at what the current existing housing funding policies are and you'll see again that these themes are going to carry through and be highlighted through our proposed updates, but here are our basically the office of continuing priorities for Investments when we talked about Resident populations and the locations of our investments. So under resident populations, you'll see there that we prioritize low-income seniors and people with disabilities homeless adults families Youth and Young adults and also low-wage working people and their families and then in terms of the locations, we want to emphasize Investments throughout the entire city at so that we can provide housing Choice across the city. I mean continue to to affirmatively furthering fair housing. So you see the those bullet points under there are we're looking at high-cost areas areas around Transit communities that are at high risk of displacement and especially as Was Emily pointed out here and we'll talk about a little bit more later publicly owned sites. What I just want to call out specific resident population that the council has identified that in some ways to cover in your bullets, but it's a little bit more granularity as mentioned earlier when we had the appointee from Chip. I'm sorry Kevin Hill housing for I'm dating myself specifically low-income lgbtq seniors is a priority population that the council identified both when we put the levy on the ballot and then in a subsequent a&f plant in one of the things I should say that by virtue of having all of these priorities of which there are many and resources which are constrained don't hit every single priority every year and that's unfortunate. I wish we could Do is show that over the balance of many years we continue to have projects that represent all of these priorities and I think it's a bit of a longer strategic look to make sure that we are we are delivering on all of these priorities. You think they're all right. So here's kind of the story of how we got to the point that we are and that is really as you can see her driven by a community engagement. I this is my first time working on this housing funding policies update and I've been really impressed by just the level of Engagement by a stakeholders Community Advocates council members the mayor and we're all bringing guards the first kind of expertise and experience as well as passion, especially on the side of the community advocate so you can see here in Nova Where we started out just kind of a general scoping meeting to lay out. What are the direction of these funding policies? My update might look like in February 2019. I consider that majorcan's executive order really included a few different policies that and themes that we'll talk about a certainly later on but specifically called out here is community preference and that's going to be a big piece of what I was going to talk about and there you can see also I anti displacement policies are our kind of at the Forefront of a Citywide effort around then we also had another community meeting there at review draft policies and coming out of that community meeting we found that there were a couple issues that really warranted some additional discussion. I'm one again is community preference which I'm sure will save probably about a hundred times over the course of the presentation and then the other one was an issue around. Open one bedrooms and then in March 2019. We updated on our website for the draft policies as they stood and we welcome to public comments. We received a few and then in April we brought these draft policies to the housing Levy oversight committee who really had the chance to do a deep dive and provide some additional recommendations on that front. It's accurate is where you can see kind of the major themes of this round of updates and I think we put anti displacement as the top on there because a lot of these other teams kind of cascade from that they really are interwoven into this anti displacement effort that comes again is is sort of a Citywide effort also again a focus of Americans executive order but these fiends here that you see are not new the housing Levy funding policies have a long track record of addressing these themes and just here in our latest opportunity for a policy update. We the office of housing again with the community Advocates and support from Council Members have really taken a hard. Look at what existing policies we have how we can really bolster those around these particular things so you can see here under anti displacement then we also Alright looking at the Strategic acquisition and preservation program and particularly around publicly-owned sites sustainable home ownership and facilitating more effective program Administration. That's really looking. I'm just kind of Bittersweet of these technical fixes that'll really just help us to make program Administration a little bit more smooth. And then the last bullet point there is advancing racial and social Equity a fair number of these policies were actually informed by and grown out of racial Equity tool kits that the office of housing lead or participated in and so again, all of these seems kind of our entry woven together and you'll hear a little bit more about each of these themes and the policies that are associated associated with each of these things as Emily continues presentation. So the biggest body of work reflected in this housing funding policy change is around Community preference and affirmative marketing and must start this discussion by saying this grew out of community. This was work that was instigated by asked for and led by Community. It was made initially concrete as part of the m h a resolution accompanying the mha in the Chinatown International District. There was some emerging from Council including council member herbold to do research and exploration on this body of work. It was then made actionable by to move forward on it. This work is is really saying, how can we Home Investments to ensure that people who are at risk of displacement people who have been displaced particularly in communities where there is a lot of displacement. How can we Sonar housing investments to ensure that people are able to stay and thrive in their neighborhoods. And this is a complex body of work because it is really related to federal fair housing law. Now as we presented previously to this committee there is a way in which we can design these policies to affirmatively further fair housing and Foster and sustained integrated community and there is also a way to design these policies in which we can have the unintended consequences of Desperately impacting protected classes in the former not in the latter. So the policy that you see proposed is a one in which we can have an on-ramp to achieving the outcomes while mitigating any risk that were violating fair housing law. So the policy included here is one that would enable private enable developers who use affordable housing subsidy you City subsidy to propose Community preference. Policies in high risk of displacement communities so they may come to us say and I'm going to use interim as an example because I know that they are an advocate for the policy as they move forward on Uncle Bob's place. If they say we'd like to propose a preference for people who live in or formerly resided in the Chinatown International District to be able to participate in this building and have access to these units. We would work closely with them providing technical assistance and guidance to help them achieve that goal and outcome ensuring that the way in which they implemented is consistent with fair housing law. So perfect project and we know that so many people either feel like they can't afford to live in Chinatown ID area or they've moved out because for whatever reasons and want to come back. How do you do? Dad in such a way that we're not violating the federal fair housing a little teaser. Although it's not signed off on completely but we intend to do over the coming months is create guidelines that would help create an analytical framework of what the best parameters are about implementing these policies and it would be based on a disparate impact analysis. This is what has been done in other places like in California who put these policies in place and it would say something like although not firmly you probably want to extend your preference to less than 50% of the units. So for that 60% of the units there is equal access by all people and for 40% of the units. There is a preference you're on a different list or have a different applicant pool for folks who can demonstrate that they currently reside in or formerly resided in the in the community the guidelines. Might say other things about what demographic data is necessary to demonstrate as a baseline utilization of this policy on we believe that the application of this policy and high risk of displacement areas were already pretty set out to say that these are generally are more integrated communities. However, that someone says well times are changing and I feel like my community this community is really a high risk of displacement Community now and here is some data consistent with the guidelines you're creating that justifies. Why should we should be able to use it the kind of things that might come up in the guidelines for example, but what you typically see is that for a minority portion of the units you have different kind of access for people who have historic ties or current ties to the community and that they get allocated a different level of points for for gaining access to the property. I'm in a research of other cities have done this does. The city have a role in creating lists of people who have been displaced and then went to be considered in the future as these buildings come online good questions. So it's different in different cities and the answer is yes other cities take a far more active role in tenant selection, but that's because they do tenant selection in house. It is something that our city does not do as distinct from New York City, for example, who holds the list for their inclusionary housing units. We have chosen to use more third-party directly through the nonprofit and for-profit developers. And so we don't have that kind of infrastructure in place to do it. San Francisco is another example holds lists of folks who have been exited from former rent control two units, but they have different infrastructure in place that we don't Going to have this infrastructure either though. Nobody's collecting the names and contact information of people who are forced to move from their community. And if I was a tenant living in a building that I was priced out of I wouldn't think to contact somebody who builds housing in that Community to say. Hey, can you put me on that list sometime in the future? Yeah. I mean part of the problem here is that I think this is a really important and valuable policy. It is also not right to return because there are going to be more people who are displaced or implicated then who will ever be able to get into these units and so we can try to create lists, but that demand will exceed the supply. So what the focus here really is is on community connections Partnerships with Community organizations who can do the kind of advertising organizing to let people know about these opportunities and then Guidelines will probably do suggest more minimal requirements for the purposes of demonstrating, you know, residency or any connection to a community so that it's not burdensome on people who have been displaced to show that they're connected. So just relying on the not just relying on the affirmative marketing side of this issue and not separate policy to help drive those previously to splice folks to these opportunities. Thank you. That's a perfect connection to talk about that cuz there is much more robust policies in place in this document and we've ever had on the front of marketing and what I also heard you say is that it's possible that the office of Housing and creating guidelines will then be able to offer some best practices or tools to this organization. We've created a few community housing around tables and ass folks the specific One of the things that we heard from our friends in SouthPark is that they truly are a sort of creating is ongoing list of community members who are being displaced from the area that and so they do have in some kitten some ways can of us a sense of who want to be able to more accurately or robots and then affirmative Flea Market at once the buildings are created. So I hear that this and we should remind ourselves as we always want to remember there's a huge list. There's a spectrum of all the housing options and policies and interventions that we need. This is one Element along that list. So it is not the end-all be-all, but it could be a helpful tool and if you all are creating resources, I think that will be helpful for organizations like that. Is the space for City funded housing to proposed policies to us restricts that only two high risk of displacement communities and we think that is really important. I think that is the best guardrail we have to ensure that we don't have a disparate impact. I'm going to say this pretty explicitly if we were in implementing Community preference in a majority White Community. It is possible that that could have unintended consequences of providing an advantage to people of One race as opposed to others and that is the exact fact situation in which in New York City that led to a legal challenge. I'm as council member herbold said affirmative marketing is completely related to community preference. So if Community preference is about selecting from a pool of applicants and giving advantage to a pool. I shouldn't say Give an example because this is actually in many cases trying to address past government harm. So that's not inappropriate giving priority to folks from a a certain pool affirmative marketing is about making sure you create a good broad Equitable pool of potential applicants. And so if marketing is really important it has always been in our housing funding policies. It has long-standing been a requirement by the federal government for the purposes of federally funded housing, but our our policy to date has been very thin. And so we seen that people have implemented it very differently and in some cases when they don't know what to do they have Hard time doing robust affirmative marketing what we want to do through this policy proposal is to give more set a more clear expectation of what housing developers need to do while still recognizing that they may want to do different things and balancing that requirement with flexibility. So a few things you'll notice in this policy proposal is that it makes more clear this emphasis on doing Outreach with community-based organizations as a key piece of how we do decide on a permit American Leasing really successful effects through the Liberty Bank project by virtue of partnering with community-based organizations rooted in the central district is a way in which we can attract potential applicants and so affirmative marketing can be successful. We're hearing early from Building 9 Mercedes project that a dip. Approach of engaging local institutions to find low-wage workers at those institutions was another effective affirmative marketing approach. So both of those would fit under this policy, which says look at the location you're in if you're in a high risk of displacement community in particular would like you to work with community-based organizations in that neighborhood in other neighborhood. There might be other community-based organizations. You want to work with we're asking for folks to include in the management plan more information about their strategies to address tenants who have other kinds of barriers and think that will follow this up as we will the community preference policy with more robust guidelines that are informed by Our Community Partners in our developers. Building 9. Can you be ready to go? It is presently Leasing and when do people move in? Commence, 2019 Hotel. I got to walk through that down in the International District. It is pretty Splendid what they have accomplished down there. I don't know the timing of that. I just want to acknowledge the quarters Val and Greg order that put this idea together and there's so many empty hotels down there who just be fabulous if we could do more of that. Okay, so now we're going to get from a high level of are bigger policy changes to some more specific policy priorities and changes that are included in this legislation. The first is around development on publicly on Sciences council member mosquito said this is really growing out of some work that a change of plan a year or so ago that allowed for opportunities of direct strategic acquisition by the office of housing to create additional opportunities on publicly on sites. We are proposing policy changes that would more explicitly encourage Partnerships with culturally competent and historically rooted nonprofit organizations. When were doing RFP keys for affordable housing development on publicly owned sites in high risk of displacement communities are also advancing permanently affordable homeownership on publicly on-site Sweden. That it's going to take public land at a reduced or no cost in order to bring permanently affordable home ownership to fruition for households at or below 80% Ami. So what we know of in our pipeline, we just advance to Yakima, which was a publicly-owned site. We're looking at Fort Lawton for permanently affordable home ownership and when we go through all of the efforts to to make land publicly owned land available for permanently affordable homeownership. This policy would allow us to go higher than our existing per unit funding amount to bring those projects across the Finish Line at Yakima. For example, we need to include some market rate units in order to cross subsidize the affordable units. These are rare opportunities would like the opportunity to be able to make them. Holy fully affordable and to do that we would need to increase The subsidy amount which currently is based exactly on the unit size. Thank you. I'm as it relates to the acquisition and preservation program. It references a loan amount for total of 30 million outstanding at any time my notes refer to a cap of 30 million for projects pay back through rental income and other funding sources suggest that we're removing the cap under this plan is that Good. Yes good clarification. So under next policy proposal around the acquisition and preservation program. We see a lot of opportunity particularly in the current market and with folks like Seattle Housing Authority to provide shorter-term lending for acquisition of existing multifamily buildings or land in some cases we get for which we get paid for those loans presently the policies allow for over the seven-year housing Levy. To lend a total of 30 million dollars, even though we get those loans back we have extended I think around 29 million or maybe the full 30 million at this point. So presently our policies would not allow us to do anymore acquisition and preservation lending. What we're proposing under this policy is to not change the 30 million dollar cap to revolve that 30 million. So as we are repaid off of those loans We can relent those resources. So we expect over the coming years will get some of the money back from Project who may or may not need our long-term permanent funding best that in a new acquisition loan. So there's still a 30 million dollar limit, but it revolves now cracked and it didn't exactly as it relates to the Partnerships with Seattle Housing Authority when it came to their hope six projects, we had expectations and r&f plan for those dollars as it really is specific to lie to the Sha is there is there a need to do that? I mean, it's obviously a different scenario. We were really really cared a lot about replacement housing for those those hopes its projects. So we were wanted to make sure that when they were building replacement housing that they weren't using a lot of love you dollars to fulfill commitments that they putting on them. Thanks for agreeing to the to the project but I'm wondering if there are scenarios that we need to consider as it relates to a partnership with s h a really good question. I think in this case our partnership with sha is maybe the most mutually beneficial thing that can come out of revolving this 30 million dollar fund. And that is that what they're looking for is short-term lending to purchase existing multifamily development that are not presently under the housing authorities per view to bring them into the housing authorities portfolio and long-term. They will have the resources to operate that building. They don't need our long-term money. We would love a partnership in which we can help them with short-term financing to save over all governmental cost to get our money back and reinvest it. Holy and something else. So we see this is an exciting opportunity to work with them the partner. If that we could have with them is different than our lending and other projects like presently at Midtown Center where we both provided an acquisition loan and we anticipate that we will be the long-term capital Thunder the follow-up question that I think somewhere in here. We have a section related to community Workforce agreements and party hire obligations to utilize apprentices as well as pre apprentices and draw require contractors to draw from workers from just distressed communities. I'd like to know more about what our expectations will be for projects built by Sha using City dollars. I can do here in the community that there's some concerns about that that sha may be declining to follow the city's lead time on its expectations for for utilizing priority higher. Thank you. I will look into that. I do want to clarify that are present policies don't require a community Workforce agreement on City funded projects. What we do require is prevailing wages as set by L&I, residential prevailing wages for davis-bacon if federal dollars are used and we do have Wendy and Apprentice utilization goals as well. So we have a strong labor Equity component. Our CWA has been piloted for the first time or will be piloted on the case sites and we're doing an analysis to understand the benefits and costs of using that agreement. Sha has use project labor agreement previously as part of yesler Terrace. I know they have their own experience. They also have their Federal requirements that they are required to use but I'm happy to report back when we invest our dollars at yesler Terrace, for example, which kinds What is that partnership look like under the previous administration? There was an executive order as it relates to Priority higher and what are expectations were for public-private Partnerships. I'm so to the extent was infected order was not enacted into law, but to be sent that we could use that as a way to to move towards negotiating those elements in nitrous sha projects, but other other projects that are getting substantial City resources upwards of you knowing in in under priority higher, it's more than 5 million dollars and I just taking a look at last year's Levy Awards. There's several projects that have upwards of $5 towards to reiterate. I think when they came before us a couple years ago, the first one there was quite a bit of discussion about this and there really was a feeling that we needed to understand. Will it be the implications on the housing cost of doing? And I don't think you have that data, but we are waiting to see what the implications are because as we try to balance out all these seating policy goals. We need to understand what are the trade-offs if we're going to impose those requirements. And what does that do to the cost doesn't impact the cost. We think it may we certainly here. I have heard message say that there are some consequences or implications of that and it would be good to have them kind of talked about that. I just think we need to understand before we just helped we're going to have the X and and not understand will that might have an impact on production for example of the number of units until 4. So I will flag that this is a priority in mine as well and we are engaged in conversations with folks in the Building Trades about these pieces heard yesterday that there is some initial feedback from the case by then so will be looking forward to bringing that for work was excited to include some of the language in the case I construction last year so that we could Advance our commitments to not just kidding. So that those who are building at are also not then eligible for the same people program. Yes, but they are for the units that they're building ideally that houses live our values, Thank you. I'm a good place to be right now. So I'm thank you. Again. I appreciate this presentation Stephanie. Thank you too for your participation. Tracy's always. Thank you very much for bringing forward to this today and I will follow up with you on a couple of other items. Thanks. Thank you so much and we'll have this conversation in front of us a few more time. So good. I'm going to finish this Allied and then I have one more side policy changes around the preservation program were proposing a few changes to our home ownership program around home repair for low-income owners. We presently have two different loan terms that are offered for our home repair loans as a reminder. These are loans for low income people for health and safety upgrades to their home. Typically a $20,000 loan on that helps save a low-income homeowners home and keep provides them with stability. We have a 3% term right now A 0% term. We are proposing to turn it all into a 0% term to try to increase people's appetite for this program time, and I don't believe that it will have a significant financial difference. We're also proposing a pilot program to allow funds in our home repair program to support in Approved or increased habitable space and that's a way of saying that you want to further support sustainability of low-income homeowners home coming out councilmember O'Brien's racial Equity cool kid on adu's and improving their homes taking a mud room or an unimproved area and making it habitable so that they can bring on additional household members and stabilize their home or bring on some rent-paying folks who can help provide income that will stabilize a household in addition. This could be used to finance for a low income home owner and if it were to do that and then be rented out that unit would need to be rent in income restricted. We're doing some Outreach and engagement with Community organizations to hell. Implement this pilot and are excited about this expansion policies are as follows. I'm first we're proposing a change to our community relations policy that would help clarify the timing of o h required Community notification and Outreach on our projects and I will say this and that is previously it was that the majority of applicants for our single funding round would Prevail in this case. We are highly competitive and more projects do not receive a reward spin that too and for that reason we do not want to trigger requirements for significant Community engagement until we know that a project has been funded and will be accurately and genuinely representing to community what will be included in their project. This does not change the purposes of neighborhood native notification which remain at an early stage in the process. We are seeing units on the market called open one bedrooms. Again. This is a bit of a wonky saying which is that there are units that are created that are neither really a studio or one-bedroom that are in between might have half walls 3/4 walls. We see them as in two bedroom units as well where the second bedroom has a half wall our office recognizes that we haven't been uniformly treating these units the same in part because there a market Innovation and so what we want to just do is have the authority to determine the way in which were going to treat these units through a director's rule so that on a regular basis, we can really balance both the implications of cost and the expectations of tenants to be able to have good functioning reasonably apartments that meet their families and households needs we're proposing to policies as it relates to serving extremely low income. Is that we presently have a policy that when a community has a certain level of extremely low income housing already in that neighborhood. We will provide funding to additional projects in that Community. Will we find however and the purpose of that rule is to formatively further fair housing across our city and sure that we're providing Access housing across the city what we find however is that in some instances particularly with protected classes household serving people with disabilities. We make a significant investment in the project. We make commensurate investment in healthcare facilities. And then another project that would utilize that Healthcare facility is unable to be cited in that Community because of this policy. So we are adding additional criteria to ensure that when we're making a determination about whether or not to extend funding for purposes of this sighting policy. We include criteria like Exceptions for buildings that would accommodate certain protected classes or recognizing in instances in which the data is not representative of what's happening in a particular neighborhood. There's also one last policy proposal on you heard of Kelli Larson talking about operating and maintenance funds earlier. We presently as part of the Levee. We took an important step that we hadn't taken before and we modeled that in buildings that we are creating it 50 and 60% Ami we still wanted to achieve some 30% Ami units. That's the first time we are doing that as part of the last Levy where fundamental to our modeling this idea that we're going to extract more extremely low income units in those mixed income buildings. However, we are allowed to use o&m in in those Buildings, but our present o&m policies save that you need to then adjust it. So a person pays no more than 30% of their income on rent. This is a minor adjustment to say that we r o n n is used in mixed-income buildings. The property owner can continue to charge the 30% rent chart rent, even when o&m is present. And that concludes the policy changes that we proposed as part of the ANS plan and housing funding policies for this two-year. So are there's a number of other ideas that Tracy has been privy to in our conversations with sort of the community housing Brown tables that we've been pulling together remind me of in terms of essential staff memo outlining some of what's being proposed with the changes are some of the ideas coming from the chair potentially some other committee members. Will that be something that will be present at our next meeting? That's what the plan with these that I would come in with a memo that would hopefully have all of the proposed amendments and the actual language for you all to begin to look at him to discuss send to massage if you still want to okay grade, so if and 6 would you like to make sure that we get all those Amendment ideas to well, I delete within the next week cuz I can have them prepared it out to you all before you walk into committee. Feel free to push back if the timeline is not what you had initially proposed. I'm so if we look at the end of the week and next week, May 24th, is that in alignment Aaron with sort of our thinking as well? Okay, so that will give us another week plus a day Roi does a half day comes with you. I'd love to be copied on those so that if there's any council members that are interested in amendments are we can work with your offices to make sure that we're thinking through changes together and then that will give us a Tracy a full week for us to look at some of the policy ideas and crafted into a memo that then folks will have about another week on prior to the 6 to take a look then formation. Okay. Great work with you sooner. I'm already working. So I was going to say thank you. This is something that is. Covered in Waukee sauce is so exciting because I think it really does help us Elevate. We've heard from community members directly gives people an Avenue for policy change and I see this these amendments the plan itself. Yes, we talked about it being a moral document or a guiding document. But also with this is going to continue to live on in the Grant application and the priorities that you elevate their I see this is one of our strongest tools for social inclusion for poverty reduction for creating healthier communities and more resilient communities. I think that we have talked a lot about how housing affordable housing both for renters and the first time home owners that this is this is one of our really are only tools to help address generational poverty - reliable Retirement Systems living wages, which we will continue to work on in this corner of the United States. I'm creating affordable housing rental and ownership options is real. Poverty reduction tool to help today with access to Transit reducing our carbon footprint making sure that people have more mobility. And also I you mentioned earlier and I think as member her more than I have some comments out today in a press release. It's either out already or forthcoming it's out. One of the things that I can really resonates from the author of the color of law is that are passed segregationist housing policies or intentionally created to resist and exclusionary and classes in nature. And those we have to remember or public policies and it is going to require us as public administrators and those members of the public to demand that are public policies truly change to better reflect our zoning and housing policies to undo those historic wrongs that were embedded in our public policies. I'm so this is I think truly an effort for us to be conscious and intentional about including a camisa color are low-income workers. Those who are disproportionately affected by displacement as we create a new investment policies and strategies for the city. So I thank you for working with us and for continuing to engage with our Community Partners as well as we look forward to our future amendments to this plan and then to also recognize that it's a living document because even after that happens on the 6th and the final vote on the 17th, discussion and possible vote on the 10th, and then if we need to another hold over for the 17th, ideally knock on wood we can get this done in three meetings and will be done on June 10th. Thank you so much for your present a tar for your presents the entire meeting today. They're excited to have you wanted to let folks know that our next meeting again is on June 6th at 9:30 a m. Discussed in that meeting which is another great. Hopefully housing this place up medication tool and affordable housing tool are Seattle City Light review panel appointments. And if you'll remember we do this is one of the first policies I passed to prevent the rent bidding platforms and created a moratorium in good news. It was coming from the court. So we just need to extend that rent betting legislation for another year. I believe is what we're going to do and then the administration and financial planning and housing funding policies. Can you come up with a cool new name for the okay. Can I suggest if it was some ideas and suggestions to be by others that we might want to think of a different name for weatherization program that is more about our desire and interest in promoting green buildings may be a I don't know a greeting building programs that is focused on Energy and the preservation of energy and Greenville housing policy. If folks can join us on May 21st at 5:30 for the Fort Lawton hearing we will be here in council chambers if you sign up for the day of check-in, but also if you know that you want it it's complimentary is free. Please email our office either of us or Ashley Harrison at seattle.gov parking is available in seapark garage located between Cherry and James Street on 5th and 6th Avenues at a discounted rate of $5. That begins at 4:30 p.m. This is housing affordability glass Monday pass the proclamation honoring May 13th through May 17th. Housing keep transposing those letters those words affordable housing. This is well under way. It is Thursday used to have one more day to engage. There's more activities that you can find from our partners at housing Consortium. Org. I'm at the HTC website and we hope that you will join in the mini events happening throughout the week. The idea of this week came from Eastbay where they've been organizing a week of action for 20 years. And nationally there will also be a week of action May 30th through June 5th, focus on federal affordable housing investment, as we all know have been declining over the years on and without those dollars. It is going to be very hard for us to reach the hundred and fifty-six thousand of portable units that we know our region currently needs. So please do check out all of the events happening this week. Thanks to our partners in the housing advocacy Community for all of their work this week and we will post more on this. Today and I'm tomorrow about housing affordability week and we kept as you can see today was all about housing. So we do appreciate everybody's work if there's no other, we will see you on June 6th. Thank you everyone. Thank you Aaron and recognition of housing affordability weeks. Thank you for all of your work on housing as well and our meeting is adjourned.", "end_time": 7862.7}]}