{"format": "raw", "annotations": [], "confidence": 0.9453325087115878, "data": [{"start_time": 0, "text": "You know anything about the good morning everybody. Thank you for being here for a regularly scheduled March 18th briefing and we'll just try to dive in I'll dispense with the present report. I'll just say a few things. Once we do the preview of today's full Council actions. So why don't we just dive into the State Legislative legislative sessions session updates and have the team come forward. Remind you that this Thursday? We have counseled Lobby day and we'll departs at around 8:30 a.m. And we should plan on leaving some of us will and leave Olympia route 315 returning to Seattle round o 43445 s traffic permits. Why don't you with introductions and just dive in the character Christina postlewait State lobbyist. Good morning. Welcome back. We are we have crossed a major hurdles at this point to the legislative session and we have a lot to cover with you today. Although we have passed the house of origin floor cut off. We are also nearing the opposite house policy cut off on April 3rd physical cut off on the 9th and then the opposite house for cut off on April 17th with the legislature ending on April 28th. We look forward to working with you all this Thursday. I believe many of you are coming down and I believe council member badge CC. On Tuesday as well, and I'm going to turn it over to Karen for a quick session overview and an update on the lobby day. It's Logistics customer Johnson is available to travel with us as we head down to the people. We haven't heard from the rest of you is so if you do want to ride please let us know. Otherwise, we will anticipate seeing you on Thursday morning and we are in the process of finalizing the schedules. I have your dress code to argue with with your office and we're doing a little bit of adjustments to it. We have a couple of additions. I'm very happy to stay for dinner later. She wanted to stir I think you but still finalizing some of the scheduling for Thursday and hopefully we'll have something to send around on Tuesday so we can make travel plans and let us know if you need anything else on our part to help you guys prepare will be doing a little briefing memo for you and Getty bios for the legislators that you'll be meeting with. So if there's anything else that would be helpful. Please do let us know. Fully covered all the cut-off dates so late last week was the end of floor action. So it's really really busy. But now we have switch back into Committee hearing so bills now that have left the opposite house that work and are now in the opposite house. So everything they went through in their house the origin chamber of going through the same process again on the opposite house. This will go is to be much more condensed. About 3 weeks to have three weeks of the policy committee hearings before they move into the physical so things will really start ramping up at this stage on before they go back to the floor. And as we purchase any day next week, we should be at will anticipate seeing the budgets other house will be releasing there's a troll look at the 25th. And we typically send out kind of a high-level overview of items that are in the budget and if you guys have specific items that you had been working with us and we'll highlight those for you but there's anything in particular you need help locating. Please do let us know. It's a large document we do our best to cover as much of it as possible. But if there are certain things are looking at their highlights Happy to let us know. I'm so I'm going to jump into the education section. This bill isn't listed in here and did not pass with the school bond status was that the bill that it was a bill and a joint resolution that was working to change from the 60% requirement for riding on school bonds to a simple majority of it actually moved to the senate floor last week, but it did require 2/3 out of the chamber, So that would mean that they were 33 volts. I would have been required in the only receive 28th. So when on a party-line so unfortunately will not be advancing but didn't move to the floor and it was a very interesting debate if happy to send a link to the debate on page 3 that college promise bill with about a 27 to eat in. This is a New Concept that being put forward by Senator Palumbo on this would be replacing the state need Grant and it would be providing free. What's tuition for families and for students who are making 100% of the federal poverty line or less? So that would be an income of about $28,000 a year for a family of four that there is any money that's left over it would help go to other students have lower income levels. I'm kind of a tiered status. So it is depending on Revenue that would be provided by the by the legislature to the budget. So we're still working on that there is no that's still being worked on his part of the bigger package. I'm so it is scheduled for a house hearing tomorrow. So we'll be monitoring that end in additionally. I know that we've covered quite a few of the school levy bills. There are four that are highlighted in in the bulletin this week 50313 is receiving a public hearing on the 21st, which one what if you are down here so. Olympia, so we are continuing to monitor that but again the necessary didn't limit the budget so doesn't meet the requirements of the current line for the child care bills 1344 schedule for public Hearing in the Senate today as it was one of the highlights before cast member must get and customer Gonzalez you've asked about that and then I if anyone quite a few questions on student debts and higher education student that said they want to highlight on page for Senate Bill 5774. Is it the student loan relief and reform action? There's an income. Talbots was just sentenced racing Concepts in early as it's working on this one but up for a public hearing on Wednesday. Is that what's can you talk a little bit more about what the proposal is? I can give you a high level. So I think they're really interesting component. Is that income share, so I know there are a lot of other states that have this concept so that you coming to an agreement with someone for who you be going to work with an M. Yours is like 5 to 7% I think is essentially some your income that would go back to repaying the tuition. So that's one of the the big pieces that I brought the most on but happy to get you some more the specifics on what's been covered on that, but it would be helpful. Thank you. Where is the environment section before you move on? Can I ask another question a little bit about the eligibility bill? So that's Senate Bill 5437 on page 35437 eligibility to the early childhood education and assistance program. Do you have a front of me, but I can get them to you as well. It would be helpful to know how the eligibility requirements of being proposed to be modified part of the work that we did in our resolution accompanying the passage of the families education preschool promise not included direction from city council to deal to explore leveraging opportunities with the state by for example purchasing additional ecap slots that would continue to address. Some of the child care needs in the city should be good be good to know what those proposals are so that we can make sure deal is following them and taking them into account Skype. I did highlight the deal did provide some quite a bit of feedback on that some happy to share that with you is that was just so you can kind of Leverage the information that we have them with apple doesn't talk deals interpreting little boy doing super helpful. Thank you. Thank you. Environments I wanted a really big big bills that moved off of the house for last week was at the engrossed second substitute House Bill 1110, which is the transportation fuels the clean fuel standard that represented Fitzgibbon has been working on this is been many years in the making a fort we were very very thrilled to see this one move off the floor. It was on the 12th with a very long debate about 3 hours 53 53 Pro 4300 against I'm so very excited to see this when advancing I'm and it is scheduled for a public hearing and the Senate environment energy and Technology committee this week. I so continue to monitor that one but can't highlight enough how much of this was for a person if it's given and for all the environmental Community working on this issue. If I make Eren just to highlight one additional points if this bill were to pass and we are currently the only jurisdiction on the west coast that does not have a low carb fuel standard California has one province of British. Columbia has one would you not so it would create a unified position signal about the direction that the world is headed on low-carb. Thank you. Yes. Our transportation electrification bill that's on the bottom of page for substitute House Bill 1512 that also moved off of the house floor on Tuesday last week. I went out with a votive 64-33 and scheduled for a public hearing on Wednesday. I'm so that was actually the first time we've had a vote on the house floor and I feel so pretty excited about that one to the environment energy technology also known as he's still quite a few that are active as last week. I missed a lot of plastic packaging and things like that. So I got to take a look at some of those if you're wanting more information happy to follow up and get you more details on those. So that's why I'm on page six second substitute Senate Bill 5116. It's scheduled for executive session this week. It had a public hearing last week so still Still working for that but it is still moving. So I think it's currently it's set up for two days right now. It's only Monday, but potentially but tomorrow and then Finance public hearing on Thursday. So that one requires quite a few I think that the physical committee public hearings. General government That's a starting on page eight on page nine. I just wanted to highlight the prepaid postage for ballot. We have executive session executive session scheduled for that on the Friday and additionally also wanted to flag the wrongful-death builds the very bottom of page 9 a schedule for a public hearing tomorrow. And then on page 10 second substitute Senate Bill 5376. It's the consumer data bill at this is represented. Our sorry, Senator Carlisle's really large data privacy bill that he's working on as a quite extensive but it provides a lot of rights to Consumers about how their dad is being used how they can work with people that are selling their data hiding. To remove. So it's very very very expensive and again happy to fight one of us a longer detailed list of information about what's being more time, but it's based off that European Union general data protection regulation and was a Big Lots for him in the Senate. So we're continuing to monitor that one as well. hands off to Christina to talk about Healthcare I'm going to highlight a few health care bills that are really exciting. So the one that's very top 10 39. That's the governor is on page 11 on my apologize for the governor requested opioid bills and it focuses on treatment recovery. I'm pregnant and parenting women opioid overdose reversal medicine sonar con and people with opioid use disorder involved in the criminal justice system to this Senate version was Senate version of this past on the 7th of the boat of 40720. So great vote count their scheduled for a hearing and the House Healthcare & Wellness committee on the 19th. The house version did not pass in advance of the the cut off last week. So that is considered that the Senate version will be the primary vehicle moving forward. Can I ask you a question now. You just mentioned this about jail and prison to have a planned is that part of this bill? Cuz it's any right up here. I don't see that. As part of the overall Bell was so the overall Bell does pennant works on pregnant and parenting women how opioids interface with a Criminal Justice System. It's a multi-faceted approach tackling this problem that we're all facing. Great. I can get you more details yet. If somebody is brought into jail and is on some kind of an opioid. We need to have a plan from the day they arrived to the day we release them because what happens is that they'll go and maybe there their they're just for a few days or a week there right back out on the street the right back out looking for the stuff that doesn't help at all. But if we can get them on a health plan that includes buprenorphine or maybe methadone if they're going forward on the methadone that they have to have that while you're in jail and be prepared when they get out that's going to make a difference. So I don't know if this bill does that but we can maybe we can talk about it before I come down to the definitely will make sure that you that information and we'll talk also in advance. Your meetings on Tuesday. I think the treatment plan needs to not only include what happens after the person's released. It also needs to include what happens while the person is in custody because there have been instant instances recently of people Dying because of Aunt while in custody and addiction issues but last session I think it was there was and I can't remember the name of the person the bill was named after but there was a bill is similar to the law that allows if a person is of demonstrated harm to themselves or another with mental health issues that person can be put into custody into mental mental health treatment. Ricky's law expanded that to addiction issues, but it had a component that it could not So you could not begin MN counties could not begin to use it until a certain number of beds were were brought on and I'd be interested to know for another time where we're at on that. Are we are we hitting the goal that we need to hit and beds online and where we at on being able to use that tool and beds at the county cuz remember her bones, but I do think a County facility there like three facilities that they have faced. That is our Target. Yeah of note the person who was really pushing for Ricky's law. She is now she's elected state representative not represent of Lauren Davis. So she she is continually down there fighting for all of the issues related to this to so we're lucky to have her down there. Moving on I wanted to talk about dachshund Nations. So that's the bottom of page 12 very much a Hot Topic still the we still see supporters and detractors of this town Olympia quite often. So I just want to let you know that this would have repealed the personal belief exemption for the MMR vaccine and measles mumps and rubella it pass out of the house floor with the vote of 57 2:40 on the 5th, and it's been referred to the Senate health and long-term care committee for further discussion. I we anticipate seeing quite a bit more media coverage about this and you know more of the detractors showing up on Behavioral Health, which is the bottom of page 13 The last one for the section. So it's that this is that 5444 and 1513 again Governor requested legislation for the Trueblood settlement agreement. This is the language that has agreed to by both of the parties in the lawsuit. It would choose me by the parties in lawsuit. It would provide timely competency evaluations and restoration services to people who are suffering from Behavioral Health disorders with enough forensic medical a mental health system and passed on the 7th with a vote of 40820 over some of the numbers we loves to see and is scheduled for a hearing in the house civil rights and Judiciary on the 20th. So the house version did not pass but we've got a really solid Senate version moving through the process right now. moving on to housing I wanted to highlight a few here. So in the middle of page 14, this is 1219. This is that related to read to affordable housing Sunset. So this would allow cities and counties to use Ritu funds for fordable housing and homelessness projects the house version passed on the 5th with a strong vote 74 to 24 and is scheduled for a public Hearing in the Hemet and the housing stability and affordability committee on the 20th. So this bill what it would do is remove the existing Sunset and cap on using route to funds revenue for affordable housing and homelessness without this bill the existing flexibility will expire this bill removes. Also remove some of the hurdles in the current Authority such as a requirement to certify all of their capital projects are funded before beginning. These were excited to continue tracking this one through the process would be really helpful for a lot of communities if this bill doesn't pass when that flexibility expire I am fortunate enough to answer that but I'll make sure to let you know. Is it okay next year? I I don't know. I apologize. Yeah, I'll have to get back to you related to that is the idea of a 3/4 housing that dead. I think that while you never know what's going to happen. A lot of the Reid related bills did die before cut off. However, there's always a possibility. This could be brought up as necessary to implement the budget. I keep hearing that might be the case on some of them. So we're going to track that and push for that to there's been a strong Presence by the Realtors before and during session with some paid campaigns and we're just monitoring Hive how that might impact the conversation as well. So moving on to our favorite Bill also on page 14 at the bottom of the local-option bond bail. This this is something that we we worked on last year and we spent a lot of the time in the interim working on to make sure the language is beneficial to more than just counties. We have an agreement with the County's to have simultaneous access to these funds. So an AWC estimate of what this could look like. It could generate 16 million per year in King County allowing for a 200 million dollar bonding capacity. It's really exciting for a lot of our needs are for a for a behavioral health + 4 + 4 for housing and just so everyone is aware. Sorry. I apologize this at this pass 66 232 out of the house and it's been referred to the Senate housing stability and affordability committee on March 20th for public hearing. So I just so we know the revenue collected or bonds issued can be used for a choir and rehabilitating or constructing affordable housing including some new units of affordable housing within an existing structure that provides individuals provides assistance for individuals with mental or Behavioral Health disorders or just operations and maintenance which is what a lot of our facilities really do need assistance on to So under the current bill who gets to operate that who's making the decisions dismiss passes who makes the decisions on so we just going to mental health housing for digital pads, or as we talked about opioid addiction. Treatment facilities for people who gets to make that decision individual jurisdictions. I haven't seen specific language around that. I do know that's limited the limitation of having cities and counties having simultaneous access is limited to those cities that have a demonstrated effort towards providing funds. I'd like our long-standing housing Levi is an example of that. There are quite a few other communities. Who do you have a housing bodies in their own jurisdictions and that is really helpful because there are at times cities who are more eager to spend on affordable housing and Supportive Services than their overall County's so this bypasses the need to go through the county to get some of these funds. So I I don't know if the clear answer on who gets to make that decision. We're really hoping we get a great outcome on the best we can go from there, but I will make sure and read to the language again to see if there's some kind of delineation of where that would be made for you, but it's really been a great team effort on this bill. We're really excited. I see a continued moving and I'm a WC and the county companion organization. And on this very supportive. Yeah, that was a WC really wanted to make sure we had that language about simultaneous access in there as if we but it's powerful to have a organization representing more than one city pushing for that. So we're really thankful for their help on that. They've also been just great at organizing people for channels. We will have I will have Emily Alvarado from Office of housing coming down to testify in support of this. She has testified in the past on this too and it's just been a great addition to the panel's showing the breath of the need for this to go through I wanted to touch on I know we've had a bit of conversation relating to a property tax exemptions for service-connected disabled veterans and senior citizens. That's the Senate adinkra Bell. It's at the top of page 16 5160. So this passed out of the Senate on the 11th with a vote of 37 to 11. There's a public hearing scheduled on the 21st in the house committee on finance. So be welcome to having you join in the committee are just coming to see what's going on. There's a lot of support for this soda spill would help us would help vulnerable populations including low-income seniors individual disabilities and disabled veterans afford to stay in their homes. So the current income thresholds in the bell. I did not serve the entire State they don't really make sense for some of that higher income areas or just you might have a higher property value such as in King County. I wanted to also touch on briefly mineral density. I know some of you guys have been very engaged in. This is the represented Fitzgibbon Bill 1923. It's the bottom of page 15 is passed out of the house on the 1366 to 32nd in used to to chug along Thank you for continuing to track this bill and ensuring that this is a high priority for the city of Seattle. I might think with a vote of 66 votes out of the house it signals of this is a bipartisan bill and I hope that the folks at the association of Washington cities understand that this bipartisan bill is a huge priority for the city of Seattle and four cities around the state. I plan to talk to them when we go down and have had conversations with Peter and the team I think it's worth a follow-up conversation with our colleagues to make sure that we're all a speaking from the same sheet of paper. But this is a really exciting opportunity especially on the, you know, the precursor to the discussion that we're having later today for all cities to step up a US-1 and just shout out our friends at the National League of cities in Washington DC. They just put out a report that was embargo last week, but that will be coming out this week that talk about local action. That cities can be taking and Partnerships that are necessary with state legislators that use Example of a deal legislation at the state level as a great way to show that we don't always say no as at the city level when the state tries to set a new floor that especially when it comes to issues like labor standards or safety is important that the state help be a good partner and setting new floors. So both the addy legislation that a Palumbo's working on and I think it's macree in the house. That's that sponsored that bill and then Fitzgibbons bill on Gregory Spencer. Sorry about that. What's Fitzgibbons legislation on 1923 are great examples of where our state is acting as a partner and helping to raise that floor because we are never going to be able to piecemeal approach out of this 2000 crisis. So I'm glad that you guys have been very vocal in support of a 1923 appreciate that I don't share that report cuz I think it's a it's a new frame for cities to think about Partnerships with the same to you in that way and then essb 5600 and eshb 1453. I believe 5600 the Senate bill is the stronger bill because it also addresses in addition to the issues that they both share which is extending the the three-day notice. Of 14 days giving the judge discretion in an unlawful detainer around non-payment. The the Senate Bill addresses a number of things that we on this Council via resolution and have identified as really high priorities. That is the requirement to provide. Information about advocacy resources to tenants who are facing an eviction. So the requirement the landlord to provide that information it also requires that the court consider reasonableness of late fees and attorneys cost. I believe earlier as it relates to the late fees. They had actually agreed on a percentage of what's owed. I don't know where that is right. Now the Washington multi-family Housing Association was actually really supportive of limiting late fees, which I'm really happy that we have their partnership on this but as it relates to sort of between the two bills, I would really hope that those elements in the in the Senate Bill get included in whatever gets past because again this Council through resolution has talked about enacting our own legislation to address those issues and it would be wonderful if again is cuz her It is said that we had the states that in the floor and I was actually going to touch on both of these spells because I know you're very interested in them has been really engaged on the process. So the good news is that both of them are still very much and play so that the so that the Maxi Bell 1450 through which is the other than it's different from the bill. You were just referencing that one has just been referred to committee. There's no actual date on when that will be heard. So that means there's a good amount of time to really start negotiating and pointing out some potential flaws if if we see them so that would be really great. We love to get your help on that too. And I think I have done at housing. So unless anyone has specific questions on flexibility will be lost as of June 30th 2019 if this bill is not passed so that is urgency that has escalated the level of urgency in my mind around and seeing what kind of role we can play at the city to support the efforts underway. And I think this one I feel like the last time it was the 2017 when this was expanded. So in just two years this current version will send it to 2026. So they'll be a longer while I'm lying before we have to re-read it literally months away that produces a lot of anxiety for me in terms of our ability to be able to use these flexible dollars for what is clearly enough. Continuing need for affordable housing in our community stakeholders on this issue of all been pushing for this and if there is a really good opportunity to have one of you weigh in on that we love to take you up on that to just to be another voice other than the same ones. They've been hearing about that. And yeah, we love to get some help as well. Just elevating the issue and legislators find some of the key leadership, and I just got me going at 1 I can go sooner or later than that. If you need to. Yeah, we have a meeting after this one will be coordinating what has been what has been said this meeting along with how we could we would love to take the opportunity to use your voice has to push on some of these so, so we were working or working at it and just making sure they can cure time is well spent on their. Thank you, and thank you. And for coming just one point of clarification, I really appreciated cast member her bolts between the Senate bill in the house bill on residential tenants as reading someone about the passage of the Senate bill on March 9th. But when we go down this week, I'm trying to exert understand. I thought that was a pretty good deal that had come out of the Senate but this new one that was just referred to the house. You said it's just created by her bows for the described a little bit as not being as protective. But is that our opinion at this point? I think both bills have a lot going for them and that this issue has become front and center for a lot of people in Olympia, which it takes a lot of effort in talking to make that happen. So I don't think there's a flaw that means that one needs to be killed. I think both operating both moving forward a great and there's a lot of time and opportunity to make these bills into the most effective tool that can become So that is sort of are speaking points that I'm trying to. And I'm I'm going to move on over to the public safety section if there aren't any additional questions and housing. I'm starting at the top of page 17 and talk about a few significant pieces of legislation that are moving but I want to start with a bad news first on some issues for Council that I know are important to you all both the assault weapons in the high capacity magazine ban. Both of those are not no longer moving forward this legislative session, so, So while there is still a huge swath of firearm responsibility policy and victim protections many of those things are moving as you all know a lot of the time, you know, when issues become controversial or polarizing and votes have been counted quickly and we're coming up against, you know, cascading deadlines may not be for the lack of energy around and investment in a proposal but about timing and how much time things take up on the floor and what that would mean other things that don't pass. So I don't sense that. There is any lack of energy from the legislature to continue to work on those issues for this legislative session those two policy at bills are no longer moving forward and then on with some for some better news on the top of page 17 or highlight rape in the 3rd degree House Bill 1002 spawn a sponsored by a representative or wall that would eliminate the requirement that evict Clearly Express lack of consent in order to prove rape in the 3rd degree that passed the house unanimously and made it out of Senate Law And Justice and has already moved to Senate rules. So that is advancing very quickly understood kind of characterize a lot of the movement around this part of the portfolio. We are seeing a tremendous amount of bipartisan support. So I know I think I will continue to see movement in this area in future sessions as well the sexual assault kitten notice House Bill 1016. We had a lot of correspondence with house number herbold about this. It's a bill sponsored by representative Xavier that would connect survivors of sexual assault 2 appropriate providers and put monetary penalties in place for hospitals that do not comply Cubs number her Bolt Express some frustrations about just why why won't the build Rafters just looking at complete, you know a requirement for hospitals with that the stronger enforcement provisions, and so I'm were in discussions right now with some of the Advocates and I know you guys are also working on some potential local policy opportunities to address that as well. Absolutely Public Health board members. I learn through an inquiry to Central staff Public Health boards have the jurisdiction and authority to regulate in this area. Seriously, can we can we work on this so I can put you in touch with the advocate that I've been I've been talkin rape kit legislation. Thank you the three of us here and councilmember Caldwell's that we ought to be able to move something pretty quickly. We will see a great partnership between what's moving at the legislative level on the local level as well. I'm also going to highlight and I want to stress how amazing this is to see movement around on sexual assault House Bill 1166 on the bottom of page 17 a representative or wall proposal that would address the backlog of untested sexual assault kids in Washington state that the level of support for that is remarkable given there is a very significant physical note attached to that and I know for many of you prioritizing a revenue source that does not penalize victims was very important. And so this would not do that and that passed the house unanimously on March 6th, which is incredible and has been referred to lawn justice of that is still moving forward and domestic violence law enforcement House Bill 1225 on the top of page 18 a representative Jenkins proposal that would require a law enforcement. Officer secure Firearms when responding to domestic violence incidents past the house 6238 on March 5th and has been referred to Senate one Justice and then and councilmember where is has been very involved in Native American women on the top of page 19 House Bill 1713 sponsored by representative mosbrucker. I notably a republican would require training and liaison positions be established to improve best practices and protocol relating to missing and murdered indigenous women that also passed the house unanimously on March 5th. Congratulations as waiting executive action and the Senate state government and tribal Affairs committee. I'm in a move on a bit under a safety net and civil rights moving to the top of page 22 And start with certificates of discharge. This is our representative Hanson proposal called the New Hope Act is House Bill 1041 that would address issues many of you have highlighted his priorities for the city in terms of eliminating barriers that prevent obstacles for employment and housing and kind of other social justice implications. This would do so by expanding the eligibility to vacate certain non violent criminal records and not passed the house 90520 on March 1st and is scheduled to be heard in Milan Justice on March 21st, then move to page twenty-three agency employees harassment House Bill 1692 that would put disclosure Protections in place for employees reporting sexual harassment and that bill passed the house again, quite quite a vote 92820 and will be heard and send it Steve. Urban and tribal Affairs on the 22nd wage and salary information also on page 23 House Bill 1696 sponsored by representative Dolan. This would expand on our last years equal pay bill by prohibiting employees, excuse me employers from asking about pay history and not passed the house 56 to 40 and has been referred to send it later or not quite as unanimous as some of the other ones but run the session related to wage transparency. I know that this includes if you request there is a requirement that the employer provide kind of the pay scale to employees. I think that those Provisions are included in this bill. I'm referring to several states have laws that say that employees can share their wages or they're up there with other employees and they can't be punished for it. And I thought that there was a bill that they were running this session I believe about and I can double-check up for you. I believe that was part of the Equal Pay Opportunity Act that there weren't you cannot retaliate against employees for sharing what their salary information is with other people absolutely stations with a representative send. Who is that primary sponsor of Equal Opportunity Act last session. I'm excited to see that this is being layered on top of that. I do think it's an essential component and I just want to confirm that the bill Applies to government agencies as well as private employers and believe so no follow-up on that just to make sure it would be helpful to an understanding of that City have done a lot of work around wave transparency pay transparency and led those efforts a few years ago under a different mineral Administration. And now that that information is being published. Regularly. I think we just had her second cycle, maybe our third cycle of publishing that that information would be really important to measure they they are on top of that are hiring practices not asking for pay salary histories. It doesn't seem like tracking people into you. Nope, a history discriminates between private and public sector employment. And in the initial rate of the bill, I did not see any differentiation between that so I'm assuming that that is the case but will double check that and make sure and let you know. But yeah, great extension of the of a huge success last year. So exciting to see that moving the lgbtq Q Commission on the top of page 25 would establish. This commission was in the governor's office and is still moving having passed the Senate 34 to 14 on March 6th and is scheduled for hearing and how state government on the 20th and lastly congratulations on that as well. I'll highlight immigrants in the workplace Senate Bill 54 97 on the bottom of page 25, otherwise known as the Keith Washington Working act. This is a response to some of the challenges that be faced with the federal government and would put limitations on data sharing with Federal immigration authorities without a Judicial warrant and all the house bill is no longer moving the Senate bill passed 3216 and is now in the house all rights and Judiciary Committee and I will now turn it over to Christina to finish with some of our transportation priorities are still moving forward. And unfortunately, I have to start with some bad news. And that would be related to the automated enforcement though. There was quite a bit of support around the closest to block the box and bus lanes and we know that we this is by far the furthest this concept has made it through unfortunately, it wasn't far enough. So we're not talking with other stakeholders and just kind of evaluating next steps on this one. We are very disappointed in this. We are in at conversations now about options moving forward which is challenging certainly but will happily keep you all updated as those discussions continue my understanding from just media accounts. Is that the reason why it didn't move forward is because of concerns that the ACLU has about what's the use of the technology and I'm just wondering how does that differ for these automated cameras from the other automatic cameras that are already I'm authorizing it doesn't we are working to follow up given the level of the unanticipated level of opposition around that to sit down with them and go through both with our surveillance ordinance and other protections that are in place how we get addresses concerns moving forward looking at, you know, hopefully moving into a partnership next session. They were strongly opposed in the stage. And so we are going to sit down with them and are looking for a better understanding of of what those concerns stem from and we may have things in place that we can relate to them that are already in place to protect people are part of a little bit of our soul in here. So we're really eager to see some form of this go through and represent if it's given has been amazing in this process. He has fought for this just kind of with all of his all of his being so we're really thankful to him for all these efforts around this and like I said, we're continuing to engage with stakeholders around this is heat. There's you know, a possible Next Step. So that was my bad news. I wanted to also just touch briefly on an issue that a lot of you are really tracking which is the scooter bill. So it's the middle of page 26 in your bulletin 1772 passed the house 85 213 They're still working on it issues related to indemnification, but it is moving forward. So it's been scheduled for a public Hearing in the Senate Transportation committee on March 20th. So we know conversations are very actively still going on, but we will continue to track this and let you know when it would be a great opportunity to weigh in. I'm going to go back a little bit on this bus automated Bill. I'm really disappointed in the outcome there and we had some conversations with folks over at the ACLU of Washington when it look like things were getting tenuous. And so I think I do have a really important role to play in trying to negotiate with you and others who have some privacy concerns. I think that we here in the city of Seattle made a lot of advances in terms of addressing their concerns when we Technology ordinance for example in Eunice Rhythm curious as to why that wouldn't apply in the scenario to address some of those privacy concerns. This is my my only regret here is that I didn't have an earlier indication that that this bill was in this much trouble and I would have appreciated having had more advance notice and a more realistic diagnosis of the tenuous nature of where that bill was that so I just wanted a flag that in the future. I hope that you all can share a little bit more of that granular detail with us around the politics of some of these bills. I know things are moving really fast, but we have been mobilized enough in the past in this session as well. They required really fast attention to things that are priorities presents. I think you've seen from this Council that the Are several council members were willing to shuffle our existing priorities to prioritize some of this legislative work cuz it's just so important for us to continue to have those legislative fixes to be able to deliver the services in meet the needs of our community. So I just wanted to say that and then last Leo End by saying that I really want to thank representative Fitzgibbon for putting himself out there on this. I think he gave it a very Valiant try and effort and and I think it we would be remiss and not expressing our Collective gratitude for his efforts in this space. It was a clear priority for the city of Seattle and we were the motivation behind the introduction of Representative again it and and fighting the good fight and making me arguments in the debate for us as this is one of our was one of our top priorities and it's going to continue to be I would ask I'm given how strong the opposition became suddenly. It would be very helpful to follow up with you in the very near future perhaps to engage in a discussion with the ACLU. I think that would be very helpful in as Paving the the road for future success. Maybe next session. Following up on your points are cats memory Gonzalez. I also want to publicly thank Representatives given frankly. A lot of folks in the Seattle delegation of been doing some amazing work for us down there a really great to see folks standing up and fighting for some of the things that people live and work in Seattle needs that's been outstanding to see this bill. I'd also be willing to be to engage of work closely with you on our surveillance of privacy work here. And I think this is going to be something that continues to come up from a functioning City perspective. It's just not going to ever be practical to place a sworn police officer on every corner which is essentially how we would otherwise have to police block the box and blocking sidewalks and bus lines. So we need to have some sort of automated enforcement and I totally understand a c high-level concerns about privacy. I believe the city has put in place a really robust set of plans and requirements on her agency's to require the transparency and how we manage that data. I do think that it's on us to continue to demonstrate to the public that we were there. We are living up to the standards. We set on the bill and we need to probably continue to do some work there. I hope that Carlisle's Bill Statewide and encompasses some of the things that we've done at the local level because there's tension between privacy rights and our ability to enforce the law is attention that will continue to exist and they're not mutually exclusive we can navigate that and I believe Seattle has shown leadership in that which is why it's kind of disappointing that this bill is where we are because of all the work we've done but I think we just need double down those efforts going forward to show how we can use technology to make us more efficient and not at the expense of people's privacy given their level of trust and collaboration and around that with the ACLU. I do think we will take you up on up on that in terms of following up and I didn't want to highlight just because you talk a little bit about the kind of the law enforcement angle. Their Cheese Fest has been so amazing engaging with committee members at a drop of a hat through the weekend making calls emailing. She has been such an advocate for this as well. So many many departments. spot in particular on G+ PD has been really engaged the frustration when you have no talk radio host saying I am your sister bastard that that looks like it's actually funny to violate bus lane laws when we are trying to move people through our region and they are actively undermining at and undermine his legislation from kind of far right-wing perspective and it's not just, you know, the sort of the impact to moving a massive quantity of people through our city through the use of dedicated bus lanes which in my mind have finally been accepted as the standard in the norm and the common sense Solutions of how to use our right-of-ways in the city and it took us a long time to even get there but it's also the issues related to what happens when people clog up those lanes and how that impacts accessibility for people who have mobility issues or Issues in our city who just I have seat have personally seen people be trapped on one side of the street because they cannot get through because their bus lanes are so clogged up and they're trying to get through and they're being put in situations that are severely limiting not just the mobility of the people in the buses and other cars on the roadway, but of other people trying to get around with different modes including by foot and so I know that the disability Community is extremely disappointed in the failure of of of this bill. They had made this a top priority for them for their community in the state legislature. And I just think it's unfortunate that we weren't able to find an opportunity where there could be consensus found at to deal with some of the legitimate reasonable privacy concerns while also addressing some of the other complex intersectionalities that exists as it relates to this particular issue. I will also stay on that point. Britain Rights was really helpful in this they put together an amazing video that actually we heard suede quite a few legislators on this and help get this help get the bill to wear it at once. I'd encourage all of you to check out the video that written right to put together. It was clearly illustrates the struggles of people who are disabled to get around downtown. They said they showed that quite a few times of having to Ashley take the wheelchair out completely into traffic or go into traffic and go an entire block down while you're in no traffic Lanes to be able to access the sidewalk. So that was a really powerful voice and they were incredibly helpful in this conversation one more question about the met. The reason why the ACLU is opposing it it's not because of the privacy concerns contained contained in this bill, but that there was another bill that was forward that way. Allow law enforcement agencies to use the images captured in an automated cameras for other law enforcement purposes and that bill failed at the parking the parking Bill. There was a parking bill that was it was because I called your proposal that bill is dead. Now. I think what we it would be helpful. We don't think it would be helpful for us to get a clear understanding from them of annoyed. I read that in the paper as well. But I do think us collaboratively working to understand the Crux of the way to do that this session rather than waiting for next session understood happy to follow up with your offline on some ideas or exploring currently and we really appreciate all Mileena's to engage at that level was we have I'd stick holder we partner with oftentimes who hopefully we can address their concerns. I think that's all we have for you today. Sorry for the mix-up news. Pause of anticipation of that passing in so I think the counselor in Gonzales is point. The sense I sort of have is I wish we could have done more had we known that I actually thought I was fairly optimistic about that build so but I'm not blaming you just saying that down talking to legislators and we can explore some of the options that are looking at with you you all are doing phenomenal work and there's a lot of information. So I look forward to working with you this week. So thank you very much like us are mosquito on the tampon tax, you know, since it does have a budget application and hopefully it will be not a big budget implication. I really do think This is an equity issue that this Council to express support for in the past to get rid of that tax original. I think a few years ago. There was a physical note tied to this that indicated there would be tens of millions of dollars in terms of impact of the state is this tax repeal a good news is that their latest fiscal note shows that that that was wildly off thanks to Eric son from our Central staff who's broken down the data for us really didn't act on cities is only $600,000 roughly and the impact of the city of Seattle would only be about a hundred thousand just slightly over a hundred thousand. So with that budget dust impact, I really am hoping that house bill 1053 can be resurrected will look into that link and let you know. Thank you so much for the video you reference the you describe it or link it to me. I'd like to get at work first actually. Okay. Thank you very much. So very quickly we do we're going to go around the table and and go over our preview of today's full Council actions, Let me just say a few things on what I have and then comes from where we're at. You have to be compressed schedule summer go there and then come back as my horrible. Chill. We just have to two things if I may from the perform our committee and that would be the appointment of side. But as our chief technology officer mini reviews appeared in front of the committee several times and I'm looking forward to that appointment process this afternoon and we have an appointment of Richard short too shallow, ethics and elections Commission in I think he's quite a catch you had a good time going over his resume his background. That's why he would like to share of an ethics and elections commission. So we have those who hadn't for full vote this afternoon and councilmember. Where is she at the floor man? Good morning. Thank you for letting me go early council president appreciate that development public assets and Native communities committee has nothing on this afternoon's agenda still be a sitting a meeting on Wednesday, March 20th at 2 at that meeting. We will discuss for matters of property transfer between parks in Seattle Public Utilities for a water quality project on the ship canal a renewal of a permit for use of DNR land. Excuse me for a community park and water access in Laurelhurst renewal of a permit to use DNR land for water access in the Arboretum and The Soundview Playfield Master use permit for field Lighting in the district last week the office of training Planning and Development. Hell, they're very held the first in a series of community meetings to plan for the development around the 130th Street Light Rail. Stop between Northgate in Lynnwood. I believe there are four plans for this is one of four, so we're going to start doing the charrettes about how Call the community would like this light rail station. What they would like to see on the open houses at Ingram high school and staff from s. Sound Transit Department of neighborhoods. And our staff is well. We had a booth there. It was a huge turn out well over a hundred people and as expected people were discussing transit-oriented Housing and Development transit-oriented childcare issues of walkability green spaces H friendly livability and how they would like to see this proposed light-rail on this Ridge Transportation spine to use for the community. In addition. I'm really excited to share this with my colleagues. Thanks our office Tyler M skiing our staff they drafted a resolution which was passed by the 36th District the 32nd District in the 46th District in that we ask that the 130th stop Beacon be built concurrently with the Lynnwood Link in 2024 rather than 20 31, which means that we were asking that 1:30 is I've been 7 years earlier. We've had really good discussions with sound transit in. Mr. Rogoff about the just the common sense of building the 130th Street at the same time as Lynnwood besides saving millions of dollars. I mean, the only one that moved her once we don't want to just just wrote traffic more than once and we also which I'd learned from public comment up in the 32nd and the 36th is a lot of folks were talking about using the same Workforce in preparing to work with labor in the city unemployment in scheduling excetera. So those were the reasons and so we will all be presented to this Council. Hopefully after Sound Transit your new yes vote in moving forward that we move a light rail 7 years earlier on the 1:32. Stop. I'm normally I don't talk about Awards. I get that this world I got and it really means a lot to me from the Seattle Indian Health Board. It would see Adeline Garcia Tree Service award and we had a lunch in Friday and I want to see the Four Seasons, please. The Four Seasons anymore, right? What's the Fairmont? I think yeah, and the reason why this Important at least for me because it's comes from Community but a lot of people were there we had on his arm tracker Board of Health in King County. Don't you forgot patties name of side plank. I The Ellen Garcia what Ward is so special because I knew Edline Garcia. She was one of the original founders of the American Indian women's service league in the 1960s. I knew her along with chili Cavanaugh, Ella Aquino and Julie Johnson who's still with us and share the Native American caucus for the state of Washington, and I'm honored because Adeline Auntie was wonderful and she was one of those and whose where when I hated to have to get up there and say she was a wonderful woman, but she was mean she wasn't Auntie she did grab you by the grab grab back of your neck and tell you when you were messing up as a foster child in the 70s Adeline was a she was like a second mother to me. So it made it really meant a lot to get that award seconds and I want to thank him a bag so I know she tried to make it but could In our district, as you know, we have a mosque and Saturday I participated in what's called a cup of tea which are mosca's anyway, but we wanted to really they send out more information to the Idris mosque to get to know your Muslim neighbor and there was a huge turnout with press about the shootings that happened in New Zealand and it was just, you know, I've driven by that much at least 30 years. I've been in that mosque three times and worship with your mom there. We've gone to the feast there but having everybody of just what every Faith pack the mosque Saturday was really really he was really wonderful and it was nice that people came together to talk not only about being neighbors, but about caring for each other and about really talking about loving Thy Neighbor. So we have people walk come from everywhere. And it was packed. My understanding is that tonight then was the Muslim Association of Puget Sound is holding a solidary event. At 7 to honor the victims of the New Zealand shooting. I understand that the mayor sent out of statement as well as did our office and I'm all in with that. Thank you. Yes. I first wanted to start my briefing with information that you may have already received a constituent has contacted me to let us know that at the 2 meeting today. There will be members of patriot pair prayer and 3% to statically I believe Matt Marshall and joy Gibson, the security is aware, but they are I believe planning to testify at a full council meeting today as far as what I have on my committee agenda today. There's every appointment to the lgbtq commission. It's a council reappointment. There is no creative meeting this week. We do have Regional Transit committee on Wednesday 4 This is a public notice because we signed the proclamation in between meetings. I just went out for public notice recognize that we did at the council sign a proclamation presented yesterday to celebrate nowruz the Persian new year was joined by council member Gonzalez. And as far as major events that are coming up for me next week. We've got Wednesday morning a Neighborhood House 113th anniversary event. Also big big week for Arts events. There's Wednesdays Arts fund luncheon. There also will be the opening for the office of arts and culture its new office at the King Street Station and then Friday there is going to be an art school or Gala in Fremont and I have on my list something that tells me we're going to just be look forward to hearing more from you about that appreciate that this is happening and I thought that this good stuff but happy to be there and we're to have to make up time with the state delegation. very good Customer Brian, thank U volume Transportation committee does not have anything on this afternoon's full agenda. But we do have a meeting tomorrow afternoon for items on tomorrow's agenda. The first Folks at this table are certainly aware. This coming weekend will be the end of buses in the best. I don't want to rename that tunnel something else now and the train tunnels and honest hundreds of buses will move to the surface streets on traffic. So part of the kind of ongoing challenges for the next couple years of this park the next phase of its own committee. We're going to get a briefing from s. I'm just an update on some of the the pieces they put into place to address that so I look forward to hearing that update. I will use that as an opportunity to get an update from s. Progress on the connected downtown bike Network. We passed a resolution last year. We prioritizing making some of those Investments a lot of The Works going to be happening in the coming months. And so want to make sure that that's on track to we will get a briefing on Street ends. So as top manages Sorry, I thought manages the street ends Shoreline. And so they're going to brief us on they can release some of those three teams have been landscaped in a way to not feel like public park or they just a bit overgrown away. The people can't use them to access shorelines. And so that's working practically to make sure that those freedoms continue to be a public right-of-way and access to shorelines and we will also have friends of Publix free games at the table to talk about some of the work they're doing I'm Karen. Rogers going to be part of that conversation. We will have a public hearing on a proposed comp plan Amendment relating to Transportation impact fees. So we are trying to add a transportation project list to the comprehensive plan, which is a prerequisite to towards considering Transportation impact fees. The original intent was to do that at the end of last year, but it's currently going through a challenge with a here. Examiner that challenge has been pushed off for a couple more months, so it's probably not going to be till late spring early summer that we actually hear that, but the notice has gone out to do this public hearing, which is a requirement 30 days notice to do public hearing, and so we're going to proceed with that, but just want to be clear that we are considering later today comprehensive plan updates for the year, and it's obvious will not be in that they could be in a future complan update if we find a path for that, but we're going to go ahead and check out the public hearing on that. I don't know we can and then the last thing a resolution will consider voting on to support the University District station area Mobility plan. This is been a community-led visioning process about making the rebuild of Northeast 43rd Street a pedestrian-friendly environment. So we'll have discussion on that and hopefully have that was very good. Thank you. We have our City attorney colleagues here. I just want to acknowledge many of you heard that Carlton's who passed last week and I want to say blessings to all of you. I'm so sorry. He was such a good friend and a wonderful attorney. So I want to acknowledge that thank U City attorney's office not heard that yet. So I got up just cause I knew he was ill and so will my please also go to cross and family and the entire city attorney's office and our City attorney and It's a big Big Lots for the city. I'm sorry to hear that. Thank you. Thank you for that. Y'all would appreciate the fact that got to call Friday. Thank you. We have a cup of couple of things actually four things on the agenda this afternoon, or I said councilmember Gonzalez. Thank you for being with my committee last Wednesday. We had some complications and I do want to say a special thanks to Lisa K. What happened? We've got some materials and they were actually staple backwards. So at the table we were trying to get that straightened out. We did Lisa was very helpful. I just want to acknowledge the fact that it was complicated things are in good shape. We've got two ordinances in the resolution that we will be voting on today that correct and a man some errors in coding at the end of our 2019 budget. So last December as we were passing some of the ordinances, so this is just proposing a few adjustments. What's the reminder for the most part? I'll explain it more this afternoon. But again, I want to say thanks to Lisa. It was a bit of a a circus there for a few minutes. So we have the hilt Licata agreement, which is about Pike Place Market the vendors agreement. We do this every 10 years. And what was delightful at my committee meeting. Is that the Pike Place Market leadership including some of the vendors where they're saying how much they appreciated the approach and it was inclusive and so they're they're moving forward with that with smiles on their faces this coming Friday. We have to special committees. When is our select committee on homelessness and housing at 9:30 a m. We had one last week. I will be sharing this one. We're going to be discussing two things. I think of Interest everybody one is how we in the collectively that City the county nonprofits and some of our corporate assistance help with the homelessness response in the recent. Snowstorms and I have reached out to our human services department to Metro to our Emergency Services planners. We have a pretty sharp emergency plan for roads on for buses. Now. It's been 10 years in the making but it work better than it has in the past. We saw that this time what we don't have is the same kind of emergency response for people who are outside people who are homeless. So I'm really going to be pushing for that this year that Metro response has been great as has Parks. I want to acknowledge Christopher Williams and his staff Jason Johnson and his staff. We know that we did some things well, but everything could be improved and special. Thanks. I don't know what you all of you know about what Marty Hartmann did during the snow response. She stepped up opened up some other facilities Starbucks brought food Vulcan opened up yet another facility and it all happened in a matter of hours and we knew the snow was coming. But they have that orchestrated and organized in the future. I think it's going to be very important. So that is something we will hear more about Friday. We're also going to hear an update from our client group on the regional governments test. Kobe's going to be here and Mark Jones many of you remember having met Mark at so you will be here talking about his report but his recommendations are and how we can move that for what it all boils down as we've been saying now for I don't know how many years it is about housing that we have to have places for people to go and the Continuum for people with very low income people who need support around mental health and Behavioral Health and to get that moving. So we're also moving are working with Municipal Court. I want to say thanks to our presiding judge Ed McKenna, he and his team Rover talking with us about 10 days ago about how they want to be included in this as well. So progress will be hearing that 9:30 this coming Friday, and I also have a special financing neighborhood committee at 2 p.m. On Friday that's just a makeup from a delay last month and I'm going to be gone at the last week of March for a few days. So we're going to have a special committee to Friday. And lastly. I'm bringing a proclamation forward this afternoon on the national safe place week. This is a program that connects runaway and homeless youth ages 12 to 17 to Services big thanks to Melinda giovengo from youthcare and also Benjamin Warren will be there from Youth Care and we have I think Jodi weights is going to be there as well today. So thank you for your support. Also YMCA is involved. So we'll just be signing that Proclamation. I think I've got it here to circulate. Thank you very much for reminding me so we have Two copies, so thank you for getting that started. So cancel present. Thank you very much. Councilmember mascara de so it was everything that were talking about. I also just want to know legit for years in the making class. Thank you to cancel Amber Johnson for your stewardship and getting us here and all the council members who been having this discussion for far too long. I'm just really excited about today. I don't have anything else to add to today's Council agenda from the housing Health Energy and workers rights committee solution that we began working on a few weeks ago with all of you with members on from our departments with folks from the change team in this is the resolution that includes a direction and guidance and our hopes for the confirmation process of City department heads in the future of this resolution includes many of the edits. From all of you from the mayor's office and from some stakeholders and we will send out the final version appreciate the clerk's office going through the same to you. So thank you so much again to Monica from the clerk's office for working with customer bagshot to send in some suggested edits as well. Again this resolutions into to ensure that the council has a solid understanding of our expectations as we move forward with potential appointments and nominations and a good understanding of the process of the executive used to put forward her nominees or his nominees in the future. I'm in some cases. We also understand that our departments are various sizes on there is scope. So I need for the process as outlined in the resolution. So the resolution is really I think flexible it recognizes that there's different sizes Scopes level them with our community in the confirmation in the reconfirmation process afforded in this resolution. Make sure that the public has an opportunity to understand what our goals are on Council and what the marriage goals are and the vision is for the Department as well as to make sure that we all have a transfer and understanding of what qualifications are the experience accomplishments leadership and other qualities that we want to make sure we consider as we can. Various department heads resolution also helps ensure that the process incorporates a racial Equity analysis and that folks who are directly affected by Department decisions have the opportunity to engage in the process. So do you think that with the Amendments you've all included the ongoing process that we've engaged with over the last few weeks that this is really forward-looking it ensure its transparency inclusion in an understanding that we need to ensure that we're taking in different perspectives and backgrounds, especially with some of our folks who were most affected by the direct work of the department. I hope to defy what we want to think of in the future again, this is forward-looking and we'll make sure that we've send out an electronic version of this copy so that you all have it on time. That's our present. What's that deadline again? Is it 11 or noon consideration at 2:11? Last minute changes will make sure to flag those for you. But again, thank you to all the council members for your you're really Hands-On work with helping to edit this just want to see if anybody has any comments on that because thank you for working with all the parties that are looking at this process. And so I think we're okay. We'll get it posted before noon. We ready for both this afternoon. You have one more hand out for you as council member Herbalife mention. We do have a lunch and learn later this week. It's at noon on March 21st. And this is really taking off sort of gas today. I'm calling this. Mha now what mha gives us the opportunity to build after four years of intense conversations about 6:30. That's not currently zoned for this type of density. So we know that density is 1 elements of how we create an inclusive an affordable City. More folks are able to have first time home buyer options that we're doing more to protect tenants that were thinking about what affordable housing looks like and how to protect existing house as we bring a new housing. So I call it the ingredients in the cakes that were trying to BayCare and really look forward to working with all of you as we think about what the next steps are folks who are invited to the table at this brown bag at noon on Thursday include Puget Sound Sage Rainier Beach Action Coalition the bcia and Catholic community services that housing development Consortium home site and Washington Community Action Network. So it'll be a nice conversation for at least an hour and gives us a chance to started to get some items that I think are in various committees going forward three items. When is a domestic worker Standards Board to two appointments to the City Light review panel and lastly the Seattle City Light. Environmental endowment commission budget and I'm also begin a briefing on initiative 124 which a lot of you were very supportive of its passage as our great city attorney's and looking out their continued to Defense Initiative 124 related the hotel worker protection safety and health. We're going to have a briefing in our committee as well to see what else the council may do in the meantime. Just want to say I had a great visit in District 3. We went and did office hours at an amazing Bakery owned by Mexican immigrants who is incredible Ally of ours and I'd love to get their you know, our meetings at some point on thank you for hosting us went to Pratt Fine Arts Center and I talk to customer backshot. I want us to do a field trip there so we can all have a Hands-On art experience together and visited the Central Area Senior Center tonight. I'm gonna be speaking at the South King County League of Women Voters tomorrow speaking a future wife luncheon, Wednesday speaking at the United Farm Workers rally at the Starbucks shareholder meeting. Again. This is related to the Pollution we passed last fall that stands in solidarity with the farmworkers the dairy workers who've experienced retaliation intimidation and wage theft. Wow, trying to produce the milk at Starbucks mostly uses their Darigold. So it's a great opportunity to highlight our commitment to labor standards there and then Friday, I'm going to be continuing our last day for District 3 tours were going to go to the Capitol Hill Eco district and gay City and thank you all so much on the March 21st Housing Development and then tied to play some strategy Brown Bag. Some of us I wont. I'll be in Olympia for our Council everyday. I think some of you so I'm going to try to get a feel for how many of us are going to be in Olympia versus here to make sure that Olympia trip is we'll get some good press. Purchase patient. So we'll see how that plays out. Thanks for that customers get it deeply appreciate it. Good morning, after four years and two hundred plus meetings for the summit of which were led by the council. We are at a final action on mandatory housing affordability today. So I'm excited to be shepherding across the finish line for bills. I'm actually three bills and a council resolution this afternoon. The first is a council bill that would amend the comprehensive plan to implement the program the second would amend our Seattle municipal code to implement the program the third would Implement image on a particular site in the Northgate neighborhood in the fourth is the resolution calling on the city to continue our work the compliment mha implementation in other places outside the land use code for each of those bills. There's a technical Amendment adopting some findings associated with them and Using the University District we are going to have the University District have its own separate bill that's on today's injection referral calendar to be referred to the Citywide. Mha that particular piece of legislation will be considered a later on in the spring. Those are the only items related to the Citywide committee on him a chair that are in front of council today. We had the great pleasure of co-sponsoring alongside counselor mosquito a second resolution that will be discussing today 31871 which endorses the final report of the King County Regional affordable housing task force a task force came up with a series of thing about 60 or so recommendations several policy recommendations of funding recommendations about how each of our cities within King County should be expanding or affordable housing and excited to help Shepherd that through Pedestrian Focus rebuild at 43rd and that'll be in his committee on Tuesday afternoon. Thank you councilmember O'Brien, but I also know that you have an amendment for us to talk about I'm related to the Citywide. Mha proposal and I now will turn it over to you to explain that and then bouncing. Gravelly voice of water. Thank you counselor make stuff. Passing around amendment that I will be bringing this afternoon. This is specific to a site that is going through a contract rezone is a quasi-judicial process 7009 Greenwood Avenue. We made a decision on this last year that decision was appealed to the superior court. I'm just last week. I believe it was remanded to us to make a couple of little changes. There's a couple options here that contract reason was done in advance of mha what they were looking for additional height and what we believe unanimously agreed on through the closet usual process was the properties and development agreement that allows and hides and some other time set back and protection requirements for a Jason single family properties of the project down. My Amendment would continue to keep that process alive. So it would exclude that property from the mha agreement and instead have the conditions that we imposed upon it as part of that closet. You just a process remain in place including likely some revisions to the the properties and development agreement, which I imagine we'll come back to us in the next few weeks alternatively. We could include it in the mha process, but then all that work we've done would be for naught and my preference at this point would to keep that process going forward. We thought was complete. Not quite at the moment, but hopefully will be complete in the next month or so. So that's what this I think it's fairly typical of what we've done with the mha legislation is where there are contract free zones in place, but the property has been built is to just carve those out because they were under their own agreement. And again, there is an affordability requirement on this as part of the food of the we put in there that will probably not identical damage a attempted to mirror the what we were going to do the cleanup because I think it was excluded in one place and not the other place but this would make it clear that this is excluding is going through its own separate process, which is almost complete very appropriate considering the quasi-judicial make sure that the property has been under for the last several years. So I'll save most of my speechifying for this afternoon council president and just want to ask that my colleagues consider. Yo, we're going to have four different opportunities to give speeches this afternoon. I'm going to try to limit my speeches to two of those four opportunities that encourage my colleagues to think about this will follow your lead. Thank you. Cousin Jessica. Thank you advise considering it's supposed to be about 69 degrees today. So keep that in mind, legs this afternoon. I'm up for vote. There is one item on the instruction referral calendar that pertains to my committee and that is the introduction of the council bill for city council to consider the implementation and evaluation plan related to the families education preschool and promise at Levi which once again was passed by voters overwhelmingly this past November and we will have a another Converse Mission about the proposed implementation and evaluation plan in my committee at next week. That's Wednesday, March 29th, 3 a.m. Encourage you all who have interest in that to please join us at the 27th of March will be the first opportunity. We have to hear from Central staff around issues that are being identified both by my office and other offices. So invite you to join us to hear from our Central staff what those issues are and how we intend to resolve then we will also have in executive session at scheduled for April 1st at related to the fat bloody to make sure the folks understand some legal issues that might be relevant to your consideration as you are thinking about potential amendments to the implementation and evaluation plan. So happy to answer any questions about that particular aspect. Could you have them and that is all our thoughts were the stone the issue that catch my bag shop brought your attention and council member of council member do I deserve something for thank you, president Harold and thank you all it was really a sad day. Friday Carlton Sue's wife. Cindy called me in the afternoon to say that crawl and had passed away in the afternoon of the Thursday 14th as you might imagine there hasn't been a dry eye over on the 20th floor at my office. It was very difficult to take I apologize for not being able to call each one of you I was trying to talk with all of the members of the government Affairs section 101 and We will certainly let you know as soon as he's going to his promise to let us know in about services and that will certainly let you all know. There's no Carlton suffered a great deal toward the end here. We were hopeful though that you know, an accommodation was going to allow us to continue to tap his his talent and love of the city. And so it was it was really really very hard for us. I don't think there is a lawyer who loves the city more who was better at his job and who was a more gentle soul than Carlton and we're going to we're going to all miss him greatly. Thought I would close a little bit of good news that we received on Friday. It was kind of overshadow, but it's an example of what Carlton help the liver. We had a double win on the rentberry case of which of course is litigation that's maintained by the government Affairs section. Judge Jones Granite are motions to dismiss the complaint not I'm standing crowns, but on the merits of the case ruling that the platform was an expressive conduct that's not protected by the First Amendment and interesting way that same day the 9th circuit also ruled in the same way on the merits of a case that came out of Santa Monica. So that's a that's a very good case. You're moratorium ends at the end of next month of April in wilcom. Sure. We'll be talking with you about the weather what are next steps but I think Carlton would have been really proud to know that that's just another example of the kind of of love for the city and trying to support all the work that you do for Seattle everyday. So thank you for your thoughts. And if you pass it along to the other colleagues again, I'm sorry. It was it would have been very difficult message to deliver on Friday and it's not much easier to understand. Thank you for sharing. Okay to Seattle City council convenient executive session and the purpose of the executive site. Don't discuss pending potential or actual litigation. The council's executive sessions are an opportunity for the council discuss confidential legal matters with our city attorney's is authorized by law illegal monitor from the city attorney's office is always present to ensure the counselors are as questions of policy for public open sessions expect this executive session in in 30 minutes. Is that 11:35 p.m. In if the executive session to be extended beyond that time, I'll announce the extension and it's expected duration or that will secure the room and move into executive session.", "end_time": 5500.7}]}