{"format": "raw", "annotations": [], "confidence": 0.9498078025877476, "data": [{"start_time": 0, "text": "Good morning. Today is Wednesday, June 26th, 2019 and it is 9:32 a.m. This is our regularly scheduled meeting of the gender Equity safe communities new Americans education Gonzales share this committee and the table is my colleague Health member Abel Pacheco. Thank you for being here this morning. If there is no objection the agenda will be adopted sino-russian. Today's agenda is adopted there will be three items on today's agenda first. We're going to hear and possibly 19547 which is an ordinance related to the Community Service Officer program, including lifting a budget Proviso. We will hear from the Seattle Fire Department on their race and social justice initiative change team presentation and last week. We will hear from our friends over the King County sexual assault Resource Center who will present on there really exciting program, launch pad program so full agenda hoping to be able to get through it as quickly as we can. So before we continue to agenda will hold our regular public comment period is usually do no one has signed up for public comment and so we will go ahead in and move past all the comment. So I will go ahead and have Roxanne of the clerk read in agenda item one. And if you are here to present on the community service officers item and invite you to join us at the table while about is being done agenda item one Council Bill one 19547 and ordinance relating to a to a community service officer program for breathing in discussion and possible mode. So we will go ahead and do a round of instructions. And I know we have a PowerPoint presentation and then I'll hand it over to you already. Are you going to give us introductory remarks before that happens? Okay, so quickly first will do in a set of instructions that I handed over to Greg for some introductory remarks before we dig into the presentation. Pittsburgh Arts Council Central staff assistant chief of the cloud Oakley sombrero Kevin Nelson CSL Sergeant 2019 budget Proviso that required the Seattle Police Department to submit to the council report on its redeveloped Community Service Officer program by way of background the CSO program operated for 33 years until it was discontinued in 2004 due to budget cuts that changed in 2017 when 200,000 was added to the SPD budget to allow the department to begin developing a new or revised CSO program and to find Community engagement efforts as well as implementation of a racial Equity toolkit and a program review by the community police commission the 2018 budget included 1.8 million for program implementation, but the program was not fully implemented as SPD staff continue to perform community outreach under the new Administration. Community outreach work was still underway when Council adopted the 2019 budget Proviso 38 - 5 - - 2 the Greensheet that required SPD to submit the report that is before you today. So department is going to talk about the report and at the conclusion of the discussion. The committee will have the option to pass the council bill that would free up the funding for the program to be fully and thank you Greg. Yes. Thank you for the city council supports and really championing the CSO program back into existence. It has been a long process over last 2 and 1/2 years to come to where we're at. Now the presentation that I'll focus on will be more about what their job will actually entail the structure of the CSO program and some logistical items of how we're building the program out all over the next year and a half. So over the two and a half years, we've done extensive Community engagement to really kind of narrow down what this position entails when I first came on they were the CSO program was extremely helpful and really taking a load of work off of off the police officer for the officers go back and handle 9-1-1 calls that is what the program design is going to continue as we move forward with the job will actually be a little bit different because many of those jobs that did the CSO program you should do has now been that those have change that body of work into other other position. So now we are literally starting from a clean slate engagement piece. It really focus on three different things. And in those three things are areas that actually is where the department could utilize them as well. So we have Community engagement in education is being one of the main functions of what the CSO program will do assistant navigating the various systems of Social Services and mental. Services that are available out there. So when an officer makes contact with people how to actually create warm handoffs and then the third thing is juvenile youth services and diversion. So those will be the three primary areas of their focus when it comes to community gagement. What we find is that the CSO program will not replace the engagement that officers need with a community it is to actually utilize them in a fashion where they create opportunities for officers to engage the community. So they will help work on setting up projects or run programs that allow officers to actually work in in connect with community members as well. And that is really important to distinguish because from the feedback in there. There was a very it was the discussion was we want to make sure that it doesn't replace the officer contact with a community. They were what would also focus on is short short term projects of community projects anything from working with communities to do clean ups to do just to end up figuring out how we work within our immigrant Refugee populations how we can write connections out of that and then also to facilitate dialogue between officers and the community as well. And of course 2DS, I know that the police department under your leadership and that of Cheese Fest at really spent a lot of time a lot. A lot of time talking to officer was particularly Patrol officers about the need to engage in proactive community-based policing so we should continue to expect that that culture and that theory will continue to practice will continue with in the patrol officer rank is that is that in other words isn't going to supplant Control Officers responsibility to continue to also engage engage with community and be that Steward an ambassador for the city police department is really focused on building relationships the cross all ranks and in different parts of the department, and so that is not the CSO program is not supplant or replace. That model of work with the whole department is really engaging and is really trying to function engage in communication practices as a whole and so what we want identify as is really craving more generous in our department rather than having The Specialist Group that just focuses on that but she is so can create opportunities because if you don't have a program that actually can create the opportunities it really is difficult when you might be short-staffed or don't have the resources to be able to do that. It is it gives them an Avenue where an object can just engage in a specific program for even an hour or two hours to build those relationships after long-term. So that's where the CSO program can really help benefit of the department and utilizing that resource to make it more efficient and how we do appreciate that commissioned by the city and completed by Sail University. One of the things the top things that comes out other than wanting more Patrol. Is also a deep Desire by people who live and work in the city to actually have personal one-on-one connection with officers. And and that means you don't making sure that officers are out of their car is making sure that they're walking around making sure that they're actually talking to folks with in the patrol areas that they are patrolling at the time. So I just wanted to make really clear to folks are watching that that this isn't somehow going to send a signal to patrol officers that they're relieved of the responsibility and the duty and the training to continue to engage in that type of positive proactive Community engagement correct to system are navigating different systems really how we look at we have arrived in positions that in the department at the duo have as a separate functions. We have our crime prevention coordinator. Really work on prevention work. The officers are more into the First Responders and handling 9-1-1 calls doing some proactive policing practices prevention intervention work. This year was really on the back end which is more of the follow-up. So as we looked at how we navigate the very system Social Services mental health services arrived different other functions in there as we look at our own shelter population to even just people that just don't know how to navigate the very City systems. This is where the cso's are going to be a very handy resource to create warm handoff to Avaya different service bases. And so A day will end up if an officer and an encounter somebody that is in need of food there at the CSO is going to be aware of the various food banks are the various opportunities to let you know to be able to get food within the city. They're going to know with a very secret service is anything from case management to you know, even just general Outreach Services. So this is where the office or on the street is just doesn't have that resource book that can they can actually look down and say oh gosh, I had this agency has a capacity to be able to serve this individual. And so that's where the CSO will be very very handy and what will increasing that warm handoff for leveling up the officers time and to be able to respond to 911. Are going to be available department-wide meaning but they're not going to be assigned to a particular unit or programmatic area within the within the police department is that is my understanding accurate. So what we will do is they will actually have radios so they can actually take calls for service if an officer said hey, can I get to see you? So I should respond to my location they'll be able to be deployed out and respond accordingly and be able to handle whatever services that might be around right now initially before we I and I won't get into it just right now is that we will eventually have some geographically based there will be geographically baseus I was but right now as we kind of build a program up that is not that the start of it because we have to do a lot of training and a lot of other different functions to kind of get them acclimated to what the job will entail and so but the idea is that We have some level of geographical eBay. So they may have already established certain relationships within certain precincts and and have already connections with the community as well call that when you came into my office and we did Bruce me initially about the recommendations in the sly and survived the initial structure. I seem to recall you saying that there will be a time keeping function for this year. So so in other words we could we could trace back. How are spending their time doing? What is that is is that still the plan in terms of making sure that we have a clear understanding as were reinstituting this a clear understanding of where they're spending their time and how they're spending their time, correct? So what we want to do is it we're going to set up for four of us metrics in there. They really design out what they're at weather out. But they're actually entailing so if they're spending the majority of their time and it navigating the various systems in there, then we're going to end up Taylor in the training to really cover that piece. But if if there is if it's equal between between engagement between the navigation systems. And even our youth diversion work then allows us to actually be able to to track that work and I figure out how we put the resources in the training to support them as well because the whole idea is a scrape better efficiencies within our department is super important part of having a data-driven evaluation of how this program is going to be working. My my suspicion is that this will be a wildly popular program and Twelve Oaks at with two of them. Slated to be supervisors, which means it is seen as a real bodies in the field. I suspect that we will be hearing from folks and community that they want to see more folks doing this this type of work. So I think it'll be really important for the city council and the police department to get a good understanding of of how this new program is performing for purposes of potential expansion in the future. If if if our belief of tremendous success comes to fruition, you know, what we're doing a lot of community work for a number of years. We we will take as much as you know, what data driven approach to be able to quantify the work that they're doing but it is also very difficult to quantify a lot of the community engagement work that last many many years in there now and as we kind of understand how this program was built out, we will have to try and figure out what that looks like because a lot of Programs to do Outreach and engagement is very difficult to understand the magnitude of their work and then packs that they have over 200 over at a time. So so we will look at the data driven to really be able to capture a lot of that but we'll have to figure out how our were after capturing. The other side time is going to be attacking an important part of the metric in at perhaps the best place to evaluate that that particular data point would be through the public safety survey. So we must directly in that survey. We've only we typically do evaluate and Survey folks on their perception of delivery of law enforcement Services throughout the city and so that might be an appropriate place to gauge whether or not people are interacting with community service officers and when they do what is their perception of that? Richmond so I would offer that up as a suggestion though. We were Sergeant Nelson actually is right here and I know he's typing away because he's trying to make sure that he captures all that information in there. But that is those are things that we want to make sure that we're at we're tracking. So how would the cause be prioritized most of it? Like I said, we'll be on a follow-up function so it if the officer comes out to a 911 response and they're following up then they're also be some level of proactive work just in general that is done and I identify Community engagement Outreach functions. So you will see that the communion gagement Outreach what kind of more beyond the the proactive work, but they're also be a function of waiting for the system navigation work. So based on 911. Priority one two or three know, it won't it won't be triage that way get off the land of determining whether they need a CSO to reveal respond out to because there are there said all week we encounter in this family. We're just not sure of what's available what services are out there, but she also would probably be able to handle this a little bit better and then it'll freeze up that officer to go out for sub. One of the other functions in there that actually some of the cso's in the previous time. I had done and also were looking at at incorporating that is really mediating nonviolent at disputes which one of the functions is there landlord tenant dispute that we had that done before but a lot of that is for the officer is civil dispute and it is not something for an officer to respond out or take the you know from 911 resources. So this is where the CSO could be a valuable addition to it. He had played a role in back when we had CSF particularly as it relates to unlawful lockout and unlawful utility shut offs and confiscation of tenant belongings and it's been a real Gap in and what the city can do when these instances happened with the cso's gone SPC II on paper. I'm have some ability to intervene but in practice they they weren't so I'm really really pleased to see that this this function is going to be back on the ground. No work cited as well. So so add the next part of the third component of what they will function. Is you services in diversion. Really one of the areas in there. We want that. She is so stupid build trust with a used or we really want to figure out how we can utilize them to keep use out of the criminal justice system. So how are engaging them whether it is in a diversion practices, whether it's peace making a circle processes weather is working with the schools to prevent long-term suspensions and being able to utilize them in some function as well as identify you that are in need of services and being that the crane that warm handoff with the actual service. We have officers that work within several middle schools. And that mostly focused on working with kids that are in crisis or are experiencing some level of trauma, but this is also an extension of how we can utilize and understand the various services that are throughout the city and creating a better a better hand off tonight. So I think this is absolutely important. This is new to the program. Historic nature of the program last week. We had a great committee special committee meeting in community or SPD folks were or at and I think one of the things that really bubbled up from members of the Central District over there to engage in a productive conversation around Public Safety particular as it relates to gun violence was was this particular piece and really a lot of concerned about how you know as a city when we talk about holistic approaches and it's important for us to really address the trauma that many of the youth and their families have experienced that are leading them to the circumstances of engaging in violent Acts or you know, helping put in a position of being victimized by those violent acts. And so I think this is a really important part of this program that is is really exciting to me and I know that we have several community-based. Directions to Partners to do a chief in to the police department has is a hole for many many years that I think are going to be really excited to have a direct Clear Connection to individuals who will have this as part of their three-part focus in this program. So I just want to personally and been the case. I would love to tell the story about how the first time I met you Chief Diaz was in South Park when I first moved to South Park in 2006 and had a little bit of an issue with some of the kids in the neighborhood and you were like all this is so and so and so and so and so and so, you know where they lived in either parents you knew why they were there and then you were really helpful to me is just a newbie resident in that in that. Go ahead and start of really helping to navigate that. So I think you know, that's exactly the type of work that I think we're going to see out of this prong of the CSO program and it just it's really exciting to me to see this and I think this part of the scope of the work he will probably quite literally save some lives to look at many of our communities that have had shots fired in it. And sometimes we just don't know the full impact County Youth it are living in those communities. So it was really intentional that we incorporate a trauma-informed training a component to ensure that the CSO officers are exactly know how they're going to interacted with the youth and what you know what to say what to eat you'll be able to deescalate situation be able to calm situations down and be able to also create warm handoffs to Ariah services. Q&A part of my visit particularly in areas where I know that there is a lot of incidence of shots fired. I'm alarmed by the number of times that I hear small children of the age of 7 and 8 years old asking me if there's anything I can do about the fireworks in their neighborhood and that that cuts deep and you know, the fear that they have about about what they think are fireworks is is we have we have a huge responsibility to address that and to take a trauma-informed approach to to Really prevent prevent that kind of environment and that sort of sense of not feeling safe with you more. So I'm excited to see us as well be able to have a component in their other work love. Nation hear about Services provided to you thin work with youth on diversion programs. One of the things that you guys do in South Park that I think is fantastic is that you have programs for officers to engage with youth on doing fun things like Athletics and I just I think integrating some of that work so that young people have positive experiences with police officers I think is also a really important component. I don't want to put more on the plate, but I'm I'm just sort of reading between the lines here that maybe that's what this one bullet is build trust between officers and young people by developing youth program it exactly like we said at the very beginning that this is not replaced officer engagement piece. It is really too and create an extension and an addition of services to be able to do. Can I use programming for RCA Bollywood star Seattle Police activities League to rent run our youth employment programs in there? But yeah, it is not it will not replace the the work that the officers are needed to to create that engagement piso. So yes. Bring a good point. So the CSO structure as you as we talked about it is 10:00 community service officers. There will be two Community Service Officer supervisors. It will respond actually from the community feedback. They they really sad Community Express that need that it will be overseen by a sworn supervisor. So Sergeant Nelson who is now an addition to the cloud approaching Bureau is going to be overseeing the CSO program. I've given him two duties one is actually overseeing the mounted Patrol unit. And then the CSO program. So his workload is is is abundant but that it is very rewarding. I'm sure so That the CSO program actually fits into the community outreach section and then ultimately under the cloud replacing Bureau, which is where I oversee. We are really focused on making sure that the CSO program doesn't necessarily reflect the sworn uniform. So we wanted to create a distinguishable uniform and a very soft uniform one with a polo shirt and what we also say where are utility pants or a BDU pant, which is basically a cargo pant. It allows for being able to be more functional in the kind of work that we're going to ask him to do and engage in Are they will be clearly marked with a CSO patch and then we just want to make sure that the colors are distinguishable from the uniform. This is not this is not a sworn position. This is a civilian position that really is about engagement engagement. And so we really want to make sure there's distinguishable uniform. Now we come to the training some of the training that we haven't had feedback which is exactly in line with the the job focuses. They will understand Police Operations, but they're really we want them to understand the social work environment. We expect them to be creating these warm handoff, but we want them to engage a lot of very social services to know what they're actually what kind of service is there providing in there. So and what their capacity is because we could create we could have 10 different agencies that they say. Oh this does this function disc has case management, but if they don't have the capacity to be able to do that we wanted that's where that she is so can actually help be able to make phone calls and be able to identify what actual resources are available at that given time. We are looking at Working with one call as well to also know what services are available as well from from their perspective so that if we want to have Partnerships across across all of our citium, so can you give us a ballpark of the length of training and is has training that happens before you're on the job or is a train that happens while you're on the job. So the train will actually so some of it will be on the front end of the job. So there's about over 200 and some hours. I think that I will have the exact number but over 200 some hours of training in their most officers go through about eight hundred and some hours of training. So this is us a small component to that. But some of the train will actually be incorporated once they're on some of that training will actually be throughout the year so will bring people In for a unit 24 hours here 8 hours here for hours in there. But what we want to do is we want to set up Partnerships with a variety for social services were they actually spend some time? I got a day or two in in those agency so that way they really get to know the the people that are in those agencies as well as what services are being frightened and understanding the. Of time of training on the front end before work begins. I'm trying to get a sense of when folks will be on the original. So what we have is so our process is we have now we have over about three hundred in the applicants 300 + African so looking at how this will actually once we start the hiring process. How many will actually be hired out of those three hundred applicants. We could actually hire potentially. Baby, including two supervisors out of that batch, but if we don't we might end up having another another hiring a time where we actually look at later in the year opening it back up for the for the actual program. If we were to hire people within the next two months, even on a rush background which takes about it at least a couple months process. I don't see them coming in operationally until about October and November and then we would want to ensure that we have enough training component within that I would probably say about half the training needs to be conducted at the front end and then there will be a training that they will be throughout the year. So I would lie at address of timeline would probably be around October November weather actually hired and actually starting but realistically I want to say into December 8th, even at the very beginning of the year were there actually being deployed out into the field and in doing some of the work ethic? I know that we're all really eager to see the cso's actually in community doing the work but I do think it's really important to get the training right and get the program right before we do that. So this is probably one of those areas where I'm less impatient and I think the training is really important to make sure that again we are setting these folks up for success and their program up for success as as we were let out into a community and response to City council's a statement of legislative action on page 5 of attachment one that talks about the various types of training that will occur for CSS during their onboarding process. Procedures Ted, you know computer aided dispatch to records management system defensive tactics Wellness for contact with homeless individuals elderly vulnerable members of the Community First Aid traffic assistant list goes on there will be described where there will be an opportunity for there to be pre infield training and then there will be components of infield training that will be ongoing throughout the program. I do think that because the sly response is very general in nature. It would be helpful to to us as members of the city council tag to perhaps get a report back from the police department in from your unit in particular on on the developed curriculum for training both in the onboarding process and ultimately that infield training again. I think this is an important component to ensuring that the Is it successful program in Dulce? Sort of the training is one of those performance metrics, correct? So actually Kevin Sergeant Nelson is working on the train component right now and also the development of the CSO manual to ensure that is embedded policy within the department as well. So we want to make sure that we were diligent about not only the training but also what parameters the destroyer and why we do so should you know should we leave out of this this function of the of the job somebody could come in and be able to take take the helm and be able to run the program as well. So we want to make sure that word for diligent about that even on the on some of the train in there from In conflict resolution Crisis Intervention cultural competency. As we will get even some of the applicants that have applied that have extensive amount of experience in social work at we are we might end up finding ourselves with people that actually could teach an internally it from the CSO. So we hire that she could teach many components of the cell. We also want as we get as we are on board the cso's we want to also be able to have be nimble and flexible to actually incorporate some of their work into ran to the actual CSI programs. Show me the three really desire qualifications that that we want to focus on training and experience a secondary language skills. It is is so imperative that they have ability to communicate with all the different communities that we have in the city of Seattle as well as having experience with mental health and crisis resolution. Are we want to be as we start to is this city kind of experiences a level of mental health and prices the department has had to see double-digit increases over the last several years and how many crisis response calls we respond to and having a level of an extra resource to be able to serve that population is is a great opponent to what's the SOS can provide. Just a question about the term desired qualifications of these bullets. I mean are they desired are they actual qualifications? I just need help to get a sense of how heavily you're waiting these qualifications. So I so yes, they are we find that if out of the three hundred applicants were not sure what to what that experience will end up being Incorporated in so if if you only find that there's only 10 applicants with various language skills. That is something that we have to look at and evaluate whether we open this up for because we're missing certain skill sets that were looking for but but for right now those are desired skill sets that the main body of the other skill set engagement. Is it something that we want as as that is a qualification that is not at this site desire. That is a qualification that we That we hope every everybody has experienced in it is a unique way. Sometimes that you give me engagement is not for everybody and so it if we want to make sure that people do have a level of a community. I know that this job is posted. So I think it would be helpful if in follow-up to this meeting we could get a copy of the job posting just so we have a clear sense of what the kennel in the lingo the Personnel lingo of the city what are required job qualifications versus it desire qualifications. I think I could be helpful are the standard shift. So we want to make sure that we have at least six days coverage of the CSO program Monday through Saturday 10 to be our busiest times in their Sunday not so much but we'll evaluate what the response is. So if Sunday becomes a day that we find that there's a bigger need for csos will incorporate that into the work schedule, but we will look at it staggering the shifts in there. So we have more even coverage rather than just day services so but will be flexible and in trying to make sure that we I waved their time and in what they're actually doing throughout that day. The vehicles will have clearly marked Community Service Officer in there. We've identified green leaves or Leafs that will be the initial vehicle of choice for the CSO program. And so we're already working Sergeant Nelson is working on the artwork with our fleets to distinguish. It is not a patrol car and that that was fine. But psycho GCR green deal letter. Is that a letter? So is Mark with the SPD call or no? They will have asked me to logo but they will be community service you distinguish out Community Service Officer rather than identifying police as the big logo that you see on most. Call Cara. This will be very clearly to say went to me Service Officer. And then identify and what is nexo right now. We are we have headed out through are the unions to ensure that there was no duplication of work or body work issues are PDQ was approved. Our job description was completed we have now posted it. We have had over three hundred applicants and really the next step is to request the to live to see a council CSR the CSO Proviso. That is really what our next steps are. We are already in the process of a wedding out the applications to start to down go down the route of potentially hiring a good Candice that will be able service ESS. Actively posted the job and yet we have three hundred applications. So how does that happen with no weed we post the position position in there. So it was open for about a month right now. We are looking at potentially opening up in and keeping it open until on a rolling basis until the actual positions are filled. So so we wanted to eat out right now. There's being that there's a discussion at the table here. We've had a couple articles we want to make sure that were were being able to accommodate people that are just hearing about it to potentially apply for the position. So my notes say that the the application. Closed on the 18th is that not true this week ago? We actually are looking at opening it back up. So I make sure that we work with no City HR to make sure that I didn't there's no violation of any that any potential issues but until until the end of the reaction higher than all the tents ESO. So we're looking for if you decide to reopen it and accept applications on a rolling basis. We would appreciate knowing that that's the decision that is going to be made so we can be supportive of of that effort. Adorable thank you. I just have a question that would require a bit of speculation on your parts. But do you feel like the re institution of this position might actually help with sworn officer recruitment in that the duties that the cso's will be taking on will allow police officers to return to more. So they're still within a community policing rubric but more traditional law enforcement, you know, it'll be interesting that actually repeat the last the last I'm just wondering if the existence of this new position and the duties that gives those will take on and the fact that this may allow police officers to to focus on more traditional law enforcement functions. What did not that might help with recruitment for patrol officers. So Trying to make sure that all officers are engaged community policing so I not going to do conducting the traditional law enforcement duties but more in in the general of creating Partnerships and problem-solving at various different things that are going on the community and then just trying to figure out how the department supports those efforts. So I think that as a whole is going to continue under Chief Archie best of leadership, but we want to make sure that the CSO program becomes an extension and allows the officers to create a further engagement process. My speculation is is that I can already see potential people say and look I will I want to get into the police department as of now sure, but I'm not you know, I am just going to college Ramen in this function and we can end up seeing them apply for the CSO position early on and then eventually looking at at this is actual police officer sworn position. We find this regularly in the in the parking enforcement where people will apply for a park enforcement work in that environment really understand the job and say I want to actually become a police officer. So I think that that could potentially be a funnel of of potential applicants for the Swarm position. And if it does they will have a very good background already coming to the apartment that is already working with Avaya social services and engagement process is so that would it be highly sought out that is it for the officer rank. So lit right now. I think I really do think just seeing the number of applicants that I've applied. I seen that all the agencies across the country or struggling to Recruit & Hire at the scoring ranks and many of those those departments are also trying to figure out how they get more Community involved in engage in the practices that she is so program is is a plays a big role in that component and I think that'll help really build a lot of relationships that we just weren't able to to produce with amount of Staffing that we have right now. Either questions or comments? I just wanted to thank you all for the work that you have done over the last two-and-a-half years to get us to where we're at today. Of course. This has been a a top priority for many City Council Members since the prior mayoral Administration. We have been really eager to both reinstitute the funding available for this for this program. And you know, we did that not without controversy cuz I think that the prior administration had other funding priorities, but the city council felt very strongly about this being a good policy choice in order to respond to reasonable public safety concerns that we were hearing from people in the city who live it and work in the city, but also being responsive to some of the concerns that we were hearing from Decorative leadership level at the Salem Police Department really wanting to identify real tools and mechanisms available to them to free up officers to engage in more patrolling and and insertive, you know less of the administrative follow-up which which takes which takes valuable time away from responding to 9-1-1 calls. And so I think this is a situation that I would have loved to have seen it happen a lot sooner, but I'm glad that it's happening now and in a really when I look at the various components of the program at the time that the city spent and the department spent and engaging community members around the the scope and the function and responsibilities of the Community Service Officer program really leads me to the conclusion that this is A program that was shaped by Community for community and I think that that's an important part of the work that needed to be done here. So again, it's one of those things where you you have be a little careful about what you and ask for an actual rolling out of and implementation of the Community Service Officer program within communities. I think folks are going to be very excited to see community service officers move about their neighborhood. So really appreciative of all the work that you all have done. Thank you for for all of the hours and thinking behind it. And I know that we have much more to come on this to make sure that it is successful in well-supported program. Yes, that's what we're excited about. There's very few cases were asked if you want more money cheap DS. All right, so I'm going to visit the committee recommended city council passed a council Bill one 19547. All rights any further comments those in favor of the committee recommending passage of the bills owed I will recommend that the city council passed Council bill 19547 with a unanimous recommendation so we're really excited about considering this at full Council this Monday July first second cuz I write 2 p.m. Of a ceol don't have to be there but you're welcome to attend if if you wish I can thank you so much really appreciate it. I think it should not go unnoticed that there have been three hundred applications to work for the Seattle Police Department in this function and I think that is that is a a big Testament to the commitment that the department has has made to really engaging with community and meeting the public safety needs. Our neighborhood so kudos to you all on getting hitting that number and I suspect that number will grow if you will reopen applications and intake applications on a rolling basis. So huge number 300 in a month is absolute. It is absolutely incredible and sends me a clear signal that that there are people in our community who have a real deep interest in partnering with sale Police Department in this in his face and with and becoming an employee of the police department. So I really really appreciate all that you are doing thank you so much for joining us. Okay. We were going to move into another item to so if you are here with Seattle Fire Department into Seattle Fire Departments race and social justice presentation for briefing and discussion. Thank you. All right. We've got that PowerPoint presentation up. Thank you so much. I'm all for being here with us. So we will go ahead and start with a round of introductions and then I'll hand it over to you folks to walk us through our presentation. What's up with names? Good morning, and I'm Harold Scoggins fire chief. Thank you for having us this morning. Good morning lieutenant. Seattle Fire Search Human Resources Seattle Fire. Great. Thank you so much for being with us. Does the heavy lifting with this working and keeping us on task and keep us paying attention to the things we need to pay attention to so I'm going to turn over to Julie and Doug and Erica and let them walk through the presentations and if I need to all add comment sin Ti recruit School retention for women and people of color children's fire safety programs Seattle Fire selection committee process of the Ford tool kits. We are going to highlight the executive Leadership Academy and recruit retention in the presentation along with the importance of increasing the representation of women and people of color in the Seattle Fire Department Workforce. Search look at the Children's fire safety program in Seattle schools was focus on maximizing opportunities for children to have access to fire Life Safety information to messaging for communities of color unlimited speaking proficient speaking populations 4th to look at was originally implemented in 2015. The ret reviewed in regards to the progress from the original implementation. The focus was mentorship and development opportunities with their employees receive when having the opportunity to participate in the community a committee, which is important for employee development. so did I have a little bit deeper in the executive Leadership Academy, which is the executive leadership Kennedy is a new program in Seattle Fire at the partners with the University of Washington Foster School of Business focusing on leadership competencies. In addition to the Seattle Fire Department participation in the program was open up to other fire agency in 30 lens was applied as the program was being created the focus of the ret was looking at equity and equality of the application and selection process in the program. The first barrier being this is an executive leadership program. The original advertisement for the application to apply was first warned participants at the rank of Captain Sandy. But the Captain's Inn Above racial demographics for gender. And race in the department is 85% white 16% people of color 92% male and only 8% female. In addition to the lack of diversity within the department. There were a few interested candidates from outside of Seattle fire range. The result of this was to open up the application process again, so the second barrier was the criteria change in the application process. The application selection process was reopen for a short window approximately a week to recruit more participants from the lower ranks. I failed the class, but the messaging was not clear and who was eligible to apply at the lower ranks was not clear and some cases participants were encouraged from the executive level of leadership to apply but that wasn't a consistent statement across the board for all candidates of the lower ranks. The impact a result of the selection process left some members feeling left out of the opportunity and that the selection criteria was not transparent without diversity in the program their perspective that plays out in the projects that are completed in the program which may be implemented in the department have one View and one level of understanding learning from that impact the next application selection process for the second executive leadership classes being reviewed currently. That's great. I know that you hit a little bit on impact. I'm not sure if you're going to hit this in your remarks, but I'd be interested in just knowing how how these barriers potentially impacted morale within the within those folks who knew that they weren't part of a pool of pre-existing applicants answer of what the fire department did specifically tip to address any concerns that they were hearing from firefighter. It affects our morale considerably. We are looking at the selection process again. There is a clear understanding of how that did affect morale. So next time when we go to have a second application. Open, I think more people at the table are going to be aware of we need to make sure that we're really careful and that we're clear and concise in our advertisement. Yeah, because yes, it does ya appreciate that. What time so the second until kids that we're going to dive a little bit deeper into is I recruit School retention for women and people of color was focus on the graduation rates of women and people of color that's Express successfully completed recruit School the date of him. The demographics was spending from 2015 through 2018 show. There was a desperate impact of women being successfully graduating recruit School compared to white men and men of color in the recruit class has the second barrier for candidates being successful in recruit school. They need to start the physical training early some that means you been starting before they take the entry level test women being built differently need to be aware of the different techniques that can be used by maneuvering their bodies to effectively manipulate the equipment that's required for the drills. The impact during the Spanish 2007 and 2013 only two women were hired in a six-year. Well the effect of this example with the impending retirement to women in the department has an extraordinary impact on the promotion pipeline for women in the department on chart number 6. I'm Paige sex, we're talking about increasing women and people of color in the uniform Workforce chart 7 has some break down to the chart on page 7 Seattle Fire is 7.7 female firefighters compared to the national average of 4.5 Seattle has 22.1% people of color versus the national average of firefighters be 15.9% Although our numbers look good when compared to other City other fire departments when compared to the city of Seattle and King County Workforce. We fall behind in comparison for women and racial subgroups population. that's a really important Point oftentimes you like to compare ourselves to serve the national Trends, but I think in this space it's really important for us to drill down a little bit more local to be much more reflective of our actual population and demographics in the in the regions are really appreciate the transparency of the presentation technology that even though we are doing much better than some Nash and then folks nationally, we we still have some work to do in terms of regional comparisons, which is largely - anywhere we're actually Pulling our potential applicants from is the regional perspective is opposed the national correct an analysis on a recruitment and selection challenges with the lens focusing on recruiting people of color and further analysis for we lose people of color in the process. We need to focus on increasing the success rates on recruits go for women. We need to increase the promotional Pipeline with both women and people of color. I'm slide eight is a breakdown of sworn members per race and gender within each rank in the department is for you that you can look at further down the road and there are a few things that number don't numbers don't tell one story in particular that stays on my mind and is in the Department's history. There's been no more than three black firefighters hired at one time and whis retirements. We now have two female black firefighters one being hired in 1998 and her successor being hired in 2017 as a big gap the predecessor she spoke to me one day and she goes do, you know, do you realize that I waited 19 years for Sunday to be hired that look like me well, So the recruitment on side 9 the Recruitment and selection challenges that hiring process is complex with many required steps and multiple owners Public Safety Civil Service said if Seattle human resources in Seattle Fire, when should have hired a person still has to pass the grind a 16 weeks to recruit school to be successful for some folks that means setting aside 34 months of their life waiting to see if they're going to be picked up in the last recruit class on the certified register and if they're not 135, they go and retest again, it's a pretty long process multiple owners means multiple changes in the process of trying to make positive outcomes can sometimes crate and intended consequences and lack of consistent data for analysis comparison by continually changing trying to make things better than you only have one year of data analysis. Gender and cultural perception can be a barrier in the hiring process not all cultures believe that this is a viable career path and their perception is how a firefighter supposed to lick and continually pro trade in society tall muscular white and male Veteran's preference points can be a barrier to women and people of color most of the veterans on the certified register are white males in the last 20 years. We've only hired three females that transition from the military while okay 1998 the department of women and people of color in scoring positions. The members have been sharply declining with the passing of i1000 where in clear how that will impact our hiring as we're trying to increase your numbers, the general fication of Seattle has significantly reduced fare application full of people of color within the city. Yeah. I'm inside 10 it while we talk about the recruitment demographics where we have gotten the data from for this analysis and increasing the success and recruit school. There's a great deal of mental and physical preparation needed to be successful in recruits go with no time to fall behind in either the academic or physical disciplines. You need to have a clear understanding of how you learn stay positive and focused and the meantime your body is being fatigued and trying to avoid injury you were learning how you and your body are adapting to working under pressure while trying to meet your time house on past the next evaluation and recruit school. That's a lot of pressure. So you wait a long time to get hired to get hired. And now you have the pressure of 16 weeks is why they call it the grinder recruit School. Crush on Pipeline the hiring rates of women have decreased since I do hundred. We now have half the number we did in the 1980s due to retirement today. We have 77 female sworn positions at the 77 females 20 or officers of those 20 officers 18 or eligible for retirement today. Which shortly will leave us two female officers in the lower ranks under the age of 50 if they decide to promote and continue to promote it will take them an average of 14 years to reach the executive level. A similar story is unfolding for people of color peak hiring was in the 1980s, but the highest number employed was 250 1989 since 2004. The African Americans have declined at a higher rate than the total of people of color in the department currently just under half the people. Are ready just currently just under half of the people of color in the department or a normal retirement age today for both women and people of color the promotional pipeline is becoming extinct. The average. Between promotions is 7 years, which means it would take a new employer hire today 21 years to reach the battalion chief level, which is considered executive-level management. 4 slide number 13 specific actions being taken to make changes for a future. We're looking at historical recruiting and hiring data that has been research to try and understand the changes in the hiring demographics in the 1980s Seattle had more Blue Collar working positions. The Central District was predominantly African-American those things do not exist in 2019. The department received funding for a new recruitment position that will be over too soon and addition or Occupational Health position has been reorganized now to include a component component on tactical performance specificity firefighters. Open application. For Cadets. And Senior Cadets is not twice a year at to give people an opportunity to come in and see what The Cure's like in addition. We start a pilot project called suprep that gives candidates on the certified register an opportunity to meet with firefighters. Six times a month to become familiar with the tools utilized a recruit School. EMT is hot once a year for up to 10 students that are paid while taking the certification and he is a requirement before you are hired that can be a cosplayer to some people. How much does it how much does that cost with the average cost of EMT school? I think it's around $1,700. That's what's in our budget about that. We can do more. The cost of entry level test free of charge for Seattle. Where is it departments to charge we are currently engaging with other fire departments in King County to hold targeted Outreach events targeted at women and we are working together with strategies and resources that are shared amongst human resource staff and Fire Chiefs within King County talking about recruiting and closing their many layers within the walls of Seattle Fire and they're in and in other institutions when you start to peel away the layers you begin to see how privileged an opportunity influence outcomes that lead to professional development Equity lens and see the impacts of not having privilege and opportunity outcomes become barriers for women and people of color systems and policies. And practices that are kept in place limit the access to those who don't have the privilege those who don't have the privilege or continuing the position trying to prove that the current policies and practices are barriers an example that comes to mind when I try to talk about this with people is that do you have an intermittent computer problem call it they remote into your computer and it doesn't pop up and the responses. Call me back when it happens again. How many times do we have to keep calling? Diversity and inclusion outcomes will not change until privileges understood and addressed understanding how privileged plays a role as a barrier in an institution in the beginning of creating change each team puts in an incredible amount of work for these are a tease each year. We hope that the initiative will continue to be supported and championed by the city. Thank you so much for those comments. I think the work that change teams do in all of the Departments is really critical and important and I know that there is going to be at least from Alexa dealerships that I hope is unseen by folks who are in the Departments that we continue to have a steadfast commitment to making sure that our racial Equity tool kits and Iris and social justice initiatives are being utilized in exactly this kind of way to really confront institutional racism in systems of privilege that has led to the Unfortunate consequence of exclusion of otherwise qualified candidates of color and women from participating within our government structure and within our systems and so really appreciate the the work that you all do every day to take on that challenge and I think all of us have struggled with this issue for quite some time and I've seen the impact of initiatives like initiative 200 in terms of our ability to to really live are values through our hiring practices and a recruitment practices and hopefully we'll be seeing some opportunity for Change and that space that really allows us a greater opportunity to be more reflective of the community that we're serving. Obviously a firefighter turn on the front lines of so many of today's social issues within the city of Seattle really absolutely critically important for the fire department to look like the community. That that we serve here in the city of Seattle in so long as we have some of these barriers in existence that are hard tip to bring down will continue to I think see the negative impact in terms of the people who work at the fire department's really appreciate all the work that you all are doing here. Quick question on this slide. What when will the targeted recumbent position be hired by Wynn probably the next couple of months. It's a recruitment and career development position. It's not just it's a joint position. So that's designed to address both the recruitment issues. But also the pipeline issues executive Leadership Academy. So we're trying to put that in a larger plan. So when the new firefighter comes in in the future, they will be able to see all the steps that they need to do to rise up the ranks great. Excellent. Anything else on the sworn individuals before you shift gears into civilian cuz I know there's a few slides on civilian. Workforce actually those are for you to peruse through we just was part of the data that we used to create this together high like to push that rraci change semen has given me, you know, we've been working hard on how to change a mindset of our leaders in the organization and this year we landed on a different plan. So we're we're bringing inconvenient all of our managers sworn in civilian four times this year. We've had two sessions so far to 3 hours sessions we brought in an outside consultant to help us do that that's been a heavy lift for us. But if we're trying to change the mindset and open up the minds to inclusion awareness and understanding I'm we all had to get together to do that till we have two more sessions this year, but then after that we'll be able to go forward it. I think in a better way because our leaders Minds will all be grounded in the same place. And I do want to acknowledge that there is an odd here on this slide to the continuation of the racial Equity toolkit. So it reflects that it was done in 2018, but it will be done throughout this year. I think that's a that's a standard and practice that I've been seeing more departments using a really appreciate that and a lot of times it's easy for us to get into that. I've checked the Box mentality and like, okay. Well I did and I'm going to go do this institutionalized racism in and certainly that can't be unraveled and confronted effectively in a. Of of two or three months, right and so takes it takes it takes a sustainable long-term commitment to making sure that that we continue the analysis and and the We acknowledge that it sitter of work. And so I really appreciate the acknowledgement of that in this space in particular again. I think this is an area of interest for all of us that we have really seen, you know, unfortunate decline in the in the number of women and people of color particularly African-Americans within the fire department, which is a very historical departure from Days of past and and you know have really appreciated the cooperation on a trying to identify ways that the city council could support the work as a fire department in the space and will continue to welcome those opportunities here in this committee and on the full Council before we move on Spell thank you so much for the time and for the thoughtful presentation and for your remarks today and most most importantly thank you for continuing to prioritize the reason social justice initiative and utilizing in a very strategic smart way our racial equity toolkits on issues of great shared Imports. Oh, thank you so much for all your time. All right. He's so we are going to move to our last agenda item. And so if you were here to present an agenda item three witches on the launch pad program for case Ark I'm going to ask you to join us at the table. And then Roxana will in a quick moment read this agenda item into the record item three King County sexual assault Resource Center launch pad program for briefing and discussion. Thank you. We have our guest making their way up. So it'll take them just a moment. Come on up folks. Yeah. Oh, yeah. Coming for the assist here. Yeah, of course. And then we have the laptop at the very end that somebody will need a drive since we don't have a remote clicker for the laptop, but it is loaded and ready to go. So once you all settle in will go ahead and start with introductions first and last name and then and then we can go ahead and dig into this really exciting presentation. Coffee's great. Call NLC laser. Awesome. Love us. Yes. So just by way of introduction before you all introduce ourselves and casework to the viewing audience and fan of MK sarek. And I have the honor of serving on the advisory cabinet Sonora cabinet advisory cabinet mixed up in my head and really have appreciated the opportunity to work with case Ark first as a as a civil rights attorney who who Focus my practice on representing survivors of sexual assaults and I trauma-informed approach has to help my clients. He'll ask about the legal process and in civil proceedings and now courses a member of The Advisory cabinet where An opportunity to the digging a little bit deeper and in terms of that the programmatic and policy works that case are does which is incredibly impressive and I had an opportunity to learn it through that about this wonderful program, which you all are going to dig into that really sort of takes on a sexual violence prevention and awareness in Ennis school classroom setting so I thought it would be a wonderful opportunity for us to hear about this body of work. I know it's happening not in Seattle, but nonetheless thought it was really important for four members of the public to know that this program exists with sort of the optimism that maybe someday we could see a similar version right here in our own school districts, El Paso. Thank you so much for being with us with that forward there. I will go ahead and allow you all to introduce ourselves and you can take it away with a presentation. Well first thank you so much to get that microphone really close to you and make sure that green light is on in the stand. It should be on thank you so much for all of your incredible work with the agency. I know Mary Mary Ellen was regretful that she couldn't be here this morning so off on a wonderful summer vacation, but she'll be back. Absolutely. Thank you so much for your friendship to the agency. I know that that means a lot to us on a on a lot of different levels and for having us here today. So, my name is Rachel Taylor. I am the author on both of these resources as well as our Prevention Services coordinator at the agency. So I wear a variety of hats which includes doing direct facilitation of prevention work at the classroom level. So I work primarily with middle school students also oversee another prevention specialist at the agency that does a lot of work on the high school level and I've also done a great deal of our project 360 efforts that are prevention Folk. Supposed to be in Seattle at Youth Care and then on the east side at friends of Youth. Good morning. I'm running at King County sexual assault Resource Center. Thank you so much for inviting us today and for your support, of course, and I apologized to get rescheduled. I think at least I appreciate your patience and your willingness to come back solutely such as the nature of the work. So I guess I'll just start off by letting you know a little bit about where these resources came from and they actually came out of an effort that I was leading with a student here to Seattle public school. So I was working with a student actually at Roosevelt High School who was supporting a friend who would experience the sexual assault of her and her friend when they were talking about that friends experience and my student was working to support that person. They found that they really did want to turn. To their Educators for help and support and they found that while they're Educators wanted to be there to help them and provide resources as much as possible that Educators felt like their skill-set around this topic was lacking and they needed more information so through that partnership. I was able to lead the first educator training at Roosevelt High School where we really took a look at how to create a trauma-informed classroom how to support student survivors in an educational setting and then also what it could look like to start engaging in some meaningful prevention efforts within the school. I'm after that training. We got some awesome feedback from the teachers who said, you know, we need more of it and if we are craving this knowledge so much. I guarantee that other educators are as well. So after that training we decided to jump into creating a resource in recognition that at the time I was the only Prevention Services person at case I'm so with limited capacity. We did want to create something that would help us to get the information out there as much as possible. So we came up with that. First one that you're looking at that trauma-informed classroom. Once we produce that we were able to start doing some training with middle and high school Educators that resource is targeted toward middle and high school staff. And so from there we did receive another Grant to move forward on the Launchpad piece, which is the follow-up and is written for elementary school dances. So that one's not only has information about trauma-informed classrooms and supporting survivors. But the back section of it is a workbook to help Educators in school staff take a look at how they can start doing meaningful prevention work in our communities. So that's a little bit about where the resources came from my intention with the time today is what sort of walk you through. Included the information that we did what our hope is in training Educators and then how we work to continue to support Educators even after we've left the school after that training. Questions before I get started. I think we are ready to dive in feel free to just jump in any point if something does trigger a question right. Happy to answer Que. Alright, just so you know, like I said this effort did come from a student who identified the need within her own school and it also dovetailed with what we know about sexual assault in that one in four girls and one in six boys does experience this form of harm before they turn 18 about if or when survivors will be in our classroom. We know that they are currently in our educational spaces. So we are incredibly lucky to work within King County and Seattle schools. I was just at Graham Hill Elementary last week leading a session on consent and boundaries with 5th graders, which is a phenomenal time students are really engaged in this topic and we find that it is information that they do you want to learn. We also know that as the King County sexual assault Resource Center. Our capacity is limited in our ability to be in every single school everyday. So again the hope with this resource. it's a really good the information is, you know, well disseminated as possible with my personal dream of being that every school has a Prevention Services specialist at some point, so it wouldn't that be wonderful it would be incredible so One way that we approach the issue of violence prevention is by looking at the social Ecology of any school or have any community and what I mean by that is we recognize that students don't exist in a vacuum. Right? So we may have an individual student at the core that we really want to reach and support and engage in prevention-focused conversations with students exist within the context of their relationship. So they have relationships with their peers with their families are caregivers with their teachers and those relationships exist within the wider Community Sophie that the Seattle School District various communities here in the city also in the larger County and then those communities obviously exists in The Wider Society. So we want to make sure that students are receiving support for either experiences that they've already had or a focus on healthy relationships at all of these levels. So we really work as an agency to Target each. In terms of doing individual facilitation with students. This is a training piece that really gets at the relationship and Community levels. And then we also want to work with schools on how to make that cultural shift toward one that does not accept or tolerate violence, but one that absolutely does support survivors and actively engage in violence prevention efforts. And of course, this is addressing both the scenario in which the violence occurs outside of the school, but also scenarios in which the balance could occur on school grounds as well to help Educators to understand the complexities that occur when you know, a student does assault another student what that looks like in a school environment also what you know, the symptoms of trauma look like when they're showing up in our classrooms. So we're hoping that educators will shift from you know, what's wrong with you. So what's going on with you? So, you know, we can identify the frustrations that might come about if a student is falling asleep in first. But if we don't really get at the root of why that student is falling asleep in first. We're not going to successfully navigate that students increase success. So we want to make sure that we are helping Educators to identify what that you know root cause of the behavior is and how can we help a student get that need met in a more pro-social way. And that brings me to our first major goal of these two resources, which is to assist School communities and providing the most effective support of student survivors. So the first part of that is working to help Educators to understand those sexual assault Dynamics. So again understanding that the cultural narrative around the stranger rape isn't the dominant story while those assaults are absolutely terrifying and real and those survivors experiences are valid. We do know that the bulk of our students are experiencing harm at the hands of parents caregivers folks that they do love know and trust and so when we help Educators to understand that Dynamic we can also increase their ability to navigate that alongside their students. So, you know, there are increased layers when somebody harms us who is somebody that we love and that we trust and so if Educators understand that complexity they can better Port there survivors students. We also walk Educators through really the nuts and bolts of what to say. If a student does disclose sexual assault directly to them. So we use an acronym called Basehor aureli. I like to refer to it as you know, check in with home base or go to home base or which is just really focused on letting the student know that you believe them a lot of time survivors due to delayed disclosures because of a fear of not being believed. So even if somebody feels like they're expressing that believe with their body language or with other words can be really helpful to actually say hey, I believe you and then affirming that telling you was the right thing to do a lot of our young people have gotten a lot of messages about how the assault should be a secret. Maybe they've received threats or bribes to keep that a secret. And so we want our Educators to affirm that yes letting me know what's the right thing to do and I want to do anything that I can to support you. So I walked Through each of those core tenants of how to best respond to a survivor in the moment. And then also let them know that they don't have to have the right thing to say at every moment what really matters is that I believe you and I want to do everything that I can to support you and then there are agencies like case Ark to help and assist both the Survivor and the educator as they move through that process further down the line as we do move further down the line. We know that sexual assault is a mandated report which means that if a person under the age of 18 does this close to us at that has occurred we must report that to CPS or law enforcement. So encouraging Educators to make that report in the most trauma-informed way possible. So making sure that our students know what mandated reporting means and understand that our Educators cannot keep that form of harma secret because with an any school environment, it's our job as adults to help keep you as safe as Also letting the student know what the process looks like in a developmentally appropriate way for especially my middle and high school students. I always offer to let them be a part of that report if they would like to I've had some students come sit in with me while I make a CPS phone call. I've had the other students say Rachel that sounds super awkward and I'm not coming and that's also totally fine. But I do want them to be in the driver's seat as much as possible for their own healing knowing that for good reason. We do have that barrier to confidentiality with young people. We know that that agency that being in the driver seat is an incredible it incredibly important piece of healing for survivors still helping them to have Choice whenever possible and really encouraging school to make sure that communication is happening with the student before and after the report. Did you have a question again? And again that usually comes in the form of just letting students know what confidentiality looks like. I know for myself when I come into a classroom with the first thing I do is a list of group guidelines with my students. So they get to have authorship over what we're going to do to make sure that our conversations space stays as safe and respectful as possible just as part of that conversation. I let them know two things. The first is that I am a mandated reporter and describe what that means in a developmentally appropriate way depending on the age group. I'm working with and then the second thing I always get them is what I call power of pass which means that they know that they don't have to tell me anything about their experience that they're not ready to or not comfortable talking about and that ties really nicely into our conversation that we have around boundaries and letting them know that they have the right to an emotional boundary that feel safe to them. They can share information with a trusted adult when they're ready and that's Have to be me but helping the young person it identify at least one safe adult either in their living environment or School environment that they feel like they couldn't turn to with information such as this we also want to develop a culture of community support for educators know that they can turn to their administrators. They can turn to agencies like a sarc with support around a specific case or they can give folks like us I case I could call if they just sit through the training with us for two hours and then find you know, that was really bringing things up for me or I have more questions. I wasn't comfortable asking in front of my boss or my colleagues that they can reach out to us for support. So I think a lot of times especially with instances of sexual assault and domestic violence teachers feel like they need to do and say the right thing right in that moment, but just letting them know that they're sort of worried around doing the right thing is valid and that also they don't have to move through it alone. Our second goal after we've established that information the knowledge base around what sexual assault is what it looks like and how to best support survivors. We want to work to create trauma-informed spaces for all students. So my goal and offering these two resources was to yes absolutely focus on sexual assault as we're sexual assault agency, but I also wanted Educators to be able to generalize that information to other forms of trauma our students in our schools experience sexual assault at very high rates, but they also have a lot of things such as domestic violence incarceration of a primary caregiver substance used to abuse of primary caregivers, lots of different things that could cause a trauma response, you know, even a car accident or things like that. So helping our students to feel safe in their school environment by creating those trauma-informed spaces is only going to increase their ability to succeed academically and socially in the school environment. So the one of the big pieces that I encourage Educators in school staff to take away from this conversation is sometimes when we know that a young person or person in our life has experienced a trauma. We may want to you know, approach them overly softly or not feel like we can ask them to do their assignments or attend class regularly. And so I help them to understand the actually having clear expectations and boundaries within the classroom is excellent in terms of helping that student heal. So if I die young person is experienced sexual assault specifically they may be moving through some intense feelings of betrayal or inability to trust and as Educators that they know that when they walk into our classroom. There's going to be a daily agenda posted they know exactly how we're going to treat them. They know exactly what's going to be expected of them in our classroom that's going to help to sort of calm down some of that anxiety that they may be having about their school day. I'm also empowering students to engage in self-care. One of the takeaways that I got from my students. I was working with at Roosevelt at the beginning of this project was that they had experienced some Educators not necessarily letting them know when something traumatic or possibly triggering was going to occur within class materials for b. A book or a movie or even if they were just doing some independent reading and something came up for them. There wasn't necessarily a structure in place that gave the students a place where they could feel like they could talk about that or receive help and support about that. So and since that time I've had many students let me know, you know, I was assigned to this book in class. I was reading through at night before bed and one of the characters experienced and intense sexual assault and then I had a really difficult time, you know sleeping. So just making sure that within our schools were having that conversation. Letting students know that this isn't something that needs to stay silent, especially not when we are actively engaging a material for the these things are happening also giving students agency over what is helpful for them in terms of self-care. I know that as a social services professional self-care is going to look much different to me than it might to Karen and that's okay giving students agency again to make their own decisions for what helps them to move through that and get support if they need it. We also want Educators to be able to recognize what potential triggers artromick use look like in the classroom. So as I was staying with that student who may be sleeping in the classroom. What is possibly going on underneath that? So what does a fight flight or freeze response look like in our classrooms? So if we have a student who is zoning out cuz that look like a freeze response right that look up just sort of kept checking out for a moment or if we have a student who all the sudden becomes incredibly agitated and storms out of the classroom. Could that be a flight response or if you've got somebody who maybe slams a book on the ground could that be a fight response to looking at those behaviors through a trauma-informed lens to again get at the root is miss you and then by doing so the root way that we can help the student to become successful. And again, we want to have Educators who are building connection with students and this isn't just for our folks who've experienced trauma. We know that healthy connections with safe adults are good for any and all young people or people in general. So helping our our teachers to not only talk about, you know, this more intense stuff, but really get to know their students in a healthy way in a way that helps the young people to know that these are folks that care about me or interested in my life and therefore I could turn to them when something maybe a little more intense or difficult is occurring and again that piece around leaving the door open. So letting students know they don't have to share anything with you in that moment, but that you are always there as a support person if and when they're ready. Arayat another goal that we have our sort of third overarching prevention goal is to help Educators to engage in meaningful violence prevention efforts. So we want folks to know and to understand that these efforts are multi-level. So just like with student support we need to do prevention on that individual relationship community and societal level. We know that the centers of Disease Control and prevention have put out a lot of research that tells us what the risk and protective factors for perpetration of violence are so we know those factors that increase the likelihood Seminole perpetrate sexual assault and we know the factors that decrease that likelihood and so we want school to take a look at those different levels to identify those risk and protective factors that they're able to engage with and address those things that helps for our prevention efforts to be grounded and logically tied to the research and evidence that is out there. We want all prevention work to be developmentally appropriate. So we want to be worth reaching students with the information in a engaging and appropriate way for them. No matter what grade they're in sometimes that case are we here parents have some understandable concerns around talking with young children around Kinston and we know that that is because you have consent has largely been tied to sexual relationships, but we know that consent is something that we use every single day. So helping Educators to create that framework that can then be more easily applied to sexual relationships with its developmentally appropriate. So simply asking for a hug asking to borrow a toy or a school supply is asking for consent. So starting to use that language and to set that expectation with young people as soon as possible is only going to be more helpful down the road. Again, we want our work to be tied to prevention and theory and research Slickers outlining with the work that comes out from the Centers for Disease Control and prevention and we also want to make sure that we're staying abreast of the best practices knowing what's going on in our community and how we can best coordinate and support those efforts. We know that prevention work is also long-term an in-depth occasionally will get community use to reach out to us and want us to come in and do a school assembly about sexual assault and we know that that is not helpful for a few reasons one of which being we will have survivors in that audience and it's impossible to help those books to get the support that they may need in such a large venue also because when you have a one-time conversation, we know that students will leave that conversation with a very high knowledge and awareness of sexual assault, but if we don't talk about that again for the next week month That understanding is really going to taper off in the next time they say they see me they might think I recognize but I'm not entirely sure. I don't remember you. That makes a lot of sense. We've all got a lot of stuff going on. So we need to make sure with real true and meaningful prevention work that we are having these conversations with young people on a daily basis. So whether that somebody like me coming in from case Ark once a week and then those conversations are backed up by Educators are parents if we can really get Innovative with how that looks in the community and we can do it in both formal and informal ways. We know that, you know, I have really achieved prevention status unlock time now consent lady at a lot of school pretty cool. But I know that I can come in with those formal lesson plans, but if we aren't doing that work on the community level where it's going to take us a lot longer to get traction and see change so we may have some awesome lessons on consent and boundaries that are we also encourage Educators to engage students in more informal ways using those class materials to have conversations asking a question. Like I see that you really like the Spider-Man comics. What types of relationships do you see happening? How did the characters treat each other in those Comics? Can you find a example of consent within that book that you're reading or that TV show you're watching. I'm talk to me about that YouTuber you like what's going on on Instagram? What kinds of things do we see about boundaries? Concentra relationships on social media so really engaging students on the in those conversations on a much more daily basis is a huge piece of prevention that we want Educators to see that they can and again a piece of that you think is these conversations feel really intense to folks who maybe don't do this work every single day until letting them know that simply by showing interest in your students and asking them about relationships boundaries consent stereotypes. They are doing some really important work. Also a part of that is identify what's going on in the school that there that are already lends itself to primary prevention and so by primary prevention, I do mean the prevention work. We're doing before a sexual assault or other type of violence occurs. We really want to get ahead of of that violence and start talking to students before it does happen. So identified within a school Community what that already looks like a lot of Schools are already doing a ton of stuff to encourage good citizenship within their student body within their families that attend the school and things like that. So I have an acronym on here. A lot of schools have especially our younger kids have those acronyms that really outlined their values. So if we take a look at this Pride one positive attitude respecting all improving every day dedicated Learners and encouraging others, you know, how does sexual violence get included into this or what does prevention look like through this lens to me a huge part of respect is respecting boundaries and asking for consent. So if we as a school have identified that respecting all is a huge value of ours, how can we include that core tenets of sexual violence prevention in our explanation or when we're talking about those value systems? We also know that you know that work by the CDC does tell us that some of our protective factors are having empathy for others having positive relationships with healthy adults and having academic achievement and I don't know of a school whose not actively working on those things. So helping them see that by doing that there are already starting violence prevention and agencies that case are just there to help. Efforts and work with them to further those things. Again on that relationship level we do want to build that educator student connection also engaging parents and caregivers letting parents and caregivers know that having these conversations with their young people is incredibly important. I'm talking to them about the relationships that they see answering questions and really showing an interest in what is going on in the lives of their young people the example that I always give to parents I'm working with is I don't care about fortnite. I really don't neither do I Exactly what my students do care about fortnite. So I'm going to ask them questions. I'm going to just talk to them about that because if they get the impression that I'm just shutting them down. I don't care about this video game that they like I don't care what's going on for them. They're probably not going to turn to me when something more intense happens because I may have taken away that feeling that I just don't really care. I'm just sort of off doing my own thing. So really taking some time to get to know what our students are interested in what's going on for them as silly as we may think that it is to get your enemies that are super into it and I'm teaching teachers and parents and family members have so much going on right? So when we're just off of our day of work or maybe in the kitchen making dinner, we're just trying to get through Nail time and to bed so that maybe we can have a second to relax and something is just not sure and that is totally understandable. But how can I relationships improve and change if we said I only know what that is. Can you tell me what that means the number of times that I stop student conversations to get can you explain to me? What you mean by the word t because it's not with coming to mind for me, you know having some humility around to my students. I'm ancient right and that's okay. They'll still engaged with me. They'll still talk to me, but I have to have some personal humility in terms of just asking him what's going on for them and understanding that verbiage is really helpful and engaging in primary prevention efforts because if I don't know what tea is that I'm going to miss an entire conversation about drama and gossip and that's going to be really, you know, a really big missed opportunity of really big place where I could have had a meaningful conversation with those those used about what's going on for them. We also want to make sure that everybody who's involved in the school environment is on the same page. So understanding what it means to have a trauma-informed classroom and also understanding that the school of values and reinforces healthy messages around consent and boundaries and healthy relationships because we don't what we don't want is for 80% of our school staff to be on board, but then have some volunteers coming in to facilitate field trips are things like that who are maybe modeling or even saying some unhealthy things about consent and boundaries, so just making sure that we've got everybody on board and willing to learn together as a community. We also know that prevention in the classroom as I was saying those formalize lesson plans are incredibly valuable. So he giving students some real time to sit with the material to learn to ask questions and to have that happening on an ongoing basis. So for example, there is one Middle School in Renton risdon middle school that I work with students at the 6th 7th and 8th grade levels. So there's students that I taught six sessions with us. They were sixth-graders when they moved into seventh grade. I taught them for sessions and then as I move into eighth grade They will receive four more sessions. So we are covering essentially the same topics, but we're doing it in different ways as they grow older and as their experience and knowledge defends, you know, my 6th graders. Look at me like I'm an alien if I want to talk about dating feel like that's so gross. I'm so uninterested, but then my eighth-grade they're like So what were you saying about that? You know, they have some questions and thoughts and we just want to make sure that we're able to build the relationship with them in their school and their teachers over that time. So they're getting as much healthy information as possible. Again, we want that to be formal and informal conversations. We want to teach and to learn through healthy modeling as well. And you know, I hope Educators to recognize we want to learn alongside our students, you know, as adults were still learning how to be in healthy relationships. So having that humility as well. All right. I'm some of the topics that we encourage schools to take down take on or listed here. These are ones that I engage with students as well. So we want to make sure that we're talking about boundaries and consent healthy relationships at the 6th grade and younger level that often looks like healthy friendships and then those lessons and skills are very applicable to dating or intimate relationship when the student is ready talking about drama bullying harassment and just joking. This was a language piece that I learned quite a few years ago where we would want to come in and talk about bullying because that's often times one of the first Power based forms of harm that young people start to see or maybe engage with themselves. But what I was Finding is a lot of my students especially the middle and high school levels were saying bullying doesn't happen here doesn't happen here, but I was hearing different things from Administration. So I started asking what about drama and then they be like My gosh, let me tell you what drama happens all over the place and then tell me a little bit more about that and they would describe the scenario to me. Where as an adult. I was like, oh I would have said that was bullying. So I'm sure that the administrators are calling that bullying before only talk about talking about bullying and our students who like that's not happening here drama. Is that conversations going to go right over their head? The other one that I died in the last couple years has this idea of just joking and how just joking is often used as a way to evade accountability. So where we should see an apology or a you know, I'm very sorry about that or I won't do that again. We're staying at just joking. And so what that looks like in relationships, we want to break down stereotypes hyper-masculinity strict adherence to traditional General Norms are two of those risk factors that the CDC has identified will increase the likelihood someone will perpetrate. We also know that there are large intersections between racial Justice. Sexual assault so we want to make sure that we are working to undo all stereotypes. We also want to build empathy. So building empathy is again one of those big protective factors put out by the CDC at the bottom of the slide. I just included I'm one of the lessons that I do with young people are consent Comics. So give them all the information about consent and then I let them create a scenario where a character is asking for and either giving consent or not giving consent and this is at the sixth grade level and none of the comics. I get are ever about dating or sexual relationships. This one is about two friends who are out of out of fair one wants to go on the roller coaster another one says and envisions being really scared the do the bumper cars instead and this actually portrays a very in-depth understanding of consent because what I see here is I see a student recognizing that lack of Sent doesn't always come out as I know a lot of times. It's really difficult for people to say now. So it's important for our students to pick up on the Nuance of what that looks like if somebody is not saying no and it looks a lot like for sure right guess and helping students to switch from this idea of nomeansno, which I always say is incredibly important. If somebody does Express and know that needs to be respected. However, most of us have been in a situation may be with our friends than wanting to see a movie that we didn't want to see me but we felt like I don't want to hurt their feelings or let them down. So I guess I'll just go and what did that sound? Like, right it didn't sound like oh my gosh. I'm so excited. Can we go to the midnight showing right on Sunday? Right? So helping her students identify the difference between And then the last thing is always just helping Educators to know that case Ark is a resource. So recognizing that just like a lot of our students are survivors of sexual assault. So are a lot of our school staff and they can access case are services at any time. They can give our resources resource call 24/7. They can absolutely receive Services themselves or link students up to resources and then if they ever want to chat prevention, we're always there as well. So that's where the overview of this resource and what our work looks like and it would love to chat through any questions that you might have. I think you covered all of us into a bunch of questions. We could have had this is tremendous work in an amazing resource and it's really wonderful to see that it covers Elementary + Middle School's + high schools and really appreciated the the perspective around Long-term nature of the work and furtive following people through their development is an important part of the theory of change here and I can see that it comes through in the program. So huge. Thanks for all the work that you are doing and pulling together. These really important resources that are available to folks online and otherwise and I think it goes a long way to really accomplishing a culture of consent in and really pushing back on that concept beds that you know, if your subject sexual assault silence, is that way to go we know that that's not the way to go and I cannot the X disorder resulting in compounding trauma that that pre-exist so really appreciate all the work that you all are doing in this space. And I know that you'll do it in various languages not just in English and that is always been something that I've admired sure the cultural linguistic competency of case Ark is is Something that should be recognized and I know that you're one of the few organizations that really sort of centers that targeted population of probation really appreciate that as well. Did you have anything that you wanted to add so much to thank you for leaving work and doing the work you're doing just quite frankly. I think so much of her gender roles to write need to change. So I always try to tell young man that I've ever meant or one of the things that took me awhile to realize was that real men cry thinking because it's so much as I've been very fortunate to have an older sister who has it was a therapist. Especially from man to man saying look is so much of this in with regards to consent and saying look what I think it should be in in so helping a guy that work so early on is so critical because it's it's going to change his long-standing conversation and conversations that continued for the foreseeable future. So unfortunately, but thank you so much for your support and I do have a resource line cards and be loud buttons for you to share you all. I think we've said what we are going to say, but if that's if that's all then this is the last item on our agenda again really huge. Thanks for you all to you all for being with us and I looking forward to Continuing a partnership in friendship in in this in this working Beyond. So thank you so much for being with us. So we are adjourned. Thank you, sir.", "end_time": 6860.0}]}