{"format": "raw", "annotations": [], "confidence": 0.9357835578129572, "data": [{"start_time": 0, "text": "Are good afternoon everyone welcome to the sustainability Transportation committee. My name is Michael Brian and chair the committee joined by councilman Pacheco and staff by Kelly. Today is Tuesday, June 18th 2019. It's 2 p.m. We have three items on the agenda. But there are a couple of them are quite me the items on the first is legislation around backyard Cottages. We will be discussing that legislation considering amendments and my intent would be to vote on amendments and vote on Final piece of legislation out of committee this afternoon, the next item will consider an appointment to the move Seattle. I love you oversight committee. And then finally we have a briefing from Seattle Department of Transportation on the bike master plan implementation Plan before we jump into public comment. We're doing something a little bit different today. So because there are two top Pics of such interest. I have two separate sign-in sheets one for folks that want to comment on the backyard Cottage legislation and a separate sign into folks that want to come pat on the bike master plan Ira me to do public comment twice during this committee. So we'll start with public comment for the backyard Cottage legislation and we'll go up to 20 minutes for that and then more closed Cava, discuss that piece of legislation and then I will open a public comment again a second time later and later in the meeting to do that. And so comfortable take it with you will be open to considering an amendment to the agenda to add a second public comment in advance of the final agenda item. I'll move that so all in favor of amending the agenda that describes if I'm saying I if you're here and when I call your name, I'm going to start with the sign-in sheet that says 80 you and general public comment. If someone on that would like to reserve the comment for later because he's fine up in the wrong one. That's great. Just let me know and we'll make sure your name is headed to the other one, but you're welcome to speak on other issues if you came at 2 and that's the only time to provide public comment. That's totally fine to we're going to go we have at least 20 people signed up and because we have to me the agenda and going to keep his first public comment. 20 minutes. So folks will have just one minute for public comment today to get as many people in before we before you shut down public comment. I'll just note for the record. We did have almost three and a half hours of public comment at the public hearing last week 4 Appreciated so many folks coming out but look forward to hearing from work today. So we'll start Paul Thomas's first followed by John Lombard and then calling that clear again. You'll each have one minute and when the microphone is clear Paul will come Ford. Thank you for letting me speak. I've got five suggestions to do with backyard cottages. First of all play streamline the permitting process especially for existing garages. I build a shed in the backyard a little garden shed and navigating the permit process was by far the most frustrating and exasperating experience I've ever had and I'm 54 years old. I think that says something will you pull the microphone in front of him out to pump? I can't face doing this again. So my garage sits empty instead of being converted to housing. Number to please remove the five foot setback requirement makes absolutely no sense to use a 5-foot strip of property in a tiny city city lot for just growing grass the properties to two valuable here in two precious. Number three, please restrict backyard Cottages to owner-occupied properties. It's no secret that many landlords let their rentals fall into disrepair without concern for the neighborhood in my opinion allowing additional units to be built on rental properties would only make this trend worse your time is up. Thank you thankful, John. nitrogen I'm a candidate for city council from District 5. I generally support the ATU legislation but was too important amendments first after much debate I side with those who believe we should maintain the owner occupancy requirement at least at the time of initial construction. That's going to experiment with dropping it. We shouldn't make the entire city subject to that experiment second. If the primary reason for this legislation is to provide more affordable housing, then we should require that at least one of the up to three units that may result on a given line be affordable to a tenant that 80% of the area median income or below. If you don't want to make that a requirement, you can make it a tax break incentive instead, but if you seriously doubt the feasibility of that as a requirement, and it seems to me that it undermines the fundamental argument for this legislation. Thank you. Colleen you can be followed by Brittany Bush ballet and then Rachel ludwik Good afternoon. My comments they are just about the Amendments have been proposed. First of all and numbers 3 extending the backyard a lot coverage is 60% of our community council of Psalm 2200 people plus including four thousand residents would say no it's to close there's need for Gardens. There's need for space and privacy between the Lots on four and five amendments proposed by a council member herbold. We say yes, we want to prevent commercialization of these new units that would be built and we won't require homeownership on the lot particularly with 12 unrelated people parking for bikes. Yes thank-you councilmember apogee and allowing open railings on the top absolutely know which wall of unrelated people on a lot. These are not community of their supposed to be backyard Cottage. Is not something that's a big Roof Garden roof party location and pilot program for low-income. Yes. That's a great suggestion by council member Herbalife. Thank you. Hello council members. I am here stays cherub cir cup Seattle, as you know, we have been strong supporters increasing people's freedom and ability to construct a to use and encourage you to pass this legislation out of committee in a form that is most conducive to this goal require a year of ownership before construction of a second ATU is unnecessary restriction it will Dance apply for short-term rentals may also restrict Supply by limiting funding source for homeowners looking to finance new 80 years on their property. We do support exempting bike parking from the Florida area calculations as this is in line. Both of our values introduced a purpose of a to use make it easier for people to choose to walk by her bus. We Believe an amnesty program for existing it uses a logical of Equitable way to keep existing pieces of our limited middle income housing Supply safe and in use And finally, I'd like to add that we support and assertive implementation of the bike master plan including truly protected lands and other infrastructure accessible to all ages languages season does races and abilities isn't the Arizona catchphrase black concrete goal and we must build our bike Network ensure the safety of all users. I apologize first time. I got to go after this Rachel you're going to be followed by Janine shingler and then Jessica Western and Venoy my council member herbel a spinner. Whatever my comments today to use. I'm actually very my main concern is climate change. And so I really appreciate that you passed any legislation with his few amendments. That would make it harder to build a used when I'm concerned about is the issue of an occupancy. My family was able to build a backyard Cottage and we have the resources to do it, but I think a lot of families would not have the resources to do that. They might buy a house that already had to connect your cottage or 280 years and have their family lives there have their grandparents, whatever stay there and be able to take on the rest of the load themselves. So it's classes to say developer can build a mcmansion in the city somewhere, but you know what? They can't build free smaller homes for 3 families to live in we're only be building 2000 units over the next 10 years even under this plan with no I meant, so any restrictions will decrease number of families live in Seattle and increase our carbon emissions. Thank you. Good afternoon, Janine shingler and I'm a citizen in Seattle. I want to address adus and the bike master plan. They're related the related because of meaningful impact to reduce human-caused climate change and that might be able to leave for some but when you really think about it, everything is related to human human-caused climate change. So we need to take A Massive Action. I will be able to live here in Seattle because I live in an Adu and I gave up my car after 50 years of driving. I love that. But now I live in the Seattle where the transportation for mass. Transit is actually pretty good but we need to do a lot more every time I ride the bus or take my tricycle out. I see thousands of cars with only one person and I see thousands of people taking mass transit and just think of all those cars on the road, you know the rest of it fill in the blank. This is too important to sit back and say we should have Woulda Coulda be too late then. Thank you. Thanks for coming out to name Jessica. Give me followed by Jessica Simpson and then Randy Banneker. I'm speaking on behalf of the Seattle renters commission today Seattle renters commissioner urges the city to pass a do reform and then go further. There should be no owner occupancy requirement for a to use because we should enable small mom-and-pop landlords to welcome or renters 280 use on their property without having to move into the main house renter should also legally be allowed to live anywhere that homeowners are allowed. There should be no on-site parking requirement when building a new ATU there should be no requirement for to own a property for a year before building a second ATU the city should examine how we can use a to use provide shelter for homeless neighbors programs like the block project which enables homeowners to welcome unsheltered Neighbors on turn on Sunday. Do you buy great examples of what's possible? We should subsidize construction of a to use in high displacement area. So that previously displaced kids with their friends family and neighbors. We should ensure that new landlords of 80 years are given full education of renters rights and should offer pre-written leases that ensure adequate protection for both renters in New Orleans. We should ensure that a to use our tools for Airbnb Mega hosts and we should ensure that Tennessee to use benefit from the same tenant protections that renters in traditional housing have thank you. You can read the full of one in your email sweet squeezed Wadena Jessica. Thank you Jesse and Jessica Simpson. I volunteer with the capitol hill runner initiative and show the cities Seattle has a housing affordability crisis and a climate crisis addressing this requires that we build more densely in the city that we create more affordable housing and that we make viable alternatives to driving we need to cut our carbon emissions by 50% within the next 10 years. This requires radical action IRG to pass this ATU legislation as is or with minimal amendments to encourage the maximum amount of adu's created and I urge you to move quickly on the bike master plan to actually make biking around the city of safe option for people. Just coming here. I almost got hit by a car and there are very few options for getting safely from First Hill to downtown. Thank you. Jesse, council members Want Randy your next and you're going to be followed by I make Wade and then to renewable. Play Randy and council members Randy Banneker and hear my behalf of the Seattle King County Realtors. Want to thank you and applaud your work on the flexibility for 80 using Daddy's are we think the uptake on this opportunity is going to be important going to make a a big difference in terms of housing affordability options in the city that said we're concerned about the limited flexibility on Redevelopment with the proposed if they are limit we think .5 is excessive excessively limiting 25 Square 2500 square foot house plus one foot is not a big mansion make and we urge you to reconsider that piece simply because family flexibility is important. We're seeing families demand a larger home for a variety of reasons including offering shelter for their extended families, so that she to keep that into consideration is to liberate further. Thank you may hold on one second. Swanton for me that she actually needs to run to another event to be back and wanted to say something before you took off. So customers want it now and hopefully be back later because I have to join the workers at the Embassy Suites who have performed at Union with Unite Here Local 8 and our courageous Lee battling a hostile management for their first contract and I've been asked to support them. And of course I will be there at that deliver a strong message Management in a demonstration that is about to start in a few minutes and we will have a delegation demanding that management negotiate a fair contract with decent pay job security reliable hours and respect on the job especially important for the workers of color. These workers are also as you know, I'm part of our fight to make Seattle affordable for all the guns decent living standards in the workplace is part of the equation and so I'm I want to be there but I also want to let everybody know why I wouldn't be here for a little while. Fully support the legislation. I fully agree that we should not we should have our strongest possible legislation. And if I get back in time for that, of course, I will be voting for it in committee. But if I don't then of course, please be assured of my support and I will be voting for it and city council meeting and I really appreciate it cuz I'm a run to the workers at the hotel. Alright Meg's you are up with that priests interlude. Seattle and I just had the joy of I think things run it by a hundred and twenty some folks up on the 7th floor of City Hall today asking me to join us and calling for a dream New Deal for Seattle. Both of those pieces of legislation here today are examples of Transformations that in our city very supportive of the a DUI and the legislation very supportive of this committee holding us accountable to the bike master plan. All of those things are moving faster. We need to find and we need to build I am especially concerned as far as replay of what happened on 35th and terms of that agreement. We have fun day. Why is it getting pushed off and I would invite any of the city council members who are not getting signed on to a green New Deal for Seattle to join us and sign on today. Thank you. You're going to be followed by Alicia Ruiz and then Alice Lockhart and will take about 10 more minutes of comment for this phase. And then we'll then we'll suspend public comment to where my name is Sherry Newbold and I volunteer with more and I also am a residential architect that's designed over 20 dadu's need to use and I also have a day do at my own home and I just wanted to comment specifically on flexibility for the dadu's adus, especially the second ones. I think that it's important to not have any restrictions on adding second adus because it's going to make it quite difficult for many people to add them to their property and I'm specific more specifically concerned about amendments four and five that are proposed with Airbnb. I've had a number of clients come to me and say they are going to have family staying the Adu for part of the year, but then they want to Airbnb it for the rest of the year so that they can afford to pay for it. And I also just don't agree with there being any kind of ownership requirements. Simply it's going to make it more difficult for people to add them. Thank you, Siri. I'm Alice Lockhart with 350 Seattle. I'm here a lot. I'm here a lot because we need as we spoke this morning at in the announcement for the transformational change. We don't need incremental change too late for that for when We work for years on. Gentle climate friendly housing in this what is a piece of climate like legislation. I begged council members not to vote for amendments that weaken the legislation specifically the prior ownership Amendment will make it more expensive to build as well. Just put a $40,000 tax on any given that cost will continue to rise during that waiting period of a year or possibly folks will buy property hold on to it for a year as cost continue to rise and then separate from the original project of building an Adu. I am so sorry you end up with How much more expensive second day to you that's going to be at the climate on friendly, please don't do it. Sorry for the family. Alicia and after you Alicia will be by Bill Sampson and David souter. I will strongly support this legislation as building adus is a plus for housing affordability and the environment and we support the removal of both owner-occupancy and on-site parking requirement for this is vital to the success of this vision for a city for the record. I remember Zappos any restriction to Farr with that being said, we saw we support today's amendments excluding garages from that total in addition would also like to voice her support for the amendment to allow for rooftop gardens and seating access. Thank you. belt High council members of thank you for giving me the opportunity to speak today on my speaking today as a present of Seattle at the Sierra Club volunteer. I'm here to speak specifically about Abel pacheco's amendments about bike parking incentivizing people use bicycles instead of driving. I don't personally by school, but I was my friends do and I think it's important to Azure. We're adding density and a to use to build bike infrastructure onset of car infrastructure your people use whatever type of infrastructure you build know whenever bicycles to the airport. Most people drive on the light rail came in, you know, a lot of people like to take the train to the airport instead of driving. Thank you. David and then David you're going to be followed by Robert catch and then Richard Allison's the last person signed up in the last person have time for that worked out. Okay, 3 the ud the increase of the rear yard light coverage a gentleman spoke before about trying to modify the 5 foot setbacks. Not sure if you can do that right now, but I think that's a great idea. I think that if I foot setback in for rent on top of a garage door or just the two restrictive and I think I think the internet in terms of the entire run on Rock Band 2 requirement. I don't even think it's constitutional you just raising the flag on that one. So if it becomes an issue, I think it's also something that you can tell people that can't you can't do it. So thanks David don't believe there are any amendments to bring back owner-occupancy today are in a few weeks, but we'll keep an eye out for that. I am Robert catch. I'm here talking to 80th and Pike. I'm also the culture of Beacon Hill Safe Streets. And just to throw on we did sign on to the green New Deal, We are participating in that after I have a Spotify membership base as someone who thinks I look at and wanting to do personally myself as being myself owning a condo or something like an Adu someday or living in one getting a little bit more privacy than I have in my apartment today, but I'm also someone who doesn't want a yard and I just would like something and I would like to see more of these built so that someday I could maybe have one I don't know about the rest of people for me housing is always been difficult prices are confusing of always live with people and I would like to see more options become available with the hopes that someday I don't have to save up for a 1.5. Million-dollar starter home and I might be able to find something cheaper us about the basic bike never come out of time. Do I have to sign Robert but that's okay. We'll keep the streets for the streets 4 people sign up on the podium. I never told you. We've been joined by cows present here with you. Thanks for being here. Thank you for this opportunity to try to talk to you about saving trees because last time I was here, which is just a week ago. I tried to talk about the idea of that. Urban Island heat effect could have mortality in city of Seattle and then two days later the headlines of Seattle Times has Seattle unprepared for deadly heat waves made worse by climate change. And at the same time this is supposed to be about climate activism. You're reducing the requirement for new trees be planted. What am I rich you going to reduce down two trees at least 1/2 inch caliper measure 6 in from the ground is a tiny trees to replace big canopy trees. This is hypocracy. Where is the green? Where's the Green in the green, New Deal? Saving trees in exchange for extra parking not doing that. Not doing anything to save the trees have putting in some. Well, they have the option to save trees. Isn't that nice and then reducing the planting requirements? They're expecting mortality of 725 people to diaper heat event in the city of Seattle. This is what the Seattle time set on June 14th, 2019 in Europe in point 2003 70,000 people died in the Heatwave in Chicago 1995 hundreds of people died in heat wave climate Justice trying to save climate here, and we're cutting all the big trees down with your all about saving Urban heat island effect, and we're reducing the number of trees be planted. Thank you so much. Kelly's with that going to close public comment may have missed the beginning. I have a separate sign in sheet for the bike implementation plan. So we will have a second round of public comment later in the agenda. But all I will ask Kelly to read in agenda item number one. Which I took somewhere and maybe didn't get back to you. We're going to get in a second. How long is a presenter forward Holly would like to introduce yourself or we getting the actual title of the bill? Cancel bell 11954 for an ordinance relating to land-use and Zoning commending sections, 23440 11 23440 14:23. 44017 23440 2023 44041 2345. 540-523-8400 22038. 403-223-8480 3/8 and 20386.007 of the Seattle municipal code to remove barriers to the creation of attached and detached accessory dwelling units and add floor area ratio requirement in certain single family homes. Thank you so much for that colleagues briefly. This is a project. I've been working on some of us for a few years. I account maybe his knees for for me. And Oregon closed today is we have a number of amendments and we'll walk through and you get a point where we can consider each of those amendments and then pass a bill out of out of committee that we need too much background on this and I call you just proposed did we start by just going through the amendments in the order of the simple stuff? Memo Batali you want to say a few words is great and maybe uncountable 119544 that would have been the land use code to remove regular regulatory barriers to the creation of accessory dwelling units that I'll refer to as a t used throughout the conversation if I say Say a daddy y mean a detached accessory dwelling unit and implements a floor area ratio limit in single-family zones. The committee has previously discussed and had briefings on the proposal at their meetings on May 7th and May 29th and held a public hearing on May 11th. So today and June 11th, I'm going backwards in time today unless committee members have general questions about the proposal. I'll just walk through the Amendments that are outlined on pages 2 through 5 of the central staff memo and there were two additional amendments that were developed after the memo that was published Amendment 13 and 14 copies are available for the public and I have them for committee members if they need them an addition Amendment one was posted separately to the agenda. That's a substitute bill. Call anyone have any concerns about just jumping in 2 minutes send is a subsidy version of council bill 11954 for that incorporates a series of technical changes and clarifications to fix typos and other graphing errors identified by Central staff given the number of amendments and the time between the public hearing. It is likely that they'll be additional tech technical Corrections that will need to be incorporated at the full Council. But this is what we've identified to date. This is unfair by councilmember O'Brien cause any questions on amendment number one, I will go ahead and remove them and the number one just to reiterate what I think I heard you say Ellie is when we get to the end of this will probably have some other clean up things that will do. So we maybe do another version of this or subsidy version. Whatever is easier when you get some Council Amendment 2 is sponsored by council member O'Brien this would request that the Seattle Department of construction and inspections provides education. No materials about becoming a landlord to Property Owners at the time of permit is issued for new Adu and notifies both Property Owners about any upcoming trainings for for new landlords. That sdci offers or that they are the other groups may offer that STI is aware of two colleagues. This is come to my attention from some folks that have and are considering building backyard cottages and they've just highlighted that they are getting into the landlord business for the first time and have so had some challenges navigating the host of regulations. We have the city which is a bit of a separate body of work, but what it flag was this concept of hey every time we issue a permit for Adu or a detached accessory dwelling unit. There's a pretty high likelihood that person's going to be a landlord and maybe a first-time landlord and so we should use that list is what kind of mandatory reach out to let him know we have resources available. Any questions on that one? I will go ahead and move. I'm in the number to on favor signify by saying I meant three is also sponsored by council member O'Brien and is found on page eight of the essential staff memo. This amendment would increase rear yard coverage from 40% to 60% provided that the increase in additional rear yard coverage does not result in removing trees over a certain size the bill as proposed would allow this increase rear yard coverage for single story a to use this amendment in response to comments. We've heard from property owners who have existing accessory structures in the rear yard. This would allow them to convert those structures or do additions to them and add flexibility, but would continue to provide the same requirements or have the same requirements that I could only be achieved. If it doesn't result in loss of trees over a certain size practically speaking in most cases, you could not have a two-story structure that covers 60% of the rear yard cuz Are there size and yard requirements but it just provides more flexibility for people who are building a to use in their backyard clear on this one folks. The the overall lot coverage requirements still is binding which is you cannot cover more than 35% of the lot. There is a separate requirement in the backyard and depending on the configuration and we've heard from some folks that are trying to convert a garage that it could be a tight constraint and frankly. I personally think more and spaces opposed to warm accurate spaces where the public can actually see it is probably more of my but I would enjoy but this seems like a I didn't cause me any concerns to remove that in the backyard. Call you have any questions on that one. Can you talk about the protections that are currently in a bill for trees Char said the bill does not change any of the existing protection for trees that are already in the land use code on so it doesn't reduce protection for four trees. What it does is it makes the clarification to requirements for new trees for a single-family development. So it's a bit of a cleanup correction from the mha legislation but it also adds a new requirement that for lots for single-family lost that don't currently meet the requirement for what would be expected. What a new single-family home is constructed when they're adding an Adu they would be required to plant at least one tree. So it in fact increases potentially the number of trees on a lot and doesn't as I said changed what protections are already in place of rules about what when and where trees can be eliminated with continue. I know I'll add that. There is an ongoing. I have an ongoing interest in our tree ordinance overall and counselor megashot has agreed to try to leave that work in her remaining months on the council love with the hope that we can get through that before the end of the year. And I think that's a comprehensive look at our tree code city wide and how it shows up in a single-family zone is is an important thing to do specifically addressing it through this legislation didn't seem like the right way to do that. So I'm calling so I'll go ahead and move amendment number 3 signify best anti Amendment 4 is sponsored by council member herb. All this amendment would prohibit short-term rental used in any accessory dwelling unit permitted after the effective date of this ordinance to ensure that the changes to increase accessory dwelling unit production is contributing to long term housing needs to address the need for more housing in Seattle. Thank you. So this amendment is designed to make sure that this legislation is really focused on the goal of increasing the availability of affordable housing where in a affordable housing crisis, and I think we really need to be focused on making sure that the units that we are making possible to be built that are currently possible to build are used for for long-term rentals the when we debated the policy around short-term rentals a couple years ago Puget Sound Sage took a strong position and was really leading the way at leading the policy development through some analysis that they had done about the proliferation of short-term rentals in housing that would otherwise be rental housing harkening back to the analysis that they did then they have weighed in on this legislation as well in support of of my Amendment and they identify the fact that The impacts of allowing Str activity and AD used will primarily benefit of people who own homes and households of color benefit less than white households from renting out their homes because home ownership rates as we know are not equivalent cross race. So you couple that with the research that they did in 2016 about the growth of adu's and where that growth is occurring you can see that there is a very sharp rate of growth of Adu activity in neighborhoods that are opcd analysis have identified as neighborhoods of at high risk of displacement so you can see Delridge Rainier Valley Beacon Hill Bitter Lake and Northgate are all neighborhoods that we have I done Fight as neighborhoods at high risk of displacement, but also are seeing the growth of ATU activity. So whereas our I think our legislation radioactivity or Airbnb activity address the conversion of some of these units. I think that if we are really going to be focused on making sure that we are dressed addressing displacement impact the policy that we passed here in our city. We should make sure that I'm policies like the ones that we have before us are not actually adding to those to those Spider-Man packs. So I know there's been some suggestion that we should deal with this issue outside of the bill and maybe reopen the short term rental legislation, but you know, Dermatologist station, I think was really focused on stemming the conversion of existing housing to short-term rentals. This legislation is about new housing that we're building. I think it's entirely appropriate that we address this really critical issue within this bill. So I hope we can do that. Cuz when I wrote thank you for this amendment and thank you for sharing the information from the past. I share your concern about prioritizing this this not necessarily new but hopefully more robust housing type that will be created as a result of this legislation to keep that focus on being long term housing. I don't support this amendment at this time. However, because I think this should be taken up and has a more comprehensive piece of short term rental legislation when we pass the torture my legislation at the time of few years ago. I didn't think it went far enough. I personally wiped would like to see more restrictions on it The Advocates at the time said that the largest challenge they're facing was pills that are doing multiple units right now or legislation. I believe prepping for wrong alley allows people to rent out their primary resident residence plus one additional unit and one of the cancer. Things I have around this is the home owner wants to build a backyard Cottage. They couldn't use that if this were the past they couldn't use that as a short-term rental, but they could buy a single-family home next door and they could use that as a short-term rental. I would be much more interested in keeping that single family home is a long term rental. They may choose to build a backyard Cottage on their water they may not but if and if it prevents them from building at we're just a unit short that made may not have been used for long-term rental single-family home next door. If someone was going to buy that to use as a short-term rental and they choose not to that housing unit is available for someone else is supposed to not even get built the complexity. There is some complexity and I appreciate even integers letter they talk about the desire to have low-income homeowners have access to building adus and I think there's an open question that I would want to have more disk. Some of the public on before we move forward on supporting this amendment about who is most impacted by the short term rental restriction. I've heard from folks in the community. You say I would like to rent out an Adu for 9 months of the year to someone in college or grad school. And then for the three months in the summer be able to short term rental it and don't know where I stand on that. I mean that's that's mostly if a long-term rental and if they get a little extra income over the summer because of that and that helps them build it are we better off or not. I would love to see someone like Sage or other folks do some analysis of who might be impacted by that sort the moment for me. I absolutely support the intent. I know the mayor has sent us shares a concern if I think she probably support to my suggestion email turn a suggestion would be to ask the mayor others to work on potentially opening up the short term rental legislation in again with a proposal if we think our existing light Station is too permissive allowing a primary residence plus one additional unit that we do that comprehensively this land use code if it follows my timeline will go into effect Sometime Late July or early August and the units that would be produced under this would still be at least a year away because of our permitting and construction realities. And so I do think we have a window of time to dive into that before the year's over. Of developers in low-income communities of color that already faced with a lot of displacement in that impact. I would just again say that the short term rental legislation was about the conversion of existing housing that could be rental housing to short-term rentals about stemming that this is a bill that is about building new housing. And so I think it's a completely different policy decision that were at that we're making here today, but still a policy decision that has the the the the likelihood of exacerbating patterns of displacement that we're already seeing our communities. I think they also prevented people from buying brand new townhomes and using those are short-term rentals. So it also had a significant impact or buying condos as they come on. But the new stuff that got built also couldn't be turned into short-term rentals and I think that is appropriate except for one four-person toe and I would also hope that we can handle some short term rental before the end of the year legislation short term regulations for short term rental regulations. The existing regulations for related to short-term rentals as council member and cut some of her both have noted is that you can operate your own home plus one additional unit and that additional unit could either be an accessory dwelling unit on your lot or a unit anywhere else in Seattle. So as the bill is proposed a homeowner could add 280 use to the lot under no circumstance. Could they offer all three of those units the main house plus the 280 is a short-term rental, they could offer their own home plus one of the 80 use the Third Day to you would have to be used for long-term rental or bacon or for being a homeowner wished for anything that's not short term rental using is allowed in a single-family Zone what the in terms of the homeowners. What we have heard is to some extent that homeowners are looking for some flexibility and how they use their property and how they gain income. However, they would still be permitted with this. Legislation to offer any AD that was Bill prior to implementation or as a short-term rental as well as their their own home. So it's it's not entirely I would take clear how it will impact the choices homeowners are making but I think I mentioned the previous presentation what we learn from the survey of property owners in Portland is that flexibility was important? So I think it's a bit of a balancing of providing that flexibility, but also thinking about the long-term housing stock. So I'll leave that hard decision for the rest of her all of you. Thanks bed introduction. Generally green with councilmember herbold than the thrust of this legislation is for long term housing long term housing. He's not short-term rentals. I'm trying to show to get to where she's going. I guess I make a fundamental difference between a detached Unit A. If you will that will require more financing more permit processing Etc more costs as opposed to someone that is struggling to stand their home and maybe they renovate a basement if you will the downstairs to get some short term rental in in order to stay in their home. So your proposal seems to the two private all of that and I was trying to show to get to the ground where the Dodgers yes, I think we should keep that for long term housing but the attached the ones with lower cost as a means to keep people in their homes, I would think would want some more flexibility you there and if it's on a short-term rental basis obit because of Troy, Key people in there just me houses as much as possible. So prohibited any attached. Tatsumi detached accessory dwelling unit permitted after the effective date of the order of the council introduces for those folks that are really on the on the margin fixed income and the Airbnb model now has come into effect in the may help them subsidize their existing Market. So you cancel. I appreciate you coming over hurdles Amendment, but I kind of air on the side of supporting cast member O'Brien on this one given that to build an Adu It's relatively large expense and giving homeowners the flexibility to finance the a t u r d a d u I think it's important, you know given my district. There's there's a half the district is a student population and that student population at think you know, when they're not in court or not in session or where the children's hospital I think about how that could potentially impact them. If they're if they're doing a residency. They're not there for the 4-year does a homeowner then not have the capacity to then be able to pursue a short-term rental to finance it so that that's where I kind of side. I would like to proceed at this point. Did you hear what I whispered to make an amendment? And then we'll see where the bolts and then I'll move to amend. I'm going to slaughter this alley. So very valid moved him in her amendment 2 minutes such that we were strict. Is that allow Autos the flexibility short-term rentals to be clear on what you all will be considering is a dumb page 10 of the central staff memo at the bottom of the page and section B, it would read a short term rental use may be located in a principal dwelling unit a short term rental uses prohibited in a detached accessory dwelling unit permitted after the effective date of the ordinance introduces. Cancel that one 19544 and if I could go back for a moment, it should actually read a short term rental use may be located in the principal dwelling unit or a or an attached accessory dwelling unit and would be How to detach so that might be language I clarify in a cleanup bill, but that would essentially be with it. Just so it would prohibit and detached accessory dwelling units. It would allow it and attached accessory going through the motion to amend the Amendments have been seconded. So we have the amendment to the amendment first. So I believe we need to vote on that. I will support the amendment to the amendment even though I will not support the actual amendment in the moment, but let's get through this cleaner version for so I'm all in favor of supporting the amendment to the amendment signify by saying hi. So now there is a revised amended before us just to reiterate one more time. This would prevent short term rental use after the effective date of the bill in in backyard Cottages in detached accessory dwelling units only. Do you want to say anything more to that at the moment? Amendment it still fulfills the purpose of my attention in the amendment and really helps us make sure that this policy does not further add fire or fuel to the fire of of speculative activities that specifically and most starkly impact fees of people in high displacement risk areas. Please signify by saying I suppose you're saying no no, okay. So that one fails on a 2-2 vote so a couple options going forward you all know this but for the public could come back in this form or slightly different form a full Council. So the amendment requires in would have required introduction of a new bill with cuz it would have been the title of the bill. So we kind of messy to bring it back you could of course vote down the overall legislation to fill Council and defer it into lad. I'm not suggesting we do that. So what I would like to propose in lieu of that and I'm happy to work with you all offline if there's support to do something different but to put some language in the bill, I'm probably in a recital to request that the executive bring of I consider bringing short term rental legislation to us that is a little more comprehensive. I don't have capacity in the sustainability and transportation committee to do before the end of the year is almost certainly be your committee cast member take out. So I'm not sure exactly how that may play out. I I would actually be interested in taking up short term rental legislation between now and the end of the year, but I don't know how much I just so I understand your objection and in this is really friendly discussion because it sound like you agreed in principle in you and confirm Pacheco agreed in principle that we are trying to achieve long-term housing. We recognized the beauty of short-term rentals and want to give people flexibility you agree that in this legislation what's driving our policies are long term housing but your preferences to hold off on making steps of changes until we take up cuz there's two things separately. Then we're going to restrict it in backyard Cottages, but not other single family homes or condos and so I don't think that's necessarily fair. I understand. The thing is I I think the complexity around this and backyard Cottages. I would like to better understand. So I do hear from people that say my goal is to build one of these. I'm going to short-term rent short-term rentals. How to make more money than long-term rentals in our current housing market a couple years ago, I think they did but I'm not sure they do anymore, but they may want to do that for a couple years to help pay back their construction loan, but then they wanted to have it be ready for you know their mother in law to move in or for a longer term rental as comfortable check or talked about. You know, what about you know University Housing or or long term housing we have gaps in between. So I'd love to hear some more analysis around that and I could be convinced in that process that that we should just do what you both are suggesting right now. I'm just not quite there right now. Just to be clear. I do think it's worthy to discuss that were collectively adding trying to pursue the same objective, which is more long-term housing for folks. It's just I don't think that this is the appropriate belted dress it. I think it's better for us. If I have all the information needed at this point make a strong decision. Should I didn't need to kick it down the road at all, but my colleague to the table, by the way, this piece of legislation does not include the title of the section of the code that address is it and so we would need a new bill introduced and that new building introduced that has we can vote on the same day. We introduced it. So, you know, if the majority of the council felt strongly that this should not go for without that there would be a path to do that. It would take a number of weeks not years thankfully, but but at this point my proposal as we move forward with this legislation and supposed to go I know you covered it or I call you. It's okay. I'm going to take a swim move on to amendment number 5 Amendment 5 sponsored by council member herbold. This amendment would modify the existing the requirement in the proposed bill that would require that when adding a second accessory dwelling unit that the new accessory dwelling unit either meet the Green Building requirement or is an affordable unit rent in income restricted unit. This would add a one-year ownership requirement of the property in addition to the Green Building requirement prior to adding a second Adu. It wouldn't modify the option of an affordable units o a property owner who is adding a second 80 you would be able to choose either provided that they own the property for 1 year Pine to prior to getting the permit. They would rather meet a Green Building requirement or offer. That unit has affordable unit. Path, there is no one your delay unit is developed as a restricted affordable unit just to clarify again. This is not an owner occupancy requirement. This is an ownership requirements. And this ownership requirement would would not be triggered by people who currently on their property and wants to develop to it to a Diaz. This is only for this is only kick in for people who are purchasing property and then immediately or within a year wanting to build it is again, the intent is to stem the Spectre speculative impact of you know, basically allowing more development. On on property that then has the potential of removing 20% of of our single family homes right now or occupied by renters. So we don't want this pop this new policy to add to the flipping of rental housing that is currently affordable to folks until that's what this with this amendment is entire day is designed to do to minimize the likelihood that people are going to purchase property that is currently affordable and then immediately. Develop 280 use that are not affordable. I like this and I supported the reason being again is to sell. There's some fairly smart people out there that was speculating this place. I mean it's as simple as that for me and I think it's a policy while they're free to do that is free market if they are policy designed to achieve again the goal of having affordable housing affordable living spaces for people this policy make sense in that is our ultimate goal. And so I think for these reasons is not in on a restore restriction is reasonable in and consists with our policy goes I certainly support it. This is what I thought about a fair amount. In fact, if you track my history over four years of working on this legislation. I have at various points proposed one year owner occupancy requirement and when your ownership requirements, but at the moment, I I don't and a lot of this is informed by the data in the is which indicates that the speculative pressure on single-family zoning house purchases the by allowing more flexibility in an accessory dwelling units or detach accessory dwelling units, but doesn't seem to be evidence that that will drive up speculation and today's current market is my read of that. Obviously the markets to in can change and that could change in time. The thing that really drives me is a deeper commitment. Then I started that I want to see more units are single-family zones. I think I think attached and detached accessory dwelling units are great way to allow more housing opportunities in single-family zones and what we've seen over the past two decades is actually the number of people living in our single-family zones is actually decreased as housing a household size as it gets smaller. And so I don't know that we're going to go back to larger household sizes, but I do think having more units on a single-family zoning allows us to at least maintain the number of people that are leaving a single-family sounds which I think is a positive so following that I want to make it as easy as possible for folks who choose to add a attached at one or two a tea use and if someone if someone buys a home in the single-family Zone and wants to add to a way to use at the same time, but now they can only had one and then have to wait a year to the second one that becomes problematic for me and I don't think that that serves the goal that I would like to achieve. And so anything that can make it easier to add a second a to you for me is something that I am strongly supportive of him. So I am interested in watching how speculation plays out and I'll be so we can come back and refinance in the future. We probably not being me at this point. But the evidence that I've seen today it is that there are people that are not driving the speculative and housing market in any way that I can see in the evidence. I wrestle with this one. I wrestle with this one because I've been lived in 280 use where the homeowner was on site. Yeah, I think it was the incentive of affordability because they were more concerned about having a good tenant. However, you know, it it's we know that we need more house and on this rock I side with cover O'Brien in this trying to remove the barriers for individuals to build more housing because it's I think it's too or are collective agenda of trying to build more housing within our city. And so for that reason I'm going to vote against this amendment, but I would be open to pursue in the conversation further at a later point in Terraria for the land use committee or to work with House of President Harold to hopefully kind of address this the speculative nature of what I think you're trying to do with not specific to this amendment. So K cause any further comments around you know, I guess we just disagree. I mean, I think what we heard repeatedly in many communities as people want the ability to wage in place and this I think comes by her bolts Amendment sort of supports this concept of Aging in place and I think we're being somewhat naive if we don't think they're speculating yourself out there that will look at this legislation. Just see the opportunity to flip. I just think we're being naive about that. But again, we are going in Uncharted chapter chores. I understand that but again and I think the execu supports what we're trying to do here as well based on all of the round tables and discussions. They've had about people wanting to age in place. And so I thought this is a reason or restriction. That's why I support my purple. No further discussion. All in favor of let's see were on amendment number fives. Sorry Cal sweet potato before you. Well. I think the part of it is the fact that we got into this conversation about the amendment. How are these amendments in the last in the mayor's opinion within the last hour with regards to what she would like to see? So I think part of that is is if we would like to table this amendment or table the discussion further with these amendments so that we can have more time to discuss in further. I'm open to that but I think there's a challenge when we've only been given an hour prior to meeting to have this discussion openly. The mayor's office waiting more recently than has been posted. So this this one doesn't this one doesn't suffer from the same challenges of the previous Amendment so we can vote on this amendment today if Account number Beaumont support on this today and it could come back to full Council to or if you want to table it can go either way. It doesn't predict when does not require title changed so you can you could do both if you could take it if you could take a little but it still could come back to full Council conference table the moment so all in favor of supporting amendment number 5 seem to have a saying I supposed so that fails and again, we may see that's where some version of a backup for Council. Qatar potato, did you want to bring them in the number six or do you want to talk about that or what? So I just want to defer to the full Council okay for now and take those going to have I believe have some more conversation with some committee members and bring this or some version of Something perhaps a couple Council and the number 7 coming to go and then you can win an amnesty program for existing unpermitted 80 used since 1994 and 2020 attached and detached a to use respectively haven't allowed Citywide as part of the main hot house or in the back yards on 80th and may have been constructed before after that time without a permit for a variety of reasons may exist but are not are not currently on counted in the city's numbers and not included in the cities rental registration and inspection. Ordinance this amendment request that sdci undertakes an amnesty program for accessory dwelling units that were constructed without purpose without permits. The intent here is to increase the city stock of legal and affordable housing that is both safe and habitable one of the challenges sometimes with people who have either built themselves or have purchased a home with an unpermitted accessory dwelling unit is that it was constructed long before the current building codes and electrical code. So this would be requesting the STC. I take a look at the all of the requirements that a homeowner would be required to meet to get that to get that unit up and legally permitted as an Adu and try to provide flexible flexibility where appropriate while ensuring that that unit still meets basic health and safety standards. Custom to take out. So just from what we heard in in public hearing as well as what I've heard in the district. We know that there are folks who in the city who own houses that have a to use in them and they were often built or converted before we leave you guys need to use and or don't perform exactly with all of our requirements. And so this amendment would recognize it those units do exist. And that would we will we would allow them to come out of the Shadows by creating a process that allow these adus to continually operate legally. We both preserve those needed affordable units of Housing and we encourage them to come in compliance with our safety and health standards. So this amendment on the SS DCI to do this work, but it does not necessarily change the policy itself. I'm supportive of it. I just a question. I like it. Thanks for answering for check over for thinking of the concept of where it originated it originated. So this just when is this take effect for everyone that build one before we pass the legislation or years before an actual it just ask them to developer forum and they would set it typically other cities that have developed these types of programs have said it sort of prior to the effective day of the of the new rules of a pickup point and in time but generally because we need to look at what Authority we have to provide flexibility to certain building codes. It's not something so just Jenna directions to develop in that amnesty programs to design it would be nice to see before it's so we're just deferring at it like a rulemaking process if you will, but I was a little nervous sometime when we don't see until this out and then we hear about all the problems but that's fine. I won't be on the council and it's developed anyway, so I might have depends on what they determine is. Possible. It may require legislative changes to provide flexibility for those that are in permitted so in I think it's an open question still. All in favor of sorry, we on Amendment 7 number 7 significance and I is an amendment proposed by council member mosquito who can be here today that would allow open railings to extend up to four feet above the base height limit on that is to accommodate roof deck. Crate, so I am going to channel counselor Mesquite. I support this amendment in the spirit of providing a little more flexibility. I want to be clear that I'm not exactly sure how often these will be used. There is still pretty strict height restrictions on backyard cottages and the idea that you could fit it's hard for me to imagine how you could fit two stories in a backyard Cottage and then have a roof deck on top of it. And so the the way this imagine would play out would be if someone did a one-story ATU with a flat roof or someone did his two story with a pitched roof, but had essentially like a little Dormer with a railing on it that railing would violate the height code which that to me is probably might but I think it might play out now it'll be small, but I'm certainly open to the idea that if he can find more usable space and be creative seems fine. And I believe we exempt railing and most of the other parts of the code single-family low-rise those types of things to so this would be I just want to make sure I understand that your show. We're really in the Weeds on this one here. So that are open railing on what's an open railing for you can't open so you don't so it doesn't get as much of a visual barrier, but it's still provide safety. So you don't fall off the temperature. There's no ambiguity in what the heck an open railing is because that scares me having grandchildren, but open Raiders is it at any time we have liability we have open railings on roof decks and we're saying this is a good thing to have I will have to confirm whether or not it is specifically defined in the land use code, but if it is not I can get you information about how this is implemented from. Sdci. It's the language that's used in other. I'm to accommodate roof deck the concept doesn't bother me at all. It's just a little discomfort really knowing why we is non engineering and non roofers or set of talking about these open railings on roof decks at this in a semi that the building code has pretty strict regulations about the spacing between openings on anyting, you know, a deck above whatever 36in has to have a railing in those requirements about spacing on that. So people don't fall off including little ones and none of this would change any of those building code requirements. This would simply say that if you want to build a railing that would go above a certain height of the overall structure that that would be allowed as long as it's an open railing yet. So I will follow up with additional information about exactly what this means and if you're not Modifications could be made at full Council if you want more details in the air and the amendments are the items that can extend above the base height limit that are listed in the code and open railings is not currently one of them things like chimneys and flagpoles. And I mean, we got the land use code gets very much in the weeds. And it's not listed it can't extend. Colleagues I think your concerns or I don't know the answer is either and I think those are really legitimate concerns to but I'm going to go ahead and support it unless I hear otherwise, so a lie just to clarify. So other parts of this legislation are consistent with allowing roof decks. So they'd this this policy change would be consistent with what we always already do the laundry text currently a roof deck wouldn't be allowed on a detached accessory dwelling unit because there isn't an allowance for railings to extend above the height limit. So I guess in theoretically if it's possible that it may be permitted if they built it shorter d a d u and the railing was below the the base height, but in general this amendment is consistent with what we allow on other housing types in single-family zones in other zones. That's a good point. My single story example probably isn't evil is probably irrelevant because the railing would most likely fit within the height. If you are having an existing single-story flat roof garage and you do an addition of a two-story Adu adjacent to that the the the the top of the pole that would still be a single story but it may may extend above the roofs of the height limit stupid. If the garage is healthy tall, you know would need to be above in some in some Lots than base height limit is 14 feet. So it couldn't extend it. Could you couldn't have a forfeit realign cover herbo? To clarify for myself and you may have said this but it helps me to say it out loud. Generally speaking not specific to Daddy's but generally speaking rooftop decks allow open railings. What we are trying to do with this amendment is making sure that the height of the open railings that are already permitted on generally on rooftop. That's our do not count against the height limits or a to use all in favor of amendment number. Sorry. I'm sending one of standing vitamin passes. Thank you all for that discussion councilmember herbold at 9 sponsored by council member herbold this relates to a pilot program that the office of housing at the direction of counsel is implementing that would expand the existing home repair Loan program to include loans to low-income. Who want to create additional have little space on their property to house a low-income family or Community member this could include and finishing a basement creating an accessory dwelling unit or bring an existing unregistered a DUI up to code this amendment requested o h report to the Council on Lessons Learned From that pilot program and makes recommends recommendations for opportunities to expand that program or develop a new program to offer financial support for the development of rent and income restricted units to all Property Owners to be focused more specifically on expanding the program more broadly to increase the supply of incoming restricted units. So this is I think Ali described it while I don't have a whole lot to add I'd like to recognize that the reason why we have this pilot is because Brian asked off the housing to to create this pilot in 4 for $11, but you know, we just recently had discussions. B & F plan the administrative by asking plan for 4 Levi dollars this this pilot was one of the topics we were looking at whether or not there were ways that we could enhance the pilot and Link it to the option of providing a second. I do and and have that. Do be affordable. We're unable to do it this round and so I'm just again this legislation isn't simply about for me creating new units for the sake of creating new units about creating affordability and just adding more units does not add affordability and itself and so to the extent that we can create a ditional rent restricted unit using the pilot. I'm excited about doing that any other questions or comments. All right all in favor of amendment number nine, please. All right vs. 1000 Brian request that stci prepares a report on short term rental using a t use in working with the f a s f a s office it would. In reference to the previous discussion on short-term rentals or provide information about how many short term rental operators are getting a license to operate short-term rentals in accessory dwelling unit. Specifically, we don't currently have we currently have pretty basic information about short term rental activity and can't parse out what's in an Adu or another types of units. So this would provide more detailed information about that and inform teacher policy discussions. Play all in favor of supporting amendment number 10. Please signify by saying I am the council Bell as introduce includes a request for a series of reporting some of which has been amended by the this the actions today in an in addition to ask s m o p c d e n s GCI to work together to conduct a survey of ATU occupants in owners 3 years after implementation. This would add specificity to that serve a request to ask questions about the demographics of a t u owners and occupants in the rent charged for Adu tenants in the in the 80s survey and it's important to note here that this would be voluntary information people would not be required to disclose that if they chose not to but it would provide more detailed information about what types of rents are being charged and who is benefiting from the accessory belt. Legislation. I think it's important for us to think this is important formation for a future Council to have with regard to making any changes that may be that they may want to consider. And so I thought this would be helpful information for future Council. I supported I appreciate your bringing forward. Hopefully I know it's a lot of this will be voluntary, but hopefully we'll get some ribustello be helpful. Call in favor of supporting amendment. Number 11, please pick it up saying I have some questions we can ask for the next two amendments there. I'm skipping the number 12 and going to Amendment 13 and 14. I have copies of anyone at the table needs a copy of the amendment. This is amendment. Amendment 13 along the same lines as the previous Amendment council president Harrell is proposing an addition to the reporting request to collect information about the number of Adu permit that included off-street parking in their proposal, even though they would not be required to provide enough street parking and to include information about any parking impacts that have been identified by the city and recommendations on if the council should consider modifications to the off-street parking requirements for accessory dwelling units quick. Description that I support the waiver of the parking requirements for both wanted to actually was coming up with the other Amendment. We're on the second one. I was a little concerned about whether we automatically understand the concept of trying to get people off of fossil fuels and an encouraging transit in and trying to make it in as the process of smooth as possible for people to actually construct autos and daughters in areas where there's just incredibly parking problems and practically where cars are getting smaller and perhaps more environmentally sustainable as we build for the future. I just think we need to study them packs and come back and make sure we made the right decisions in a state department to help us along with that. See if there's any unintended consequences by waving the parking requirements. And so this will force them to show to look at that and then provide the council and executive some guidance. Nothing is good policy. Great Depression era appreciate this approach I'll see for my colleagues have any other comments or questions on this? assume that's a no sew Call Lise anyone in favor of amendment number 13, please signify by saying I want to squeeze you right now. You got also, correct amendment 14. But their proposed by council member Pacheco would add it to the exempt to floor area that is exempt from the proposed floor area ratio limit. So this amendment would add an option of exempting either 500 square feet in the next rest in an accessory structure that is not a detached accessory dwelling unit. So currently the proposal would applying Farr limit to single-family lot certain floor area would be exempt this include any floor area in accessory dwelling unit and a floor area below grade and up to 500 additional square feet that is in any other accessory dwelling unit, which would typically be a detached garage. This would add the option of either the 500 additional square feet or up to 250 square feet of floor area included in an attached garage. I just leave this is a good change for the sake but also that we are not inadvertently incentivizes build a detached garages incentivizing detached garages could also end of the driveway that are needed for a much-needed backyard garages or Cottages which then let's do a lot more being paid over so I had that's the reason I proposed amendment and so I'm hoping to be able to do but more attached garages in detached garages that in terms of the long driveway lots that have Allie access would typically build a detached garage and would likely choose that option single-family Lots in the city that don't have Allie access would have a driveway coming off of this street and if there isn't any exception for floor area in an attached garage may lead them to build a longer drive way to have a d Cash in the black back of the lot where other way otherwise they may build an attached with a shorter driveway. That's part of the main house. I support your man that I appreciate your thoughtful approach unless I'm colleagues any other questions or comments on amendment 14. Singing nun all in favor of supporting amendment 14 signify by saying I all right. Colleagues we have considered. I'm going to give you a 20 minute history of the last four years and it's not like I should have knowledge that we can rejoin by council members want thank you for coming back. We have a piece of legislation as amended in front of us right now. We can't even afford any further discussion if folks want to comment on anything, but I'm ready to move on to a final vote on this out of committee and they want other gender items here. I have one point that I think was is pertinent to the overall legislation, you know to the folks who are the folks who have been really concerned about. The number of dad is at is one of the things that came up in the in the public hearing was my request to Central staff to sort of translate. The number of units to acres that exist single-family Zone acres in the city. And so the S predicts about 4480 used to be built over 10 years. That's about $448 over the entire city over 10 years. Photographer / / 10 year. And that works out to be about 180 you / 80 acres and for folks who don't immediately have a sense of what an acre is city blocks different size, but it's a typical City Block is about about four acres. So that's four square acre. So that works out to be every year. I'm 40 40 40. I'm going back and forth between my to attend your number and my yearly number but that's 180 you approximately / 40 acres in the city per year. So I think that helps me and hopefully other folks get a sense of a real sense of the scale of development that we're going to be staying in single-family zones as a result of these important changes to Turn someone like myself who would hope to see lots of these. It's it's a little underwhelming for are you spent four years on this? I hope that does not listen to I know I respect my hope is that we see more than other certain that if you believe a bit of a backlog right now because people been anxiously awaiting for this legislation to pass and I also think to the point that this is unlikely to radically reshape our single-family Zone in any kind of meaningful way. I think that may have been your point this it's appreciate you make invitations, but that will have to be another set of deliberations. Call eggs anyway, as I may not be here for the full vote, depending on when we I guess I'll decide when it goes on the phone. I have a I think you're looking at the July 1st July 1st. Maybe that's the one. Monday. I'll miss this year possibly saw just a few words. Thank you for your work on this you've been steadfast in for me. It's it's a very simple scheme when people think are thinking how I could adversely affect the city. I just see it at a rich opportunity to Simply allow more people to live here people that are on lower-income fixed-income keeping people and their livelihood within the city. That's a good thing. It's good for business is good for neighborhoods is good for Public Safety is it it's just good policy. And so we're trying to get there through these types of house 8 weeks in our land use system in our in our in our codes, but I think it's real good policy one that I support. So thank you for your leadership. If I'm not there to just say that publicly. Appreciate that counts president. Thank you. Thank you. Thank you for letting me leave and come back and I conveyed the best wishes of everybody to the United care workers at Embassy Suites order to thank you, bro, Brian and many community members including the ones who are here and the community organizations that have fought so long and hard to make this legislation possible. It is the right thing to do and I will be voting. Yes on it and committee and and city council meeting also want to do Echo some of the point that the sustainable Transportation committee had gone over the last time cast members O'Brien and horrible and I were discussing how in addition like on top of building this legislation. We also need to look for concrete Avenues to enable working-class and middle-class homeowners to be able to actually a whale of this ordinance in so that they can actually have the starting Capital to build backyard cottages and that is a win-win of to the research from Sidelines in Another organization that that is a significant barrier. Is that still remains to be crossed and I hope that we will also move the conversation to that in the future. And I also want to do your shout out to God green who I think today announced their Green New Deal plan 350 Seattle as well. Thank you so much for doing that and hopefully that's the direction. We're moving forward it. The comments. I just want to thank you for your leadership on this. You know, that's quite frankly. It's it's honored to be part of the conversation with 7 months and I'll be on this Council folks who not just in my district, but throughout the City rapper with decisions are when we were told of the challenges that grow challenges of this region of 1.2 million new jobs and 1.8 million new residents. We know that this is a drop in the bucket, but the changes that are going to go through this region. It really speaks to the heart of why we need to add more density throughout our city as well as just Norwegian, so thank you. I really appreciate your ongoing patience with me and work on this. I appreciate the folks getting a number of amendments lined up. Obviously we might still get a few before Council will see what happens, but I appreciate all the work to get to where we are today 8 really quickly in case I forget in two weeks. I want to thank Susie on my staff who spent a few years on this. I believe in the process. She found a mate got married got pregnant had a baby and is it home with that baby? Hopefully watching on TV and think Alicia on my staff who's kind of pick up the Baton and carried it to where we are today. So without that without further Ado, I'll move the piece of legislation agenda item number one as amended all in favor signify by saying aye aye great. Thank you. Thank you so much for your work number to Vicky Clarke as a member of the levy to move Seattle oversight committee for a term to December 31st 2022. Hey there, we will start with introductions. Perfect. So I'm Lorelei Williams and the deputy director at s. For Capital project delivery and I'm here to introduce Vicky for the move Seattle Levy oversight committee are oversight committee is an advisory body that monitors revenues expenditures and program and project implementation the oversight committee advises the city council to make a r and s. I'm responding to program and project cost savings and overruns. Vicky's position is actually the Phils the remainder of our vacant positions and she will serve through December 31st of 2022. And Vicky is the policy director for Cascade Bicycle Club that I'm going to turn it over to her to introduce ourselves more completely done in this region for the last I was just counting 11 is both really in transportation. And I think that's something that I bring to the I was like committee. I've walked on advancing all kinds of Transportation projects through Federal funding and state and Regional funding to and so I think And I think the letter a is a huge investment in this region and transforming his command in the city and transforming a multi-modal transportation system into something that reflects Oliver all of the city's policies and I think I'm excited to add my voice to that and my expertise. Crate, thank you for being here. We don't kiss your presence here to present the point. He's very often. So I appreciate you doing that. You did outstanding at it's one of your resume items and Vicky. I really appreciate your willingness to serve on this. We got a chance to work together quite a bit over the past couple years. I've served on the the levy oversight committee for the past few years too. And I know your voice will be a really important to have the table you're feeling a slot that was currently hold or previously held by Brian Estes who played a very important role really someone who brings a strong set of values and a strong set of oversight to the work and ask him really hard questions that I think you're really important when he heard that you were going to replace him. He was overjoyed so that made me even happier. So anyways, I look forward to having you on the committee and I think I know this Big time commitment on top of the other things you do, but I'm disrespectful be great questions or comments for the key. Just a commendation. Obviously WB already. This company has seen the keys advocacy for multimodal transportation for public transit or pedestrians and bicyclists. So I have no doubt that you will be doing more of the work you already do. So. Thank you. It's nothing further we go ahead and move addendum to appointment 01371 north side if you deserve and I'll see you at the meeting soon. Would you like to read agenda item number 3 into the record and then we'll go to Publix helmet. Okay, bicycle master plan implementation plan 2019 to 2024 to speak to the BMP implementation plan. There are 16 people signed up. So was go ahead and do a minute each and we'll try to get you all of them. Not sure if everyone's here we are deathly going to go a little bit over R4 agenda. I believe I've warned everybody at the committee that this was likely to happen. So and I appreciate folks who've been here all day in the audience and apologized for a long-term it even got a septic cover. Bri guy killed his first followed by Steve Wilkins and then Megan Murphy. I was on the one Center City Advisory Group, as you know, and during that process the partner agencies came to an impasse when it came to bike Lanes East of 3rd Avenue and what you been one of the goals of the one Center City process the what they told us is there was no way to put bike Lanes in without impeding Transit. We said transit to the priority bike lanes are priority go back and figure it out and they did to their credit. They came up with a clever solution to make 5th and 6th of us Corridor so that there'd be room on 4th Avenue for a two-way bike. Great. We were happy they congratulated us on our advocacy. We can get deleted them on their creative thinking everybody was happy. We all Pat each other on the back a few months later with several months later. We learned that in fact the Fourth Avenue bike lanes were being delayed until 2021 because in case of a fish truck situation buses might need the flexibility of the additional space given that the bike lanes were supposed to be part of the solution. That's in problematic. I'm sorry. I'm at a time. But now we're even more frustrated to see the implementation plan. Only further delays those bike Lanes but reduces them to one thing and your perspective is really helpful. Steve. steaming up here Megan Megan Jeremy followed by Robert gets kidnapped good Vicky Clarke will be next and then Joe Scott. Thanks for letting me speak. I've been listening to the show that used to be mine over matter. And now it has a new home. I can't think of the name right now, but they talked about 1 Center City and they're not meeting as much as they're supposed to snow on 3rd Avenue. They were supposed to implement those scanner things for your bus card and it was three million dollars that was invested in the research and there was supposed to be people standing at the things I'm taking the cards. And so this is a transportation and Piedmont that has not been fulfilled by one Center City lack of meeting. So I'm hoping you say when we organize we win. So I was I've been organizing for my son and like my family got to see my son for his birthday and I got 85 signatures were people described me and people around town somehow. I got my mail to my son and I learned it all here at City Hall and my mom told my son last Friday, so How to change things so I'm just hoping we can organize better for these bike lanes because when we when we really organized and get signatures and push the people that are leadership positions and really cool things happen. Thanks. How's my day afternoon? I'm Vicky Clarke on the policy director Cascade Bicycle Club. There is a lot to say on the PMP. So I want to just say a couple of high-level things. We're really grateful that the city released. This plan is a draft back in April. I'm at gave the community opportunity to underscore the continuing to emit sci-fi connections to and through Southeast Seattle connections have been added to the plan that we need to build these connections and not just plan for them and talk to me to plan design and build every single one of the projects contained and final draft of VMP implementation plan. This is not about frivolity every single one of these projects as about something as fundamental as mundane as people being able to get home safely regardless of how they got around. That's why I will be there every step of the way holding all leaders accountable to the commitments made in this plan. Thanks. Thank you Vicki. Jo Jo you going to be followed by Jake Noah knows Toca and then Claire Cantor? So I've been hearing from a lot of folks over the years since I moved here who are afraid of bike Lanes these people often twist themselves into knots with bad false information to justify their fears and SSI in City Hall his listen to them delayed and Flash pieces of the bike master plan. I'm here in support of the green New Deal and Seattle and here's the truth. It's nothing to be scared of. What do you make her say, it's safe to bike. Everyone wins bikers and drivers are like have safer roads more women were more likely to feel physically on safe On The Road Less space the bike communities impacted by pollution it cleaner air right now in the world gets less carbon emissions. The green New Deal cause red Jess transition and that means Equitable implementation of the bike master plan not just in richer and white or neighborhoods, which has been what's been happening Jake? I'm drinking moussaka with that 350 Seattle my fiance and I bike for many reasons one of those being climate change, and we're happy to see that the city's working on this bike master plan to improve and encourage biking in the city. However, I don't buy that we don't have the funding for all these projects as a matter of priorities and not funding for Seattle light up at the mayor's office in support of the green New Deal in the deputy mayor came out saying that the mayor was in support of this and in support of the green Seattle, but I don't see this in the handling the bike master plan. We need to prioritize the BMP find funding for this make Seattle better place to bike and reduce our carbon emissions. Thank you Clara. Are you going to follow the next president at Eve? Kellar floor Temple and my love heart all signed up for all here. You can come speak together and then and see how a person is next. Hi, my name is Clara can turn your eyes over Seattle neighborhood Greenways in the interest of saving time here. I'm just going to say that I support a lot of what has already been said in the crowd. We want to express extreme gratitude to transportation and the mayor's office for including a number of the really critical routes that the community was expressing an extreme desire for over the course of the month that they did Outreach on the initial draft. There's also some critical projects included in the original draft that we're really excited about and I also just want to say that Being included in the plan isn't really enough that they need to be funded and they need to be projects that we actually see on the ground before they're going to start saving people's lives. So we're looking to city council and to continue working with the mayor's office to actually fund those projects and to implement other policy upgrades to the bicycle programs that we have in Seattle to make sure the people are safe. Thank you all ready for in Milo. Come on Ford sremc you're going to be after this Threesome that comes forward or after the people right behind you. They're showing a Furby the right behind you in front of the yes. That you can bring him to trial together 3 minutes. Then we go to thank you for funding project number 41 through construction, which completes the Rainier Valley North South Freeway and especially to thank you for finding bicycle Lanes on MLK Jr. Way from Rainier to I-90 through Construction. MLK has significant extra capacity in a connecting bike route to the I-90 mountains to sound Trail has been requested there for a very long time and we want to encourage you to move towards funding for construction background on the rest of MLK south of Rainier, which is part of a larger MLK study area. And then finally we ask you to consider creating additional space for bike Lanes on Rainier Avenue. Hi, my name is Eve. Tell her I'm president of the Mount Baker have Alliance and we are currently undergoing a very major project where we're reaching out to Property Owners with my Lo has written letters to about a hundred and thirty property owners in our area and I would love to encourage you to work with property owners and ask about extending the sidewalks and to create bike Lanes along Rainier Avenue. It will support our businesses. We don't have parking for many of our businesses if we can have bike Lanes to make greater increases in in our pedestrian traffic and then our bicycling traffic at that will be nothing but an asset for the business down in Mount Baker area. Thank you very much. Thank you three. Appreciate you being here now, MC. Sorry for that delay and see you're going to be followed by John Barber. I think I know John. Brister, maybe and then Adrian blankets. I found it wasn't realistic and I felt it went overboard for bicycles. Also the bicycles do not pay anything for money spent on their bicycle programs to the detriment of Thrones maintenance manufacturing industrial National Disgrace. I was told that this Implementation how to change to the bicycle of plan and I couldn't find out what it was. I don't know if that information is correct, but I'm lost I'm going to listen to The implementation to see if there's anything in there that I send you show all email you thank you John. Is there a John last name starts with a B that I'm making mispronouncing? All right. How about we move to Ariande on cuts? followed by Michael Foster and then Heather price Hello, my name is Aria. Bean. Brancato. Thank you for giving me a moment to speak. I haven't been commuting by bicycles in Seattle since 2011. I'm very fortunate that I wasn't seriously injured in the two times. I was hit by a car while biking around. I'm excited about the bicycle master plan in part as a matter of personal safety. It is super important that the city provides more infrastructure for people who do not want to or cannot drive a car or take transit. But more than my personal safety is I want to also speak to a crisis that sex affects everyone climate change is already making entire countries uninhabitable. I read last week's temperatures in cities in Southeast. Asia are experiencing right now temperature is over a hundred twenty degrees fahrenheit temperatures that are catastrophic to human health and productivity are result of climate change. So it would be absurd for us here to try to build bike Lanes in Khartoum or Jakarta. We can Implement policies policies that reduce our current climate or carbon pollution locally. Turn addition to pushing through that bicycle master plan. We need a green New Deal for a city that will eliminate climate pollution by 2030 address current and historical and justices and create thousands of jobs. Michael Michael Foster and I hope you can see me because everyday I risked my life on Seattle city streets and it's terrifying and I'm tired. It's exhausting my kid was hit by a car. I know that people are getting hit regularly here in the city. And you know, I'm out there. I'm on an electric bike. I have a little more speed nimbleness now that I got an electric bike, but you know mine and my nightmare is being run down by an Uber or Lyft driver or a Tesla on autopilot. That's my real nightmare. A Tesla on autopilot keeps me up at night because that's the future that's supposed to save us. So it's unsafe for kids who want to bike to school. You've got the money you got the will you've got the people they were all out here on this weekend, please fun the entire plan and do it now. Thank you heather. how to price nothing Heather Deborah Riley and then Richard Schwartz hunted ever Richard and if there's anyone else who wants to buy public comment wanted to come up and get lineman Richard. Afternoon in my experience project involved three elements planning and implementation and management is hard to identify a management component of my particular context is the cycle track. It was planned and implemented but there's no management. There's no speed control enforcement bike Shield to The Pedestrian little signage and what exists is ignored literature safety speed and safety are directly related on Page 6 says we know that lowers vehicle speeds are a primary factor that influence Traffic Safety on page six that also says we focus on speed reduction on page nine. It says driver Shield 75% of the time when traveling 20 miles per hour the only yield 17% of the time when traveling 37 miles per hour. Real specific management procedures and resources be part of them bike master plan cycling is increasing in the city speeds are increasing with the introduction of high-tech vehicles does not responsible management to Simply leave it up two cyclists pedestrians in vehicles the sort this out for themselves. There are two reasons is lack of ProActive Management Vision zero program speed the lack of traffic law enforcement strongly influence public safety. Secondly lack of infrastructure has led to a significant number of citizens having a negative view of cycling get a wrap up Richard your time's up. Heather thanks for hearing me. I think that the full my name is Jessica Roxanne Jones. I work in theater around the city and I traveled to many venues by bike an avid biker and Spike Advocate. I think that the safer we feel as bikers on the road in the more supported by our fellow Transit takers add more often that will be biking and the more conditioned will be for the challenges of biking the safer. We will continue to be I think showing full support and this bike master plan will allow more people to continue to bike around the city and therefore create a positive feedback loop in which we can Implement one of the most important points in our transportation future, which is zero emissions and biking is already doing that. So, thank you so much. Pokemon Fire Red Did you just state your name? And I'll write you down on the sign and less than you can speak, but I would like to thank Richard for his comments. I think it would save all of us a lot of trouble and possibly harm. If our residential particularly residential are Cheerios in the city were reduced to 25 miles an hour and I'd like it to be posted. Thank you. Thank you for being here. Hello. I'm just going to scream and I was speaking on myself as a cyclist in the last year five of my friends were hit by cars while on their bicycles. I was hit by a car in a bike lane in a bright red dress where I was supposed to be by a distracted driver who didn't want to be at a red light. I moved to Seattle in 2007 without a car. I will not buy a car. I don't plan on ever having one despite. How many jobs tell me I need one. I'll find a different job, but I need to be able to get from Wallingford to West Seattle to Georgetown to Bellevue safely, and my friends need to get there safely. I'm lucky. I'm here. I'm not a hundred percent better 14 months later, but I'm here and I'm riding and I want to be able to do so safely. Thank you. academica Thank you for everyone who came to fight public comment. We will move into a presentation cute app. I wanted to share with the audience and my colleagues a couple photos of the rally that happened outside City Hall on Sunday on Father's Day. You're quite the crowd on Father's Day who turned out to talk about what they would like to see in the bike implementation plan. We had a number of speakers and then following the the rally they closed briefly 4th Avenue. So folks of all abilities navigate from City Hall up to Westlake Park and it was great hearing people talk about how great it felt them feel safe riding on downtown streets. That was a lovely day and it's impressive to see some of the Father's Day. So we're going to jump into a presentation a couple of points of order. I wanted to just discusses. We've been through here. Maybe we'll start with introductions. So Sam, do you want to go first Sam's in babwe director of the Seattle Department of Transportation Tim Curtin interim director of the project Development Division at a stop. Amanda Barnett coach are the Seattle bicycle Advisory Board Emily Payne co-chair of the Seattle bicycle Advisory Board a couple things at our last committee meeting. We wrote a letter T you about 35th, and I'm not sure if I've received it yet. I haven't seen it, but I been here for a little while and become distracted. I signed it this morning, so I'm not sure if you have gotten it either, but we will make sure that you have it back we can just discuss that as well. So would love to discuss that a little bit today if that's possible one of the things I wanted to just like we didn't have a chance to talk about this when I saw you the other day, but we talked about a couple weeks ago bike installation on Swift Myrtle that boost from some folks impression didn't quite go as planned. And if you have any specific to stay there that be great and I guess I'll just turn it over to you. Address those or wherever they fit in the overall scheme of things. I'll defer to your timing sure. I think we can jump it that those aren't directly addressed in the presentation. I think we can go through some the presentation and then also talked about how we're at where those said. I think some of those some of those issues on Swift fellow implementation from where things go from here to and NR accountability in terms of delivering projects and and all the way down to the details of design and construction construction management. So if if you can Start here. So just a quick overview and and some of this is things that we presented when we presented the plan in April but wanted her to reinforce and and explain them again, but just I want to start with a little bit of vision and then I'll turn out turn it over to the gym on and then Monica on the plan as it stands and what we heard through the Outreach process servers near this year just procedurally is a go through I will invite my colleagues and if you have clarifying questions, but I also met Emily. I also appreciate you both in here. And if you have questions or comments, if we go to the slide, please feel free to just so you can lie or are you can just jump right into thanks. So the the bicycle master plan implementation plan is a critical part of the mayor and my vision for for building on a multi-modal transportation system in in the city and that is is building out safe. Connected infrastructure for all modes about the equity in the affordability of those that transportation and making sure we're providing people transportation choices were people feel are accessible and available to them. This is part this this plan. Is part of a continuing to deliver on that and a lot of a lot of pieces that we have already delivered and and will continue to deliver. So just this is just a snapshot of all the things that have happened sword in the multimodal transportation space since the since the mayor took office and I think the bike master plan sits within this larger context of a changing Transportation Network in Seattle that that we are working to to deliver on and and manage through some some big changes as we go that includes making permanent the the free folding bicycle Share Price bike sharing program includes launching accessibility programs with Outdoors for all about anything about where we going a long term in terms of continue to build out Transit manage congestion and and things like that. Huntington that translates directly into the vision for the bike Network which is expressed through this implementation plan of building a robust and connected network of infrastructure and then managing that infrastructure and and maintaining it for 4 took to make sure that it is acceptable and and remains affordable as riding a bike is so with that. I'm going to turn over to Jimmy just talked about what we what has been done in the last few years a couple of your project delivery items building since since since I took office 13 miles of new facilities with 11 more miles to come this year building out the center city bike Network finishing important projects some of which we talked about their this referral FL. Oh, I think we've seen some of the feedback in or think about what kind of adjustments that we we are making intern. Some of the transition points and making sure that we're designing those facilities so that they are they are safe and usable I think that particular show what some of the challenges we face in the right-of-way when we move from from concept through the implementation and and then the constraints that we're working with within limited right of way. That's at I think we've identified that there are signs week so we can make to make that feel more comfortable for people that specific plan this with murder on fellow is that timing on that or what's the sum of the slides? I saw I don't need to bring it up here, but look a little where we got the bike Lanes of that and that navigate around new bus stops. And right now I think the transition points are very comfortable. So How are you can prove that so I think we've got some designs. I don't have a timeline yet on on my nose will be implemented the notice and say it all the time and safety. And so just making sure if we have something out there didn't quite go. Right. Right, right. However, we get in there to make sure that no one gets hurt while we're figuring out of screen in in the signage and and markings out there, but there are some longer-term time changes that will appreciate the response. Excellent. Thank you very much for having us today to transition into the bike master plan in the implementation plan that we've been developing as we mentioned when we came here. I believe in early April the objective of the BMP implementation plan was to increase transparency and deliver a realistic prioritized implementation plan that hold us accountable. So this document is very much and accountability document for the bicycle Advisory Board and Advocates that are here today and listening throughout the city of Seattle Seattle assessments it acknowledges some of our constraints like increase can construction costs recognizes those implementation challenges that we have on many projects that we go to implement and it goes to reprioritize projects to match the 76.8 million dollars and funding that we have and new this year. We gathered input from stakeholders. So a little bit more information on that in order to expand this discussion for really the first time for the implementation plan. We hosted for workshops in April and these were held throughout the city and various different locations. We also briefed the Seattle bicycle Advisory Board in the levy oversight committee to get feedback from them as well. And of course we've heard comments add to our previous Council meetings in today as well which we very much appreciate in all we had more than 350 folks who came out to attend meetings took our survey and we received more than 550 emails on the matter as well. Do you know pause there for a second or just that I really appreciate how swiftly you responded to her. I think he can remember is Vicki someone in public, today same we're grateful for the plan. I imagine you didn't feel very grateful when the plan was released a few months ago, but I think it was an opportunity for service kind of a rallying point and I really Appreciate how you all responded pretty quickly, you know in less than a month's notice scheduling for meetings is no small feat just to find room capacity in a department of neighborhoods help you with that but really appreciate the opening that up to go out here and in here from people who are chomping at the bit to get a new bike facilities out there. We heard a lot about the different values that we have is a city we heard first and foremost and repeatedly that people want to provide us to provide those safe and connected facilities so that there's a seamless network no matter where you're trying to get in the city of Seattle as we heard today. We heard a lot of discussion about climate change and how it should be a priority and how we make decisions and Equity as well to make sure that's the Investments that we're making are occurring Citywide and nausea. In particular neighborhoods, we want to obviously create some transparency and decision-making which is really the whole reason why we reset the approach with the BMP implementation plan and we use data to tell the story. And again, we showed this slide when we are here in April, but this does tell the story that during the Seattle squeeze biking was a great reliable alternatives to do said obviously driving and it shows that if we build the facilities people to come and use them which is exactly what we would help. We also heard that we have some some other needs out there that need addressing. So maintaining bike infrastructure. What is already built out? There is a huge priority. We've heard that we need to remove debris from bike facilities. And I do want to mention that in the month of May. We we did go out and rent a smaller sweeper so that we could get out and we did sweep remove debris and clean every single protected bike lane in the city of Seattle and we are working to develop a long-term maintenance plan for the facilities that we build out there. Another thing we heard is that some signage improvements would be really helpful. Especially folks who might be new to biking in Seattle. I appreciate those. You know, we spend a lot of time talking about the big things. You know, where you going to pick up pbl in a major arterial, but I do know for a lot of folks, especially this time of year when folks are dipping their toe in the bike commuting or whatever by Karen Market how that experience is. Obviously the safety facility is a huge thing. But if it's covered with gravel, if you can't tell where you're going, if you're not sure to transition from one place to the next can make the difference between wow that was greater into a more versus like Aunt doesn't feel quite so I appreciate we will talk a lot about the big things and I but I also appreciate your attention to the small details that really make a difference we heard a lot about projects. We are really strong support from the community about the Centre citibike Network and how those projects really need to be built. So people can get us through downtown not just on 2nd Avenue, but in all the different Lights of the center city a connection to downtown Seattle was a priority and just about every single neighborhood we went to that and by that, I mean not just in southeast Seattle, but we heard that repeatedly from folks across the city we heard a strong desire for a connection to downtown from Sotto Sotto really from George Park Georgetown and South Park, George Park neighborhood inviting new neighborhood board for a project like their birthday on the trail East Lake and Roosevelt in the Green Lake Park projects as well go find some more Revenue. So as we balance our budget Menards need to cross the department that is definitely something that we're going to commit to doing. Are you put a sticker on that one will come back to that in an hour. And also we heard a lot about the public. An aspect of our work, which is something that would continuously trying to improve and you'll see that we have Incorporated some of this into this plan here. Especially this first the life here is make sure that we're talking about the public the benefits of these projects and not just the risks in the challenges. But in order to tell a complete story, we really need to tell both sides of the coin here. So you'll see we have adjusted that moving forward engage with all people invested or impacted by a particular project increase coordination so that we're not in and dating people with public meetings and asking them to take their precious time out of their own lives to come out and listen to us talk all the time and engage with communities of color people of all ages and ability and people who are new to biking as well. So with that we moved into prioritizing projects and as we mentioned when we were here in April, there's a quantitative components of our prioritization, which is noted in the 2014 bicycle master plan. After that. There is a qualitative side of things where we work with the bicycle Advisory Board to look at the geographic balancing making sure that we're building in as many neighborhoods as we can. Also looking at those different leveraging and partnering opportunities to help was prioritized and then of course as we just discussed new this year we use the input received during our Outreach to inform the plan. I would mention I do want to mention before I move on that. It was a pretty significant effort this time around. I think we produced a 50 + page documents with multiple iterations of our project list. We are looking to streamline that effort moving forward so that we can spend less time working on prioritization and more time actually implementing the project which is I think everyone's going we are of course committed to equity hear the projects are reviewed for Geographic balance. We look at the socio-economic factors health and accessibility indicators, and these are incorporated into our quantitative analysis and confirmed in are qualitative work with this fat. So the new implementation plan the basics haven't changed a whole lot since last time we were here. This is still a six-year plan to align with the levy to move Seattle reassessment. It includes 76.8 million dollars and investments in Seattle Spike Network. We will build 50 miles of new facilities with this plan and we will have an additional 29 miles in the planning and design phase so that those projects are ready to go when we get that extra Revenue in that funding that will be shaking when all said and done in 2024. We will create nearly two hundred miles or network that's nearly 200 miles long and deliver these transformed of projects that everybody really wants to see on the streets. And that includes some big priority projects. These are the big things that we were talking about earlier here including the center city bike Network rapidride Roosevelt project which contains significant amounts of new bike facilities on Eastlake the Green Lake Park loop projects, which will be under construction for the next several years at least two years the burke-gilman trail Missing Link and our project on East Marginal Way, which we have officially secured grant funding for we will be moving forward with phase one of the project which is that really critical connection over to West Seattle on East Marginal Way, which will now when we're done when all said and done will completely separate bikes from the heavy Freight traffic out there. Is it approved the contingency list, and this was at the top of that list, so we already authorized the funding for that and hopefully anticipation of that. So I really appreciate s. Swift Both on behalf of the folks that will benefit from that project which is both great and bike users but frankly on behalf of the region because this was a project that I hadn't been slated and needed. I believe some work for the city to do to get up and ready. So there we could spend Federal money before it disappeared from the region. So appreciate the work on both ends of that that we appreciate that support as well, but they're not done yet. So we still need people to come out to our public meetings and voice their support for these projects as we move forward as we move closer to implementation. Everyone's voices need to be heard. Another component Is our commitment to seek new Revenue as you know, some of the projects that are in the plan have been Advanced into a planning and design phase but we do not have committed funding to construct everything that's contained in the plan. So we are committed to the seeking that additional Revenue whether that be a grant or another partnership in order to advance the BMP. What's new in the plan? We are sharing the project benefits as I mentioned earlier. One of the things we heard during Outreach was that we're talking all about the reasons why these projects are hard, but we're not really talking much about why these projects are going to benefit the city of Seattle and people who choose to travel. So you'll see throughout the documents. We've created these icons that represent various different things where they were connecting to transits or schools community centers are parks. We want to make sure that we're identifying projects that have some rsj implications where we have some opportunities and we're we're connecting to existing bike facilities because ultimately we want to have a safe and connected Network when all said and done. And we're highlighting those costs and challenges for transparency as mentioned earlier. We we definitely want to be as transparent as possible in our decision-making and part of that is being upfront about what we see on these projects before the project actually head into the planning and design phase. For the more we have some new projects on the list. We're really excited to bring a project on Martin Luther King Junior Boulevard from I-90 to Rainier Avenue. Basically the Mount Baker Light Rail station to fruition. We will be finding that through a partnership with our vision zero program and we are really excited to get started on that project which will make a really critical link and bring folks to downtown Seattle via I-90 Trail but also connect up with the Rainier north-south neighborhood Greenway and other important connections along the way. I do want to know that we have the Fourth Avenue one-way Northbound protected bike lane funded through construction, and we have a number of projects that have been prioritised for planning and design including the entirety of Beacon Avenue South, which is a Multi Mile route, which would connect from the doctor Jose Rizal bridge to 39th Avenue South again studying more of MLK to see exactly how far south we can go. Hopefully all the way to Henderson. We're looking of course at Georgetown George Park Georgetown. Sorry Georgetown to down the center city. Obviously, there's a lot of exciting opportunities in the works at downtown on the waterfront. So we have Alaskan Way on here. We're also looking at projects in Pioneer Square to connect up with the new Waterfront. We're evaluating 12th Avenue, which I know is that we're all pretty well-versed on 12th Avenue at the table here and we're also looking at connecting the Admiral neighborhood to the West Seattle Greenway, which phase one has been completed phase two is now in the works and this would be the next phase which would connect basically all of West Seattle via a north-south spine route to 4th Avenue bike lane reduced to a northbound. So I can take a little bit of that some of this a little bit but I quickly get up to speed history. So that Jim said we view this plan is as an accountability plan of like what what are we actually delivering within within the time. The Fourth Avenue protected bike lane. We've we've committed previously to designing a two-way facility, but the traffic impacts of that and frankly the costs of that have never been fully fully fully studied and evaluated. So the cost of what would it would it would take to upgrade signal infrastructure to help to protect turns across up to a protected bike lane one part of the planning process previously true cost estimates and that's where I think we we found as needed to be found challenges when we were working to implement similar project on 2nd Avenue. So we we are does a one-way Lane doesn't have some of those same cost implications to a language we have committed to designing to be able to understand what those better understand what those implications are from an operations and and a cost perspective is still part of what we've committed to doing but it's hard enough implementation plan to put in the construction of that when we we don't know what the full scope and scale the project is And I think it said to add on to what Sam said that we seen some pretty significant potential delays for Transit on the corridor. And that's the issues that we want to work out and and we do ultimately want to see eye-to-eye facility out there, but we still have some Kinks to work out first. So the team is going to get back into design and see if there's some tweaks we can make to the the previous iteration of the plan to to make things function better out there for everyone. I appreciate the question cuz I have more about that when we talked a little bit about it, but I'll repeat some things. I told you privately one is is Reprioritize both Transit and bike infrastructure and of course pedestrian safety. I know when we put all three of those in its like which is the priority in my responses to be all of them are priority deleted Levi general-purpose automobiles. We are certainly I've done an amazing job in the city of reducing the number of people who commute in general and their private Automobiles and I think as Arkham City continues to grow. Send me the area where it's the least efficient in the most polluting way to get around and that's the the place we're going to have to make some sacrifices. So I'm really interested in as you look at the modeling to aggressively. Look at how do we how do we make sure we have good speed reliability para-transit a safe flight Network and safe pedestrian environment and then tell us what's left over for general purpose and we'll figure out how to manage that not that easy to say here. I realize there's some challenges with that but that's going to be what I'm hoping to see everyone for the other. And I want to make his I recognize that these projects can get expensive and it's really not fair to put that price on the sidewalks we talked about. Well certain things might require new curb Cuts. Well, we should be doing the need to be doing you Ada curb Cuts in a bunch of places anyways, and so that is the cost of that. That's that then maybe a cost. It's triggered because we're doing a bike facility, but the cops shouldn't be borne by the bike program that cost would be borne by somebody and I realized it just saying that he still has to come from somewhere. Similarly. We have signals that are very Avenue the signals for the most part of serving cars to make sure that they're moving safely are Hunter Street. And so, you know again, it's a cost and if we're going to do the project we have to do it and so where we come up with the money is a is an open question. I think the cost of not putting in these facilities is going to be catastrophic it's going to be from a safety perspective for those who choose to Like in traffic but are also uncomfortable but don't have a choice. We see where collisions can happen and lead to injuries. Obviously that is not good for anyone that also means costing or liability for the city because we end up paying for those the cost for folks that don't feel safe riding on the street and choose to go on the sidewalk weather there in a bike or a scooter or a wheeled device e thing that people have needs that are already constrained pedestrian environment downtown. I was becoming less and less friendly especially to our most vulnerable users and it was really great at the rally on Sunday that there were folks from a different aspects of the disability Community talking with cyclists saying we need to see if safer bike infrastructure and we can't do that at the expense of our community. So we need to be we need to be innovating a transportation way. That doesn't do it on the back of the most vulnerable. It needs to be making the improvements to the most vulnerable Road users first. And so I worry that if we have a one way one way route to get to work when you're heading Northbound. And then what do you supposed to do coming southbound you're going to maybe put yourself at risk of you're not comfortable with or maybe you're getting on a sidewalk and putting someone else if it's him that's unsustainable and finally from a climate perspective and we've heard that connection and public comment a lot today. We simply have to you know, we have to wean ourselves from fossil fuels like yesterday. And so the urgency around figuring this out is real your hearing that from Community. I want to support you all and figure out how we can study that as soon as possible 4th Avenues example were talking about but it says it's the whole network to someone made for swelling and thank you to everyone from us. And Advisory board for all the work you've been doing but also just do it either date that it is catastrophic for our community from two ends one is held and Are on the line and I don't think that's another dramatic or hyperbolic thing to say. It's actually true one of my staff members was hit while by bicycling in the U District last fall another of my staff member in the winter this year and it was actually quite that he was laid up in Harborview emergency for a long time and and it was actually scary for me to see his you know, he sent me photos from this is Dad. So he sent me photos from from the emergency room, but it's stuck in my brain because this is a real issue. So obviously catastrophic from that again, but also catastrophic from the question of climate change and these are the people who are talking up advocating for the completion of the bike master plan other people who are the most commits about the people who are the most committed to addressing climate change and they shouldn't have to advocate for a real solution against climate change because It's obvious. And then I also Echo the other point, which is that ada-compliant sidewalk should be done in a world-class City. Anyway, it should not be connected to a rational that the burden of that should not be paid for by an ending up sacrificing other goals the bike master plan. That should be done by the city anyway. I am I want also acknowledged that some of the best bike advocates in the city work and I stopped and I know that that you have some amazing folks doing work and how we set up a system how we create a budget how we create politics that allows some amazing people to do the work that they really want to do is really important test to will sit here and in sound like we're like string to you and I know if Sammy can probably just turn around give me the same lecture right back cuz that you've been doing this for a while, but I really do want to live. They think that I started doing some amazing work because you've got some great folks that always hasn't been hasn't always been the case in my 20 years of bike advocacy, but it feels like it's a really awesome group of folks in my I want to make sure we keep them all and keep them busy working on these awesome projects. I just kind of sounds like one when I'm here this conversation my money like we're just scraping $4 every little bit matters, which kind of leaves nothing to really what I've been really kind of push for which is an out really taken in supporting Mike's push for scooters because I think it rather than waiting for 2024 pilot in the winter of 2020 scooter pilot would be more successful financially more beneficial to Pilot something in the summer. So I think this is kind of crazy little more urgency that sense of urgency of everyone here. Is it with regards to addressing our climate change gold. I mean speaking myself just the need for this infrastructure. That is so important. Without it. I'm quite frankly would not be riding a bike to work everyday because it's so I love you to give up a car and that's kind of really what we're trying to reduce his sink single occupancy uses it but I do want to caution it with regards to when commitments are made and come in when they're not when they're made with regards to like to move Seattle Levy and then the projects are completed. We we rode public trust and you know, when we think about the larger picture about what's going to happen potentially what I fear is you trying to think about potential new levees around the need for a $2 for a project. It's not just potholes. It's to trade you in for the safest and destruction of that. We need to get people out of cars. And so I want to make sure that you know, these are the commitments that we make that these are the commands that we keep so Yeah, it is. So just just respond to that that point particular and I think especially around the revenue aspects of this, you know, this this implementation plan takes us through the end of the the move Seattle Levy it is it is resource-constrained we heard loud and clear the need for additional Revenue. We didn't go and program Revenue in the in the intervening period between the draft in the final just because we heard that call we heard we we we that is something to that's a discussion to have going forward about the revenues needed to expand and accelerate implementation. But this is this is something is is realistic based on the commitments and the and the resources available through the end of the name Luciana Levy. The master plan is highly highly leveraged. A lot of the projects are very tightly coordinated with other Investments that are going on within the city to deal with curb ramps to deal with other project. That's where that's where we are able to achieve as much as we are with the budget that we have already coordinated with pay. Projects coordinator with vision zero project it's coordinating with all sorts of things that are already going on that are that are already investment so that the bike program is not the sole source of the investment in the bicycle master plan implementation that said that also constrains us a little bit cuz of the projects are highly coordinate with the other Investments that are going on Sunday. So we didn't feel it was appropriate to tell her I would say it was like the timing was right to have a revenue discussion in the time between when we were going from a draft to a final but that's something absolutely as we as we talked about Transportation reviews overall, we're committed to it and in terms of your the importance of delivering on the equipment that we make I mean, I just wanted to say one quick. Well ask a quick question. Actually, I know that the battle of the oversight committee wrote a letter on May 7th to the mayor's office and S. Inviting a conversation about readjusting Levy funds as the budget was the hardest cut and I don't know if that's something that s. Has entertained or gone to the levy oversight committee to discuss with them. Yes, I think I think that's a that's a good question and an ongoing discussion the effort last year to to reset commitments on the Levee in terms of what was available and achievable within the the Levee time frame frankly. Those are still a lot. That's a lot of lift for us to deliver the commitments that we've already made around the whole of the Levee deliverables. So I think that's still that that is an ongoing discussion it with that. We we can and will have with the levy oversight committee. But it it it's not something that happens quite as fast as the amount of work that went into the Levee reset last year and where we were on the the bicycle master plan implementation plan so we can we can continue to have that discussion with him and I appreciate you bringing that because I think that's that's a piece of the important overall trajectory the I don't believe they were Financial cuts to the bike program in. Riverside but they were programmatic cats because the projects did had been some form or another committed to in the Levee when the reset happened there just wasn't the funding to do those. Let me look at you know, all the different pieces all very important. If it did feel like the the bicycle program was one that suffered the most there are I didn't get I don't think it was I don't think it was like targeted necessarily. It was just that that's the way it played out but there is a sense from that letter of like are the things we can do to lift up that boat back to where it was and some of the things we talked about new Revenue sources, there are there other projects within the Levee or programs within the Levee that may have surpluses are projects in may be coming in under budget and you know if they may be in slightly different buckets, you know, maybe there's Paving projects that are doing better or a major Bridge Project overpass project. I think I would certainly be very interested in entertaining. They require Council action to shift some of the funding to try to raise the boat. So they're all kind of back on the Level Playing Field. Yeah, I think the Levee is at is a 9-year $939 program that we're trying to balance across the whole 30 different programs across that we that we are working to deliver and I think it is an ongoing thing. There was no money moved away from bike programs. It's really a question of what was promised originally and then what what delivery has turned into an expression in terms of I think also our commitment at our end and the demands on us took to make safe protected infrastructure and that has ended up costing us more on a lot of cases. Then there was originally planned and I think that's where we're happy to have that discussion. I think I think they're also still projects and programs within the Levee that that are are challenges to achieving Deliverance. So I think that's that is just an ongoing conversation. Jimmer Santa Monica, we we let you get almost all the way through your presentation and then we just couldn't resist with two slides to go. But if you want to show the last slide presentation in our Center City bike Network Outreach in an August construction begins on the ccbn projects, so that'll be really exciting. I think for us and a lot of people here today and listening as well and that wraps it up. I have a few more comments, but and we demanded do you have any of their overarching comments or specific things you want to add? Yes. I know. This was a really big effort including working with the Department neighborhoods and getting this turned around incredibly quickly. We are also really happy to see that there are some things in the final plan that reflect some of the prioritization that we had talked about originally and then after the draft was released one of our main concerns is the category of the study areas and the pre-planning and so I think the three study area corridors that provide access to South Seattle are some of our the boards greatest priorities and those are all under this they category that we are not sure what what controls this plan actually has on it as an accountability document because none of it is it's not funded through design or construction. So we Like to know a little bit more about a lot more really about what that really means and what commitments this document has to those projects. Yeah, so I I'll take a quick stab at it and it sounds like something that we we should probably talk about a little bit more as we as we move on here. But the idea here is that as we need to go out and see the new revenues to fund construction. We really need to get Beyond just lines on the map and we need to do some studies. We need to collect some data and we need to know what's feasible out there so that these projects are set up for success and that we can go forward and seek grants with conceptual designs that tend to be looked upon more favorably by granting agencies than just you know, your simple. This is in the bike master plan. So that's really the idea behind this concept is these projects will be advanced in the conceptual design phase and we'll have a better idea of what's possible out there and will start sketching out some of the details so that when those funding opportunities arise and when those Grant Partnerships are These are the projects that are ready to go and you know a little bit past the starting line at that point to take it a step further during this whole process. We added the MLK study area. It's going to be reviewed with the Consultants hired to do they accept access for Mount Baker. So that's ready to launch and then a Serena who's back from maternity leave. You think goodness she's going to move forward with the beacon Ave. So working today to start that immediately. It takes little time to run Ark Contracting, but just know that those two are starting and then we'll work for will move forward with a plan to start planning on the other one said we haven't a tied to a p.m. Yet. Just I know you're kind of like me is very similar position. You just got to the party. And so I really hope that you take my comment so hard about just what the promises that are that are made at the promises that are kept because that's really what my long can worry is Levi comes for a new or we look for new sources of revenue that public trust may not be there. And so if it's not there that then obviously this week we're we're stuck in a log Jam in a log Jam that is not beneficial to any of us. And so I want to applaud the work that your department has done. It's the work of your department has done that is really loud me to not have a car and live in North Northeast Seattle. I happen to be in a very Transit Rich bike-friendly part of the city, but I know that most people that look like me don't have access to those resources. And so when I sure that work we're doing what we can to advance it so that more folks are able to access pass. so particularly appreciate those comments. Did you live in a neighborhood that's well-served the burke-gilman Light Rail and Transit but it's not the same everywhere. Now. You said, he's one of the things that I would love to work with you or that entertain is a idea of coming back with a resolution in the next month or so to this is not an essay required to formally kind of except the implementation plan if you will and then also make some some requests in there and I do want to work with everyone at the table and the community to but some of the things that the jump out to request one is especially looking at Southeast Seattle. And so nobody but my sense is that the beacon Project Beacon Avenue project because it's a colored line on the map. There's a certain level of of studying analysis has been done and it's and it's probably a matter of finding a Cassidy to make that happen when MLK is extending that down to Henderson. I think I hear you correctly. There's still a fair amount of work that needs to be done to know that if it's feasible anything's feasible to start with it, but it in the realm of in the current political thing to do but those are two two areas of Southeast Seattle. The photography is such that they're going to likely serve pretty different markets and so would really love to see I guess I asked for you now and hopefully the resolution mean if I'd is how to accelerate the analysis on that and get those ready for when you find funding these will be ready to go. Those aren't the only ones there other projects, but I do think of focus on Southeast Seattle. Similarly. We talked a lot about the downtown you the the downtown Network. I am excited about getting a bunch of projects on the ground on 4th Avenue remains kind of a question. We talked a lot about that. It won't don't need to go. is that too much more detail here, but will probably ask about that in a resolution to the the you know, your reality is that there is finite funding and you can't spend money that you don't have and I know that you've been very clear in the mirror has been very clear as he just promised spending money that she doesn't have because she wants to keep her promises and I respect that a ton but I would love to do is be to be able to work with with the Department. The mayor's office in the community Define more Revenue so we can make bigger promises and keep them and so a lot about what do we do? And how do we prioritize those existing Revenue sources now, I know the mayor and all of us are waiting off a bunch of needs in our community, but I do think there's going to be some opportunities in the coming months to identify some some revenue streams that I'm hoping will Elevate, you know MLK if that's feasible, certainly Beacon Avenue and also 4th Avenue both or whatever it is is excellent for the comments said east of 3rd Avenue Sycamore. That's for 6 or whatever that is to have connections in both directions to make those connections would be really important. And so the only thing I'll just mention is that I know that the Keurig your organization is strained. We're just talking about one aspect of it, but there's another aspect of it and so I would love your thought as we work towards budget this year on how to make sure we're building capacity within the organization. So if you want to add another one or two major projects on this list each year the I don't want to be here a year from now someone to be here and say hey we came up with a million dollars is like that's great, but I can actually spend it because my planning departments to strain. I don't have the office space to hire planning folks. So maybe smaller things that we can be doing to the set us up so that at the end of this this plan A lot of these are some of these things that are on the planning list or actually on the ground and being delivered and that's something that we ran. Coordinate on that and I realize you probably have a long list of asks the mayor I'm sure would love to Grant all those but she's going to hear a lot about some other places too. And so there's a bunch of processing we work our way through that that I'm going to really want to hear what we can do in this budget to bolster the resources of s. So, they're prepared to accept more Revenue when we our future Council has gone crazy open to the resolution concept. I know if you have anything else any points who won out of hand drawn on forever, but I won't keep going at this point and Liam and anything else you want to add to to this certainly be looking for your input as we move forward. I think we would love to see a resolution like that. You know, we were talking earlier that while it's definitely not perfect and there are things that we don't like if everything in this plan including everything that's on the planning list could be built. It would be a plan that we would be proud of remind you. I'll meet the first week of the year of the month. Okay. Okay. So that's going to be a little tight, but maybe I'm what will try and do by mid-july get you a resolution in concept for your feedback at your August meeting and then we can look at an early August adoption again via the formal adoption. The resolution is really a mere technicality. We the more information we get out there and then we're sharing that and giving outside feedback. You don't have to wait for us it to do anything to dress that but we'll we'll work on that and that's all I want you're of coordination on that. We're going to we're going to push just like people in turn on your fishing but want to make sure we're being realistic to Sounds great. I really appreciate this. It's been an exciting couple months. Thanks for the work you're doing and it will be fighting next couple months to thank you all so much as anything else on this lovely day. I am going to adjourn the meeting. Thanks everybody.", "end_time": 9882.1}]}