{"format": "raw", "annotations": [], "confidence": 0.9417648937020983, "data": [{"start_time": 0, "text": "We are items on today's agenda. Thalia going Okay, we have three items on today's agenda first. We will discuss the successes of Seattle's tiny house Villages tiny house villages in Seattle have been perhaps the most successful support for people facing homelessness. They provide some of the most essential dignities of human life, like privacy safety a place to store your belongings and lock the door many have self-management where residents are empowered to democratically run their own communities even based on the metric of the city of Seattle Human Services Department tracking transitions to permanent housing Seattle. Tiny house Villages are far more successful than even the enhanced shelters in reality. I do not think this is a this is a the best measured by itself because obviously we need a major expansion in affordable housing and that can only be done. On a public basis meaning expanding. So massively expanding social housing that is publicly owned affordable housing by taxing big business or other such Progressive revenues. We cannot depend on the for-profit market. However, be in addition to that. We also need immediate services to help homeless people in the here and now and we need shelter for them to go to and Tiny House Villages. I have had a remarkable record of success. It is my hope that out of today's discussion. We can talk about expanding and extending the Tiny House program and that we can as a movement together push back against the right-wing attacks that pick on these villagers to attack and demonize and perhaps they do this because tiny house Villages are visible. Today, we are community members, you're from Lehigh and Nicholasville and at the outset I wanted as all to acknowledge that. That is an ongoing difference of opinion between those organizations and community members at large are also engaged in this discussion alongside the city's human services department and that debate and discussion needs to go on. I want to be clear. I have at the chair of the Human Services committee and as an elected representative of working people. I have the deepest respect for the incredible work done by both organizations. Not only over the past years, but over decades and myself and many community members have requested that we go to the mediation process and the other said that discussion will happen in the meanwhile in this comedy. I just want to make sure that I wanted to acknowledge that but also wanted to clarify that that particular topic is not the subject of today's discussion today's discussion. I need to be focused on the overall value of tiny houses in Seattle in general and that is something we all agree on regardless of the differences. We might have on a specific issues at specific tiny house Villages because we all need to be United against the attacks by the right-wing. So I hope that we will all focus on that question, you know, why tiny house Villages have been successful and what should be done to expand them and extend them in the city and I know many committee members have showed up to speak in public comment, which I really appreciate you all doing on this Friday morning and you are welcome. It is you're completely your right to speak about any topic you want to speak about but I would appeal that the most valuable card that money from you all would be on why tiny house Villages have been effective in general because that's the overarching goal of the discussion today. The second item on today's agenda is a discussion with DSE Lehigh Mary's place and youth care about their hopes with and Sons as the city and county discuss Regional coordination of homeless Services, they will talk about their experience and what will be necessary in their opinion to allow them to most effectively help people find housing and provide other services. And finally we will have a shot update from the mayor's office about the legal framework for any Regional structure for overseeing homeless services. So, I'm really thankful to the mayor's office for participating as well before we begin the agenda items. Of course, we have public comment and usually public, does 2 minutes, which I'm always happy to do. I have an unfortunate conflict, which I could not avoid avoid. I have to join immigrant community members at one of their events and I will I have a Lionel 11:15 so that we all have 1.5 minute table, and a minute and a half and I'm really grateful to Michael chair of the number back show who was agreed to chair the meeting if the meeting goes beyond 11:15, please thank you so much for your name read as a subsequent speaker. Please be ready to come out so we don't waste time and transition and each of you will have a minute-and-a-half. Thank you. there are the first three names are David Haynes followed by Jess smoke followed by Sue hotz when is city council going to stop using social welfare nonprofits as Grassroots political re-election supporters and hold them accountable. It's not a village. It's a village of budget money and a smudge it with data as forsaken lives go splatter. These are modern third-world slums in the racist government oversight of Untouchable politically-connected self-appointed nonprofits who get rich subhuman mistreating the homeless we have zoning laws to protect residential first-world living areas from industrial commercial noise in air pollution get low income housing thinks. It's suitable at safe harder to be at Safe Harbor to force people to live under a crumbling Magnolia Bridge next to a cancer-causing horn honking train Sharon. Lee uses blessed volunteers and donors to build. Tiny houses get Sharon Lee and her privilege College pubes pocket all the money needed for noise abatement. And fur World Plumbing, it's worse than an outhouse a hundred years ago with strangers who are dirty using the bathroom porta potty in the dark. It's anyone's guess guess whether pee or poop is on the toilet seat being forced to live under a highway. So low income housing can save money on first world Housing Shelter so she can buy off politicians to get rich is not acceptable if we had city council investigate the services of low income housing. They would find corrupt dishonest half-ass efforts at Urban rest stop. Jeff Called by Sue Hodes filed by monali. And I'm up. Archer a dream Search I interviewed a hundred and fifty people living in tiny house Villages intensities my conversations with those folks really showed me the value of the densities and Tiny House Villages. They are life-saving. They provide opportunities to stabilize of safe place to keep your stuff a safe place to sleep. And they also provide Community the benefits of which are impossible to quantify even for a public health researcher. I think that the current management disputes are really putting these benefits at risk and I believe these disagreements can be resolved by mediation by a neutral third party member and there's community support for this idea a few Community activist myself pastor and Rikishi and Sue hodos from neck District 2 started a petition calling for mediation between Nichols Vali-Hi. Nhsd. We got there in 110 signatures on this petition. A lot of people that had a lot of comments about why these are so value. We're facing a crisis. That's not there's no end in sight. And while the conditions may not always be perfect in these encampments. They're really valuable for the this is what we need right now. So I have copies of this petition to deliver to all the council members were present or not present going to pass them along and also to Nickelsville Lehigh and HST. Thank you, Jess. after 2 Tell soothe and Mona vand dick Brooker. Mac I visited to homeless encampments I made friends with one woman when she was living in a leaky tarp on Denver Street, where a waterfall ahead when it rain later she moved into Georgetown tiny house village where she really has blossomed. It was amazing to arrive there and see her in the guardhouse of the or the Gatehouse responsible for things like checking in villages help visitors helping residents Reserve laundry time and she felt so solid compared to being a wreck in her a neater and less lost in suffering besides the security and well-being of our own safe space and access to basic Health Resources, like showers and bathrooms in food. There was Community the empowerment of community decision-making and responsibilities to the other people in the village is an essential step to Healing Community counters the isolation and powerlessness all of us feel. And it's needs to be nurse that interconnection and feeling useful and worthy for all of us. This is an important step to integrate into larger communities. When Tiny Village members get permanent housing expanding the number of tiny house Villages imperative. We strongly support Nichols alijai nhsc to mediate their differences. The people of these organizations need to work on their communication skills. And on their Community skills, Nickelsville in Lehi or not enough Seattle Native American people on 1% of The population 10% of homeless people the native organization in the coalition to end Urban indigenous housing say over and over again Native American people who are lonely homeless respond to other Native American people they disappear. Otherwise, they should have more mean more money to community is not like each of us holding tension of our differences, but if we don't hold the tension over differences, we have a government like our federal government. Thank you. Good morning. My name is Mona Lee. I have been neighborhood activist in Othello for more than 20 years. I believe I speak for the majority of my neighbors. When I say the Othello tiny house Village has been a great asset to our neighborhood. We are proud that at least an hour neighborhood some people who are homeless or able to have a reasonably high quality of life. Best of all, these all villagers have until recently been most gracious and generous with their time by participating in neighborhood cleanup projects and working to pick up trash around our neighborhood town center and the light rail station. However, recently there have been rumors of conflict that is not resolved may result in the closure of the village. We do not want that to happen. We want a full abilities to continue. This is wonderful asset to a fellow we have heard. There's a problem arises from a conflict involving the city Lehigh and Nicholasville. I have I requested City Council Place pressure upon, Nicholasville. To give up its hold upon Othello Village my experience with Lehigh Personnel is if they are caring and responsible people who want to maintain adjust environment and help their leaders connect with jobs and permanent housing. Where is my impression of Nicholasville personnel? Did they offer manipulate village villagers and effort to create a political machine to fight City Hall? I don't think we need to fight City Hall with respect to a fellow Village. The village is an example of the city trying to deal with the homelessness crisis in an economical yet, please Okay, I'm done. Thank you. After Dick Burkhart comes Donna Anderson, Luke Reynolds, Naomi C Hello, I am dick burghard a founding member of the community advisory committee for the cell tiny house Village. I'm also a scholar and activist is a democracy local to Global heading a small nonprofit called democracy Works, besides being a PhD mathematician and scientist formulated official and current national Faith leader an economic inequality in the green New Deal. And first off I want to say I continue to strive to be a strong supporter of a tiny house Villages at least when they are well-managed but I've been appalled at the highly unprofessional actions of the top leadership of Nicholasville over the last few months. I mean their war of insults against the low income housing Institute. Instead of collegial Candor and respect I also mean their refusal to accept appropriate Democratic oversight accountability, especially the procedures for barring individuals from The Villages. Despite a long history of allegations. Instead. I've witnessed a Savvy political machine combined in weird ways with irrational deceitful and vengeful behavior that has led me to conclude that the top leadership of Nicholasville need professional help and that until they get it. They shouldn't have no role no management role in anytime House Philly turn camera. That means I see no point of mediation at this time. What is really need is a thorough investigation right outside of what's going on in the villages in an outside audit. Thank you. Donna can you read out if your name spelled by Luke Reynolds Noemi C and Kayla Martinez? Hi, my name is Donna and I'm a resident and the community outreach organizer at Georgetown tiny house Village. I think from the beginning the tiny house Village concept is a working solution for homelessness now and for the future The Villages have had growing pains and we've all made mistakes from City officials to the organizations and charge to Residents and leaders at The Villages. But our partnership with Lehigh now is addressing those Growing Pains head-on and to the best of our ability. We are working on a tiny house Village manual and hopes that it will be used across the country is different cities address there homelessness in their Hometown and we've always worked under self-management model, but now with Lehigh as a partner to ensure that city regulations are followed. We're working on an updated self management plan that gives Village leaders and we have case managers more opportunity to keep our residents in those Villages until they're ready for permanent housing. We're building positive. Community relationships just this past week Amazon came out and build about 25 porches and ramps for a residence. Google will be out in the next couple of weeks to help with some exterior painting and hopefully I'm bed frames as well. But anybody can come by and visit and volunteer if you want to volunteer, you don't have to be Google or Amazon we can find something for you to do some where we no longer can play the blame game or Linger on failures from the past. We have to think about what homelessness looks like and that looks like me and these faces behind me and people that are still on the street. I'm so next time you want to vote in regards to homelessness. Just think about us all of these faces and vote for these faces. After Luke comes Naomi Kayla and Brooke Gardenhire. Hi, thank you as a Jesuit volunteer in Americorps member for Lehigh Tiny House program. I am astonished by not just the model but by the way and Powers individuals and transform in February, I help to run the emergency shelter for people out in the cold composed of individuals who have been unwilling to leave their tent for sometimes years traumatized by homelessness shelter in a society that largely abandoned them after having several of the people in the shelter navigate into tiny houses. I have seen a transformation like nothing else. I've been fortunate to see people on the verge of hypothermia in the cold winter snow transform not just as individuals, but as members of our community Whether it taking on leadership positions in self-managed villages or leaving community service projects in the neighborhood and also looks like getting jobs and working towards housing which they thought might never even be available. Tiny houses provide residents with a path towards a better future the community structure coupled with services at the door next to your tiny house allow people to dissipate some of the trauma and challenges associated with homelessness towards a more stable and sustainable Life as a full-time volunteer. I am honored and enthused to work with such a great organization, but also with residents that have transformed my life. Tell me. Naomi see here after Naomi comes Kayla Martinez, Brooklyn Gardenhire and Chris brand the next video Spend time with people walking. Good morning. My name is Naomi C and I'm currently an undergraduate student at the University of Washington and a volunteer at the low income housing Institute. I feel very grateful to be able to have this opportunity to share my experiences with the tiny house Community as a student. I have learned more in these past couple months about Community creativity and compassion than anywhere else Beyond The Villages unique success and housing and supporting individuals. The tiny house Villages have this incredible ability to facilitate the creation of community at a large scale in just a short time. I have the privilege. I've had the privilege of witnessing how tiny houses have brought together businesses religious institutions schools and citizens under a mission to care for our fellow neighbor. There's so much more to each Village than the physical structure behind every nail piece of wood. There is a dedicated volunteer passionate donor and committed organizer behind every running Village. There's a tireless group of CAC members who represent generous and caring communities that surround the village behind every positive outcome. There's a gifted human being lifted and a powered by these communities. Thank you. Kayla Martinez followed by Brooklyn Gardenhire followed by Chris Brown followed by Dove gun Malden, son Good morning. My name is Kayla Martinez. And I'm am new Americorps Vista member and a volunteer for the low income housing Institute Lehigh has provided me with a once-in-a-lifetime opportunity could to combat poverty had on Tiny House villages in my opinion are the most Innovative and dignified shelter system in the country. Funny house Villages are physical embodiment of community and empowerment the community that forms in these tiny house Villages can only be credited to the incredibly resilient residents that called The Villages home. I've seen the benefit of these communities first Hansberry uplift residence inn provide internal support that can't be replicated Lehigh and Powers residents by supporting Democratic decision-making or organization has worked tirelessly with residents to identify best practices for Democratic decision-making and will continue to do so looking into the Future. These villagers should continue be supported by the city of Seattle. There are fundamental tool to solve this homelessness crisis. Thank you. Good morning city council and panel. My name is Brooklyn. I've been at 10:33 with sharewell for 4 months currently on one of the EC's who try to maintain order in all the chaos. Thanks to 10 C3. I've had time to get things in order for me. I am working sober and healthy my partner Tabitha and I are both working to get our own place. It is just hard to afford rent in Seattle at the current time tensity three allows us to stay together with our dog tasks. So while back I was at Safe Harbor during the transition between Cher will & Lehigh it was still Tent City 5, then there was confusion as to who was in charge of the camp. My girlfriend Tabitha was an easy there. It was supposed to be in charge with the other easy members. She never felt like her vote counted. We had an on-site case manager who some thought was the can't manage. I may have made some mistakes then but I've learned from them now now I am at sure will Tent City 3 experiencing true self management. Where am I vote actually counts self-management leads to self esteem. Please stop trying to take that away from us. We need the city council in this panel to support share will in Nickelsville as models for self-management to continue. We know it is not the only solution to end homelessness homelessness, but we feel it works for many of us who want Better Lives. Chris brand followed by Dove guitar Walden followed by Sean Smith Good morning. My name is Christopher and I am a co-founder and executive board member of Camp second chance. I just have a few words to say, LOL. I just have a few words to say about a lot and I hope they're important tiny house Villages save lives, and I'm a supporter of a tiny house Village. Thank you. I am Duncan Wilson and I'm retired live in West Seattle that I've been helping to build a tiny house Villages for the last two years. I have no opinion on the current the discussions between share wheel Nicholasville and Lehigh but I have work with Lehigh and find them to be a very productive and constructive organization where I stand is that the housing crisis in Seattle is not going away anytime soon. The tiny house Villages provide a platform to allow people to transition from complete homelessness back into more normal lives purpose of the city, the objective of the city should be to provide housing ultimately for people of all income levels. Not just the people who can support the market levels that are now prevailing and I hope very much that the city will make its Surplus properties available and provide infrastructure to an a All the tiny house encampments to function as viably as they possibly can. Thanks. After Sean Smith comes Peggy Hoda's followed by a nutria Freeman followed by Eric Davis. Good morning. Cancel. My name is John Smith. I am the external Affairs coordinator at a thumb a village over the last 4 years the city and partnership with nonprofit sector and homeless people has embarked on a grand experiment dealing with this increasing homelessness crisis. It has been for the most part a grand success the front with difficulty while the existing camp and Cameron ordinances good start. It does not address all the needs of the homelessness indeed one shoe does not fit all. If we are to renew or update you just ignoring this we should bear in mind a few simple things one. We should have a variety shelter the matches the variety of people that are experiencing homelessness to we need to hear from the experts. I eat those who have experienced or are experiencing last week. We need to build the necessary how to quickly to address the tide of iniquity that has swept across the bar beautiful say, thank you. Good morning. Council member is my name is Peggy Hilton. I volunteered with Nickelsville for over a decade in March the large corporation which HSV has handed over all contracts to for the ten City sanction and Camp tried to fire our small Grassroots organization and Community from the three tiny house Villages for which we are the only city certified operators. This is dramatically increase the cost of running these Villages and has emasculated there in power and self-management occupied. Othello Village is presently incurring an estimated cost of $800 per day for paid corporate security at that rate. Well over a third of the villages total budget of $460,000 a year will be exhausted by the end of December when operated by Nickelsville The Villages had no security cost because the people living there did them as one of their responsibilities, I believe everyone on this committee can tell the difference between this corporate model which gives paid site managers. Central staff the power to overturn each and every decision of the village and the Nickelsville structure of democratically organized decision-making coupled with checks balances and oversight by its Grassroots board of directors. The city council should investigate and audit hsd's and the corporation's operations of tiny house Villages every individual city council member and the council has a body should insist on mediation between hsd the corporate contact holder and the Democratic and self-managed communities. They are trying to ruin. Thank you. After Anitra comes Eric Davis and Joshua Floyd. Good morning. My name is Anitra Freeman from Cher real. 10 years ago a group of homeless and formerly homeless people came together with a dream of a tiny house Village for 1,000 people called Nichols spell Nickelsville good work and persistence is what has brought tiny house villages to this point Nickelsville themselves Drew inspiration from Cher Wheels 10 cities. It was sure Wheels could work and persistence that led to City support of organized homeless encampments the creation of lichten Springs Village and the first city sanctioned encampment, Tent City 5 Seattle's efforts to end homelessness work best when the efforts of homeless people themselves a recognized and respected when homeless people control the decisions that affect their lives. In recent years sure will and Nickelsville self-managed model has not been respected and supported by the powers-that-be. This is severely damaged our community and our city our community and our city will be better. If you insist that the pioneering Democratic self-governance of Nicholasville and share will be applauded and supported. Thank you. Is Eric here after Eric Davis comes out Floyd then Sylvia Munoz then Anthony Lopez. My name is Eric Davis. I'm a co-founder of Camp Second Chance. One of the democratically ran in, it's also inside Corners Lehigh. I just want to talk to you on the importance of the tiny house Villages and the community the community coming together and working with the residents building them and having confidence and having a place to stay. It's more than just an expansion. It's more of a bond, but all the discrepancies about how Villages of ran I challenge most individuals that go inside each and every village and you determine if they're being democratic. Because I've come from Cher will nicholville tent cities 3 years ago and some things we didn't agree with the best thing we can agree with was it was a shelter. But we spent changing and found Camp Second Chance the 2016 and we went toward the best practices of a village which Democrat Lear and means you have a voice and a communal. Yeah togetherness about each and every step and transparency to oversee. So there's no clicks. There's no, you know people being afraid if they don't go out new political things, they'll be put out. We don't do that. So transparency needs to be from top to bottom. If you want to really clean and sober environment or really ran well and Chapman keep transparency and all of that. Thank you. Can you read the names dead after he comes Sylvia Munoz followed by Anthony Lopez? And then our last speaker is Michael Galloway. Good morning. My name is Joshua Floyd and I just wanted to state that I am a former resident of Camp second chance. It is democratically run organization. I was once on the board there and when Lila Lehigh took over as our fiscal sponsors, we had nothing but Harmony they listened and they took care of us. So that's all I have to say. Thank you. Sylvia Nothing selfish. Anthony Lopez is up. And then our last speaker is Michael Calaway. My name is Anthony Lopez. I am a current resident at T5 tiny cabin Safe Harbor Interbay. I'm speaking on behalf of my camp and just my own testimony. I've been homeless for a year now 3 months ago when Lehigh came in to take over from Cher was fabulous prior to that. We were having a lot of problems the whole thing with the EC's and the security shifts and all this and that there's a lot of power tripping and people were getting barred which means you get thrown out and stuff things like that. We're not But which is what you call it. Sorry, I'm nervous that they weren't it wasn't humbling to have other homeless people attacking you when your homeless to and because of these rules that share had put other words in control have put everybody in control of themselves and other people people were not you know, following rules directly and people were leaving and you know, I was one of those people that left because I have anxiety and I could not take the pressure but when Lehigh came in they said, you know what we're going to stop all of that weird. There's no more ECS. There's no more power tripping. You guys can do your own Securities and we want you guys to get out there and have a success story and go get a job and and, you know get therapy if you need it and they, you know, put that funding into work and now we have cabins. We have a brand new kitchen. We are going to have laundry facilities. We're going to have washer and dryers and that in I heard me and made me feel really good and just being able to be in my cabin and be with my cat and you don't get up in the morning and go to school and go to my part time job and get therapy is helping me so much, and I just want to thank Lehigh, and I was just want to thank you know the city of Seattle for funding T5, and we really appreciate you guys. Thank you. Good morning. My name is Michael Galloway, and I'm a friend of everyone in the room. That takes my minute. I'm happy to do it. I'm a friend of Chief Seattle, but also a chief less shy who was hung because he was found to be guilty of things that committees and processes thought should be hung for we lose too many people in this city. Not just because of crane accidents where workers are under pressure to remove pins on the way to take it down or not. Just because of Boeing 737 had an angle of attack that was designed top down by Engineers who know how to fly planes but people real people need to be involved in every process that every person in this room talked about today and it will be wrong if we think this is Nickelsville versus the other group totally wrong and that's what politics does to people. So let's not be divided. Let's be United and whatever the process is today stand with each other. Go to the homeless store to the Nicholasville or to these various camps and just hang out meet your neighbor. That's what we have to do. So thank you for letting me be a friend of everyone in the room. satellite speaker Thank you to everybody who testified in public, and I really appreciate it. And as I had notified you all are earlier. We usually have two minutes for public comment and I I just have to I have an unavoidable obligation to attend a community meeting and I have to leave at 11:15. So I appeal to you all to speak for a minute and a half each and I think you all are provided valuable testimony as to why tiny house Villages are important and it was also crucial that are not only people who have experienced a tiny house Villages themselves from being homeless spoke, but also volunteer students of the University of Washington people who have seen it in action have also testified and I really also hope that a future, TV will look at the study that just smoke was talking about and I also wanted to know it again some of you want to hear when I spoke earlier. The unjust came up a little bit in the public testimony that we not yet. There are ongoing discussions on some differences that have Arisen on the management of some of these tiny house Villages and Dad will that discussion will take place independently my office of course has a joint committee members who are recommending that we have a mutually agreed-upon mediation process, but I also wanted to remind everybody that is not the topic of discussion today. So when we have our group at the table here, they will be focused on the most important question, but you all have also reiterated in your testimonials, which is the importance of tiny house Villages the effectiveness that they have proven ending in their track record and why the city should actually be making concerted efforts concrete efforts to expand and extend them. So I really appreciate y'all reiterating that and I just wanted to call somebody who said, you know, self-managed medical self esteem. I think you All have made very very clear that part of the reason the tiny house Villages are have been so effective is because they truly provide a space of dignity and community and that is absolutely absolutely an essential core to rebuilding your life after having faced some devastating experiences that homelessness comes with. I'm sorry. Okay, and so we we we will have presenters coming to the table. So if you can please join us here, I was wanted to acknowledge that we've been joined by council members O'Brien herbold and Pacheco. Thank you for being here. An end-of-summer. Will you can take you I just want a very quickly before we get into the presentation want to remind council members and the viewing audience and the folks in Chambers who know this to be true from their own experiences that we would have neither sanction encampments nor tiny house Villages if it was not for decades of work of Lehigh, Nickelsville and share wheel working together towards that chair. Thank you. Yes, I totally agree counselor about we have Decades of United work behind us and I have no doubt that we will be able to go forward on that basis. So will all the presenters where's your first just give me a quick introductions for the record light go around the table starting with Ileana just very brief 103rd auctions. And then you are free to start the presentation. My name is Eliana Scott sonus. I'm the chair of the Acela village community advisory committee. Joshua Floyd former president of Camp second chance I'm Josh Castle in between an engagement director with Lehi. I'm in leadership without a UCC building. Tiny houses at Camp Second Chance service for Lehi. Melinda Nichols, I've been on the board at Lehigh for 22 years and I have been working to build tiny houses for the last 4 years. I'm a carpenter. executive director low income housing Institute or Lehigh Jeffrey Pastor New Hope Baptist Church and one of the partners with the new true Hope Village. Thank you God. Xelaju starting we wanted to have a presentation on PowerPoint presentation. And who has the quicker can I grate so? How do you hit? stupid space bar Okay, great. So I wanted to first show you the extent of lehi's work in terms of R housing and we have housing Urban rest stops and Tiny House Villages and we provide a full range of Supportive Services and will also participate in advocacy volunteer programs. We think housing is the solution but as you know, it's very important to do advocacy including advocacy at the state level for additional resources for homeless and low-income housing. I want to show you two buildings that the city of Seattle fund it and we are grateful for your support for the housing Levi. We have about 65 properties. And of course permanent housing permanent Supportive Housing is the solution on the left is the Marion West which includes housing for homeless young adults on the second floor over the University District food bank, and then we also have housing for the wage workers. And the reason I'm bringing this up is because we were able to move people from tiny houses living in tiny houses to the Marion West And also on the right is the Tony Lee which is 70 units of Workforce housing over a preschool. And again, this is on city-owned property that you transfer to Glass and there is a preschool 480 children's with Refugee Women's Alliance and we were able to move people from tiny houses into the Tony Lee. So just to let you know that even if it's homeless housing or Workforce housing, we make it a priority to move people who are living in tiny houses and it's because of city council providing the mayor and city council providing us funding for case managers. We have case managers at every site filling out housing applications and moving people into every new building that we open up. This is June Leonard Place, which we just opened up and we're 100% leased this week for homeless families homeless veterans and low-wage workers just to let you know that we also take a regional approach to making sure that there's permanent Supportive Housing. So these are our vice cops. We have three of them in downtown Ballard in the U District in Seattle there for people experiencing homelessness. They provide free laundry showers and bathrooms are funded by both private donors and by-and-by city funding they serve about 800 women and men everyday the first one that open to downtown open in the year 2000s our busiest 101 survey be conducted each other. Half the people at the rest stops are employed. So they're showing up to get ready for work day lineup typically at 6 a.m. And they're getting they're taking showers and there and they're getting ready for work. So it's really a Lifeline for a lot of folks and they also provide housing and employment referral services and they're powered by staff and a whole bunch of volunteers that keep them running. Ballard Urban rest stop in is attached to our Cheryl Chow Court, which is an affordable housing building a house for over 50 seniors. Urban Rest Stop open in 2015 and include bathrooms 5 showers five washers and 9 drivers. It serves a couple hundred people a day and were able to provide tours of these Urban rest stops if that's ever desired and we want to thank the city for all of your support end in keeping these funded and we would really like to open more and open them for longer hours. So quickly use all seen this chart showing the number of unshelled and shouted homeless people and it is at at least showing some progress that the number of unsheltered individuals is less a little bit less than last year, but what's significant is that because we have so many facilities now at the tiny house Villages people living in tiny houses have heat electricity locking door and they have Plum toilets and showers and then many of the facilities and are handicap accessible. So now people living in tiny houses are considered sheltered. So we have close to three hundred tiny houses that serve over a thousand people a year, which means that we can touch the lives of people who are on the street or living in their car. So we are making a difference because tiny houses are now part of the effort as Bridge house. To move people into permanent housing and they are not considered unsheltered anymore in terms of just Logistics. How do you provide electrical hookups? And and what what challenges you faced in terms of Plumbing? How do you organize all that? Because I'm assuming that's of a great deal of interest to other cities as well in terms of how it is being accomplished at a very low cost basis expert on how to set some of those up. I just wanted to talk about why we need tiny houses, which is fairly obvious. I think to everybody in the room. I think that we have groups of individuals who seriously need someplace besides underneath the bridge and we have whole families large families. We've done some Innovative things to make sure that everybody that has a large family can still see their kids because our houses are so small we put the houses next to each other with windows so that they can look back and forth lgbtq individuals straight and gay couples gay couples with children families with teenage Sons immigrants undocumented household single man with children and people with pets one of the things I didn't realize is that some people will not go to a shelter if they have a pet. They'd rather stay outside and that's heartbreaking to realize my gosh if we just let them have the pit in their house. They will get shelter. So this is we've done quite a bit of that. The pets haven't been bad. It's been okay with us. So we're really glad to do it. So I just wanted to put the answer your question is that in the initial phase of the tent encampment ordinance the council envisioned pants on platforms and then a couple Honey Buckets and we have a modernized The Villages so that there's actually electricity running to every tiny house. There's a smoke detector there are fire extinguishers and there's heat insulation and we are also installing fans and we also have solar and some of the tiny houses and then we actually put in Plum toilets and showers. So we actually have you will see later in the photographs complete bathrooms that are plump and because we don't want people to spend all day hunting around doing their laundry. We've also put in on laundry services and the kitchens are not Primitives the kitchen's include St. Freezers refrigerators and dining area and there's security and there's also case management offices. So it's like in the old days when you went to you no Family Camp your family stayed in your little lean-to and then you went to a you know, what a kitchen dining and Recreation so we have the whole village set up now, so it's no longer on primitive or you know, it it's actually I'm quite improved and there's also a security fence and a gate house. Good morning police that you see about the service that we provide Housing Resource Employment education basic food is part Series has recently. We have been a locating the homeless people about a program. It's called earned income disregard that with the combination with a Section 8 voucher. Then we be able to get a job at there's no way to pay rent for a year and the second you got to go to use only half of the Incan to pay rent. Everybody have been coming out with a positive feedback on this program that we have been able to send people to Pennsylvania, Idaho, Ohio and California to grab the voucher with their intention to Porter devotion back to you. Do the Washington and so far. None of them have returned. I will have a field day and are working in warehouses. We have a from other states. One of your husband to navigate with a housing process. They know that they have a choice voucher this morning I checked and they are 431 Choice vouchers available or United States eat a check right now. The budget is signed by the president. Whoever I placed in the section 8 voucher. If I do it this morning, they're going to get divorced on the nest secret fiscal year that start on October 1st 2018 so far. I have presented this to the Second Chance in coming and also to some of the folks at the hotel. Oh and they were very very interested even to go outside this day get the voucher get a job with no pay rent for one year on the second yard. They can't even a house plan to stay or they want to put in the washer to any part of the United States right now. We have three resident at the Friday that they are getting educated to get a voucher in Alaska. We have to resident at the consequent channel that one already has a voucher in Texas and then we have to go ashore in California and I've been there are only for two weeks. I might have to work from home because right now they making a line everybody want to go there. This is a program is a predator pro wrestling at in 1990. And the last amendment that was done watching 2016. Is it hot program last amendment? That was done what the program is start running the clock is not going to stop and that would be that is part of the program of this to be supportive services that we are providing now with the president. So just to give you a landscape we have on 10 tiny house Villages and eight of them are receiving support from the city of Seattle. The human services department one Village is being supported by on city-owned property in the City of Olympia. And then one is church sponsored by the Lutheran Church of the Good Shepherd, but you can see don't you like this drone picture of the Lake Union Village our first drone picture and well-organized and you can see the kitchen tent and the long one building in the middle is the hygiene facility. It has seven bathrooms full bathrooms and also a laundry facility so you can see that majority of the sites are on publicly owned property. City of Seattle Port property and then there are some church properties and Lehigh property private property as well. It was one second. Thank you. Just a question as it relates to your hygiene facility availability. The city of Seattle's City auditor has recently in its audit of the navigation team functions and the theory of change and it's how well it moves people from living unsheltered into other situations cited the lack of hygiene facilities throughout the city and noted that there are only six publicly-funded 24/7 bathroom throughout the city. We have made some progress and opening some of the community centers that have showers not all of them. I think all of them should be open but I'm wondering are there opportunities. I understand it would be logistically very difficult to serve more people than our residents of these individual tiny houses. But is there a way to consider how we might open some of the hygiene facilities to a larger population of folks than are currently Residence at Tiny Village is well, I think first of all we're very concerned about this but we have three Urban rest stops that the city has been supporting but the church that were renting the u-district rest stop. We're going to have to shut down that rest stop in the U District which is heavily used. So not only is the urban rest stop in the U District but also the roots shelter for homeless youth we're all going to be displaced. So we actually need your help to find a new site to replace lost space and the u-district but what we found out in terms of hygiene facilities is that it's very important. They're only successful if there are well-lit. Fast and clean right? Otherwise it becomes a nightmare to have us facility that's you know, scary or hazardous or you know, you're not sure you know what people are doing in and so that's why it's so important for the city to look at extending hours of the existing rest stops and existing other facilities and to open up more of them and to us it's a public health issue. I mean and it's also a opportunity issue because we have so many homeless people who are working and they can't find a job or apply for housing if there are not presentable. And so we think it's very important to be open early in the morning. You can't just open up the Saudi like 9 to 5 because that's when people are working. So it's important to have Urban rest stop Titan centers open very early in the morning and then after eating hours, People do their laundry or take a shower. So we would really want to work in Partnership because we have some buildings and there are some underutilized buildings and Facilities that we can expand and open so that unsheltered as well sheltered people and people living under cars can also use those facilities. So, I'm Whittier Heights we this is the one that we're going to focus on three new ones that opened last year. Whittier Heights is the first Village that's ever been exclusively for women. It was requested the city and when I heard that we were going to do it. I thought let's have all women build it and I'm from the construction industry. And in fact, I was on the Washington State apprenticeship and training Council for 22 years representing the city of Seattle. So I know lots of women who are in the industry 225 of them volunteered to do the work and it one of the it also became an international story. We were interviewed by organizations all of the world and it was a very exciting thing. And in fact, I think that having it for women only was a really good thing and I'm going to sleep in a little thing which I think we should do a veterans only Village as well. There isn't one anywhere in the state and it would be a wonderful thing for us to do we have so many homeless veterans. It's unbelievable. Thank you so much for the work that you've done. I love the fact that the women's Whittier Heights was constructed primarily by women. My understanding is that there is space available up at the veterans facility on Beacon Hill that there's parking lots and I don't know whether anybody has reached out to them. But I think a year or so ago. I talked with the leadership there and said why don't we use this? If not for tiny homes. I mean even some of the the mobile options that were looking at the modulars and they've got space and I think that they are to be our partner. So I would love to know if any of you have reached out it would be great and anything that we can use for under your life parking space. I would think would be a good start. That's a wonderful idea. We are working with JBL they do want us to do a village they have been built at their their folks have been volunteering to build for us. So we have a good relationship. They also want to be able to have a place where they can reach out directly to Just cuz sometimes they're extremely elusive but to get back to Whittier Heights. I apologize that was it was a wonderful experience. We not only we we gained a huge number of individuals who want who wanted to build more of them. We also kind of recruited some women for the construction industry, which is a very important thing to do as well. So we're very happy with how it turned out. Thank you for also emphasizing that a letter and put in funding their previous year for a new village and doing the budget process and that's why we have Whittier Heights. So we want to thank the existing Council for making this possible without you. This wouldn't be happening. We are very grateful. My name is son Robert Jeffrey and I'm a partner with look high and in the new true Hope Village along with rev Willis. And so are you my observations are primarily that connecting homeless the homelessness problem with Community existing community and institutions is a very sound principle many African American people who are homeless become sort of Lost in terms of their connection with Community institutions. And so the way I think to help get to help African Americans become stabilized in terms of their homeless situation is is to connect these some of these tiny homes to community-based institutions. Our church has been Very active in the true Hope Village the people cook dinners and take them down clothing all kinds of things which helps them to believe that they are making a difference and nothing that these these tiny homes connecting to these institutions, especially historical institutions is extremely important. So I have nothing but good things to say about true Hope Village in the other Villages, which I have familiarize myself with I think this is this is very important when I was in grad school. I spent three weeks in Cleveland, Ohio on the streets. I lived in shelters. I walked the streets and I lived I know I don't claim to know what it means to be homeless, but for that. Of time I lived in shelters. I took communal showers. I had to eat soup and hear Bible stories before I could get food like your bible stories before I could get to eat and I know what it means to walk the street and be looked at like your non-existent and that you are nobody and I just think that this is a step up this gives dignity it personalizes in a way that is very important. And I think it gives an opportunity for people to breathe and to regain their composure and to prepare themselves to go back out into the world homeless. This should never be a permanent situation is a temporary situation and I think that these projects provide people with that with that space and with that time, which I think is crucial for our people getting themselves together and becoming You know whole again, so I applaud this upload this. So you can see from these pictures directly that the kitchen the commune kitchen has freezers and refrigerators and a kitchen sink and appliances and you can see a typical bedroom 8 X 12 and they come furnished and then we also have I'm the bathroom the bathroom is not like taking a shower along with other people. It's a complete self-contained bathroom as like a module that we brought on site and then we build handicap accessible ramps. And what's unique about true Hope Village is that we found that there was a under-representation of people of color living in The Villages and so the referrals to True Hope Village include the Seattle Urban League to Seattle Indian Center Seattle vocational Institute, which include students students of color who are training in the construction industry as well as the True Vine and also New Hope Baptist Church, so and the navigation team and reach We have a community. That is actually you should come visit. It's so close. It's on 18th and yesler. Please come and visit. Yes, and actually was a real beaver there for the inauguration, but I know it's it's been really improving sin even since then and how to say that all the tiny house build. Tiny houses have been built to volunteer effort we have mostly I would say 90% have been built. Let's say if we have let's say we're trying to open a certain day and that were short then we have a a contractor that builds them very quickly and cost-effectively, but the volunteer ones are built at 2500 for materials and people are building them in their backyard. People are building bikes Coos High School Boy Scouts Girl Scouts businesses. People are building them and then we pick him up cuz they're on skid steer on four by four skids. We take a flatbed truck and bring it to the Village. Say the D is the average cost of 2500. Yes. Yes, and we do have some fancy ones that but those are of our paid before by donors, but that also includes installation and includes everything. So why are the housing code public health comes and inspects regularly and the code enforcement comes in and specs to make sure that we have all the life safety and equipment that we need. And so absolutely we we have to inspect because sometimes you know people disabled Ur smoke detector, but we make sure that smoke detectors are working and we do not allow smoking inside a tiny house and we don't allow of course candles and people have a heater and the heater we make sure is not the kind that Slayers or combustible so that you Cats and dogs aren't you know getting singed that we have an amazing day May last year about a year ago the CenturyLink Field I happened and it was the host of the same space that hosted a Taylor Swift concert the night before so it's a really large space we built 400 volunteers from Vulcan from Seattle vocational Institute. And from a GC came out and built 30. Tiny houses in one day. It was kind of historic because we never built so many houses in so it's so short a period of time and they were hoisted up on a flatbed truck by your house mover Joe and brought the true Hope Village on where they're serving over 50 people. I'm experiencing homelessness. And now we are you know, we Biscayne proved it helped improved are in a we learn more about even more about how to build them out of this effort. It was just a really long amazing day. So how do these these tiny houses compare and terms of the structure amenities and cost to the corporate build pallet ones. We did see the pallet shelters and we had a demonstration about a year ago. What's good about them is that they come fly on a little trailer and then you can put them up in like, you know a few hours but we chose to continue with our stick built tiny houses for a number of reasons ours are insulated. And also we found that it was very important that on volunteers help with decorating putting flooring on putting Roofing painting them and we have more sense of community. Where is without the power Childers look very sort of uniform and also in terms of noise because ours are insulated. We have a thick wall you don't We found at that point what we saw the power at shelters that we saw we're not insulated and I'm so we decided that since the power at shelters cost more than ours more than doubled our our cost that we went ahead with the our conventional stick-built. Thank you. I want to acknowledge all the volunteers that have worked on this and this whole project and remember that I think was a couple years ago. Now Sharon that there was a group of students and they had to combine Statewide competition in Olympia and you and yours were very instrumental and picking those up and bringing them. I don't know where they ended up in a fellow or Georgetown but what I had learned many times and having constructed some of these myself that the buying from the community is so much more when people have Hands-On and I want to really say thank you for allowing that to continue cuz I do think it makes a difference the other point that I wanted to make on the safety about having and I know that this is a just an it but something I'm going to ask you if you do do you spend any time teaching the resident how to use that fire extinguisher because in a case of emergency if you haven't done it before you don't know how to pull out A pin and how to squeeze the trigger it sounds simple but it really is a little more difficult and you don't want to be doing it for the first time when there was a fire. Do you spend any time at all on those kinds of fire safety details? What we actually I'm have a checklist of amadeam safety and Kitchen in expectations around the kitchen and equipment and we go through that and so we also have Pest Control. I think I may be your point of actually showing someone the fire extinguisher makes sense and we can I think we can incorporate that the camp second chance. Thank you how often times people or or whether it's Coast Guard or whomever said you need to update these to make sure that they're within but nobody's ever use the Bev and it is more difficult than you might think to figure out especially if there's a fire burning around you how to get that pin pulled out and make sure the people know Just how to use it effectively. So, this is Lake Union Village is we open in October on Seattle City Light land and you can see again. Oh, I forgot. You know, sometimes we have like a paint party. We will have a wheel invite people including neighbors artist schools to come and do a paint party and so you can see the results. So we want to talk about I'm Camp second chance, we have Cinda and Eric and Jaja. Okay. Let's see someone the democratically ran self magic cabin. This encampment is based on best practices of other encampment another 10 cities that we've lived in before we form Camp second chance. So all the things that you're looking at right there, I practice on a daily basis, but the best part about it is how the community is involved with the expansion expansion means not only for the new houses that are being built but the connection with the community the things we do day in and day out on the weekend building houses have it all kind of barbecue is having fundraisers. I have not doors and gates open on a regular basis help the community see who we are and connect us to them. Does the residents aren't just sitting back thinking there? No one they get to know that their accept it because we are warm and very inviting the community most encampments stretch when they get into a new neighborhood when we leave our doors open and we allow the community to come in supplement. You can come spend the night at my point is it's made it so close that communities come in and want to build daily there a tours every day. I don't get a break because it's so many to its way out of state in County's Justin The View that modeling and persistent. So we want an invite most people should I say encourage people to start this other cities or counties are States from where people have come to visit. Pizza Kitsap. And today is today. We have the city of Tacoma is visiting on true Hope Village this morning visit. I'm also curious I have anybody who is officially part off or ideologically subscribe to the views of the groups, like speak out Seattle or safe Seattle have any of them gum to The Villages of Oz to visit to find out more about the tiny house Villages around 4, so, I don't know. But they would be welcome. If babies doing very well, I talked with them times with numbers of public that they have been invited and and if they're curious to know why these things are working. Why is Tiny House Villages are working and also why it is important to understand that you're not going to be able to solve this problem. Unless your starting point is humanity and dignity and also just the effectiveness of having a safe space with insulation and smoke detectors and fire extinguishers and and, you know a place where you can stay with your family and with your pets. I mean, that's that's obviously that's the basis and having showers and Plum toilets and kitchens that. Is that is what allows people to get back on their feet. So I would really hurt people who are curious or alienated from homeless community. And feel that they are they feel inclined to blame individual. I think it's important that they go and visit and understand this problem and the solution is much more powerful. Thank you. I am as a person who has visited can't Second Chance several times. It's great to see my constituents here at the table are excited. And I really appreciate the work that you've been doing in Highland Park. Could you speak a little bit to two things one, you know, the central exercise was very impressive in the number of tiny houses that were pumped out over a short. Of time, but we have a little bit of operation at Camp second chance as well and is a lot of capacity to build more there. So maybe you could talk a little bit about that and also as it relates specifically to the community building aspect, it would be helpful to like if we could Want to find out a little bit because I think Camp Second Chance has really gone extra mile. There are I don't know. How many maybe you could tell how many congregations are actually active on an ongoing basis from West Seattle and supporting Camp second chance. I mean, it's a lot of people right? It's a it's a lot of different individual congregations and it's really changed people's feelings. I think about about homelessness in and really allowed people to see that we have common cause together in this and that when we win some of us say that we're neighbors people understand that now in a really different way. Absolutely. I'm going to send it to speak mostly about the day expansion on that part. But I wanted to point out the pictures there that community group right there where you see them preparing meals that Julie everyday. I mean anyone comes out the love you get there the warp you feel is very important as a community when you think you had a homeless shelter. That's that's like Better Homes and Gardens located. It's a community where people to trust each other are secure in each other yet. There's no guns. There's no screaming is no needles is peace all day long and this model is what we want to Advocate to have everywhere. So what we're trying to say is those tiny houses and I just tiny houses build up your immunity that you need to have until you can actually get enough of Fort Wayne Housing. We need to build more as much as easy as possible and haven't ran in such a way that they have their dignity and that community That love from the community together question on that. I'm I've been to many of the villages and I've seen some of the work that has been done when there have been conflicts in a peaceful way and I think I've many times have said I was so impressed with what I saw at one of the The Villages that I wish our condo was as considerate as what I saw there. My point being here is what are you doing differently? What are you and your village doing to promote that piece that you described? I put it straight to you and example from each individual. There is no special thing that anyone can and cannot do we practice it and when when something is addressed addressed in a civil matter, it's a dress on a calm tone and if you were using or anything like that, we don't kick you out. We are few treatment first thing cuz I have a history of alcohol and drug care services. So I worked in that field 13 years I can talk with you too in the morning 3 in the morning, but the whole idea is being able to understand that it's not just an addiction is not just mental health. These people need love is well and you don't need to be screamed at you don't need to be yelled that they need to be heard, but I don't own and its distance where they're not feeling like they've been put on the spot and we practice it and is that practices it glows and grows and flows. Now, you got a community this going outside the gates expanding and so we just want to see this love everywhere we already Stop bickering just build. Thank you. And Ted had some on Georgia and I'm going to speak to my experience at Camp second chance. I actually got there and the reason why I loved it immediately was the harmony that was happening at that time, and I said that time but it was continuous up until I just transitioned into permanent housing. Where are you living now? I live in Kent some graduation a beautiful part area. I mean, you know, just cuz you're homeless, can you transition do I have to set up? You know, you can go out there and be proactive and find what it is that you really want so that you keep it and maintain it and the thing about Camp Second Chances. When I ride. I have certain Services. I needed Mental Health doctors things of that nature. Coming there. I was interviewed by Chris Brown actually and he gave me the code of conduct rules. And so I like that right away. There's rules. You have to follow you have to take personal responsibility. I also was able to get because it was a stable environment. I was able to go out and receive the services did I need it or also, the services came to me which was big and huge. I want to talk about five points. They were really important to me while living there. Like he said, we have a meeting every Wednesday. So any position that's available you can you can say hey I want to do that, you know, and there's a voting process and the former person may get it again or you make it so it's all democracy. No, it's fair all the way around the point. I want to make his I felt self empowered. I felt ability I had safety because it was a gated community and 24/7 security living there you have to do to Securities a week at 4-Hour intervals and dad involves the whole entire camp It was like I said Harmony and the services I could receive its it's a wonderful place to be and I will continue to support it as I live in Kent and I'm really passionate about homelessness. I serve on the advisory Council for the homeless and the governor's Council. So it's really important to me to continue to reach back and encourage and help my former people to come forward. Stephanie santerre the Italian village community advisory committee and I think he Community advisory committees are one of the really neat features that got set up in the encampment ordinance on the CAC is bring together stakeholders from across the diverse Community larger Community. We have members of Faith communities organizers business owners nonprofit leaders and many more each CAC is a little different but while passionately committed to the well-being of the residents and then ecac service of bridge between the village and the larger Community you've heard a little about my tiny house Villages are important especially for populations play couples and pet owners who might not be able to use traditional shelters, but the advantages of The Villages go far beyond issues of capacity or accessibility or even their very impressive cost-effectiveness The self-managed Village model is the most important harm reduction tool. But the city has available for addressing the homelessness crisis for people to move from one house to house it off turn it off and needs to be healing and skill-building as well as the overcoming of practical obstacles the isolation trauma and disempowerment of homelessness are profound and often need to be repaired something The Village model has proven remarkable at addressing at a Cellar Village. I've observed how Nichols Field approach has supported residents developing a strong sense of community and a foundation of cooperation and mutual accountability. There's greater physical safety in the village model than in other models, but also having one's own private space and elected Camp leadership and Community agreed-upon codes of conduct creates a sense of security That's essential for being able to move Beyond crisis mode and build a stable future. But the most important outcome that I've seen is the growth in empowerment that comes from having real agency in one's life and future for the mentorship from those with chairlift experience and meaningful work in building one Community. It's this empowerment. I believe that underlies the successes of the self-managed village model. The sometimes I imagine the very success of this model might feel frustrating at times to those at hsd managing it when you Empower marginalized people, they might raise their voices and inconvenient seeming ways. They might not be as easily streamlined into a tidy system and they might impact insist on being treated as individuals with unique needs and when you put together Committees of engage dedicated Community folks, we also might be inconvenient lie vocal I encourage you to use recognize that these are marks of success at the high level of community ownership and engagement from this house in Dunn house is an asset and a sign of successful leadership in programming speaking very personally. I believe the positive outcomes. I personally observed Village can be credited to the dedicated combined efforts of Lehigh in Nickelsville and the support of the city and I continue to hope for a mediated resolution that enables that Successful collaboration to continue and be improved on for the enrichment of a saw. That's good. Some observations second chance. I just want to come in on the creation of Enchanted such a clear example of how the how creating tiny house Villages was really a Grassroots movement that I took fight for it. And when it I mean Camp Second Chance exists because people with nowhere to go went and clip the lock on a chain that will effects and set up an unsanctioned encampment in an empty parking lot and they were 24 hours away from being swept and kicked out of Camp second chance and and community members rallied and stop. Stop that. Suite from happening and eventually they got authorized is not priced encampments the last time I went and visited. It was 10 still wasn't those tiny houses. So it looked a lot better now. But even then I mean there was there was that community that fought for and won that space and it's just like how she are we all nickels will create the credit authorized encampments in the beginning, but it's not just in the past that people at the as a Grassroots movement had to fight and win those spaces. It's happening now, perhaps somebody from Camp Second Chance can talk about your permit to continue at that location. My memory serves me it was getting up in March and you hadn't heard from a trustee and hadn't heard from me to see whether it was going to be renewed and I think it was renewed. Yes, but But I'm just imagine in terms of creating. I know in terms of some a program like this. That's so good and having to having to and not knowing what do that Villages going to continue their up until less than a month before the deadline or maybe even after the deadline. It's not acceptable that that that the said he does that. I just have to run to and I just wanted to say thank you all of you for being here today. But more importantly for the amazing work you're doing out there in the community. It's just it's inspiring and it gives me so much help. So amazing. Put on chance and how we have gone from zero. Tiny houses all a tent city to having 45 on site and how Alki United Church of Christ and Foundations Northwest has raised over $70,000 to build 24 houses of those 45. So I would love to share some observations about that community that level of community engagement that is unique to Camp second chance because there is the space at that site for us to build. I watched a contractor who spends his life in a Lexus going from job site to job site build a tiny house with a resident experiencing homelessness. Not only did he build that but at lunch time he sat down and he had a conversation but that Resident to learn of his life and to start a friendship. I watch them and deliver donations to the camp come back and tore it what he saw went home. His tool belt came back to Camp. He has been with us every single Saturday and has given thousands of dollars to the building of tiny houses. I watch the owner of Alki Bike and Board strike up a conversation with a resident who is tinkering with his bikes that conversation led to a job and the community bought that Resident a pair of work boots so he could take that job. I've watched an owner of an Eastside startup who regularly trucks to White Center because he loves that we're doing bring his HR manager sit down with residents work on their resume is with the goal of getting the residence jobs within 2 months. I've watched myself be transformed on the top of a ladder painting soffits side-by-side with a resident who shared his life with me. He fled The Killing Fields of Cambodia on the back of his grandfather is a two-year-old. I consider him my friend. We like to say that many are transformed on both sides of the chop. Saw those volunteers and residents. We have been told that are showing up every week to build. Tiny houses has inspired the camper lifting them up and very powerful ways. A community volunteers from all walks of life. We experience the positive life of a clean and sober camp and this means there is an expansive base of wide support for this model of sanctioned encampments the camp Second Chance is that Holy Trinity that we all seek the union of City local government local nonprofit and the faith community working together toward a common goal. I'm also a member of the community advisory committee for Camp Second Chance active and listening to local neighborhood's concerns at monthly meetings troubleshooting and Advising on issues at the camp advocating with the city of Lehigh for improvements often dog is Les and supporting the progress of campers moving up and out to permanent housing. So let's keep moving on. I know you're running out of time. I just want to show you the inner bay expansion and this went from 23. Tiny houses to now we have 46 and this is on Port of Seattle property and you can see the kitchen and you can see the beautiful. I would say Japanese style interior of a one of the newest tiny houses and the volunteers. So again every weekend, there's been volunteers at Interbay and Deport extended-release to the city so that we can continue having a village there and again here are pictures of volunteers. Again. The bottom right is on Camp Second Chance where they set up a whole little Factory tiny house Factory on site so that they can build tiny houses in the summer and the winter at all weather. And then on the upper left, you can even see one of our volunteers. I'm Howard Schultz providing food. Okay and Wakeman Springs. I want to quickly show even the lichten Springs which was open for 2 years the city made a commitment that would stay open for two years. And this was a a a village that the navigation team 100% of the people were referred from the street by the reach end the navigation team and look at the outcomes. The outcomes are phenomenal The Village served a hundred people men and women over two years. It shut down April 1st, April 2nd. We analyzed the data 49% of the people wear in permanent housing 39 in transitional or shelters and only 14% either return to the streets or did not give information or we're on a town at 4. So this is a very high rate of housing that even we had on people who had on severe mental illness chronic homelessness drug addiction. We were able to get so many people into permanent housing and transitional housing and you can see the ratio breakout. We served a large population of people of color. The average age was 47 and there were more women than men served in the village and we plan to develop 115 units of affordable housing on that site. So we even had a very successful outcome on the Canon Springs the how people move from the tiny villages to permanent housing. Are they going through coordinated entry or Or is there another path for them? Cuz I think I mentioned you mentioned earlier that many people are going directly into your housing. So can you explain a little bit how that have it at work? Because we knew that the village had to close on. I'm early April we put for case managers and Supportive Service staff that works very very intensely with people and so we move them into Bridge housing permanent housing transitional housing and we plead it at least that we played it with I'm coordinating exception. Basically, we asked if Courtney entry if they would please take the five highest. Ranking people who had the most vulnerability and who are chronically homeless like for 10 years or more and the coordinated entry ignored us. We did not get any help from coordinated entry at all. And as you know coordinated entry is run by King County. We asked the manager. We asked the director. We asked the staff to please prioritize because we did not want to have people, you know return to the street and we did not get any phone calls returned. We did not get emails returned. And then when we went to the meeting, we actually had our staff go to the meetings and advocate for the five people and we were ignored. So I'm that's one of the reasons we're concerned about the regional consolidation of King County in Seattle any kind of people into Lehigh housing into other nonprofit on housing and private. Market-rate housing so just to be clear you're going you're going around coordinated entry. And is there a is there a required to that's the thing? I'm trying to get a handle on it. We are not required to but we took the highest-ranking people to try and get them through corn entry into housing and we finally had to give up because they weren't helping us and what are the conditions that allow it so that you don't have to go through coordinated entry for I was under the impression that everybody had to know because as I said that for instance we have affordable Workforce housing. We have housing homeless housing that's not supported by Hud we have but still lack of a lot of housing that's not controlled and we're not required to go for corn entry. So you're not required to but you attempted to and it didn't work. That's right. And you said that you also your staff also personally went to the meetings. Yes. What happened at those meetings? I mean, did they talk to you there or they said that they have a new method which is not going by the highest score is called Dynamic prioritization. And it actually I think so, they could decide a small group of people will sit in a room and decide that this person here can move here or move here for dynamic prioritization Reasons. I'm so it's a it's a secret and we tried very hard because if the mayor and city council says we're closing a village in 2 years and we you know, and we try to honor that I'm we got no help from coordinated entry. Write thank you. I just as I said before I I have to go join the other turn community in their events today. And unfortunately, we were unable to manage that and so I am having to leave in a couple of minutes. So I just wanted to say a few things. First of all, thank you all of you know, who came here to testify and also worst and I thank you for waiting here because I know it's Friday morning and it's precious time and especially thank you to all our presenters. It was really really important testimony isn't very important to share especially in this environment. Where Homeless community members are being demonized and vilified and a basically being treated like criminals. It is very very important to take the message back to the essential Humanity of all our neighbors and furthermore. Also show that there are Concrete Solutions and dining house Villages are a big component of Concrete Solutions that have a proven track record of success. I hope that as I said before, I hope that in the near future we are very near future. We are able to completely discuss how we can expand extend the ability for tiny house villages to exist and also it also brings up the question of how do we find the tiny house Villages? So clearly the city of Seattle has a moral and political responsibilities given the extreme escalation of the crisis. And as you said obviously affordable housing has to be a very very important part of the discussion, but that has to go along with Temporary reprieve like tiny house Villages and I thought Aliana also made a very important point that sells management and giving a confidence and agency and self-esteem to are all people who are experiencing the devastating consequences of homelessness is extremely but I mean, I mean, it shouldn't be questioned just went to Humanity's downfall and I think we should not question anybody's right to their Humanity, but farther more concretely, it plays a role in how quickly they are able to get back on their feet. But that also means that to the powers-that-be to the political establishment to the downtown Seattle Association, you will become inconveniently vocal but I wanted to say as somebody who represents on the committee members and working people and not the downtown Seattle Association of the Chamber of Commerce or Jeff Bezos. I applaud you for being inconveniently vocal and I Hope that you will continue to be inconveniently vocal. And in fact, it is not an accident that many people who are in this room only committee members have been in the tiny house Villages or even translation but are connected to people like Jojo because you feel like a madman you or to people who are going to be homeless because you were formerly homeless. It's no accident that you all were also an integral part of the Amazon. Movement and that was all of us being inconveniently vocal and it's our moral duty to continue to do that because otherwise we are not going to solve this problem. We cannot put our faith in an establishment that has completely failed to address these problems, even though we know these Solutions exist, Reno housing can be funded. We know tiny house Villages works. So let's put our faith in ourselves in. St. Louis vs. Self managed not only self-managed tiny house Village versus matters movement where we decide our own destiny. Forward to working with you all on that and I'm really grateful that don't remember back. So who's Michael chair in the select committee has graciously agreed to continue chatting the rest of the meeting which is at two more items and I didn't like that very important items a second item is where the the people who are working on. The front lines will share their concerns and hopes as to when this Regional governance board can actually provide. Thank you so much. Before we continue I I want to acknowledge and thank everybody was at the table many of you know that I have been very fully supportive of the tiny house Villages for the decade that I have been on city council and I want to say thank you Sharon for your leadership as well and Josh all of you who have been working on this. It's amazing to me that when we first brought this up about a decade ago. How many people said it'll never work and that it just it just is not going to be part of the solution. We know it's not the end point but as we've just been discussing it's a transitional point that is dignified that provides that wonderful space for people to be respected to have the love that you identified and I just want to personally acknowledge and say thank you for that and for all your good work because it really makes a difference love to see a whole lot more of these and but to have the management that you've identified. I've got a couple of follow-up questions when you talked about this alternative Dynam. Make approach and choosing who's going to get to be inside or not. And we had the VIII's for that that it's an amazing acronym that nobody can really say or point to is to what it means. But how how do you move forward with this as an example? There is a man named Michael on the sidewalk in uptown and that gentleman has been there for much of the decade that I know just within the last month or so. We sent somebody out to talk with him because his stuff was getting more and more and spilling into the street and into the sidewalk and he said simply I'm afraid to go inside and what do we do in this mixture of vi-spdat which was a very documented number specific higher numbers get to go first versus what you are saying, which is you got some places for people to go with somebody like Michael. How do we get him inside? I know they're so major question. But what we found out is that when the police are sweeping homeless people from dangerous locations or from sidewalks and I or under bridges they offered them shelter or they offer them a tiny house, but they sent you say you can't stay at this location people who are living in a tent or in their car. They are doing that also for privacy. Otherwise, they would already be in a shelter more often than not they will move to a tiny house. If offered a tiny house they will reluctantly or will refuse to move to a shelter. So we're finding out that the people who are sleeping out now sort of the hardcore, you know, they've been homeless 5-10 years out in the woods fending for themselves. They will move to a a tiny house especially if they have a pet or a partner or belongings because often sometimes when you move to a shelter you might lose your you have to let you know you have to almost Stay there and watch over your belongings, right you don't have to do that when you're in a tiny house. And so you could have a very high score and a Vi spdat at this point is not very reliable because I'm people are getting coached and sorry to say this. But if you are told you have to answer me like a bunch of questions and if you answered yes, yes. Yes. Yes. Yes, then you get a high vi-spdat score. Right? So people are now sorry. Sorry to say they know how to game the system. So this is not working very well in order to get into a tiny house. We don't do a VI spdat. But once they are in a tiny house our case manager will then you don't go through the process and then referred him to coordinate entry. But coordinate entry on we get very very few people who are successfully moving from a tiny house Village, even if they have very high scores. Into housing that coordinated entry is providing. We find it much more effective to move people quickly to housing that is not part of coordinate entry. And so that's why we've been very effective. So we moved over on 500 people into long term housing with very few, like maybe a handful going through corn entry. And so we basically the last two two and a half years. Yes, and so they're no longer on the street and because they're in a tiny house they go to school or go to work. And so we have a lot of people who are getting employment, especially Camp second chance and some of the other Villages they are getting jobs and going to school and becoming stable and therefore we've also increase their Income Support as you can tell we have 42% Had on earned income 58% had a public assistance, right? And so and because people are stable and a tiny house. We don't lose them in the shelter system where we don't lose them on the street were able to get back to them and say okay, you know, here are some must follow up. Let's follow up on getting uid. Let's follow up on, you know, Social Security or employment or you know, they're petitioning to get you know disability. So it makes a whole lot of sense in terms of long-term stability to have a tiny house. So you see some of the people who are now sleeping out, you know all over Seattle, right? We feel that we could get them into a tiny house Village and get them on a path out of homelessness. We really do and where's that drained by the lack of vacancies that you use it for exam? What I had heard for downtown recently was it the numbers were actually smaller of people who are on the sidewalks then what we hear. So the essay is an example said to me if we could make a space for a hundred people right now that we could go, you know 10 to 10:10. So we got a place for you. So a hundred more. I know. We like to keep these the actual spaces down below 50. I think we're saying is a more manageable number. What would you say at this point that what is your solution? What do you think the costs are associated? We could take a hundred of the homeless people who are camping out downtown or near downtown and put them immediately in maybe two, you know to Villages and we also have some sites that are possible including private church-owned are you know public sites and our cost would be much more effective. So I actually have the cost breakout depending on the villages. But as an example King County opened up the jail, right? They spent 2 million opening up the jail for a hundred people and they're spending 2 million per year on operations. Right? So we have for a hundred so our Villages as an example of Georgetown Village is serving 60 people and the cost per year is 325000. As an example of a fellow Village is serving 60 people and the total operating costs is $440,000 a year and then we are able to instead of you know, where to set up a village in 3/4 months as you saw right like, you know week true whole village was set up very quickly because we have volunteers building the tiny houses and then the longest cost was making sure that the plumbing the water sewer hookup was done but the city facilitated that so in a short. Of time we can set up a village and we can get a hundred people off the streets of downtown, Seattle. Could I chime in a couple points on dynamic dynamic assessment in our court in Trent first says that they are raising that it has been changed recently initially you would like or need assessment would have only focused on the vi spdat and recently recognizing that there are flies with that tool not only something that I've been brought up at all. So what is no nationally is that people of color are not prioritize at the same rate and seaweed have an inherently racist response to some degree in nose. So they are adjusting then to use deprioritize of some of the amount that that tours but is used and increasing the amount that we factor in the length of time a person has been experiencing homelessness that helps to mitigate some of those unequal effects and then there's also regular meetings then of the case managers that are whose clients are I have risen to the top of the list and we all supposed to receive housing to actually have discussions and kind of dressing to the point that you've raised looking at. It's like if a person requires having an ID in order Be able to move into a certain setting making sure yes, this person does have their ID. We've already had that happen. So you wouldn't have the same delays that would have been getting a person. You don't want to have a vacant unit sitting as we wait for someone to get their ID. I wouldn't say that necessarily we've solved all problems with coordinated assessment. But some of those factors are being considered right now and changes already being implemented. We would like the council to consider instead of shutting down three of The Village the mayor gave Three Village has a six-month extension to continue those Villages through the end of the year and that we would like to see The Villages expand it so that we have 500 tiny houses and so we can have 500 tiny houses and we can house a lot more people who are now on the streets. In question, so I'd like this is what kind of the Blue Sky question but one of the things that I don't understand is why is there a conflict between many of the providers that do brick and mortar and permanent Supportive Housing and the group at the table? Because I see it's both are needed that these tiny homes are providing the space in the dignity. We've talked about for the person's possession Partners possessions and fats and sure I don't think that people want to live here forever, but it is a stepping stone. And as you said it's a half the cost to set up and operate than what can County did just at the jail. Although I'm thankful that anything where we've got 24/7 as far as I'm concerned is a step in the right direction, but can you from your standpoint explain to me? Why is this conflict in either or rather than and Well, we agree with you. We think we need to do both and as I showed you in the beginning where as a non-profit housing group. We're building as many apartment buildings or permanent Supportive Housing as we can. It's just that takes four to five years to produce permanent Supportive Housing and there's not enough Capital. So right now a permanent Supportive Housing unit cost 300000 per unit 300,000 per unit to last for 50 years. So, you know a tiny house is costing a fraction with 300,000 we can pretty much almost have a village and the village kids the housing the stick-built house and can last 15 years are tiny houses are built to last there are very adorable and we may have to refresh them some right but I think because they're new and Innovative people think it's a distraction. They're thinking of, you know, we should be focusing on permanent housing. We totally agree with that. We think you have to do both because we had a hundred ninety-one people who died living on the street last year and the numbers have gone up at we used to have a 190 hundred sixty people died living on the streets in the previous year last year is 191 and we should be preventing, No person should die from homelessness and that means they need immediate shelter. So I think it's a Humane response a humanitarian. You know, we have a humanitarian crisis. We need to get people safely sheltered in a warm place. We used to have tiny houses that didn't have heat and then we realised look let's just bring heat to it a tiny houses and it was so simple and now there a high standard the tiny houses are preferred than a you know, living in a congregate shelter or Aunt, you know, like some places have a giant tent where you put like two hundred people in it under a giant tent and that's not very Humane or dignified. I have the Privacy that were talking about. Well, we're going to have to move on as much as we could spend the rest of the day talking to you. I just want to Hope tiny houses that that question came up and and I agree with Sharon that what we can't end it was that it's an immediate crisis and and people need women and children need to come out of their cars right now. And then that's that's deplorable to have women and children and people sleeping in their cars and end under bridges and we need to provide spaces for those people right now. And then I don't think it's an either-or to both and this has to happen because you know because of the exposure and because of the absence of dignity just the absence of civilized society. I could not agree with you more. Thank you for that. And how do you respond to the individuals who say well if you build it they will come at the more we build them. People will come into the city of Seattle. Well, you know the data shows that from the point in time count majority people like 72 80% or local and I think you just heard from Jose or poet Jose Rosa Ruiz who was getting people in the housing all across the country. So we are not saying that you have to return or live in Seattle. But if you're from someplace else, California, Michigan, you know, Massachusetts, we will have we will find housing for you. And so that's exactly what he's been doing. So we owe, you know, taking a bigger approach that is not just local or Regional, but it's National in terms of on people's Housing Solutions. We're going to move on not because we wouldn't listen to you for the rest of the afternoon. But I think since we've got that I would like to also extend our thanks to our King County Partners that we see that we need these tiny home Villages across the county as well that the city space is limited. The county has a lot more and I've been saying for years that if we could look by a percentage of population bases across the county. So if we're a third of the population, it's fair that we figure out a way to house a third of the people in the county who are identified is unsheltered. However, we know that there's a lot more space where there is Black Diamond or Bothell that there's faces for people the county can step up other cities can step up and we're asking for that help and I would also like to extend a personal invitation to Gretchen Taylor and Cindy Pierce of Magnolia who many times has blessed our Chambers with their comments to say I'd like to be with them. I'm in with Sharon and we will go to one of your tiny home Villages so that they can see and meet the people and know what you do. So I'm excited about that is for the presentation very briefly. Have a quick question. What Partnerships I mean there as I was looking at some of the specific services that are provided their challenges for people to find permanent support permanent housing with regards to Vacation of Records, but I didn't see in the Direct Services that are provided an opportunity for folks who may have experienced a misdemeanor crime or so forth. Is that is there a connection or service provided? I can tell just not reference? Yes. Yes. I have a degree in accounting. And also I brought these legal research. I know how to help with warrants especially their warrants for the arrest outside this date. I have a babysitter to the George and what's yours to modify that judgment from punishment to community hours. Once we gave these are a participant a hoe. Eastwind that window open for employment and housing you have a a participant that has a warrant for his arrest they're going to lie at the VA spit up I have to go to sample at Baileyton spring. I found a place three president increased County Section 8 voucher because open indefinitely when I told them the three of them told me that the email that they provide at the VA Hospital the phone number and the day of birth was true. Now we are relying on the information in the score that I can say 60% is acting accurate because they're lying. I'm done made a word missing those people think housing harder the caci win that week to the meeting Lehigh wasn't there and we have participants. The score is over sixteen Point how they're doing it. I don't know but we are not getting a good information for the VSP. The hmis even though it was enacted by Congress through Hooda Math Social Security. The hmis is allowing these people. To not disclose their social security to come out with a phony name or day of birth. And then the city is asking us to pray this people in housing in 30 days 60 days when I cannot send an application to a land or with no name at the social security number 0 0 0 0 affordable housing we going to talk to them about affordable housing because they don't have a job. The rapid re-housing program work. They only Avenue. Isabella before we be printed base or Section 8 but it is obvious that information is no accurate is making our heart. I will work harder to do I can know that we've been able to place over close to five hundred people in permanent house and you have no idea how hard he has been we have people with no IDs, no social security card. I had asked people where you from from the East they have no idea. I need to get a birth certificate is a game where you from from the East What is that mean? What you going to do with that? And then there you seen in space. And then you are say hello. How you been here 2 years, but they're not cooperating. I when I compare the information that they provide at the VA speed that is not accurate. We have female saying that they're coming from domestic violence. That is not true. But they hurt you said that you are using this this day. Are you are this day they going to place you first and housing. This is like a weird swimming against the stream work with people who have warrants. Absolutely. Yes. Okay. We have 14 in Lynn to Sprint with warrants when I went there to her house and then come in. It's warrant out there without getting the support. It just continues at vicious cycle of jail back on the streets jail back on the street. So thank you for that, please thank you so much for coming know how appreciative we are for all your work and we've got another two panels on the next one includes Melinda giovengo, but I don't see your maybe. She's outside and Sharon if you'll stay at the table on Daniel Malone, I don't see him either. So Melinda and Daniel if you are here, please come up to the table and if not sharing you may be here by yourself, which might make it a very short presentation. Do it as quickly as you want. But once again, I'm calling for Melinda and Daniel Tango and Daniel. Sherrin. Do you have a presentation that I have a very short vacation. Did you want anybody else? Okay downtown emergency services. 2nd Ed. Did you have have you heard from Melinda or down there on what happened is Daniel is ill and Melinda had a emergency and Mary Marty Hartmann said she had to leave at 11:30 so I can be very short in terms of my cheese to add. we could we could honestly postpones given that many of the presenters needed to leave. Find Sheraton just if you'll kick off. We'll just go that way. Oh, okay. Alright, if you have anything else you'd like to add. Yes. Thank you. Thanks so much for your willingness to listen about tiny houses and everyone is able to come and visit. So absolutely thank you. Thank you, and I just want to underscore again. I know how difficult this but you have provided a real service to our community and I'm grateful to you. Thank you so much and I want to follow up on it to see if we can do something for the downtown core. Okay. So anyway in terms of the big picture, I think that Regional consolidation needs to address and focus on The unsheltered homeless population. There's 5288 unsheltered homeless people from the point in time count and that's throughout in County. And we have to focus on successful housing placements outcomes. I think that's important. And again just to repeat there's no reason why a hundred ninety-one people living on the streets died from just by homelessness. We have more people dying from homelessness, then the homicide rate. So I think sometimes and I've seen this with sorry to say government bureaucracy that data sometimes get it gets in the way of Common Sense. There are some very common sense Solutions around solving homelessness and I think sometimes we think that data and process is more important than results and I can give you some examples. We just opened up June Leonard Place in downtown Renton because we believe in making sure there's housing in King County outside of Seattle and we have on 48 units majority of units are for homeless veterans and homeless families with children. There are very few in the system. There are very few units for homeless families with children and all of our units were going through coordinated entry. Okay. So coordinated entry right now is managed by Kane County. My case manager is in my staff said that they had the most awful time the most awful time getting homeless fabuwood think will be easy to get home as families in the housing. They said they would never ever do it again this week. We least up 100% of the building. We had to lease up because of our tax credit deadline. I asked them of the 24 units set aside for homeless families. did you have a smooth process getting the referral through coordinated entry so that we could have the families they told me that 18 to 20 of the families were problematic in terms of It was not smooth sailing moving down from you know, a referral from corn entry and moving them into our housing. And I said why why did that happen and they said it's because you have people on the coordinated entry waiting list and they refer to us and they're not housing ready. So they're referring people who don't have ID to don't have birth certificates who don't have social security numbers and that means if we're madly trying to lease a building we have to say, well, you know, how can how can someone in Vienna in a shelter and or someone being a enhance shelter for like a year of homeless families been someplace with a spino for a year and they're not housing ready? So then my staff has to then spend days and days and days trying to find a family trying to get their ID trying to put the air to stuff and then the family may not show up. Or the family Mayo the Housing Authority money, which means that if they don't agree to make a payment plan, then they can't move in. Right so there are people where coordinated entry refer someone and I've got that unit sitting there more than 30 days bacon. Can you imagine the frustration of having vacant units when there are homeless families on the street? So my concern is that there are problems like this with the bureaucracy with corn and tree that should be fixed and can be fixed. But often times they're not fixed in the interest of the provider or the client, right and just in the sake of moving us forward. I think Sharon that you are talking to a counselor for her bold and me who have spent a lot of time in this we understand some of the problems what I'm interested in from you is what would you see the solutions being? Okay, so I'm concerned with a governance structure that even create another bureaucracy. That is not accountable where we can't get quick Solutions like this. We should be able to get a quick solution to problems like this. But why is this continuing we work with corn and refried, you know years and years and this continues to be a problem of having vacancies. We have low-income affordable housing permanent Supportive Housing and we have vacancies because homeless people are not in the units because of the throughput not happening so my concern is that if I'm right now if there's a city program I can go to the head of the UN Human Service department or the mayor and I can complain right and I can try and get it fixed. I'm concerned that the governance structure deck if that's going to get set up will remove it yet beyond beyond the King County Executive. So you end up with a third-party board, right? That is not necessary, comprised of Officials and that we'll have even another layer of bureaucracy. I'm think that change doesn't need to happen. But I think the consolidation needs to make it so that customers the homeless people themselves and the providers are truly listen to so that we have Solutions and we have transparency and that is my concern and the other the other piece that I'm concerned about is I think the system should maximize the dollars the resources going out to the community to actually solve the problems as opposed to more data analyst more strategic advisors more in house. You know, I come you know administrators. We have a system where if you're going to consolidate duplication of services, we should be saving money so that the money saved can go for more services and I'll give Thanks one maybe three. You don't want another layer of bureaucracy. That is just costing us more money in time to you want whatever the entity becomes to be nimble to be able to be customer focus so we can get people in the housing as fast as possible. And the third is that you want to maximize efficiency so that the system is working as well frankly as a system and not with a silent approaches that we've seen. How do we get there? I'm concerned that if you quick if you if all you do is pay call home, which is its own little girl Rocker C. And then you take all the county people and all the city people and combine them or even add more money for this, you know this new structure then it's it's a problem. It should be it should be Fine-tuned and it should and you should get rid of some parts of it that are not needed. So I think a lot of people doing Administration strategic advising Consultants multiple layers of consultants and multiple layers of administration. So I think and you would just ask them just well, I think that I think before the council adopts a like a new thing you should have a They should give you options on structure and pricing options on the org chart options on how much it's going to cost, you know, a low-cost one and it'll cost 1 a high-cost one to see what you're getting. And I think we should use this opportunity to get rid of some of the inefficiencies and some of the wasteful process as an example. Where at Lehigh his ass along with all the other agencies to come meet once a week. We show up once a week my case manager show up once a week with everybody else. Right and there's like four units open like we're all like talking about who should get into these 4 units right? Like is that particular efficient when it's already been predetermined who was going to get into the four units. I mean, I'm just saying that there's process Improvement that could be made that would really help and coordinated entry should not be the Be-all-and-end-all because very few units are available for Corner entry for families or young adults or you know, single adults like to ask have you been involved there's anybody reached out to you at this point about the conversations that are ongoing around a potentially Regional governance restructure. Well, we've been invited to a few of meetings and it's very general and what happens is that I think providers are not given adequate weight in terms of the design of it. If you look at the charts that they they put out they've not name the providers. There's only two two providers and it'll 20 other people. It's not it's not focused on the people who know the real work. So we're also concerned that if you include all these Suburban cities, let's say you include all the Suburban cities. Some of the Suburban cities have been reluctant and opposed to homeless housing and shelters. And why would you put them on and then there's also a private foundations private foundations are not elected individuals, you know, we have no way of, you know, impacting them. I'm just concerned that once you remove accountability away from the city away from the county. We have less of an impact because they're just so you know, Further afield and they're not accountable to us. So I'm just at this point since it's 11:48 and wondering if we could hear from you. Give us an update sharing would you stay cuz what I would like to do is have Jeff and whoever else wants to participate in this to give us an update on where we are because everything Sharon has said I have heard from Tess Colby herself who is coming and joining us now that we want to have this coordinated system approach that is accountable that is Nimble and effective and nobody wants us to be another layer of bureaucracy and I've been involved in these meetings. Oh good. We have Mark come on up. Why don't you come to the table? Opal? He's so markdowns is here and he is one of these I know that we have heard about duplicate Consultants, but I would say that he is a reefer. Breath of fresh air that's come in and looked at our system. So if I could turn this over Jeff test and Mark to hear from you and then thank you both for waiting for this morning and then we'll hear from you where we're going and then I'd love to have Sharon's input and response as well. As for the record Jeff send them on Central staff and actually going to defer time to test. She was actually prepared to kind of give that update that you asked for and I'm happy to chime in if you have any additional questions if that's okay. You're good by me. Hi. Hi Tocabe mayor's office. I need to slide this closer to you. So yeah, I'm happy to give an update on Regional governance. I had quite a few pieces of information that I want to do. I want to be respectful of everybody's time. And so I'm just going to whip through actually, I would say this timing is now up to you. We have so blown the time for this company that I am willing to stay here. As long as you're willing to sell some of this going to know because as a member of the client group you've been in this process the whole time so I will say that obviously the client group has been formed and I feel as though we've been working hard to meet the intent of creating the client group, which really is to make sure that there's collaborative working relay. Kinship in And Timely reporting of information as the joint government recommendation is eventually is being considered in eventually implemented and I want to just say thank you for the clients group members who are of course council member Bagshaw scada and O'Brien for commitment. We've been meeting every month and you've allowed us and the US is Council staff other staff that are interested in this the mayor's office. And of course and I asked to bring you quite a bit of information. So I heard Sharon talk about making sure that the work that we are doing is customer-centered. I'm really relieved to hear that we couldn't agree more that was one of the key and fundamental recommendations that we read read that we received from future Labs, which is now the national import Innovation services, and I asked And Mark and their team has really really worked very hard and in a concerted manner to make sure that this process this discernment process around Regional governance has in fact placed customers at the center. There has been a great deal of work at putting together work groups and the steering committee and that really has been all about making sure that it facilitates customers and persons representing marginalized communities to be at the center of that be not tokenized by just being spoken to but making sure that their voice is Center in that work. So one of the things that and is has done is engage folks in workshops and council member back. So you member may remember that and I asked it a workshop with the client group around governance in the composition and purpose of governance. Those kinds of workshops are being care. Get out again. Not just in in the the core working groups in the steering committee's but and is is going to where people are and making sure that this isn't about asking folks and customers to come to a meeting that is disconnected from the work that they're doing but really moving to their space so Village of Hope For example, the Olympics. Coalition the undoing institutional racism Kalitta Coalition. Those are just three examples of the deep connection that NIS is making with our customers and again folks who are representing historically marginalized communities. So Mark shared with me this morning that the workshop so far have been just been participation of about 160 people so far and again from the perspective of making sure that the provider voice is heard. The kinds of providers that have been contributing and participating in this work include the YMCA Nexus friends of Youth Mockingbird youthcare New Horizons. One of the things that we did to make sure that the working groups were representative across stakeholders was invite providers because part of this is not trying to determine how how are stakeholders how providers how folks would lived experience not Dupree determining how they wanted to participate but opening this up and making sure that there's agency and respected Agency for people to decide how they engage in this work. So one of the things that we all did was ask providers how they wanted to include themselves how they wanted to how they wanted to engage and how they wanted their voices heard. So there was a survey that went out or pull I guess not a poll survey. To all the providers and said you tell us you tell us where you would like to be and what type of work and what groups you would want to own a toe participate in and I will say that frankly. Unfortunately, the response was relatively limited there was engagement of those folks that said they were interested and and that that has resulted in providers actually participating the feedback from customers and providers and and Mark can talk a little bit more about this. Their feedback has really caused and is to sort of rethink how doing color I'm engaging folks through work groups were originally it was thought that people would contribute to a product if you will at the end of these groups and now it's more cultivation of voice and and more of an old-style old school style like sort of community engagement and almost certified Community organizing. Do you feel that? I mean one thing that came out of the group and discussion I've had with you is that you did not want to choose the providers that we're going to be at the table. But rather to allow the providers for self-select and be engaged. So I heard earlier from sharing. It sounded like you were saying that the providers hadn't been involved. That's not been my experience and it's not what I'm hearing from Tess and Mark too many of these meetings where Jason Johnson and Emil floor held and it was very general and there was no detail and there was no specifics and they passed out something saying would you like to be part of this committee or that committee? And and that was it and it was I think there's a whole lot more coming. So test you want to stay there is a series of monthly meetings that the county and the city co-facilitate and they've been going on for quite a while as I understand and I think they predate me. Create me they predict Jason. Thank you for saying that. These are the monthly provider meetings in a lot of communities my old Community. We did this as well where it's an opportunity for providers and their funders to come together and have dialogue and then walk through particular subject. There were a couple provider meetings that were specifically designed to update folks and engage the providers that were there in discussions about Regional governance, and there was a sort of solicitation at that meeting but there was also a solution solicitation that went out by email and it went out broadly to all of the contacts that Anaya says that Jason that Tuesday hsd has a dchs has so No Outreach is perfect. And I think that what and I asked HST dchs have attempted to do is reach people with in different ways so that they have an opportunity really to self select. I will say that the big piece of feedback that we've gotten from providers has been to the tune of do you work groups are interesting and some of it we care about what what they really care about is the regional action plan and so that work because the regional action plan will be the plan that most impacts how they do their work going forward. And so we've we've gotten quite a bit of interest in participating in the engagement and Outreach that the corporation that they're not the corporation for Supportive Housing anymore CSH and Olivia and annelida and CSH are going to be doing in advance of developing that Regional action plan. We also will see more targeted participation from providers in in that area where they are again, most specifically interested but this is not to say that providers are not participating in the steering committee and other work groups. It's just I think in it but to me, it's logical that makes sense that where you want your input to be is where the work will most impact you so I think you can add whatever you got Mark. Did you have something I'd like you to address what Sharon was saying is like the early meetings were General. Yes, they were I was there and now we're starting to dive into detail. So maybe you could address that sure. So a couple things that I think are important one to test this point. Our team has pivoted are proton and somebody's going back to an approach that we use in the fall which is to test this point really just Community organizing where we work with Folks at all levels and terms. Administrators providers customers right to understand what people's concerns are what they like to see synthesize that information and bring it to y'all that shift and tactic was in part in large part in response to as Testament enemies when I make sure this is quite clear and respond to feedback that we got from providers and customers about the structure that had been stood up right. So we heard repeatedly from providers and customers across the region right like hey, this isn't working for us. It is not a way that we can participate we are not able to show up in these meetings in the in the way that you know, perhaps agency staff are excetera and sew in a hearing that feedback. We did an iteration right and at the last meeting earlier this month. Jason. And Leo held a number of folks were there. I don't believe you were but we had a conversation where I was I was there to say. Hey, we've heard some feedback. We are shifting this approach tell us what you would like so that we can incorporate y'all into this process moving forward in a way that makes sense and Marty Melinda. We ride number to put you in the room and talked about the need for us to come to them right into that is really part of the Genesis of why we have begun this year. He's a provider based workshops. I'm headed to you care later this afternoon to do another one and I think that the the purpose, you know, how how we can work in the flexibility that we can bring to this is in that space, which is I think something that you know, frankly a lot of Two tacos Prince around just like time in capacity as I've often heard, right it allows for us to connect with people here input synthesizer and make sure that it is getting to decision-makers in the right format without frankly overburdening staff for creating Dynamics where people are not able to execute on the life-saving work. They're already doing And I will say that from from the mayor's office perspective and I think also from a client groups perspective. These workshops are yielding data. If you will much of it qualitative around what the community wants to see in governance in the regional Authority in how it's structured and how it does and how it makes decisions in what the outcomes of that will be without that voice without that data. We all would be making decisions basically in a vacuum and sew the it is it is absolutely critical that that we not only supports this process, but then bring it into our Collective decision-making process. What's your timing on all of this now, but you timing for the whole Regional Authority? Yes the best the best intentions the best work. We're doing. Where do you We're going to be so that's a really good point. Let me just I will answer that as I if you will allow me to sort of walk through all the work that has to be done. And then you will appreciate just how break next fast. This is going so that the client group we've begun to talk about what that Authority will look like and we've had plenty of conversations about different kinds of legal structures. I feel like we've all landed on the public Development Authority that's good because we've the next thing that we need to do is both at the same time begin to draft documents around that but also engage our HR Partners HR labor and band Union partners and they can't begin to do their work around what migration of Staff looks like into the authority and how that affects benefits and pensions in the things that we care the most about for our staff without knowing what the entity is. Likewise we are in the process of starting the conversation with CBO to talk about not the budget process through the council but to specifically talk about once the budget is passed what it looks like the contract with this new Authority and what the migration of funds looks like as you can imagine migration of funds and migration of staff are are intertwined. And so that's going to be a complex conversation to have so we need to be moving on that now so that we can get to council with a an ordinance the goal is to get the council with an ordinance in August and we are going to work as hard as we can to get there the other piece of this the other layer of all this work as I've alluded to as the regional action plan. The regional action plan is connected to the work of regional the regional Authority by really serving as a guide if you will not not not the Bible not you know, not blueprint but a guide for thinking about how we get to the goals that I think the entire Community wants to see from The Authority. So this is also a process of again collectively determining what those performance objectives the large the big level performance objectives should be and then thinking out how how the authority can get there. So that Regional action plan should also be completed around August or September. So we are we recognize that that Regional action plan and the the acceptance and passage of an ordinance around the authority itself are intertwined. So the goal is to to keep them on up. Keep us all on a parallel track The Surge factor in all of this of courses are Partners at the county and we've we've been engaging and collaborating with the county and they are moving on a similar track to begin to structure the authority and to move forward with their process with their HR their budget so that we all collectively get to this end ideally in August in a worse in a in a not a worst-case but in is a second option September, but we are absolutely focused on August Jeff. Did you have something you want in this is because you're very engaging this already. This is what you've already been told but perhaps for public at this point the stage where that is as we move towards that August ordinance. We would ideally be updating the select committee on homelessness on various types of that process today in particular. We wanted to double bit more into The actual legal mechanism that would be used as we've engaged with various Water Apartments. We were looking at either using a public Development Authority or using joint powers are in a local agreements to make a non-profit generally are at a very high level. There's not a substantial difference in either of those routes and Sarah to address. What is many of the decisions that are next to the thing that the committee will be presented on at its next meetings. The executive is going to be moving forward with the Assumption of a public Development Authority being the mechanism that we would use that's been in kind of an assumption about some parties all along. We haven't found a substantial reason not to go at that at this stage though. None of this is officially final until the council passes an ordinance either in August or September scant difference between the entities that can be created under the interlocal cooperation act or the RCW that talks about pdas. I will say that One of the I think it's important differences that exist. Is that a PDA actually can issue debt. And one of the things that I think has concerned everybody throughout this whole process is we can build a regional Authority. But if we do not have the resources to act on that on that Regional Authority it will make it much more difficult for them to hit their goals. I am not I'm not trying to project that the regional Authority would issue debt for its own Capital uses but a PDA much like a municipal Corporation can issue. On behalf of other projects. So it's a flexibility. I'm not saying that they will certainly have to shoot the the PDA wouldn't necessarily the authority would necessarily use that option but it is an important flexibility that that a PDA has and it is I think Akins part of the consideration, so I really appreciate all of you were just say And I want to acknowledge a couple of things first is US policy wonks really care about what that format looks like and what the foundation will be what the public wants is frankly a little bit more about what Sharon was saying, which is are we seeing more people getting off the streets and into homes of some kind whatever they are, whether they're tiny homes or whether their modulars were there permanent Supportive Housing and second. They want to see for ourselves that the city feels cleaner that people are healthier than the streets feel safer and last that that nimbleness that she mentioned that we want to be able to find and I'm using my friend Michael who's on the sidewalk in uptown and has been there for years using him as an example. He is said I don't want to go in then somebody connected with him a few weeks ago and he said, okay well and then he didn't so he's back on the street with all this stuff and his tarps in his shopping bags right on for The Avenue and you know, that's not okay with anybody except maybe Michael who doesn't want to go inside. So we're trying hard to find out what does he need? And that's what I'm hoping. This Regional approach will allow us is that we don't have to call the county or in the case of of Michael just using this as an example. I ended up I couldn't reach anybody in the NAB team because it was like 5 in the afternoon, but I got a hold of Union Gospel Mission. They had people out there in 20 minutes that were talking with him. So I want to acknowledge that the providers need to be part of this and they will be part of it. But as we set up the governing structure and again, I want to say that's important for the four of you at the table and me and the others who were the ones that care about with the structure, but with a public want is a real difference in what they see. It's a perfect example of why in Like we do need Regional governance. One of the one of the things that has been identified by the auditor. And by other Consultants is that there's a disconnect in the way the city the county other Suburban cities are responding. There's even disconnects within the county and the city in terms of how programs are connected with each other and collaborating and so the goal of regional governance. And the reason that we received recommendations not just from future Labs, but from the auditor from Focus strategies from bar Poppy and consistently across the board that we need to combine and coordinate and better collaborate through some sort of a single entity. The reason is exactly what you described their there should be better coordination across the region and making sure that Outreach is available and appropriate. And knowledgeable about what's happening in communities and what's happening with individuals. And that's something that this was a wee at the city want we know that the county wants. We know that our partners that you GM part of life and other faith-based organizations they want and I think Regional governance gives an opportunity to speak with one voice about for this just as an example about for example how Outreach and how engagement case management relationship-building is done in a much more coordinated fashion. Thank you for that shirt and brought up something that I think it's worthy for us to be able to express and address where she said we're worried about transparency and accountability based upon what I've been talking about with at least three of you there at the table. My sense is that this not only will be accountable. It will be more accountable because there's only one entity to go to as contrasted to okay figure out who an HST or the nav team will respond to Sing like this or call my friend Leo over at the county or get Prime Brad find good now in public health, but have a place and a core where people can go and where they can call so I know that that's one of your goals to respond to this concern is that if that one entity is no point identity if it's not an elected entities, and that's then for members of the community. Then that is one degree removed from the accountability of The Ballot Box. How does how will we be accountable to the voters? Yes. This is a conversation that I think we've all had we certainly having the city. The county is absolutely having the accountability will will come from the relationship and frankly the funding relationship that the city and the county have with this entity. My background is in Finance and real estate development and I will tell you there was no greater accountability in the work that I did then knowing that somebody held the purse-strings over what I was about to do and they had requirements and I needed to meet those requirements. It will be no death of different with this Authority The Authority will be subject to specific performance outcomes through a contract that the city will have and the county will have with the entity itself and that will give us the effort that will give us the right and the obligation to say we're investing in you and we expected this kind of a return on our investment and if you do not produce and you don't give us this kind of return and if that goes on for whatever. Of time the city is a whole deems acceptable to give opportunity to correct then we will be able to pull our dollars back and re-establish HSI in the human services department and go back to the way we were doing it. It's a way of proving the concept and this This really is about proof-of-concept. I would say that this Authority will understand its position particularly in the specifically in particularly in the first few years, but throughout its existence that it is over and over year after year proving its value proving its ability to deliver proving its Effectiveness by making sure that it is driven by the funding request funding a requirement and driven by its requirement to make sure that customers are are included in and at the center of the work that they are producing and I think that combination of work really will guarantee transparency because certainly our provider Community is not try our our our customer Community if you will those organizations that are composed of and Send again folks that have historically been marginalized from this purse process are not there not a shrinking flowers. So we will have any number of Partners who will be helping us to hold this this Authority accountable in a way that I think greatly expands its ability to impact homelessness and and to be more accountable to the public as a whole to one thing that impressed me at a meeting about two weeks ago is that we had conference calls with leadership in Los Angeles and Portland asking them about their similar projects that they have. Can you talk a little bit about how accountability worked in those two cities? I mean, either you test remark, however, you want it because Mark has had more direct experience working with Portland and with LA. Models, I use a governing board over a joint entity in the case of Portland. It's a 9 organization board that I believe is actually 12 members that represent three jurisdictions two cities in a County elected Czar directly on that board in addition to other key constituencies in La at the 10-member commission five members are appointed from the county. They have a supervisor system. So any County Supervisor come forward on someone who they believe should be on the commission that person didn't need to be approved by the entire Board of Supervisors on the city of La side, right the mayor will put forward a person and that person needs to be approved by the city council in the same way that any appointment generally works. So in addition to the budget controls the test is talking about I'm there is no governance model, Frankie. I would recommend or that on anybody uses the doesn't still flow through people who are elected to represent communities. That's just how we do. The other thing though that I think is important particular about the LA model is that there is a ability to put people on the commission who have very specific expertise and sew in a relationship frankly to my test was just saying, I'm just a woman on the LA commission name Jacqueline Wagner who is a VP at Enterprise housing. So if there's a house in conversation partner BP vice-president anytime is a housing conversation is you know, you leave those of us who are wonkish, right? I think sometimes can be frustrated and housing conversations because they're not fact-based people just stay like we need more housing. We should put more money in housing and Yes, but housing was incredibly complex system the rates of development are quite slow. You have zoning issues. You have Finance issues. You have like debt issues like it's not just do more housing, right Jaclyn being on that commission means that when there's a house in conversation there someone in the room, right who can say like, this is what your this is what you're saying. This is what I'm hearing and here are the actual things we can do in order to address the concern you're raising. It also means that theoretically right like she might be able to do something about it. And and so the connectivity to other systems is actually in Hand by thinking carefully through what are the skills and what are the representations that you want to have on that governing body? And the last thing that I would say is that when we talked about accountability that often is a diffuse term that I believe is Frankie far to General accountability is to whom to which Community are we accountable and in this instance? What I would put forward and what are design puts forward is it this is a system that needs to be accountable to people experiencing homelessness. That's the accountability that needs to be created when we talked about what people experiencing homelessness currently are able to access with regard to accountability. It is frankly insufficient in an adequate right people can swarm council chambers. They can try to form individual relationship, but there is no mechanism by which day can hold who is supposed to be responsible for providing them with life-saving service right accountable if that is not working in our design. We put forward the number of thing the theory of change in sintra customer Voice Within structurally. We also put forward an ombuds office right that would have the sole responsibility of hearing from and routinely going out and listening to people are experiencing homelessness and using that to set standards to evaluate right how things are going and Frankly relieved also known to report a little bit of relief that in all of the government's workshops that we've done thus far. One of the things that has arisen as near uniform is being assistant that that board needs to have people who have experienced homelessness on it in some workshops will aside like we want, you know, 50% lived experience, right? And there have also been assertion that I think I make good sense to have the ombud's person on the board, right so that they are not experiencing a power dynamic in terms of trying to assert right like this is what I'm hearing and we need to respond to it. So there's there is real Community work happening that will I hope right end in a design a final design that Center the people who we really say we're here for and puts them in charge of their own destiny in a meaningful way and not merely in rhetoric. Thank you. Thank you. Somebody needs to just record what you just said type it up and put it up to say this is what we're working on cuz I keep hearing these spats between people sent over so worried about accountability. We're so worried that elected are going to be on it. Frankly. I think having the experts on a board like this that are reporting to the council that we establish a budget and the policies and say this is what we're looking for that nimbleness. I were talking about accountable to the people who need the help but also accountable to the taxpayers showing their having better effects that was making people crazy is that we're putting more money into a system and people are still seeing folks outside that dual connection. It's what I know you're all working on and I think this will be great to make sure that as we're moving forward that these multiple goals are loud and clear and front and center. Thank you. I told me that we've got to get out of here at 5:30 because there's a transportation committee. But do you have something you would like any any final remarks in the next few minutes? Actually know there's a lot more work. Thank you for being here. Thank you. I know we were delayed an hour because of the importance of the previous agenda items Ted. Thank you for making that happen. I know that we went long just because there's always so much to talk about at these committees Jeff. Do you have any final words? Okay. Well, thank you all for coming. I know I'll be seeing you in the next week or so and thanks to all everybody who came to participate in this today in the meeting is adjourned. Thank you.", "end_time": 10322.9}]}