{"format": "raw", "annotations": [], "confidence": 0.9374919905088335, "data": [{"start_time": 0, "text": "Afternoon, this is a meeting of the Civic development public assets and Native communities committee. The date is March 6th. It's 2 p.m. I'm council member Ward is a chair and I am joined by my two colleagues and council members councilmember Sally Bagshaw and council members of Ronald Gonzalez. Thank you for being here. Let's move right to the sheriff's report. Today is gonna be very interesting today. We have five appointments the first being the reappointment of mr. Robert nellams for the director Seattle Center followed by four appointments to the Seattle Center advisory commission. And before we begin our 4 appointment appointees all here. And it's all your own the road. Okay, great. So I will start will start with not right now, but I will first invite directive nellams to the to the table. But before we do that when we just read what I'm going to do and then we'll get wild do it and also we want to recognize dip. David Mosley who introduced mr. Nellams for his appointment. Thank you. Mr. Mostly for being here upon completion. I will then invite the four candidates to join us at the table and director nellams will present these individuals will also receive to informational presentations the office of the Waterfront regarding their 2019 work plan. And of course one from Parks regarding an update and Next Step next steps on the recreational programming in addition. We have two ordinances up for discussion and vote. One is the 2008 Levy inflation contingency use for 2018, which basically just says we have a couple million left over that we want to allocate somewhere else, but it's good. It's for developments will be okay. And then we also have the Occidental Park Timber Pavilion donation where I understand that the is it the cell part or not, Seattle Michelle Parks Foundation Yeah, and I'll answer Pioneer Square will be giving the Seattle Parks Department a temper Pavilion so that we will move into public comment. It appears that we have two people sign up for public comment. Your name is called please speak to the items on the agenda today. As I said, we have nine matters on the agenda and please limit your comments to two minutes and begin. You want to go and call our first names. We now have four people signed up the first we have Alec Zimmerman. Thank you very much. Oh my God phone not working microphone not working. No, it's working this working where I don't hear this. Microphone headphone this working. Hi. I want to speak about agenda number one about the point this nice man, and I like him work like a Seattle Center for 20 years ago. And it's exactly what is happening right now in Saavn couple days ago to change this a Rollie not come to this place hundred times in talk about this when you kuine in every direction because every director don't make a changed only Q&A when people come in control and can change the situation is exactly right now right now, so you need right now or America from east coast to West Coast. Nice to see you at the least. Number one fashion Siege in America this very interesting situation. That's exactly what is 1200 times a number to recover right now, So what is in court what is violate Constitution is exactly what this example so they stop your crap. So then you changed it to yishun call Van's it's not matter whose will be a director like Oracle business is doing so please accept this because it's supposed to be Alright next we have Lisa Howard. Hi, my name is Lisa Howard and the executive director of The Alliance for Pioneer Square. Thank you for letting us make public, today from being in our Park Occidental is the heart of our neighborhood. The alliance has worked a really long time to do improvements over time to Occidental to make it a safer and more accessible place for all. I wanted the keys to these one of the keys to this Improvement is our Partnerships. We worked for a number of years now a Seattle Parks Foundation DSA and the city of Seattle and even friends of the Waterfront to make improvements in the neighborhood. And this is a really exciting time as we come here today, except the Pavilion. It's a really exciting asset to add to Occidental and it's going to support future programming. So we thank you for your consideration and your role in this making this possible. Thank you. Thank you. Yes, go ahead. They said thank you very much for all the work that you've done a leading the alliance. I think this is a really good for step. And I know that we have work for years not only to bring this but potentially at some point I'm getting a Portland loo or something else in that neck of the woods. I realize there still conflict about that. But if you want to talk about it in the next few weeks, I'd love to get an update on that. I think you part of the problem or part of the solution. Thank you next Jennifer Casias. Good afternoon. My name is Jennifer Casillas. I'm with the downtown Seattle Association. I oversee the operations and the management under the management agreement we have with the city to program and activate Occidental and Wesley Parks. We're very appreciative of those at the city that MPD board and of course Seattle Parks and Rec to support this Urban Parks partnership program over the past three-plus years. We've been able to make significant improvements to downtown parks in terms of Staffing and programming activations events safety and we're thrilled with the addition of a new Pavilion that will anchor Occidental Square offering a welcoming Beacon for visitors and park regulars awake. Also, it will be much safer clean and inviting space for our staffing our parking bastards who are there on a daily basis again just immense thanks to you for considering this project the support of the council the MPD board and the city for supporting this and all the other work in the park. And then lost we have Ryan Sparks. My name is Ryan Sparks. I work for the downtown Seattle Association as well in Occidental Square as well as Westlake Park. I just wanted to kind of underscore some of the things mentioned in regards to the new Pavilion and I think I speak for our whole team when I say that it would be a huge asset for us moving forward currently the space that we work out of the crank. Kiosk is small dark and in disrepair and this new Pavilion. I'm in addition again to being safer just for us to work out of it will be much more welcoming to the public and I find that. Just overall is it sense? What's in the park already as well as the neighborhood design I think is really well-thought-out and then it will be more welcoming to the pub in addition. It provides additional space for the activations that we put on in the park space. I think it will enhance their success just over all I want to say. Thank you for considering this project. We really appreciate it. appointment 01260 reappointment of Robert nellams as a director Seattle Center for a term to January first 2023 Mr. Nellams and Mr. Mosley are here. I'll let you introduce yourselves and we'll let you speak and then we'll take a vote and we'll see where we go. I don't know it's going to be close to know that I'm trying back so. Thank you. Thank you searching for. Dozier sir, thank you very much council member and Marla's and members of the committee. I'm David. Mostly I'm deputy mayor in Seattle and I am as you know that the council has a process of confirming or not books that have served other term. Robert nellams term is Seattle Center Director expires in March 22nd is extremely pleased to reappoint Robert to continue serving in this role this decision by the mayor was really a no-brainer. Robert is synonymous really with Seattle Center. He has been the director since 2006 spent more than 20 years Seattle Center in total and he's provided great leadership in a number of areas at Seattle Center in Tim's the relationship with the residents Seattle Center in terms of communication with the public about Seattle Center. And of course the renegotiation of the rain Meaning of NHL team to Key Arena there. I was at Seattle Center. What day was the retreat Robert of Thursday Thursday and spent a good part of the morning there with advisory committee members and the Seattle Foundation members and folks were talking about, you know, kind of the strengths and weaknesses and what we need to do going forward at Seattle Center and when it came my turn to to comment on that I said, well, I think the first thing we need to do is recognize the treasure that we have at Seattle Center, which is Robert nellams. And and I think this may be the first Standing Ovation. I got since being Deputy Mayor but we have no doubt that the future of Seattle Center is in very good hands with Robert and we ask the council to reconfirm Robert nellams as director Seattle Center. I'll just start with an L that my colleagues speak. First of all, thank you for reapplying for this job and thank you for the mayor's confidence in Mr. Nellams and this appointment obviously we've heard the confirmation pack of a weave. Working with you for years. You've been there for 20 years. I can't think of a better person to be at the helm particular was all the change in front of us. So what that I'm going to turn it over to cancel her bags Yahoo. I knows and our customer Gonzalez leaving comments as well. Thank you. So much has been a real pleasure and I like to think back at the beginning of my first term and Bruce are all was on my committee. And I think he can arrest you every single time. You came to the committee about wanting some kind of a running track around the entire Seattle Center. So now you've brought him a hockey team. I think that that make him happy. So one of the issues that I'm really interested in is how we deal with Memorial Stadium, and I know that we have had two agreements with our school district you been at the at the helm in the center of all of this and now that we had the rain leave with sort of I don't want to say they left and a half but what I heard was they left in no small part because then the Real stadium was in total disrepair according to them. So I'm wondering what do we do with our school district? We want to be partners. We've sent that signal at least 50 times. Each to say we're here to be working with you not against you we want you to get the revenues and more. What do you see we need to do to make that move. Well, as you know, of course softball relationships and Partnerships and the only way that you're going to get to a deal with the school district on on Memorial Stadium or anything else is it is to have the right relationship and not in the right partnership and the right deal in front of them. So what we are we're doing now is we're working staff to sap on trying to come to some terms that we can take to the elected officials the mayor and the council about. Okay. Maybe this is a stage 1 or step 1. This is step to this is step 3. This is how we actually get there and we're optimistic. I'm pleasantly optimistic. I'm spent a lot of my time trying to make this happen. So if you'd have to talk to me and I'll take you months ago. I would have said now we're not doing anything but I actually believe we're actually going to get to something that we can all talk about and actually go tan and weight. That happens is not to try to do things out by saying this is what we have to happen. This is what we need. It's really good to build that relationship is says okay. This is what could enhance where you would like to see and this is what she could address what your needs and what you need and come to an agreement with the school district on how we proceed with that on a timeline that makes sense to them. They always tell us that their primary function is educating kids. And what we're talking about is something that is ancillary to that. And so we have to we have to make sure that the timing that we approached them and the way that we approached him allows them to space and the options to and the opportunity to say. Yes so that we can work on this together. Catherine Gonzalez I was at it was interesting to have to your question counselor. Badshah. It was interesting that the Chief Operating Officer of the school district for a podesta who we all know when a relationship just spent the entire day at the retreat and I think we have an opportunity working with him and others. So I think there's there's there's a reason for Roberts cautious optimism that we may have a new conversation that we're able to have now. And before we do you go to vote and you knew that was going to bring this up. This is what I'm concerned about what this because we're going to go right into the potential appointment for the Seattle Center advisory commission, which as you know is a 16-member board and we currently have nine people serving and if we pass today's for appointments on will be up to 13 and then so that will leave three outstanding sees that we're going to look for a replacement. So I'm really concerned about is that there's only one person from district-1. There's only two people from District to there's only one person from District three. There's only one person from District district for there's no one from District 5. There are 10 people from district 6 and there are no people in district 7, so I'm concerned that nothing wrong with district 6 understand but if you have 10 members and now we're the 13-member board, we haven't gone to 16 I'm concerned about this is and when I go back and I read what the CL advisory commission show like it says she'll represent the interests of the people of Seattle by devising the Seattle Center staff the mayor and the City Council on policy matters that may affect Seattle Center in Seattle Center advisory commission shall also provide the Seattle Center staff the mayor and the city council was ongoing assessment of operations performances plans policies of the Seattle Center department for the sake of District. Location and it is glaring that there are 10 people from D6 on the commission. We have strived in this committee as you know, and certainly through all the processes with revamping on rebuilding Seattle Center that the Seattle Center is is everybody's public property is for all of Seattle weather you live in Northgate. Where do you live at Rainier Beach where they live in Laurelhurst whether you live in Crown Hill and I'm not seeing that representation here and not I don't know who is pitch for district representation just to pitch. I only kind of pick where I think you need District representation particularly in life is it were up to 1.2 billion and revamping sales 1.2 billion and so I'm concerned and I want to raise it for my colleagues protective since there's no way from district 7 and that's their that's in their District that we have. It's it's proportional that we address any kind of disparities because we know and as we move forward there's going to be there's going to be programs and policy and a lot of things going on. I would like a more diversification of voices and also that District parody. So can you respond to that for me? As far as the commission goes that there are there split into three year term is over three cycles of people maybe four cycles of people the way it actually works and so a lot of the structure a lot of people that have been engaged in this were members are happened on the had been on the commission prior to us going into districts until that. That's one thing. I don't fight people are up in 2018. We what we have done is is we've historically have focused on making sure that the commission was reflective from social justice economical and racial makeup gender makeup Etc. We have recently added a filter to look at this. Participation and soul as we go forward we have we don't feel everything. We we actually need some help from people to say. Okay, who would you like to see from District 5 or who would you like to see from district 7 or who would you like? Cuz the people that express interest in being a member of the Seattle Center advisory commission, we don't necessarily start by saying OK which district are you from? The Babe is really about the patent that they bring the expertise that they bring and the way that they can help us think through the larger issues of the city. I live I live in District 5, so you have you have a member there. I agree with you on that subject matter expertise to be in fact, I get that but when you just have 10 people from One District voting blog and making major decisions that that's where I get concerned. That's all. I do please we had never looked at where people live as up as though and how they would serve her. What they would server who they would represent other than the larger City, We're looking at this we are happy. We're having to look at that filter now for Kelly was going to but I had to tell her I had to talk her out of it. So let's go to a vote. I remove the committee passed the appointment of Mr. Robert nellams, which is appointment number 01260. The motion has been moved and seconded all those in favor. Say aye the eyes have it. Congratulations will transmit this a full Council Monday. Thank you. Thank you. Thank you, sir. Thank you. and I got the Aina Haina That's why I said she lives in Queen Anne. So I think she might be in 7. Where are you? She said she was in 7 and his she's Queen Anne. She seven and John schools unless he's moved his seven. Yeah, I think he's saying that's not what I meant. That's their side. We are I'm sorry. What we're going to do is I'm going to give what you read into the record. I thought that with you. Appointment 01240 appointment of Daniel tam-claiborne as member Seattle Center advisory commission for a term to September 28th, 2020 and appointment 01241 appointment of Jana lamon as member Seattle Center advisory commission for a term to September 28th, 2019 appointment 01242 appointment of alayne fardella as member Seattle Center advisory commission for a term to September 28th, 2020 01243 the appointment of Racquel Russell as member Seattle Center advisory commission for a term September 28th, 2020. Okay. Well, thank you. I couldn't be more pleased about the four members potential members of the commission that stand I heard that sit there for you. Are they bringing a great diverse set of skills? And they bring a passion for Seattle Center that is kind of the first hurdle that they have to get over but we have we have people who are committed to the social justice and do this for a living. We have former school elementary school teachers that are now directors of extensive programs at the University of Washington. We have the former president and CEO of the Seattle Times and we have the current vice president of government mental relations and public affairs from the Zillow company. So Zillow group, so I think that this is an outstanding group of appointees are potential appointees for the Seattle Center advisory commission and I will just say that that I couldn't be more pleased with sitting here and then letting you see the kind the kind and caliber of people that would like to be engaging involved in the future of Seattle Center. Okay, so we can have everyone introduce themselves and maybe say a few words and then we'll move forward. Hello. I am Racquel Russell. I currently serve as vice president for government relations and public affairs at Zillow group here in Seattle. I moved to Seattle five years ago. Probably one of the newer seattleites on that would hopefully be serving on the commission. I like to say that old is Robert before that as a recent transplant. I think that my story is quite different than a lot of other transplants. I did not move here for a job. I moved here because I fell in love with Seattle and I wanted to live here and the Seattle Center has always been an extension of my Home Eldon apartment building in my friends from the east coast and family come to visit me often and they come one of the stops that we always take us to the Seattle Center Lawton have young kids they're able to play on the grounds. They're able to visit all of the different attractions that we have at the Seattle Center. So it's constantly for the last five years has consistently been an extension of what I consider my home here in Seattle. So really excited to hopefully serve advisory Commission in helping move into the future. Hello. I'm a gentleman Seattle native. I was born and raised here in Seattle public school teacher in Seattle public schools for 8 years, and now and director of Outreach enrichment programs at the Robinson Center at u-dub. So I'm working to get underserved youth throughout Seattle and Seattle area at large into enrichment programs at u-dub, and I'm in the Robinson Center going to the Seattle Center in my entire life. It was a family tradition to attend the Nutcracker and spend the winter fest there, and I I remember very it out. That was at my earliest memories are of the Seattle Center and the time I spent there's a family in so I'm honored to be considered for this and take part. Thank you. Dan everyone, good afternoon. My name is Daniel tam-claiborne pleasure to be here interview. I work as a consultant to add a small from called Storm Solutions. We forget Focus exclusively on Seattle clients. So working to improve the technology Healthcare a nonprofit sector Eastern Seattle sound very fortunate to be able to support them folks from the 10 different Industries, and I to move to Seattle relatively recently and also somewhat of Racquel also moved down for a job, but because I am really good quality of life before to buy Seattle the time. I've been really grateful to be involved in Civic life. I think it's an incredible way to to learn City and that come to appreciate it all the more in Seattle Center certainly kind of analysis that for me and my experience here, and I've been grateful for the work that I've been able to participate in so far and look forward to the office for the option to do more. Thank you. I'm Elaine fardella and I'm delighted to be here today. I also came to Seattle many years ago not for a job just for the quality of life because it is so beautiful that came for a visit and stayed we I was born and raised in California. So we weren't quite sure when we came within this would be our home or final home and it was not too soon before 9/11 and we lost a family member in 9/11 and as we were walking through the city we ended up at the fountain and all the flowers around the fountain and my husband and I looked at each other and I started to cry and he had a couple of tears coming as well and said, yes, we have found home. It was such an embracing moment. We also live on Queen Anne and I'm just passionate about change and this is a moment of change not only for Seattle Center but for our city, and I'm just done. but to be to be participating and how to ensure that we keep the heart in Seattle Center with all the changes that will be sitting in the next few years and thank you. Thank you. Thank you. I just want to acknowledge. I mean we've got some real high octane people here. Thank you with your JD and your work in the public schools and coming out of Yale and Global Affairs. I believe and all your work at Seattle Times. Thank you for your willingness to do this so I can ask one question which is next year. If we were sitting at this table, we said what have you accomplished that you wanted to accomplish? What would you say? So I'll go first. So I think for me building off of something billion side is that for me? It would be that with all the change happening at the Seattle Center that we are able to keep the the character and the inclusivity of the Seattle Center there as we as we go through that change but also are able to in keeping that characterize. I don't think these are mutually exclusive also be able to take a Seattle Center to the next level and took you know, and in all the ways, you know, we talked about bringing it into the 21st century in bring into the 21st century have those conversations Robert design other of the appointees. And so for me or be having those two parallel tracks both keeping the character and specifically inclusivity as well as making sure that you have the Seattle Center is able to grow into the 21st century alongside some of the newer projects. Thursday at the retreat was it was together and you know being in Seattle public schools, and now my kids are in Seattle Public Schools. I am really excited about the conversation around Memorial Stadium and I am also optimistic and I want I am looking forward to being part of the conversation and part of the, you know, the progress and the success. I thought I think I would say two things. The first is I think you're going to represent an amazing opportunity for the Seattle Center, but I think it's also a potential Potential Threat to feel like I might get overshadowed by it and just making sure that she has no retained its identity and it's kind of full prominence throughout the the change process that we're going through for the next to a couple of years as I can. Sound Transit I think it is an incredible thing to work towards as well as been a couple of references to Thursday's Retreat and what was so amazing to me and impressive was the high octane to use your phrase of the folks in that room between the Seattle Foundation the staff of Seattle Center and the Commissioners and I can't imagine there's very much that that group 27 people can't accomplish and to see at the end of the day. I just for a group of people at the end of the day coming together and say we really want to go forward to keep the heart to ensure that we're providing the public access the open space and the the vibrancy of Seattle Center. Not only when the arena is completed, but from here to there for the neighborhood as well as looking at how we think about this being a sustainable financial model throughout. So at the end of the day that this is preserved as a gem. The city thank you said it was wonderful to see your resumes and the school and you came from GCU workday Obama administration understand you published a book. I mean, you know it and I could go on and on but it's just it's just it's your right. It's a gray group so that no one is doubting that 107 miles of the West Highland Way in Scotland is beautiful if it really was a maid I wanted a physical, you know, my whole career. I'd work for 50 years. My whole career has been mental challenges and so my first year in retirement, I wanted us to Circle challenge. So we did it. We did it with another couple and it was great. Thank you so she can do that. Really good hearing and cancer bad show. Thank you for bringing up the school district Memorial Stadium. We've been dealing with that for a couple years and then we love them and we love them. Everybody needs to come to the table and I really hope that sometime in my lifetime. I'm going to see that work. Okay, we're leaving you by yourself or appointments on Monday. Will you all be attending Monday? Cuz you don't have to but it'd be nice if you wanted to hear you don't have to. I'll be there but I told him they didn't have to. So next item nagini want to read that to the records item number six as to Waterfront 2019 work plan. Go ahead and read into the record. Waterfront 2019 work plan Does that mean? Let's have introductions and look at this one map on page to one more time. Let's do it. Is it a 7-page slide Marshall Foster director of The Office of water fountain soda projects. Finance manager for the office as. Just do a quick reprise of what happened in 2018 in the first part of this year. This has been an enormous few months for the Waterfront Endeavour and I will look at that and then more importantly we're going to talk about what 2019 brings and the start of major construction activity to deliver on the vision for the new Waterfront. This is something we've done every year our work plan assessment will also kind of identify where you're going to see legislation coming back to this committee as well. Here's the map that you know, and love of all the Waterfront elements. What's particularly I guess pointed for us at this point is that we've been talking about this is a plan and a vision for a long time. This is now the picture of a fully-funded and now Moving into construction Capital project. So we are operating out of our Construction office watching the viaduct come down outside our front windows. You're welcome to come down and visit and take it in and we'll be starting construction over the next. Months. I won't go through all these elements. They have not changed in a fundamental way except that with our adoption formation of the l i d in the funding commitments that were made all these elements are part of the capital plan that will move forward 2018 and end the early part of 19 just too quickly recap. We executed and MMR a memorandum of understanding, excuse me with the Seattle Aquarium Society to advance the ocean Pavilion project. That's an integrated element with the Overlook walk and we will obviously continue our work with them into this year and next week completed planning for the main Corridor. When we say Maine quarter, that means the replacement of Alaskan Way the construction of the new Surface Street connection up to belt. Also the public Promenade along the Waterfront and several of the kind of most direct East West Street connections, Columbia. Seneca being seen the key ones want to look ahead. I just go with the aquarium. I want to bring this up one more time that we have committed to 34 million dollars to assist the aquarium. We put that in the budget at least make sure that it was really clear and I'm feeling maybe I've got short term short time or problems, but I don't want to lose sight of that that I believe that we've made that commitment commitment to the aquarium to the folks that are raising money for the aquarium. I just wanted one more time underscore that we've got a commitment from the city of 34 million to the aquarium as part of this project. Yes. Thank you. That's absolutely the case. This year's budget not only Advanced design funding for the Pavilion for our portion of the Pavilion design, but it also is part of the budget that you adopted put in place as significant. Picture of that 34 million commitment in terms of real hard dollar commitments in particular years and we'll be talking about a next step with them project development agreement much like what we did with the Pike Place Market at the market front that will formalize all the final funding that will be discussed over the course of this year. We're still working out the exact timing for it to come to council. So as part of the main quarter plans bids finalized advertised in November bid opening is actually happening this week. So we'll be opening bids on that critical first phase of work right away Acquisitions and permitting majority of those are also in place. We did have some permanent Acquisitions as well as some temporary construction easements that were completed and are necessary for the roadway Construction Key early construction was advancing completed on time and on budget this year. So and this is stuff that frankly happened relatively quietly. So I kind of take a no good no news is good news approach with this cuz our team delivered this smoothly and successfully early Works utility relocations and area way modifications. We pulled utilities off the viaduct structure in preparation for the demolition. It's under way. Now we improve some area ways that were at risk on Columbia Street primarily and we also are nearing completion. Got a good bit more work to do. But all the piles are in place all the structural elements the fundamental chord structure elements are in place for pier 62 and we're nearing completion for the habitat enhancements in Pioneer Square. That's what is otherwise known as it a a habitat beach at the foot of Washington Street next to Colman dock that's nearly complete at this point. So those are some exciting milestones. We said, we formed a partnership agreement with Seattle Parks and Friends of Waterfront Seattle to advance our o&m partnership and thank you again for the huge amount of leadership this committee provided in doing that as well as forming the Waterfront local Improvement District. 2 looking ahead. What are some of the critical elements on our calendar as we look at the year starting main Corridor construction? We anticipate Late July early August that we will be in full scale full swing construction of the bank order one of the key things. This isn't a huge issue, but we just want to be clear about it is that as part of the final schedule with the viaduct demolition contractor. There's a lot of details that were worked out from the original plans. We made with wash. In the agreement we made to the final contract with q and who's doing that work we're essentially starting about three months later than was originally envisioned on the construction work that will have not a significant but we'll have a modest trickle-down impact on our delivery schedule and I will show it you in a moment. I don't it's not significant or cause for major concern but it is we had originally anticipated starting in May on early elements of that and just the reality of their means and Did you get the viaduct down? We're not going to go to start quite as early as we did as we'd anticipated. What will we be hearing from the Waterfront businesses? This is actually from their perspective of benefit in a lot of ways because it means our work which is heavy lot of equipment mobilization closures will be happening after the summer months primarily issue for us is we need those good weather work Windows to deliver. We also are very sensitive to fish window for onion water work and we're also very sensitive to the Port of Seattle cruise ship season, and when they have all their provisioning of the ships tour schedule has a lot of delicate pieces to it in this kind of delayed does trigger does hit some of those windows. So it's it will push off our completion of the whole Waterfront by three to six months as a result. Getting nothing. I don't think to be too concerned about but it's just an FYI the local improvement district. The formation was not the last step. We have a adoption of a final assessment roll, which will be coming for the council late this year for its initial, you know, submittal and consideration We Believe into 2019 and that will be the individual including individual assessment hearing process where we'll talk about if there's any appeal or reconsideration of an individual properties assessment. We also have some design work that's continuing to advance. We're hard at work in the Pioneer Square Community. I saw Lisa here with some of her colleagues earlier on the design of several East-West Street Connections in Pioneer Square main, Washington, or the key ones. Also King and yesler we're looking at and we're also continuing our partnership with the downtown Seattle Association for the design of Pike and pine streets to improve those from 1st Avenue all the way over the freeway to to Capitol Hill completion of the 60% design of the Overlook walk is a really critical element that is starting up literally as we speak. We wanted to get the local improvement district formed for we did that, but we're now advancing that work as well as moving forward on the pilot agreement with friends for the management of Pier 62, and that that will be something will be coming to brief you on later this year. Solaire this year's Discord or third quarter fourth quarter is when we plan to do that still TBD. The project is to be completed by the end of the year. We hope Dench little earlier than that, but we can't promise and will come to you while ahead of that opening with that with the pilot agreement. We already in the process of developing it. So let me talk a little bit about the construction side This Is Us schedule you've seen before as well. It does reflect those adjustments to the schedule with the viaduct demolition. Like I said, it's not a significant change. You're still going to see the Surface Street open in 2021. That's a really important Milestone with the Seattle squeeze traffic, you know constraints opening the new Surface Alaskan Way is a relief valve for all of our downtown streets that will open in 2021 and then you will see the full Waterfront Park completion mid 2023 So just a little bit about I'm not going to go through all the detail of our construction plans. We've done some of that in the past were actually planning to come back in the summer and breach you all in more detail before work commences. But what are some of our core values that we bring to this in terms of how we organize for construction ensuring access for businesses and residents really thinking about all modes of travel on the waterfront in the adjacent Community where a very Hands-On team in our office because we have the benefit of being a dedicated group that thinks about nothing but the Waterfront laser focused on our community on the waterfront. We support the operations of our major agency partners one that doesn't always get talked about but is really important to us as the is BNSF and the railroad Main Line operation. We will be constructing over the BNSF main line, which is a really critical and very careful activity for us as well as the port's cruise ship operations in the Colman dock day today fairy Opera. Sweet literally coordinate on a daily basis major Utility Services have to be maintained much like what you saw with the seawall construction and that's a critical element of of keeping all the continuity of service supporting access to not only parking which gets talked about a lot and is critical but also Transit access to the Waterfront things like extending our very successful Waterfront shuttle system that has been a pilot here over the last few months or rather the last year to continue to serve the Waterfront during construction providing not only the as you know, we've made a number of commitments to low rate parking where we're actually investing in some adjacent a parking lots and structures to buy down those parking rates at the people who are coming to shop. Otherwise use the Waterfront can access parking but wherever we have the opportunity within the construction zone itself, if there's space not being used by the contractor if it's reasonable, we will try to make some of that available for short-term parking. Support the community as well. Your remarks on this particular slide on the first bullet point around internet access for businesses residence in all modes of travel. What modes of travel are you referring to? They're the big ones the heavy users in terms of ridership Transit operations. So we're talking about King County all of their rapidride operation all of their functionality for West Seattle commute traffic to downtown is priority to get Columbia and Alaskan Way open for that which is going to be a significant enhancement over the current kind of temporary condition that people are operating under continuous Surface Street connection to Waze two lanes of traffic in each direction to provide, you know, loading service vehicle access and then the continuous bike connections on the waterfront. There are other considerations that those are the big ones for us. Is about construction and the impacts on on the ability to be able to walk around into pedestrian access. Is that something that you are accommodating as part of your plans absolutely. Does that include a lens of making sure that we are accommodating those who have disabilities or other mobility issues. So I'll give you an example of an absolute lie a critical priority. We worked hard with the state to ensure that the way that not only our work but also demolition is done is to ensure that we don't close the entire extent of the of the Alaskan Way Viaduct. We break it up into segments so that we can keep safe accessible predictable Pathways for all users and all abilities throughout the district were using very much the same priority. So for example, another example that we've done around some of the early construction is the Pike Street Hillclimb in the Union Street connection or too big. Pathways for pedestrians to get used not try not to close both of those at the same time. So lots of kind of on the ground work as well as a lot of wayfinding that we've done through Seawall construction. We learned a lot about laying down what we call the blue carpet which is a blue pathway. We've used to move people comfortably around construction. That's not only for the able-bodied but for everyone else, you know, in terms of all users and all abilities as well as the truth Community who don't know our city as well and need to be able to move around on the waterfront. So we're thinking about all those things a lot of time down there cuz I'm one of these West Seattle water taxi commuters. So I'll make sure to send you pictures if it's not the issue that I wanted to bring up is that you spent a lot of time talking about parking and facilitating parking and subsidizing parking and I just really I'm interested in hearing how we're going to provide it similar benefits to those who are using transit to get into this Corridor two key things in from all of our community work and work with agency partners and others are the Waterfront shuttle service, which has been a that's been in the face of an experiment pilot that we did initially supported by the state. What we're looking at doing is expanding that service. It's a low floor people mover that connects Seattle Center the Waterfront Pioneer Square with our district and the transit access at those locations. So it's kind of a last-mile what we call a last-mile Solutions help connect people to Regional Transit service is something we're looking with the essay at how we can support its continuation during our construction. And then the other key thing I mentioned earlier is we've worked really close to King County Metro on how to accelerate a all the construction associated with getting Transit quarter operating on the waterfront. That's literally first order of business for us with King County Metro is getting that rapidride pathway through Alaskan Way and Columbia. My point is is that we're we're subsidizing people's ability to drive into this area. So we're incentivizing people to drive into the area, but we're not offering the same at least Financial incentives for people to not drive a single occupancy vehicle into this area to things that's a fair point. We the Waterfront shuttle support that is a direct me. Is something we're providing support for those types of Transit operations, the Cracked Main Line Transit financing. We're not we're not doing anything there. The other issue with parking is just bear in mind. This is focused on something. I think we're is It's Not Unusual to do focus on short-term essentially short-term parking associated with getting to the district getting to the market getting to businesses. It's not we're not talking about commuter parking. We're not talking about residential parking. This is the kind of parking we tend to be supportive of it help support business districts. It supports people getting in and out on a short-term basis not commuting downtown which is the what drives a lot of our concerns about mode share the city Sorry. Not trying to argue the point but just I just I just I just I just think that we miss opportunities to incentivize folks to get out of single-occupancy vehicles. If they don't have to be in one they obviously everybody has different abilities and and based on those abilities. You should absolutely use them know that you wanted to do you want us that you need to use in order to move around in the city, but I just get really concerned when we continue to just heavily subsidized people's ability to to drive into these high traffic corridors already and it seems to me as though we are taking this approach also in a moment where we know we are going to be experiencing an incredible burden on our surface streets because of the various construction projects that are happening throughout City and so I just want to challenge us a little bit more to think about how we can incentivize more people to use public transit not just within the last mile but they get in and out a mean it's not only tourists go down to enjoy the Waterfront if people from all over the city to share. Where is this point around why we need to make sure that you know, our boards are representative of folks who are outside of the the main core were capital projects are located. So I just I just think it's a missed opportunity to not think about it more creatively in that hunts. Thank you customer Gonzalez conservation. Thank you. I want to flip that a little bit and give you a good news story colleague of mine lives in West Seattle. Not far away from my colleague to my right and he is unfortunately Afflicted with a disease that puts him in a motorized wheelchair at ease about I don't know his mid-twenties. He called me because he was having difficulty with the water taxi, but there was an area where he couldn't get his chair in his water taxis. They had that fixed within the next day and then it was over on this side of things. One of the shuttles came around the lift wasn't working. And so as we are really focused on all ages and abilities and continual access having the shuttle show up and not have to lift to get him in into that particular shuttle is a what's a bad news for him? The good news was he called me? I was able to get ahold of him the essay and they got me into the right people. They send another shuttle over got him picked up fix that so that the next day he didn't have the same problems. But what I want to acknowledge the fact that because we had twice the number of water taxis people were really responsive to him. They got him where he needs. And if we can continue that kind of focus on all ages and abilities, it's really going to help us. So I tried to say thank you to everybody who went out of their way, but I wanted you to know that I publicly. I appreciate it. We have actually raised with the team who's running that system who's been excellent the prospect of low floor Vehicles, which kind of gets rid of that whole barrier. If you will reach with people in terms of what keeps them from using transit to access the Waterfront what we've heard consistently is and we have a relatively robots Regional system spine on 3rd Avenue ways to get downtown. Generally. It's the topography and even though we all knew maybe think it's only three or four blocks is quite an obstacle to a lot of people especially if they're not used to using the core of Seattle. Maybe the way some of us are and so there's actually great dad on now that's come from the essay about the shuttle system. And they're seeing far more ridership than was anticipated because people see it as a way to connect with the larger system and accessibility is a really important part of making that delivering on the you know, the division of that so we'll keep working on that slide just on construction as we move in wanted you to know some of the tools were using to make sure then the community-at-large knows what's happening in one of the number one things is confusion out there with a lot of people working on the waterfront. We have the state. We have private entities. We have our team. We have a whole set of things we do first is early briefings to all the most affected folks to folks who are having access affected folks whose businesses are affected folks who are taking transit or other means through the district Water Taxi. Face2face briefings something unique that we started with the seawall and we're continuing is we have a group we call the street team which is on the ground on a daily basis and they're actually you can call him if there's 24-hour cell number if there is shoes with anything on the ground could be something affecting a property. It could be someone walking or biking and there's a condition on the bike trail. We actually I doubt the situation like that not too long ago and they're literally Mia wearing a jacket of a certain color. So, you know, that's a street team member and they can deal with things with the contractor in real time. We saw that really work well with Seawall and we're going to continue that and then the last thing is we developed a multi-agency portal which gives you all the information about Waterfront construction on that's what friends construction. Org which basically is a clearing house if you want understand What's going on? Who's doing it? I wasn't happy with what I saw at the crosswalk there. You can find out who's actually responsible for that and then connect with them. Was it a person? Website there's a Webster's website as well as for you can go directly to our 24-hour hotline as well. So we're covering those bases in a couple different ways and it's been working quite well. I don't have it all the time with my head, but we can get her stuff ready before I get off this table to my friends call. Thank you. Can't that's why she's my sergeant Barnes. What's good for 99040? So that's a quick summary of what we have ahead. Obviously were very excited to be moving in the construction. So thank you for all the support over many many years. Thank you and Dora, you have done a phenomenal job. And if I could just add it. I'm sorry about the website. I was going to English and I don't know if this is just a feature of me using Google or if you actually put this widget in here, but there is a translation feature. That's correct. Okay, so just a folks are aware. It's it is the information on this website for for those folks who don't speak the English language it is There's a function to translate it into just about every language that exist on the planet. Thank you guys make it already. Thank you Marshall will see you again soon. I'm sure I'll see you all the time. So we'll have the people involved. Come on up cancel build one 19460 and ordinance relating to the 2008 parks and green spaces Levi s within the development category inflation adjustment in the neighborhood parks and playgrounds subcategory increasing Appropriations to the Department of Parks and Recreation and the 2019 adopted budget and amending the 2019-2020 for adopted Capital Improvement program all by three-fourths vote of the city council. Thank you. Please make introductions. I'll make a few comments and we'll just launched right into this and get it done Traci Redford Counseling Center staff Christopher Williams, Seattle Parks and Recreation. Christopher I'll let you go ahead and introduce it but I I have an idea but go ahead very good. We're going to seek authorization to move roughly 2.4 million dollars worth of inflation contingency from the park and green spaces Levi, which was passed by the voters in roughly 2008. This is been the gift that has kept on giving over the years and by that we mean that I'm it continues to benefit projects and Michael has great presentation that is going to walk through but the spending will help a lot of those projects. Good afternoon, everyone. So just background. So the 2008 parks and green spaces Levy wisely contained and inflation contingency of amount of money in three of the four categories that included development acquisition in the environment categories. This is 2.4 million dollars of remaining money in the development category. And typically I'd say this would have been wrapped into the whole budget process. There were some issues with projects and so it didn't go into the budget process. That's why there's a piece of separate legislation before you today. Let's see you talk a little bit about that. Let me just say that so there was 14 million dollars in this contingency pot. There is 2.4 million dollars remaining as you can imagine over the last 10 years. There has been significant construction inflation. We just have a handful of remaining development projects to complete. There's a couple of examples on the slide before you I'm an example of one that we recently completed as the gasworks park play area that project time because it's a historic site. The site is landmarked many additional costs that came up that warned anticipated when the 1.4 billion dollar budget was developed in I'd say that was probably done in like 2007. I'm a couple projects that were about to I get out to bid Maria testimony and South Park another example is the Magnuson park building 406 roof. And when I think you know well about is Victor steinbrueck Park is another one of those remaining Levee project. So really just a handful. I'm to complete but you know, I would say in most cases that construction will be significantly more than anticipated in 11 or 12 years ago Michael in the 2008 and then we had the four the four major funding categories. So we we we spent them or use them on the on Acquisitions write an environment. But not the opportunity fund just said so what we're looking at now is just a Development Fund correct inflation contingencies and all these agreements Park District ballot measure for the new projects. Does that happens? Yes. Could you ask a question again? I'm sorry. I think I missed the I was just getting a tan the inflation contingencies. Basically, we spent it all except for the development piece that we had hit that and that's what the remainder is a 2-quart. What is closed out as is the environment pot the opportunity fund there still a few projects left to complete but there is not an inflation contingency amount in that category. You mentioned Victor steinbrueck. Is there enough money in this development category to pay for the cost of Victor steinbrueck or not be coming back for Budget? I think we're hopeful that the contingency pot ultimately aligns with what we need and these handful of remaining projects. It's a you know, as we know in this bidding environment it if it's a little bit of a crap shoot a time. So I think we're hopeful, you know, hopefully the scope means the budget there are only a handful of projects and that's the good news. So if and I'm just focused on Victor steinbrueck at this minute if the contingency doesn't cover it. What's which resource do you have money is in the park budget way to complete it. Will you be coming back for general fund request or do you know yet? Typically we would do some value engineering we would look at surpluses to see where we have surpluses from other capital projects that could be moved and it really depends on the size of the gap. So you'll be telling us sometime before October? On this one. I don't think the project will be bid before October and hopefully then I'm leaving that up to you. What's going on over here what I'm going to be able to finish and what's going to go on next year. So that's really end of interest to me all this time next year. We know councilman Gonzalez will be here for sure. Stardew Michael of your wrapping up. Don't step forward. Okay. All right, so just cancel Bill one 19460 those all in favor. Say aye aye. Aye those opposed know the eyes have it passes and we will forward this to the full Council on Monday and thank you very much. I appreciate the the time that you took to do the PowerPoint in the ordinance in the fiscal note. Can I say one more? Thank you. Thank you for your work on City Hall Park and I appreciate that. You got me something a couple of weeks ago. So we're looking at City Hall Park yes, or crescent the work on Prefontaine Fountain. Thank you. I'm grateful that you're moving ahead and we can continue. Work on that in the next few weeks. Thanks. Okay. We got one more matter coming in our ordinance on our Timber Pavilion structure. You want to read into the record again? I'm so built one 19466 and ordinance relating to the Department of Parks and Recreation authorizing the acceptance of a gift of a Timber Pavilion structure from the Seattle Parks Foundation to be installed in Occidental Square Park for public use We have mr. Thatcher with us. That's your Bailey good to see if that's your Bailey. How are you sir? First of all, we had the ordinance in front of us. But also thank you for providing on a few did this Tracy but thank you for providing the July 2018 letter from the Seattle Parks Foundation phenomenal board. Great people. We see the same people but friends of the Waterfront all those folks. I appreciate all the hard work DSA Alliance for Pioneer Square all those folks. So thank you for your hard work. I'm going to let you go ahead and take it from there Christopher and move through here and talk to us about this lovely facility. Okay, so as customary we come here to seek authorization to accept large gifts. This GIF is valued at about 2 million dollars. It's a gift from the Seattle Park foundation and the alliance for Pioneer Square and it is an elegant Timber Pavilion. I will have wonderful drawings for you to see how about this Timber Pavilion will be cited in Occidental Square Park and will provide indoor space. Osborne Hance Park activation were very fortunate to have Partners like the park foundation and the alliance and I'd like to ask Thatcher maybe to say a few words and turn it over to Michael for presentation. Okay. Thank you. Thank you card for members for this opportunity and impart we're talking about a simple transaction here. But I I want to just back up a little bit and very some of what's been said before about that remarkable partnership that actually has authorized through the council back in the back in the days of the beginning the park district kind of made this whole thing happened on Amazing working relationship with the Department of parks and rec with the city council with the alliance DSA with friends in the Waterfront kind of experimenting on Occidental in Westlake to kind of see how do you turn spaces that were felt like no go zones for pretty much everybody. I in two places that were active vibrant parks for all I think in Occidental That's the place where it has worked really well because you have folks who are accessing Social Services playing ping pong or basketball of the folks who are working and he said Road Suite at Fair Park should be and when we started this whole project that we brought some from your cat to give us an extra cheese. How do you how do you do this? How do you transform and his whole thing as well? You know, there's some formulas here, but you've got it in their test things out see what works see what doesn't work. And so we held off making or is proposing major Capital Investments until such time as we Gandhi essay really figure it out the programming figured out the audiences for now what make people feel welcome and safe in that space and as it turns out has been very successful to successful in some ways were tense up everywhere. There's games everywhere the spaces to come a little bit closer. The information booth is too small all kind of good news. So this Pavilion is Catrific designer from Olson kundig are actually here with us today has been designed. I'm going to meet the needs of the expanding and ever-expanding program program is happening at the park and to take care of, you know, folks on a rainy day who might want to be sitting there who don't necessarily need to sit under temporary tents, but it also has been very helpful to sign into Cal fit in with the historic architecture referencing that the lines of that architecture in the scale of the architecture and burping constant conversation. Not quite yet finished in time to pick up reservation for to make sure that we are we are crossing all the t's and dotting the I's on that so it's really kind of a form follows function thing. We did a lot of public Outreach back in Action spring of 2018 through online surveys face-to-face discussions Community meetings. Again, Irish group reservation form had five different presentations of them. We got probably a couple more detailed construction documents lot of wedding through parks department review process getting good advice from maintenance crew about how to take care of this this facility, which is at its called a Timber Pavilion because it is largely Timber with a big glass roof on it, but it's referencing the history of the Timber industry in Seattle and quickly that neighborhood and there's some special maintenance needs that need to be addressed with that kind of facilities are the parks department for stepping up and helping make this happen in and the staff at DSA kind of helping us figure out what time I should be to make that space function effectively for them and all the uses the park security is always an issue when you have a structure like this there was some concern going to just be covered space and Mike what's going to happen. This immediately becomes a new living room. DSA is responsible for coordinating Security in both parks. Now that it's running overnight and unsheltered population will be a priority TSA word can use that we are using overnight Security in both parks to make sure that that that kind of control lighting it will be a part of the facility. We're going to be nimble and kind of try to figure out to what extent this is a barrier a problem and figure out solutions that work given the constraints of that City's somewhere way that we can and can't respond to those kinds of issues, but it's been always friend of mine. Scheduling we got on a want to submit to the city for permitting in the next month or so. I'm construction will take place at the end of that permitting process which as you know can take a serious amount of time as Christopher said Finance about a two-plus-two 2.25 million dollar project. All the dollars are coming in from Bob private donations through the parks foundation. So that's what somebody else to do this gift way of getting this into the city inventory of properties. So, I'm not going to make any promises when construction starts just because what's great is that the the folks looking at how this thing gets bills are doing a lot of kind of preconstruction for the disruption to the park will be minimal when that happens. Here comes up it down. Just want to say that the foundation has been continues to be a great partner. We are working on projects all over the city that probably just wouldn't come to fruition without Thatcher his staff really appreciate that the energy that we get from the foundation. Some of the specific says you look at the image on the screen. So there's a relatively small structure. It's about 13 ft by 17 ft sit on the left side. So this whole structure sits the very south end of Occidental Square Park, so the structures small that's the concierge in information booth. The larger glass canopy is about 30 by 70 feet in size, but has really been size to fit on it elegantly within the existing Park. Did you help Jesse Origins? I cannot take credit for that. I thought they were some people back. Darkness is where they use the word gracefully and beautiful. I mean is always legal. the Landscape Architects back in our office the one of the things just to kind of test out the latest technology Dad. You can tell me to get off. Okay, Gary Johnson was with us. I cannot tell you the number of meetings I've had about people saying we want to have a public restroom A Portland lose something down there, right if you guys are telling me you don't care about it. It's too much trouble. Whatever it is. Let me know because I keep asking the questions and and I feel like it was what people in Occidental Square in the business is down there wanted and now I'm not sure because I don't know where it is. So it may as I say is this equine is deceased and you don't want to do it. Let me know just tell me not to put you on the spot respond to that by saying it became clear, you know where this was originally a grandiose thing. We have bathrooms and it's half a day and we destroyed the vet this out in terms like what would be feasible and what would actually work in that space Cafe went and then I think we started having conversations about the bathroom across in the old fire station being a maybe a more appropriate site. So we we actually did not include a bathroom in this design because there was an enormous amount of nervousness about how successful we would be in maintaining the high quality of that space and if we couldn't do that, then the whole project would look like a failure. It's not completely off the table or is it is here for now for now if you want to do something, we still have the fire station as a possibility, but I will I hear from businesses about like on game days, you know, we put up all the portal but if it's not something as high priority now, I'm considering myself off that horse. You basically went through the APT automatic pay toilet at Hing Hay Park that wasn't very successful and I think the business owner at the time said we would rather have our business bathrooms be available then to have more toilets in the park. So we've kind of Wayne back and forth between that space. And that they're finding is Portland lose to be quite successful. We've got a couple of them up now and our Parks I think getting in there. That's where they are right in Genesee trainer Beach. So I just think that you know, it's better to do something publicly that have people peeing and doing other things in the alley and so I'm I'm officially off this horse for now. So I think so I can so I can appreciate the sensitivity around making sure that meeting people's needs to toilet is a complicated more complicated than what it needs to be I think. But I but I don't think that that we should give up on trying to solve for the problem simply because it's complicated. I mean if that was that was a rubric for decision making we would be frozen in Amber at this point, you know, some of the models in in similarly-situated areas at Occidental Park that could help us troubleshoot for this. So better, Parks has similar issues. They have way less activation. Then you all currently have in Occidental Park. And so I think we should create a learning opportunity from Bad investment that hopefully will look at the summer and and really figure out what we can extrapolate from that example that we could share with you all in Pioneer Square to see if if If it's adaptable to the needs of that particular new brakes that all of our different parks located within the different neighborhoods have different needs and circumstances and a one-size-fits-all approach may not be the right thing to do. But I think that there are opportunities for us to learn troubleshoot and adapt some of the strategies that we're going to roll out this summer at that might be helpful and palatable for the folks who live in who live work and visit Pioneer Square. I just want to keep going with the Horseshoe thing. You know, we've been we've been activating Parks Occidental Westlake. We've been talking about restrooms and I'm thinking that was activation coupled with just a basic need for this isn't for you guys to I don't see this going away. I see the the shape of things to come is that we do have toilets in public spaces and that Park should take care of that. Washing hands using the restroom that it's not just a mere amenity, but it's actually in a central government a function and its central government service and that conversation is not going to go away. So we will keep pushing for that customer Gonzalez will continue because we're not here but that's my point. It's highlighted the the the complete lack of appropriate publicly-available facilities for people to to the toilet that is a public health issue and we need to figure out how we address it course. It was Seattle Public Utilities. But this whole idea of it shouldn't be on your shoulders San Francisco the work they did it was their equivalent. Spu, we will certainly look at this. Yes or Crescent Park is weary develop that Park is an opportunity to experiment and try some of these more Innovative approaches at a park where we know we have funding at least four design a seven-day soup with something. It's some point that actually I'm a huge horse that unused back part of the fire station that is actually a plumbed restroom. And then there was just no City money that kind of help bring that actually I think that's the recent City money and she Scoggins was great about the saying they'd be willing to open the doors. I think the concern was how long that buildings going to be there? But, you know, like everything else there. Well temporary buildings her. Deferral long time but the amount of money that they were looking at to retrofit that so Ada and others for Ada access and for others to use was not out of the question and it was not any more than getting a Portland loo and the question was who was going to maintain him when we talked with Jeff Lilly. Jeff said will help so it just fell flat and we need a leader on this okay within the department would love to see that's ridiculous a half a block from the park and it's conserve the square. So we will end this conversation and you will be our toilets are okay. Okay. I move the committee pass. Cancel Bill one 19466 Motion passes will forward this to full Council. Thank you. Mr. Bailey for being here for everything and your hard work and go forth with your new title to do a sprout. Scepter that it's like a toilet plunger. Thank you. Thank you Tracy. So list of this is going to exciting so go ahead and read the next item into the record and then we'll go through the PowerPoint. item 9 Community Center strategic plan implementation update So you got the new people. Great. So you have a a PowerPoint to walk us through and I will let you introduce your folks and we'll just lunch right in. Hellyer's with Recreation division. One of the coordinators Recreation division director about Justin just joined our team. He hails from Colorado by with Issaquah the new recreation division director for the Seattle Park and Recreation Department. And he comes with a huge depth and breadth of knowledge around Recreation and Leisure sciences, and we're really fortunate to have gotten and then join our team. So we're here today to make a presentation on the implementation of the community center strategic plan. As you know, the department has plan was largely funded by the council through the 2017 budget process. I wanted to thank Council chair Juarez for extending our ability to kind of come back here where we give us time to polish the presentation and come back with what we think is a Morkie. Apprehensive presentation. So we appreciate that extra time in the past. We've examine and analyze data and reviewed best practice best practices and solicited input on a recreation programming and we've done that typically with a very thin margin of analytical capacity since the park district was adopted. We now have staff who are really dedicated to that analytical piece of the work and you're going to meet them here shortly, but the park district has given us an opportunity to test pilot try out new things and part of this report is to share some of the experimentation and the results of where we think we've been successful where we think we need to do more work and how we overall or implementing the recreation strategic plan. So if that'll turn it over to Justin, opportunity to report just to tell you where just to tell you where we're thank you where we're headed. Today. We are going to start by giving you an overview of the Strategic plan itself, where it came from and and the deliberations of an on and then we'll jump into some updates on exactly what we did. So implementation updates on expanded operating hours some of the other Innovations. We did the focus of today's presentation will be on one particular Innovations for the Hub programming this idea of Waller are traditional and for the mainstream model for how we do community center operations does a lot of great work, there's gaps and who it serves and we The Hub Innovations was really a way to look at. How come we kind of Taylor our services weather geographically artist Pacific communities or Affinity groups to an end use innovation to fill those gaps. So that's where where will focus today, but I get the opportunity to kind of give you the bigger context. So in 2016, we completed the community center strategic plan that was really intended to guide additional Park District investment into Community Center operations. And it took about a year to do the plan informed by a major study of communities demand a whole lot of demographic research. We did a pretty significant review of best practices from Pure jurisdictions, and also did a whole lot of staff and public Outreach and plan was transmitted through the mayor's office to council and large large parts of that plan where I dropped it as part of the 2017 budget and most of that most that funding is still in our in our operating budget today. So the plan itself has had a whole lot of a really in-depth look into our history how we got where we are more trying to accomplish today but ended up with these specific kind of recommendations for where to go from here so first and entry big buckets, the first was around increasing Staffing in some cases that was really the right size staff at really busy sites with an eye toward safety and better customer service and then in some cases at six sites which will talk about more it was to add adding Staffing in order to add operating hours. We had a series of Innovations and pilot projects that we proposed around really making sure we've got free programming and place for low-income communities expanding Partnerships some of them Financial about bringing in resource from the outside and then some of them programming to make sure we're really having great collaboration and better programs to collaboration some of them which will focus on today that. Hub programming of how we kind of Taylor our services and then finally there was some White improvements that we proposing implemented to the first and we'll talk about it today is eliminating drop in fees. So just making it easier for folks to come into the center and have fun simplifying the scholarship process making sure that's accessible everybody and then strengthening some of our Performance Management are in our ability to really understand our impact and plan with data and then strengthening staff professional development as well. So I get to tell you about a few of those big picture update. So the one of the first and biggest things we did was add Staffing in order to expand operating hours and this happened at six sites. So there's a lot on this slide. So I'll tell you I'll tell you I'll tell you about it one thing at a time but we made an investment through the Strategic plan of 6.5 FTE and for the most part that was taking you know up front desk Reckitt. And in whose position was .75 and moving them up to 40 hours a week in order to keep the building open longer. So at these six sites at the international list, Chinatown Magnuson Miller Band a solid South Park and yesler that 6.5 ft across all those sites in order to increase the average weekly operating hours. So that middle column shows the increase in in average weekly operating hours since the Strategic plan proposal and then in some of those cases a pretty significant increase at Magnuson, for example in more than doubled the operating hours each week, you know when we make investments like this we want to make sure that we measure impact and make sure we're making the right choices. So the third column is really look at Community utilization one of the ways we measure utilization is people counters with the technology that measures folks coming in the door of the building and so they might be coming in to go to a preschool program. They might be coming in for yoga that might be coming in to play basketball or to sign up for a scholarship any of those things that be considered a legitimate uses that you know that we're open for a system-wide those visits grew 2% but then at each of these six centers that we had operator. As you can see grew significantly more than that just about double digits for all of them which to us was an indication that this was really there was a community need for these hours and that you know, when we when we open the doors folks were coming. How do we pick or how did you pick those six? Yeah. So did the there with the Three core filters were around social equity. And so that was around neighborhood income and kind of scholarship applications at those sites and then safety and customer service. So in the Strategic plan, there's it's sort of lays out exactly how each site came to be in the top six. I think there's a variety of second-tier sites that we may have also wanted to add hours to but with limited funding in and I wish that I could bring it to you today. So the technology was installed in 2011 and with the help of some of the folks at the table and it's actually since then kind of become. Free old and over the last two quarters of over the last two quarters of this year. It's sort of started falling apart. So take a camera in the door that catches folks as they come in. There's a sensor in it that sometimes goes out and we replace them starting in about late summer last year. I to let us know that they actually can't purchase Those sensors anymore. And so this once each time a sensor goes out that back camera was kind of down for good now. Luckily we knew this would happen at some point in the 2019 budget. There's funding to replace the whole system and we're doing that now so a little bit later this year, we'll have that data back up and running break. Thank you. I will say system-wide the numbers have gone up each year that we've been measuring and I'm sorry that we can't get H and I wish we can have it. Yeah, so you don't tell me not to sign that increasing operating hours that we put those in the right spot and there was really a community need for it and that that's that's succeeded. Next I get to tell you a little bit about some system-wide improvements, you know one Innovation was eliminating drop in fees system-wide. And so just to give you some context we have drop-in activity. So that might be you can come in and play basketball. You can come in and bring your kid to a tot gym, you might be able to play a card game and as a park during the recession we added sort of 2 and $3 fees to these things kind of nominal fees to help offset the cost of providing programming in an era budget cuts. Now we found through our Outreach that that was an actual cost barrier to some folks and then we also found it was just kind of a psychological barrier that the idea to come in and just play a game with your neighbors yet to pay money, right and so was a high priority of ours to eliminate that book to eliminate the real barrier to some folks. But also just that psychological barrier, so that's one thing we Ed and Sue. Created after doing that we have saw a 10% increase in drop in attendance and nuts measured by a term of a point-of-sale button on our car registration system. So that's not not ran out of gas at what what amount of the people counter numbers Ardis. This is actual tracking of folks coming in for those specific activities again, I would love to give you a 2018 number, but we were as you know, we were placed our registration system that year and it counts these numbers and slightly different ways. So we can't do not apples to oranges are not Apples to Apples. So we also improve a scholarship process in a few different ways. We simplify the application and we really double down on a commitment to multilingual Outreach. And then we also worked with other parts of the city to honor that utility discount program as a form of income verification and I'm just to give you a sense of kind of some of the what are scholarship picture looks like so in 2017, we had about 4300 people receive scholarships 2.1 million dollars altogether. So 1 and 1/2 million of that is general fund money allocated for license School Age Care scholarships. 400,000 is the park district recreational program scholarships, which as you may remember you also added in this budget added some sweetened beverage tax to so that probably a little bigger next year this year what you're excited about and then we receive supplemental donations and things like that. So about another 200,000. Just looking at quick math are making let's just boil is down here at four thousand people and 2. + 2 million dollars. Is that roughly $500? I went to accounting $500 a piece for the big buckets, which is childcare, which is really expensive. Right because what they're getting a scholarship for is sore for 5 days a week of care over over months right as opposed to so that could be several thousand dollars as opposed to someone getting a scholarship to their hundred-dollar ballet class. So I I don't I wouldn't do the exact average by just dividing, you know, 2.1 by 4,000. I'd look at it in those two buckets and I don't have those numbers for thinking we could do that. Yeah, that's great. And I'm sure that the three of us will bring up how important childcare is. Thank you the more the better. Stuff we were talking about doing in 2012 when we went through the process of having to reduce hours and come up with new operating models and new approaches to how we run community centers. We didn't have the staff capacity of the time to do the work that Justin and Moshe are doing today and so we asked for but and just to sort of set the stage. So one of the innovations that we thought about was going to realizing that are are traditional mainstream way of doing programming really does a lot of work for this community but there's gaps and we wanted the opportunity to really think about tailored approaches weather is geographically tailored, whether it's tailored to specific cultural Affinity communities to try and meet those gaps and so just so we're clear what that investment was was two positions on to kind of high-level positions for us folks who's dated a job was not going to be to actually manage the building but who could start a step back do some of the data and Process planning an incubation of these kind of innovation. So that's what the The Hub investment was was these two positions? No other funding and this is kind of a mode. My colleague mug is to report on exactly how we went about that work. Thank you. So the first thing we did is we took the canoe Center strategic plan as a chest in reference, and we wanted to come up with some goals for the hubs that we were going to work on. I know we did a bunch of research. I looking at different park districts across the country. We even looked at some park districts in Australia to see what kinds of models are different districts using to provide services to the community specifically tailored services, and then we did a bunch of data analysis. So we really looked at our program data. We used census data we use data from Seattle Public Schools King County Public Health. We also interviewed most of the recreation division 2 really kind of put together A needs assessment in a gap analysis. We also really wanted to make sure that we utilize racing social justice Equity tool kit to help inform a decision making and from there. We just we landed on three hugs that we thought we could Implement in 2018. So the first one was really focused on a partnership model up at Lake City Community Center. Now, the second one is especially programming Hub model at Garfield Community Center, which is supporting activities camps what we call our destination summer camp program and then a matrix Hub model, which is focused on Adult Sports 2018. We really focused on pickleball. You look like you have a question. So at Lake City Community Center on this one is actually was made possible. Thanks to the funding from city council for us to build operate the community center and its many of you might know there is a significant need for programming and Services for Seniors and four teams in the community. Can I just interrupt you for a second or you talking to the queen of D5 down here a very good. I didn't know if you were sort of a new kid on the Block. I just wanted to alert you anytime you say G5 Lake City you get extra points around here. So anything that we did up there actually is in the recreation division. We've actually been piloting the use of public benefit Partnerships at that Community Center. And this is something thank you. This is something we've been doing in other parts of our division, but this is really the first time that we've tried to do this and Recreation. So this is really something new to us. And we're really looking at utilizing these Partnerships has to sort of see what we can learn from them. See what works and what doesn't work. Generations in Seymour have been phenomenal and also the sea lions have already had already been doing it. But to give them that recognition was really really important. So thank you. Oh sure my pleasure. It's been really fun working with them doing the work and one of the things that I found really you need for to play with Seymour as they do a lot of intergenerational work, which is really spectacular intergenerational models are those for the seniors and for use to have better health outcomes. So really appreciate I would say the one thing that helped make this possible was that in a Lake City assertive it unique Community Center for us and it's some of you have mentioned those Partners have been there for a long time. It really made sense for us to really engage with them and proactive ways and really support the work that you're doing. And we wanted to continue so with that 25 hours a week. There were funded we're operating that as a more traditional Khmer Center. So we're doing so far traditional program that we do senior Fitness classes dementia-friendly program. We have a salsa dancing now, I think your salsa dancing. We had the special event the Lucha Libre mean the Rings. I'm sorry. I missed it. We brought in a full through these these Partnerships. We've actually been able to open up that facility in additional 19 hours a week on average and that's the the sound generations and actually is opening the door and working with the other partners the Lake City lions are continuing to do the fundraising and the flea markets that they do through those Partnerships hunger Intervention Program for example served over 10,000 meals last year. Mendez's phenomenal would have captured that in value that they bring to the community into us and you've also captured all that traffic cuz of the new Lake City Library is right next door to make it continue to do their tutoring there. So this is really been fun to operate that Community Center. So, thank you. So before I get into the details as Next Top, I'd like to tell you about some of the core values of our department that wherever the recreation division which is really that we're really here for Youth and we know that the recreation program that we do really has the power to change lives by supporting Youth Development, and we're also committed to equity that really should not matter your race or gender your neighborhood that you live in your well, that's all you that are City really should should have access to and be able to participate in R programming. Last summer alone. We had over 37,000 registrations in our youth programs to our most popular programs include are licensed summer day camp and activity camps each of those programs head over 10,000 registrations. Are licensed Child Care Program which offers the summer day camp is supported by 1.5 million dollars in scholarships and because of his license, we can also accept DSHS families, which means that it doesn't matter how much money you have you can participate in this program. Or activity camps are not licensed there typically half day off and with the morning option and then afternoon option children can register for programs like geocaching science lacrosse nature play all kinds of programs that we offer in that in that program and according to the National Science Foundation programs, like these really help the curb the summer learning slide which disproportionately impact lower-income families. So when we did the analysis of reactivity camps and we saw the lack of registrations in the Southeast Geographic district with also includes command centers in the central district, and we knew that we had to do something differently. We have offered activity camps in this to you time and again, and we really struggled to get enough registration. And in those programs to make them sustainable and two are operating theory is that money is a barrier that families simply cannot afford to register for these programs. It's a wonder we do differently so we selected a site in actually in the Central District at Garfield Community Center. We located at the canoe Center that traditionally has not had activity cancer couldn't sustain them. We leveraged finding from our strategic program partner the associated Recreation Council scholarships for family to qualify for 80% or greater a full scholarship into the program. Are we directly Market at the program to families that were wait-listed for a summer day camp who did not receive funding. We also use traditional and I think media sources to really try and Target the community really reach I get the word out. And we offered free lunch and snacks to kids who for the many of them. This might be their only meal of the day. the meals and snack So this is part of our summer sack lunch program. And then we also supplemented that with additional funding so that we can make sure that we had food available. Yes, but we leverage that program there. So. So the outcome so the impact was that we had 40 separate camps that we offered their Garfield. We've got 582 registrations and 80% of the families that participated in the program receive the full scholarship registration to the percent of population increased more than fivefold. And from this data, we feel like we know that we can make an impact and yet we're still not there. We really need to figure out how can we actually level the playing field across the whole division so that everybody in our system has access to these programs. So this next hub is really rooted in a matrix model the city, you know Recreation is a large Department. And from the recreation demand study that we did a few years ago. I we know that there's a growing demand for adult recreation in our city and there's a growing population of of young adults that's going to continue to grow in the city for a number of years. I'm just growing demand is not limited to traditional Sports. So there's a lot of non-traditional Recreation sports that are are flourishing and all of these activities. There's competing demands for a Jim's particularly at peak times. I'm so for example during basketball season. We kick out a lot of programs so that our young people can actually practice and prepare for basketball games. I'm in as I mentioned earlier recycling department so I can you use centers typically a run by a coordinator. We have managers every to write a graphic districts. We have specialized work units and we have different divisions. We have the recreation division. For example, we have our facilities Division and the Gap in the programming. Is really we had numerous people practically from pickleball requesting more access to drop in time in 2010. I have to make that we had about 20 hours a week of drop-in pickleball at two locations and we offered I'm sorry your challenges also managing levels of play now because the demand has really increased so we have a lot of people who are interested in learning how much more beginners we have more seasoned players who actually can be on the national scene. These groups don't want to play together and sometimes in our our drop-in time. There are challenges figuring out. How do we how do we regulate the play? Who doesn't want to play together people who are competing on the national scene in pickleball and then the folks who are just learning. Oh, that's that's one of her I'll talk about it. That's one of the groups that I'm actually organized and competition there and so working for are silos. You're so tempting part of my slider, but we're actually worked with our division does striper outdoor courts. And so this group because of the the striping of the outdoor courts did a competition out there and that's right out by Greenlake. So goodness knows we have competition in everything there. When we tried to do space at Smith Cove. We had our outdoor volleyball players come and say they wanted space for 9 difference in whatever the pitch is called in volleyball and Eminem looking at him saying we might get one or two but 9, but I've heard a lot of competition but not with adult pickleball. I could probably tell you some stories that I've heard. Yes, and I told Tyler said. So as a mandatory the information so we we identified some additional X inside every community centers for dropping play because we made everything free you all Drop In Time free. We actually survey participants is he would they be willing to pay a little bit of money that you participate outside of operating hours so that we can cover the cost of that staff to open the building. We piloted that at two locations one of the locations had enough interest to support that for a few months and then interest slowly way and I think they just probably went back to the free drop-in. I'm so that model prove to not be so successful but things like striping the outdoor courts, we actually issued our community centers pickleball Nets that they can then check out to the public. So a patron can come into the community center assuming it's open check out that pick up on that go outside and play on a sunny day simple things like that are pretty easy fixes to help help satisfy the demand for this. so Moving forward we're going to continue to be the incubation of change and look at ways that we can be more effective more, efficient and address Equity issues in her in our division and Lake City. Where can I continue to support and learn from those public benefit contracts on our team leader up there recently received some funding from Mark and from from Seattle Parks and Recreation that's really dedicated to help support the team program up there at Lake City. For activity camps. We're going to run our programs again this year. We're going to continue to try and learn for them. See if we could be more efficient. See if we can try to expand the program and we really want to figure out how do we solve this problem? How do we expand this opportunity to all youth across the city and a Magnuson Community Center as you might know Mercy Housing is scheduled to open up. So the first residents will be moving into Magnuson just met and so we're developing a strategic impact Coalition in partnership with Seattle Public Schools Mercy Housing Solid Ground YMCA in a number of other partners, they are so that we can work as a real team to forgot. How do we really address the needs of the residents of you be living there on campus and that are currently living there but not forgetting the residence of the whole grader committing. So how can we really work together to solve all of those needs and demands of that of the park that really exciting because we know we've been dealing with cancer for Johnson cuz that's his district. I've been dealing with it as the chair every social economic indicator need all comes down to Magnuson Park. From profit to nonprofit to off-leash dog to pee patch that I mean everything Recreation. I need a grocery store. So and then we have all the affordable housing units down there going to be really excited to see what happens. This me to okay? So just enclosing kind of lessons we learned from this is couple years of innovation. So first for for many of our programs and services demand that we're getting from the community exceeds our capacity not thinking through things like the scholarship fund that we've spent down every year thinking about kind of where to slot in those aggressive pickleball players thinking about the need for more operating hours and how how much uptake there is a pen by Community. I'm in so to solve that puzzle, right? We need we need some Innovation and we found over the course of this work that we can with with with a real focus on Innovation. We can do things at a cheap results. Some of those are really self-sustaining right. So once your striped outdoor pickleball court and set up a system for folks to use it then it's good to go for a long time. Some of them are going to require continued investment. Right? So if you if we want to dedicate scholarship funds to make sure youth program is accessible. We're going to need those same funds every year to to keep it alive. We also learned we we start anew this intuitively, but we really been able to look at it in a much more granular way that are our fee based model right are pay-to-play model does a lot to sustained significant programming all over the city, but on its own it's not going to deliver really equitable distribution and there's going to be gaps in who we serve and we've always known that I'm booked the capacity to have the this extra analytical staff who can really dive into the numbers find actually where the where the worst disparities in gaps are and tart start to come up with a plan to remedy that has been really really wonderful. That was okay. And then I think we think there are you know, his moments and continued opportunities for innovation in the system, but it's a complicated system writing it takes with a lot of stakeholders and it takes some really thoughtful analysis and planning and we we've learned that can't come from we want to keep our community center coordinators and assistant coordinator is really focused on Running an amazing building with a great set of programs in it. Right? And so we need that extra little bit of Staffing to help us do that more complicated analytical work and planning and that's what these Hub Investments have given us. You know, I want to add on to this stat part of this approach has been to be innovators and to be borrowers of innovation. I think too that and we've asked Justin to look at how these Trends are tracking for public recreation in public Recreation participation for youth adults seniors and where the trends are taking us for the next Toronto of Park District funding. So we would like to have some time come back with an expose on what we've learned so far while we continue to innovate the learning is also part of that and being able to plan for the future through that learning Christopher. This is our 10th year working together and I want to acknowledge How Far We've Come And as our city has grown as fast as it has hundred thousand more people during this. Plus we know that the parks and the access to the community centers is more critical than ever. So I want to acknowledge that and thank you Justin Mo and Justin for your work here, but I also want to say three very special. Thank yous Bitter Lake and Garfield during the snow that you worked on that so hard and fast I heard today from some folks were working with Mary's place. They couldn't have done that without you a lot of people stepped up, but I want to acknowledge that and say thank you. Also the six acres that are going to be an active play filled up at Fort Lawton. Probably one of the few things that people can point to agree important, but that 6 acres is made a big difference. And then also I want to acknowledge the support. You've given Market to MOHAI. I met with John Pearson yesterday things are moving forward that man has raised. Million dollars himself and the next objective is to help figure out how do we maintain that going forward, but he just sang your praises and I want to say thank you myself. Thank you very much. Everything else? Okay. Well, thank you guys so much. We'll see you. All again. Thank you Christopher. All of you. I can remember Justin and Christopher. I forgot you're and I should know your name is by now. No, Justin, thank you guys. Okay. So with that before we adjourn let me make one more announcement and then we will adjourn the next meeting of the Civic development public assets and David to use committee will be Wednesday, March 20th at 2. And with that we stand adjourned. Thank you very much councilmember back shot in Gonzales.", "end_time": 7003.7}]}