{"format": "raw", "annotations": [], "confidence": 0.9411207218427916, "data": [{"start_time": 0, "text": "Good afternoon, everybody Welcome to the sustainability and transportation committee. Thank you all so much for being here. It's so nice to have big crowds here for the last couple meetings. I imagine we might for the next few meetings to it is August 6th, Tuesday 2019 2 p.m. My name is Michael Brian. I am share the sustainability and transportation committee. We have an exciting agenda today these meetings typically run about 2 hours, but we're kind of changing that and I imagine we're probably going to run close to 3 hours again today. It looks like we have about 25 folks signed up for public, today joined by Calvin Harris want thank you so much for being here really quickly. We're going to have an appointment to the move Seattle oversight committee will consider a resolution relating to the green New Deal for Seattle will also have a possible vote on the resolution will have a discussion on an ordinance related to a green New Deal for Seattle establishing an over. Board and setting up some Financial structures in the city that will just be for discussion not for vote today, but I'll be back at the committee on Friday for a possible vote will get an update from the Department of Transportation in the transportation Equity program. We will have an order as related to the streetcar that is very possible vote today potentially authorizing a 9 million dollar energy fund loan to fund ongoing engineering and design work for the streetcar. We will have a quarterly update on the Move Seattle Levy oversight committee. And finally a briefing on Transportation impact fees really quickly. I want to take a second to approve the agenda council members who want to hear any objection will go with that agenda. Excellent throw the agenda is approved. You may thank you. That's what Brian just I just wanted to let you and members of the public know that I may not be able to stay for the whole thing. It would hold me banquet and I hate missing the point about the impact fees because of course I have long supported that and happy to see a Revival of that discussion. I'm definitely going to be here for public comment and a green New Deal section, but it's unclear how much longer after that. I can hear your stand for the chairs report. I want to read this thing into the record just so folks that are tracking our last meeting will know at the July 30th, sustainability and transportation committee meeting we discussed what was labeled information item 1476 relating to the annual streetcar operations report and next steps to report there was viewed that meeting has since been Updated with corrected with corrections and replaces tables 5 and 7 which details the past performance the South Lake Union First Hill streetcar lines with correct data. The updated report has been added to that same information item information at a1476 for the public to access it. So just to let folks know that the report that you access online today is slightly different than the report the folks access to a week ago. And so there's a slight change there in those two tables we mentioned and if someone wants to know what those those differences are we can surely dig up the old one for record that we want to make sure we have the accurate information out there publicly facing. So with that, let's move into public comment we have what's the right looks like about 25 folks lined up to testify Kelly. Would you mind doing 90 seconds for folks home in and a half trying to get to public comment in about 45 minutes normal reallocate 20 minutes, but I know it's a lot of interesting things on the agenda and want to give everyone a chance to fight public comment. So I'll call people's names. Mr. Erickson year. You'll be first in one second to marry somebody followed by Carol McRoberts David Blandford, and then Megan Cruz didn't come to eat in microphone. And if you have a minute and 30 seconds once Kelly figures that out and I just asked folks to please track your time on the screen. If you don't mind, I will try to be polite and courteous, but I do need to be fair to everyone and make sure you get everyone in so I'll cut you off if you go over a minute 30, but you can do me a favor by monitoring. Yourself, that would be outstanding gym. If you want to start all this time you on my clock and we'll see how it goes. And once we get the system figure it out will let you know but go for it at first till it is my opinion into Center City Connector project should be completed as planned according to the KPMG streetcar cost review the benefit to Seattle be an increase in potential annual ridership from the current forecast of 2 million to a new hire forecast of 6 million. This will become the busiest metro line in Seattle First Hill is an urban center Village that combines groin employment in groin residential housing. We are destination in the morning for those heading to work and in the afternoon for those returning home. We recently advocated Shifting the new underground Light Rail station to stop on the east side of I-5 on First Hill. The idea was rejected our original neighborhood plan was centered on and under Light Rail station at Madison and minor the first Hill underground station was canceled our Senior residence and Healthcare visitors appreciate the roll-on-roll-off accessibility offered by Sprint car platforms. If the decision is made to cancel the Center City Connector project, it will be another Lord disappointment on First Hill. Thank you, Tim. And thank you for keeping under a minute 30 without even a timer. I appreciate that. I looks like we may have the time and working now. We'll see how this goes Carol your next. chemical burns Oh boy, if we might be in for a treat councilmember sawant. Good afternoon. Can you hear me? This is just a reminder for all of us. Thank you. Change the world activist with flag on Hertel. We're on the right side of History the green toxic feels now it's time to change the rules on the right side of History. The green the way the green New Deal will make the corporate leaders will have to pay just don't see it on the right side of History the green New Deal. Craigslist always a pleasure when I get a visit from the Raging grannies. Thank you for being here and act to follow a plan for that work for visit Seattle. Visit Seattle is in the business of getting people here. Once they get here we care about how they get around visitors are more likely to choose public transportation options, especially given convenient Transportation options, like street-level streetcar rail Rail options are more attractive to visitors in general. We've seen this with Link light rail. We see convention delegates. We see Leisure Travelers who come in and voluntarily choose that way in and out of the city and around to City neighborhoods. And the Center City Connector will add compelling another compelling option for these visitors connecting visitors. Staying at our neighborhoods with the downtown core and these better transportation connections will need better connections with downtown businesses. That's increasing the economic impact of Tourism council members. We support moving forward when on engineering and design work for the Center City Connector. Thank you followed by Linkin vanderveen and Tom graph and then done Blakeney. Thanks. I'm here to talk about Transportation impact fees as downtown Towers rise up without infrastructure that contains there Transportation demands are congested streets and Ali show that growth is not supporting growth development impact fees may be required to bridge funding for transportation improvements not surprisingly Real Estate Investors have appealed them. However, today's presentation includes a chilling compromise. It suggests the transportation impact fees be used as quote-unquote alternative to CPAP medication for systems Improvement. This violates see the rules and intend to identify project-specific mitigations and encourage public involvement in decisions. Seattle has seen how the pay in lieu of model has worked in its bid to include affordable housing in new developments, which is to say not at all developers will choose to pay their way out because it's a better deal for them, but it's not always for the public, please don't allow Transportation impact fees to be used as a bargaining chip for trading for CPAP mitigation. It cuts out public input and won't create sustainable development. Thank you. Lincoln I'm leaking Cheryl Bryan a members of the committee on Lincoln vanderveen external Affairs at Seattle University Seattle. You was a strong supporter of the Seattle streetcar Coalition and the Sidney Center City Connector. The first Hill streetcar is a vital mode of transportation for our Seattle you community the streetcar stop at Broadway is our stop right across from our clothes partner Swedish Medical Center and it stopped according to the Seattle Department of Transportation to Seattle you community makes up the second largest institutional user of the first Hill streetcar with faculty and staff using it to connect with other Transit sources in the city or travel to local retailers and beatings while many of our students ride the streetcar to get around Capitol Hill to give you some numbers we have about 2,300 students living on campus right now. Adelberg 7200 total student population and more than 1,500 faculty and staff commute to and from our campus every day. We believe it is vitally important to complete the streetcar line connecting First Hill with South Lake Union Seattle is one of the great emerging cities in the world and you wanted to continue to be a great place to live working play the ongoing Madison Street bus Rapid Transit project combined with completing the streetcar through the city will increase the ability of our students faculty and staff to enjoy Seattle and support the local economy. We also know that for many of our purse prospective students. Thank you. Thank you. I'm Tom Graff. I'm a member of the Belltown Business Association and it's a pleasure to speak in front of you. We are strong supporters of the streetcar connector project and we endorse the continued funding of the engineering and construction of this connector line to stub lines as I call them don't function without connecting and I think we all saw that with Link light rail that once you opened the Angle Lake and the Capitol Hill and University of Washington stations, the line capacity doubled and I believe that exactly what will happen with the streetcar great cities have great transportation and it cannot just be on buses at 4 to 6 or center city is in Grimlock everyday and it's only going to get worse at a more buses is not going to solve the problem. We need dedicated lines. History car is in a dedicated Lane and much of its length. I strongly endorsed you proceeding with his and I appreciate the opportunity to speak. I'm gone. You're going to be followed by Page mellott Lynn Lisa Howard and then dug a hole Tim. Thank U council members. I'm done Blakeney. I work for the downtown Seattle Association. I'm here today to speak on behalf of the Center City Connector. We think that this is an important aspect of downtown Seattle modeling for the visitors at David Blandford just mentioned but also for the people who live and work in downtown Seattle. I'm disappointed that we're getting congested and we need other alternatives to get around eye center city conservative estimates show that this line will have about twenty thousand Riders on day one when it's connected to both lines from Capitol Hill all the way through South Lake Union. That's more than the Portland line currently the pulp or of the Network's Carly Carrie Bennett more than any existing Metro Route Terry's right now, so it's a big investment but it's a big it's a big outcome that we look for. Also connects currently are our system currently connect hubs that are really critical to First Hill. You're not seeing a lot of writers get off at up at the regional Hub in Jackson Street, and then take the streetcar up and get to their jobs or other medical appointments on first child services are critical Connection in final and most importantly, this is a really green project that's providing mass transit to our Center City, and we think it's really important. So I thank you for your consideration today. We look forward to moving forward to the full Council next week on my page. My name is Paige Milad and I'm a resident along the first Hill streetcar line it and I'm here to speak in support of the Center City Connector connector once complete will quickly help absorb the growth in the downtown choir that the people who come before me had spoke about. The Five Mile street car route is expected to have more Riders per day than King County Metro is busiest bus route since 2010 the area downtown along the street car out has had more than 43,000 new residence, which is an increase of 66% and a 27% increase in employment along the Route the traffic congestion impact buses along 1st Avenue signal the need for higher-capacity Transit and A Streetcar vehicle can carry twice as Mount capacitors as an articulated bus. 5 years ago last month City Council vote at 8 to 1 to build. The Center City Connector is important to me that city government delivers on promises previously made to the community. Let's be proactive so we can build it quickly while maintaining the high-quality project that we were promised. Let's get the streetcar rolling York City Connector with the changing City and changing Transportation needs Pioneer Square in the surrounding. Neighborhoods need deficient reliable Network connecting are looking for. Thank you. My name is Doug whole time and I work for the first two Improvement Association. Thanks for giving me the opportunity to share my thoughts as the downtown core continues out thousands of jobs Residence Inn hotel rooms 1st Avenue needs the streetcar to accommodate all of this growth during the snowstorm in February. The Streaker was the only reliable and Safe Transportation option to first cell. Of which many Regional residents depend on the health care provided from first cell. We need to continue forward momentum to ensure that our streetcar system is fully connected to keep people moving downtown. Let's finish what we started. Thanks. My name is Nora Chan, and I'm and I'm the president of the senior action in Chinatown and my job is my objective you so that half the senior to vote, you know, teach them how to vote and register them to walk. So this what we doing is very important last week. I bought 40 one of them here to the meeting and let them understand and see how democracy we have in this country. And so, you know, I was born and raised in Hong Kong Hong Kong as you know, his number one city for the economy in the world, right and III. Anything that actually what make Hong Kong the best is the transportation because I was born and raised there. I can go to one corner of the the Hong Kong to go to the other corner with human hour and that's why it make it to be such a vibrant City and is also making such a good economy, you know city in the world and so glad that I was born in Hong Kong to see them and then I'm really glad that I'm getting old in Seattle because you know, she although he is growing and I think it's very important that we learn a few things from other part of the world. And so I talked to some serious, you know, some of these things to buy them last week. So one. Please keep your promise Chinatown small business have been waiting for the Center City Connector since 2012 construction of the first Hill streetcar number to the Center City Connector. Will have its own lane creating a fast and efficient way to move more people out of their cars and with using with locks that okay opossum only 20,000 people will write the new Center City Connector for a day. That is more than any Metro Bus Line can handle you in a day, which lights are welcome anybody to come to Chinatown and make Chinatown to be a better City better area. Thank you. Zhiyun, extremely followed by Steve Gale than Matt remley than Ingrid Elliott Good afternoon council members. My name is James Wong. I'm the CEO and founder vibrant cities. I locally owned real estate development business space in Seattle Chinatown. I'm here to speak in favor of the City Centre Street Car project for three reasons one city needs to continue to invest in reliable affordable Transit where immigrants I'm an immigrant and we came from very humble beginnings growing up our family relied on public transportation, and we did it needed it and we need to support that increased that for more citizens second or city is becoming denser everyday and we need solutions to reduce congestion or City's population increased by 135000 people from 2010 to 2017 and 3rd. If it's City truly values Chinatown International District. We need to have the city connect. The city's streetcar that will makes CID more accessible to Residents. Here's why the Chinatown in Vancouver and Portland. They're tying Portland's chinatown's pretty much dead. And the reason is they weren't people going. The place was not it was too hard to develop it was, you know too hard for businesses to a change there. And so we need to bring more people to Chinatown International District in the streetcar would do that. So, thank you. Thanks James Steve. Good afternoon. Council members Seattle needs a green new deal today. I'm Steve Del director of Emerald City Seattle collaboration of community groups government Labor Training providers in businesses. We faced many challenges globally in locally climate crisis housing crisis gentrification and displacement Health disparities pollution in kinetic quality. Another the green New Deal can tackle them all and provide a just Pathway to the Future Seattle with our carbon free electricity affluence and progressives citizenry must leave the way the green New Deal must Center on Frontline communities black indigenous other people's of color immigrants and refugees low and low income people houseless and homeless disabled lgbtq and Elders by ensuring that we make our city more livable just and inclusive for these communities. We will make our city the best city. It can be for us all the green New Deal will not be free and we must be willing to in. S&R future but as one of the most affluent cities in the world we have the resources to do this through progressive taxation. The green New Deal is a platform for dealing with our challenges and a truly integrated way. It can deal with energy Health Transit housing waste and jobs. I heard you to commit to the green new deal today and invest in our future. I'm at your next. David Okapi educational wakantanka. I'm particularly will watch that you have that you can walk and talk and Chucky are you I'm a coach in a mini. Which one he came in while we check yo. Yo, my name is Miriam Lee and Lakota and live in Beacon Hill and I'm here today to speak on behalf and Sport for Seattle Green new deal and would like to thank the council members for your support and advocacy on this issue over the years. What I said in my language is ass that the committee and the council here, you know. Have a good heart and good mind and put forth those energies and I seen the legislation that's board that strong that sets a Target gate day of 2034. No, fossil fuels to be How to be fossil-fuel-free by 2030 that incorporates the voices of communities of color low-income communities native communities and workers. I'll be bored or not only with the the statements that the actions to follow and thank each and everyone of you for the good work that you do and your families that be taken care of and so are our next Generation have clean air and clean water to drink. Thank you. Glasson. Thank you, ma'am. Ingrid Elliott Ingrid you going to be followed by Lucas Vargas then Emily Hazelton and then jumpy tail. Thank you. My name is Ingrid Elliott. I'm a Seattle mom and I'm here because I want grandchildren that we know that we have until 2030 to change the trajectory of climate change 2030 is when Avi, my oldest son will be 30 years old and he says that's when he'll start thinking about whether or not to have children. But if climate change isn't under control by then he says he probably won't have kids. He doesn't want to bring children into an uncertain or dangerous future. I'm grateful that the city council has unanimously endorsed the green New Deal. Now I ask you to take the first steps towards making a better future for the children and the grandchildren of this city. The first steps should be to do no new harm. We must stop are growing emissions Seattle must immediately ban all new fossil fuel infrastructure projects and ban fossil fuels in all new Seattle buildings. Thank you. I'm Lucas. I'm a graduate student at the University of Washington very lucky to be able to study the physics of our climate everyday and I'm also very lucky to be a member of UAW Local 4121. I'm here to address a common criticism of local climate action the idea that somehow the crisis is so much bigger than Seattle. So nothing we do really matters aside from the moral imperative to eliminate or carbon emissions. This complaint completely ignores, the immediate benefits that reducing emissions will have on communities particularly those who have borne the brunt of Seattle's rapid industrialization on their health and the health of their children. The council has the responsibility to take care of its constituents and I hope that the transportation committee will continue to take aggressive carbon reduction seriously moving forward and give Lucas and Lea. Hi, my name is Emily. I volunteer with 350 Seattle. I'm excited and grateful to see the council introduced a green new resolution resolution today and I am here to urge you to keep up the momentum by Banning natural gas in new buildings. Just five days ago near Pittsburgh a natural gas explosion demolished one house damaged several surrounding houses and sent five people to the hospital in 2016 a PSE natural gas line exploded in Greenwood Seattle blowing up free businesses in the wee hours of the morning even without gas leaks and explosions gas burning stoves produce nitrogen dioxide. What does a respiratory irritant with close windows that can lift indoor pollution levels above EPA standards for outside air? Despite all this G20 Nations spent 147 billion dollars and subsidies to the fossil fuel industry in 2016. Our communities are subsidizing the fossil fuel industry with our health and our future last month Berkeley became the first city in the u.s. Tube and natural gas in new low-rise buildings and homes. It would actually cost less money to install one type of energy electricity and new buildings. Let's follow Berkeley's lead. No more government handouts to fossil fuel companies as time. We prioritize the health and well-being of our communities. You're going to be next followed by Maria batayola Conan and Randy Gustafson. I'm done. I've been living in Seattle for most of the last 20 years and you have until two years ago. I hadn't really experienced smoke in the city and until about eight years ago. Homelessness was something that was manageable. I remember when there was a task force that had a plan to eliminate homelessness by like two years ago because it was doable. It was something that we believed in now the priorities are totally off out of whack and we need a green New Deal that will support those people who've been impacted by the outrageous. Takeover of our city by large corporations and also the impact of the fossil fuel companies decision to ignore and suppress science. I would also urge that this committee not go forward with a plan to build an expensive transportation system are they could be easily and more cheaply moved when we can easily move people with dedicated bus lanes for much less money. At least until we can sort out how to fund the green new deal. Thank you. Thank you, John. Good afternoon. Good afternoon, councilmember O'Brien salon and mr. Pacheco. This is my first time to address you. So as you know, I come from Beacon Hill and I represent a central De La Raza. We've been working on the environmental justice issue of Aaron noise pollution in Beacon Hill. The green New Deal is going to help our community a lot and I invite you to come visit us or six miles long on on the west side of Beacon Hill is I-5 that has 250,000 cars a traveling on the day on the North side is I-90 on the east side. We have Rainier and MLK I-90 has about a hundred twenty thousand cars that travel day overhead are airplanes that use fossil fuels the comb overs every 90 seconds. So this is going to not only benefit Olive Seattle, but really truly help us stop dirtying our own home so to speak. So I know Seattle has been bold sales the first city in the United States to adopt a race and social justice policy a big move not just from a legal perspective, but from a cultural change perspective, and I know that we are on our house is on fire. There's no better way to say it. So please take bold action move forward and there's so many brilliant brains and so many Frontline communities that will help move this forward. Thank you. A certain council members and thank you in advance for your support with a green New Deal at resolution. Hopefully I'll get the chance to vote or not this coming Monday and I just wanted to I take less than a minute and a half to talk about some of the next steps and to remind you of the overall goal of the Seattle for a green New Deal campaign at the overall goal is to eliminate climate Push by 2030 address current and historical Injustice. He's in the process and also create thousands of jobs. And in terms of our meat that's going to take probably dozens of policies to do that over many years, maybe 12 or 11 a.m. Until 2030. But immediate next steps when you're in a hole is to stop digging that hole any deeper and there are two things that we can do and me Julie we can follow the guidance of other jurisdictions in doing those in January with Charlotte Kane County passed a moratorium on all new major fossil fuel infrastructure projects, including pipelines and Storage. City of Seattle can do that in the city and at the Port that isn't an immediate Next Step that you can take and also just a couple of weeks ago. We saw the city of Berkeley moved to keep their citizens and Resident safe by by prohibiting new fossil fuels from being hooked up to new residential and commercial buildings. So we got a lot of work to do to invest in the goods. Are we going to make sure we're not investing any more in the bags and lights pass policy as quickly as we can to ensure that no new fossil fuels are entering or communities. Thank you. Thanks. Randy Randy you're going to be followed by Meghan Murphy then we'll have Alex Hudson and Polly Polly invent census. Good afternoon. I'm Randy Gustafson. I was an operator for 11 years of the Seattle streetcar at South Lake Union and I come with the experience of the South Lake Union offer a lot of trips for both Terrace and commuters basically and the City Center connector is basic Guitar Center City Connector. It is basically developed as an urban circulator people told you what what that happened tells but there's a new Cruise terminal going to come in and it's going to be basically it's basically great for Taurus and for anybody and basically downtown Seattle Capitol Hill South Lake Union to get around to any spot along the area. I had two other points if this isn't built I'm reminded of forward thrust that has for 50 years been regarded as one of the worst decisions to not be made now. I was looking into it. Turns out that Actually passed it was more than 50% of the vote. But because of where is Bellevue developer and General Motors were against that they wanted a big campaign in the last 3 weeks and it went from like 68% passing to just over 50% and our city would have been just so much different if that had actually been allowed to go on. Anyway, I am certain as about operating. Do you need a turn back over there by Westlake and 6th because you only have one while you have you don't have any alarm South Lake Union accept a new one will be put in at Terry and I'll run and Republican if you want to have the streetcar downtown running more on time. If you have that turn back you can guarantee that a lot better. Thank you Mandy appreciate your expertise and coming out Megan. I think sodomy talk is the transit Riders Union here. Salah update on the transit Riders Union that this meeting was happening and I am just so excited because it's a union founded on people who ride the transit which has a distant relation to work. It's that we were people that like to ride transit to the street car is really great. And the green New Deal is really really wow. It's amazing and I just don't think it's enough though and it's because the heat that was over Paris. It was like a hundred and ten degrees in Paris and people are on the edge of the scene and getting this for fried from the Sun it moved over it moved over Greenland, and now Greenland is melting by scientific fact 50 years sooner. So I don't think we're quitting fossil fuels fast enough. I think I would hate to see the Panic cuz we're always preparing for the earthquake the earthquake in Seattle. We should all be preparing for the water levels to rise. So I think endorsing the green New Deal is really cool, and I think the street car is really quite a union of Transit Transit needs to be free and organized and I think massively like everybody should just give up their cars and like just share with each other for a while until we figure out what's really going on. So, thank you. Executive director of transportation choices Coalition. I'm here today to speak on behalf of the Center City Connector streetcar. You've heard the numbers around the ridership of this of this alignment that will connect an amplifier and catalyzed our existing Investments 20,000 writers a day. You've also heard about how it leverages other Investments that we're making in our Waterfront in places like yes or Terrace in our transportation system. That is the light rail through downtown and I'm I'm struck to be following people who are talking about the importance in the urgency of the green new deal as we're here to talk about what level of investment and commitment or city is willing to make in a zero-emission form of high-capacity Transit through our downtown and I would urge us to be thinking about what you've heard from these folks about the extreme urgency. I'm getting zero emissions Transportation matching that with what we know about Transportation being the single largest contributor to greenhouse gases in our city and asked you to take what you're hearing from these folks and from transit Advocates and and let that guide your level of willingness to be supportive of and moving this project forward so we can have a car light downtown and a viable Planet. Thank you. Play New Guinea followed by Mike McQuade and then Colleen Bowman and then juergen Oswald. Paella party was pulling bad sinus representing the it's such a Transit Riders Union. If anything happened this morning on the way to a committee meeting. I had a handful of blackberries ripe ones. I love all the tricks to Ballard that there are no 7 to be seeing the Sockeye run with the lowest in 70 years could global warming have something to do with the reason why the black race are strange is because they shouldn't be right for another month. I think this is also global warming. I've noticed that the plants are all out of whack. They're filming at flowering and fruiting earlier than they used to so, I think anything we could do to slow this down and stop it like more Transit. So I'm in favor of the completed the streetcar connector. If only because the plans are pretty much set for that and if that could have been in the completion phase rather than a start-up phase by now I Presley Prefer options involve more flexible so they can go where they're needed to change. You can reroute them and change them, but I think we should really finish this line. Say I have a little bit of a love affair with with street car is going back decades as so there is precedent for it. Thank you. Thanks Halloween. Councilmembers, my name is Mike McQuade on the transportation here in South Lake Union. I'm here today to encourage you to move forward with a Center City Connector funding Transportation 50,000 people that are living and working in our community that weren't there 15 years ago. They think about Mobility very differently than I do and did at their stage of the game our community and our city relies on diverse Mobility choices to fuel that kind of growth and Innovation was 4th generation Seattle Light business owner and resident in our city is critical in my view. It's also very Progressive in this economy with this project where the right spot at the right time while our neighborhoods in each of our 7 districts have priorities important ones. It's downtown that we must keep moving my building outer Mobility infrastructure with a business tax fueling. What are neighborhoods need the voters understand this clearly we're Innovative in the city. We only need to look to get bring in the NHL here and the two billion dollar investment in our city that was catalyzed around that we must apply the same Innovation to our infrastructure mobility and otherwise wrapping up. We've already put a shovel in the ground on connecting or streetcar lines. This thing is clearly important and we now have sound facts to support its merits it's time to honor our City's promise and move forward with his federally funded program in this economy in the city. It's reasonable and it's the right thing to do. I look forward to your vote. Thank you. Thanks Mike. I'm coming. Colleen Bowman I don't see Colleen Jurgen Oswald. And then I don't know if anyone else to sign up after you Jurgen if there's nothing on the signs hate you be the last public, turn. All right, thank you, Seattle superheroes. Everybody loves superheroes. And this is your opportunity to be one account on your vision to facilitate his CD reliant on public transportation and not Cars any public transportation project should get automatic approval fast furious to the east side in Tacoma a bullet train from Vancouver to Portland. What a connection of hard to existing speak Chi lines what happens if you don't have Vision you build a Viaduct that separates the Magnificent Waterfront From The Heart of the City You renege on the subway 50 years ago. By the way, Atlanta says thank you for the five billion dollars in in today's dollars and in federal grants, let's not repeat mistakes of the past show Vision support. The streetcar say no to congestion and pollution say yes to Affordable transportation for all say yes to something that might be cooler than a superhero history Terra. Public on sign up sheet. Thank you all for being here, We're going to close public comment and move on to our agenda the first item on our agenda. I'll go ahead and read this one antigen item. Number one appointment 01389 appointment of Samuel Ferrara Ferrara as a member Levy to move Seattle oversight committee for a term to December 31st. 2022 Ford Welcome. We start with this quick introductions. I'm the S. Staff liaison to the levy oversight Committee of the oversight committee and tell us a little bit about the appointment and program and they advised city council the mayor in s. On responding to program and project cost savings over runs. They review as tots program and project priorities Financial plans and make recommendations to the mayor and city council regarding the name Bobby precedes. Sam is being appointed. He's a mayoral appointee at to fill the remainder of a baking term that goes through the pain from now until the end of to take a minute and then introduce yourself to us. Tell us a little bit about your background and your interest and willingness to serve on this oversight committee. Thank you for that. I'm originally from the Washington DC area. I moved out to Seattle about 3 years ago. I've always had a passion for the built environment building building nerd. Sex with that passion and I decided to study civil engineering at Virginia Tech. I got both my bachelor's and master's degree at civil engineering there after graduating. I got in the car and headed west to move to Seattle and Seattle. I got a job working as a project engineer for general contractor WG Clark Construction. We build primarily mid-rise residential mixed-use buildings everything from condos to affordable housing in to student dorms. I really like my job. I find it very fulfilling. I really see the impact it has on society when people move into their new home, but I've been looking for opportunities to serve outside of work hours. Then I saw the opportunity opening on the oversight committee. Thought it'd be a great fit. I have the technical expertise. I'm a concrete steel and asphalt nerd I can talk about it all day, but I'll keep it short but I also have the real world experience in the construction industry. I know that sometimes when a product is planned years in advance and then early estimate is done that by the time you know what time it's actually construction time things have changed and some of those assumptions Arnold whole troop overtime. Hope to take this expertise and Beyond The Levy oversight committee. I am honored to be here and I'm up for the challenge to be on the committee. Thank you. Appreciate that. Rachel you ready to have another technical building expert wanted to talk about steel and concrete on the oversight committee. We have a mix of the chair of this committee. I have to sit on the oversight committee, but mostly watch the amazing volunteers that show up with their expertise and there's a nice mix of folks that have construction expertise folks that have operating expertise of various aspects of our transportation system. And of course Hooksett abuser expertise of the transportation system and it said a real asset to me as chair of the transportation committee to have this volunteer group helping us provide oversight to this pool of money that the voters of Seattle very gratefully entrusted to us nearly a billion dollars over the course of nine years. She's outstanding. So I appreciate your willingness to serve and appreciate expertise. You're going to be able to bring and that's great. All right. I just asked one question to ask the same question everybody in the audience. Did you vote today? I got it a week or two ago, but that's all I need to know. Civic duty to thank you for doing that. We know that some people aren't allowed to vote in our city and that's when we went to fix but everyone it should be who is eligible to vote should be voting. That's great. Take all the questions and questions for us. All in favor signify by saying I thank you so much for your willingness to serve. I'm not sure if you're going to be there this evening. I'll see you in a few hours on Monday. You're welcome to attend that there's not really an opportunity to say my son Monday. So we'll take care of it in your absence. You don't make it to buy prisoners forward for that to 31895 a resolution relating to a green New Deal for Seattle establishing goals identifying actions necessary to meet these goals affirming the federal Green New Deal resolution and calling for the federal government to enact policies to advance a green New Deal. Welcome presenters. They can forward. I want to just think folks a lot of organizers did a lot of work to put on a press conference just about an hour before this committee started. I'm including some of the folks will be speaking here. So thank you all for that work and the amazing amount of community organizing you've all been doing around the potential for us to do a green New Deal. Why don't we start with I could find of introductions you want to do any on 1st, Seattle WA Banerjee climate Justice policy analyst from Puget Sound Sage organizer without Green Hope to do if it's okay and Lavinia connect. Correct me if I'm going in the wrong direction, but would be to start with the resolution and have your lawn to walk us through the structure of the resolution. It's Quite a long document. There's a lot of there's a lot of substance to it. And so do you want a few of my help frame this up a little bit and then we can ask some questions and they might turn it over to some the community members to give us some feedback from what's there and any thoughts they have the numbers and so kind of framing pulling back even further from the Green New Deal and looking more generally at what the council has done in terms of recognizing the crisis of global warming and what needed to be done over the years and so started giving General. We're not going to be exhaustive here in terms of all the legislation that has been passed by this body of regarding climate change, but highlighting that in 1992, even the council had a recognized that global warming was a crisis And I needed to be addressed and so as we have and I will not go through every single Hornets resolution listed here, but most recent made in the council firm that City's commitment to meet or exceed goals in the Paris climate agreement with resolution 31757 and which is intended to limit global warming to know more than 1.5 degrees Celsius recognizing anything above that would be pretty much catastrophic. So the city has also over the years that created the Office of sustainability environment to lead the charge on the city's efforts and also begin to create a Baseline and Victoria greenhouse gas emissions, which that work is ongoing and continues to inform our policy making and the city is also implemented a variety of policies increase minutes. Building efficiency, encourage developers to construct more green buildings and has over the years virtually eliminated eliminated all greenhouse gas emissions related to electricity generation. In addition to these measures the counseling Airhead recognize that certain communities have been historically excluded and environmental and climate change discussions and decision-making and that some of these communities have been disproportionately impacted by environmental hazards such as those located in the vicinity of the duwamish river Superfund Site to access the city has launched the equity environment initiative and adopted the resolution 31681 which prioritises people color emigrants refugees people with low incomes use and limited English-speaking individuals and all of Seattle's environmental and sustainability work. And in the most recently the city released its 2000-2016 Seattle greenhouse gas emissions inventory and noted that while still has been able to reduce its greenhouse gas emissions by 5% since the Baseline your tooth. Sage even while experience tremendous population growth over this the same time. The report concluded that the city would not reach its climate goals, which are to reach a zero net greenhouse gas emissions by 2050 at this current pace and that the pace would need to increase by Sevenfold. so that sets the context for where we are now and just wanted to scuss the green New Deal the federal level earlier this year the United States Congress had considered a resolution calling for a green New Deal which proposed that the federal government establish policies and making major Investments and programs to address climate change and economic inequality. The goal is to dramatically reduce greenhouse-gas emissions facility officer transition away from a Reliance on fossil fuels provide job guarantees and living wages and prior prioritize support for communities most affected by climate change pollution and other environmental impacts. So should I hand off to you now on you? You want to thank you for for walking through that. I'll just make a few comments and then I'll turn it over to some other committee members sit here at the table and colleagues feel free to chime in if you have questions or comments to I've had a hand in and I'm dropping this piece of legislation, but I've attempted to really follow the leader of community members who are both most impacted and it works historic Leon climate issues the more broadly to on other economic Justice and environmental justice issues, And I really appreciate the attention and focus on here the urgency that I've heard from Community about how swiftly we need to move but also the sensitivity and thoughtfulness with which we're going to need to move to make sure that the transition that must happen away from fossil fuels is also a just transition that doesn't do more damage to communities that are already being harmed and also leverages opportunities to lift those communities up in Hindi. Fills up with new opportunities in a new green economy with that when I stop and see letting you all make some comments on this and love to hear just your feedback and thoughts on the process so far. Sure, I can start now we've heard multiple times today that in order to achieve ideal Green New Deal. We need to address current and historic in justices and oh what we try to do is spend some of these confidence into the resolution as well and will read out some of them and the Nancy can take over on accountability systems. So why do we consciously move away from a fossil fuel economy? We have to create energy democracy, which means that people communities actually can't govern how they won their energy going forward. We know what the energy system looks like 30 years from now local renewable supportive not extractive. We have no utility fees. It's all renewable energy decentralized systems public transit for all which is Equitable accessible affordable to everybody Equitable transit-oriented development that does not Space people it's free and powered by renewable energy no fare enforcement. Affordable housing Housing Development that is without gentrification or displacement keeping our communities in face double up in that service that the needs of spacing housing security fairgreen jobs, which means living wage union jobs for everybody in this new economy as we transition into V have a private ehire and show the jobs are asked to move to undocumented folks as well as people with criminal records and necessary support. We land to everybody healthy food for all of which means lifting up Luke just and carbon free food system and showing food security for everybody lifting up indigenous Food Systems localized food distribution Investments Incorporated models of food production and distribution Healthcare and childcare for everybody that includes Universal Health Care Child Care that sent us rights and dignity of childcare workers and ensuring that are working. Families are supported in this entire transition process with this. I'll transfer it to Nancy to talk more about the accountability systems. I'm so like Lavinia said a lot of other folks mentioned today that we need to make sure that we're accountable to the folks that are most impacted and with this we want to make sure there's an oversight board that will follow the work and be able to help to take kind of where this work will go. And so we need folks who would be on this board who can be accountable to Frontline communities and who have an intersectional lens love me. I just listed a whole bunch of things that folks are facing up at the same time. And so we need to make sure that while we're trying to address one thing. It doesn't create some other problems in other areas and we need to have a range of folks who have different expertise to address the goals of the resolution like in Grand Rapids Housing in transit and we want to make sure that this over sideboard would be holding the city and stakeholders account. We've had many plans come out and see a lot of his listing earlier as well. And when these goals aren't fulfilled and they're not met our most impacted communities are left behind. What time to take intentional steps and to start building Collective governance with those that are most impacted? Thanks. I appreciate the chance to to build on that and want to emphasize that we know the most effective climate Solutions are the ones that work at the intersection of climate change and addressing interesting and justices we know that the transportation is our Region's biggest carp source of carbon pollution when we get people out of their cars not just by saying hey go in a Ford go and buy an electric vehicle but saying hey, we going to make sure that your neighbor has access to clean an affordable public transportation where to make sure that you can stay in your community that there's affordable housing that you don't get pushed out. We know that not only is that the biggest bang for our buck in terms of climate pollution-reduction, but those are also things that make our communities healthier and Thrive and that's what Seattle has green new deal is all about and that's what this legislation is really ain't that is recognizing that the things that we need to do right now to address the climate crisis to lead as a city responsible for some of the most significant carbon pollution proportionally of any folks on the planet. The things that we need to do right now also make this city and we're beautiful and more healthy and a more just place to live this resolution resolution is an important first step towards action laying out the vision for house yellow can begin to work at the intersections of climate and existing housing Transportation health and economic justice issues and do that. Anyway, that's accountable to Community Driven by the folks in the front line of the crisis and making sure that the people who have the most experience with these problems because they're lived experience are driving the solutions that we needs that make our whole city better for everyone. Thank you. Thank you all for your ongoing work on this as you touched on this is a start but there's a lot of work it will fall out of this. I'm calling to give you a chance if you have any questions or comments for either staff for a community members here today for myself. I have several points that I want to do now because of all the things that have helped bring the question of the green New Deal forward and I'm sure this is not necessary to say but I will say it anyway, of course as you all know my office and my relationship should be completely Donnelly support therefore you're bringing forward. But also we we are also on the front lines with you all in fighting for a green New Deal for working people for Seattle and I really appreciate I think it was Alex Hanan from 350 who said just now in public, and I'm going to be with someone else regardless that it's a mistake for people to thank God. He was the UAW member who said that the mistake for people and we have to correct this to thing that Vale. This is a global phenomenon. What can we do in? No, actually there's a lot that we could do and concretely bringing Seattle's carbon emissions 20 is not only going to improve the lives of people especially the Frontline Community that you all talked about. But also it will be it will be an inspiration concretely, you know what can other cities do work and working people and movement in other cities also achieve and that will have a global momentum. So there's no question that is extremely important and I think this is this is a fantastic step forward. Of course, I agree with you, and there's a long way to go. This is this is stating the intent of where we believe the city's elected leadership should go but then this has to be followed by the Country Action that the resolution is suggesting that we do just a few things. I I don't have any concrete amendments to bring but I wanted to just bring some ideas for words just two. Tell you where where we feel like maybe there could be some good additions are amendments are and someone but I just wanted to stay that today and then work with your office and the community members to see if they're you know things that we can bring forward together one is just in the rarest Clauses where it's at and in your London mentioned, I think it's a major issue in Fredonia, avoiding climate catastrophes. So it's only appropriate that the it's it be traced it out. At the bottom of page for of I don't know if it shows up in the same way and everybody's print out but that there's a rare as closet talks about the 94 United States Congress members sponsor. And again, this is the rarest plus it's not the most crucial thing, but I wanted to say it. Anyway, I think it would be good. Especially the point the way forward if we also included some language in. Veritas about how many people's movements and Franklin communities on the ground Grassroots movements have really lead lead on this and brought the question of green you do you forward an hour. So I think we should mention Congress member Alexandria ocasio-cortez who actually. Her presents that are combined with movements that are leading on this on the ground really put the pressure on Congress to do this. I think in terms of Explaining how is it that we are able to bring this forward? I think recognizing the role of movements and her I think would be helpful to put some language in there. That's certainly consistent with I think some of the conversations I've had. So on in section for CNN customer and you and I have discussed the senior committee very recently in section for sorry. This is not No, I'm sorry North section for this is just a note to myself to talk about how I strongly agree with advancing away from an Economy based on extraction and exploitation do one on regeneration incorporation. But actually on inspection. 8 I believe yes Section 8 I we talked about the other language years has implemented congestion pricing plan that is Equitable and creates revenues to support Transit expansion to benefit low-income historically marginalized in transit disconnect communities first and foremost. I just wanted to say that I from my study as an economist. Am I study on congestion pricing? There's really no example, right congestion pricing is Equitable. So if it didn't have the word Equitable, I would probably want to amend language remove that a dolly. But since you've put Equitable, I'm okay with that, but I just wanted to State for the record. I don't believe that there is such a plan. But if there was an equitable way of doing it, of course, I would supported but if it's not going to be a credible, that's a tough one. So just wanted to say that your comments when he's committee meetings last month about Towing and congestion pricing was great. So I think would suggest on this one is maybe ask some of the community members, and if you have thoughts today, you're certainly welcome to share those now or we can talk in the coming days to see if you have thoughts on and I'm responding council members want now or the future between now and Monday directly and I had settled going to bring up so feel free to interrupt at any point to have a discussion. should I keep going with jump to bring a couple more things and then in Section 6 which is very important. Search how to find the numbers. I skipped section 6 and 1/2 Section 8 for Seattle sewing section 6 were talking about establishing dedicated Revenue sources for the green New Deal of witches. Plus the accountability body. I mean that's the heart of what will make this into our country reality having the funds to do large going to carbon 01 which is grammatically expanding access to public transit and also the energy retrofitting of buildings because those other two two job sources of carbon emissions, I think it will be important to for us to include some explicit language about taxing big business and the wealthy and other Progressive Revenue sources because I just concretely I don't see how we will find a green New Deal strong enough to achieve. Target of 20 30 carbine serial unless we generate the kind of revenues that will be needed to do that and that we cannot put the burden of the green New Deal on the same communities that are already impacted enough rest in different ways and plus mathematically simply won't generate revenues that we would need and so if we can work together on some sort of language to bring that more explicitly forward. That would be a big rain. I think I'm I'm trying to find the right now or Okay, and then I wonder if there's some place maybe in Prairie Dog weatherization. Maybe we can also have something about City alight Lake City Light is a public entity and if if we could put in some language and I'm not very clear exactly how to do this. But greatly expanding green energy production capacity true because we are lucky enough that already an activist from a hundred years ago far to make it a public entity. So maybe you should be like for using more green energy to export to offset natural gas gold and other fossil fuels are burned by private energy companies like PSE in the region something along those lines if we could do that. And then one things one is on the in section 9 will be dark about transportation. I would like to propose that we says the language it's that is more affordable. Sorry, I'm not able to find section. In section 9 parte says make Transit more affordable reliable and widely accessible. I wonder if we could say make it free make public transportation free rather than more affordable because I feel like it the need of the hour calls for it. I certainly would like to see it and we certainly are capable of doing that. So I think that's another one. Let's tf4 discussion. It's the direction. We're certainly helping the head right and then one last one and I think this is extremely important and it came up in public comment as well in the section 10 about anti displacement just absolutely critical component as Maria and others were saying I wonder if we could arrive at comedy agreed-upon language, which organic more specifically talking about. What are the Bold public policies that will prevent displacement and maybe there's not full of women in the Disco topic need to be discussed. But at least we can put in language that says such as rent control without loopholes and expansion of social housing Republic Lyon housing, which will be affordable cuz we know that works. We just we don't have enough of it. We have you know where Malaysian Sly Capital housing Plymouth and Lehigh. It's like a trickle compared to the problem of affordable housing crisis intervention include what are the public policies that will be part and parcel of winning any green New Deal clearly done a lot of homework on the grateful for that. I know this is not something you just thinking about because of the resolution. It's part of your work on going so I'm grateful for that too. So why don't we take that list? Things and work swiftly in the next few days to get some Community feedback will work with you and your staff would like to take your input here or offline to just say what really excites me about the the resolution of the green zones. I think that's it's a quite frankly. I would like to work with you cancel a real Brian that look in the language about limiting single-use Plastics as a sitting with additional opportunities we can do I know I myself try but I would like to see the city try to pursue additional opportunities by sin examples in my time here in on the Council of how Landmark preservation has been used as a potential as a weapon against letting development happen near Transit. So maybe looking for language that might be helpful to help support that we know. That's a toy Has not been used proportionately with within communities of color and preserving cultures of Music color throughout the city equitably so be mindful that so I'll be happy to my office and your office customer Brian in terms of some language that might be helpful. And then I'm excited. I vote for for this release look into supporting how we build additional item for both what the county can do as well as the state, you know to council member so wants point about the wealthiest Among Us or the wealthy is Among Us are across the lake and so, you know, that's the way the county can can really be able to help us and in some capacity to provide I get to the overall objective of free transit or making additional that's what's in transit will need their help to so happy to work with you on some language. That would be helpful. And so What I said appreciate those thoughtful comments to comfort a coat and I am generally supportive of the ideas you bring for it also mentioned it and I'm council member herbold's committee had some conversations about zero waste and I know some committee members have expressed concerns about some people's desire including myself to ban single-use Plastics. I'm thinking of a situations like Flint Michigan where communities are relying on them on water in plastic bottles because I don't have the other options. And so I want to I am fully supportive of eliminating these Plastics, but I want to follow Community lead on that another, just to make sure they were being sensitive to how we move forward and we're not having the adverse impacts on folks along those lines. I want to just share with colleagues in the public company or a big-shot had suggested an amendment to me that I'm also generally supportive of You suggesting to add some language about tree canopy and so in section 13 number or letter J would modify what's in there currently currently. It says planning more Street trees in low-income neighborhoods and encouraging planning and preservation of more sweet pea Citywide to a change that to say increasing the trees Cities Tree canopy cover by planting more trees in low-income neighborhoods and encouraging planting and preservation of more trees Citywide and I am certainly open tag concept. I want to make sure Community has a chance to get some feedback. One of the I just brief comments. I heard was just a f f e r that that we're not putting trees vs. You know, the Lord people ability to live in their community. And so I think there's I don't think that's cancel my bike shop in tents by any stretch of the imagination. So maybe we can work on that language to to find something that encourages what I believe will be generally believe is a good thing more tree canopy. But not at the expense of of housing options and so my suggestion I guess at this point. I don't think I'm not ready to move council member bagshaw's amendment. I appreciate both of your thoughts on that and I think some some studios notes are being taking and if not, we have the tape to go back to what I'd like to do is work on language on all those fronts and get some feedback from Community will propose a set of language and get some Community feedback. I'll make sure to share it with you to simultaneously and other colleagues with the idea that we could bring a prop substitute bill with those pieces where I feel like there's consensus to the full Council on Monday and if there places where there is disagreement, then we can have additional single amendments that people could provide I just would ask folks it and I'll commit to this work through this by the end of this week so that the public will also have a chance to see what's out there so they can provide feedback and public comment. Currently we could take another week to do this that. Actually made another three weeks because our last full council meeting is next Monday, but my preference would be to move forward and pass the bill as it is out of committee with the understanding that will be working collectively on amendments to bring the full Council. Absolutely. I was going to suggest that I just one thing if possible if if it was possible to have something like maybe a first version of the amended bill that takes into account the discussion today at before Monday. So then if my office can have a chance to look at that and weigh in on that and then little bit of back-and-forth, it's necessary that will work up a draft trying to dress with split shared here in the next day or two will share that with both of you to give some feedback. I'd love to get that out to community simultaneously to get their feedback. Hopefully by the end of a fry. They can have something to share. This is my proposal at the moment so that we all have a chance to look that final draft and frankly all the folks in the public have a chance to review that to give us feedback either electronically over the phone or in person at the full Council on Monday afternoon. So the resolution today and also on the ordinance, what is the chance the resolution will discuss the ordinance in a moment and I'll be back in committee on Friday. Okay, cuz we could we could work on the substitute and bring that back to committee on Friday. Whatever you prefer night if it makes it I won't be here on Friday. I would like to vote on the resolution today. We will be working together. I am going on vacation tomorrow. Sour or so and it's a well-deserved vacation. I can promise everyone that so thank you. But yes, then my goal will be to vote this out of committee today. The next agenda item is an ordinance, which is directly related to this and would start discussing that a moment. I'm not going to have a vote on that today, but hopefully have a vote on Friday and I'm so community members back of the table on Friday the ordinance for that discussion. I want to turn back to committee members to see if you have any comments reaction to the things they were put forward here or anything else you'd like to add on the process or thoughts. You want to share. I just wanted to thank everybody for your generous support for this work. I'll Echo that invaded the process of working together in community to bring forward bold ideas and then be well received from Council Members. I know that folks in positions of Power are ready to work in Partnership and lift up those solution has been a really important part of this process. So I'm excited to see that excited to keep moving forward together. I'll add that. I am really grateful for this process know somebody look at this and say this is similar to a lot of things that we've done the city before a lot of things that I've been part of before I will tell you that it's taking a fair amount of Restraint of my own part to really step back and allow Community lead on this and not simply just bring my ideas for it and demanded that be what we build everything around and I am really impressed with the powerful ideas in the thoughtfulness and the Coalition that committee members have been building and undoubtedly will need to continue to build to be successful and I really think that this reflects a different approach to how we govern and I think that's the only way we're going to actually solve this these prices were in and so am I grateful for your commitment and times you put into the so far Two coins with that but I'll suggest is I will move. Thank you Kelly resolution 31895 with innerstanding that will likely bring an amendments to the full Council their second all those in favor. Thank you all for your work, but don't go anywhere. We're going to move to agenda item Nursery Kelly doing that in the record. 11960 for an ordinance relating to the green New Deal for Seattle establishing a green New Deal oversight board providing compensation for those who incur financial hardship by their participation on the board requesting that the office of sustainability and environment create an interdependent interdepartmental team to advance the green New Deal for Seattle amending section, 3.14.0 of the Seattle municipal code and adding a new section 3.1 4.979 to the Seattle municipal code. I'm going to skip the introductions and hopefully Seattle channels okay with that, but with all the same people here. So if you're chewing up the side of me to get injections, you can roll back the tape to attend item number to Yolanda do want to start with giving us an overview of this for me Memo ideas around the green New Deal for Seattle and so in this was already alluded to but having an accountability body was also a desire to move forward with that resolution to help implementation. So this Council bill 11960 for creates a green New Deal oversight board that would advise and support to the effort to implement the green New Deal for Seattle key aspects of the proposed board include that it would be supported by off sustainability environment would have 16 members comprise. The vate community Representatives directly impacted by racial economic and environmental Injustice has including one tribal member and two individuals between the ages of 16 and 25 at the time of the appointment three representatives of environmental justice organizations to representatives of labor unions and three Representatives with experience in a greenhouse gas reduction and climate resiliency strategies relevant to cities and their residents such as a public health infrastructure sea level rise extreme weather events terms would be 3 years with a limit of two consecutive terms and numbers for him participating on the board prevent a financial hardship would be eligible for compensation at a rate of $50 per hour. The proposed legislation also request that the office of sustainability environment farm and interdepartmental team to implement the green New Deal for Seattle and to support development of individual climate plans for All City departments, the eye Duty would include representatives from the Department of Parks and Recreation Seattle Department of Transportation Office of planning Community Development Office of housing Seattle Public Utilities, Seattle City Light office of Economic Development Seattle Department of Human Resources office of Emergency Management Department of neighborhoods. The mayor's office city council city council Central staff and others as needed. Also noted is that each departments climate plan should include targets and metrics to monitor the city's efforts to achieve decarbonization by 2030 office of sustainability environment would report on these plans the council by July 1st, 2020 and provide progress report annually beginning in 2021. The interdepartmental team is also expected to meet quarterly with the oversight board on the development of these plans as well as policies programs and projects related to the green New Deal for Seattle specifically, it does request that any legislation. That would be coming to council be brought to the oversight board for consideration prior to transmittal to the council. Some of the in terms of the potential impacts of the creation of this new oversight board as well as some of us know this city has many boards and commissions over 70 at this point, but this one would not be duplicative as we do not know we do not have a board that is dedicated to the issues of climate change and front like these Frontline communities impacted by the changes. And so that is would be unique to this new board and noting that where additional expertise is needed this oversight board May enlist the assistance of non-member experts. So pressing of task force where they include others on specific maybe technical recommendations or other boards and commissions such as the Seattle Planning Commission if there is some land do you see interest In terms of physical impact off of sustainable environment currently indicated that it has a capacity to support the formation this board but may likely need additional staff to facilitate the development and implementation of individual City Department climate plans, assuming that all not all City departments would have the necessary capacity or expertise the financial hardship compensation for Bard members could be up to $34,000. Annually, assuming all 16 members meet eligibility requirements. As in I just mentioned the proposed interdepartmental team would it include representatives from numerous City departments, and we're not really quite sure that time whether these departments would have a capacity right now to engage in this or absorb this additional work and also depending on what is that have brought forth in terms of the climate plans work may need to write reprioritize and additional resources needed and finally just noting that establishing an participating on the interdepartmental team in developing and implementing climate plants and other aspects of the green New Deal for Seattle would require shared commitment from the executive for this effort to be successful and ongoing so that if this proposal is adopted the council would likely need to appropriate resources to the office of sustainability environment during the 2020. Budget deliberations for the board member compensation as noted and possibly to support the work of the proposed interdepartmental team and Aunt future years. There may be other resource needs. Turn over to committee members once again and see if any of you all would like to provide any comments or he died to the oversight board. And your thoughts went into creating this again. This proposal is Marcy driven by community members have been working with my office. I talked about a little bit earlier, but I also wanted to bring up that I coach are the environmental justice committee and doubling is also part of the committee and I just want to let that I we would like for the committee to be part of or work work in partnership with a green New Deal over sideboard and I also want to bring up that you know, it's part of being on the environmental justice committee. We've seen a lot of miscommunication between City and community and have seen where we have alignment and goals, but then the outcomes turn out different so we really want this to be an opportunity to have but a relationship between the city and the stakeholders. I cannot breathe. I think one of the most important functions of this committee will to make this will be to make visible the cities climate work and I'm in the way that the city is starting to transform how it address is climate change to be action at the scale of the crisis action that's rooted in equity and Justice and then action is rooted in the needs of community is most impacted by being able to bring together an inter-departmental team. We can start to create new kinds of conversations at the city for moving transformative climate action for it and doing that in a way that's directly fueled by the experiences of community members who are the task force on the oversight board and are representing the experiences of communities full quest. In fact about the climate crisis and the transition away from Dirty fuels is really critical. So I'm excited to see this move forward as an opportunity to continue creating more transparency and Community accountability and to lift up the good work that we will be doing together around Seattle screen, New Deal. One last thing I want to lift up a gesture said I think the interdepartmental team will be really important piece to this because again, I think that was part of why the environmental justice committee had struggled in the beginning to be able to work with different city departments because you know, a lot of things are going on in the city and we don't always know what the opportunity is r and so it was really hard to filter out what areas we could move on and what was really there for us. So having both together would be really really huge to this process. We've been sharing language and drafts with the mayor's office and have a really productive conversations today that she's not here to provide or comments or vote on this so it'll be important for continued conversations and I'll commit to doing what I can to the city council members and elected official the city to work with the mayor's office and obviously committee members will Continue their conversations with the mayor's office in the apartments to build build that commitment and accountability so that hopefully we can get the whole city aligned around this and bring the resources necessary to be really successful. Colleagues do you have any thoughts or comments on the creation just to remind folks so we would this would set up again rebuilding today, but will be back on Friday. This would set up this oversight board defines is more detail about how long the appointments are in who would appoint which positions in all those things. You can read the ordinance but generally, you know, 16 community members representing the broad areas that were discussed it also would Creasy create a green New Deal fund that there is not actually going to be Revenue in that phone right now, but obviously if we're going to be successful this will it does not create the fund at this time? Because we don't get your interested. I might be interested in doing during the budget this year. Excited about it. So anyway, if you have thoughts now you want to share to bring ideas to table. I know you're not going to be here on Friday. So if you have any, so that and I believe you also have a comment on the resolution we just passed so I strongly support the building accountability and in every concrete Manor appreciate Community organizations coming with a vision if I might sorry this is the previous agenda item, but I appreciate your Indulgence. I forgot to bring up a point that I think is extremely important for us in terms of really building a strong movement towards winning some many of the things that we are are are are components and that in section 11 in Part B And it's a relates to CND as well. So just again general idea. And with that is too. I think I believe it is important to stepping away from the resolution language for once again. I think it is extremely important. In fact, it's an imperative for environmental and Community organizations and the labor movement to work together on this and we know from our past experience that the point of you are not aligned and I believe it's our movements as I said the moral and political imperative that we do our best to build at Unity, but I think that requires some work and I think the language we put in here will make a difference and already there's a lot of excellent language, but I want but I want things Is it agreed that I want to do just made my thinking is in beef example in 11b set investing in job training programs that accept workers with necessary skills to compete in the arena calling me with the priority for workers. Whose jobs going to depend on the fossil fuel industry. It's 30 minutes grade language do tank that and being a member of the labor movement self and having had many many conversations with people workers or an organized labor in the fossil fuel selector. I suppose, you know, we had many conversations. For example, when we pushed for the no LNG resolution and many of the indigenous leaders who fought for that are here in during that time, you know, we try to bring labor and Indigenous community members and other in the united by middle of the organization's together. I know it's clear that there was some work to be done on that and so this is an example of where I think if we spend The language I think it will help us. So rather than saying giving the necessary skill to compete in the green economy with a priority for workers. How about saying something along the lines of you know, what you was for, you know expanded for aggressive driving used to expand a public sector job training programs and clean energy jobs to provide a just transition to workers employed in the fossil fuel industry rather than saying they're going to have to compete of course, you know on the basis of capitalism workers are competing for jobs that are not just in numbers enough, but I think if we're going to see if we can say that the green New Deal movement in Seattle is really pushing to bring the labor movement also with us because I don't think we can win without me know without bringing building on Unity then can we have language that will make it very very explicitly clear the bear We're not putting one section of working people against another section of working people that we want to bring everyone together. And that does mean that we are absolutely going to fight for a just transition of jobs in a concrete is so that we don't make me don't Empower PSN corporations by allowing them to use workers against workers by saying what where why should I buy for a green new deal, but I'm not going to have a job at the end of phasing are fossil fuels. So in that sense, I'd really love to work with you and language. So that's why don't we simulate a pic that language and see what we can drop top for if you or your team come up with language before and let us know too. So I before E shut down an agenda item I want to thank you all for being here today. Thanks for all your ongoing work will see I don't know I mix if you all are other community members on Friday, but look forward to that conversation, too and hope to have you back in Council on Monday. We haven't voted. appreciate that Am I reading the next agenda item in please update on the transportation Equity program. protect your $5 welcome everyone. Thank you all for being here. I'm looking forward to this report. Why don't we start with a quick round of introductions and Naomi if you don't mind starting, that would be great. Amy Joyner the transportation Equity program manager sounds about white director. Welcome everyone. Why don't you just go ahead and jump in and I'll let you guys drive this presentation. And if it's okay counseling Pacheco and I will ask questions as we go along sounds good. We're going to go I think a long and it practically back this way. But since I was here last week talking about our rsji and a green Contracting I thought was important to sort of Tyler's together with some of the larger Equity conversations that were we're helping to convene and no man on you've been doing such a great job. So I mostly here just to support them and show my support for their all the work they were doing I'll take us off and then I'll head over to our wonderful Transportation Equity team. As many of you sing before I values are foundational to work at one of those core values being equity, which I hear a lot about today in the presentation. The team will be providing you an overview of the program highlighting current pilot programs underway And discussing are in a engagement efforts both internal and external test. By means of background the transportation Equity program is in alignment with the cities raise in Social Justice initiative and is working to ensure affordable accessible and sustainable transfer transportation for variety of communities in several actions several legislative actions have led to the growth of this program over the past few years including resolution 31773 where cancel confirm their support for the transportation Equity program and estas approach to that work. Addition in the development of the Seattle Transportation benefit district. Will you set aside $2000000 an annual basis that goes to improving low-income access to Transportation. The program is continuing to involved with Anya and Naomi's work and we're coming we're focused on community Saturday engagement and building the transportation Equity agenda, which is right, which will be our framework for transportation Equity goals and priorities for us at work and I'll hand it over to the team to tell you more about that. We're working on great. So I'll just give a brief overview and then we'll talk about some of the new pilots and and what they were doing we can't focus our conversation in that but before I do that, I do want to acknowledge and thank members who are sitting here in the front row we have is we who is one of our co-chairs for the Temptation Equity work group who is walking in and he's also our coach are for the transportation Equity work group. So we'll talk a little bit more about that and then we were Also, welcome coming back once the recommendations from the work group are solidified but we did want to have them come and at least have you introduced to them and that work group was formed about two months ago or so, we can talk a little bit more about the process that we'll talk about it in terms of the I guess Genesis and the work that we've been doing within the transportation Equity workgroup ultimately. Our goal is to provide information as well as resources to low-income communities color and to Refugee immigrants and a whole host of Frontline communities that have not traditionally benefited from Transportation investments in our city and our region, and ultimately we want to provide resources for safe affordable and accessible and environmentally sustainable change the transportation options. So very aligned with Just heard about in the green New Deal. We have served three areas of work that we've expanded into obviously. We've done a lot of low-income access to Transit programming which will talk about in a moment. But we also with the capacity of that we've been able to add to our team with Anya Penn tech training last year. We're doing a little bit more policy advisement and of course as our office of equity and economic inclusion Plushies that we're working closely with them as well. And then we also have this engagement strategy which will talk about so that's on you as well in terms of the low-income access to Transit programming. We have sort of three areas of work that we're continuing to do although we'll talk about some of the changes to some of that as well. So we continue to provide resources for Transit specifically, we've done that. If you are providing Orca lift resources, as well as now moving into a partnership with Seattle Housing Authority, which we'll talk about but basically were forming Partnerships in providing resources to not just the community, but resourcing Partners as well to provide Direct Services, and we're also we've been working with a number of community-based organizations and the department of neighborhoods to identify Community groups and organizations that are already talking about Transportation, but are looking and seeking to be more I guess supported so that they can do this work, and so we've we've been able to add to Resource those groups and we'll talk a little bit about how that's shaping up for this coming year. And then we continue to work with the Department of Human Services. And they really administered the vehicle license for your car tax rebate program which qualifying people they pay other car Tab and then can receive a $20 rebate. Outcomes and we have the year 3 and we're actually working out of the year for a report. As you know, that that ended June 31st. So our performance year in terms of outcomes from your three, which we have we have aggregated in a report. We basically continue to see Orca lift enrollment. We had provided pre-loaded Orca lift cards and collectively in year 3 we had about 20% of the eligible population. So that is of all the other lights that are eligible that have been enrolled and I believe for all three years. It is 58% of all eligible people are enrolled. So that's that's collectively so and then in terms of the vehicle license fee Uribe, we have so far collectively had 14247. and asked you three, so we'll have new numbers coming out in the air for report and then in terms of Are pilots on so we as I mentioned we've been learning a lot about the work that we've been doing in terms of orca lift distribution and enrollment and we threw the Seattle Housing Authority had been working with them and partnered and started in it was in style. We launched in June a new pilots where we are testing essentially a distribution models for getting 1500 Cards into the hands of residence. And that's a free unlimited card for a full year. And so we are at this point we're six weeks into the pilot and we have the number is actually at 42% distribution as of Monday. So as of yesterday and we have a couple more weeks to go for the distribution. We have one model where it's In-person event-based appointment based approach and then we have another model where we're mailing the district mailing the cards. So more to come on that we have not done said of the full evaluation, but we look forward to sharing that when we have results are we targeting sha facilities where everyone who lives eligible or do they have additional eligibility requirements? I need to make within the building of the area median income. And so and it's also pre-selected sites. So we did an analysis as to where we would start out. Look at these phase the distribution for this 1500 cards and then it's also 19264. So ages 1964. We kept it in Paradis. It's not exact but it's in parody with Orca lift so that if In the event the pilot did not continue and was not expanded there would be an opportunity for Orca lift eligibility for these residents. So what is it, do we find the most of the residence in them in the building that are overqualified because their income or is it just depends if people are for their eligibility, I would say the majority of residents are 30% but we do have the 1500 that was how much we could have we could afford to fund but we are finding that for sure. Sha has the highest percentage of people who are at 30% Below in the city, which is part of why we decided to go with them. And I'm going to turn it over to Anya he's going to talk about a new pilot that we are going to lunch that focuses on Aging adults. Yes. I'll talk a little bit more about this pilot, but this pilot focuses on a more deeper engagement strategy in terms of working with the senior population last year. There was a lot of learning is in terms of through our one-time kind of events at food banks working with seniors in that way and we realize we need to do a deeper level of Education enrollment. And so this year with the city of the city of Seattle Human Services Department Aging and Disability Services. We are partnering with selected Senior Center sites to train their social work providers at the site who ready to have relationships with many of the Aging adults being served there in our goal is to provide around 200 + aging adults with a monthly region reduced fare permit, which is the reducing your fare program, which is run by sadek beliefs of Gina 16 different Transit agencies at 4. Enterocytes, the senior centers were focusing on we looked at sites that serve for Donnelly seniors of color and we looked at geographic region. So two of the larger sites have greater capacity in terms of they have more social work since social workers and counselors on their team. So that includes Asian counseling referral services and international drop-in center soacra, what is base in the on the MLK Rainier Valley area and then I D I see is war in the South Beacon Hill area two of the smaller States is Lake City Senior Center are the only have one social worker on staff. And right now we're waiting to hear from South Park Senior Center who also has only one social worker as well until we get our goal is to read that education and it said that they have the knowledge and our power to be able to educate the seniors on not on a relief to enroll folks into the region reduced fare permit, but also teach seniors to on how to use their permit to ride. And it's really an opportunity for us to learn a little bit more about aging adults Transit needs. There's not much information that we know regarding how many of seniors learning about their RFP program how many times they're using Transit? So it's really an opportunity for us to dig in that a little bit deeper. So timeline wise were planning to launch in the fall of 2019 right now. I'm forming up the sites and coordinating trainings with them in partnership with hopelink in King County Metro in the senior center sites as well as the pilot will end in 2019, and we've built in surveying component as well as a focus group discussion as well with the evaluation happening in early 2020. The other Eisenhower parking on is youth Focus ambassador program the last year we had the ambassador program as well where we work with four small community-based organization in the Seattle area to roll out a transportation Equity related project within their community and what works best for them is really their choice. And so this year we really thought it was an opportunity to partner more with you space organization and get a get an opportunity to learn a little bit more about what used transit challenges and needs are so this year we will be providing to use space organizations with funding to develop their youth face a face storytelling engagement and project to learn a little bit more about their experience with transportation and it's opportunity for us to learn a little bit more about the needs of the use but also where future Investments and programming can go and right now we're in the process of confirming this work with red Eagles. Which is a nonprofit organization focusing on working with Native youth to do Performing Arts base work with youth and then with Wii app app stance Iraq prison performed working with used to build public speaking engagement skills with that were looking to also launched NFL 2019. I've been in contact with the organization's information that work up. The pilot will end in 2019 and will be planning to do an end-of-the-year event. Hopefully in collaboration with office of arts and culture the pink Street Station and then evaluation again in early 2020. I'm a bit more about that program. And so in addition to all the pilot where I can the evaluation and how that will inform, you know, the way that we feature programming at we are also deeply engaged at this point in an engagement strategy that is both internal and external and I'm going to talk a little bit about the internal peace and then Anya discuss the external piece of all of this ultimately is going to accompany me into a transportation Equity agenda. So what we learn from the work that we're doing in terms of pilot and then the engagement strategies internal and external will ultimately inform the agenda for the department. So in terms of the internal engagement strategy, we are I guess it was in October of last year's a 2018 Executive Inn senior staff recommended and advise as to form and introduce rental transportation. Team, that would be comprised of staff from across the division because Anya and I are two people and we don't know everything that's happening in the department. We really needed to lean on proxies from other divisions to provide us with content and context and as we're having the external conversation with community members, it was a way to create a feedback loop and bring both the concerns as well. As you know, the ideas to the division as well as as bringing responses back in like a timely manner so that team was from that's over. It comprises about 30 somebody has about 30 folks from across the department. We meet on a monthly basis and their charge is to really support us in terms of the transportation Equity staff as we work with the external group as well as in terms of you know when we have Different pilot ideas or what-have-you we can bring that to the group. They also are very involved in developing actual materials that support the community work boots learning. So Anya are coordinator. She really works closely with each of the division proxies to develop a transportation Equity curriculum. So it was really a 101 in terms of what department does and providing a bit of a grounding in Foundation of our core work. And then also what are Equity goals priorities and where there is a lineman and where we might need to do further alignment towards his goals. And then finally they provide guidance and review they will provide guidance review on the community guided recommendations that come out of the transportation Equity work group and ultimately will help us really tie the agenda together. How many members on the ITT people as sure but I will say it's a very engaged in really really awesome supporting for an apartment supporting their people to show up and it's great to have workers that who undoubtedly have very few plates already and you're showing me this works out nice work. That's great. I still turned it on yet to talk about external. Yes a little bit more about the transportation Equity workgroup. This is a very new work group for esta and it was established in Spring 2019, which is one of the events that you had attendance. So we started in April of 2019 as their first kind of onboarding process which all Taco bit more about but our work group includes 10 community members who have both personal and professional affiliation with currently are historically marginalized communities in the Seattle King County region and Is Naomi mentioned two of our workers members are here they happen to be are co-chairs as well. And they've been providing a lot of great leadership to the group. We have Steven Sawyer with po can also known as Colour against me. It's not work and then rizwan Risley with Muslim Housing Authority. So I just want to thank the both of you for attending would also for your continued Guidance with the word group. And so we have an amazing group of committee members in addition to Steven Steven and respond to of our work group members also sit on the city's environmental justice committee as well as the Equitable development initiative committee as well. And the reason for that is we know Transportation has come up with in those respective committee. So to ensure alignment in to ensure that their expertise are brought in we brought them along in the work group as well. And in the remainder of folks come from a variety of organizations and Express Personal experiences as well and actually the link at that. I'm over there has a little bit more information about each of our work group members and their bio and the image on the right actually is of our little field trip to Tri-City Park where we got to hear from local artists Angelina Villalobos talk a little bit more about the intersection of Art and public space. So the charge of the workgroup it is a one-year workgroup their charges support to support the divining of Transportation Equity. So as we're having a lot of internal discussion as well, it's key and important that we are also engage in the community with what does transportation equity mean to them and to their community members opportunity for work group members to engage with one another as well as us and also their charge is to develop communities guided suggestions for Estes Transportation Equity agenda. So and that that is their main role for the group. I'm a kind of mentioned that they started in April. We spent the first two months on boarding our worker members who they think it's really important to ensure in order to ensure that workers members are possible in their role to have a good onboarding process. So that is the curriculum that Naomi had mentioned so we broke it up. I call it s. School but we broke it up into two days cast member Bryan attended the first day where we fought focus on as stop Foundation of Louisville information like budget policy. What's a master plan II a focus more on operations some projects and so the work group member is got to hear directly and engage with us. Stuff we can fit everything but I think we didn't the best that we could during those professional cement. We didn't exercise where we asked work group member is to identify what are Equity areas of interest and concerns in the community. So as they were learning about the things that fall with an s. Purview, they continue to add on into this exercise and from that I pulled out he seems that popped out. So these are the eight key scenes that were identified from these exercise. So they include safety Transit access Economic Development land use housing and displacement commune gagement participation transparency decision-making Mobility Transportation, option and infrastructure planning and maintenance. So from that I shared it with the work group members, we all they all contain content senses that yes, these are the topics of interest and so they decided to break off into subcommittees so we meet monthly but we also have some coming days that me about three to four times for the work group and sew in with the leadership of the co-chair and we've been having the subcommittee. So this month we're focusing on Transit access and I should mention that we are in coordination with King County Metro as well. They are working on their Equity mobile. Buddy from work and so some of the topics are actually very much overlap with theirs and we're working on getting our coaches together to me. Cocheras, it sounds like you're quite busy. So one. Thank you for your commitment to this work. Thanks for being here committee to and I'm really Grateful Dead first meeting just briefly but sounds like a lot of amazing work happening and great to see both the robustness of interdepartmental team, but all of the overlap on the workgroup to you know, so much of the work we do at the city and it's just a big and to do with lots of things going on and it is related like you both have said and making sure we have those kind of individual connections to help bind that we're together is is really powerful. It's not easy to pull off just because people are stretched thin but clearly folks decided to dedicate a time to visit. Thank you for doing that. All right. So I think I kind of talked a little bit about what the strategy is. But basically within s. You know, we have the entry Department of Transportation Equity team. We have this external Transportation Equity work there but together we're going to be working to form the transportation equity in gender. What is and also identified on here. Is it for off also obviously working with her office of equity and economic and then we also have through the transportation Equity work boots connections to the environment Justice Committee in a big circle. And in terms of next steps, we will continue to to convene with the transportation Equity work group as well as IDT. The agenda we are looking to have a draft that are recommendations by December and then you know Working to finalize that internally at the other department in the spring of next year. And then we we are and will continue to move on with our Pilots or opportunity pilot with sha and then we are launching. I'm sorry that it's through June of this year through June of next year. And then this fall we are launching both the Aging adult with human services pilot as well as the ambassador program with these organizations that will run through the end of the year. So it's a lot of work a lot of progress in the last year and more to come in terms of evaluation and what the future holds but really looking forward to the work and thanks for all of the support. I was just personal thank you so much. This work Sam preciate your leadership these types of efforts don't happen. I get off the ground without clear Direction on the top. So grateful to you create for the mayor durkan for making that happen. Also wanted to thank both of you for your ongoing work and Candy to your rolling fighting leadership there to the previous two agenda items were talking about a green New Deal for Seattle transportation is our biggest climate impact and you clearly have highlighted the equity issues around transportation. And so those worlds are going to collide or bumper overlap relatively soon. And so want to just keep an open dialogue as we continue to do work both this year and Beyond to figure out how we integrate that that commitment and the transportation side has been so much work that happening in transportation that this doesn't really restart it or anything. It's just how we keep building on it and I think Especially with the inequity focus and centering the voices on the front line and you know, the concept of the green zones of the idea of these communities most impacted being worthy of the first investment. I think it's consistent with a lot of the work you're doing and really like your input. We made it happen to some of the resources that you guys have created to internally and externally if that's okay. You know just add that, you know, I think again that having 30 people from around the agency shows that there is tremendous Grassroots hunger within the agency and then engaging on these issues. And so I think it's it's been great work that Naomi and Ani I've been able to leave desert of build the foundation of what was how were talking about this and and what issues that the link to community and and community definition of challenges and solutions that we can build into how we think about it going forward. So it's really leadership coming from throughout the organization. Thank you notes. and I figured thank you so much for your ongoing work on that are really appreciate your work appreciate the opportunity here presentation and before tomorrow together. Kelly would you read the next agenda item into the record and ordinance relating to the financing of the center city streetcar connector project authorizing Malone of funds in the amount of 9 million dollars for design of the streetcar amending ordinance 12572 for which adopted the 2018 budget including the 2019 to 2024 Capital Improvement program changing Appropriations to the Seattle Department of Transportation and revising project allocations and spending plans for certain projects in the 2019 to 2024 cfp. Let's start with introductions Calvin Town Council Central South. Go ahead Saint Andrew's yourself once again. Thank you all so much for being here. We had a good discussion last week both looking at the existing operations report back but also this proposal and so I'll take a moment to talk through that Calvin gave you a little Direction last week and then I get a council briefing and some questions came up. So I really appreciate your work on that memo. Do you want to start in with that be great. I'm just at that during last week's meeting you ask for information of what we know about the project. And so I have a memo that's attached to the agenda now to try and summarize a project and I won't go through all of it, but I'll just highlight some of the key issues that you asked about. So in February 2019 esta presented the most updated cost estimate for the project. And so that is the latest information The Proposal in front of you with authorized $19 more to further design and Sir flush out. I'm cost estimate it would include addressing the issues that were identified by they KPMG report, but I would also include going back and looking at their procurement strategy value engineering other things that might change the actual cost of the project of how they would deliver it. So we we should expect a change in the cost estimate, but the February cost estimate is the best information we have to date. At the time it starts had updated its ridership estimate based on a new model run in 2018. And so table one of my memo shows the projected annual ridership that compares the existing Standalone South Lake Union in First Hill streetcar system with a Consolidated system that has the center city streetcar operating as a full Citywide nutwell downtown Network. The change is from 1.73 million Riders modeled for the existing Standalone system to 5.7 million routers for a Consolidated system about a 230% increase in ridership in terms of how that compares to what we see the observed ridership last year. They start reports to combine ridership of about 1.67 million. So it's on the same order of the of the model by ridership. And the revised modeling and projection folks had previously talked about her in public, today about 20,000 Riders on the center city Network. And this these numbers are a little low in that is that just new model more data existing system or It's a new model but it also does not include visitor kind of trips. So I think that it was about 3,000 in the previous modeling so I could explain some of that truck at a party. It's new and so does it not include that because the FDA doesn't want to see that in their data or is it just something that's hard to model? I think maybe both actually shared it with him and from my understanding reading through the history. They've been open to it and turn tub including it. But we just wanted to be clear and clean with with this information. I appreciate that sort of in the numbers and it's still pencils out. It's a good project from the FTA Grant perspective. But I also know that even with this this model run is still higher than what we see observed today. So there is where that other. Where are the models are not always accurate, but they're often the best tool we have for some of these some analysis and you want season with a 2019 build year hypothetically and predicted that 1.73. We are at about 1.1 million as of the end of July just in terms of our ridership this year. So we are tracking favorably with that 1.73. We were a little bit below it in 2018, but it seems like we're in the ballpark it with what we're seeing out there to observe does not mean that you should not expect it to match up but it is on that order of magnitude or everyone we talked about it the last evening as well as that fair Revenue isn't we should expect a direct one-for-one increase in Fair Avenue and part because we expect more transfers to be parked with driving ridership, which reduces Paula Faris split. So that will Effexor the operational cost drivers for the for the project. The ridership will be strong. But that doesn't necessarily mean that the fair Revenue will increase at the same level to nearly triple ridership. We shouldn't just in the back of my head doable triple Fair Revenue because sooner in a lot of the transfers where we split. Correct the modeling that we've seen for then we could probably get into this the operational costs. Is that make assumptions based on that. I would have to get back to you. But exactly how they calculated the Opera. It's it's it's a much higher. I have some numbers that talk about how they get there. But I'm not sure we really checked it too much against what's observed operating Revenue in terms of Kappa cost the cost estimate. We should remember that. This has increasingly from the initial project. 143 million the current project with utilities to cost 285.8 million of 208.1 million that is the transportation element to the project and according to compared to the resources are identified in the budget. We still have a lot of 65 million dollar gap for transportation. The adopted budget include about 45 million dollars of future Bond revenue from commercial parking tax revenues. That would be earmarked for the project. And of course they are. Has a 75 million dollar ft a small scratch scratch that's in the works as well as a 7.3 million dollar congestion mitigation and air quality Grand. So those are the available resources in the budget that were identified for the for the project and that leaves a 65.3 million-dollar Capital funding Gap. So when I I shouldn't be doing this math on the fly. But when I add up the 7.3 to 75 in a 45 and the 65, I don't get to 208 that is their expenditures. We've already made today that are already in there to expenditures to date as well. Yeah, so that that's resources that are in the future that could potentially be reallocated two different things or would go away and not come to the cities. That's why I was trying to make the distinction between fish get your money and fast money money as. Suspended almost 45 million dollars on the project. So this includes about 12.9 million dollars a project cost that would be eligible for reimbursement from the grant funds. Essentially expended the use the appropriate authority to spend the money, but with the expectation that have TA or the CMAC Grant would pay it back. So if the project were not to move forward those costs are still on the books, we would have to find where in the budget we would offset those cost. 12.9 million that is already been spent. In line with that question about what would it take to to if if we were to not before the project would be the financial impact of that are there is also termination cost related to the vehicle procurement contract. We don't know what that cost would be but it's just useful to know that the cost of date on that project. It's been about 5.4 million so some I don't want to speculate on what it would cost to and that contract but that's how much has been spent on that contract to date. So we spent a little over 5 million dollars to date on I assume those are deposits on vehicles which we have not accepted yet. I believe there's a stop-work order. So they're leave accumulated some parts and they're sitting in a streetcar Warehouse somewhere waiting for us to say yes or no, but those costs we already spent in there likely be additional costs. We've had legal pretty things which not appropriate to discuss here, but we understand that there's work being done there. It's right. There are some utility portions of the project that are also not fully recognized in the budget because the utilities are in the right way. They would have to pay the fare utility portion of that project to the transportation project moves ahead. So this about 22 or 23 million dollars to be told to cost there that are not currently identified person identified funding Gap. So if the project goes towards the utilities will have to figure out in a future budget proposal to either shipping spending on other till the project or potential. Country spray pressure. Address of operating cost again. This is another issue that has changed since the project was initially proposed to counsel the initial proposal didn't require any cities got to do you but it is estimated that other revenues would be available jobs at the full operating costs be in February 2019. The new estimates show that there would be a required ongoing annual subsidy of 18.1 million for the first year of operations. And that is for the entire street car system including the first Hill and South Lake Union Street carbs. This change in the cost estimate was driven largely by reconciling what the operating cost for ring. The system would be you may recall that video reports around the time when the stop work order and then Tina Turner Revue highlighted some discrepancies between King County Metro operating assumptions and what we exhumed in our project budget. I do remember that. This is largely in reflects the discussions with King County Metro a Reconciliation for past performance of the streetcar has really changed the operating cost for the South Side speaker Network. In addition. It also can you estimate also recognizes that Metro and Sound Transit contributions for the existing lines won't extend to 2023. The biggest one is the five million dollars. That sound transit is paying for the first Hill streetcar operations, and that ends in the end of 2023. To let see the determination of the Sound Transit is working through a policy decision here the termination of the Sound Transit support for the streetcar that's independent of whether being billed the center city or not. So that is certainly an operational cost. It will either need to be negotiated or absorbed by one of these agencies, but that's an ongoing consideration the regardless of whether we move forward and not that I know that's something that will have to happen. This is the system-wide operation subsidy Calvin to have a sense of a how that compares to just the existing few lines so table for does that comparison it looks outside the difference between the no build stand-alone south of Union and 1st Hill estimate and not requires a city subsidy in 2024, which is the closest projection that I can find that matches up with. If you drop reactions of 12.8 million. So even so between the two you'll see it's about a five-point give me a 5.3 million dollar difference in the required City subsidy. So in terms of it is increased operational cost that is offset by a 230% increase in anticipated ridership farebox recovery. And this is the point you said, maybe you want to do a little more work to see if that number significantly off based on the splits with with transfers why I think the I think the the estimate is is sound in terms of how they get to what the opportunity cost is, but in terms of maybe serve ground checking out a little bit to see what what that would mean in terms of prayer box recovery does not line up with what are expectations. I would like to do a little more research 88.5 Million number And I would just add two things. First of all first of all, it's the sign of a really well-written memo that your question gets answered by the next table in it. And I think you did a great job of putting all this together that II on the operating costs. The other thing that's in here encounter noted that but the 1.5 million dollar ongoing contribution from King County. We assumed in in the February present estimate did not continue through the negotiations of a new interlocal agreement. It seems like that will continue at least the next five year term. So I think this is all this is all a little bit still in flux and some of the work that will be doing over the next year would look at operations in a bit more detail and make sure we have a really sound operations planning understand what those full costs are. What is the operating subsidy from the recently to go see happening subsidy from Kenny 1.55? What's the theory behind that and how we know how might the city portray itself going forward with an additional South Lake Union streetcar? And as I remember it it was because there was a reallocation of Metro bus service with the opening of The Sound Transit light-rail is part of what was going on. So as part of a larger route restructuring there was a commitment of some County resources towards the operation of South Lake Union Service and the service started in 2007 or destruction start in 2017 country my service started but around that time to 10 so it's been in the operating contracts with King County Metro since then and the current contract ends at the end of this year. So if there is a negotiation to keep that in for another 5 years then that would that would extend it. I think at some time at some point in the future it larger. we can figure your shot service could change but that kind of looks like I imagine that would likely coordinator restructure of service to Not Duplicate service imagine that work has not been done since we're not even sure if we're building it and if we all go away and so there might be a similar discussion in future years about how we might have some support from them so much and sounds like the first conversation, but obviously the question marks around that I appreciate kind of the conservative approach to say This assumes that they tell it wouldn't happen what comes on line and I recognize it that, you know, maybe we'd have 1.5 million again. They have 3 million because of some of the restructuring that happens downtown. So Okay, see you receive this is great the current Budget Suites but it does include about four million dollars of annual operating support for the streetcar. So we do have sort of a baseline in the budget but significant escalation over time, so that's going to be really the different. The question is how we can fill that operating Gap in the long term. I think it gets us to the the proposal it's in front of you as far as requesting 9 million of additional resources. The 9 million is anticipated to come from revenue from the Mercer Mega Bloks sale, and in order to because that sale is not likely to close for some time that the proposal is to funded through an inter-fund loan against the information technology fund which has the resources available to do so, I noticed that the South Lake Union streetcar when it was constructed and Beyond operation light on to enter fun loans that are still on our books for about 8 million dollars. There is a about a $300,000 a year annual payments that is budgeted to pay down the capital loan. And the anticipation is that the proceeds from the copiers Northwest Dexter property will pay off the operating loan. My metal actually in correctly. The properties mixed up but that is the property that will pay off the sound machine operating loan. So in the context of what happens what are the questions you asked was what resources could potentially get freed up if this project we're not to move forward. It's a little bit of a this is very high levels of inflammation. But if we assume that available property proceeds could take care of the existing 12.9 million dollars of expended funds as well as that whatever amount is necessary to get out of the vehicle contract. You essentially have 45 million dollars of capacity to build are the transportation projects. All right. So if you have any high-level questions and welcomed now, I have to go to come to go into some math questions here in a second, Let me just going to get a little more clarity in terms of the timeline with regards to you know, specifically associated with the addition to that when we can expect Pennsylvania proposed spending plan for both construction operations. So yeah, let I'll let Eric get into the details on that. I think first of all one of the early deliverables if he will we are going to be preparing a new Consulting contract this fall negotiating that contract and getting a scope setup will be probably towards the end of the year nearly next year. We'd be able to give you a better schedule in terms of when some of the major Milestones are coming along but my summary would be some of that some of the things you need be looking for in about the second quarter of 2020 would be results of the structural analysis of the bridges on Jackson Street. That was one of the higher-end costs of the additional work that's needed for the calf vehicles. And the other one of the other things would be the risk assessment value engineering that we would do early early on. So again, probably the second quarter we'd be able to report back if there's anything that really stands out that really makes a difference in that cost and then we really get into towards the probably end of the third quarter or or even fourth quarter with the 30% plans and those updated cost estimates for the project. So, you know Sam United chat about this week we came in some other time line somewhat and you know, one of those opportunities that I had right before I get in this appointment was actually canvassing about $2,000 in my district. This was when was project that quite frankly raised a lot of eyebrows throughout what folks and decisions in my district having said that you know, I think the investments in Transportation Investments like these are worthwhile. What I I know we had a national search for Sam and thank you for being here. What I would like to be able to do when I hear the calls from constituents or receive the emails about this product specifically be able to reference a specific example of where you have been able to Can you prior experiences turn around a project and get the get things in order so that I have a conference in the delivery room delivery while for the city. So with the DC streetcar which had its own challenges getting off the ground and and getting into service and then plant starting to plan for the extensions and and moving those projects forward. And you know, I think that's that. It's not just reek our projects and I think we're going to be talking the next agenda item about our car. Let me know Seattle delivery, which I think we're getting the house in order they are as well. So I think we're building the capacity to deliver these projects within with an S. And I think I said it last week, but say it again that we wouldn't be here requesting this funding if we didn't think we could deliver are more or requesting. I told Kevin I apologize for not having asking these questions earlier, but we're going to do some math on the Fly and invite anyone to participate as they feel confident. I just kind of based on your memo Calvin of kind of answer to my questions, but I want to walk through them and get some confirmation. If I'm at least order of magnitude about writing what I'm talking about a not so starting from the top current projection is about 285 million dollars the most recent projection. I should say for the total cost of the project, you mentioned that they obviously with you. We spend this nother 9 million design will learn more about that lot of pressure is upward. There also is off to opportunities for me that number to come down. I assume there is some risk what's for lack of something better. Let's stick with a 285 for now. I know there is about an 88 million dollar Gap if that's right. That's includes both s. And utilities Gap. So that's money that will need to come up with which leaves that we've we've either spent or have budget Authority already for the remainder of 197. I'm and surrounding areas in there of that. We've identified the federal sources of 75 million. I'll come back to some questions on that in a moment 45 identify budget Authority from the house. Bond. That's a total of about 120. The CMAC money is about another 7 million. So that's 127 of the 197 leaving 70 million dollars. You identified that that s. Has already spent about 45 million dollars to date that leaves an additional 25 million is it safe to assume that we spent about 25 million and utility money to date is that the math difference there or it does become a little bit complicated because the money gets spent in the utilities as well as NS. So if it's sometime might be just easier just to focus on the transportation portion of it and serve let the utility money kind of live separately because some of that flows into the great to start budget so so let me switch which number is here then so the total is. Cost of the Project based on current estimates is 208 208 and the Gap in s. Of the moment 6565. So that leaves the expenditure to date of 43 Maybe. Of which we have fed in s. Vaughn's of 120 and CMAC of 7. Not sure. I'm quite following that sir. Maybe you wanted to do this Calvin. I'll just follow along. So we we have a 208 total project cost. We have identified current spending pass pending of 44.7 to 45. So that leaves I'm sorry actually have a calculator right here so we could just do it. I got to Kelly appreciate it. So to 8 - 45. 163 is 163 of that money. My kids can all watches on this so when we put them on there if I'd 75 million from the FDA. 75 million + N - another 7.4 another 7 million for the CMAC rant. 81 and then we should also remind ourselves that another bit money has been identified smooth and which is budgeted. 45 yeah. I'm doing this on the DNS on the Fly and I think I'm going to be here. So I think we're off by about 10 million, which someone in the Press is going to want it and myself a term of the difference. But we're to 81 million. You got budget Authority through the bonding of 45 million, which these about 35 or 36 million, which should be the sun cost but we have that it 44. So there's a week and surrounding areas or somewhere between a 5 and ten million dollar. So I think there's there's a couple places where there may be what when you count the expended money the 12 million future reimbursable grant money is in that 45, but then also in the 75. Yeah, it's right right that would make sense. Then we're down to a more like rounding errors if that's been double-counted. So I think that's what's going on because it would be reimbursed. The reason I'm going with this exercises not to impress or Scare kids about math, but rather to help understand where we are today and where we should go moving forward. So and I think I appreciate Calvin that utility costs are real those who have impacts to ratepayers the utility as they upgrade the system also gets benefits from I wasn't so it's a little complicated to figure that inside appreciate that keeping us focused on us. But I recognize that people may have a different view on some of that speaker system pipe. And so we have the 65 million dollar Gap me ask a question about the soap to ask for Authority for an additional nine million dollars. Is that 9 million of the 65 or is this 9 million of work that needs to be done so I can tell you if 65 the right number to away. So the 65 million remains a gap in the future, right? It's a it's it's not a we don't know what the actual project is going to be sunny. The project has doesn't change in this work is this work that is included in the budget already? And so we're eating away at that. It'll be different when I find out this feeling last two, right? Okay, that's helpful. And so there's about 80 million dollars in Grants that we've been awarded talk to me about the Federal Grant and our level of certainty about the 75 million or the 50 million + 25 recognizing that asked anyone to protect the federal government has a hard job. But can you walk me through that? Cuz I need to make some decisions here. Sure. So be as clear as possible. So the 75 million dollars is expected to come from the the Federal Transit Administration small starts grant program, which is a program has authorized on annual basis at the federal level in the way that that has been administered in that program has to submit an annual status update to the federal government to provide an update on the project and and then gets a rating from the FDA on product strength. So this project has remained as a high rating of high which generally puts it in line for grant funding as money as a product is ready and there's funding available in I believe it was fy16 Appropriations. There was a 50 million dollars or placeholder put a box within that Federal appropriation for that year that said that because this product is rated high at that point and seems to be getting ready. That would be ready for Appropriations, which is the coldest place in line for the grant award to be made that didn't change the we still had to go through all the steps to actually received the grant award and sign a grant agreement. The day is not doing an in Congress are not exactly doing that process in the same way. So we would anticipate that if we remain high highly rated whether or not there's that $59 box. We would remain eligible for 75 million dollars when we are when we are ready and there are Grant funds available. If there's not sorry, you're just one more last piece if we were ready and rated high and ready to sign an agreement, but there weren't funds available at the federal level. There is a process by which we could continue to advance funds as long as we could point to them. But that would be a question. We would we would answer down the line if we wanted to keep the project moving while we waited for a final Grant agreement to be reminded Vance cost moving forward with a hope to get reimbursed. If we get pre-approval to expend after your phones with the agreement that they will be reimbursed while we don't have a grant agreement in place at that point and that large of a number I think we would have a lot of discussion about whether the city was ready to take on that Financial Risk to move a project forward that well. I think there's sort of to sort of the grant Administration with FTA that seems to be going Largely the same way it has been there the truck in the project and we still have we're still rated high and anticipate the grant there's a separate issue about Federal Appropriations for that answer to the music of when that becomes available. It's largely out of our hands and I'm not sure that it well, I mean it's speculation about what how that might change but I think it's far as the relationship with ft into granting agency that still seems to be on track to other projects in that small starts Q than Madison rapidride and the Roosevelt rapidride both of which rapper the Madison rapidride where we are currently in the grant oversight process to demonstrate our Readiness to accept those FDA funds are ability to get through that process. The first time will inform our ability to get through that process for future grants as well. I'm great. Okay. Now as far as the policy decision in the past we can go down from this point forward money that's been awarded. I believe we do that to psrc. Sometimes there's deadlines to commit that money. Is there a chance that then you will need to give that money back Andre compete for that again or do we feel like the timeline is still pretty good? I don't remember the specifics of that we can get back to you on that. I did I do know that the department chose not to some of the bypass expenditures would have been eligible for the Grand and the department did not choose to access that Grand at this time. So I think recognizing that we still don't know quite what the password is here yet at some point that Grant would become they would want you to get the money out to Grinders who could use the money if we don't move forward on the other side of that. Compete better be good to know if if we're good on this money for another 5 years what should cover it if we go forward or if we need to reapply so in rough numbers we have about 65 million dollars of uncertainty. The the mayor has not proposed a funding source for that. Don't know if you want to give me any new information right now. So that's that's a gap that will have to determine subject to approval money for and all those types of things. If we were to not go forward that we wouldn't have to find that 65 There's an opportunity cost or benefit there an addition. We've already allocated 45 million of budget to the bonds that we haven't spent yet with I got to do math on the double counting on the reimbursement, but going forward from the city at least his current cost and current expectations around grants is about 110 million dollars an existing budgeting Authority and future budgeting Authority. We need identify. As far as if we if we if we were to walk away from this we have that for other projects ish or that's if we walk away from this project we have about the $45 a future Bond Revenue. We have to come up with 2. The Delta between Mary Ford and not ready for it is about 110 million dollars at least in my mind. So 110 million dollars. Okay. I just wanted to make sure we're on the same page and we talked about moving forward. If you have any other questions on any of my crazy Madness that we just did that we've expended in we need to reimburse ourselves for so I think it's a bit more like a hundred million dollars appreciate that I'm acting like I totally got that under control, but I really don't but I'm going to leave right now. We'll figure that out. So You know, this is not an easy decision, but I'm supportive of moving forward with a 9 million dollars. We talked about that before and I think making sure that we all understand what we're getting into at the council briefing on Monday call forward wasn't going to be here has some questions about some understanding about how to fix your decisions are made, and I don't know if you had any discussions with her. I haven't specifically seen any sort of language you want to add but I committed to work with her on that my my suggestion the moment will be to take a vote on this out of committee to send a recommendation to the full Council for next Monday, Maybe that the counselor Bayshore others have some language in there that that will want to consider a full Council if possible that my colleagues will think there's too many questions still in want to hold this and if we hold it for a day, it's at least three weeks. When to September I didn't hear desire to do that, although a couple of Chico if you have any concerns, are you guys really want to hear your views on this to again? Just what I've heard from constituents directly. This is one of those projects that I know very sensitive but also understand the importance of the project itself for both of our city as it's growing and and for downtown chords and addition to the commitments. We met two communities who benefit from the streetcar so I'm prepared to enforce its own addition to the hundred or hundred and ten. We'll figure out the math there a million going forward some of which has been budgeted some of which we need to come up with and we also have an operating deficit of a little over 5 million dollars is projected today. And so if we do commit to that will also need to figure out operating money on an ongoing basis and so those are both cuz it Directions were not making a commitment to me this today because we will certainly want to hear what you learn from the 9 million dollars. Assuming the full Council supports that we are we are going further down the street which makes it easier or harder to walk back from an easier to want to continue financially, but obviously they're they're still multiple decision points in front of us is nothing else. I'm going to go ahead and move Council Bill 11960 to favor of supporting. This guy go to the full Council has mentioned on Monday and we'll be in touch another language would love your feedback on on things it myself her colleagues may want to put in there. the next agenda item in update and I you should really just work this. All right below by when you're seated will start with around of introductions. You can go first Rachel McCaffrey. Love you accountability manager to slip away for a prior commitment as well. But again, I'm going to turn it over to Rachel and Lorelai to get into the details. This is the second quarterly update that that I've been here to deliver and this is just part of our regular reporting and transparency that we are doing with the move Seattle Levy to after the the reset work that was done last year just to show our commitment and and committed transparency in delivering the the commitment that we made despite. Some of the challenges of snow storm and Viaduct closure and all of the things that we've been managing as an agency this year. We've had our welcoming party. We we've been able to make strong progress year-to-date on delivering on the Levee. I think that the Q2 report demonstrates that and also demonstrates and you'll hear about some challenges that we are still concerned about about you and making sure that we stay on this trajectory that we're on this is the highest expenditure to spend the day through for two quarters of the year so far in the levee, but really what we're concerned about is our delivery of of outputs and outcomes that that really Drive our work. The expenditures is a key Milestone, but it's just one measure of our success over also with that. I'm going to turn it over to Rachel and she's going to start walking. through the presentation I'm so next up is going to do a quick overview of what we've got this afternoon. We'll do a quick review of the purpose of the quarterly reports talk about the performance summary through Q2 including specifically that neighborhood treatment program and then we'll talk about our finances. So quick review of the quarterly reports like Sam mentioned, these are kind of a direct outcome of the new format and approaches a direct outcome of the assessment from last year. So they are quarterly and they document the two things to talk to I will go through today performance on delivery and finances performance and delivery metrics are communicated against the plan Daniel accomplishments of this case 2019 plant accomplishments, which is a new approach that we launched earlier this year to really show progress in this one isolated year how we're doing against that one goal. The reports are published on a regular schedule. So this is our third or fourth in this format, and then the quarterly reports roll up into an annual report published the following year. question before I jump into the stop Q2 saw some of the regular ramp up the bed is traditional for the warming summer months of construction season. The chart on the right is just a quick by the Numbers highlights of some of the key programs that have those witchetty deliverable outfits expect all programs to meet their plan accomplishment for this year at this time. There are a couple that are a little behind example uses for crosswalks repaint a which is the top on that list. Typically at this time of year does have exceeded $1,000 a little behind this year for weather and some competing priorities she is but we expect to make up that work for the rest of this year. And then we had five construction contracts advertising Q2 and five awarded which demonstrates significant progress on the paperwork. Seven some key accomplishments this side highlights of few important projects that we were able to get done for the check off the list during second quarter. The first example is Northeast 65th Street Vision zero Corridor, which transformed this high priority Collision Corridor including Avenue protected bike lane through the Roosevelt area. We finish Paving 23rd Avenue Phase 2, we turned onto signal at 13th and Homan to the neighborhood street fund projects from the last time around which also is a compatible Crossing with the north Seattle neighborhood Greenway, which is the last project on that list that is 2.7 miles of Greenway and north and Northwest, Seattle. That was kind of talking about stuff that we got in the ground in completed. And this is a look at some design Milestones that we reached on a few of the really big Levy projects. We awarded the Construction contract for Fairview Bridge, which is a significant Milestone towards starting construction later this year. I believe the Preparatory work before we closed the bridge to where we also had 30% design on Delridge rapidride H line at 90% on Madison. Good question as we as these projects advance and we go through design and then I assume with an award I will start to get more cough certainty about that and the rest goes away on the Fairview project, which is a big one or just more broadly. How are we doing? We we tell you to spend more money sooner of course took some of the projects done, but of course, we would love to others to be less expensive than we anticipated forecast looking like are in line with our expectations. Are we seeing different kind of Market fluctuations out there that are trending one way or the other. So I guess I'll start first with the can of the first part of your question and then it'll lead into the the next part but we when we enter into the construction phase we definitely have more of a level of certainty because we received beds and we have actual prices vs. Just our estimate for a project such as the Fairview Bridge were there still a lot of I would say more involved construction where you're building a bridge over water. There's still a fair amount of risk of the early phases. And as you get out of the ground and your building just the death portion of the project then then you're in a much better place in terms of rest and cost certainty. So basically it's as you progress through construction against for a Paving project, we have less risk during construction. So once you got in the bed, so you feel more confident than you do on a bridge project and then answer the second part of your question remind me one more time cuz I got focused on those different types of projects. Are we at a point presentation so you don't have to answer this if you're not prepared to but just are we seeing that costs are in line with our projections in general across the various projects, you know, I know one of the reasons for the reset was Cost to become a construction type is Archen Market was just weird seeing things a lot more expensive. We reset our cost curious how that feels out there now or if it's too soon to tell so I have a summary of it so I can't give you exact numbers but the majority of the projects we bid recently. Our Engineers estimates have been around like the second and third kind of price in there. Which means that's right where we want to be right in the middle of the bed. So generally we've been able to award projects for a bid price that's less than our Engineers estimate. We had an exception to that and our North Gate Bridge Project where the cows were more than what are Engineers estimate was. We have a proposal for how to address that and and sometimes that happens to a girl on those more complicated projects were it's hard to predict the estimates. So it sounds like we're we're through a phase where everything was coming in over and we were and we made some adjustments in our end and our ability to check the market predict the market a little bit seems like we're better there and so great. All right shift gears just a little bit talk about the neighborhood street fun program specifically just to explain the program real quick. The neighborhood's refund program is funded by the most I love you and is a city program that enables the community to propose and help prioritize Transportation related projects that are then built by us. Each cycle has three years a year for planning your for designing an ear for building and we are in the plan year for the 2019 to 2021 cycle this slide just explains their shows the difference between the process used for the last night versus this one and over the past several months as. Has been completed his planning and public engagements, which was developed in partnership with the Department of neighborhoods to engage the public and developing proposal than voting on projects. The arrow shows that we are in the last main step of the planning phase is actually, dating site at the levy oversight committee. We're The committee will they have been reviewing the sort of almost final list of projects and they'll be reviewing and selecting the final projects that will be part of a cycle come join us and thanks for all your work a lot of work to really understand and interpret it for everyone. So just to quickly show some of the product of the community vote for the primary means they collected votes produced over 6,000 votes online to that. They did targeted Outreach and just rx12 in 5 to reach communities. They're hosting events meeting people where they are like pop-up events Community dinner Community dinners open houses and put her education events. Provided paper ballots in 8 languages and that effort saw an additional paper ballots through that process with some of the demographics. It's a it is under represents the white population in Seattle, which is unusual. And so I really appreciate the very hard work that from some targeted to do that. And we'll put it back to normal Levy business with the finance update. So this is R22 report. I want to acknowledge the q1 because of the phasing of our budget cycle. We had the opportunity to match actuals with our predictions so though that is right on it was right on because it was right on as 422. We actually were pretty successful and estimating what we would spend our success one asked me what we would spend in the second quarter and pretty darn close. That's about as good as it gets and with that deliver bowls also, so we are trying in the right direction. It was a successful quarter. and then I'll just all note to that we Continue to evolve our process for developing our spending plans and analyzing the risk, and so it's nice to see that show up and and how the numbers play out. So then hear what we see is where we're at in spending for 2019 compared to previous years. So we are heading in the direction we had been planning to head was represented in our work on process last year. What was the name of sorry actual 322 total got it. Nevermind. Thank U complex graph with two different tables. Got to keep me on my toes. And then we have another one here. So this is a pie chart that shows you just the relationship between the three different categories in the Levee and how those are being how much has been spent in each of those today. So can congestion relief is about 44% spent the other two are a little further behind that are slightly heavier on our crew Project work and just other things that happened during the course of the third quarter in the better weather. So it's a typical trend. And then last of all that just last week we publish the second quarter report there were talking about today. So that's online unavailable for everybody to read and we will share a short presentation with the levy oversight committee tonight. So we're here talking to you. Now. We have the committee this evening and has Rachel said earlier and we talked about the major focus of this evenings meeting will be honest of product selection. I really appreciate you very the future that part I really appreciate the work that that you all have done. Another Levy oversight committee did a lot of work with you all I know the mayor has made this a priority, then Heritage some challenges when she came in and it's Jennifer me it felt like there was a. Of learning about a lot of things that we're going kind of in the wrong direction some things beyond our control some things that probably could have done better at internally the recognizing that you don't do, you know, the second you identified. It's it's weird that you just flip a switch and it's fixed and so you all made it really clear the time that like, hey, we we can get this Friday for making a new plan. You came out with a new plan and yet they're still is? It's like right now it's just talking paper and words and it really don't have your act together. We're just going to keep doing this until I love you. So very little B UMass and but of course the Hope was like hopefully in a year or two will start to see the results of the work that was done and to me it's still early but this is a signal at least the the projections that the revisiting the revising about the reset whenever you want to call it seems to be generally on track. I mean it's still construction it still Uncertainty, there's lots of things going on but it feels really good. And I just got excited to see a couple more quarters of this particularly excited about the Centre citibike Network cuz I know that's kind Tim McGraw now and there was another thing that kind of got under a little bit but I think you know tentative Kudos because it feels like things are heading in the right direction and hopefully a couple more reports like this over the next few quarters really help to build the credibility again. I don't I don't think that credibility losses because of individuals there's an amazing group people that work in the team but a Confluence of circumstances and challenges and I think you all have responded to this challenge is really well. It looks like we're getting the results. So keep up the good work. We appreciate that. I would say we too were cautiously optimistic. Our team's very focused on delivery of the Levee and the what it means for our department. And so hopefully we can continue to Showcase that and in the future where we have challenges. They're not in the things that we can control their more than the things that we can't cuz we still have some of those out there too. Any questions or comments on this you should devote I'll just reiterate the earlier conversations around a green New Deal and you know, we talked a lot about fossil fuels but too and we'll have lots of policy we're doing there but obviously people need the transportation system that gives him lots of options to make that work transportation is our biggest carbon pollution sector and so, you know, frankly our success on the green New Deal or addressing climate change is heavily dependent on success at us. And so it also makes me feel good to see the things are heading in the right direction cuz I need you guys to be an awesome team working for is all this. We need the public to be confident in a kazoo. We're going to need this loving and Future Love is to find a lot of Investments. We're going to need so that everyone has access to carbon free transportation in the near future. So Good work keep it up. See you in a bit of a green New Deal is it's so much contingent depending on the success of love you all. So what that I mean change the name of a stop to the Seattle's green Department besides a green New Deal. She's back on Kelly. We have one final agenda item has forward Open up to take out. I asked you to stay here till 5. It's after 5. We're still going. I'm hoping to not go over three and a half hours. Like I did if you go, but that's going to be somewhat dependent on our presenters here in the questions you and I asked, but I really grateful for you sticking around as long as you did. Thank you. How can arm wrestler receipts when you're ready? And we'll start with just a quick round of introductions keto. Do you want to go first? Sure kiddo Freeman Council Central staff? Seriously with bar Consulting Kendra Braylon Faron Pierce. Thank you for your patience and be at the end of the hall Jazz. We're going so long, but I am excited about the presentation and he told you have some kind of opening framing you want to jump in with her time transportation impact fees is kind of gone in fits and starts and we're at a point now where we may be able to start again. So to speak my hearing examiner decision on an appeal of a c professional determination is expected sometime this month and so it's a good opportunity to orient the committee to on the subject of Transportation impact fees and some of the documents that the committee will use in making a decision about future Transportation impact impact fee program and Faron Pierce & Bourke of here to talk about two of us documents. When is a look at Capital fund. Casas en pure jurisdictions how much work completed back in December of 2018 and another is US homework done by Faron Pierce on an updated on right study, which will form the basis for an impact fee program. And so just put a point on this for the public transportation impact fees. We need to update our comprehensive plan with the transportation project list attempted to do that last December, but there was an appeal to environmental review of that document which is still pending and so were prohibited from taking any action on that until the hearing examiner issues. They're willing which dimension should should come sometime this month. So this presentation is in anticipation of hopefully a good ruling. That's what I'm hoping for so that we can move forward. There's obviously a chance that we're going to ruin it says no, we actually do more work in which case we'll have to do whatever they tell us to do. Presentation today is a hope. So kind of reground Us Franklin a lot of information that's been out there today and my hope would be to have a future discussions in upcoming committee meetings. As soon as I believe a week from Friday is that accurate would be the next conversation. Hope possibly by then we would have some certainty to discuss these actions are just can't take final counts license has been out of the hearing examiner, but I don't want to invest too much too much time until we know for certain that looks like so I will hand it over to you all and after I had that long Preamble asked if I was 40 slides here, so what's up get through them with diligence, but also A great way to start keto. All right, and I will keep this very brief cuz I am a believer that too much information. Sometimes that at one point is just too much. So I've been asked to give some background on Transportation impact fees specifically kind of wet State Statute allows how we structure those programs and then we'll shift our Focus to what it might look like in the city of Seattle. So just on the screen or just you know, some of the real basic tidbits about Transportation impact fees first of all, their one-time charges paid by new development, they were authorized by the growth management Act of 1990 and really State Statute provides some parameters in terms of what they can fund specifically they must fund Transportation projects that provide capacity for future growth. They can't fund kind of purely maintenance projects that are addressing existing deficiencies. So pot Hill filling or projects like Transit. Reasons those are not expenditures that are authorized under state law. Some other kind of tidbits projects must be within a community's capital facilities elements as we mentioned that is the subject of the appeal at this moment, but hopefully we'll get some good news soon. And really what has I think led the city to be interested in this funding mechanism is there are of course many ways you can send transportation is we've seen a trend towards communities using impact fees for more multimodal project since we've seen a nice alignment between Seattle's objectives for mobility. And what impact fee is can help provide. Impact fees are very common throughout the state. They're over 70 communities that have transportation impact fees. We've got just a smattering of kind of Puget Sound jurisdictions and could have that range of rates on the screen right now highest rates are about 15,000 her what you'd consider a single family home on here all the way down to 1 to 2,000 within the cutest sound for a single-family home. And you know when you're looking at what is no kind of a typical rate in the Puget Sound probably about five to six thousand dollars. So state law prescribes really how we structure these programs. So we start with a list of eligible projects. So again looking to projects that are within your capabilities helmets also this projects that are providing capacity and kind of fit there within the right-of-way of local streets and roads. Those are some of the the parameters of things that we can spend our weekend fun with impact fees state law going to prescribe some of the steps that we've been take we strip out the cost of existing deficiencies. So for example in the projects in Seattle, we be looking to the paving components of those projects. It's purely pavement maintenance is probably not something that would be allowable under state law. We also do some modeling procedures to understand the portion of those projects that are serving kind of Seattle's growth vs. Non City growth and then the last step is really kind of getting at a maximum defensible rate. So kind of taking all those eligible costs and spreading it over the growth and trips anticipated in a jurisdiction over could have lifetime of this program. So that's kind of in a nutshell. Can I how you structure impact fee program? I want to show shifter Focus now to Seattle and what a program could look like in this community and so in developing kind of this draft rate study, which will be bringing forward in a couple of weeks. We looked over kind of all these eligible potential projects in kind of a lot of your adopted plans. And so you can see on the map here. I'm a list of 20 to 30 odd projects very multi-modal in nature that we could consider funding with impact fees. I'm so then we ran kind of these projects through the set of calculations that I described in the path of the previous slides. So first of all, those eligible project sunshine on the previous slide, that's about 1.7 million in capital projects that the city anticipates delivering somewhere in the next 12 or so years to look at each of those projects next track those components in the projects. That wouldn't be eligible for impact fees at one of those is the existing deficiencies. So of that 1.7 billion and projects, we identified that about 272 million of those projects are really kind of more oriented towards addressing existing deficiencies to have stripping out those costs. The next step is then I'm of that component then I'm doing some modeling and Analysis to understand who's using those trips and really understanding to the extent you got through trips or trips. Art related to Seattle land uses tripping out that component. And so again another 451 million of that original list is components of those projects are things that we can't be funding with impact fees. And so getting down to kind of those eligible cause we've got about 968 million dollars are funds that could be kind of charged impact fees. And so taking that amount of eligible costs and spreading it over the growth and trips we expect in Seattle. That's what kind of provides the basis for a maximum defensible fee. Something we we recognize is that impact fees at the very heart or about addressing the impacts of transportation. And we recognize that the impacts of Transportation. I can be different in different parts of the city. So Urban centers Urban Villages areas nearby Rail stations. Those are likely going to generate power Auto trips given from transit availability walking biking uses being closer. We wanted to recognize that differential impact and this is really consistent with the city's comprehensive plan which set a mode share level of service standard and really that much her level of service standard recognizes that single occupant vehicle trips 10 to take have the biggest hole on are constrained Urban system and that when people are using other modes, they're using less space and that makes more Transportation availability and Mobility for everyone. So that's something that we would be I'm taking into account and structuring a program for the city kind of my last line is just recognizing that you know, the next step would actually be a fixing kind of the cost for trip into actual land uses. So we have some relationships we can use from the Institute Traffic Engineers Emmanuel and from local psrc household travel survey data to really kind of understand how did different land uses really results and different Transportation impact such that we can set an impact fee program and would be looking to work closely with Council really to establish that turns land uses that would be charged the different categories of token of our thoughts around having these very adjustments makes sense. Those are kind of the next steps. So Thank you so much for that overview. And thanks for your ongoing work on this. 3 years 4 years. How long have you been engaged with the city of this since 2015? Well, I'm actually interested in potentially next Friday. I mean committee coming back with some specifics around space program. So my understanding is a lot of that. There's probably a few more questions to be resolved that are we close enough that that's a possibility great self checkout already developed. Can I said you can send it to me after committing to the agenda is the draft study from Faron Pierce and that actually has a conceptual fee schedule at the end of it's based on the maximum supportable fee. So not necessarily the fee that the council may consider, but Joseph you schedule based on the maximum fee calculated by Faron Pierce. Two great. So that's great work. We are tracking is publicly you can go to the documents and see what's in the draft study. We will do a presentation specifically about and I'll likely include when I put as my my proposal forward counseling Pacheco. We're in that range. It'll be less than the maximum and probably somewhere comfortable to what the kind of average when Puget Sound cities or doing that I'll put that out there for two people can start to understand what we're talking about how much money would have generate how much would it cost for certain projects? And I think that level of specificity will help us get some more feedback. So the next presentation for the continuation of the same presentation? So the city asked us to do a little bit of background research to understand how other house Seattle another comparable jurisdictions are funding their transportation capital projects. So we're reporting on that work today. There's a couple of questions that were focused on what is its capital capital Transportation projects now and what about other comparable jurisdictions around the Puget Sound area as well as in other states, how do they find their Capital Improvements and then looking at how these different funding strategies? What are the implications for aspirin to individual households on a different income levels within those communities? So, you know Revenue sources are taxes and fees some of those go directly towards my pay the directed by household some of which were indirectly. Households, we did some additional analysis to try understand. What is the relative costs per and how are those costs for those Revenue sources distributed among households in the population and then finally looking specifically at communities that rely more on impact fees as a revenue Source. How does a how does a Casper in the distribution of cost-burdened? How is it different in those communities versus a place like Seattle that does not currently have impact fees. So the first half of this is looking at the capital funding sources and expenditures and Sherry's going to talk more about that work identifying Transportation Capital funding in Seattle. And another jurisdictions was to review on Capital Improvement programs. And so we looked at historical actuals over the. Of 2013 to the 2017 just as a five-year window of time and identified love Revenue Services be used for transportation. So some of those common Revenue Services on the side here. There are both unrestricted vs. So general fund taxes that are not specifically dedicated to transportation and as well as other sources that are specific to Transportation impact fees are a transportation benefit District. So in order to compare them of these Revenue Services across jurisdictions on each of which, you know category as their revenue sources differently and have different types of reporting methods. Are we group these Revenue sources into some general buckets and on the data, we received from staff at these jurisdictions and then we group them into the following categories. I'm all start with Seattle is where most similar with the Seattle data. And so this is the total five-year Transportation Capital revenues from 2013 through 2017. It's about 1.2 billion and I'll just walk through these categories. Generally you'll see that we've categorized many different sources into these broad buckets. So starting on the top of the upper right hand corner of this donut chart and green you'll see that debt is about a third of a Seattle Transportation Capital rep needed. So that's both be limited and unlimited tax General obligation bonds. Moving down another the vote of Transportation levies, which is the move Seattle Levy. I'll point out that in that blue grandson intergovernmental transfers section. That's where the motor vehicle fuel tax number which is a state gas tax distribution shows up. We just group all of the federal state and County funds into that. Moving on there is the money coming from reach. So that's the tax levied on sales of real estate and then I'll just also point out that the transportation benefit District a vehicle license fees are currently showing up in that dark blue in the upper left under system development charges just because it was a confusing maybe but that's where that is showing up right now. So I'll just remind everyone that this is just a window of time. It's five years and that's why debt which is a taken on during this. Of time is shown here as a Revenue Service because that is financing that becomes available during that. Of time. Although we're not showing exactly when that is paid off because it might not be there in the five-year. It's all the debts an interesting one cuz it's it's our financing to as opposed to funding until the debt that will have to be repaid and I assume you make it how when you're doing this for a short. Of time and we're repairing it over 30 years and you don't know how we're going to repay. It does does the repayment of of existing that there was repay during this. Show up or is it just the capital projects that were initiated funded during this. It's just the capital projects. I like that. Yeah, we'll talk a little bit more about that in the the cost burden section as well. A lot of these Revenue sources are so some some some of the debt is paid for by dedicated sources that we've identified in and do allocate to hustle to make a sperm analysis some of the day the ltgo may be paid off and in general funds. We don't have specific information about that. So they're there is some portion of debt that may not be fully reflected in the cost for an analysis. That's a good observation. Okay, I'll move on to Bellevue next time. So the total five-year Transportation Capital review number here is around 260 million and I'll know that about half of this is coming from debt and again based on our discussion just now that is financing that has become available during that period of time and is being used for transportation Capital without necessarily a county for how much or when that is being paid off. I'll also point out that re is being utilized that a similar percentage level as Seattle and Bellevue off of Bellevue has a transportation impact fee which is established in 1989. And that's bringing in about 5% of a funding for transportation capital. The next slide shows on 10th and similar to Bellevue at has the transportation impact fee. There is was established in 2010 and it's bringing in 5% of the transportation Capital Revenue. Something unique to Kent is that it has the street business-and-occupation tax. So typically B&O is not dedicated to a specific purpose, but I can't decided to dedicate their is to bed to transportation starting in 2013. Next we have summarized the transportation capital for unincorporated King County. The most about half of this funding is coming in from the road find which is made up of a variety of sources that much of that is the property tax levy which is levied on unincorporated areas of King County. There's also some County contributions on the state gas tax distribution that fall under that category. I'll also note that King County did have a transportation impact fee but it is no longer being used as of 2017. I'm so this next slide shows up data from Portland and I just wanted to store kavya that Portland has a very different system of reporting on Transportation data. They have different categories and we had limited financial information since this is based on publicly available data. I'm so we don't know necessarily what is included in the same amount of detail as we are familiar with the Washington jurisdiction, but what I'll point out is that the system development charges, which is shown in red here is most similar to impact fees and that is bringing about 6% of revenue for Portland. This table here summarizes the per capita Transportation Capital spending across the five jurisdictions. I summarized so that First Column average annual Transportation capital is just the total divided by 5 years. The next column is just an average annual population across that 5 year. And then the third column on the far right is the average annual per capita Transportation Capital spending. So what do observations Seattle does the pier relatively higher and they'll close to Bellevue number and I'll just again point out that we have some uncertainty surrounding Portland number because we're not as familiar with their reporting systems. And so I would use caution When comparing that number to the others. On those comparisons. He's just the city of expenditures. It's not sound transit expenditures in Seattle. It's not King County Metro expenditures. It's just there's their whole structure about which which local responsibility weather agencies do can be different to down there, too. It's not going to turn to the second question. We're looking at a cost burden. So this is basically that we have a little bit more understanding of how different communities raise raise funds to pay for transcription Capital an hour to look at how is how is the burden of of of that fundraising distributed across households within a city? So to do that, we we first identified a couple typical household types. We looked at the card to find three three different ones at different income levels and gave them some characteristics that we could then use to help with modeling and estimating. What would the typical household of that type be spending in taxes annually or fees. Annually that that are related to each of the different funding sources that are used for transportation Capital. This just shows the kind of a high level. Some of the characteristics of the upper middle-income is a homeowner a household that they own a medium price single-family home based in the jurisdiction. They own two cars. They have an income about 150% of area median income which in the Seattle area is around hundred thousand Sons 550,000 for for the upper middle income household have two different renter households and moderate-income in a low income per household with different assumptions about you know, the age of the you know, the apartment that they're living in low-income obviously varies between them as well. We've also has other characteristics of his how much did they drive a year? What is there annual consumption, you know the fuel efficiency of vehicles that that's based on on the best available real data on that can be used to differentiate these different types of households and come up with comparable. He also looked at all the different Revenue sources that Sherry just went through and identified the ones that could arguably be either directly paid by a household such as a homeowner or directly pays property taxes and they sell a jurisdiction that uses property tax to pay for Capital transmission Capital. That's it. That's a more direct line that we can go. We we know in our assumptions what the average property tax to pay. We also look into the finances of the jurisdiction understand what percentage of that property tax goes to transmission Capital so that we can kind of discount that property tax payment to just the amount that goes Transportation Capital so that we really can see roanna. What are those direct costs to these typical households that we've developed so that we do that for vehicle fees would do that for gas tax. I would do that for sales tax in household consumption for dresser that use those those things for the renter households, you know, obviously to the property tax there is a indirect Because you know, they don't pay property taxes. I pay rent, you know it with the you know our assumptions for the study that within this current housing market that the entirety of property taxes are asked on a per-unit basis to renter households. That's a assumption that we just use to to try to understand how these different views might be passed on to two different Apple types. So we look at a potential and other indirect costs. These are the two main categories were looking at here are impact fees and read the real estate excise tax these yellow. They're both one-time fees are the first case it so, you know the Levee Tan on each unit built before on excise tax. So, you know on every real estate transaction. There's a there's a tax on that that's used as a funding source. So our model looks at how would those potentially be passed? Two or paid directly in some cases like read for for homeowners, you know so much about how would those be passed on to different household types? And you know, it's not all households would be paying these particular ones that are in a living and holding it and not moving. So, you know, that's why I would categorize he's definitely has potential indirect costs. So we we treat them differently and it also says you'll see in a second here. There's a number of funding sources that we don't consider in this cost burden mainly because it's hard to attribute them directly to household such as grants for the federal government will pay federal taxes. That's not a state. It's not a city thing the motor vehicle excise taxes Sound Transit tax bill that we pay that's not you know, Seattle jurisdiction or Bellevue sword is diction. That's a regional tax separately things. I see the medication weather is no like standard fee schedule in his kind of negotiate on a case-by-case basis. That's that's that's not what I hear sales tax in construction that can be considered it again, but it's weird. We don't calculate that here in some some debt is not as we mentioned before some of the day because of the way the finances are reported. It's unable we're unable to to to isolate. What was the how is that being paid off the portion that goes the transportation Capital? So there's a lot of Covered in this analysis not not all of the ltgo. So finally here this is a look at the direct cost for and so the the sources that we can more directly attribute to households cost and we're looking just at upper middle-income households and we're comparing for different Puget Sound area jurisdiction Seattle Bellevue Kent and King County as you can see Seattle King County of secretly hire a direct cost burdens to these upper middle-income households compared to Bellevue in Kent a case of Seattle. There's some butter taxes that are the property taxes a big part of this the vehicle licensing fee is also a very large part of the the Seattle and don't cost for a Lincoln County is primarily property tax. You see the numbers go down for moderate income households in a large part of that is that the portion of property tax pass-through Apartment renter is much smaller than a than a homeowner. So you'll see those some property tax ones shrink considerably, but still you see that Seattle and King County have a much higher burden for a moderate-income renter household than Bellevue and Kent similar for low-income. The numbers actually don't drink all that much pickling in Seattle for the lower-income households it again. This is household learning about half hour or 50% of area. Median, I'm and assumed to be renting. This is a comparison of the drug costs across these four different jurisdictions. Again, you'll see that you don't cost Seattle is highest in perfectly when it comes to the lowest income households. It's considerably higher than the other jurisdictions unincorporated King County is also but it declines more drastically for the DeLorean come households. And again Bellevue and Kent are are a bit lower in terms of the direct household cost. Quick. So Big Driver Leslie Swan Lake Seattle versus King County seems to be that as the income level decreases property tax decreases significantly in King County. Yeah, when you look at it part of the issue there is that assessed values in Seattle or just hire across-the-board. We had some sense about the age of the apartment units that we got the low income household in the modern canalside live in we looked at actual Saturday to come up with like the average assessed value of of Apartments of that type within those jurisdictions and then and then they figured out a per-unit basis. What is the you know the value of building on a per-unit basis. So it just happens to be in in unincorporated King County older apartment buildings are quite lower in value than older apartment buildings in Seattle. So you're seeing a big difference there. Now we're getting into the potential indirect costs. So this is the transportation impact fees and read and hear you'll see a bit of a reversal because in Bellevue and can't they are more reliant on impact fees as a revenue Source again not all households are these costs but we are showing them here as potential costs or something paid directly by a household at that buys an area for read. So here we are seeing the main entry cost in Seattle is is reached. Did you rely on that? But in in Kent this is an annualized is cuz impact news and radar are one-time fees. Of course, this assumes that the homeowner Vino buys a home that that was built and had a impact fee imposed on it and that amount of the feet Then annualized across you know, the the mortgage. Of for the homeowner. That's how we got to these numbers for an annual cost burden. You'll see again that Bellevue and can't charge considerably higher than Seattle and King County for the upper-middle-income owner household. Promoter income it's a similar pattern again. It's the numbers are not is is large because it's it's spread out of the month at apartment building as opposed to all on a single-family home owner. Again. This is assuming that the renter is living in apartment building that was built after the impact fee was in place and and it does impact fees are passed on the annualized cost of these were passed on to the to the renter households. I'm here again. We're seeing for the low-income households will see that Kenzie Rose out. That's because of our assumption that there are no older apartment unit and can't pass their impact fees more recently as Sherry mentioned earlier on so here we see that Bellevue is the main whenever there's an indirect cost for a low-income household. This is just a comparison chart again of the potential indirect costs two households. Again, you'll see that Bellevue and Kent are significantly higher than King County and Seattle. so now what we're doing here is looking at at the total cost for an S percentage of household income by household a type and we're looking at this by jurisdictions right now we're looking at just Seattle or comparing these three different household types were stacking both the the direct cost burden as well as the indirect cost burden the potential indirect together and if you combine those in assuming that that they do their those potential indirect costs what would it be as a percentage of household income as you can see is a percentage of across-the-board you know .36% is for a for a low-income household so if it's low compared to your annual income but this is one way to to look at at at what is it compared to what what is the relative Casper and how regressive or Progressive is the tax in Seattle and household does have a higher percentage of their household income Potentially burdened by taxes that go to transmission Capital than an operator, or a moderate income household. In Bellevue, you see the same pattern again a low-income household has the highest total potential cost burden. It's a little bit higher in the case of value then been Seattle for low-income households. Again, not all low-income households wouldn't would be bearing out those potential indirect cost of the impact Theory. And can't you see a little bit of a different pattern. I mainly because as I mentioned before we're not assuming the impact fee is applying to the low income household and the cops are lower overall. In unincorporated King County. We're seeing a different pattern again. The costs are lower overall as a percentage of household income and the low-income households are paying a lower share than the upper middle-income households in unincorporated King County. I'm going to highlight just a couple key findings will be described here. Again. Seattle's got hired direct cost burden across All Hustle types value and can't have a higher potential indirect costs to the Reliance on impact fees and read the total potential cost burden as we saw earlier of households in Seattle and Bellevue are remarkably similar actually. However, again not all households in Bellevue with bear the potential indirect costs of of impact fees of the depends on a case-by-case basis that I kind of knew who could bear the costs of impact fees if if they were to be added in a jurisdiction, you know, an impact fee is a cost that increases the cost of new development if it were to be in Seattle or or in another jurisdiction, it's additional to the cost of development and there is some uncertainty regarding holidays cost could affect housing production over all of course if you've got some very high impact fee. That could be a good effect on on the decision of developers to develop in a jurisdiction. If the if the fees are quite high if they're lower than might have a much less. So it's other is uncertainty regarding how the market would respond but if it if the market total production and then that could decrease Supply in that could increase costs overall for for all home buyers and people that live in rental properties due to increased competition. But again, there's uncertainty about how the market would respond and there's some sort about how much the fee would be. Housing developers could potentially pass on the cost of impact fees to renters or home purchasers depending on market conditions. What a very competitive market. It's more likely that they could pass on those cost to home buyers or renters. This would be more likely occur for households renting or buying new housing would be more likely to see their cost to ride the past on cost of impact fees so that could be, you know, people moving to Seattle for the first time or people moving to New Residence Inn Seattle might be more likely to see those passed on cost people that rent or buy older housing or just let me know where has he not moving would be less likely to see their costs rise due to impact fees. But again, there's uncertainty about how the market overall would respond. Two more slides like it's essentially a three-step process. There is the step of incorporating a project list into the comprehensive plan. Again that a proposal is currently but the environmental review for that proposal is currently under review by the hearing examiner. Once we have a decision from him an appeal will know more about when the council can take that first step, second step is adopting an impact fee schedule and program it. So that's a policy and Regulatory decision on fee schedules exemptions and other procedural requirements including credits and things like that that would follow or happened concurrently with a final action word follower happen concurrently with action on comprehensive plan amendments. So you can see how they hanged Janus decision when he makes his decision affects cancel a timing for that and then finally packed and 2019 the council would invoke an exception to on the growth management act limitation on how frequently the comprehensive plan can be amended and there is no exception that allows for multiple events a year when one Amendment happens concurrently with adoption of a but I'm sure that I'll be at the council where to take out there and pick you program this year. At least it would happen at least partially during the budget review process. Go to the next line, please so timing for what this might look like. Again. This is all contingent on the timing of the hearing examiner decision and what that decision is in August and September the committee on could discuss and take action on Carpenter plan amendments and potentially I'm implementing regulations in September and October discussion of changes to the nearest proposed by Associated with an impact fee program and then finally and November. I'm all of those pieces of legislation could come together as part of a vote on the budget package. Skeleton quite a bit of research on this. I really appreciate this and it's quite helpful in a week and a half will be back here talking about some specific proposals to Seattle, but getting us already grounded in this information is great. So thank you for doing that cuz we're protected you have any final questions not even one is this is probably the longest Canada visa for hours. I might run the middle this conversation as well. So we'll see what happens next with Aaron Examiner. Thank you all look forward to continued conversation. And with that we will be adjourned. Okay.", "end_time": 13643.4}]}