{"format": "raw", "annotations": [], "confidence": 0.9378919132550557, "data": [{"start_time": 0, "text": "Good afternoon, everybody. This is the regularly scheduled meeting of the Human Services Equitable development and renters rights committee of the Seattle City council. I am council member, solvent of District 3. The time is 2:10 p.m. And we are in council chambers and I hope we will be joined by other council members were going to have a committee meeting regardless. We're just come from a very exciting press conference. We're seniors and community members have spoken very clearly about why they want bird bar place in the Central Area Senior Center to be held for public use in perpetuity in the hands of the community. We will have them at the table in a few minutes where they will talk about their efforts to transfer form of ownership of property from the city of Seattle to the are nonprofits currently operating out of those buildings have had mutual and offsetting benefit Lisa's which means that they use the properties rent-free, but in return they use the property to provide an invaluable service to the city providing crucial community and social space transferring formula ownership would not change anything in terms of the community benefits delivered by these properties. However, it will make sure These phases will be held for social and public use regardless of income in to perpetuating and that they will not be up for grab by for-profit Developers. Most immediately Byrd Barr Place 11.45 $5000000 State Grand but has been unable to collect it for several years simply because the city of Seattle establishment has unacceptably delayed transferring the property ownership for the last seven years. Now, if the state legislature does not be appropriate the money in this session bird bar will end up losing the Grand and through no fault of their own as of now that really appropriation meaning reassigning that 1.5 million dollars for board bars used is in the house capital budget, which is good, but it is not in the Senate budget yet and unless a special session is called the state budget will be finalized by the end of this week. And that is why it is urgent that we make sure the state legislature. Ensures that the 1.5 million dollars are there for use by bark bark Place regardless of when the ownership gets transferred community members will be speaking today about how they have advocated for this in the past seven years through three mayoral administration's last November that city council passed a resolution unanimously sponsored by council member of our bold setting a deadline for the end of March to complete these transfers, but that deadline has also now passed later in the meeting. We will talk to the Seattle renters commission the chairs of the commission will discuss with us their work plan for 2019 and the commission's Tenant protections. What group will present on two of their most recent policy recommendations rent control and extending the notice to tenants for rent increases to 180 days? Both of these issues are very much interconnected because we're seeing in a city that is very quickly becoming a playground for the very wealthy and four big business Ordinary. People are having to struggle boat for affordable housing and accessible social spaces. So I'm really glad that we're going to have both these discussions today before we started discussion. We do have public comment and we have about 15 people signed up for public comment given that we want to go to come to the discussion as soon as possible. I am appealing to everybody to stick to one minute each so that we can hear everybody for a minute each was signed up for public comment and then we can begin our discussion because part of the discussion is also what are our next steps. What are we going to do after today, right? So I'm going to call in the names in order of signing and I will call it several names each time so that you know that you're coming up next and so that you can line up at the microphone and also know that there are two microphones. Are you can if you hear your name called at the next speaker upcoming speaker, you can go to the other microphone and be ready so that that way we don't spend too much time in the back and forth of speakers. So our first three speakers are Ruby Holland Margaret Richard and the owner of The Honorable Michael Fuller. And I please look at the timer here. You need to create an anti displacement plan for every homeowner and every Urban Village in Seattle or you need to make every neighborhood share and the density crisis and of zoning. Anything less is a joke and is seen for what it is our land grab pure and simple the overly discriminatory. Mha as a ploy to take private property out of the hands of seniors middle-income earners, Asian Hispanics and blacks from the CD and south end and place it into the hands of greedy developers. If you think we are going to walk away from my property while the rest of Seattle goes on with their lives as if nothing's happened wrong answer that's not going to happen to suggest that people of color sell their land and return to rent from the very people they sold to is an insult and absolutely appalling. Seattle citizens from Magnolia and Laurelhurst to Mount Baker and parts in between rejected the mha because they know the value of property ownership. I asked Debbie home owner renter business owner and pro bono attorney to stand with us in solidarity as we fight this Scourge to protect our right to own property and to live in Seattle. We need to tell Derek and at her racist machine that we value diversity and rejected vision of an all-white Seattle. If you want our property, you'll have to fight me for it. So call off the pitbulls and fat cat developers. Thank you. Yes, Miss Richard here after 6 months of a trespass. So I went into my archives and brought out the central connector. July-september will July through September 2013. So that some time ago and I still have it so nicely laid-out program of what they have going on up there. But then what I see being produce down here is telling black people in 2019 that that they're not that they're not good enough to lead. They're not good enough to hold on to something that their children walk through there. They had funerals maybe up in some of those places repasses all kinds of things that I know for a fact that went on in those two buildings. And now you turn around in this is 2019. Like they said a new breed of institutionalized slavery. And the worst black Massacre on us the object. You see I was just coming up with dr. King was being murdered. But now I'm full grown now and you're still perpetrating a fraud on us. I say no more. Okay no more. Michael Fuller is next. And after that we have Cassandra Smith Saturday and Siegfried and Jim wigfall and apologize. If I don't say your name correctly. Do you want as I continue in prayer? I can't help it because I was in a coma for months. I can't help it cuz it took me two years to learn how to eat talk and walk again through the grace of my God. I can't help it cuz I have brain I can't help it. But I always remember what my to neurologist told me that people will try to take advantage and then because I have brain that is enslavement as of August the 2009 you'll get in where you fit in dried that violates the first 10 Amendments of the Bill of Rights against our own horses female than male 100 2977 343 firefighter, Jeff and 19. One America. When is the Warren American Title 18 USC chapter? 73 18 u.s. Code chapter u.s. Cold 2441 war crimes so why you're not fighting for me, but this is not the time or the dream country race. But my God got your address and your phone number cuz you my friend Cassandra Smith. Then we have Saturday in secret dungeon break fall. And then we're Joan Poulsen. My name is Cassandra Smith, and I'm a product of Seattle group across the street from Garfield High School scuse me groups across street from Garfield High School. I've been able to be blessed to travel in and out of Seattle most of my life and I watch the decline of minority Community as well as try to tell we're also grew up some watching communities dispersed. So I was standing here today. My question is what is your Exchange? Because sometimes you don't have to ask before you take but consider considering where would you place the seniors if you took? That's my question. Where would they go? What would they do? Because the same way back in the early part of the 90s back in 91 92 where they went to ask people for their homes due to ignorance. They sold their homes, but not knowing until 2019 is still the same take your taking and you're taking so I'm asking everyone please sign and stand up for what matters. My name is Sarah James Siegfried and I'm here as a regular user of the central Seattle neighborhood Coalition meats are monthly this is about our community place has the gathering places for seniors to attend programs to socialize and to maintain nutrition as we age in our homes senior centers are essential. We know that seniors who isolated that they live shorter lives are more likely to deteriorate and actually died years earlier than seniors with active social lives Seattle has long underfunded and neglected at senior centers given our commitment to our social justice initiative has an immense 2 years of racism. This delay is inexcusable. We ask Mary gherkin to transfer the central Greenwood senior center in bird place now without delay. Thank you. My name is my name is John Wick fall, and I'm the CEO of sound generations and the city council had the foresight to pass a resolution requesting the Merit to transfer the ownership of the property of a bird bar place and Central Area Senior Center to those organizations by the end of March and unfortunately due to her in action. I look forward to the city council taking the lead in ensuring that the property is transferred. Thank you. John Paulson, we have Mindy Lee Lori lucky. Am I saying that right and John Barber? My name is come here today to support the legislation for all three organizations to be approved. There has not been any mayor in the city of Seattle since the late 60s early 70s who have moved to had on these three projects and I don't expect a lot out of our current mayor in regards to that either because this is an issue of social economic Justice that needs to be remedied and put forward so I highly recommend that your committee move this week if at all possible to move this the three projects together and transfer of ownership because the mayor has not fulfilled her obligations. Thank you. Hi, I'm manually on a member of Puget Sound advocates for retirement action, and I have never been to the senior center. But what I'm seeing here today is community and it's amazing as you. And as much as people need food and family and a place to live they need Community. It's another part of people's lives that keep them healthy. Keep them connected to vital. Don't let the don't let the marriage sell this property away just because it's got a good view these people need that property. No more. My name is Lori lucky and I've been a member of the Central Area Senior Center for 4 years. I'm a retired University of Washington research administrator and I go to the senior center mostly for line dancing and for the meals but offers for the social group that is there and the welcoming atmosphere from the moment. You enter the front door. I think that if we look at overall membership of the senior center, this is one of the most heavily African-American centers in Seattle. This is seniors who grew up under Jim Crow and discrimination. They did the lights didn't want to do if they were white and didn't need to do because they were privileged these people deserve their senior center. They deserve to have a nice place to go and see each other. They represent the institutional history just like the Northwest African American Museum does of African Americans and blacks and black Seattle. Set the social history is in their minds of black Seattle and the proud citizens that it represents and they are the most deserving chooses not to give over our control of the center and tour excellent director Dianne Ferguson. I will consider that she's just a part of what we think of as institutionalized racism. Thank you. The more chanting we have we have Sharon sobers Outlaw and then Madison McCombs. I think it's extremely important to enable the transfer of ownership of the Central Area Senior Center to the community organization. That's had its dream of this for so many years my wife and I moved to the neighborhood 1971. We knew at that time that there was a group that organized the Central Area Senior Center looking for a home and we were there in 1972 when there was a Statewide bond issue the Health and Social facilities bond issue. Got it passed by a vote of something like seven hundred thousand of 500000 voters in in, Washington. To tax ourselves to have this kind of community facility fees bond issue money is helped by the property. If it's being at the center, we've made many many friendships. We've enjoyed the the health benefits of the program's there. It's it keeps us together as a neighborhood. Like this is supremely important to keep the facility operating as a senior center. Hi, I'm sharing so was Outlaw and I am a resident of Leschi Community. I've lived here for 35 years. I was single parent and I'm still there. I'm there with my mother taking care of her at this time and I am X board member of the senior services where I played a major role in keeping the Central Area Senior Center there and I watch for that and I will continue to fight. I'm also the ex-president of the West Side Community Council where I also fought for the community to remain the same to a make improvements to make the park. We made Power Burnet Park that we could live in that we could work in our we made flow rare Park. We did all of that. We supported that we got the money to do that for us to be able to enjoy it which we are not being able to at this time because we being moved out. I have worked really hard. I was also on the central district council with mr. Miskelly who has been my mentor who has taught me how to fight for our community and I stand here today to fight for Central Area Senior Center. I will not go down without a fight. I want us to continue to have that Center. I want you to tell you a small story about myself. I was strapped with arthritis about 5 years ago, and I wasn't working and I went to send you as soon as I've always been a part of that Center, but I went there and I went to the Slackers every Friday I could hardly walk, but I began to walk again. I went to the sliders every I went to performances and I walk and you see me now I can do anything. and that's because Mister be up on a daily basis and was able to be a part of thank you. Hi, my name is Madison Macomb before Madison goes we have after medicine. We have faster Vic Langford then Norma Roberts then Nancy Brockton and then rev. Walter. Wanted to see if you would buy my name is Madison McCombs and I'm an organizer at the Seattle and a student at Seattle Pacific University. I'm going to be commenting on item number three of the agenda, which is rent control and extending rent increase. Also just want to comment that everything that we have been talking about today. I'm fully also supporting as well. But I believe that rent control and extending rent increase notice policies that will help me Seattle a more Equitable place to live. I'm especially across people of various financial and economic class statuses and we got B Seattle also believe that These policies will support will increased ability for people in Seattle who are the most vulnerable people of color women and female-headed households the elderly and poor communities. These are the people who are policies need to be putting at the Forefront of our minds and prioritizing and putting first and policies like these need to be prioritized and overall if we prioritize the most vulnerable people in our society. It will make Seattle a better place for us to live for all of us, so I wouldn't mind I just reiterate that. I am representing the Seattle hand myself and multiple other individuals and supporting the policies of rent control and extending rent increase notice. Thank you. I'm Pastor Greg Langford minister of the Saint Mark's Lutheran church, and it is my pleasure to share three questions and I invite the community to respond with me. My first question is what do we want Central Area Community? What do we want stroke areas? I said, what do we want? When do we want? When do we want it who must hacked on this Pumas ex-mayor? one more time Puma FAQ Okay, my name is Norma Roberts and I want to say to the city and the government to stop hiding behind low income and affordable housing when they want to take property from senior citizen and owners. What's low income and what affordable housing can afford a view like Central Area Senior Center has so if she can tell me who can afford that. Thank you. Next time you reach and let's also hold up the red placards every time a chance. Okay battle City Council. here today Let me calm down. Okay, my godmother has been a member of the Seattle Central Area Senior Center for the entire 51 years. She's a bridge player. She was a bridge player 98 years old, but the community center was her safe place. She loved to go to the community center and I'm for plastic. The city has no problems with the other senior centers. They seem to be eager to turn this building over. I love the senior center. I actually attended a diabetes workshop and I don't have not diabetic but I just love all I tried doing them slide, but I don't slide. Well. You go up there and just join the seniors for lunch. I just love being around seniors. I'm a senior but I love being around the seniors at the center or like 80 90 and that's their livelihood that's their life and to take that away from them is totally disrespectful. So it's a it's a place where the seniors can partake in any of the many activities and they loved it. So I'm going to step down now and say not this time. Are you going to know what the last people in public, And then Alaska all the presenters to come to the table after she finishes speaking? Good afternoon to do what's right in the world. There's always a good time to do. What's right, and I you know, we're here because everyone we have a right to be here. We are the descendants of the stolen ones that before the Thirteen Original Colonies. That's how long we've been in America. So we have we have a right to be here as always speaking in this right today and I'm speaking from the police academy. Love to have the use the center more than once and now I've grown to be a senior. I'm grown to be a senior and not a blessing. It's a blessing to grow. Well in the senior said I help keep people well and you know what mail Durkin it's no it's no excuse, you know, really and truly can't hide behind anyting else. This is the age of instance whatever. So let's just do the right thing and I just really showed that you really have some respect and that you believe that we can actually do the job, you know, black people helped build this country. So we know that we can keep the senior center Dan Burke bar and all the rest of this is all we need is an opportunity, you know, we just want you to put a crack in the door and we'll come on then I'll write the James Brown said we'll get it for myself. So thank you everybody who spoke go to the restaurant and the Republic, so we have some stuff we have dead bird on Whose policy analyst and my office will be joining and then you all. Why do you want to come here? Just wanted to clarify we have Like I do biking. Sonique Dimitri also come I ordered us a lot of the politicians here don't like this kind of a meeting where community members are here in big numbers are chanting demanding their right but I have to say that is exactly the kind of thing that gives me the most pleasure. So thank you all for being here and thank you for demonstrating. What city hall ought to be it is city hall, right it belongs to everybody in the city. So you have the right to be here. Just for the record just because we have to connect a meeting in a certain way just for the record. I would ask each person shouting. Give me one as I don't think reduction and then we will have Jeff Sims from Central job interview some of the points like the background and then it's a free-flowing discussion. So, please feel free to executive director of Puget Sound advocates for retirement action, operations assistant at Byrd Barr place place Area Senior Center. Garrett africatown Community Land Trust call very much for being here Jeff. Can you kick us off the situation in which the tenant holder pay his portion or all of its leased by providing services that are found to be mutually beneficial for both the city and its residents in the the agency some agencies. Do you also make a cash payment for that typically would not be anywhere near them out offering Services. I'm going back seven years as you alluded to earlier the council in 2012 as part of its budget proceedings past of slide number 58 182 in which should ask to explore the status of the MLB properties. And also look for recommendations on feet on actions to take the some of the highlights for a sound that the status quo situation was not sustainable due to the increasing cost for the maintenance of these buildings the report the response to these that could ever provided recommended the sale of the property to Byrd Barr place. Also recommended the transfer of the property to the Central Area Senior Center after the after the sample Area Senior Center was able to demonstrate the financial ability to maintain the property in 2016 the office of housing for Seattle on state examinations of both bird Bar & Supply Area Senior Center in the term that they were not suitable for affordable housing more recently ology fireplace at that time Central Stone. I received in the 2015 to 2017 capital budget from the state a grant through the building communities fund program. It's a reimbursement grants at so that's 25% of the work that are is put into Renovations or Orem maintenance of the building can be reimbursed after those those funds are expended that was re-appropriated in 2017 to 2019 to 2017 to 2019 appropriation and for the capital budget, meaning of those funds would expire on June 30th of this year has council members want noted at this time. Find Oregon re-appropriated in the 2019 to 21 2021 house capital budget. Do not yet part of a final bill since that is not have passed in 2017. So lay tile contractor hired by the city Truman recommended the transfer of these properties as well as the Greenwood Senior Center 31856 and I most recent budget discussions in which the council resolved to collaborate with the executive with a goal of completing a transfer of these of the city-owned properties on quote. As a result as you know, there was a deadline set of March of this year for the executive to proceed with the transfer of those properties at this time. The mayor's office has drafted some criteria outlining of the way that they would sassa when it would be appropriate to transfer a property that with a mutual and offsetting benefit lease. These criteria were purposely drafted to apply to all six of the properties that the city has with mutual and offsetting benefit of pieces. Not just the three that's our most notably and have indicated interest in having the property is transferred. In addition. There has been a meeting with both Byrd Barr place in Santa Clara Senior Center and also if any bread Association which operates the Greenwood Senior Center to obtain comments on this criteria and have any edits made those comments from what I understand have been submitted and we expect that their final criteria should be provided to the council pretty close to May 1st of minor things might be May 2nd at this point butts on May 1st, 2019, which outlined final criteria that the executive would use To determine that it is appropriate to transfer a property and then begin to engage in negotiations for purchase and sale agreement. And for the question council member are so if you have questions will will make sure to note them and I was wondering if Diane and Andrea want to do go next and describe their experience of what happened. And what do you think? I'm glad you have mentioned the criteria that the mayor's office of outline. How do these fall into our discussion of an agreement that was supposedly made years ago and and the community has been trying to do this for 7 years Senior Center and I think Bert bar in to some extent Greenwood finish years are same concern is that the eligibility and evaluation criteria that was presented to us and an interdepartmental team meeting on March 13th, really went far beyond what we Necessary in terms of what the referendum noted as to how property could be sold or transferred wanted us for one thing. It added a whole new criteria. Yeah that was not a part of the original referendum in which the state and the people voted to make sure that the Central Area Senior Center site the Greenwood phinneywood site could be sold and that was they wanted us to look at an offer to them a development feasibility plan as to how we would develop the property until the minute that I saw that I immediately wrote back to the interdepartmental team and said this was not something that was a part of the original referendum money. It was not part of the 1975 contract that was signed by then-mayor with Oldman with a Department of Health and Human Services were the property was then transferred to the city of Seattle after the alarm. It was successful. And so it really was a can of worms your open up a can of worms because the criteria was that if we wanted to stay on the property we needed to present to them a development plan for fordable housing, which we know is a can of worms and my response to them was this is not part of what the resolution said that was passed by the city council on November 18th. It's not also not a part of the referendum requirements and we know that it's a very loaded question and something that we could never satisfy and that in our work our work at the Central Area Senior Center. One of the things we had to do was meet with all of the various department and we met with the office of housing. We did a study ourselves as well as the office of Housing and the first thing that they noted and wrote in their report that because we are on a steep slope on the 31st Avenue side. It could never be affordable housing because it would take so much money. To develop and firm up that slope that before you did that to actually build a housing. It could never be affordable. We threw our Partnerships and relationships with some of the media and the public information act that I would suggest everybody utilize we were able to get a copy of the redacted information. Where are the mayor and her team met on December 7th of 2018 and actually drafted the criteria of Eligibility and evaluation for the November 18th MLB properties and at that moment in time the evaluation criteria also suggested that at the Central Area Senior side. It would be a wonderful sight to build 10 single family houses. And so we're just real concern. We just want to move forward because we think that it is not honest and it's disingenuous to what the resolution was that was passed by the council. Thank you very much. Can I ask you one follow-up question and then we'll open up for discussion you you mentioned and of course we'll meet another of the breast, as mentioned that referendum. Can you a lot of people who are watching this and you know, people are also watching it on online because it's available for them online to Seattle channel. Can you tell us when this referendum was passed? What did it say and clearly, of course you're talking about the ballot referendum Between Borders has spoken there. Well, yeah, so I actually have it because we quoted it in our a piece that we in our memo that we sent to the interdepartmental team on March 26th. So referendum 29 what the legislation said was the transfer of real property and Facilities to nonprofit corporations public bodies, May transfer without further consideration real property and Facilities acquire constructed or otherwise improved under the Social and Health Services facilities 1970. To bond issue to nonprofit corporations organized to provide individuals with Social and Health Services in exchange for the promise to continually operate their services benefiting the public on side subject to all the conditions in this section. Furthermore. It's is a nonprofit corporation should use the real property and facilities for the purpose of providing. The following programs is designated by the Department of Social and Health Services facilities for social services adult and juvenile Corrections or detentions child welfare, daycare drug abuse and alcohol treatment mental health Public Health Developmental Disabilities and Vocational Rehabilitation, the D transferring the property and subsection 1 of this section must provide for immediate reversion back to the public body of a nonprofit corporation of the must revert back to the public body. It's a nonprofit corporation ceases to use the proper. For the purpose described in the subsequent one of this section and criteria written into the law include a transfer too loud without no further consideration be a written promise to continue to serve the public see the deed must provide for immediate reversion back to the public body. If a nonprofit corporation ceases to use the property for the purpose is described in subsection 1 of the section. So that is actually what the referendum called for and in the case is Central Area Senior Center the purchase price in 1975. If we can imagine was $300,000 and the money for that property 185000 of it came from the referendum itself, which was voted on by the people Sunrise which actually was a Jewish Convalescent Nursing home that was built in 1955. When it the seniors at the Central Area Senior Center who was already operate. Programs to have the facilities so much so that they gave $100,000 towards the effort of the $300,000 and then the members itself collected another 15,000 to make up the 300,000 at purchase the building now the city did have two under the guise of Mayor almond who also was very Pro advocate for the senior center. Then went to the city and got a MoneyPass in the amount of about $87,000 to remodel the facility so that he could then be used for a senior center. But what the referendum clearly shows is that property can be transfer you don't have to do any developmental studies and feasibility studies. What you have to do with is continue to provide your services and continue to serve your community in order for the transfer to occur and secondarily the other most important thing of that is Is if you cease to not be a nonprofit organization and to provide the services, then it would revert back to the public entity which in this case would be the city of Seattle. Thanks. I'll do a little bit of a history walk leading up to the present. So our building fire station 23 is 111 years old brick fireplace store. Camp has been in that building since 1977 and it was identified as access property by the city 7 years ago where we then expressed interest in ownership or a long-term leases were currently month to month as a result. We've been an ongoing negotiations with the city and these negotiations with began with Mara McInnes office. Continue Tamara Marie, and now we're Jerkins Administration during these times we've gone through as Diane said silver rounds to prove to the city that we have the capacity to manage this property. We want to own the property so that we can retrofit the building to make it safer in the event of an earthquake and there's a lot of talk about seismic events to attend. We happening in Seattle and we want to bring the facility up to Ada standards and modernize a disability to be to be able to provide a higher quality of services to our community having ownership will allow us to use the authority and stability to raise Capital to invest in the building as you've heard. We have been challenged with this specifically we have that legislative appropriation of 1.5 million dollars for renovation. The legislature simply won't hand over the money because we don't control the property the funds will expire June of this year. And yes, we've had a request extended due to this administration's delay and though the current state capital budget does include an amendment that would extend our funding for two years. It hasn't been passed. So nothing is guaranteed. We also have other funders who need to guarantee that the property will be in our long-term care before they will invest in our Capital campaign essentially councilmember three different administrations over a seven-year period has made commitments to us regarding the transfer of this property and the senior center with each of Tration conducting some level of assessment and Indian agree with their own internal assessment. Every time that these two properties should be transferred to us. This property has been committed to us both verbally and in writing which we both have documentation established that we meet all documented criteria for a transfer they even went as far as saying that they are confident in our organization's ability to manage a property after transfer. The property was initiated in 2017 and included six organizations at the time and place the central Greenwood Senior Center South Park Community Center Southeast health clinic and Southwest Senior Center three of those properties which includes s in the senior center and the central were slated to be completed by 2018. This round of transfer stalled when the city yet lost another review. This mayor's office has created an interdepartmental team between the office of Economic Development Department of neighborhoods finance and administrative services to develop yet additional criteria for transfer recently. We've had several meetings with the city to review these new criteria, which asks again for another layer of documentation on our operations Financial viability technical capacity and ability to maintain the facility among others. Prior to former mayor Ed Murray his resignation. The property was to be transferred to our organizations by mid 2018 as it was determined that in addition to the benefits of community organizations housing these properties that the city also stood to gain from these transfers as a large Investments. We stand to make and seismic upgrades and elevators are expensive also transferring properties would remove the city's financial responsibility to provide basic maintenance and allow organizations to raise funds lastly as you know, council member in the fall of 2018 city council adopted resolutions 31856 calling from are gherkin to transfer this property and other properties to community letter organizations no later than May 31st of this year. Now. We keep being told a formal letter of intent is the next step for the process keeps dragging on with no formal letter today. Essentially we feel there's a goal post that keeps getting moved on us. Yes. We should get into some of the point that I've come up, but I just wanted to also give a chance to we have this is an incredible opportunity. We don't we don't often offer able to resolve our we have so many members were rooted in our community together in one room. And it's I think it's very important to hear from Viking. What why why why do you can you share with us why it's important for Africa down and our community Central District and especially how the preservation or not preservation of these two spaces particularly effects are black community members and then Mike if you could also share why basara cares about this and that's also important because many of the members of basara are retired labor union members. Why should the labor movement care about this? Sure. Thank you. I'll I think it's been well stated by Diane and Andrea the facts of the record and I mean just to hear that an institution of this magnitude and this long long of existence is on a month-to-month leases is is ridiculous. I mean, this is reminiscent of sharecropping. What can you do in a capitalist Society, you know with a month-to-month lease. There's no way you can leverage that asset to grow and that's the whole Foundation of what we see happening around us. The predatory developers are leveraging over leveraging they crashed the economy by leveraging and so it's just a real shame that we would even hear. It stated that we have an institution that is working for the social good every He has been for over 40 years and it's on a month-to-month lease. So that that end in at the same on the other side. We're hearing Equitable development and you know all these things each day. And so we just want to let you know have these issues resolved expeditiously. We know new rules keep coming into play new delays. And as you heard many times no more delays we want to take what we currently have and plan for a future that includes us and we need action not just rhetoric to move that forward. And so we we've heard and we know this other institutions and assets in our community that need to be protected they are in the you know public realm and they need to be leveraged for the highest and best pub. Use not the highest and best, you know, exploitative use for someone that just, you know, flip the property and move on. We don't know where this capitals coming from. It could be any state any country but we know that our community has been here rooted in the central district for over a hundred forty years has made significant contributions to the city. And so this is just a basic matter of dignity and respect for our elders and our community and our children and future Generations. So as the name suggests Puget Sound advocates for retirement action as a senior advocacy organization. And in whatever we do we start from the premise that seniors have a right to live. And not just exist or not. Just so obsessed but after putting in 40-some years working building the city making this city run Cedar Sheva right to retire in at least modest comfort and security and part of that is to be able to have public spaces where they can come together with other seniors with their family socialize have a nice meal play cards if they want to learn to play the guitar if they want to our organization has put on a number of educational events at senior centers all over the Puget Sound area including the Central Area Senior Center this chanterelle and ones like it or absolutely vital. For seniors because one of many many studies show that one of the leading killers of seniors is social isolation. And the testimony that you heard before from some of the people who use the senior center is much more powerful than anything that I could say in terms of statistics or study. This is a vital part of the community and you know particularly for the central area where people who have grown up in that Community have seen their Community eroded away by gentrification. This is a valuable public good that the city needs to maintain, you know, it would be not only bad policy, but it would actually be an act of Cruelty to seniors to do away with the Central Area Senior Center. Thank you. I just wanted to add to what the gentleman said in and what others have said that this is a matter of life and death and what the communities asking is that or not even asking demanding is that this genocide or behavior? Because everything that exists needs a space to exist and so once you take away the space that you're saying that you don't have an expectation for whatever was there to exist anymore. So that means if that's our community our seniors are lies, that means that there's a plan for it not to exist in Seattle and we know you keep moving people spreading them out, you know, relocating uprooting them. There's actually researched from the Center for Disease Control that shows that this type of displacement has significant negative impacts on the health and well-being of individuals families and communities and so in the face of that there should be no delay and making sure that our community as well and stabilized, right? So the other thing that's really important. It's on yesterday Bert Bard myself in the Greenwood Phinney received a letter from the interdepartmental team about our negotiating process a process that in many ways is disingenuine to myself one of the requirements that they asked of us was to project out for the next 15 years. What are cost and our expenses would be and my response to them was if you give us the last fifteen years we can project out to the next 15 years and I'm still waiting to receive that I have not received that yet but in his letter yesterday, the last paragraphs is the transfer of property by the city will include consideration of affordable housing. We continue to believe that given the city's current housing affordability challenges. It is in the public interest require that any plan Redevelopment of a city-owned property include consideration of the feasibility of providing a Ford Will housing therefore we expect to require adorable Covenant allowing the city to participate in any major Redevelopment. So the Redevelopment can include affordable housing. So this is the issue. The issue is is that we are in a residential area that is zoned for residential. They would have to change the zoning. We also have a million dollar view that all of us can benefit from we know that are affordable housing will not be built on that property by the city of Seattle. It is disingenuine. It is not an authentic. It is insulting to suggest that of all the properties in the city of Seattle that this property is needed to build affordable housing in a residential area. And that is that is the best benefit then a community center and a senior center where everybody can come to on a daily basis and participate. Furthermore it is not a requirement. It was never requirement of the referendum money that the city received for the property. They said that the building could be transferred at any time to the nonprofit organization as long as they continue to offer their mutually offsetting benefit and so Central Area Senior Center publicly and we'll stay this in writing to the city that we do not feel that development feasibility is something that the city should require of us as a condition of owning and having the property transferred to us because we know it's not authentic and genuine plus legally in the money that the city received. It was never requirement then right. I'm here for you. Come on. What do you say one thing in response to the points that came out but I also wanted to let everybody in here know that my staff are Distributing these sheets to all of you. Please make sure you fill that and because we want to make me remind me to take pictures of these and make sure that we have something that we can use for our follow-up actions because I don't think this I don't as as glorious as are organizing as being for today, which I think we should really we should be happy about our Collective effort. It will not be enough experience shows up with the fight will have to go on I have no doubt that we will we will win but we will have to keep fighting as many of you have already said and I think I'm really glad I am that you you according from the letter in this letter has been written in 08 and on behalf of the interdepartmental team, but it's signed by The director of the Department of neighborhood which is the city of Seattle Department that reports directly to the mayor of Seattle and they do talk about, you know, SF Giants at the transfer of property by the city will include consideration of affordable housing and Diane you use dated some very important points about why affordable housing is actually not feasible on the Pacific Properties at the Central Area Senior Center lives in but I also wanted to say that I think that logic applies to BART BART place also and I really think as we I think we know this but let's stated like it is what's happening is that when it comes to the needs of seniors of our black community and are working class community members then they say they are what they're trying to do is spit this social space for seniors against affordable housing. Except I kind of false choice because the same Community Senior Center are also the ones that are getting pushed out because of the lack of affordable housing. And so I really think that we should or other but what do you think our response should be to that let you know how should we respond to that King said earlier that we have an Administration that needs to stop putting the economic advancement of a small few and head of the well-being of vulnerable populations. Senior Center & Byrd Barr Place provides stability and predictability and safety 2/18 thousand households annually in the city of Seattle and that contribution to the city to the residents of the city of Seattle. We are old a return on that investment by the city of Seattle. Show I just want to follow up on on the idea of the city trying to pick affordable housing against social spaces seniors obviously need affordable housing as well. Because even if you know you you're retired as an ex Union member you were lucky enough to have a good union job and to retire with a defined benefit pension. You're still only making a portion of what you made when you were working. And even for you know for our members are retired union members are retired Boeing machinist who retired with good pensions, although they can no longer retire with defined-benefit pensions, but the one who's who were able to are finding it more and more difficult to afford to live in Seattle. And so we need both we need both our social spaces for our seniors to gather and to build a sense of community and we need affordable housing and we need affordable Transportation. You don't and we need good medical services and we need access to food because many of our members living in Chokehold food deserts where they don't have LOL, I just want to be real clear. I am not saying that I don't support affordable housing because every day we come to work or working with our members trying to find some housing shared housing cooperation with each other, but we know and so this is what we have to call out a lot of times. We don't let like to be specific about things. What is specific is that the site that we are on can never be affordable housing because it is too expensive to build on that site. And so we would be co-opted. We would be disingenuine to try to pretend that we could achieve something that's not achievable. We are realist and we know that affordable housing will not be built on that property by the mayor could be built by Amazon or Google or someone with a lot of money, but then it ceases to be affordable and it ceases to be community. And so it would it is not our place. It is not to the interest of our members to take away a social space and we know that that is a disingenuine thing, but it's a great talking point. If we all ran around and said let's build affordable housing and we don't bottom down and go well affordable housing can be built there, but it can't be built here. And then you have the seniors thinking that all they're going to put affordable housing on this property and then I'll get to leave here as well as have my community center know it will not be built for you. You will know. I'll be living in any housing that gets built on that property because it's too expensive and we cannot afford it. So let's keep it a community space. Let's honor all the people who come before us who worked really hard for that space and I think that we can answer our questions of affordable housing homelessness in the city of Seattle if we have the will to do that, right? But I like that today I just like to add you if you know many of the elders who go to the center or homeowners in the community and they are facing pressure of being displaced from the affordable housing that they already have and so if this is the primary concern that we need a robust mitigation strategy as the zoning the up zones have happened. We need to make sure that our community members are able to stay and grow in age in place as well and also have a path for their grandchildren to be able to continue and hold onto the property. We understand is deferred Tax Strategies, but still at the time that they pass all of that is due and can become an undue burden. So if this is the case, we know we it's been, you know already proven unfit. At that site then let's start focusing on where it is feasible in our community to have more affordable housing to have more Liberty Bank buildings in to have the community or members that own their properties now continue to maintain ownership if that's our primary concern which is which we share right? But again, we don't want to conflate the issues and confuse the people absolutely anything that that is the main thing that we know in terms of your becoming to wash the clothes for this discussion, but we're not by any means close to the end of our fight 2 windows. So I think one of the things we will need to do as a as a community as a movement is to as as our speakers have sex to reject this false dichotomy between social space Community spaces and affordable housing because it's the same community that needs both and in fact, we are at this moment losing both working families are losing both social spaces an affordable housing because the city is fast becoming a place only wealthy people can live and that is also meant a massive displacement of our black households and so strong and we would die on that. This is a disingenuous Ploy by the mayor's office to say that we are not going to transfer this property. Property Santa Lucia was evident that you can build affordable housing. I think I think it is important that our movement against said and as Andre another said we have to we we should not fall into the Trap of there's always you want to save the Central and board but somehow you're against affordable housing. We don't want you know, this is because they are trying to reduce the legitimacy of our Demand by saying well, that means against affordable housing instead. We should turn back and tells us the mayor if you care of about affordable housing so much. Are you going to support the rent Control Ordinance? Are you if you support affordable housing so much. Why did you and the majority of the council repeal the Amazon tax which would have built affordable housing in our cities Bay by taxing big business because our homeowners are already overtaxed to property taxes, right? So I think we know Fortune Falls make sure everybody filled. I don't know where that went though. The thing that I had held up. I can't find it now. Make sure you fill that out. And I know many of you have the plan to go up to the seventh floor and demand that the mere listen, I think you should unfortunately I cannot because we have the agenda item to discuss rent control. But I do want to say one thing before we all disperse. We are we agreed that this was only step one and we need to continue the fight. Step has to be even bigger. I think we can get hundreds of people to come out with us. We should aim. I don't have the date and time we should coordinate and figure out what works for our community member but I think our goal should be to next your neck at the next step in a few weeks have a big rally that brings hundreds of people either at City Hall or in our neighborhood. Either way. I have no doubt that it will put a lot of pressure on the political establishment and the mayor's office and we should also I think have a letter-writing campaign. We should send emails to all the council members anime are very happy for for my office to share draft if that helps for the main point that we should make and that is exactly what I was because of said which is that we reject this false dichotomy between affordable housing and social spaces. If you cared about either you wouldn't have done what you have done so far and you would be supporting us in property transfer. So what we need, Is the immediate transfer without delays of these properties into Community ownership and we need to tax big business to find affordable housing and we need rent control and we should make sure that our movement to save the Central and the board bar place also brings renters alongside us because there are many many renters in our community who will support our homeowners as well because we are both struggling against gentrification and displacement. So let's make sure that our next step is even bigger than today, but I wanted to congratulate everybody for such a phenomenal action that we did today. I think all of us are grateful and we want to thank you for hosting this press conference as well as this committee meeting and I would actually go a step further and say that in the resolution. It was very clear that if the mayor did not act by March 31st that the city council would at and I think part of what we need to do is to help the city council frame their own thinking about what kind of action should be taken. I would hope that the action that they would frame with our assistance and all our advocacy was to actually do an ordinance that are required a resolution is soft a resolution says, you know, we want you to do this and just like anything the mayor or anyone can say well I'll take that under consideration and and have a lot of criteria and evaluation process that you'll never achieve in a year and a half or five years. So I think we should make it stronger and our actions should be to acquire and work with the city council to pass an ordinance. That can override what the mayor can do because it would be something permanent and something that you'd have to act upon so I know that our members would be very excited to work in a joint partnership with all the city council members and with all the MLB's particularly Bert bar in central so that that could be a reality and so that 5 years from now, we're not having the same conversation but that by the end of December 31st, let me know we will have that and we will add fire stations. Yes. We have an impact at the at the meeting that we had on Monday that you had organized and I I said I absolutely will be will be working. And in fact, Jeff is making notes as we speak. My office will be working on bringing that ordinance for work. There's no question about that and we will be doing that work and Jen policy on the lights in my office will be working hard at it. There's no problem with that. The question will be how will we get? The city council member to do the right thing because it's not just the mayor that's on Mega just about the mayor because it is most of the politicians here in City Hall will be doing what the big developers one. So it's not going to be I don't want to give people the impression that it's going to be easy. Just if if my office dropped an ordinance that doesn't mean we're going to win we're going to need the ordinance that we will make sure it's charging but we will need you know, we will need Mass actions like today to make sure that they're listening and why do I know that because we have done this many times and we have one Victory we start with me being the only council member at the table and then we end up with nine votes does $9,000 we can do that again because we've done that again and again, but the only baby I've done that is to make sure that all the politicians here, but the mayor and the council number to know that we are serious about fighting our fight. Thank you everybody. And I let's if you if many of you are leaving let's those of you who want to go up. Can I have one? What do we want to go upstairs? Please meet my staff member at the door and they will show you the way. Thank you so much. dinosaur museum near me people that we can move. Disingenuous Do you know? a bicycle with me Commendation like her up the camera so we can see how we're looking we have one more. Do you want to sit next to me since you're since we're talkin work plan. It'll make it easier with the cameras. little bit This is not my glasses. So I really appreciate you all taking the time to wait for this item. I know we are delayed and I apologize but as your and Madison said these these two issues are related. So can we start with introductions for the record and then you can take it away? I'm Jessica Western and I am the co-chair of the Seattle renters commission. I'm Christian and I'm Devin silver now also a member of the renters Commission. Great. No need to apologize about the delay. It seems like they've waited far longer than the best work plan for 2019. A lot of it is actually come back over from 2018 because the action items we've chosen are going to take longer than a year to solve. And in order to achieve this ambitious work plan B created several workgroup Steve run stabilization / rent control group the housing Supply Group renter protections group and Outreach strategies for engaging renters Christian and I are on different workgroup so we can speak to what the work plans they're doing. For housing Supply we've been working a lot about how to increase affordable housing across Seattle is a whole some of the key ticket items before it loud Lawton Housing Development, which is very important and can serve as a model for what we can do. If we ever get another land opportunity like this again like the Intervale and that's coming available soon. We have worked on 3 housing affordability and we are currently working through accessory dwelling units and detached accessory dwelling units used. I Do's or backyard Cottages mother-in-law you beyond that. We will be exploring other options for increasing affordable housing Supply throughout the city as they are brought to our attention. So that work group will always have something to do as far as I'm concerned because we have not enough affordable housing anywhere. So that's what the housing Supply groups up to. Yeah, rent stabilization rent control from some of the letters that leaves only are we looking to address a test to read how do you spell to the 180-day of notice which you know and have that rent increase tight inflation awaiting wage increases the Statewide ban on rent control and then we also had a letter on that as well that went out and then essentially had a strategy that were calling for city council the mayor to support an ordinance that would put in place rent control effective immediately wants to say hi band on rent control is left dead. Protections group is different than that in such that we look at other protections. This year will be looking at what protections we can do to help immigrant populations stay house get house in general and also avoid displacement how to support undocumented immigrant renters, but it's important for this work group to look at the effectiveness of existing tenant protection laws. What works what doesn't work why things were brought on may be why they aren't working and fix them that way rental screening criteria is something that can help renters all across the board weather is a work at Amazon or they work at a coffee shop or they live on sub city and also looking at things like my coach or just mentioned am ending the rent increase law because the 30 day notice and 60 day notice is one of the more punitive notice periods Nationwide Show the renters protections group. We like to hear feedback from renters in the city of find out what they're experiencing and meet as a group in disgust, you know from our various backgrounds how we could tackle that situation and make it a more legally safe place to be. Addition to developing some Outreach strategy so that we can engage renters in this work. We also want to find ways to have assistance for renters. I would also have the economic eviction assistance program as well as some trap some rental assistance vouchers an affordable affordability portal so that people have a centralized location to be able to speak on that assistance for billing purposes and first right of refusal to purchase apartment buildings and you know, especially, you know, I'll just break script a little bit here to say this is really a huge passion of mine as well as as we will get to the social justice pieces in a lowering barriers as I came to the renters commission after working and direct service and Housing, Services for almost six years and a lot of us has worked in these spaces. I just want to like underscore that a lot of these things may sound like Oh how we going to do this for a little bit pie in the sky, but I have seen this I'm tangibly not only my family but also professionally with the clients that I served in thin previous. So what is underscore speciality assistance for renters cheese and having an Outreach strategies for engaging the renter so that we can get the narratives of what's Happening all the ground which is one of the biggest issues that I saw working in Social Services that there were things that were happening decisions being made at the higher levels, but for us working with the community that those narratives for not as Amplified reaches really important cuz we can make as many protections as we want for renters, but if they aren't aware of what those protections are and and conversely if if landlords are aware of what those protections are. It doesn't create a good relationship and that's a very the relationship that needs to be at, you know, everyone needs to know who can do what when you're talking about, you know. A a property manager and a tenant. I don't think a lot of tenants know that they should look to sdci to get an answer. That's not an intuitive thought process and you know, I can answer left and right where you should go and who you should talk to but that's because I've had to learn all those things through my job after my advocacy all of our renter protections for the most part are based upon self-reporting. So I tenant has to say my landlord is breaking this code or a tenant has to say I'm do relocation assistance, but if they don't know that then how are they going to get what they know, what's the point of making the laws if nobody knows what they are? So the Outreach group has a really important role to play in all of this their kind of know the glue. Bill's glass parts, so I talked about lowering various remaining for the for the homeless in the effectiveness of rapid rehousing. I've had a I have a lot of stories in my body works. If I'm everywhere from permanent Supportive Housing to I was a housing navigator at Harborview and working through the coordinated entry system. Try to work with a coordinated entry system rapid rehousing has always had some significant issues to the stability of housing. Especially for folks going to the social justice piso in an intersectional space, you know, we have race and gender in packs of of housing accessibility affordability as well as class in packs. I spoke earlier today with a disability commission about you know, also the intersectionality of disability as well and people who have a fixed income people who need Universal Design people who need perhaps a more streamlined or or intuitive structure to getting into housing that just does not exist. And then many of the needs assessments have shown that it's the convolution of the system is part of what has led to some people not being able to find affordable or or stay Mobile housing and also housing availability and resources for low-income seniors who identify as lgbtq Plus. More often than not seniors may have been in their Apartments 10 15 20 years back when you didn't use Craigslist in the internet to look for apartments and all of a sudden get this 200-250 Dollar rental rate increase and they would come to my office and asked me how to look for apartment. And I asked you know you they need people to help them navigate the internet land of housing the fast rapid not just go and call and have an appointment in that apartment still waiting for you atmosphere that we have and you know, I'm very proud to live in a sanctuary City, but I find that to be a bit disingenuous when it's very hard to afford to live here. And so when we're talkin about taking care of you making sure people don't get displaced. We also don't have spaces for people who want to be here and if people who have lived here for a decade can't navigate how to find housing. How are people who are new we're coming here for Sanctuary going to Language barriers are huge and finding a like needing your social security card and how to fill out an application and all of that ends up being just a huge burden when people just really need a roof over their heads. How does impacts them especially in the case of all the paperwork that you need to have as a renter the places that I have worked as a property manager would be able to accept an undocumented immigrant as a tenant because you need a social security card. They need to be able to run a credit check and I even have some friends that have moved, you know from Germany to work for Microsoft and they don't have American Credit. So, you know if we talk about people who are coming to have a high wage job and now we're talkin about people who you know are coming over Sanctuary. There's just so much that we have set up in the system where you have to get all the correct documents. But how are you going to do that while we're going to do stay in a hotel while you're doing this Airbnb while you're doing this all of these are large costs and there aren't enough Advocates out there assisting people with this paperwork so that they can get into the safe housing. So what you do run into then is people living in unsafe housing living in the places where the code Because I finally got a roof over their head. They're not going to report the facts that there door knob doesn't work or that the refrigerator is dead because then they lose that housing cuz they don't have the legitimate documentation to get into something that might be more regulated. I know that in my family both me and my partner are disabled but we are able to maintain where we are in District 5 up north where the urgency for this is kind of going to what we just saw in the previous amazing collectivistic action was you know is coming to Northgate allegro's coming down the street from my house. They are tearing down the mall, which is already getting rid of some of the resources that I've come to rely on to do things like by clothing or furniture or entertainment. There's also not anything to help me and my partner feel safe or secure in our housing against displacement identification is one of the last places that's affordable to live. So there's a lot of this that you know, when we're talkin about this where we're talking about the most vulnerable populations. I also challenge folks are listening to this to to also be mindful perhaps aware that the the bias of the archetype may take them because both me and my husband all the disabled are also trying to work hard also trying to maintain her housing trying to create a family and we just see everything building up around us in a way that makes us concern around what's going to happen to our lease this summer and that's no way to live when you're already worried about scarcity. You're already worried about trying to make your rent and then you're going to have to wonder if you're going to have to come up with the $7,000. They said the averages for moving fees. That's no way to live. And so I think in Seattle if you really care about race and social justice be really want to lead with race and equity and if we really want to be a sanctuary City in the full embodiment of what that means we need to do the thing we need to do the thing of what that means. And so I'm hoping that is as co-chair. With our amazing commission that we're not just talking philosophy that we're also holding accountable to action. I mean some of those leases can be up to 72 pages long when you're looking at a dumb dumbs and it's like, you know, you get your cell phone contract. You don't read it. You just sign you click a knowledge that you read it. But when you do that, I think you should probably read everything. You should not just breathe that might hinder you from doing that stupid who's going to help you do that who is probably also working 40 plus hours a week at a minimum wage job and You know, it's a lot to ask. That's pretty much for the work plan though. So we can actually talk about the two letters that we have here. So two different work groups going to come together on these. The first letter is the passing rent control which would be the rent control rent stabilization group and they worked in conjunction with the tenant protection Law Group and so are two Piers over there works very hard on. There's your presentation which one of you would like to go over the presentation. And before you have before you get tired, I just wanted to say it was actually so incredibly wonderful that we are in our office and with a lot of community members Beaver. Oh beaver and socialist New York menu for most of them are renters and struggling to pay the rent. We were talking about. You know, how would it be if we pushed for reviewing a rebuilt a movement for rent control here? Because that's what we know we have to do that. In order to that. This is a starting point to get the state ban lifted. What if we actually build a movement in Seattle do when a law that says rent control free of corporate loopholes but a lot about going to affect as soon as the check balance of good because we don't want to be confronted with that question again, and again like you do rent control it it's illegal and so far us. It was just incredibly amazing to see The renters commission recommending exactly the same thing because it really made us feel like we're not alone, you know socialists are clearly in tune with what many many of us are thinking in and as you said the renters commission brings in a lot of the experience that people are feeling and I have to say since the press conference with dead video on Monday that beat Seattle and renters commission doors were also part of the weather in person capacity. But you know following the recommendation that you all voted on as a commission since then our experience has been that has been to find that most renters are super excited about this idea. In fact their belly. Where can I find sign up for this and most of the time when we were in my office us, you know, she has petitions for people to sign on some issue. Another of social justice will get lots of people signing it but most of the time People will just sign it and not write comments. We would love to share soon with the renters commission and with the public the incredible comments that people are saying about why they want rent control and why they're willing to fight for it. And so I really want to do thank and congratulate the renters commission for showing this leadership. And and and also now Logan have your presentation. We have a exciting collection people in Olympia right now who are listening to this kind of conversation and starting this kind of conversation as well. So that adds even more excitement for me is when I really great thing about this too is that it's not just Seattle. He has it. We're the city that gets to talk about it right now, but hopefully, you know other cities will see us as an example if we can pass rent control hear the proactive rent control that we're talking about here. We can go and see places like Wenatchee are Yakima Auburn Kent, you know place It's like that smaller cities that are feeling this burden as well. They can take up that mantle of Frank control. And yeah, I just wanted to ask before getting this. Know what you were talking about counselor, which one for my day job. We do renters rights work and we used to do surveys of renters and 98% of the renters that we talked to were in favor of Frank control. So that's a huge number when it comes to organizing you don't so I can get to this. This is just a presentation that we put together that explains our reasoning behind rent control and the Proctors rent control that were talking about when I say proactive rent control. It's exactly what you had said earlier passing a rent control law. Now that will have on the books that we can then use that time to plan for Meaningful rent control legislation when the meaning meaning for rent control law actually when the state ban is lifted. So obviously why rent control right? Well, you know, it's pretty simple. We saw a huge contingent two people here earlier today for a very similar thing when it comes to people if people want to stay in their communities people put down Roots people have for Generations wanted to stay in their community. And so we want to make sure that Seattle renters they have predictable and affordable rent. It's it's kind of a no-brainer when you think about it and it's so actually in the background of this photo. We have the Kenton Apartments, which is a great example of just one of the many buildings around the city that have faced rent increases that have led to a lot of people being worried about displacement and some of them have already been displaced some folks at the Kenton Apartments if you received 70% up to 70% rent increases that's neither affordable nor predictable. Enough to share with the people who are watching Reddit Canton is located and So that obviously I think in 2019 is a place that we think has come and gone when it comes to displacement in affordability and Seattle and they were people that we're living in a long-term building where their landlord they had a private landlord that they had a really good relationship with and they kept the rent below-market-rate recently the landlord decided to sell the building to corporate developer and corporate developers. The corporate developer did what corporate developers do and they raise the rent to you know, what to fit with the market and interesting ways that the Canton building, you know, they've won a lot of Victories through organizing which is exactly what we're going to have to do with rent control. They've been able to kind of pushback that rent. Increase they've been able to limit it but it's interesting to note that their landlord their previous landlord was affection. They were effectively controlling themselves already and that's something that a lot of small landlords that you'll talk to your doing that so the kitchen is really good example, but it's not just happening on Capitol Hill. It's happening in the Central District all over the central district is happening in the south end. It's happening in the North End. It's everywhere in Seattle, and why because we've got our state ban on rent control, and it's been in effect since 1981 all across the country in the 1970s cities were passing rent control laws, San Francisco, New York Boston actually just have rent control as well. And then you look north of Quebec and Montreal past rent control 1979 Vancouver and in British Columbia, they have form of mind control as well and a 1981 or after a push tenants were organizing. They wanted rent control Hearing in Washington State. The landlord Lobby they did a really good job of lobbying Olympia and they got that state band passed. So that's what we're fighting against almost four Decades of allowing rents to go up kind of willy-nilly in my in my job. I tell renters it's just an illustration but it's absolutely true that in 30 days, you know, your rent can go up by less than 10% but in 60 days your landlord could raise your rent by a million dollars if they wanted to that's absolutely legal. It's not going to happen. But it is and if you look here on this side here in Seattle are rents have been unpredictable since 2008 are rents have jumped up by over between 2008 and 2017 62% according to do Prescott, which was a very landlord friendly group that consulted and ended these kind of surveys and you know, that's I think that's Illustration enough that are these rent increases will be happening year-over-year without any kind of any kind of balance. I know myself. I'm lucky to live in a building with a landlord who again effectively rent control themselves. They raise the rent in every year by $25, but I've talked to people in my work who actually talk to people just two months ago got a $600 rent increase over the course of two separate rent increases actually over the course of one year $600 and you know that shows that jump right every 30 days so you can get a rent increase of 9% or more less essentially and every 60 days you can get a rent increase of 10 or more and that is especially hard on the communities that we've been talking about today. If you're a renter if you are a single parent if you are a family if you are a senior 60 days is just not enough. You know, that's why the renters commission we see that Seattle and like I said earlier we could be a catalyst we could be the city to start this if we were to pass a proactive rent control on now this not only what it will do not know he's going to send a message to Olympia that there is a need and a want for this in the largest city in the state. But we're hoping that this is going to have a ripple effects like similar laws have like source-of-income discrimination laws. For example have had all across the state and I was really hoping that we would have more city council members here to kind of progress on this but you know if we can do this as soon as possible like we had said in our I'm in our presentation or sorry in our letter this is going to be something that will legitimize this rent control fight across Washington State. And you know, you're going to hear about it from a lot of people you're here. You'll hear from a lot of Economist who also happen to be like Venture capitalists. He's like that that you know that rent control. The simply doesn't work. You know, it's economics 101 right and in some senses there, right? You know it is it is an economics class is probably not 101 level but you do see other cities in the country who are having problems with rent control, but then you also do you see cities that have a really great robust rent control laws. So in the back of this background, we have Montreal kind of the gold standard for renters in North America because what they have is rent stabilization with with vacancy control, they take away the loopholes and for that I will see you later on that the rent if stayed pretty stable so we can actually go to the next slide where we see but but what about San Francisco, you know, what about noon? What about X y&z city that has been having problems with with the rent control and myself? I'm lucky enough. I actually used to work in San Francisco is a tenant rights counselor and sound as an organizer and I can tell you know, the San Francisco law isn't perfect. The rent control law in San Francisco is full of loopholes and they were there they're four they're intentionally because they were they were a one of the first cities in the country to enact rent control during that big wave, but then also because these caveats are required for landlords to buy in so in San Francisco, no building built after June of 1979 will have rent control single family homes don't have rent control in La so called quote-unquote mother in-law units are adus don't have rent control vacant units don't have rent control so landlords in California. They can use What's called the Ellis act eviction or other forms of evict. When to push people out of their homes, and then raise the rent by triple digits, what's common in San Francisco is to do a an illegal buy out where I landlord will give you a very small amount of money to attend to force them to move and then the rent and then they can raise the rent by 400 500 600 $1,000. And then also there's something called a board approved pass through and so those are allowed by the rent board. They have to be approved by them for landlords to do repairs on their property so they can raise the rent on that property to do repairs and they can also bundle those. So you see places in San Francisco. If you look it up at that City many people live in buildings that aren't necessarily apartment buildings are single family homes. And so a lot of people don't fall under that and then even if you are on rent control is there in your mind control unit once you leave that unit assist up for grabs and I think you're coming to that next probably but I just want to say you use the term vacancy decontrol any of course in your next life good referring to vacancy control hoping you could explain that for our viewers. And also when you were talking about time to discover are also talking about the weakening of the rent control Los Statewide with the costa-hawkins ACT, if you could also get into that because there are a lot of demonizing of brain controls want to make sure we are the only way we're going to win this if we are thousands of people in Seattle to understand that if you know when you have a robust One controller, it works great. I think that's thank you for that question. So vacancy control is pretty simple. If you look at a place like San Francisco, the rent control doesn't apply to vacant units at all. So once there is nobody living in that unit, you can raise the price by as much as you want, but there are exam. A vacancy control which applies rent control the vacant units and then also like you said was cost to Hawkins. That's something that I think it's a little bit too complicated to get into an inn in this meeting. But what I would really recommend people do is, you know, just to look at the work that groups like tenants together in the San Francisco Tenants Union in the housing rights committee Casa Host Inn in San Francisco. All these places that are working to repeal costa-hawkins are doing it for a reason and that's because it's limiting their view local control of rent control in places like San Francisco or Los Angeles or they want more robust protections, but they're just not allowed to and we look at a place. Actually there is a place where that is allowed and it's it's get back and they've had rent control in the books with no one with none of those caveat since 1979. They've also kind of like Seattle seen a really big boom. Add a five between 2000 and 2017 the added about a hundred thousand people so not as much as us but they had a huge boom also in the tech sector where they were bringing in people with with higher incomes as well. So it's a city that we when we were doing the studies we found and as Michael is going to talk about you with 180 days that we saw that was doing this really great work for renters and it's kind of like the Bizarro Seattle when you when you talk to a renter from Montreal they talked about how easy it is to rent there and in how much Freedom they feel like they have and and a really great example is I'm on the next flight here. You see that their rents has gone up much less than RS in in the same decade that we mentioned to between 2008 and 2017. The rent went up by $101 and that's a cross. All housing types, so obviously there are places like the row houses in Montreal that are higher rent in your rent per month than that, but by all of all sources can buy and it's only one up by 9% on average and that's because they have that rent that robust rent control policy. They don't have any of these loopholes are caveats this unit that say when you have rent control, but then you can also ask for a little bit more money as well as economy has not gone to funds because I rent control if it's not to be lights-out Montreal kind of sit on the developer's side of this and I'll tell you, you know people to stop building in front control happens and even in San Francisco, you know, your quote-unquote rent control hell, you know, they're still building. You're not building as much as we are but we're also building a lot more than everybody else. They're adding if you go to San Francisco and you go to mid-market. If you go to the Castro to the to the Fillmore by the Fillmore, which is very similar to the central district where generations of of black folks have been displaced for corporate development. You know, if you go to Montreal you see development happening in there too. It doesn't kill the economy like people say and renters because what because what happens is the people, you know, the people that can't afford to live in Seattle now who still have to commit commuting from Kent or Auburn or Tacoma or Puyallup or anywhere else they're going to they're going to be able to stay in place with it was something like rent control. So rather than having these long commutes send people being forced out of the city the people that are really making the city gray and the people that are making the city run the the workers and the teachers in the nurses know Baristas. Retail workers these folks get to stay in the city that they that they love and again that the city that they put roots in and if you look at Montreal again, you don't have that worry. I bet everybody at this table can talk about a story of of Warring Christiana brought it up worrying about what's going to happen. Once the light rail comes in to Northgate. That's a legitimate fear for Seattle flights for Seattle renters. I've had the privilege of talking to renters in Montreal and they do not talk about that at all. They do not they do not worry about rent increase the it's interesting to because the folks that I've been able to talk to you. They love their landlords. They love like they they they have dinner with them. They work with them. They paint the house together with them and say it's a very different world. And can you also share from your ex from your knowledge of Montreal what we know because we know one of the other Mets about rent control and the demonizing rent control is that the quality of the homes rapidly when you have like a strong rent Control Ordinance? So what do the renters in Montreal think about the quality of the rental homes there? I've also been lucky enough to to venture into quite a few of those homes in Montreal and they there like some of the most beautiful Olde Brownstone so you can imagine right eye is it that's the interesting thing too. And I think a lot of times here in Seattle and I've talked to two small landlords again bringing that up the day they are already effectively controlling their own Reds their stabilizing their own rents. It's not any different than that Z is the worst most appalling conditions that I've seen with my own eyes and Seattle win or Rising talents that with big corporate development it's very rarely with with small landlords and and so, you know everyone that I've talked to you in every unit that I've been in in San Francisco in Montreal this beautiful, you know, it's very reminiscent of the older buildings that we have here in Seattle and they're really well kept up. So there is that fear and if we had that that was a fear that existed in San Francisco as well with the with the ability to keep up with maintenance and things like that, but you know, if you rise with inflation that gives you the ability to not to keep up with those repairs, it doesn't say that you're not allowed to make any more money. We all three little live in a capitalist Society right now and then so that's going to be the driving force and those cities are not economically crashing. So so yeah, I think that's something that we could say about that that It's not going to change anything that's happening. Right now for many of the landlords who are effectively controlling themselves. The only change is going to be $4 for the bigger landlords who aren't going to be able to have a 25% profit margin pillows that are strongly in support of this ordinance and that they want this to happen and also wanted to mention one of the things that we see in Seattle which does not have rent control in rent is as as an egg on a b c so many example that my office has done and is calling us every week talking about how their Apartments which are very expensive with expensive brands have mold infestations or elevators that don't work there that are broken and innuendo. Disabled people with physical disabilities having real Mobility hindrances because these problems are not fixed and we we especially of the Immigrant community and a non non undocumented members of our community as you correctly noted, they end up accepting substandard conditions because they're afraid of what might happen to them retaliation you exactly so it's not good landlords that are afraid of of protections. If you know, it's there there is people as predatory landlords. We need to wait. It's it's the folks that we might not name that have a la named after them because of the way that they treated tenants as well. The larger third-party corporate management. So I believe we're kind of talking about right now. They don't even look more than often than not they don't look at your apartment and say oh you lived here 7 years your about $200 on the market. So waiting to be $20 instead, they actually of software and this is something we should be aware of especially if we were able to control rentberry. We should be looking at these are releasing softwares have to corporate Property Management uses yieldstar will pump out numbers and so you'll get a printout daily of what your rent should be on your apartments based upon what their algorithm says, so there isn't any humanness to these rent control or these are rent increases that are coming out especially if they don't mind waiting 60 days. So if you've ever toured an apartment on Tuesday, and they say the apartment is 2100 and then use word on Wednesday and they say it's $23 2321 then they're likely using yield optimization software and that software against very similar event. Takes the human aspect out of this relationship and turns it into an algorithm and aggressive algorithm that Pearl promises large returns to the property management company. Yes. So for instance when you look at an apartment, usually put in more than one application, you know, you're not just going to be I mean, if you're lucky enough to find the apartment of your dreams that fits in your budget the first time you go looking than lucky you but most people look at several Apartments 5:10. I think the most once I looked at was over a dozen and so every time someone looks at that one apartment the software says, oh there's interest in this apartment. So whether it's an email a phone call her at the war that inflates how many people are interested in the apartment which that inflates the software's valuation of what that apartment should be. So if everybody at this table all looked at a one bedroom apartment in one building, it would assume that all six of us would be potential renters and then add even more value to the cost of rent as opposed to the mom-and-pop landlords that are sitting there go and you know Dad's been here a decade. I've got some big repairs coming up. I haven't raised his rent a bit. 50 sound it's been five years since I've raised to rent vs. This software that is not a person that's just raising rents. When you work in the corporate Property Management, you actually create the market monthly you call apartments that are similar in style to yours and you find out what they've been renting their homes at and what their vacancy is. Oh, you're 99% occupied and you've been able to rent your one bedrooms that are 600 square feet for 2400. So maybe we should start increasing ours and so you actually create the inflation is like if everybody who made milk called each other on the phone and was like what you get for your gallons of milk real control the price that way and that's where do Prince got cut a lot of their information was from these Market surveys that if they're going to do them. I feel like we should all be able to look at them. But honestly, that's also controlling the market and finding out like, oh you could charge that much so they just keep going back and forth. It was me and Michael Mike. Is making 2400 high raised 225. He's going to race 26th, and it's just going to keep going and that's the scary thing that we haven't been able to touch on the human element is taken out of it at 4 and again, not for for good landlords, but for bad landlords that the that people corporate landlord or predatory landlords aren't seeing people as people they're seeing the people that they can get into units or the folks showing interest is dollar signs and and what it really ends up being though. Is that the folks at Miss out or the folks that are forced out. Maybe they leave Seattle and they go to Tacoma or they go to Everett they go to Portland. There's also a really good chance that they're going to end up on the street you 81% of the folks that are on house right now in Seattle were previously. How is an address in King County. That's huge. And you know, that's where in the middle of a homelessness crisis is. This is one way to help solve it. We want to keep people housed and we want to bring the conversation back to people when you talk to a Montreal renter. That's exactly what it is. They all been almost seems like the landlords have to compete over them and it's not that we're you know us in 20 or 30 or 40 other people are applying to a unit or an apartment or the folks will be economically evicted as what will probably talk about later in that apartment that I'm looking at now that they were at, the affected before and probably ended up on the streets and that's why we want rent control in Seattle. We want to bring it back. To humanity, we want people to be able to live in the city every kind of person. Yeah, and this shouldn't be a Charles Dickens novel, you know, we shouldn't have we shouldn't have this this huge disparity. We shouldn't have folks living on the street. We should be able to how is everybody equitably and that's really what this is coming back to Just so moving on to our next suggestion Billy off that is our recommendation to increase the increase the rent notice. 280 days, you know just starting off at this next slide some facts about where we are right now, you know as we've heard from from Devon here, you know, Seattle Rams have increased in the last 6 years. They've increased 57% in the last eight years eve on 62% Its you know, there's this upward Trend and folks are just getting priced out. And again, the increases aren't just like $20 or $30. They're in there. You know, what the hundreds? So this is where we are currently in terms of what the notice. Is I do want to point out that there is HB 1440. That is I believe at the governor's desk right now that will increase notice the notice. To 60 days in the state yet for any rent increase. I'm not really great and we were really excited to hear about that when we were talking about this but we still believe that you know, 30 days 60 days is not enough and you know, we we believe in 180 days is what people need particularly in Seattle where the reds are so high settings and yet so currently up until this bill is signed for rent increases of less than 10% satellites received no more than that 30 day notice. For an increase of 10% or more they receive a minimum of 60 days notice. And our question that is is that enough time to to either move find a new place or to increase your income. And as we seen, you know, there's a lot of barriers. We we have had some support for for renters in terms of you know, finding new places to live but there's still that barrier of like, you know, what we talked about just just finding a new spot we can go to the next side. Yeah, so I couldn't rent hike notification laws, you know, we believe that it leaves marginalized communities and folks vulnerable again, 30 days is it's tough to find a house, especially when there is at so many people moving in, you know Seattle is a place where a lot of folks want to live and that's a great thing. But also we need to make sure that you know, we're not moving anybody out and we're not displacing folks in order to grow, you know that the current state of our notification laws in some ways incentivizes landlords to economically evict us some tenants and that's again where they they increase the rent knowing that some folks aren't going to be able to afford it so they can bring in someone else who can afford the the higher rent. Generally, what do we observe in terms of you know, you have the world calling code undesirable people with children. His children cause damage to homes is one example, I would say disabled people who end up needing accommodations for their housing anyone who can afford than you were acting like if you can check if someone can rent an apartment at a higher the higher rent they want someone that can afford that and you know, that's that's really sad situation that we're in right now and then follow up with this next point, you know, some folks point out to while there's month-to-month options in case somebody wants to like, you know, take an extra month to figure out, you know, where they're going to move to or to figure out their their rent increase amount. They really those month-to-month options aren't really an affordable option due to the premium fees, you know, those fees are added on top of monthly rent. Which would mean that now someone is not only paying what they were paying for. But now that there's what was the number desica. So if I was to give you a rental rate increase number if I'm like a landlord right now, I would say it's going up to 2,400 or you can go to month, which is an additional $250 tonight 2654 the opportunity to take the time to look for a place to live and you don't they can go from $50 up to the highest month month fees. I've seen were $500 and I don't understand how that's even a premium. The reason why those are usually included is because it's seen as risky for a lot of larger buildings to have leases expire whenever which is what month to month is so they can't predict when Michael is leaving so they charge this month to month fee for the risk factor of it, but we're in an affordable housing crisis. It doesn't matter now. If it's December or July, you still have a line of people who are looking. Then so still using them. There's no we don't have any protections on those you can charge whatever you want for a month-to-month Faith. So again penalizing people. And as it was in the Seattle Times a couple of a week or so ago, we still have issues with people not discriminating against folks who have subsidies affection a child refuse care things like that. So in my professional experience, I have seen this where someone just gets in on the voucher voucher voucher it is and there's already a bias against folks who have subsidy vouchers and then they'll say we're raising the rent has to increase somehow over your voucher and limit the white folks don't understand is that it's it's not so much just finding a limit will take your voucher but also apartment that fits within your voucher limits and then also going to the process of having that apartment and depending on which route to you have inspected and approved and some of them know that you might need to make repairs or changes get things approved by you know that The voucher going to the landlord and it takes it takes longer than 60 days and there's other things to on the side of some of these Goucher programs were they have deadlines and limits. That's a whole different advocacy issue, but perhaps can reduce some of the some of the barriers to finding housing for these folks as well as Community Education around who has rental subsidies and how it's illegal to discriminate against them cost of living on Social Security this year. So the cola increase is only 2.8% We're not hearing that runs are going up an average of 2.8% And that's even after several years were there wasn't even a cost-of-living adjustment if I remember correctly. So that's I mean it said stuff like we look at her side right now, you know Seattle residents pay an average rent $1,731 and I put some of that in perspective of someone making minimum wage right now working 40 hours a week earning 15 an hour. We need to commit 72% of their income to rent just to remain house now. That doesn't include anything else other other than rent any Economist will tell you not to spend more than 30% of your income on rent and housing news. Economist RN living is $15 minimum wage workers in Seattle in school in economics about how bad One controller is how about unions are you know that kind of stuff which is completely belied by reality and these minimum wage employee. Is now at the cliff work to find apartments with most of those jobs don't come with PTO, you know, so I paid him off. So we're that's another reason why the increase is really important 30 days. That's for weekends not enough time to find an apartment pack move in clean and get your security deposit back if you're lucky so calling off work from your coffee shop or the senior center that you work at or a t e s greatly impacts those businesses, but also impact your ability to pay for your new apartment and the days the 60-day notice to the state best also not enough at Camp. I mean I've gone to look for apartments and then 12th in line when I'm an hour and a half early. And they're supposed to technically take the first person in line that doesn't always happen either but that's a whole other story apartments with like crooked kitchen cabinets and squeaky doors and I'm and you're like, I'll just I hope that they'll take my app after I waited two hours in line and you do that over and over and over again until somebody calls, you know, and the person behind you might be a dual income. No kids working at Amazon. There's nothing really to stop them from taking out application either. So I'm we're fighting for the smallest scraps. We need the longer amount of time in order to do so we were talking about before without rent control people are leaving the city, you know, people do want to try to stay where they have fruits. And so maybe you take that first 30 days to try to make it work in Seattle and then you can't and then you try to make it work in Tukwila and Shoreline than you can't and then you go to Federal Way and you can't and you keep going, you know, there's people that are displaced a really long way. And this 180 days at the very least can give them time to continue looking to be able to stay in the community that they helped build say and I think that what's really important here to is like the systemic nature that it can become and so I was sharing with Jessica earlier that there was there was a client that I had back in the day who was working full-time who had a rent increase that made them have to leave until they became a Cardwell are they live in their car while they're working full-time making between 50 and $60,000 a year? Because you were living in their car. They had a lot of moving violations and fines at also impacted their credit score and report and we did find a landlord that was considering renting to them. However, because of the credit issues, you know, they want to first last on the full amount of rent for deposit and I always told my client, you know, you only have 20 to 15 days for your second month's rent. So make sure you have a board and for that package it was a little over $8,500. This is a person that it was all because of a rent increase they were working full-time. They didn't have any of the stigmatized archetypes that we have for homeless folks and they ended up the only the only option they had at the end of it was to go into transitional housing in transitional housing, but it was unnecessary and I don't know anyone size for house folks working at some of these International corporations here in Seattle that has eight. $500 just ready to go on a moment's notice like that or even in 60 days. Overall Nationwide is I think 45% of Americans don't have enough money in the bank account to Eventide over the $400 unexpected expense. So right very very far cry from anything like eight $8,500 reason why I really enjoyed 180 day proposition is dealing with this is this is local this doesn't involve us waiting on the state to do something so I can throw this extremely and for everybody in our city currently. Yeah, and then the city hasn't addressed notifications in in 20 years and we have a little graphic up there just showing what some other cities in the region and Lola Beyond have I have done too, for example recently, you know updated there has to be a 60-day notification Portland has 90 days Vancouver's 90 days and then you know Montreal 180 days. So these like what we're recommend what we're recommending and what some other cities have done is not something it's like impossible. It's you know, it's what people need again. I think we mentioned it but you know who can who can increase their their income by like $100 a month like in the 30-day notice. It's it's it's not something that's easy to easy to do. Yeah. Oh, I was just going to caution that we are over time for the meeting. Yeah, yeah and closing just you know that 10% increase for the average tenant in Seattle. That's $2,000 a year. That's a lot of money and something to need time to respond to that. And I do want to throw in a little thing just about 280 days in Montreal some very Savvy new landlords are folks who work the landlord Lobby will probably tell you that it's not necessarily a hundred and eighty days there that they have a very complicated system but for fixed term leases, it's between three and six months notice, but they also do because they have rent control every every every tenant gets the sitting there rent increase notice at the same time every year so effectively even if you don't have any notice, you know that it's coming in July and that being said though, we when we were talking about this we saw that there's between the three and six months. But again with Seattle's Christ is the way that it is we we straight up to set a hundred eighty days. No caveats. That's what we need. How long has Montreal had? So it was tied during control when they created their office of rent control. It was 1979 back on increasing the notice days means that landlords aren't going to have enough time to bring up money for repairs. I would personally say it would make me very nervous to rent from an apartment building that can't replace a refrigerator without raising my rent. It is good Property Management standings to do an annual inspection. So you should know how old refrigerators are. You should know how your roof is that is part of you maintaining your business. So I don't see any reason why 6 months shouldn't be able to be predicted by your repair budget, especially if you've been in the building five ten years, you know what to expect. You know, how old your appliances are, you know, the last time you had to do the roof. You know, how many weeks you I drop her the year before and what you should probably budget for this year. So I don't necessarily agree with the six months. So much time that we will not be able to make repairs in the building. I consider that to be a poor form of business and it would make me very nervous tenant in basic to just for the base of basic business administration sense. You should know what your appreciation value of your investment will be in 6 months. I would keep the empathy of the fact that there are humans and family living in that apartment, but I would also, you know, perhaps if it's going to take services or education available for landlords to know how to forecast whether or not they will have to increase the rent to give this notice. I think that is a good compromise, but I think that as a small business owner myself, I would be very concerned. If someone said that he didn't know how to forecast depreciation of value is in 6 months. Very good points and it didn't go through one side. Which heading over? Appreciate the renters Commission. Taking your work. So seriously and advocating for renters and along the lines of what we've discussed and I just also wanted to make sure people who are watching should also go to my counsel office website to look at some of the pictures of the one-pager that before together. And also I rent control FAQ frequently asked questions and some of those things going to what Devin and others were mentioning about the the lies that ever hear from Economist and others about power and control that they claim rent control doesn't work. But the main thing being we need a rent control law that is free of loopholes like the Montreal line and that's precisely what we need to fight for Anna and just one other thing. I want to mention it one loophole that we don't want is what is the rent increase after that we're talking. Talking about increase no more than the inflation rate with your mention, of course effective date of this law would be as soon as a state ban will be lifted who is covered and I think this is part of what are you know, one of the loopholes that was introduced by costa-hawkins in California, we want all residential rental homes to be covered whether it's a single-family home or in a condominium that is being rented or it's an apartment building. We don't want exception to be made for what kind of spaced it is because then quickly, you know all kinds of Lupus with the car and then no way they can control centers leave their own volition tenants leave their own volition it Still Remains a rent control by phone. I don't think I'm going to do when. When every council member has strong support unless we build a movement and then suddenly they control since they were five. Thank you for engaging with the renters commission. I believe I speak for the commission is a hole when I say that we encourage our council members on our mayor and our city departments to engage with us as well as almost anything. I said he decides does impact the lives of renters and we are here to listen and talk and figure things out together. This dude have discussions with the renters Commission in understand why it is that you're recommending these policies workgroup who did this work who aren't able to come today and I just wanted it to be known that they did electromagnet amount of work and they should get credit for it. So Beverly errands and David Mooney, I deserve a lot of things for a lot of the work they did here too and hopefully, you know, we'll be able to have them at the table next time that we talked with you and customers want and president Harrell and councilmember Suarez and everybody. Build a strong enough campaign Citywide that they have to listen and I've no doubt that we will get to that point Thank you for leading on this because that leadership matters because it gave me the starting point and please convey. Congratulations from everybody in my office to all the Commissioners who worked on this Dimension. Gina Owens is one of the other Commissioners perhaps may not have been an integral part of this but has been fighting for renters for many years in her community insatiable. So I'm really encouraged at the work you all are doing thank thank you so much. I think you're also the wealth of knowledge you bring and I mean I was making an OTR because I think it's really important especially love. The inflation inflated wrench that they use from the software you yield to your office more about that. If you don't be great, thank you so much buddy thing and give you make that illegal or something like that if we did, but obviously you rent control was what made the news but we we are we actually have that is actually already drafted the legislation to change it to a hundred eighty days, but I guess we are matter of changing the number the writing the legislation is simple enough, but we're going to have to fight for it as well. And so we hope that but as we've brought in the city right campaign for rent control that we can bring into other things which is 180 days, but also the economic eviction assistance ordinance that the renters commission is already voted it support for which is if your rent goes up by ten percent Armoire and you are anywhere at or below 80% of area median income than your landlord owes you three months worth of rent. I think it's important. I don't know if we covered on this 480 day covers all types of leases. So fixed-term lease is month-to-month leases. We didn't want to create a situation where after your first lease all landlords just made you go month-to-month. So this our recommendation is to cover all rental situations and the forces all elected officials to be here. I'm excited about that. Thank you.", "end_time": 8509.4}]}