{"format": "raw", "annotations": [], "confidence": 0.9432787618889714, "data": [{"start_time": 0, "text": "Good afternoon, everybody. We are here for the Our first meeting I'll do a call to order. This is a special meeting for the sweat comedian. The library Levy the date is March 28th. And the time is 202 on cast member Wars. I will be chaired the committee. I'll be joined by other council members in a moment and I will be my co-chair for this committee will be cast member bag show as well. I want to thank you for being here. It looks like Marcellus Turner has his whole office here and then some before I start with the chairs report. I wanted to make a few comments. I made the same comments this morning when I was over at King County last night our city experienced two horrific and senseless shooting. And 5 people were the victims of that of those five. We had two fatalities and three people were wounded. One of those people wounded was our Metro bus driver Eric Stark and he turned out to be a hero being wounded. He turned that bus around and he save lives while he was injured on my want to think it's fine. I want to thank the King County Sheriff that was there last night. Mr. Fong. Who is there sale Police Department Seattle Fire Department all the Metro folks King County Executive Dow Constantine was there he also visited the victims at the hospital mayor Jenny durkan counselor house key and of course Lake City community and all of our neighborhood as well as myself. So we all met at the Lake City Community Center. There was an outpouring of love and compassion and concern for those that we had lost yesterday and those that survived so I'm hoping and I pray at least for today and maybe for a few made a few more days that this city in this County can be as one that we can be unified. I know sometimes we get into this us and them if you're not with us you're against us and I'm just asking that at this time that we can really think about our country our state or county or city or neighborhood. It's been a long time and we're better than that. So I'm asking at this time if you can do and I know people have heard this before about thoughts and prayers, but we are going to begin the healing and as we say anything country, we want that good medicine to start so I wanted to share those words with you first. So thank you for listening. And again, I want to thank councilmember Gonzalez for being here. Start with the chairs report. This is the first of a series of meetings to gather information assess and then deliberate on the 2019 proposed Library Levy are essential staff person. Is Asha and I sure hope them to say this right then cute art van couch. Ramen has provided information to each council members including the chronology of the library Levy its history including the current State per district and the physical impact for the city along with my policy our policy advisor. Nikki income car from our office. Thank you again. And Asha, the offices are offices are colleagues have access to these materials organized by a table of contents contents for your convenience. I want to highlight two items in your physical or electronic Notebook on Tab 3. There's a central staff memo that list the schedule for the committee to consider those legislation in order to meet King to me. Kelly deadline to put the levy on the August 6th ballot. If there are any issues with the future attendance, please let me know ahead of time and 2012 Seattle voters approved access to critical improved. I'm sorry, too critical educational and literacy resources for every resident bypassing a 7-year 120 million dollar Library Levy, the levy funds will and by the end of 2019. So this proposal includes a new renewal of the previous Levy priorities the new 2019 proposal is a 7-year Levy during the years 2020 to 2026. This proposed allows for the successful Services programs and amenities provided by the Seattle Public Library and the 2012 Levy to continue to the serve the people of Seattle that Levi will come. I believe 213 million dollars the 2019 proposal like the 2012 Levy. Focuses on the same for component components a my understanding is that Libras has been assessing and measuring the success of those four components in the last in the last seven years those four components continue or are open hours and access collections mean physical and digital materials technology online services and maintenance as I said, I will be chairing the committee on the library Levy with councilmember back shot serving as vice-chair today. We're going to hear from our chief librarian and his team on the 2019 proposed Library Levy followed by Q&A from Council Members as needed. But before we go there I will go ahead with public comment and so on the game how many people do we have signed up? 3 people signed up on again will call out your name and as you know, you have 2 minutes to please address the items that appear on the agenda. And today's agenda item is about the 2019 Library Levy. So with that let's start with public comment first individuals David Haynes. We're here. Seattle needs a better leadership at the Board of Trustees and the chief librarian should be replaced specifically for never opening the taxpayer for the ins public libraries for 21st century times tens of millions of dollars have been squandered never opening libraries on Fridays in the local neighborhood after getting $60 extra to open libraries years ago when confronted Marcellus Turner said he thought Community only wanted Sunday's open not those Fridays for those specific libraries yet. He only open the libraries on Sundays for 4 hours and certain local neighborhoods and they close like 4 hours later. No, he sometimes promotes a lot of racism in some Persian in fact. Two managers David Valencia and Marcellus Turner protect PornHub you or to ruin the computers? If you complain about a point of view or they will kick you out for bothering others about it. Even if you only asked for the security guard, they should be replaced and we need an investigation of why the chief librarian can close Central Library when he feels like having a meeting with staff and why you never opened why are libraries in certain neighborhoods before 1 p.m. And why it's so noisy in the library peeping books and never got checked out but taking credit as if somebody had used them as if they need more money for that service that's bothering everybody beeping. City council has been aloof and yet supportive of Library libraries cheap librarian who's never over the wires before 1 p.m. And closing 4 hours later. We should have libraries open for a minimum of eight hours on Sundays. And that's I think it specifically because the libraries are getting double time for work in like 4 hours of the library being open on those days sub. Give me money. Did he do those squandering taxpayer budget self-promoting rebranding and personal political agenda that get in the way of the world was getting access to the library for 21st century times. Thank you. John award I'm trying to Ward and I run the Seattle Public Library foundation and the Seattle Public Library Foundation exists to ensure the long-term Vitality Seattle Public Library, and we know the Great Recession that are Library suffered immensely in the Levee that passed in 2012 brought back so much that our library in our city needed and deserved and I have a unique vantage point to be able to see the work of the library every day and I have to say that I believe it's PL and the worth of the library's doing today is better than ever has been we're doing so much for every Community providing social infrastructure for everyone a place to belong but it's the worst celebrities doing outside the branches that you just cannot see that is helping so many people have access barriers in Subway to look at the work that's coming. You got a big job ahead of you. There's so much good in this in this is about protecting our investment and keeping this Library. Strong as this community deserves, so thank you for your leadership. Thank you. And then our last individual and cisne. Good afternoon. Hello, my name is Anne cisney and I am the President of afscme local 2083 the Seattle Public Library employees union. I'm here on my personal time to thank the mayor for putting this Levy proposal forward and to urge the city council to place it on the ballot. Prior to the Great Recession the Seattle Public Library was an efficient organization doing good work following the layoffs and budget cuts of that era it became an extremely lean one when the 2012 lady passed Library employees worked with focus and creativity to make every penny counts for the people of Seattle. We extended lean Staffing levels across more open hours and increase programming within the community, we maintained and expanded service to existing users while reaching out to new populations where stresses and barriers are high and where we could play a strong supportive role in all cases centering the voices of the people we serve One of our programs library to business has even become an engine for economic growth helping to launch new businesses in Seattle and create jobs. Not only generally but specifically for women leaders within communities of color and for people with limited English proficiency. Seattle remains a city under stress and the library remains on the front lines helping the people of Seattle learn grow achieve their dreams and contribute to a strong and vibrant City. On behalf of the Union. I asked your support and placing the levy renewal on the ballot so that the employees of the library. Our members can continue this vital work. Thank you. Thank you. Was going to check. Okay. So with that I think will close public comment and thinking you want to read the matter to the record of the will invite our presenters to come on up. 2019 proposed Library Levy renewal Call Smart. Why don't we go ahead and start introductions? And then I'm I have a few comments to make and then I'll let you launch into your presentation. Dependable City budget director. My phone mayor's office Chris ripping youth director of administrative services for the library on 27th Council Central staff. Eugene, councilmember where is the stuff? So before we begin I want to do a little bit of before we get started a little bit of a historical context here and I discussed this with empty as well mainly for viewing public, but for people to understand why we're moving forward and what this means Forrest City AR library was established in I believe 1890 and in 1998. We did have a 196 million dollar Bond 2012. We had 223 million-dollar Levi and now we're looking at a 213 million-dollar Levi. So I want to talk a little bit about what libraries for all means for our city and what I would have understood in and I want to take Oscar for her great research. Is that a 1998 when we did the libraries for all Bond measure the total project cost was $239 of that 196 million was a bond funds and the remainder the 43 million came from private donations. Put funds in other sources, but what I found interesting is the Seattle Times article, which is actually really illesteva and quite frankly. I'm refreshing the we did the 196 million dollar Bond measure which passed by 70% in 1998. And then this article came out and it address particular libraries Beacon Hill Ballard, Capitol Hill and South Park and so when they talked about libraries for all one of the things that I found very interesting and I wanted to share with people is that Skip and at their libraries for all became the catch phrase for a hundred and Ninety Six Million Dollar Bond measure to rebuild Seattle public libraries. It wasn't just a cute moniker. It was meant to drive home a sense of ownership that communities all communities could take part in their libraries Debra Jacobs then our city librarian at the time attended a hundred Community meetings in three and a half months to start building that public support quote-unquote. We ask people what do you want in your new library in a city that debates Public Work projects to Oblivion and tends to resist investing lavishly in itself the ballot proposition avoided typical Seattle ranker passing with 70% of the vote. Library Hoppers will see a system of uniquely tailored heavily used buildings that has returned the library branch to his rightful place as the Bedrock of a neighborhood. Now the article goes on to talk about unexpected compliments and successes and then some said, Some complained that the high you send me the branches too noisy. But library is for all is considered a rousing success Paul shell sales mayor from 1998 to 2001 celebrity straw was not dragged down by typical Seattle divisiveness such as what occurred over building sports stadiums because people viewed libraries as an investment and healthy communities the article goes on to address, Beacon Hill. Ballard Capitol Hill and also talks about South Park the days of shut the chef in my brain are overdressed and said there are much more interactive places. They are basically and they have morphed into neighborhood centers at the end of the article. It says at a community meeting in South Park Johnson recalls meeting an older man with a perfectly trimmed mustache. He gently took her hand and said to her in Spanish, I want you to build us a bill a beautiful library. And so she did that article was published in September 2008. So now we're going to fast forward to March of 2019. We're going to embark on and hear from our librarian and their staff about and I think we spoke to me about that article is that libraries for all wasn't just a cute moniker. It really is a statement about who we are as a city the information you're going to give us, how you Measure those goals why you stuck with those four components and how we're looking to the future and I'm with that. I'm going to turn it over to the library folks and let them go through their PowerPoint and I believe you have a video for us. Thank you so much. And we're going to have Deputy Mayor Fung kicked us off. But before we do that, I did want to read into the record that the screen title is have been changed. The new title is Library Levy proposal 2019 libraries for all Levy renewal. So that is the correct title and with that will turn it over to deputy mayor. High Council Members, thank you for having us at the table this afternoon. I want to first start by in my comments will be brief cuz I'll turn it over to Chief librarian Turner and board of trustee j-rich to go through the details of the proposal but I want to emphasize the incredible at work that Chief librarian Turner and his staff have done in terms of the lead-up to the engagement with the mayor's office and the mayor directly with regard to a consideration of components for renewal of the library levy mean for the better part of a year plus the library has initiated a significant amount of community engagement in terms of identifying priorities and latest thinking from their patrons as far as what community needs and interests are in does being paired with the library's own assessment of their priorities in order to inform the robust conversation. We've been having The most of the last several months from the get-go the mayor identified a couple of specific priorities for us to focus on a tanker around as we develop this proposal and I'm going to just briefly touch on those for both the executive and for the council to keep in mind as we go through the executive presentation. And first of all, the mayor was very explicit with us and I think is consistent with what we heard from from the library was the importance of maintaining and preserving the basic core elements of the library's operations. And in the mayor's definition of that scope and includes to the extent that this involves the library systems physical infrastructure as well as their ongoing a safety needs going forward, then you'll hear from Marsalis another some discussion about that in the proposal second is Hank. ring around pursuing any opportunity possible that would Advance equity and expansion of access for patrons and we are particularly proud of our ability of this Levy at to look at options to not only extend a library hours that a number of facilities, but at the same time Advance what we think is a key Equity measure with regard the library fines and again Marcellus will speak more to that as we get into the details third is an ever-changing environment both technologically as well as the way our patrons and residents interact with the library the mayor wanted us to make sure they were looking at how we would be stabilizing expanding resources in the realm of digital technology in materials and other online services and this proposal took a very extended look in terms of both Patron usage patterns as well as the cost of electronic materials and Trends to try to recalibrate the budget needs in order for us to meet an ever-evolving approach from our patrons in terms of how they're interacting with the library and finally in the mayor of reinforced in in any context when we are going to voters a seeking property tax levy resources to keep in mind the potential property tax burden for our residents are we think we with the city budget office and the library and the Board of Trustees carefully calibrated this Levy to what we felt represented the core needs and going forward and toothpaste to maintain Seattle Public Library system has one of the preeminent Library system's not just in the country but in the world So with that I'm going to turn this over to Chief librarian Turner unless you have any questions for me. Just a quick lunch president Bruce Harrell. Thank you in just one comment. I know that we're going to talk more about this because there is some some comments made about this in the actual legislation on page 5 line for we do addressee overdue fines have little impact on returning materials and such Vines have a disproportionate impact on low-income families and communities which discourages Library you and also that when you eliminate finds the studies show that you have higher usage and that is the purpose of having a library is the benefit outweighs the burden in that you want Community to use their libraries in falling after that. Of course, you guys also address the race and social justice policy and the history of underserved neighborhoods. And also increasing use and access for those particular neighborhoods not only in use of the library but computers and Wi-Fi in and kudos to you on Marsalis for doing that. But I just want to wait that piece out in the legislation which is going to come up. I'm sure again soap with that. I'll let you thank you, and I know that we have quite a bit to cover but I also wanted to acknowledge and give president j-rich the Board of Trustees an opportunity to speak on behalf of the Board of Trustees with regard to the proposal Abby. Thank you, Auntie. And I thank you councilmember, whereas and members of the select committee on the 2019 Levy proposal. Thank you so much for your generous support of the library and also for the opportunity today to discuss with you the proposal for the 2019 Levy behalf of the Board of Trustees. I also want to thank mayor durkan and her staff for her tremendous support and leadership in developing this renewal package while sustaining current service levels the proposed Library Levy renewal also provides funding to address critical needs identified by the community including the libraries work in addressing Equity of opportunity for all residents. As you know, the library board is a citizen 5-person citizen Board of Trustees established by the city Charter appointed by the mayor confirmed by the city and as set forth in the charter, we have fiduciary responsibility and oversight of the library's assets and operations what we have exclusivity. 40 make Library expenditures. We are of course depending upon the support of the city council and the mayor for appropriation of funds. I know I speak for the entire board. When I stress our strong commitment to the careful stewardship of taxpayer dollars. The board is committed to ensuring the responsible use of Levi proceeds to support the library services at the public uses and values and I'm pleased to know that the library has a strong tracker track record of successful stewardship the 27 projects that you mention that voters approve when they passed the hundred ninety six million dollar libraries for all Bond measure. We're all completed on time and on budget the library did not go back to the city or to voters for more money. and as was the practice during the building program the library provides regular updates to the council and the public on implementation of the current twenty20 2012 Letty and would continue to do so with the levy renewal and just last week we presented to chair Juarez in the council its report on the last year's expenditure of a 2012 Letty proceeds on October 26th, 2016. The library Board of Trustees passed a resolution that authorized the chief librarian to begin initial planning process in preparation for a library Levy renewal proposal in 2019. As you mentioned the current level of 7 years expires at the end of this year in April of 2018 the library undertook a program and services assessment survey, which is available in 8 languages to help understand residents priorities for their Library System. We received more than 26,000 responses in which residents reaffirm that the library should continue focusing its Investments on the four critical areas that were contained in the 2012 Levy those for our open hours and access collections technology. Maintenance based on that Community extensive community and put the library work with me or darken to develop a levy renewal package the reflected Community priorities on March 19th of this year the library Board of Trustees passed a resolution recommending that the Seattle City council approve of 2213.3 million-dollar Levy renewal and enhancement for the August 2019 primary election ballot. The Levee proposal being presented today includes several features. The largest really the bulk of the Levee is sustaining open hours collections technology and maintenance funded with a 2012 Library Levy. This is the bulk of The Proposal approximately 79% of the funding is a continuation of the successful four areas of investment for the last seven years in addition that provides for 5000 additional open hours per year to provide more access to free programs and services It also provides it infrastructure updates needed for internet and Technology access. Some of our critical infrastructure is approaching the or Beyond its useful life. It also increases electronic re material Investments a growing Demand by the public which now represents. I believe about 30% of all the book borrowing sarnow electronic which incidentally are significantly more expensive than regular books and it also provides something very critical to me and that I think you would appreciate to is seismic retrofitting for our three most vulnerable libraries all historic Carnegie rebuild Hira buildings to make sure they are safer in the event of an earthquake. They are composed of unreinforced masonry at this time. In addition the Levee proposes to remove barriers to access by eliminating overdue fines a proposal that furthers the library's commitment to race and social justice. So thank you Mara Durkin and councilmember whereas and members of the committee for your leadership and support and thank you for the opportunity to present this proposal today and just a quick note. My understanding is that it was in 2016 at STC. I went out and looked at the earthquake and those three libraries were the Columbia of the Green Lake and University, correct? Thank you. Thank you and thank you for this opportunity to speak with you about the proposed Levy. Thank you deputy mayor of palm. Thank you Jay for your comments on the process and the proposal that is going forward. I think about Sotomayor Durkin for her support in partnership with the Board of Trustees on this. I'm going to move you through this proposal that has been a combination of Distance of public engagement and I'm happy to take questions along the way or at the end. However, you wish to proceed as noted. Our mission is bringing people information and ideas together to enrich lives and Bill Community. We've been doing that since 1890 and this proposal will allow us to continue doing so one of the things that we do very well is that we listen to our community. It's actually in the DNA of the Seattle Public Library and we have a community engagement team whose job it is it is to go out and listen to our community and understand their interest needs and the voice that they would like to have projected and then help us deliver that through our programs and services over the past two years. I've had thank you over the past two years. I've had opportunities to go out and speak to different communities about the work that we're doing in speaking with those communities. We've done it in a couple of ways that we conducted in 2012 that queried 33,000 people 33000 + Seattle residents who told us what they wanted from their libraries and the things that they wanted were the components of the 2012 live a more open hours more robust collection updated technology and clean and safe buildings in 2018. We had an opportunity to go back out and doing The survey are library programs and services survey and what we found with responsive 26,000 residence is that they affirmed the four areas that they would like to have a system. They wanted a robust collection of books and materials. They also wanted us to provide computers and internet access and provide programs and services to high-needs communities and I will say that Emmet's survey we were able to do so both in online and print format and we were able to deliver it in 8 languages so we felt very good about what we were able to do and gain from that in addition. What we also really found out is how much are seattleites love and value are libraries. They believe that we are an essential service that we are worth the investment. I probably should have spoken about the statistic 9 out of 10 Seattle residents agree. The library is an essential City service will work on that one out of 10. Each time. We go along that we are worth the investment wearing Improvement to the Call quality of life and we're critical educational resource. And what is also important about that and not that it shows only the value of it. But they also love it with two out of three residents thing that use the library within the last 6 months. And so one of the things that I wanted to show you through a video is just how we unpack our communities and what they value for us and this the video that was created by our marketing and online services department to talk about how technology works for our patrons and residents. What I'm doing at the library today is I'm working on some music I come up here to my Excel sheets are very my presentations. Check my email in some of the documents that I'm expecting some job search. We see the public library is the people's University is a place where you can come and get free instruction a place where you can come and get free resources. We want to be the place where you can also come and get technology skill set. My focusing on Equity during the website redesign project address language barriers, and we also try to address that issue of people having an equitable access even to technology. It's a matter of human basic right to have an access of websites for all people have done a lot of things and consulting services to the library. I am looking is the web page is accessible to people with vision impairment. So the end result with the website is that we now have a website that is accessible to everybody no matter what language line services. You can learn a language through our services. You can learn how to program a computer. We have lynda.com that has all sorts of instruction on Computing how to use programs. We added music films videos TV shows that you can download or watch online free computer classes and they vary it from digital literacy classes through a digital creativity classes. This is my phone. It's a smart phone and it's smarter than I am and I didn't know how to use it and they put on a class of how to use the new technology. We specialize in information literacy. So not only showing folks how to find information but how to evaluate that contest the thickness Survival Guide is a 2-hour class that we have here at the Central Library. It's essentially just an overview of misinformation and disinformation and how you can evaluate and have best practices with aging in online information. 101 take a piss off at weekly in most locations and so they caught regular NL Central Library to off but three times a week. We just help me troubleshoot basic Tech questions with their computer phone to email social media and the tutoring is preparing me to go further in my goals, which will be technology and onto back to college again, the library also offers free Microsoft certification exam and currently we offer Microsoft Office specialist and Microsoft Technology associate exam so that you can take for free at the library through a partnership with the Washington State library and you can sign up and hopefully get better jobs at the result of it. We really believe in narrowing that digital divide for the citizens of the city. We like to provide job resources access to social services from local state and federal. I'm using the housing resources that they have internet access, you know, where I be completely closed out from the world and you know, I can talk to my family and friends and stuff like that. It helps a lot to have that access and not have to pay anything's free right at work including Wi-Fi. We replaced all of the available public computers in the system. We upgraded size of the monitors. We've offered upgraded printers copiers and scanners at all. The branches we have meeting rooms that have been expanded upon with wide screen TVs. We also have the flex Tec equipment or people can check out my path and laptops and use a draw the library. As far as creating music goes it's super expensive. There's not a lot of places are around here that have this where you have your mic and your music program you to the patient's to have free access to the equipment is very encouraging for the Youth in my area lot of patients have been coming in to use it as a interview room. There's a camera that the patients are able to check out have to check it out after from there to bring it in and put it on top of the screen and then able to protect themselves and be able to see the person that's interviewing them and vice versa. Black people to come the library are homeless and they have nowhere to go and no word charge their stuff for fill out applications. It really helps them so that way if it dropped they have their stuff Church a lot of us take for granted that we can just pick up our phones we can go online we can see what news is happening. We can call our family we can email. It's important to remember that not everybody has that same access the public library has Wi-Fi hotspots available for anyone to check out. These are small devices that connect to a Wi-Fi signal and you can take them either to your home or outside the building and it will keep you connected through our Wi-Fi hotspot Outreach and programs that we have at the library. We are able to build those people up give them some support and stability said that they have the same opportunities that we take for granted Seattle public libraries dynamic. Did the people need Seattle Public Library is my future? Thank you for giving us space to share that and I think it speaks to one of the service areas are components of the 2012 Levy which is related to technology that we want to continue through this effort. And with that I'll move into maintaining the current Levy Investments. And in order to do that. We do need consistent and sustainable funding the current Levy represents 25% of our overall budget and renewing its Levi is crucial to that. Two weeks ago is Jay mentioned. We were here talking to you about the 2018 Levy report and I with the many accomplishments that that Levi investment provided a 29 Baseline a 2019 Baseline Levy library to deliver that 2019 service-level over the next seven years and the cost of a baseline renewal would be 167 million when adjusted for inflation are being said, I'd like to walk you through what how we got from 123 million to 167 million. Worst of all is your familiar with state law limits property tax growth to 1% per year and inflation is almost always higher than that. When The Levee is up for Renewal we need to do a reset of revenues collected to the cost of services in the last year of the current Levy and in order to provide that at least that same level of service in the last year of the Levee that we provide in the first year we structured so that more money is collected in the beginning for you that the end of the Levee the families families and Ed Levy was structured in the same way and in the case of this waiver renewal proposal it for you today it at in addresses emergent needs such as Friday hours or additional hours additional security and custodial support and additional investments in the collection. The proposed new Levy investments will I'll move into that now and I will address the critical needs over the cart of the course of the next seven years of Atlanta. So we'll be talking about before you move back. I just want to have a better understanding for me at least on what the Baseline means. I mean understanding concept that if we did nothing, but just renew it. That number would be 167 I ever that much but I don't fully understand that the cost of just explaining to get us at the cost of living per year on a you confuse me a little bit when we front load and we're collecting more money how that ties into the number we have at 167. Sure sure and I'll defer to the band probably only one in-room confusing us with bare with me. 4% per year compounded that actually adds up pretty quickly and the other is a restructured the previous Levy so that we spent less of the money in the initial years and more of it in the later years in part 2 to deal with issues of inflation because of the revenues to 11% really flat and we knew we would have higher expenses at the end of the Levee so fun to do this in a way that you can see it's tipped off in terms of its expenditures. So as you reach the end in order to renew for next year, we have to renew for an amount that is well above the average amount for the Levee and then there's a future inflation beyond that. So it's a function of the love. You haven't been structures authors a relatively more spending in the in the latter years and then also anticipating inflation over the coming 7 years has a quick follow-up in 2012. We use general fund and refunds. We only continue to invest post animal fund and real estate excise tax funds in the library. And then we will going forward on the operational side. The Levee is essentially supporting the same set of activities over the course of the of the of the seven years, but the annual amounts are fixed in in dollar terms and nominal terms, but we know is that the cost will be increasing over the seven years. So we under spending the first couple in the first half of the levy anticipating it will need to spend a little bit more in the in the second half of Levi so the current level 223 / 7 but but we don't fit in the average amount. We're spending more than that. I'm going to need additional years we spent less. So as to renew we have to take on the the higher cost that we are experiencing in the in the latter years of the previous Levy and then we also have to look forward recognizing it till the end. I'm over the next seven years as well. So just a few follow-ups and let me shut up Travis my questions with a little introduction II again, I want to thank both the mayor and the five trustees and they friends of the Seattle Public Library in the foundation for all of the the great work. They've done historically and in very recently putting this package together. I certainly don't even have to be remotely sold on the benefits of the library system. I think, you know my relationship with Library. So so all I'm trying to focus in on is the the improvement from the Baseline. I mean, I love those videos. I love the stories and I know the lies that are touched by the the beauty of the library so so so I'm good there. Can you explain to me why the administration? Costs seem to go up based on the amount of the Levee. Because it would seem to me that the administration is somewhat constant regardless as to the amount of the levy. So I'm I'm missing something so because it was even to renew it you're saying is 2.2 but the administration just employees administering the Levee. So I'm apparently missing something why add doubles and even increases with the improvements one of the things are as we would have some of the same issues have been just address which is the cost for delivering Administration will rise faster than the 1% that the Levee will grow. So that's why there's also money set aside to do a study libraries of the future that's in there as well. That is so strategic component of that. It's just for the breakdown but I still wasn't confused as to even on the Baseline renewal. It moves from 1.4 to 2.2 if we just renewed it, why would the administration costs go up? So significant about the same factors that we were describing so that the the inflation wages and salaries in and related costs. So that's a component that is that is driving cost at and I want to drill them better information from in front of me to okay, we can figure it out on other thing. We added an additional Finance person as we have converted to of the new accounting system for the city. It's more complicated and we've had to have staff to prepare for that transition as well as operate in the more complex accounting world. So there is additional financial help to do the tracking in the new system. So my knee-jerk reaction to this the first meaning of of many as we prepare Levy packages when I look at I think we're smartly increasing our money's and technology and online services, and we're trying to get more Technology oriented and how we administer these kinds of levees. I was hopeful that many of these Administration cost to go up by then. We have to be sensitive to what we're asking the public to pay for it. And when you see the administration cost going up on ass like this gets a little harder to sell answer temperature. Sure, thank you and will follow up on that as we go along? So right here, you have a cost accounting of the 7-year Levy as we move through. The rest of my presentation will be able to Circle back to this page for the screen so that you can see the allocations attributed to that what we're walking through now is that just shared with you? We were doing a baseline to cover those four components that were are a part of the original 2012 Levi. We're now going to talk about some of the additions to the levy package that is being proposed. And we believe these additions cover two things. First of all, the address and critical operational needs for which and life safety issues and they make are libraries more Equitable and more accessible for Seattle residents. So we'll be talking through the ads to the project as we move along. The first one is with regard to open hours. One of the things that we're doing. We recognize from our community conversations. Is that the number one priority from the survey was that we have more open hours and adding diesel hours that we are going to talk about in a few minutes before 8 to about 5,000 open our additional open hours across the city, but they also help us approach our pre Great Recession levels of open hours. We are not exactly they are by doing this but it gets us closer to that and we're doing so through an equity lands with covers a couple of components. It takes into account education economic health housing and neighborhood quality Transportation mobility and health and environment. So we use the same components of that as the King County uses with this opportunity map and what we're also trying to provide it's not just 5,000 more open hours across the city, but we're trying to provide 5000 more hours of access access to the spaces for Patrons T work and connect and engage access to a staff for assistance access to our materials and Collections and access to the resources that we have in our library such as our Wi-Fi computers tablets printers and copiers connection here this next series of slide. So we have slide 14 through 17 that really spent a lot of time talking about how this Levi is responsive to do community desires to want to have more access and for longer periods of time at our neighborhood libraries, but I want to connect apps to a point of information that you provided to us on slide at 6, which gave us a little bit more insight into What some of the community priorities were as identified and articulated via the survey of more than 26,000 residence as as part and parcel of the comedian gagement process for chafing in developing this Levi and in one of those things that talks about how Seattle residents told the library that they wanted more programs and services to meet the needs of high-needs community members. So can you share with us a little bit more about how this Levi is responsive to that Community interest answer, you know, the program of service is what we offer our public that is the access to our collections the assistance that our staff provide to do anything one of the components that Came out of the survey was that they wanted us to meet and provide programs and services to the high needs Community. We do that through Staffing and so in order for us to do that. We have to two things. First of all, we are straddling a river where we have one foot in the libraries and one foot out in the community. And in order for us to serve both of them. We have to have the libraries open and then we have to have Staffing to go out in the community. So this is what this allows us to do. We are able to provide more Staffing and that Staffing van is able to go out in the community and help so we would have both the libraries open as well as going out to deliver programs and services to our high needs Community as well as when they are open more of our high needs communities can come into the library's during the open hours and use the services that we have available to copy is the computers or access to in the case of the technology video the resources of the media lab room. So that is the connection that we are trying to make their Turn this lever here in the prior Levi Define high-needs communities. So we Define our needs Community the same components that are used for the opportunity map education level of economic health housing neighborhood quality Transportation Mobility. We look at all of those things. One of the other things that were able to do as when we go out into our communities with our community engagement teams were able to hear first-hand from the communities themselves with the types of things and services and programs. They want to see it in some instances. It's just a matter of giving them voice a lot of times. They have not had an opportunity to be heard. So they need spaces to even come together and mingle is not the right word. Connect with other than their Community socialize. Thank you. The opportunity to get their neighbors and that's that opportunity there as well. And in the reason I have a particular interest in this space is because early on Mt. We had it. Opportunity have a conversation about some of the other interesting wraparound work. I would call that the library provides to to folks who who to patrons and we have that conversation in the context of chair. Juarez's Parks committee, which includes the library and one of the things that I remember you talking to us about where a lot of the literacy programs and services that the library provides to patrons and in a lot of those programs are really Innovative opportunities to create Early Learning opportunities for a littlest learners, but also creating opportunities and Pathways for for parents who are also patrons to be able to socialize and support each other in parenting efforts and in just socializing their own children and their own family to The Vow. Value of reading and in learning and I remember in the context of that conversation. This is probably a year or year-and-a-half ago. You describe that you all were doing that work with basically a shoestring budget, but it was also one of the programs and services that people sought folks are really serve aggressively wanting to get access those services and I think at the time you mentioned to me that the foundation was primarily funding that type of program in service or are we through this Levy creating an opportunity for there to be a more consistent Revenue stream for those types of literacy programs at the library, and if not, why not? Sure so a couple of things one. The first is the answer to your question. Yes, all of those are the types of programs and services that we offer to serve needs of our communities by the parents and caregivers who have children in need this opportunity for their children to have additional learning experiences of informal learning that doesn't come through the school program of formalized Headstart type programs. We do offer that we do story times and we do that through the use of a staff with these additional hours were able to look at opportunities were able to go out in the community more in some instances to engage with these parents and caregivers who may not come in get more daycares. I get a mobile services out in the community as well. But we also look at this as opportunities to partner with other institutions who help us deliver some of these Services. We have a very we have a diverse staff who speaks several languages, but a lot of times some of the languages that we need to have engagement opportunities with our communities. How we do not have that language capacity on our staff. And so we partner with other agencies to deliver World languages story times for parents who have kids that speak other languages. And so we look at those opportunities about the Partnerships and is again what this opportunity allows us with the open hours is to be open to the public for those people who want to come into the door through the doors of the library and use that space But it also gives us the opportunity to look at more chances for us to do more programming along that line as well as go out into the community and do that. In fact just this past Saturday. I was at our Columbia Library and witnessing are attending a baby story time and had an opportunity to listen to some of the parents who were just there and they were talking about how they were headed to a different story time in a different neighborhood because it was convenient on a Saturday and I just found out that it was available at this location on Saturday. So we were able to look at these opportunities. It's Friday storytimes. We're adding some of the hours will be able to do that. Okay. Well, I really appreciate appreciate that. I'm I'm always on the lookout for an opportunity to better support families and children and in their in their ability to learn both in the classroom, but also outside of classrooms and this is a this is a priority that I think has really developed in my mind in large part due to a lot of the interaction that I have with folks and Community who really expressed a lot of interest in wanting to be able to continue to use that Library use the libraries in that manner. And so I'm hopeful that with the assistance of central staff will be able to explore this area of investment a little bit more and and I have a really strong interest in making sure that the library continues to have the support in the resources. You all need to be able to continue to invest in those particular programmatic service areas. Appreciative of that and as we move into the Friday hours, you might see an opportunity for you are I think you were a attended the program we had at Southpark a year-and-a-half ago opportunity and even being open on a Friday allows us to have more schools coming to the library on those days. That would have been closed out of neighborhood. So I have some particular models in mind that I'd like to provide a council Central staff and happy to provide those to you as well that are little bit more intentional than just having space available. But happy to have a conversation with you about what I'm thinking and what might be a unique opportunity and the renewal of this of this Levy to really capitalize on the important Network and fabric that libraries provide to be able to support communities who don't ordinarily have access to the enrichment activities that occur within the four walls of our library. We certainly welcome that and then it gives us an opportunity to do 26001 surveys to have felt like to make sure that we're meeting the needs, but we welcome at thank you. Thank you. One of the things that we are looking at is more open hours on Sundays and this again gets to the physical access to the building themselves, but currently the neighborhood libraries are not open until 1 p.m. On Sundays and this will give us an opportunity through this proposal to open it 12:00 noon at every Library across the system and then brings us to all 27 locations opening at noon on Sundays and giving people more access to the computers and staff assistant that we talked about in general. We also look at an opportunity to add more open hours through Friday hours at 4 Valley locations Delridge new Holly Green Lake in Wallingford libraries. This is bring us to seven day service in these locations and move the system to 22 libraries that are open on 7 days a week and Ruth V only remaining as not being seven days per week Library services, so we're really Excited about that equates to an additional 8 hours of each Friday for those locations. I'm not giving up on my coffee shop for Gun Lake City. I know you're not and wake up there. We will keep thinking about ways to make that happen. The last of the open hours is morning and evenings. And what we would be looking at is adding morning and evening hours to three of our locations High Point IDC and South Park Library, it would have 10 a.m. Opening onto of the mornings and an APM closing each week, which brings us more in alignment with that. So we're continuing to look at opportunities to bring are libraries back up to pre-recession levels as well as to provide access or more opportunities for access to the materials and resources than the staff that assist our patrons with their work. But that I'll move into the next bucket unless into the next component questions about that but the next component is a collections investment. And one of the first things that I really want to talk about is that having a great collection really depends on our having a mix of formats to address the different needs of our public. There are many patients who still believe in print and want us to continue buying print materials, but it's j reference to a moment ago. We do have a growing interest in our digital collections. When I join the library back in 2011 are circulation of electronic materials was about 8 to 10% of our total circulation, which meant that 90% of our users were still using print materials. Here. We are in 2019 and we're now add about twenty-eight to thirty percent electronic use. So year-over-year electronic access is growing and my only point about that is that there has to be a combination of the mix of Cereal that people want there are people who are die-hard print readers and there are people who are die-hard electronic readers. And in order to meet both of those needs. We have to keep both going. It also helps us address the needs of our patrons so that they are not intentionally long wait list and we can get to them as quickly as We Can chant is rushing me along. So I'll move over normally I'm rushing her along but she's resting me today. We're hearing from you that is good to know because of our team and many of them are represented behind me. They really do work hard to get that right mix of collection materials in that balance to meet the needs and some of the programs like IP pick up program helps drive at effort. There are people who are waiting for it to come in but there are people who walk in and able to grab the book right off the shelf and so that in turn changes the wait time. For the other books that are on hold. So it's really a great combination of meeting that the component that I just spoke about was with regard to electronic materials and resources and this is one of the areas that is an ad in the badge in a proposed Levy package. And that's because not only is our usage of electronic materials increasing we seen a 284% increase since 2012, but it is also one of the higher cost collections that we maintain at the library. I think several of you ass in this example before but you'll know that are e-books cost 325 times more than a print item and that we work with a different and complex and changing licensing and pricing agreements with the five different Publishers that we use. I also want to just do a lien it up to some of the conversation is going to follow with regard to fine, but I'll also know that with re Training materials they are all fine free. So when you finish using that item there is no fine attached to it because the item is returned. So we are already working in a fine free environment. Which moved us to the big conversation on eliminating finds on physical materials and there's quite a bit to cover in this and I think one of the first things that I would share that Jay in the library board and the library staff are very very much committed to ensuring Equitable access to library resourses by eliminating the barriers that patients and counter to using our materials and resources and one of those barriers IR Financial barriers, the fact that we currently have fines and fees attached to an item indicates too many of our communities and users that this may not be the route that they want to take to access our collections. We've had some research done and it shows that finds have disproportionate impact on a low income Patron and that it also shows that there a higher average balances and greater numbers of blocked accounts in lower-income areas. So I think that's the lead into this conversation, but then I'd like to reset the stage. nn help share what we're talking about when we're talking about eliminating fine on our patient records in the library where we use both the term finds and we use the term fees and for some of our public that may be confusing but for us there are two different things fines are the amounts of money is charged to an item when it is not returned on time you check out a book at the end of three weeks when it is due back at the library. If you did not return it on time. We affect you a fine of $0.25 per day that I'm Mount can reach up to $15 which then becomes a blocked account. The second thing that I wanted to speak about is a fee which is different from a fine of fee is the cost of an item when it is lost or damaged or not returned in this proposal. We're talking about eliminating the fines the fees would still be in place such that they still perform an incentive to have patrons return their items. The fee is something that would block their account which means they would not have access to any of the materials are resources that we have in the library and it also serves as an incentive in and of itself to return the item so that it doesn't come lost or damaged. I think a couple of things that I should also add to this just to help perspective about this is that this is not our first time at this in this some Arena some of your Bruce you might I'm sorry come from Amber Harrell. You may remember that. We had a library director. A couple of years ago name a list route and live at that time decided along with the board that the library should eliminate as many Berry as much like our current board does eliminate as many barriers as they can to access to children and sell at that time. We actually remove the fines attached to Children's materials. And so we have had find free materials in our collection and worked under that practice before and in fact, it was for 19 years. We did it from 1990 to 2009. So it was only in 2010 that the board read and stayed at the fines and that was because we were having a dwindling the city was facing some economic challenges. And so the library was looking at opportunities to increase their revenue. I'll add on to that there are two other Collections that we Collections and patients that we provide find free access to if you are on our mobile routes where a bookmobile goes those are fine free items as well. So we have a part of a collection that is fine free there as well and that continues to this day and then the third group is that for any approved Ada allowances. We do not attach 5 to any material that are checked out there. So the library has some great experience using a fine free model and plate again. I just want to reiterate that the fees would remain in place. If a person did not return their item and their access to use of the library would be curtailed until that was remedy questions about that two things finds do not make up a significant portion of a revenue stream. I do not we currently receive about 1.1 million item 1.1 million dollars in revenue from fines and fees and that money is used to help cover operational cost of the library. So that is how she is but that is in an 80 million dollar budget over 1 million per year and I wanted to find out if we're going to get to this and if you are then I'll just be quiet in the submarine physical note you attached some what we would call heat Maps or maps and of course one that councilman Gonzalez refer to we had discussions about in committee is that when you line up the percentage of blocked accounts by Library location, it aligns exactly with the opcd race and social justice Equity map the percentage of patriots who computers by SPL branch locations in which means basically that people whose Being blocked are the same people where we are trying to reach our race and social just react with measures and access issues. And so if we were to have a library and having a central government to function as a library school or any of these institutions, the the the whole goal is to get people in the building and to have knowledge and had access to knowledge into to all of those issues. But is that you've you've said it better than I would say that is exactly what it is trying to do to equalize that playing field so that everyone has access to the materials and resources than that. The application of a find is not challenge their ability to do that two quick things. I'll at about that. I should also know that that 1.1 million we collect per year is gradually declining Revenue source as more and more people moving to print moving to electronic use of materials. We are on covering that the fines Cuz they are using digital or electronic materials. There are no fines attached to it. So we're seeing that decreasing that was something that we were going to have to address at some point in time soon enough. Uncus over? Not trying me to find cop here, but 1.1 million for years and nice piece of change though. I mean, especially when I was looking at that for administration costs, so I guess my question is send the idea behind having a fine free atmosphere. I get that and they despaired impact. Was there any discussion about the bount? Another possibility that as opposed to just waving them all together because I think the is Route 8 8 million that we're being asked to put in the levy to have a fine free environment. Are there other cities that have looked at this issue. I mean, I'm trying to see what the possibilities are because that seems to be fairly supportive of people that can't pay the fines, but there could be people that so, you know forgot I'll pay the fine and They may be somewhat of a means and so in trying to address the problem with the despaired impact, we're just waving everything. So is there any other possibilities and I Syracuse about this discussion to let up to find free maybe were there any people that said that's not a good idea to get a feel for it. So there are a couple of components to your question. The first one is whether there are other libraries that are doing this we have uncovered that there are about fifty libraries across the country who are looking at this and I would dare say that many more libraries have looked at it thought about it and try to figure out the best way to do we have a list in front of you that identifies several urban urban libraries that actually have find free environments and I'll also know that the two libraries and read our local Washington libraries both the Kitsap Regional Library and the Sno-Isle Library System who did not currently collect fines with regard to your question about other options. I think we look at Options from any different angle we look at looking at different age groups whether we should just have it for children or teens should we have it for this group? I think one of the challenges that we uncover is that I seen a voluntary as well sure. It's a fine but it's voluntary. I think that if we were to move to a fine free environment and a person felt that a person cut the material longer than the return. Date and felt a need to give our pay their fine. We would welcome that as a donation to the library and could use it that way. So it's it's still an opportunity for people who are of means to do so, but we would be removing that because the challenge would be setting up to standards for Who falls or who qualifies into which group my thinking and I'm making this up on the Fly here just cuz I started study materials was a system by which that there still a fine but people know that it's not going to go to bill collection agencies not going to ruin your credit. You're not on the blocked list, but it is a fine and we're trying to promote. Good behavior hair. I mean will I do not grow up in the atmosphere in the in the in school you had to get that book back in time. And so but even if it's not enforce it still tries to encourage timely return sure it it will encourage timely return because we will still have the fee attached to the unreturned item will look at opportunities to Actually consider what happens when a person doesn't return a book and the timeliness added. I think the opportunity to address signs and a secret ending in i don't know if he was but I think the opportunity to look at other Alternatives with current proposal. We feel very good about what is put in front of us, but certainly we've learned from other libraries as how they have implemented and in an effort to not reinvent the wheel in an effort to honor that we have had a history of working with find three environments. We feel that this is a good proposal to move forward on if I could just add two for the viewing public and put it in our information pack of her colleagues as well. They study in San Francisco long-overdue eliminating find some overdue materials to improve access to the San Francisco Public Library, which came out in January 2019, which is a very compelling study and it is written and was Done by Jose Cisneros who is the treasurer for the city of San Francisco. And in response to council presidents questions was for thank you cancel president. Those are a lot of the issues of calls that we had been getting about that and it is the financial Justice project and we Googled it and looked at it is is it really lays out? What what what is city does and how and why other cities are moving to this to this model in some cities had already been doing it. So it isn't that groundbreaking I guess that's the point. I'm trying to make know you're so true. And there's another one by Denver Public Library at 6 to that much shorter. But again, these are the spaces where we are looking to our colleagues across the country who have looked at these opportunities done some extensive study combined with the fact that we have a history of having a fine free environment that we feel very good about what is being put forward, but certainly they had looked at all of the options and opportunities to do so Best custom exhaust I have a couple points. I wanted to make him one of them is a question which has that, you know, it's my understanding that the total fines. The revenue of two libraries from fines is approximately million dollars are correct of the life of the library system of a system is $1000000 total a year in terms of the context of the library's full budget. What percentage is that? $1000000 per year late fines don't actually impact in any kind of significant way the timeliness of people returning materials. So it's just there as change tattoo quote but one of the reasons as we have one of the higher per day fees in library systems. So like if you were to look across the country is actually pretty high and I was raised and I'm not sure Andrew. We raised it up during time of austerity to try to make sure that we could preserve library Services because the money does fun to open hours and books and materials. That's what it's used for. So 2008 2010 head and while I appreciate that a million dollars is the lot of money. I think there's no question that million dollars is a lot of money but I think I think in the context of the overall operating budget and budget for Seattle public libraries. I'm not sure it's fair to characterize a million dollars is that big significant chunk of change and in terms of our considerations in proposing a new Lobby for the ballot that being said I have also had conversations with empty and mayor's office around this issue the Is bubbling up around? What is the what is the correlation between fines and in the timely return or eventual return of of a material that belongs to the Seattle Public Library and I have been persuaded that there is no a strong correlation between the two and and use a lot of the analogies it that I use a lot of my head that are sort of analogies that exist in the criminal justice world around sort of what is a you know, what does does bail actually have a connection for example in causing somebody to return and appear in a court hearing does a worn have that same effect and I think there was a lot of new studies out there that sort of question the effectiveness of utilizing finances as the as the stick in a carrot stick. Model to actually achieve compliance. And so while I appreciate the line of questioning around around this particular issue, I think there are other cities that have really invented in the space that have done a lot of research and a lot of study that leads me to believe that that the fines at this point are probably more likely punitive towards communities who are of low income and who are people of color and an aren't actually achieving the desired effect of incentivizing people to timely return materials to the collection. And in fact, I think the fact that we're even having a conversation that there's a million dollars worth of fines collected in a year proves that the fines are actually resulting in people returning their box and the fact that people are actually being blocked out of access again is proofing in of itself that the fines aren't an effective deterrent. Incentivizing people to return material to the collection. So I think I think there are a lot of non-financial ways that the library can look at and utilize and Implement that will effectively achieve the library's goal in the city's goal of incentivizing people to return materials back to the library in a timely manner and it's my understanding that the proposal in this Levy does continue to include accountability requirements. So if we're examples you do not return a book that will ultimately result result in you losing your library privileges and and we don't need to you no shame people by having them feel like they have this money they owe to the city. I'm in order to accomplish that accountability from from my from my perspective. That's how I'm feeling about this issue. And that's how I'm looking at it at the last thing I'll say is that you also don't have to look. As far as Denver or San Francisco to identify whether or not a unifying is appropriate or not appropriate or has disproportionate impact on low-income communities of color is my understanding the library also did a similar pilot here at the Seattle Public Library and learned quite a bit as a result of that pilot. And so perhaps this is a good opportunity for the library to talk to us about about that pilot if you're prepared to do so at this moment, and if not, perhaps it a future Committee hearing we can we can hear a little bit more about the pilot that you all did around fines and mvtv question around accountability as it relates to returning materials sure certainly and you've given us the opportunity to share a few things before I get into each of those. I'd also say one thing which is the library has a vested interest in getting our materials back our soul businesses the learning and sharing up in cereals. We're not a very good system if we can't get the Back to circulate to the next person. So we are very interested in that. The second thing that I would say about that is that we're very fortunate here in Seattle that we have a population that believes in libraries that loves libraries and that for the most part return them here at aerial fun time. We don't expect those ideal Patron and users to not continue returning their material. So we're expecting that to continue occurring so that we keep the materials and circulation and that is in the note fine atmosphere. I think cuz my cousin said that that if they if they don't return on time than they still can't so they're on the block list shirts. So what happens is that we currently have a blocked account list at $15 which means if your fines or your fees that you lost an item and it did you did not return it if it reaches $15 your axe. Block that fee would still be in place. Even if we eliminated the fines program as such what councilmember Gonzales is saying is that yes if they did not return the item within a. Of time that item with feta loss and then the patient would be responsible for that item and until they paid the cost of that they would have their use of the library restricted in some ways. Say that seems the difference between lost or damaged item and the difference between Shark part of the reason we have the lost and damaged item is a gift of public funds requirements in the state of Washington. So we're actually not allowed to not if you will I still look at it. It's just one main four-year 7 million / to life the Levee you're asking for 5.8 million, which is to as an improvement to open up all the access me hours. I mean that this actually affects it is again. I look at it's a sizable budget impact just because again, if you'd like the improvements the just a million here a million there really goes to a credible access to the Patriots. And so Again, I am not trying to fall on my sword over. Where do we find and I'm just trying to better understand the issue know and that's the point of this. So we're happy to answer any questions and whatever you feel that we have not answered. Are you still haven't mingling interested. Please certainly follow up with that. I think the one more thing that I would say I know just wants my dog, but it will come to me in a minute as we move forward on it. But with regard to council Irma Gonzalez has an interest in the Fresh Start program, which she was referencing. The library has had a program for teens call Fresh Start that allows them to speak with the staff and work through a process to eliminate the fines on their accounts. However, if they had fees attached to them their accounts could still be blocked working with our foundation and private dollars from our donors. We were able to enhance the Fresh Start program such that Patrons are donors are able to give money to support the Fresh Start program in helping us eliminate those fees. So that program allows us to remove the fees and in turn. I know that number is higher than what my statistics currently show but we had eliminated the barriers to using the library and restored 700 patreon accounts to teens using the library. She's looking for a place to write me a note. So it is the 1,000 1,000 now accounts that have been open for our team program. And so that again shows what the pure gold of all of us is which is to open or eliminate the various to use of the library and that program in and out of South thanks to the private dollars allows us to have 1,000 more teens using the library and what we've also found is that the incidence of a returning materials on time is certainly understood and appreciated by them. So they are not abusing the program as as some might think it would be and then I did think of the point that I was going to ask which is this Effort that we are putting forward to eliminate the barriers. I know that some few that as paying the fines of patrons and they don't want to cover that. I think it's important for us to understand that this is a replacement for some of the operational cost that you were referencing a moment ago, council member been solid. So it's not a matter of paying the signs of patients who for whatever reason can't do so, this is actually an opportunity for through the assistance to help us find some of the operational cost of the library. I would just sort of say that in my mind the way that I look at this policy decision is pretty simple. The policy decision before is how do we want to support the library's goal of creating incentives for people to return things that they check out at the library that need to be returned. And so to me, I think that the policy Solutions and answers to that particular policy question are very different than the answers are solutions to how do we generate additional revenue for the library that is connected with our collections. Right? And if and if for me on that ladder question if if what we are trying to do is generate Revenue than I think we we we we double down on the fines and continue to use that as a Source and if that's what it's going to be we just have to be transparent that we are utilizing finds that are disproportionately impose upon low-income communities and communities of color as indicated by all the maps and heat maps that you all have provided us and that we're doing that in order to generate additional revenue for the library and to me that that if I'm asked that policy question, I'm going to say no. Thank you in the library. So just not generate Revenue. We all understand that the purpose of a library any Library since the 1800s unlike the casino is not to generate Revenue don't make me have to quote Jefferson cuz I will but if we can move on that be greater and I'll try to move through this quickly. So that is what Proposed they are one of the other components of the current lady that we were hoping to extend through this renewal is with regard to technology and online services currently the program that we haven't placed through the 2012 Levy allows us to change out computers update them printers all of the hardware and software needs that are attached with that. However, we are also looking to enhance or address some of the challenges we have with our current infrastructure for a program of it. And that is that we have switches in both our Central and 27 locations that need to be corrected. We're in year two thousand where near Six out of the seven year expected lifespan of the switches that we currently have in place and know that they will give out sometime during the course of this lady and there is a component built into a dress that The other item that you will see if I had the operating system the ILS by which everything that pertains to how a patron uses the library meaning how we buy the materials how we log a man how we catalog and how the patron discovers them in terms of finding something to read use. Our view is run through a r i l s r i l s was last replaced in 2005. So we're about 14 years out on this item and it is greatly in need of replacement either from the lack of support that is coming from the vendor who we purchased it from to meeting the needs of our patients who want and expect a different Discovery layer for use of materials. So those two components that they aren't there is also the matter of our digital Equity program. The digital Equity program is currently funded by the cable franchise fee and that covers are out Wi-Fi. Spots on digital Equity programs in the library building van out in the community. The cable franchise fee is a declining Revenue stream for the city. The library is not the only recipient of these funds and at the current rate with which that revenue is declining the library would have to make some serious decisions about how we would find that sell valuable program that you heard about the technology video that was just shown so we would be looking to address that through the digital Equity program to continue the Wi-Fi hotspot program. One of the other items of the come of the proposed Levy package is to continue the maintenance of our buildings, but also to address seismic retrofit for three of our most vulnerable Carnegie Library, they are the Columbia Library Greenlake library and the University Library. We are greatly in need of a dressing that and so this is an opportunity for us to go in and make the size. Retrofit to ensure that this Library can withstand an earthquake and ensure the safety of the patients who are using it. And then I think this sort of plays into the area that councilmember Harrell was referencing with regard to the administrative costs attached to the administrative cost is a effort that the library is looking at to understand the future of libraries. It is not the next two years. It is not the three years that it's not a strategic Direction in that effort. It is actually an effort to understand the role of the library in a changing environment 10 years down the road. We want to understand. What is the impact of Education communication and technology and affordability and accessibility combined with the space and access information at the library provides. So with that we're now moving into the proposed package and what that looks like a wonderful package. It reflects the community's priorities. It looks at investing in more hours and access collections technology maintenance and Levi Administration and also takes into account to find free access switch for the average Seattle homeowner would come to about 3 night $3.19 per year at 27% per month. So again that is not in relation to anything but looking at a way to eliminate barriers. Picture of the cost of the following P program Oak off the average Seattle home over over the course of a year $3.19 or about $0.27 per month to assist with eliminating barriers to access. And with that I am at my last flight which reiterates what I spoke to at the beginning of the presentation that the Seattle Public Library as evidenced by our surveys and the support that we came from a city is that we are in a Central City service. We're worth the investment wearing Improvement to the overall quality of life and we are critical educational resource. And when we have a community that believes in us so critically and so forcefully about that our goal is to deliver on that interest I should add if you had a coffee shop. You have a revenue stream. We had a plan that song again, you know, I have heard you every time and we will continue looking for opportunities to do something about that Jeff. Thank you. nothing additional only if there is anything that wakes you up in the middle of the night screaming we will take an email and get on that just too quickly so that we will have those answers for you at the next meeting. Thank you for your time. Thank you. I just want a little historical note that I'm going to close this down. I just think that if people forget and I'm only saying this because I am really not that smart as happen to run across an article like 2 weeks ago in the medium about how the Library of Congress got started and how did Thomas Jefferson and everyone fought him to have a library and I had to laugh reading about it because at the time people thought that even though he was saying that obviously books are vehicle for knowledge. There is this whole societal fear of books and that it was a luxury and that ordinary people shouldn't have that luxury. The only the learning people should have that and it certainly shouldn't be free in the quotes were that it was a frivolous use of public funds and there wasn't a necessity of books for ordinary people. And of course it's now now we see how libraries have grown obviously because certain people believed in the civic-mindedness that you know government should fund institution such as a library like we do schools and courts and everything else. So I'm going to leave it at that and why I want to say thank you very much before we adjourn I want to share that I'm going to lay out the next meeting. So my colleagues will know as well. So the next meeting of the select committee on the library Levy will be Monday April 8th at 10:30 a.m. Or after cancel briefing. And at that meeting we will work with social staff and identify potential issues about the levy the third meeting will be April 11th at 5:30. We will be holding a hearing at our meeting so we can hear from the public. So that's a public hearing at 5:30 4th meeting will be April 17th at 2:30 so we can hold a potential vote in committee on the Levee and finally our fifth and final meeting will be April 22nd at 2 for a full Council vote and with that we stand adjourned. Thank you. Thank you. Cousin, Rick Gonzalez and president Harrell.", "end_time": 5819.9}]}