{"format": "raw", "annotations": [], "confidence": 0.9380294895172119, "data": [{"start_time": 0, "text": "Then let's test went all there we go. Good afternoon. Good morning. Rather. This is a special meeting of the select committee on Civic Arenas. It's Monday, July 15th. And the time is 10:34 a.m. I can suppress Bruce hero co-chair of this community with my fellow co-chair councilmember Debora Juarez joint in my left on Joint Council Members Bagshaw Gonzales and Pacheco. And if there's no objection today's agenda will be adopted. You know Jackson today's agenda is adopted to public hearings. Basically one on one of the matters in particular item number one to hang with the the sign in sign overlay District issue. We have General comment as well that will listen to now so we'll take public comment on General Public comment and I think we have three people to sign up. Look forward to hearing from them. So I'll just call you out and orders what you signed up. And first we have scotch in and then followed by James lob and then Kristen Scott James and Kristen. Thank you. Good morning. Good morning. My name is Scott Shinn, and I'm the director of parents for skateparks. I've been involved in the movement to build public skate parks in Seattle since the 2004 Ballard bull campaign with regard to the current campaign for the Seattle Center skatepark. I'm a member of the Seattle Center skatepark Coalition. I looked through my old emails and found in my colleagues and I first met with Remember bagshop regarding the passport word for the skate park on November 1st 2017 since that time we have worked with Central staff and Seattle Center staff to identify a replacement site for the skatepark. We have hired a qualified team to design the new skatepark and the public space surrounding it and we've resolved many technical issues. I want to thank the city for its continued support of a skate park at Seattle Center as you may already know. This is the fifth time the skate park will be built and I am personally thankful that there was 2.2 million dollars available from Oakview group and the Seattle Center budget to relocate and rebuild the skatepark this time. Please continue your important work with Seattle Center to relocate the skate park at the Broad Street right-of-way location and vote Yes on the transfer of jurisdiction legislation that will add the skatepark to the Seattle Center campus. This action will allow the city to turn into collected Farmer Street into an active exciting space that skateboarders and Spectators of all ages will enjoy additionally please Or council member Bagshaw statement of legislative intent to build a roof over the skatepark in a future construction phase these actions will help ensure the future of the skateboarding community in Seattle as skateboarding itself becomes an Olympic event in 2020. Thanks for listening. Thank you. James will be followed by Kristen. James love executive director Pottery Northwest. Thanks for the opportunity for a new comment today this morning. They don't you group. Where are thriving in the middle of this some gray construction projects, and our classes are full and we have record attendance for a lot of our events. So we're really grateful that we have that opportunity. Just want a report from the Coordination Committee about the signage. It's rare that we go to these meetings, and there's no dissent her opposition. Everybody was unanimous pay in agreement that the sign of plan is tasteful and well-considered. It's going to be great. So, thanks very much. Thank you. the last General common speakers Kristen ebeling Hey, y'all have a gun just get it over here in the rain was pretty fun. I made it here safely, which is an accomplishment since I was twelve Wesley the year 2020 these active director of skate like a girl our organization serves over 7,000 people each year, including skate classes and community-building for underserved focus in Eastgate Community, including women trans and gender-nonconforming folks as well as low-income use a partner in the schools partnering with Community organizations like East African Community Services Saint Mary's place in others to make sure that all kids in the great city of Seattle had the opportunity to try skateboarding. I'm also a member of the Seattle Center skatepark Coalition, and I just wanted to express my gratitude for the support so far for the skatepark continuing to be at the Seattle Center campus. I'm really excited about the direction at the park is going in as it's enters the underserved skate communities that I meant. Prior it's going to be a really wide open space. There's going to be lights for all hours of access potentially and the potential for a roof that will provide Equity as I see it to skate Community currently, it's July and it's raining can't skate in the rain, unfortunately, so that presents a problem to young people in the city that want a skateboard all year. There's currently one indoor skatepark in the North End of the city, so providing a potential for coverage and all ARS access for young people can create a space for all kids regardless of income to come to the center to meet at the center of Seattle and coming skateboard and build community together. So, I'm really excited. I'm really passionate about making that happen for the young people in the city. So, thank you again for your support. Without a can conclude our general comment section session. I last at the clerk read Legend item number one in to record zoning amending Seattle Metro Municipal Code sections, 23.5 5.00 200-300 V 23.84 8.036 and adding new Seattle Municipal Code sections to 3.55 .05 2054056. Oh 57058 and 23.5 5.060 to establish assign overlay District in sign regulations for the Seattle Center including regulations for sub-area is containing the Seattle Center Arena and the Bessie Garage block. Thank you very much Madam clerk before we have introductions at the table. There is a public hearing requirement that we will comply with. So at this time we'll open public hearing on to take comment on a gin item. Number one. That was just reading his record. That's counseling one 19543. So those who wish to speak or provide for the comment they signed up here and you're still here didn't sign up you will have the opportunity to have three people that sign up on this particular vaginitis, Abby Allen solid Paula Ruiz and then toddler Wiki My name is on one solid. I live at 724 15th Avenue in Seattle. I've been living in Seattle for 30 years. I'm the former Vice chair of the Seattle design commission member of the Seattle of Austin arts and culture public art advisory committee member of the sea Seattle University and also the former director when it was called the Seattle Arts commission. I'm here today to oppose this ordinance as a public space. The Seattle Center is the city's Collective living room and should be a sanctuary for the enjoyment of Civic life. And as such visual blight that is proposed through this ordinance flies in the face of all of that. Over 15,000 square feet of lighted pulsated Illuminating and digital signage moving signage will overwhelm the center and create a pulsing in French on the Public's enjoyment public space. Why would you want to do that? Each of these signs will carry Advertising Signs me that are public space will be commandeered for private game not done in our public spaces. We have no advertising and public parks. The ornament sets a precedent for other users, especially the football stadium and the baseball stadium where such uses are not allowed and it will be difficult for you to now all the sudden say they shouldn't have such a thing causing the flu duration of more signs using a poison ivy a completely inappropriate instrument at a time when we're seriously considering the impact of screen time on children and the robbing of the Authentics. A life lived through living and interaction with other people. It's the wrong direction for Seattle to be going. the fact that the council approved a lease that included this language on the cam that an ordinance would be changed if not illegal is highly unethical and it just depends right now and city council is at an all-time low and doing this doesn't help our vote against the ordinance. Thank you. Hi, my name is Paula Reis. I'm not sure if you're aware, but the sign code has not been comprehensively reviews since 1974. I live with the sign code everyday with my clients include any people like Nordstrom's excetera. And I know this because I in the mid-90s Jan Drago asked a bunch of us to please help this I know get improved and nothing has happened since my business is downtown for 40 years. We work in creating great public spaces from Barcelona to Sunset Boulevard. I'm not approved to digital signage. I began my career and professional sports promotion and also Stadium design locally. Our work has included the Seattle Center University Village Port of Seattle the city of Seattle and Sound Transit line system from Everett to Tacoma. I served at the past present on the international group that helps cities Define their sign codes of what should be happening and how they see themselves. I'm going to ask you to please vote against this ordinance. The reason is because as a professional and and reaching out to the community, nobody knew about this, I'm curious of Father Lyle across the street at Sacred Heart knows that the women's shelter and the preschool and his church will be facing a 2400 square foot LED sign. I believe that the owners of the sports teams would want to be sensitive to their Community. The signs proposed are too much. They're too big or Too Tall or too active and they're too bright and when I say too bright, but the directors report said that this was 500 nips. It's not 500 minutes in the code. The code says 500 units is that 500 units of bananas or what the code is terrible the lights but will be a shock and unexpected, please I'm asking you to do this with professional terminology. It's about luminance not Aluma. And we need to use the right terms for what the industry refers to for these signs and not make it a puzzle. Thank you. Elastic wrap sign up is toddler Wiki. Good morning. I stand before you reporting great progress on an arena. It's now really presenting itself. And what we believe we have is going to be one of the most beautiful arena in the entire world. Not just on the interior of the building but the exterior and I am so proud of the impact that this is going to have it all up Seattle Center. This is a provision. It's been negotiated and negotiated for since the origin of this discussion in 2017. And thoughtful in a consistent way in which we've done other Outreach we stood before you last September as one of the most significant projects in the recent history of the city without one challenged the IRS. We've traveled that same path here on signage building consensus in the neighborhood talking to world renowned experts and this signage plan is not only tasteful. It's going to walk Sands Gaston others to the building and additionally consistent with everything else. We're doing we're going to turn some of the signage Ed Markey moments over to the not for profits in our community. And what we're building on Seattle Center is true Community. I applaud this committee for Having the courage that you did because in retrospect you not only caused the Redevelopment of this building at a substantially higher process costing what we might have thought. The train is coming and the team is going to be hugely successful. We have a project to Northgate all of this time together and really started here with the courage of this committee to say we're going to fix this we're going to fix it once and for all the sides plan shows restraint and in fact self-restraint because in fact it's less signs and what was initially agreed to we have eliminated half of the pole banners because it was not consistent with our view of having what we think can be the most beautiful arena in the entire world. So thank you for your consideration this morning. Thank you. So there's no further speakers on the sign up sheet for the this public hearing and we will close the public hearing. I don't see anyone rushing to the microphone. So I'm at this point again where prisoners are already at the table. So why don't we start with introductions first, and then I'll loop back after just introductions to center staff. Ali Pantry Council Central staff of construction and inspections Robert Delong, Seattle Center Marshall Foster Waterfront and Civic projects Gordon Clowers Department of construction and inspections make it very clear to my colleagues and the viewing public that we have three items for consideration a day in our plan at this point is to vote in all three items today and Ali would you like to sure to take it off and then I'll just her to let the prisoners present in any way that like I'm thinking this morning. I think I will let the executive staff Force Inc. The proposed legislation and they have some renderings. I help illustrate with the proposed changes are I would just know as I'm referencing in public comments at this plan is implementing. Why does proposed ordinance is implementing the initial sign plan that was negotiated in the lease agreement and that some modifications have been made of highlighted in the director's reports and executive staff can point some of that as they they go along and I would just remind the committee that if you do just decide to take action today, you will need to suspend the rule to vote on the way. Station the same day at the public hearing. I was prepared for that rule. Thanks for clarifying that again. And I didn't want to say is comments should have been folded. I think all of us did receive in addition to the public comments the letter from the shadowed design commission and I think almost all of our colleagues or read it thoroughly. We also have responsible from the director and another response. I believe I can't remember the author of it. So I work we've been apprised of the all of the issues but we look forward to hearing the the discussion show to evolve organically on this issue. So, please proceed great. Thank you very much president Harrell council members. Good morning Marshall Foster again with the office of Waterfront instead of projects. We have enjoyed the opportunity to work with Robert and his team and the Oak View group and the community on the development of the arena plan from early on and one of the things that we're happy to be able to bring forward today is the signage code. Which allow us to fulfill what was really called for in the package of transaction documents last fall, you'll recall the whole process we've had here started with an RQ process by the city to select partner development proposals. Once a team was selected Oak View group. We've been developed a whole process with the community to advance the project as a hole from the early stages as was mentioned the plan anticipated signage and sponsorship recognition as an element on this site and I think it's important to be very clear on that point that has been understood anticipated from the city as well as its Partners from day one of this project. It is also a historical context for the arena the Seattle Center Arena has long been up a home of sports. It has had signage and sponsorships associated with Events for quite a long time and it's something that I think the public is quite familiar with and associate with the arena site. This proposal was analyzed in our secret documents looked at it a little bit of additional signage beyond what is being proposed. Now that was subject to all the steps we go through under seba and then ultimately assigned plan was adopted as part of the lease agreement and other agreements last fall what we're bringing to you now represents several months of intensive work with Oak View group Communications with all of the affected communities around the arena Uptown Belltown South Lake Union Queen Anne about the substance of the sign proposal and I'm very happy to be able to say this is a reduction from what was approved last fall. Terms of the context there's really nothing that replaces the ability to actually see the pictures and see what it's going to feel like. So what I'd like to do next is just take you through a set of images of what it will feel like I'm going to start on the west side of the Arena of the image on the screen is looking across 1st Avenue at Harrison Street. I think this is of you that every Seattle like nose of the Arena facility what you see are a series of different elements that are part of the larger public space that the Oak View group is providing you see and I'll just kind of go from right to left and call out some of the different elements. This is a mechanical structure associated with the building and provides mechanical ventilation. It also provides egress for the the public around events. On the 1st Avenue Frontage, you see a changing image sign which is a portion in black as well as a video element, which is a portion where you see a colored image there. So there's a portion thereof both changing sign and video when I say changing sign what I mean by that is you basically have a still image. It is on an LED screen. So it is illuminated and images basically static and then it can change on a certain interval of time but it's not a moving. It's not a digital video image is not moving, but the portion here on the left would move. So as was mentioned in some of the public comment from the early days, we envisioned a whole set of pole banners along every facade of the Arena. These are very typical of Arena facilities. The original signed plan has approved allowed for 30 pole banners pull signs around the building in our work with you. If you group since then, I think we all realize that that felt cluttered till like a lot of physical elements in between the public and the facade of the building and so we came up with a strategy to significantly reduce that from 30 to 12 total pole banners what you will see on these images. You can see four of them along the west facade here. They have a digital board on them which has a changing in and so what you would see on this changing image sign again, it's a static screen is you would see sponsorship recognition. So for example tonight's hockey game brought to you by, Alaska. Airlines it would allow the sponsor to show its logo. It would not allow any inducement or encouragement to buy a product or a service so it would not be advertising in the sense of an off-premises advertisement. I will also note and I'm going to show you an image in a moment including some of the sponsorship images. We have sponsorships all over the Seattle Center today Robert. I'll speak to that a little bit more. It is part of how we manage and help to support that public environment today. This is not something significantly new for the public. This is an image. Also along 1st Avenue a little little bit South you can see that mechanical egress building. You can see in the foreground the changing image element as well as the video element as was mentioned in the public comment in addition to recognizing sponsors of events. And at the facility the Oakview group will also be providing time for recognizing all the Resident organizations on the campus. And this is something that you see with the reader boards that already exists on the campus, which are operated by Seattle Center is you'll have a message up saying you're Pacific Northwest ballet, you know, come enjoy all the other great organizations on the campus in addition to the activities of the Arena. So that's an additional public benefit element of this. Now this version is showing you what it will feel like when you see a sponsorship message on that board. Alaska is just an example there not an actual sponsor. That's it. We're just using them as an example of what that would look and feel like They are insisting sponsor on the campus Marshall just I just start losing my bearings and some of these Renditions on the Alaska example. What's across the street? What is that apartments across the street? This is just this is taken just a little bit north of Thomas Street. Got you. Thank you. And this is a rendering actually at the Thomas Street and 1st Avenue intersection. So this is one of the most prominent new entries to the arena. If you remember in the past it was basically up a large building on this corner that was used for storage. So you can see now the public Plaza that replaces it and all those other features. You'll also notice in these renderings the orange elements. Those are basically static signs that never change you can see in the foreground Seattle Center Arena that is kind of a place signage. You also notice the roof sign that already exists on the arena will continue their work and will continue to be a route sign on the facility. The fact that these are residences across the street on Thomas Street, how do you deal with the issue of someone trying to sleep at 2 a.m. And you have this illumination occurring other restrictions are members or is it 11 a.m. Or 11 p.m. 10 p.m. Is that the latest or 1 hour after an event? Thank you. Okay, I want to keep moving around the building. This is on the south on Warren Street. The First Avenue garage is on your left and we're looking at the South face of the new Arena. Keep in mind this this Frontage of the Arena as we've known it is basically a loading dock and a chain link fence. So this becomes the new major public entry to the building at what you see here are again, you can see those those pole sign elements again if significant reduction in the total number, there are several ground-level digital reader board elements that provide wayfinding as well as they will also have messages about Resident words messages about sponsors as well. You also have a signage for the parking access. This is the major egress in and out of the parking structure underneath the arena. One other thing I should just know as we go through is assuming these amendments move forward. Everything here is going through review by the landmarks board, which hasn't taken place yet. That's one of the next step in the process and will include, you know more kind of review of the details materials all those kind of elements as it relates to the historic resource. All right. I'm going to keep moving along. This is moving East Along Thomas. This is right at Thomas and 2nd Avenue. So this is we were just talking about the skatepark. This is the skatepark to be right on this site. You can get a feel for some of those sign elements. These are the pool signs you see there and there is one Element here that we'll talk about in just a moment which faces into place is East into Seattle Center. All right. I'll keep moving along and then you see here the East facade this is looking from the fountain lawn into the arena. This particular image, you know that the earlier version has was approved at council with the 30 pole signs. This is a significant reduction in the number of pole signs that you would see along there seemed a bit of a flavor for for what those would look like and I mentioned in the earlier slide. There are some elements that are at ground level as well. There are other elements as well. They're not building entry signs a parking entry signs. There are LED elements. I'll go back one slide just to call this out. There are LED elements on the interior of the building which are not in the public elements of the building which for example to see that light purple color in the background. That is a horizontal LED element in the atrium lobby of the building and then there is a static sign shown in yellow over the doors into the building. That gives you a flavor for the whole package as we said we feel really good about what we're bringing to you council members. This was a lot of careful thought a lot of negotiating back and forth between us and Oakview team to make this peaceful to make it reflect the context of Seattle Center, but also to recognize that this is an active vibrant Dynamic site that has had sponsorships. It has had major events major sports for many many decades. So we're carrying that through and I think I'll stop there and ask Robert if he has any anything you'd like to add. Thank you. Marshall. Marshall laid out this really well, so I won't go on too much longer, but there was a couple things I would like to mention when we talked about digital signage Etc. There are three reader boards. There were three reader boards at Seattle Center on a one was on 1st Avenue that represented Key Arena and provided signage to the Key Arena events, excetera. There are currently two reader boards that remain at Seattle Center one at 5th and Mercer and one at Denny and Broad and those reader boards provide sponsors information event information resident organizations information information. So this this legislation is actually doing and memorializing things that we've been doing at other sites at Seattle Center for a long long time. And then the last thing that I say we we We have used a sinus at Seattle Center as a revenue stream for Seattle Center a program that as part of the transaction documents. You know that estimated that about a million dollars a year if we had major sign are major sponsor such as Alaska and T-Mobile being the two primary ones and you would find those on pole banners across the camp advertising that or on the the flight hours or or on the elevator Towers at Fisher Pavilion, excetera and in and to be brutally Frank in an honest with you is is that we only had the means to do pole banners, which are basically static signs Etc. If we had the means Etc to do what this proposal is suggesting we would have far fewer bad signs, and we would be using these types of science at on our campus as well. Marshall last, no make is just too also bear in mind what this legislation does is create a specific overlay specifically for the leasehold of Oak View group. So the arena facility and the properties just south there of Thomas, you know, it was mentioned you a broader implications for the city. This is not this is not create a new category for this overall in the city, but specifically for this publicly owned site. Forget is that on this agenda items that conclude your presentation guys. Thanks for both Helen and Paula. I can use your first names on your comment in the comment from the design commission, and I appreciate the response back. I think that never heard of doing the job in the sense that they design commissions Java to make sure that we are not turning our city or ear is our city into a I was going to say the Blade Runner City. I'll just say Las Vegas and then we also understand that the concept of bringing vibrancy and appeal and excitement to this campus is part of the package and the sponsorships are in my opinion least remain a vital part of making the pencil out and making sure that the taxpayers are not paying for this huge Capital project. So so I think in my opinion leash and I'm only one motive of several that we've reached the right balance in terms of the lowering the number of signs in the square footage of the signs and making sure it's regulated. I think there's like a 10-second in one of the descriptions the designs change. So it's not you don't just not stopped short of uncontrolled activity. So I think we reach the right balance, but that's just my opinion shows you like to chime in. Thank you so much. Table for your presentations today and I also want to acknowledge and thank the design commission for their recommendations and then giving you the opportunity to respond and I know Robert you and I worked for 10 years on things on Seattle Center many of you in the audience know that I have been a real stickler about the sign code over the years and I particularly dislike anything that was flashing things that were disruptive the Great Wheel On the Waterfront is an example where we reached a I think a really good compromise. It goes off at 10. They stop flashing its colorful but it's not annoying to those who live around it. I really want to say thank you both the Seattle Storm. Thank you Ginny Gilder for for being here and toddler Wiki for all the work you've done with the community. Your Outreach has been unparalleled. I this is my district 7 I meet regularly with Uptown with South Lake Union members were Belltown and I just very much appreciate what you've done and asking them to come to the table and doing that in a consistent basis. It's made a big difference. So I know to do. The sponsorship Revenue stream is critical to making this work the public money. It's not in their taxpayers are not paying for this. There's there's got to be a revenue somewhere Revenue stream to make this work. So I acknowledge that. I appreciate the balance that care that you have taken and I'm certainly going to support this at the same time. I want to acknowledge what has been done again reaching out to the neighborhood about the art and culture overlay for Uptown the transportation initiatives that you all have really invested in whether it's Noto map are no downtown Mobility action plan or most recently at this past Friday, which I'll talk more about later Julia Levitt was there thank you for representing Seattle Center what we need to accomplish, but this An opportunity for us to move forward with something that's going to be spectacular and like you have said I do believe this is going to be the most most beautiful updated Arena that our country has ever seen and having done it with private money. It makes a big difference to me. So I also appreciate that. You said that it's not it's not going to include advertising. We're not going to say, you know, see you know by Marlboros we're going to see that sponsors and appreciate the names of the companies that are sponsoring whatever it whether it's the hockey team and it's going to be the Seattle. But this but this ordinance is is right. It's it's the right time to go and especially as soon as you told me that we are not going to be flashing signs. OK any other comments on this sign legislation we get to go. If not, let me describe one thing. I did want to ask if the customer awards has been sort of a chief negotiator in this project for years. Was there any truth to the rumor that I once a month hurt mugshots going to be flashing on this little be subtle? Okay, here we go. This bill is listed on the agenda with a public hearing a possible boat for the same meeting and the counts real estate that a vote shall not occur on the same day. A public hearing is held and left the rule is suspended. So therefore I moved to suspend accounts rule relating to voting on legislation on the same day. A public hearing is held to allow the committee vote on Kempsville one 19543. I don't suppose both know the motion carries. We can now proceed with the committee recommendation to the city council. So I'll move to move the committee subcommittees recommended passage of council one 19543 any further comments. Those in favor of the recommendation of the council that the council pass counselor 11954 3 please vote. I know. The motion carries accountable one 19543 will be forwarded to the July 22nd city council meeting I think very much so we'll move to the second agenda item. Agenda item to cancel Bill one 19549 an ordinance relating to the Seattle Center Department authorizing the Seattle Center Director to execute an amendment to the facility use agreement with Force 10 poops LLC authorized by Ordinance one to 53234 use and occupancy of Key Arena for playing a professional women's basketball games. Okay that is going to read and record any presented for Forest Enterprises Jenny and others or anyone else coming up. Please come to the table here and we will let inch describe the legislation little bit. Okay, why don't we just do simple introductions and then I'll turn it back over to Brian's tricky up the Madison just introductions, please Jenny guilders, one of the owners of the Seattle Storm. Bendable City budget director. Very good Brian. What do we have this afternoon this morning? Thank you in May 2017. The council passed Ordinance one to 5323 authorizing that's still the user agreement with the Seattle for the Seattle Storm's use of Key Arena through December of 2028 before you today Council Bill 119-5495 proposes an amendment to that agreement in short the amendment would replace the portion of the agreement that relates to the first season and the per playoff game relocation payments. The city is responsible for paying to the storm during the Redevelopment of Key Arena. I got to be real to the briefing this week provided you a summary of this thing about a month ago as described. We had an existing agreement on the way proposing some modifications in the modifications are all results of really in the end of the storm have done to identify the location here in Seattle and in particular at the University of Washington to play a portion of their home games this year and and and hopefully next as well when we originally negotiated the the agreement and the compensation from the city. We anticipated that the biggest things one increased costs of the storm would face from having to lease a new facility rent a new facility for their games and then also to make up for the fact that we expected that they would achieve lower attendance tickets. We thought they'd end up out of the city limits and potentially some distance away and describe they have for some games. Go to the terms. We anticipated that costs rather than lost revenues could be there. They're their biggest Financial impact. No, I said sorry I said this right the first time and I'm getting myself confused by that lost revenues would be a bigger would be a bigger issue because he's going to be forced to play out of the city on what we just cover dough with the opportunity had its u-dub. Is it expected that relatively higher increase cost but be able to mitigate their attendance losses begin playing games here in the city. So we had had suffered arrangements for the payments of costs and revenues and put a bigger emphasis on the revenues the proposed changes pool our total exposure and and don't have separate payments for for revenues lost and 4 cost Reddit included as one overall sum up to but we haven't increased the total maximum of the Seas exposure still it's still up to the total of 2.6 million per year. So we haven't increased cities total Financial exposure we have done is given the store more flexibility in making decisions about where to play and Rec. But they made face increased cost as a bigger issue rather than lost revenues. So that's supposed to change the terms of the compensation but not their total amount. Very good and just for the viewing public we sorta went in depth on this potential unlimited a last meeting. So I didn't want to have to reinvent the wheel again. Did Trisha or Jenny? Did you have anything else to add? I know this is been a negotiated Arrangement as seems like his acceptable by all parties, but I do want to know you're not turned into chyme in the what I would say is first of all our most important partnership as Seattle Storm is our relationship with the city and we are grateful for the support and I just financially but really that the Civic commitment to the team and when we negotiated this lease two years ago, we had no idea what it was going to take to move a team for over 2 years. And what we've discovered is that we have to plan to Arenas. There's just a lot of us there was a lot that we didn't know back then and we also didn't know that we were going to win a championship last year. That was not a Plan, but we'll happy about that. So we've just really appreciate that the city is willing to work with us because the costs of moving are really unprecedented really quite astronomical and we really appreciate also with the University of Washington has done to partner with us. So thank you for your consideration any other comments or questions to your team, but also to the effort to continue to elevate the work of women in this field. I've heard a lot of people talk about how they've been very excited to take the light rail to the game and I think is really a great way to introduce maybe more people to the sport and I'm also I just wanted to flag for folks if people are very interested and taking Light Rail to the University District perhaps More that we can do as a joint effort to continue to expedite the creation of the light rail to the Key Arena area so that we are all ready to go at the same time and our new friends and fans on currents and at Newton newcomers and the folks that have been there for very long time that they'll continue to have that type of access. So I think we're going to be redoubling our efforts to try to expedite that process and just a shout out to our friends who are in the region who work on st3 and other Sound Transit options that this is a great opportunity for us to get more Riders and more participants in the sport in terms of yours in San so thanks for everything you do and for working with us on this and hoping that more people continue to get to those games on light rail. . Thanks for those remarks counselor mosquito and I'll just want to say is a sports buff what his injuries are killing our city here great job despite of that and I'm watching with enthusiasm. I think the forest 10. I think they have the smaller two three on three. It'll be up then I think that the other I know the prac practice about a week ago. And so I just love the activity in the the vibrancy that the your organization brings to the city. So thank you for that. Okay. Thank you to Jenny. I really want to say for you and all the owners. There's nothing better than having a HomeTown team. That's locally owned. That wins that keeps our team here Seattle Storm and I can't be prouder that it's women will locally-owned locally winning 3 time WNBA Champions and we anticipate 1/4 something. Don't hold your breath. All right, so I will move to pass Council Bill one 19549 all those in favor of passing Kempsville one 19549. Please say I opposed the eyes have it and were presented to the full Council. Okay, thank you. Please read the next agenda item transferring jurisdiction over the portion of Broad Street between Thomas Street and Taylor Avenue North from the Seattle department of transportation to the Seattle Center department for purposes of constructing operating and maintaining a public skate plaza. Just to be our last agenda item. You still Brian? Okay, so why do we not have you introduce yourself and start from there and just have introductions first? Seattle City attorney's office Seattle Department of Transportation Julia Leavitt, Seattle Center On this one. I will first. First of all, this is very exciting moment for us at Seattle Center jobs, you heard earlier in public comments that this will be the fifth move of the skateboard park ride that goes in a multiple directions. But the direction I like to go in is that sell Center has been and will continue to be a huge proponent of skateboarding in our city and that this ordinance will allow us to create a unique environment in a unique skateboard park that has the ability to be here for the long-term and hopefully we won't need to be moved again. I'd like to thank all the people in this skatepark skatepark committee and Coalition we've reviewed multiple sites. We came to an understanding and an agreement that this is the preferred site and that we are work. We've worked very hard with a S. And the city to look at how we can transfer jurisdiction. So Michelle Center can not just be responsible but actually own and maintain this site as part of the cell center campus and that are rules and Etc will be applicable and we can do what we do which is support skateboarding throughout our our region at Seattle Center. And so what that I'm just going to turn it over to Julia and let her walk you through a presentation about this transfer of jurisdiction. Thank you this or ordinance transfers partial jurisdiction of the portion of Broad Street between Taylor Ave North and Thomas Street without charge from s. To Seattle Center. So the Seattle Center can construct operate and maintain a public skate plaza as everyone here knows the Seattle Center skatepark was among the facilities that were demolished as part of the Seattle Center Arena renovation and Seattle Center has long been home to a skatepark. And so we've been working very closely with the community to ensure that we have a future skatepark the 2019 adopted in 2020 endorse budget includes funding to relocate and replace the Seattle Center skatepark in the portion of Broad Street proposed for the skatepark project was permanently closed to vehicular traffic as part of the Mercer Corridor project West phase and Beverly will actually walk you through some of the particulars of the site on this next slide. So I on the map. The red shape is the portion of Broad Street that is proposed to be transferred to the Seattle Center. So Broad Street was actually planted in 1926, and it was planted at an angle as you see from the map and it creates a non-standard shapes of adjacent property that can sometimes a limit the use of the property. So in 1955 the city constructed improvements that separated the grid of Broad Street from Mercer Street Dexter Avenue North and Aurora Avenue by lowering Broad Street where across those streets so all of that changed in 2014 S. Close Broad Street between 5th Avenue and 9th Avenue to support the Mercer Corridor project and the Mercer Corridor project. I really am connected the street grid between South Lake Union and the Uptown Urban centers. So it was Mercer was I'm converting converted and widen to four lane one-way Street to A7 Lane two-way street. So that work has been completed and a Broad Street has been closed since 2014 city council has seen changes in Broad Street, since then there have been three vacations proposed on Broad Street The Gates Foundation had a vacation and property Exchange in about 2012 right before some of the major changes at Mercer Street in 2017 the city council supported the vacation of what we call the teardrop side at Mercer and Broad Street and just last December in 2018 the city council supported the vacation of the Triangular portion of Broad Street at Harrison to support a small expansion at the City Light Broad Street Broad Street substation. So the broads Has been closed permanently for more traditional traffic purposes since 2014 and there are no current Transportation uses within the street. Moving on to some of the the finer terms of the ordinance Seattle Center shall be responsible for all costs of the skate plaza. Seattle Center Shelby the regulatory Authority for planning constructing and managing the skate plaza s. She'll continue to be the regulatory Authority for all activities affecting Utilities in the Broad Street right-of-way. The project because it remains right of way. It will include at least one pedestrian pathway and vehicular access for the Seattle City Light broad. Annex shall remain as long as SEL requires that access and we've been working closely with them to make sure that we're designing in a way that works for their facility and then finally vehicular access through the skate plaza will provide for Alley access and service needs of the block to the north of the skate. Plaza until access is no longer required to make sure I ask a quick quick question both for Beverly and Julia on that. I know there's been a lot of conversation around can we vacate that North South Park right in between so that the skate park could be connected. Can you talk a little bit about what the plans are I understand? There's a phase 1 Phase 2 there. So are you talking about vacating the Broad Street right-of-way for the skate park or a vacation? Yes for the skatepark and understand those conversations with Seattle City Light because they're so entity most interested because her substations right there, but what can be done in the long-term about connecting both phases for for the skatepark to extend soap to use on the if you're looking at that block on the southwest side. That's the first phase and the second phase is the Northeast part of that right trapezoid in Red. So if you could just discuss that little bit tell us what the timing is, so in terms of a vacation because the Seattle Center is not and abetting property owner. They can't actually acquire property through the vacation process. So the transfer of jurisdiction ordinance does give them a permanent authority to manage and use the street right of way. for the skate plaza purposes so that the best tool to accommodate Seattle Center's purposes is the transfer of jurisdiction ordinance where they vacation would be appropriate is if they owned on both sides of the street and then clearly their vacation process would support their needs but the transfer of jurisdiction ordinance will work here to your point about that that act the alley access is what you're asking about we are designing it with serving number of options so that we design a park that can open on day one and be safe and useful but can also provide for the access that that is currently important to the users on the Block for for service and for Access into their property that they that was closed when Broad Street was closed and so We we have designed we work with are designed to move work for the community. And we worked at the neighbors 2 come to sort of a compromise design that keeps everybody stay from day one and that allows the skatepark to then get better and better in future phases. We feel that you know, there is a good chance that the block to the north of the used may change. It may redevelop in the the new zoning that that now effect that site. So we are prepared for 4 that day may be coming and then being able to renew both sides of the skatepark together to have to have an even better park at that time. Very good any other comments from the table or from the diets for many of my memories come spiritual? I just asked you should print station. Okay. Alright Monday or so a bad day. We got to bring a little levity to this. Okay, so those in favor I am, okay. I haven't moved it yet. So let me move it first you and make a comment before. Okay. Please call me back or please make a comment. Having disorganized skatepark family step up and skate like a girl. I think they've left but they too have really open people's eyes to the importance of this not just as a sport. What is a Community Development opportunity which I believe they've done Julia. I want to underscore and say thanks again to you for coming to the Thomas Street charette that we had on Friday. I will when we're all done. I'll just I'd like to make some comment about how important that was. And once again Robert. I know you'll be hearing more about this but part of the design that came out was to spill out onto Thomas from the skatepark using the good work that Seattle City Light is done as well around art and digital art so that Thomas Street as it's coming to Seattle Center you feel like you're being welcomed into Seattle Center and then in the reverse is people are going home after an event that they feel really comfortable going down through Thomas will have the skate park there where people can observe but also having that sense of A bit late and safe all the way down Thomas Street to thank you for that. I just really want to acknowledge. This is a major part of the public benefit that we had agreed upon and thank you for making it happen. We'll have a few moments to say any closing comments after we vote on this last any other comments on this particular piece of legislation. Okay, I will move to pass count spell one 19566 Those in favor of the recommendation of the council passed Capital One 19566. Please go die to the July 22nd city council meeting so that piece of legislation. This is part of a Monumental project and thanks for being here there any closing comments you'd like to say counselor. Where is please thank you. First of all, I thank you. Mr. Nolan's for being here in doing this work with us. Thank U councilmember our council president Harold who's been her coach are and I'm just going to be very very brief. We've been working on this since spring of 2016. We've come a long way. We have played the long game. We kept marching forward. We work with Community. We got our way to lawsuits. We work with business labor small businesses. We welcome the NHL here we continue to support our Seattle Storm and of course our next Who is to bring back our Sonics in council member present that we're talking about this are we had a secret plan our Triple-S plan the storm the Sockeye is in the sonics order. And so I want to thank you guys cuz I know this has not been easy and we've all been working with this and like I said, this is been going on and sometimes it wasn't very pleasant and sometimes it was but this is all the hard work that this Council has put into building and put working with ovg in the NHL reconstructing reimagining and rebuilding to the tune of 1.6 billion dollars and I might personally am very proud of this. I'm hoping when I'm in my seventies which is decades from now that I'm like in point at this and say I was a part of something that made this city this region this County this state great because we know that we have over 12 million visitors that come to Seattle Center to see the Space Needle and this just revitalizes our great City, so Thank you. Thanks for this, discuss my words for any further, spending by college Voyager did not everyone. Have a great day and will stand adjourned. Thank you for being here.", "end_time": 3547.6}]}