{"format": "raw", "annotations": [], "confidence": 0.9364810090731172, "data": [{"start_time": 0, "text": "Good morning, and greetings. Welcome to the Civil Rights utilities Economic Development and arts committee. It is April 9th 2019 and it is now 9:38 a.m. I'm Lisa herbold. I'm the council member who chairs is committee and also represents District 1 in West Seattle and South Park conjoined by council member shamas salon on our agenda today, we will start with public comment and then our items of business are as follows. We will have our fourth discussion on a proposed piece of legislation related to public accommodations and closed captioning in places of business. We will have an initial discussion on the proposed appointment of Mariko Lockhart as director of The Office of civil rights. Let me see the briefing from the office of Economic Development about the only in Seattle neighborhood business districts program will hear from the Seattle Arts Commission on their 2019 work plan. And then finally also from the art office hold here and update on their Arts and Cultural districts program. So with that move right into public comment, thank you know, if you have four people signed in and you will be the timekeeper give 2 minutes to speak and the red flashing clock will let you know how much time you have an new law also let you know when your time is up. I will start with Cynthia Stewart followed by Eric Shearer. Thank you. Good morning. Thank you very much for the opportunity. My name is Cynthia Stewart. I'm the president of a state hearing loss Association Washington and I came here to support this bill. We think it's extremely important. The 88 was passed federally more than a quarter of a century ago and accommodations for people with hearing loss. I have not kept up with accommodations for other kinds of disabilities. And this is an example of one where I'm an additional a stamp to accommodate people with hearing loss is extremely important as your bill notes. There are more than 20% of the population has he particularly in the Oreo part of the population? And secondly, we note also that other people on people with foreign languages other situations where people cannot understand the oral part of the television caption to extremely important. So we applaud your action on this on this piece and I have reviewed the Amendments and I support all those as well. So thank you again for your for your effort. Next we have Eric Shearer. We followed by Jennie Frankel. Hello. Good morning council members. My name is Eric Shearer. I'm the co-chair for the commission on peoples with disabilities. I'd like to speak for myself and my personal experience with working with Mary Lockhart. Who is the Contemporary director for the OCR? I would like to have that. I would like to give my support for her selection to fill the permanent position as the Director of the OCR. She has done an excellent job. She's been very focused with her time. She's given to Work Commission whenever we had any need or any issues has arised she has come to our meetings whatever has been needed. So we really do admire her dedication to our commission. So, thank you. Jenny Frankel will be spoiled by Derek. I believe it's long Jackie. Hi, my name is Jenny Frankel and I work with the Seattle neighborhood group on a project called wiener Beach a beautiful safe place for youth I am here also to express my support for the confirmation of Mariko Lockhart as permanent director for the Seattle office of civil rights. I first shared a cubicle wall with Mariko back in the office for Education days and then have had the opportunity to work on several work groups. And now as a community member and Community organization of an organization that she helped found I get to see I've got to see so many layers of her leadership the way that she's unable to gracefully put out fires deal with the politics inside and outside City Hall and uplift hers team to get the very best from them. I seen her do that in all of those capacities. So I have full confidence that she's also able to do that for a Seattle office of civil rights. Thank you so much. Our last speaker that we have signed up is again, it's Derek. I believe it's love Jackie. Hey there councilmembers. My name is Derek. I'm from the Human Rights Commission. My name is Jackie turn around and we can say to express her excitement to work with Mariko and her soon-to-be new position as director about the Civil Rights Commission. If nobody else has signed up to speak. You can just take my John. Thank you introduce yourself. Start the blade arrival time share committee members. My name is John Egbert. I'm the director of the retail industry Coalition in Seattle. And first I'd like to praise the chair the committee for your work on this on this ordinance expanding access for all in the city 2 on programming. So thank you. I'd also like to thank the chair for listening to the concerns of the Russian and in drafting the amendments are there before the committee today's thank you with that. We would be able to support this work. All right. Well with that let's move right into the business before us today. Filibuster and told Lou Reed I don't want to do the records. Thank you Bill 11948 7 and ordinance relating to public accommodations requiring person zoning or managing a place of public accommodations to activate closed captioning on television receivers and adding a new chapter 14.05 to the Seattle Municipal Code Council Central staff standing in for a shipping cat Ramen. I'm joining you in a relatively late date in this process. So I thank you for your welcome here. So it's my understanding that this legislation was discussed at least once in January in concept as and then subsequently a draft and then some additional details about the bill that is before you were discussing this committee on March 12th, and then March 26th, so I will be somewhat brief in my comments Council Bill one 19487 would require the closed captioning be activated on televisions in public areas of accommodation, the legislation requires that an owner or manager of such a place and the definition that is currently in the municipal code for a place of public accommodation is left on revised in this legislation would activate closed captioning in televisions in use in a public area during regular hours. Are there are exceptions in the bill as before the comedian was introduced and those are for those circumstances where there is no television, of course, and also we're the only television in the location is not technically capable of showing that closed captioning the bill also establishes technical standards for the closed captioning itself and specifies that the responsibility for enforcement is along with the shuttle office for civil rights and will commence 180 days after the enactment of the legislation to allow time for education and Outreach and technical assistance to be provided to the owners and managers in question. There are four amendments that I'm aware of that were included in the Pasha Bank of Commons essential staff memo on this attachment May due to some late-breaking advice from the office of the City attorney. We have a revised Amendment 4 and so on are provides attachment a guitar no questions about the background material. I can go ahead and speak to the Amendments that the believe they are all a sponsored by you my appreciation for the work of the commission for people's people with disabilities in particular are Kosher for bringing this issue to me and for the fact that they have identified. This is a top priority in their work plan and actually adopted a resolution in November of 2018 to support development of disorder. Also want to thank members of the business Community who have engaged with their Solutions and their suggestions and it's helped me craft. I think what we'll hopefully be important addition to open access for folks here in Seattle. So, yeah, let's just jump right into the Amendments if you could Would you prefer that I address them one by one or walk through the four? Well, if you walking to the floor that's going to be one by one. That's true one which is on page 1 of attachment a portion of your name Section 1 to put all of the requirements for the activation of closed captioning in one part of the subsection and similarly to collect some of the exceptions together in one place. So this amendment as you said collects the exceptions into one place and can you go over those exceptions? So the first exception as of this point is provided for locations where there is no television or or no television programming being provided or is available in the place of public accommodation. And the second is for those instances where the only television receiver is in capable of displaying closed captioning. The requirements that are collected together are for the use of a black background white text text size 24 point and it's also specifies that the font Shelby Ariel Colibri helvetica Tahoma over data. So technical Amendment just rearranging the words on the page that were over there. I see no change in policy or regulation. There are no objections. I'd like to move opposed to admit one. How's everybody in the postman abstaining move onto to a because we're not going to talk about two big craft. Correct? There are two versions of the proposed amendment to the idea being that was adopted their needs to be different version. And so assuming you could we plan that out. So option to a provides a third exemption for to the requirements that are provided under this ordinance, which would exempt partially televisions that are displayed for sale in a public area. And so this would require rather than requiring that all televisions on display for sale have closed captioning activated this with limited too. There are multiple examples of the same model of Television. Then at least one of each model one example must have the closed captioning activated. So if there are three televisions of Taipei in three television to type B, you've got to have one type a television in one type of television with the closed captioning activated. Until I appreciate this evening to seems unreasonable. I want to make sure that I understand it from the language and if you walk into a Best Buy and they have 40 TVs displayed including the 22 inch Samsung 25 inch Samsung 29in Samsung 32 inch Samsung. Those are all different models and what all need to have it but if they have the 32 inch Samsung whatever model in one place and another one next to it as long as one of them has closed caption on that needs it so that if someone wants to see if they could say, oh that one if you want to see the difference between if you can do that if someone has 20 models displayed and all 20 are slightly different models all 20 of them need to be showing closed caption. That's correct. Night with no other questions and I'll move proposed amendment to a favor buddy. I I suppose no staining. And now on to I'm at 3 so I proposed amendment 3 recital section of the bills. So the portion that sort of sets the background and makes statements about why and how the legislation that is being adopted. And so this notes in the recital is that there are kinds of programming that are not required to include closed captioning under state or federal laws and that basically Identify some of the types of programs that are including locally produced and distributed non news programs without describes repeat value. I think it's temporary transitory primarily textual programming me so has already written words and other video programming for which the requirement has been waived by an entity my other than us. I'm so it. This is again is in the recitals and so but it is recognizing that there are circumstances where there will not be closed captioning displayed. Even if the closed captioning feature of a television has been activated. And the following Amendment kind of goes hand-in-hand the more the regulatory element of that is is in proposed amendment for now for proposed amendment for just specifies that the requirements themselves don't apply when the programming itself is exempt from the closed captioning requirements. The questions so just to be clear on the fourth one. It's just really gone and it's programmed just play it and there's nothing displaying it because of the show doesn't have any on it. That's clearly not a violation are provided that it's that it's allowed to not have the in the case that it is. I think it's sort of implied that that's also probably not the fault of the sure the owner but ultimately isn't a matter for different regulatory bodies and proposed amendment 4. Thank you all and everybody. I know unopposed and none of stating that I would like to move adoption. Of counsel backup Council Bill 11 94-87 I might as well. Thank you. Can't remember her bold. I think you did an amazing job shepherding the screw something that I think has the potential to be controversial cuz require a fair amount of change you've taken time to do that reach with community members has been a lot of public press about this and think of you. I've only heard positive things and the couple cases where people have had some concerns you've done a great job finding out how to address that also want to thank the leadership of the commission on people with disabilities and in particular Eric for his leadership been really amazing to for me to better understand some of the challenges that people face and how there's a path forward to make our community work better for everybody. And this is really great example of that. So, thank you Eric. Fantastic. So I too am appreciative of all the books that came together and it would be great post post boat. If I think it would be useful for both folks in the Civil Rights Community as well as folks with both of the restaurant Lions hotel association in the retail industry Coalition. I'm simply to make a public statement, I think it would help us with the Outreach that is going to be necessary following the the passage of this of this ordinance leaders. I'm 6 months of public Outreach that is contemplated by the ordinance before it goes into effect and perhaps us joining together with a public announcement would be a good way to start that job. So thanks again, everybody all those in favor vote and I I move on to full Adam to his appointment. Is there a 1 to 7 for appointment of Mariko Lockhart as director office for civil rights for a tuna term term to December 31 2021 Thank you for joining us. directions please Hi, I'm Mariko Lockhart interim director for the Seattle office for civil rights. Good morning wood chair herbold and cast members are Brian since I want it gives me great pleasure to to introduce although she's not a stranger Monaco has been serving in the capacity of the the interim director of the Seattle office of civil rights since January of 2018 and Michael brings to this position leadership in a long track record in community as you can see from her from her professional experience that prior to this she worked with the hundred thousand opportunities initiative where she was National coordinator helping to bring supports and uplift young people before that as you heard with the Testimony, she managed the Seattle Seattle youth violence prevention initiative and you know the seeds of that program continue to thrive in in in in our community from Rainier Beach and other places and Monaco over the last year has focused for leadership on stabilizing the department and making sure that they're continuing to advance the important and especially in these times that vital work that they are doing to to advance civil rights and protect communities. I cannot speak enough to Michael's up willingness to to bring hard issues to the table and have bring and facilitate dialogue in a way that's respectful and and her continued push to elevate Community Voices in our policy debates and discussions. So with that in a while. I'll hand it over to Monaco. Thank you. I have a few remarks. Absolutely. Thank you. I'm good morning committee chair her bald council members O'Brien and sawant. It's truly humbling to be here for this hearing. Well, I'm not new to the city. This is a special opportunity for me to serve the Seattle Community. Some of you I've known and worked with in my past City role at the Seattle youth violence prevention initiative where we focused on Youth and Community is most impacted by violence and disproportionality in the criminal legal system others. I know for your support of our current and recent work such as the fair chance housing ordinance Criminal Justice Reform and support of indigenous peoples day. You also know that it I've been in my current role for a year and a quarter now. Starting in January of last year with a reset for SOC are focusing on stabilization healing strengthening the office to carry out its core functions civil rights enforcement policy analysis and development and the recent social justice initiative. It continues to be a privilege to lead s o c r and r team of dedicated leaders striving for racial equity and the end to structural and institutional racism even with the need for stabilization and healing over the past year. We've continued to achieve great strides starting with the mayor's executive order 2017 13, we reviewed and assess the state of rsji and made recommendations to strengthen it and we've been making progress. We delivered foundational race equity and implicit bias training for all of the mayor's staff and every Department director. We continue to provide professional development in leading with racial Equity to the city's top leadership. That's a strategic lever to change institutional culture. We relaunched the rsti directors for him a space for Pure learning and growth for racially Equitable leadership. Along with sth are the Seattle department for human resources Iko convened the anti-harassment interdepartmental team that over the course of several months researched and developed a report with recommendations to address race and gender-based discrimination. Those recommendations resulted in specific actions currently being implemented. The Citywide Workforce values and expectations the central investigations unit and the office of the employee on Boyd and a series of trainings which will be rolling out albeit with limited resources. We support for commissions who represent a powerful voice for their constituents the Seattle women's commission the lgbtq commission commission for people with disabilities and Human Rights Commission. You've just moved on close to the closed captioning ordinance Champion by the commission for people with disabilities an example of the power of these commissions. The women's commission powerful report finding home has sparked action both here in at the state level on evictions socr is now charged with coordinating eviction reform work as a result. Over the past year, we've also increased fines and settlements for civil rights enforcement to give our work more power internally. We began the Deep work of developing a strategic plan for the office to provide us with our North Star in an environment that can so often be impacted by pressing time-sensitive demands. We established our values and our vision a city of liberated people were communities historically impacted by racism oppression and colonization hold power and Thrive and our mission to end structural racism and discrimination through accountable Community relationships and anti-racist organizing political policy development and civil rights enforcement. All of this is only possible with a remarkable efforts of a talented team. I've heard numerous times since taking the position that our staff are standouts as anti-racist organizers policy thought leaders and committed champions of civil rights. It's an honor to serve as acting director and now to be considered by this committee today for the permanent commission position. Thank you so much. I appreciate you taking the time to address us and thank you. Humira for bringing this appointment forward. We did put together some questions and we submitted them a couple weeks ago and appreciate your the time and care that you have put in answering those questions. We also worked with the commission's and soliciting questions from them to include last year the council passed an ordinance requiring that before we move forward with appointing a permanent director that we involve the commission's in that selection process. We also stated in that ordinance are interest. In in making sure that the department had completed a racial Equity toolkit process that is designed to question. Maybe answer some of the existing questions around the structure of of the organization. There have been a long-standing questions about the ability given the structure not the individuals but the structure to serve as an independent voice both as it relates to policy issues as well as enforcement issues in and also just acting as a city Watchdog on some of the things that the city does in the course of it of its business and so the council funded and asked for this racial Equity toolkit and ask for recommendations, this is referenced in The ordinance I mentioned earlier we did not in that ordinance require the results to come back to us before acting on this on this appointment. So I really appreciate the fact that the mayor and director Lockhart have worked with me in staging action on this appointment in such a way that it doesn't have what some feared would be chilling effect on the active engagement both of staff and community members and that Rhett and appreciate the conversations that I've had with you director Lockhart for what you see in as your role in that process now as well as with what comes I also want to thank councilmember O'Brien to some of the questions so we put forward or ones that you offered. So thank you for your thoughtfulness. You have folks think particular things that you wanted to touch on. Yes customer Brian Porter already but time sure flies and I've had the pleasure of working with you for a number of years. I'm at the city and I'm really thrilled about the opportunity to have a couple questions following up on some of the stuff in your questionnaire. Do you say there's a question about what are some of the challenges the department Faces by division and under the race and social justice initiative team is a holding the tension between leading anti-racist work and being part of a racist institution is one of the challenges which I really appreciate some other times. It's a challenge for a lot of us trying to do this work. Sometimes I get the sense of the city that hooks to hold power within the city weather. Like today fishel's department heads other people that have power don't actually acknowledge that this is a racist institution and have the outcomes and I imagine you see that it run into it more than I do. But I'm just curious. How do you how do you deal with that one folks that are in power can actually even acknowledge that this is a racist situation is pretty hard to make changes to making an institution less racist if you don't actually acknowledge that it is in the first place. That's a great question. Thank you. Councilman Brian. I think there's a number of ways that we addressed that of course is through training and education and bringing forward the history of our city and our country and the institutions got jump were founded on and the history of racism in colonization in this country. Another thing. I think when you talk about it through people's resistance to acknowledging a racist history and racist outcomes is that as individuals, I think none of us see ourselves as racist. And so there's a sort of an individual approach to looking at you know, that issue and I think what's important when we have those conversations is to say even if we were not part of that history, we are part of the solution and it's our responsibility going forward. Because I think part of the resistance has and people feeling like I you know as an individual did it have anything to do with why there's you know, discrimination discriminatory results in housing Economic Opportunity and many other things but anyone in public service has a responsibility to look at our role currently. So it's an ongoing conversation for sure other things that we can be doing structurally you you mentioned trainings as is an example and that's certainly something I've benefitted as a city employee for the last nearly 10 years having access to some amazing coaching and training that your team and others in the city have made available, which is one of the greatest most powerful things that I've gotten out of working at the city and it's it's fairly straightforward employees are being hired to Required of you Chinese food department heads and elected officials. In other folks with a lot of power are the things that we can be doing as a council over there are gaps. You think that some folks may not be getting those trainings because there's very few people above them demanding that and it needs to happen or maybe maybe there aren't those gaps. I don't know. I meant to mention before as well is the data data is a critical tool in bringing those issues forward. I think we've been in situations with departments where I'm they're thoroughly convinced that they are not part of institutional racism is not producing racist outcomes and when we can collect that data, it's abundantly clear that you know, that that particular department is also contributing a man has a role. So I think I don't know specifically about spotty but certainly ensuring that policies and legislation have a racial Equity lens that the we undergo a racial Equity tool can analysis we go to those most who are likely to be most impacted by our actions on to get their input before we move forward that very often means moving slower than than electives typically like to move there's other things that you know put pressure on the need for a rapid action butt In order to really take into account those we're going to be most impacted. We strongly recommend slowing that process down and using a racial Equity toolkit analysis. One more question in and I think that the Segways well your response to that data is really powerful for me to is says I need policies and understand how we've had a sister racially disproportional outcomes and some are policies and trying to figure out okay, how do we shift policy to get better outcomes that exposes another challenge in a highly politicized environment and before your leadership at the office in the previous administration Civil Rights was charged with initially charged with doing some kind of auditing work around sweeps of homeless encampments. Anna presented from my perspective release a real challenge because the I think there was a lot of data being gathered in a lot of observations being made and reports being drafted that often didn't get to cancel or didn't get to the public because there's a tension there between the reality of what you were saying on the ground and the desire to him to tell the public we're doing really good work and it's not having these bad outcomes and it gets a little bit to the racial Equity toolkit in the structure of the office how to deal with that pressure when you don't elected official like myself as balancing the desire to demonstrate good work and may want to be accountable for the moment doesn't feel like being held accountable to some some racially poor outcomes feels particularly good not sure that ever feels really good that it's important. And again, this was work that was done before you take you there. But I imagine that type of data Gathering and sharing Candy controversial and to be hard for folks to take and maybe sometimes people just believe it. I'm curious how you see it. You know, you've been there for over a year. Now, how do feel the office has enough Authority and power to to do that work? Cuz they're obviously a lot bigger Department to the city. I'm just at the clarification were you talking about the work in general or bring back that specific exam if you want to speak specifically for now, I mean, it's a great question again. It's on such a case-by-case basis because so often I think a challenge that we all haven't done particularly decision-makers not having access to the data and because we don't collect it and we don't collect it in the disaggregated form or in a way that is going to give us an accurate picture. So Yes, I think we're in a position to to do that work. But each student will be situation would be different and do we have access to the date? Is it good data? I think what I would say based on that example that you gave it's important that any reporting be transparent that reports be made accessible to the public ice. I certainly would not expect that any of our reports would ever be shelved if we know if we were to produce them. So I think that's important setting up the process from the beginning that the process will be transparent. Whatever data is available will be made accessible to us and that any final report would be available to the public. So I think those things are in place. It's just we can be limited by one what date is available and who and the amount of resources and effort that sometimes it takes when we ask a department to produce data that means you know a number of people are going to be setting aside time and effort to do that and away from their jobs before that requirement was put on the table. So they're complications to it. But absolutely I think the process and the foundation is there for us to do that work with transparency. Tell her so I know you have some questions. I just want a quick follow-up to account number O'Brien's question when he was referencing reports and your response was really focused on the need for transparency about the process and access to data. I just want to make sure that you also believe that that reports of this nature are not only database but that you have the authority to make recommendations as it relates to the activities of other departments. Yes. Thanks for that clarification. I think that has generally been the reason that our office has asked to conduct courses to get our analysis and our recommendations and that we see that is a critical role that we play in the city. Thanks. Thank you, Miss Lockhart for obviously your seriousness and the work that you're already doing but also for the emphasis you're placing on transparency and for using a scientific approach Berg, you know, what you give a good example verb a department my thing that are not problems but it's important to actually conduct surveys and gleaned through a scientific methodology. What's actually happening and the baby have the commitment for that in order to ask a question. I wanted to share this is a letter that I had sent to the office of civil rights when you're one of your predecessors was leading the department and one day the letter all first of all documents. One of the things you mentioned which is the the the the the staff at the human the office of civil rights RTR stand out in the Or that they do that's one of the things that documented in this letter because there were just and just to give a bad ground and just leave him a question as well as the background do when does letter happened was the security officers that are employed by a science which is a company that Amazon contract with have being an adult. I'm particularly were facing not only violations of the labor rights and and at the same time that we were in touch with OCR. We were also in touch with the office of Labor Standard to talk about the enforcement of sick and safe leave which wasn't being enforced and turn on but one of those one of those specific rights that was being violated was playwright of people following different religious Persuasions and that became a civil rights issue obviously and my staff member items in Petoskey actually sat with the essay is workers who were being interviewed by the Civil rights of the OCR employee staff were taking down the complain and what atom in my office reported was that what how impressed he was at the Tyrone has the dedication with which the staff were dealing with this complaint. So that's one thing. I wanted to mention instead of just bring this letter from it a few years ago two years ago, but also the other thing that this letter brings up it and this is Disney to my question to you is clearly when in in the in the course of the office of civil rights work in enforcing civil rights in various workplaces in the city, we will need we will need to keep revamping the laws and make sure that we keep based on what we learn from what workers are facing in terms of civil rights violations what Innovations we need to make in terms of how the city deals with it. This letter talks about some of the things that I thought you was at that time. I'm one. I would like to have a discussion with you about those things and it just review what all what all what all those things are still dilated and what we should pursue and then secondly just also asked your viewpoint on how you see how you see those the office leading this work under your directorship on the question of this big question of how do we stand up for the civil rights of all of Seattle's workers and that's not an easy thing. It can only be complaint based. So one of the things that the letter mentions is the you have company right all this I know this comedy in this comedy we've had many conversations about maybe the need to have the OCR be independent because they deal with so much of what what what means you must have a lot of courage to confront solve. This isn't just wanted to hear your thoughts in general. I'm not expecting And every detail at this moment, I just want to share with you also my interest in pursuing the these things with you. Thank you. And I know that we would welcome the opportunity to continue to explore that with you and your office. One thing I would like to say about our civil rights enforcement unit is that we've been doing a lot of Deep dive discussions and strategic planning. I've been thinking about what are the limitations that we have because civil rights laws are aimed at addressing and creating equality and our office and drives toward equity and there's a discrepancy there and attention and one of the things that we are exploring with our civil rights unit is the fact that we are complaint based when we receive a complainant to our office. We have one tool and that's the investigation and it's either. Yes, it meets the threshold for in. Navigation or no, it doesn't and that's frustrating not only for our office. But of course the complainant and so as we look to what are people looking for when they come to our office, they're looking for Solutions and they're looking for restoration. And so were as I said in the middle of some strategic planning discussions and exploration to what other tools might we employ on to address people's complaints because mediation restorative practices healing circles. There are other tools available in the community that we have not Incorporated in our office and and I know that there is strong interest in it. So those are some of the things that were exploring in terms of Surf City Wide or company-wide audits. I think we have not looked into those. I mean when we talk about Anthony's in particular that may be more of a function of the office of labor standards kind of depending on what the issue is, but you know, we're also trying to work within the capacity that we have and so we don't currently have that kind of capacity it say one more thing in terms of elevating and driving civil rights enforcement in this city is the need for more Outreach and education. I think one thing that we find over and over again is that people just simply are not aware of what their rights are I'm in so I'll bet you're really one year a complaint based organization. We're waiting for people who already know their rights and know that were a resource to them to come and show up at our door and that's not a proactive approach and damn we do as much as outraged as we can with limited, you know to end sporadic resources and just again on to juxtapose the the resources that the office of civil rights has for that proactive Outreach and education. It's very different than for instance the office of labor standards, which Receives an annual disbursement of resources to educate both workers as well as as well as employers and that has allowed them really to amplify their work and I think it's done. It's great models if you want folks to know what their rights are. So I think we should consider as a city definitely a resources issue but in the course of your work, it'll be really good. If you also just like you've done today so, you know, give us recommendations on an ongoing basis how the work of the office of civil rights can be expanded and then to address the needs of the community and then commensurate with that what resources will the city need to assign or should the zodiac sign for the office civil rights just as the The office of labor standards has been given resources to do some really important work and I agree with your education is very important. Thank you. So I do want to get back to not just the work of the office day today, but the potential for transformation towards greater Independence. Can you talk a little bit about how you how you supported the process how you plan to support the office after recommendations are made and Just in general. I don't know that the recommendations are going to involve it big change. But if they if they are to just how is your how do you respond only to the big change? Those are all great questions that I received first. I want to say that coming into the office for civil rights what I came to learn about the racial Equity toolkit process. Is that for me? The most important piece is the community engagement and I have as as you know from my history a long history of working with community and and Community engagement processes. And for me, I have great trust in that type of a process. So once we set up the structure, there's a ret team there is a strategic advisor. Refunded by Council and I know that you have staph is what are Consultants working on it. Once that structure was in place. We really I personally step back and let the process unfolds with great trust in the kind of information that would be gathered and how old we analyzed and to just allow that process to take place. So we anticipate that the ret report will be completed by the end of next month. And so our office has been the people in it and the teams have been of course very interested and are the experts in what we do and and what their needs are and so they've been tapped as well in sessions. They attend both sessions in the community as well as there's a number of informational and feedback sessions that are held in our office on a regular basis, so they are Involved in providing information and input into that process as far as change. I believe that I came into the office in a period of change and that it's been my role in my responsibility to Shepherd our office to a transition from the day. I got there. We know from a. Before under the last Administration to whatever you know, in the future. I think the most important thing or one of the most important things for me coming into the office was to create a sense of stability and that staff knew. There wouldn't be a lot of fluctuating demands and priorities than enough. The reason we're focusing on developing a strategic plan that as much as the city is so often buffeted by emerging issues and emergencies and a new demands and pressures that for us to have our values established our vision our mission and to align our work to it that will create a plan and a roadmap so that as were asked to participate in processes as we are really on a weekly, if not daily basis from different departments or organizations that we can measure that and compare it to you. Like where is it that we're trying to go? And does that align with our strategic plan us because that's something there's at some point we have to say that we can't get involved in everything. And so that's been important for us and whatever changes you are yet to come I would continue to provide that kind of a space instability for our employees to discuss and explore as we do really everything. We do a lot of processing of our work and our goals and our frustrations on a regular basis. And so I think of course with change there's going to be some Some anxiety around it, but I think we'll work through that and that change may involve changes for us as Personnel including myself, but that's something that will take one step at a time when the things that impressed me when we had this conversation earlier is that you see your role as shepherding the organization to the best version of itself The Inn at that means changes structural changes in order to both increase the quality of the service at the office provides to to the city into the public that that you see yourself as having a role in making that happen. So I really appreciate that and I appreciate you sharing those thoughts here in public too because I think it's while we are still in the processing to hear that. Remember Brian you're grabbing the mic. I was grabbing my head that I just have a couple. Michael I think this is perhaps the most important than most challenging jobs at the city of the year you signed up for the last year in a corner and looking forward to going to appoint. You mean to work we do about eliminating racism in our cities is something that has to be centered and for all the things we care about it so critical and to do that job successfully, you know, you need to have the trust in relationships with people throughout the city. Not just you but your whole team, especially that are STI team and at the same time you have to be holding people accountable which doesn't feel good and to balance those two things and do it successfully and move with the urgency which was with which we need to move is a as a city and take the time to do it. Right? I mean, it's just it's just so many tensions that are almost diametrically opposed that you get to navigate at night. It's it's a huge commitment and I'm really grateful for your willingness to Shepherd that work at the moment. So thank you for So I would like to close this conversation for now, but bring it back at our next committee meeting on the 23rd where I anticipate will be voting in support of of your nomination and moving it forward to full Council on the 1st Monday of of of May. Thank you. Alright, I appreciate it. Thank you so much. The next item on the agenda is agenda item three only in Seattle neighborhood business districts program update. Drive from down here. greetings I start with instructions, please. Good morning. I'm Teresa Barrera from the office of Economic Development. Garnett with the bird park place. We are Community Action Agency. I often get asked how long the program has been around and officially since 2011 and its current form. However, the office of Economic Development has been supporting Community Development for many years and over the years we've learned about how to do that better and we've adapted the program over many over all of that time. Before you move on can just tell you that slide refers to a Main Street approach and I think that's a particular framework. Can you just talk about that a little bit actually in the next light? I'll talk more. Can I wait till then? Okay. So the vision of our program is to build an equitable and vibrant City by fostering neighborhood business districts that are centers of local Commerce community and culture and we do that by supporting local businesses property owners and residents in a community to come together develop a shared vision and then work on making it happen. Each business districts shares common issues and needs and these are the core areas that all districts that help all districts. And this is based on the Main Street model Main Street just had a conference here in Seattle last month and they've been around for decades and have established these areas as the the core or is it all business districts need and so our program organizes districts to establish a vision including many or all of these areas including supporting businesses doing marketing and events to bring customers into the neighborhoods placemaking. Clean and save and then an organization that holds it all together. And a great example is the Mount Baker Hub Alliance. They are relatively new organization operating around the business district at the Mount Baker Hub Light Rail station, and they recently sent out a newsletter and it incorporates a lot of these elements right in their newsletter where they're working on placemaking with some beautiful murals. If you haven't seen them, you should check them out. They are supporting local businesses by getting added to the plate of Nations event that is going on right now in Moreno Valley and they also do volunteer cleanups to pick up garbage regularly in the business district. So this is a great example of a comprehensive approach within a business district to address all of the many needs. Our program provides both grants and services and the grants get most of the attention but we also provide a lot of services to business districts. So we have grants to support action planning and also public space projects, but we also do business Improvement area support racial Equity training and Outreach for business districts commercial affordability workshops is new this year. And we also do pure networks where we bring business district leaders together to learn from each other and to learn new strategies. We just announced our 2019 grants and this year. We are providing 1.3 million in 17 business districts. This is the list I'll just flip through it quickly though. One example of action plans is in Rainier Beach The Merchants Association as part of their action plan. They do an event every year called light up the beach and they have a contest within the businesses to put up lights and they have photos with Santa and they're drying folks into the businesses during the holiday season. A great example of a public Space Project is in Chinatown ID. We funded a neighborhood lighting study to look at the lighting levels within the district to help improve safety and the attractive qualities at night. And now they have a great plan that they can use to fundraise. And the business Improvement area program has also part of our work. We support 10bii A's in Seattle that raised 22 million dollars to provide enhanced services within those 10 areas. And one example of this is our business Improvement area Advocate Phillips. It recently supported Soto Bia to expand and renew. Just last year. This is our fifth we had just how old are 5th annual racial equity in business districts training. And this is the cohort from this year. We provide training to local volunteers and staff within business districts to improve their ability to address implicit bias and Sir business owners of color. And with this program. We also provide Community liaison from the Department of neighborhoods to help the business districts improve their Outreach to business owners of color and improve their relationships. And then new this year. We added a commercial affordability workshops, which we piloted in Chinatown ID last year and they were they worked really well to provide training and resources to local businesses who are challenged with pressures to move and so are offering this to more neighborhoods this year. The commercial affordability workshops. What? What do what do businesses learn? Depending on what their needs are we have workshops on Commercial leases. We have them on how to build out a new space. How do you finance it? What are the costs and helping them think through for many businesses who been in place for for a long time? I have never actually had to do that or it's been awhile. So helping them learn about how what their leases are how to improve their relationship with their property owner as well as a lot of those moving challenges that they face and produce outcomes as it relates specifically to the leash training can do you have even just anecdotal stories of how a least training might have resulted in more Amore fair lease for a small business owner. We probably do have some some data on that the training so far we've had in the Chinatown idea. We had a series multiple trainings and many of the business owners learned both about their leases as well as moving costs. And so I could provide more information on that but there are many businesses that have been faced with a lot of pressures and have Have I learned so I'm sorry. I don't have an example for you isn't producing the kind of outcomes that are sufficient to address these challenges. I think we as policymakers need to understand that and look at other alternatives to assist small businesses in in these what can be really power in imbalance type of type of discussions with with the property owners. Yes, and I will have more data after this year after we provide more of these trainings in in more neighborhoods. We're all so it's not mentioned in this PowerPoint, but we are doing a commercial affordability tenant Improvement. We have a small pot of money to provide some grants to businesses who are having to build out new space. So this slide just shows our funding over time. The green line has our overall grant funding and it went up in 2014 but has been coming down and likewise. We've increased the number business districts in the program overtime. But this year it's it is a little bit of a drop you talk a little bit about how you make your decision making around who gets funding for those grants and we've had conversations with the folks representing business districts, but I think it would be useful for the public to understand a little bit more. We do an annual process request for applications and business districts come forward with their their request within all of these areas are grants and our services and we ask for business districts to organize as one request. So the the point of our program is to help districts come together and have a common vision and work together. And so that's part of the application process as well. And we do that every year in and they come in and do a presentation to a granting committee that made up of mostly City staff working in multiple departments. And and that's how we make our granting decisions this year. We're actually looking at doing a racial Equity toolkit on our granting process. So we would spend even doing it this way for a while and thought it might be good to take a look in and see if any changes are needed. And the shows are funding over time. We have more than half of our funding is Community Development block grant Federal funding and it's been fairly stable. That's the green bar at the bottom. And then we have a few sources of General funds a small amount of general and a small amount of general fund for public space Improvement program. This is also been coming down over time. I just as an example. I want to point out that the majority of our funding goes to districts that have large numbers of people of color business owners of color in the neighborhood and called that Equity districts the yellow and 2019 hits. More than 75% about $1000000 going to those neighborhoods. And then also overtime we provide sustained funding in these neighborhoods and we've increased the number of neighborhoods that we are supporting overtime some more and more of our funds are directed to these neighborhoods. And we believe that it takes the stain funding to build organizational and Community capacity. And so we are providing that sustained funding over many years and how how do you define what an equity district is It's based on the percentages of communities of color low-income residents and business owners of color slide that in my mind should be but maybe it was it's too small of a of a business districts South Park. Does it look like it's looks like it's in the all right, and then the green are established. What does that definition that have sub sustainable funding sources or have pretty strong organizations that have been operating over many years yet created. Organization the blue organizing districts and those are early in the stage of art. Organizing process developing an action plan and getting started with their action plan. So earlier in our program and so you're working with Folks At the beginning to get organized so that they potentially could apply for other other funding once they have created vision for themselves, right and often times. It's the creation of a business Improvement area, but not always that's one way of developing their own Revenue base. I was just going to say I mean, I don't know that this applies only to the yellow neighborhoods, but because at this point is to India region, but it's also the place at the the neighborhoods where you're seeing gentrification at its most dense showing some sense. This is all so, I mean, it's also one of the things that they said you need to do to help stem that because I mean to be called an equity District but already for example in the central area so many black-owned businesses are getting pushed out and one of the things obviously not know it's not something that this program can do about Indian indirectly, but just to acknowledge in this discussion in terms of commercial affordability just that rents going up and buildings being torn down where the new space is not affordable. There's no plan for red a business can go during construction even even if the new space is Affordable all of that is creating so much. Stability and flux. I mean so many businesses that are facing that kind of Crisis and they are actually businesses that are symptoms of colic baby already established in terms of qualifying for this program particularly, but in general facing the brunt of gentrification like Sabbath European Cuisine, which is one of the businesses were quite an institution in the neighborhood everybody loves somebody but it's now unless something is done immediately. It's the building is going to be demolished and the question of their future, you know, Still Remains by gentrification District the very good point and we do look at the Equitable development initiative component of the comprehensive plan as the districts that are at high risk of displacement of business owners of color. That's another element that helps us. On on the point that customers want made does the office of Economic Development have a role in those instances where a building the house is small business is being redeveloped. I know we have a really good example of at least one small business that happens to be an Arts organization that was successful in relocating in the new structure after a Redevelopment the Richard Hugo house, but I'm wondering if there is the question of where you go during the construction. Is there a role that the office of Economic Development plays in brokering those discussions with property owners who are intending to redevelop. Yes. Definitely if any business owner or property owner is facing those challenges. You can contact our office. We have both small business Advocates and are only in Co Team in contact any of us and we'll find the right person to help you. So we do provide some technical assistance Consultants who can help work with the business owner and help them look at their lease or look at their options, and we can also help broker some of those conversations, especially if there are challenges that are being faced with City departments or city permitting and that sort of thing we can definitely Provide support to business owners and property owners. Moving along. I think one of the biggest outcomes of our program is just harnessing all of the volunteer work. We do provide staff capacity and we support for many districts to some extent a small amount but really it takes a lot of volunteer effort from the business owners Property Owners residents to make their communities better and to care for their communities. So that's that's one of our biggest impacts as well as providing lots of events and leveraging other resources. So here's our team, please contact us. If you have any questions about our program or have challenges that you're facing. With displacement, especially we have our newest member Peter block Garcia's here. And then I also mention Philip said he's here are business Improvement area Advocate but there are five of us. And with that I will turn it over to Leon to talk about the Central Area collaborative and how they've used only in Seattle program. The only Central the only in Seattle Grande has been really transformative for the way. We approach our work in the Central Area back in 2015. We were one of those organizing them we weren't used to working together and ask Community groups and institutions in OED sponsored. I think it was six Community meetings that brought together about a hundred and thirty unable to stakeholders from the service and nonprofit community. Institutions and businesses and we develop the Central Area revitalization plan, which is 5 initiatives surround aligning new development with Community input establishing growing and retaining small of micro businesses increasing services for low-income populations. Developing high quality of food, ecosystem and emphasizing the importance of the Central District as an African American cultural & Arts District. Out of those meetings. We had seven or eight organizations and business owners that stepped up to form the Central Area collaborative and that has an Obe an amazing in the way that we work together. We prayed it a collective impact model that has enabled us to not necessarily compete for funding but to jointly apply for funding ensure funding that supports Economic Development. So everybody kind of gets a bite of the apple and we're supporting each other in ways that we have in a very long time. As a governess model, we've adopted equal District framework what you may have heard about on Capitol Hill and it's I want to see 18 other cities in the nation and four cities internationally and working towards certification for the eagle District. But that means that we can align at the district level neighborhood level on priorities that are identified in our Central Area revitalization plan. We can also share metrics with other neighborhoods. As we are working towards the Three core values in the protocol with your Equity climate and resilience. Are we out of the 4th piece around culture because we want to make that front center of what we do in the Central District. So that has also been really transformative in the way that work because now we have to be a method for organizing and Reporting when I work. That we haven't had before and it's you know something that is standardized and we can compare ourselves with other neighborhoods and really said good metrics for what we're doing in the impacts that that would having. And these are few of our accomplishments from 2018. We had a navigator and that that person has helped distribute mitigation funds for the construction along 23rd to the small businesses, you know and pass we had a hard time getting that money out, but we putting checks in people's hands and helping with marketing and signage and everything. That's hopefully helping them stay in business during the construction. Oh we done the only lighting study that and then I know about in the central area that it will improve the walkability and safety of neighborhood that came directly out of the 23rd Avenue Action Plan central area neighborhood design guidelines were huge for us. Put equity in power back in the neighborhood in terms of a new commercial development that's coming in and the neighbors having a say and what goes up and making sure that it reflects the culture and tone of the neighborhood and we also got the design review board from that which you know, it has been also really powerful and helping us. We didn't have one before helping us control. What's happening in the neighborhood. We have two new markets going on in a red apple has going away but Vulcan is coming in and they are working with us and making sure that whomever occupies our site will have businesses that are in the neighborhood that can sell products. There were also working with them to get a small store for micro businesses. Hopefully at rates and with New Seasons, we have identified some vendors in the neighborhood who may be able No products in those store. So right now I think it's 13 vendors that we're trying to get into those stores. The development built in such a way that has smaller spaces for that purpose and one of the other things that we accomplished last year was we were able to get some money to the historical Arts District to create markers that will go to the boundaries of the neighborhood to see when people come into the Central Area. They know where they are and I know it'll reflect the Central District artistically and it's you know, it's also an opportunity for us to work more closely with the arts and culture to culture District. So again, you know, this is funding this will be our 30 receiving funding has been really transformative for the way we work and we're really appreciative to all the Via support that we received from OED of these past couple years because they've been really supportive and making sure that we understand what we can do with money how we can spend it. And giving us guidance where you know, we were still learning at the time but this has been really great opportunity and you know because of this one we've been able to leverage probably an additional $600,000 over the last couple years to the neighborhood just because of our ability to work together and ordinary and be organized and and deliver on the central area rug provided station plan. Thank you for sharing these experiences and it's really good to hear from folks on the ground how off speaker not development uses that model that you've described of helping people organize and come together and use the power from that to go to the next level. So I really appreciate you coming down and telling us how you've done that and I think it's a great way to mentor and the work that led does for four other communities who who aren't quite where you at yet. I see yours. End of the city when we're at our best we make a commitment follow through on how we can support communities in their businesses, but we can't do it by ourselves. So, I think it's necessary that where they're showing up with with this work, but without leadership from Community like you just walked through there's no way we can ever be successful. And so, you know, I'm proud that the city will hopefully continue to commit to this work and I'm really grateful for community members coming together to make make that successful. So thanks for Thank you for taking time from your busy day to share. Thank you. I'm poor agenda item for is a Seattle Arts commission 2019 work plan. Good morning. And you're not up for confirmation and you're bringing treats. I'd really love to talk to Marco about so it's it's Matthew Richards birthday today. There's nothing you want to do on your birthday more than present after Kuwait a committee of city council's in honor of Matthew's sacrifice. We brought these cupcakes. There's plenty for everyone to baptist, coming back so you can leave one on her birthday Matthew birthday. Would you for joining us to present your work plan understand you guys held a retreat a couple weeks ago. We could maybe do a quick round of instructions and then just Jump Right In I am ready to run the director of the office of arts and culture and I am the chair of the commission this year. I've been on the commission since 2015 and my day job. I work at the Seattle Art Museum doing programming and Partnerships and racial Equity work and it's such an honor to get to chair the commission this year. Thank you. Thanks for having me as well. My name is Sharon. Irie Williams. I am the coach are for the Seattle Arts commission. I am also the executive director for the Central District forum for arts and ideas what we are in our 20th year of presenting black cultural work and I am also the chair of that historic Central Area Arts and Cultural District. Make sure you're working again and he's bald and efficiency. Thank you. I'm so just to give you a little bit of background on the commission the commission represents a range of folks better amazing leader. In the community artist Arts professionals Advocates and really our role is to be connectors and Liaisons between the Arts Community Arts organizations as well and the city to advocate for a resource and support for the Arts community and support the mission of the Arts office as well and really to advocate for Arts policy creating access for Equitable participation in the Arts and really centering racial Equity within that. So yeah, it's been it's an incredible commission filled with amazing leaders. Like I said, and probably my favorite part about the commission is just to be able to learn from each other and I have grown so much as a result of learning from amazing people like Sharon. Yes, and I'm excited about being a nice commission. This is my 6 year and it's one of those opportunities where you as an artist and arts administrator don't know how important it is to be at the table around conversations like this to have access to council members like yourself to learn from mentors like Vivian Phillips and two, I'm really help promote the office of arts and culture in the work we do and it's been a very exciting time this year as we have opened up King Street Station to a I think it's already record-breaking. Is it record-breaking when you first start and is already coming through and we are participating in conversations around the city around space Access Transportation housing and was starting to Define creative economy and what that looks like cozy working with the office of film and music and an addition. We have we sent her. I work around three committees the public art advisory. The culture Investments committee and the facilities and Equitable development committee on what you would not call by its name fed that we call it today cuz it freaks people out. And the public art advisory committee is they work on a range of projects to to express Visual Arts experiences to the residents of Seattle in the people visiting Seattle as well. And they're working on it under expanding their understanding of the public realm and engaging them is Civic dialogue. So what they're focusing on a network plan this year that we just came up with an r on Retreat The Following last couple weeks was they would like to go into performative they like to explore more of literary arts or other representations to cultural identity. This will require some funding mechanism. So the question on the table came as you already know that there is no admin tax on men's professional sports. So maybe that's a possibility to help with this public Arts initiative. And then also they wanted to revisit that the accession program and to be more fair. To the Artist as well as focus on Art experience and public art to create greater transparency for the artist to one of the things that we've learned was that if we are deciding to DSS a piece of art that the art the art cannot go back to the artist. So how do we help change that process? And is it currently can't go back to the artist because of the prohibition against against a public funds exactly like last year was the cultural investment committee and this is comprised of Arts commissioners of Arts staff and Community Advocates and really it's around looking at how funding and resources are dispersed by the office of arts and culture and examining sort of the data around that in the process by which organizations and individuals receive funding and how we can further send her racial Equity within those processes the really taking a look at examining the data and seeing how we can be even more effective and Center communities of color. I'm within those processes and create more accessibility. So. Fantastic work on that already. So it's good that you're kind taken taking the next step. I know you've made a lot of changes to your Grant programs in order to encourage more access. So I should thank you so much. That's really thinking about you know, how do we value artists and the Arts community and how can we make sure that folks are being advocated for and that we're really centering meet there. And then the last committee is the 3rd you say that again and this is a Power House committee on their incredible day and gauge on Broad policy solutions to advance cultural space in Seattle. So really looking at those important issues on with a special focus on Equitable development in line with the Earth commission's race. Equity lines so things like I'm supporting and helping to guide the public Development Authority and then the bass the building arts space equitably product projects and then you don't really continue to tension around things like cultural districts and making sure that that's being represented and supported and then policy advocacy around related areas of impact like affordability commercial affordability Transportation things like that. It's exciting because we're being a looped in and asked to be a part of conversations that go way beyond the stars, but I really I think increasingly we're being recognized as how important the Arts are in other components of what builds a healthy community so and then I shared mentioned a little bit earlier. We're having starting to have these amazing conversations around creative economy and what that looks like and how we can really be supportive and entrenching that way. Within that and Randy's going to speak a little bit more to that partnership with the nightlife Community. I'm at the very early stages of that process. But what we're working with, Mississippi and Phillips will hear from me shortly and she pulled a quote that really resonated when she presented this to the commission a few weeks ago with the retreat from Forest Whitaker residing a creative economy is an economy where imagination is the raw material and skills that made infrastructure. So, how are we Imagining the future of work for our city through a lens of creativity and what does that mean for the industries and occupations that comprise that both now and in the future really our job for the next several months is to listen to convene people in to find out what we have what we need and what the possible for grounding that process in the principles of affordability Economic Opportunity and racial equity. We're really excited to have the Arts Commission of partners because they are set of stewards of our work as the music commission is to the ofm lens and the increasingly the film cat nightlite Community as well. So I can understand structurally how it's going to work around the conversations related to the office of film and music. This is a topic and the Arts commission for a plan and you have a role in doing the convening and is it is it is the convening around so they all encompassing topic of creative economies, or is it and then they film the music is a question or is it sort of flipped the other way around is it a conversation about the future of the office of film and music and how they contribute to the creative economy? I think it's a conversation about what the future of Creative Industries looks like and then what infrastructure best supports that I don't I don't know that we've weighed in on one structural model or another. I think that the Arts commission the music commission film Works Northwest Film Forum Seth the night life communities are all partners that we have to get around the table and we've been doing that both with city employees and cities and our co-workers here at that around various departments Council CBO at as well as with the commission's and stakeholders in the community. And I think this summer is going to be sort of the balance of the broader external Outreach. We're working with the carts commission the music Commission. In other is to identify who we need to have in that that table so it's not really about the Arts office inviting in ofn tomorrow. If I'm inviting an art it's more about where do we all want to go together? It was great because at our Retreat we were able to really think through cuz we got into groups within our committees and really thinking about the work that were already doing around that and kind of thinking through it with like this lens of creative economy engagement and advocacy and really being able to call out the work that's already being done. And then how we can reflect on what that can look like in the goals for the future. I just I have expressed my concern for the future of the office of film The Music it has it has historically in the city then that that That area of the creative economy has historically been an afterthought and we only recently had an office of film and music until I just think it's really important to recognize that history but also recognize that because of because of that history. We have not adequately I think acknowledged the value of film and music in our creative economy. So I'm just I'm I don't I'm hoping that the structure doesn't continue to sort of treat. That segment of the creative economy as an add-on, but rather I think it would be really useful to Center the conversation around House filming music fits into the creative economy. I agree today were presented by the Arts commission work plan. We're not about the creative economy strategy. This is stakeholder as is the music going to answer. My hopes are I think that is all fair and what excites me about this process because I'm also a filmmaker and I do poetry and stories to music. So I'm also Stratton in that line is that when we came to the table for the first time last was last week, correct, and we were all there and it was all in agreement that We were fighting for these different things that we wanted to make a better place for Seattle as a whole and the thing that gives me hope with this is how the office of arts and culture handled the King Street Station and all the research and focus groups and things of that nature that they convened in order to give what we believe is the right output as well as going through the process for Langston Hughes Performing Arts Institute as a Arts commission missioner. I was on like four or five different task force leading up to that process and the mini focus groups that we had in the very careful in this of getting everyone at the table to express their their opinion. So when we did reveal what the plan was the community was already bought and and we stress that at this at the table as well and knowing that we have a music commission and we know that we have Arts commission and we know we don't have a film commission. One of the first questions at the table was how do we make sure that that that body is represented? Thank you. You're welcome. Animal questions questions certainly bring a lot of energy to imagine with you. If we want to know how we going to get that I really appreciate how the Commission in the department has is centering Equity around the work around arts. And I really appreciate how it's being integrated in ways throughout the city. It's it's great to see and I I really appreciate the energy you bring to this and the time commitment and passion to this work. So and I look forward to you know, see what happens when coming here. So thank you one of the other things that you guys commission typically does every year is you sent to the council your own budget recommendations letter and that is I think a unique structure for from commissions that fall under the jurisdiction of other departments and I think Recollection. Although I did not stop farts at the time when that was conceived. My recollection is that was intended to create some Independence on the part of the commission to make recommendations that you felt wreck reflect the Arts committee without it having to go sort of threw the the the filter the political filter and and limited resources filter that we all have to deal with here at the city and an earlier conversation that we had today with the office of civil rights relates to some of the things that they're doing to explore how to become a more independent Department of the city and it's occurred to me that you know, one of the things that they struggle with is is budgeting and that commission had I mean that department has four of its own commissions and knowing that you folks were going to be coming. Hear it made me wonder whether or not I wanted to ask you whether or not that's you find that opportunity to communicate directly with the Council on what your budget priorities is that you feel like this enhance your ability to represent the communities that you're on the on the commission to speak for because it might be a useful thing for us to consider doing with those commissions as well. I mean I think for me it, you know, when going through the the process of even like writing the letter and putting that together and collaborating on that really allows us to reiterate. You know, what our focus is our and really allow is to like Taylor at of like okay, here's our priorities and this is our as advocates. This is our responsibility. And so I think it's it's something that feels like it comes pretty naturally in, you know in part of what we consider to be our jobs on this commission. And so I think the budget letter is an example of that and I think we've done other things as well to really kind of forward. You know, what we're hearing is in a we are like the eyes and ears on the ground. I'm doing this work and you're being artist ourselves and things like that. And so we do feel like it's our responsibility and part of our job is to to do that. Food for thought for sure. So as as we move forward in the Year, look forward to hearing more about the activities and implementation of your work plan as it relates to the public art advisory committee the cultural investment committee and the FED may be great to have you come again, I'm not contributing to the admission fees and I've done a little bit of looking into that and I'm certainly interested in my time on the council and working with the Arts commission to see if there's a way to make that more equitable. Advocate you have thoughts on that always welcome to attend our Arts Commission meeting. They are on the second Tuesday of each month at King Street Station at 4. Turn 5 Arts and Cultural districts update is something Like an embarrassed Us by making everyone sing. Hello. Hello you both for joining us as a consultant to the office of arts and culture for mature, Rockstar from the folks over here. Just know I'm going to go to leave the Arts commission and to leave the Arts Commission in such capable hands makes me incredibly proud. So it's all volunteer work structure and Leadership to fill that structure. I just love it because there's a lot of them. And to do that and be able to move on from that work and the work continues to grow it doesn't work out well, and so is my goal. So it just feels really good to see that happening. Thank you. Thank you. Start a birthday program in Seattle and the birth of a new entity that we're calling the Chamber of culture. Would you mind forwarding this one slide just the forward button. The program was launched in 2014 and it launched in partnership with the National Endowment for the Arts which helped us fun to the creation of what we called the creative placemaking toolkit, which we'll talk about in a second but is essentially six or eight tools that districts could have access to that we would fund on their behalf of the first district that we created with the Capitol Hill Arts District followed closely by the historic Central Area Arts and Cultural districts in the Central District followed by the Uptown Arts and Cultural Coalition in uptown. And then the Columbian Hillman Arts District, which is the most recent District to be added to the program. We're currently in the process of almost always in the process of conversations with different neighborhoods were interested in the program and we would expect that at some point this year or early next week be adding the next to stretch of the program. Thank you. The tool kit has really evolved. The program is really evolved around this whole idea of a toolkit when we first launched the toolkit, we were able to support programs around pop-up space activations right-of-way District identifiers, which is the the custom street signs that you saw on the previous slide wayfinding cultural space markers, which are analogous to a barber pole. So it's a unified or a repeated Medallion. The cultural space is mount on the outsides of buildings support for busking in the neighborhood are historic markers parklets. What we found was that not all of these programs were of interest to the district and the district have their own self generated ideas of how they like to form up and what they like to support one is design guidelines. You heard about that in the OED presentation and we supported the creation of design guidelines for the neighborhood and thought process of reaching out into the neighborhood and creating that affordable. Workforce housing has been a priority in the Uptown neighborhood cultural space incentives has been a high priority in Columbia helmet and also in Capitol Hill a lot of advocacy around different ideas and the cap report has resulted from the districts program and that has resulted in support that this body for different ideas in that program Public. Safety was an issue in Capitol Hill as we saw the rise guys crime one of the issues that you were curious about in a previous presentation was around least support leasing support and that's one of the things we've gotten into you in support of different organizations in the districts and have helped write extended leeches and leverage our relationships with both property owners in arts organizations relationship in their building in order to make them eligible for Capital funding to improve the building. They had to have a certain length of side control and we were able to help negotiate that with their property owner. Backup 1 are you able to make the property owner see that? There's a benefit from those negotiations to them or are they mostly just doing it because it's the right thing to do. Often it's the ladder. We are ready to make the case for the presence of arts and culture being a generator of value of two buildings into neighborhoods. That's a case. Do we make regularly the specific cases that I'm thinking of where we jumped in? Honestly. It was more a matter of making the case in the right language making sure that both parties were able to share their priorities and their needs and it just turned out that they fit together in a way that neither the property owner nor the tenant assume that it would but once they're actually talking about the same issues. They realized that they both have shingles. This is a quote that came from a meeting up in uptown did former council member Licata said we had a representative from the Opera happen to be sitting next to the executive director of the Vera Project which is the music and dance organization and about priorities are different and they hardly ever overlapped. It's difficult to deal with the priorities of each individual organization. But if the the Opera and the Vera Project can agree on a shared priority, that's a that's a no-brainer. That's something that it is easy for the city to support. At the same time we hosted we host of roughly annual cultural space conference called square feet Seattle and invite the public to generate ideas that we've doubled in support and one of the ideas they got generated years ago was the idea of chamber of culture a city wide organisation that could create and support a cultural platform for the city next slide. So just in this year, we have begun to explore that and it's the sum total of what happens when the leadership of each district now sits together the tables not only do you have an aligned platform within the geography of the district's be having a line platform Citywide based in culturally Rich geographies We Begin relationship relationship. We are continuing our relationship with Vivian Phillips to help us explore what the Chamber of culture is. I'm how to center an equity crate Citywide Arts. Advocacy both generated from the district, but also permeable enough that I Is from a districts can be a part of that platform as well identifying the shirt priorities and again those needs and opportunities that often just because you're not putting them on the table people don't realize how easily some of them fit together. So at with that I'll hand it over to Vivian to talk about where she's at in her. We're creating that chamber filter my own Arts and Cultural District, but with all four of the existing Arts and Cultural districts, and there are a lot of points of synergy across those districts. And I think that's what we're working toward is establishing a body that is a repository and then also can export kind of those shared priorities and alignments. One of the things that's obviously important is that everything is being centered inequity and I can say that all four districts have in there. Ocean and are using the city of Seattle's Equity toolkit, which is been really rewarding my counsel to each of the district's is to not be overwhelmed by it. But to take small parts and do what you can learn as you go and grow and that's being effective and show it in addition to how they are Centrum. They're working Equity the areas that are a focus our preservation of ethnic blood legacies, which is really a priority in the central air as you would probably imagined identifying existing opportunities where they can Embrace greater Equity moving from assumption to empirical evidence in this is something that I think doesn't necessarily get covered in the equity toolkit, but there's so many stereotypes about what people can and cannot do that it flows. Into the assumptions of the work when you're trying to express yourself or involve more people. So I'm encouraging folks to let's do some empirical data around that. Let's test your assumptions and really reach out to communities in a wholehearted way and naming those that are not present and developing strategies for connecting a bat is 1/8 an equitable strategy, obviously, but sometimes you just have to sit around the table and look at the table and say who's not here and then actually develop strategies around how to get folks there. So that's happening in each district as well. Some of the functions that I think are the most significance to the Arts and Cultural districts have to do with this Citywide. Advocacy Matthew is obviously only one person even as he grows in years he still Stop smoothie in dividing in reforming and so what I think is a point of synergy across districts is a desire to have the ability to share research and resources and intentional focus on the creative economy, which is come up prior in the prior presentation in the beauty of getting to work on. Both of those things is that we can embed that work and what we're doing with bringing all of the Arts and Cultural districts together and using those as a resource for a further and forming the work that we're doing around jobs creation affordability and livability and obviously sustaining Arts and Cultural spaces is a huge element because in every single District, we've got the presence of higher development and the reduction of cultural spaces. And so that is a HEV shared identity that everyone Time to work together on and in just two bullet point all of the shared priorities is goes back to what I said previously increasing the capacity by having a centralized way of working together the centralized Administration everybody's trying to do the work on their own all of the Arts and Cultural districts are volunteer lad. So it's really important that they have additional support relationship building across districts is something I'm really excited about because people get to come together and meet one another and talk. So on April 17th, we're going to have one of those opportunities for all four districts to come together and do some cross visioning shaping. The built environment is obviously a of of interest in all four of the districts in the central area. Of course, we know about all of the up Sony and it's taking place. How can the Arts and Cultural do Pick Em format not just through the design review process but through continued advocacy as an example and developing a sustainable model for growth and Effectiveness in one of the things that I think we have is a goal is to create a national model for how we are working together across the city to really Elevate the Arts and Cultural influence through the districts. And this is the process. So I mentioned on April 17th. We have our first maybe it's not the first but this will be the first all district meeting with a visioning agenda so we can all come together and really talk about what our big vision is for Seattle Chamber of Commerce culture generates Commerce opportunities across the district and Gage and shared visioning as I mentioned and then Our intention is to develop a shared proposal that comes to city council by November. Fantastic, you know I've often thought allowed to various folks in the Arts office about how the arts district and the arts district scan mentor and I think it's just that you've come up with a framework to do that and much much more that is just it's fantastic. I'm going to really left the work that volunteers are doing and all of their communities to embrace and grow Arts and Cultural identities and influences and so by creating kind of a central point where all of that can move through it helps not just one District it helped all districts sticks checks that come along in the future and ultimately it's an asset to the city. Keep adding more Arts districts is the art is the moniker of being an Arts just going to somehow lose meaning and I think you've just kind of flipped it exactly exactly is actually your you found a way to amplify and recognizing that every district has different needs and different populations and and people that they serve there are some things that are Universal across all district. So to the extent that we can create greater tools to help people then go back in their communities are really be focused on the assets in the needs is our go see that is going to be founded are grounded in the foundations of of equity about other Chambers right that the greater chamber of Greater, Seattle. Commerce was originally founded to be an umbrella for the smaller neighborhood Chambers, but it has now become more or less focused on small business and the way that you're starting. I think you're always going to be thinking about small Arts as opposed to focusing your efforts and resources in your advocacy on the big big Arts organization. I think one of the things that we are also able to do is to focusing on the small Arts. Well or the small and mid-sized Arts entities artist an effort. We can create a more direct connection to larger Arts organization and help them to see ways in which they can work with the smaller ones. So it it's kind of this big Universal a way in which I think we've been looking to work and arts and culture across the city for a number of years personally in my experience with the Arts Commission in and working in organization. There is a lot of duplicity that happens and so now we can streamline I think so it makes it makes everything more effective. I think the framing of small and large is also maybe reframe does as long as Spectrum speed of growth. There's the quickly growing Amanda. Where growth slows down as you institutionalize ability to share across that spectrums important you think I wanted to say is make appointment. I didn't make when they was the slide that was designed to make me make that point, which is that really the program started with what in retrospect might be slightly paternalistic program of yours B6 tools. That'll be good for you and really morphed over the years to evolve into a program. It was much more about following the priorities of the neighborhoods and allowing those priorities to emerge organically from those groups and then putting resources behind those really look forward to learning more. You might want to consider figuring out a way to give us a preview before November election this September Budget implication can assure even if they will probably have some level of but budget infliction. I can't imagine bring you forward a proposal to do something like this and it not having some Financial implication we needed to have blood. So much. I really do. Thank you. Thank you. All right. What was that? It is 11:38 a.m. And the meeting is adjourned.", "end_time": 7235.9}]}