{"format": "raw", "annotations": [], "confidence": 0.944671771148356, "data": [{"start_time": 0, "text": "phones on vibrate Good morning. Thank you for being here for our regularly scheduled July 29th, 2019 meeting during a nice summer day. We're joined by council members sawant Pacheco Bagshaw and Gonzalez. And there's no objection the minutes of the July 22nd 2018 meeting will be approved. Turn objects in the minutes are approved for that meeting will go around 9. The table in do a preview of today's full Council. Apple city council actions and I must say that I'm looking forward to our city of Seattle's briefing on the 150th anniversary. So that will be forthcoming with you have to Executive session immediately following this meeting. So nothing for vote this afternoon from the government checks and Technology committee. And I know it was just stop there and pasta my Calicut swimmer. She want everyone there no items on today city council agenda from the Human Services Equitable development and renters rights committee. The next meeting of the committee is scheduled for a special time tonight at 6 p.m. At the New Hope Missionary Baptist Church in the Central District at tonight's meeting. We will have two items for the committee first. We will discuss with the owners and the borders of sabad Ethiopian cuisine as many of you know is an immigrant woman of color owned small business in District 3, and they have recently being evicted in this place at the hands of the carpenter by the person who bought that City Alchemy real estate and they are subsidies Centric Partners. They the developers bought the property that's about his rented for nearly twenty years to run their small business Red Lobster tens of thousands of customers and as we know for struggling small businesses moving to a new location is very expensive because it only need to find a new landlord Russian also need to make sure who invest and remodeling stoves fire suppression systems refrigerators to be installed and other costly things. And so what they there immediately facing a problem of funds and if they don't have those funds and they would lose the business that they have put so much into and the community loses a big part of its Heritage and identity and there been any number of customers of saba from the Victorian outside the district and in fact outside the city who have said that they really want to preserve this this community Jewel, so I'll be back. The issues of relocation assistance for the business but also be bringing up larger issues of whatever face by small businesses. We will be joined by other small business owners in Central District on also the Central Area Chamber of Commerce. The other point on the agenda will be a discussion with representatives of several Central area churches and the low income housing interviewed about using Church own land to build social affordable housing Seattle used to have something called the central area of fun which had federal funds to build affordable housing in the central area. But when the Housing and Urban Development budget was being slashed in Yosemite in the 80s the fun side of the dryer but it does show what is possible. And so we're hoping to open open open the discussion on what city funds would be available for that. Also wanted to just at two other points that are important one just condolences to all the five. Families that were affected by the horrified shootings on the Garlic Festival and I hope there will be careful investigation into this completely or if I got an acceptable incident of violence. And secondly we have the security officers at the Frye art museum in District 3 on first comes love recently unionized. They it was a courageous effort by the workers switch as many of you know, what supported by my counsel office by SEIU 6 by DSA by socialist alternative and many Community organizations. And these courageous workers who just you and I are going into the air force bargaining session today with management and I wanted to publicly wish them good luck and to let them know that the community stands with them. Thank you. Thank you. Thank you Aunt today's full Council agenda from the Civil Rights utilities economically Feldman and arts committee. There is one item. It is a cancel Bill to lift a Proviso on a on a $150,000 at the council provided in funding during the budget process. The Proviso was required as a way of ensuring that public benefits were granted in exchange for the funding from the city. The funding was provided in order to address some of the late-breaking identified issues associated with their major renovation, and I'm again as we said the funds were added to the 2019 budget and they require public benefit in town hall will provide up to 50 hours per year of free use of the reading room by City departments 501 c 3 is and other community-based organizations and Community groups for programming related to race and equity in this is layered on top of other public benefits that town hall currently provides for previous City Financial contributions to the capital project other items that I have. I have on my list for this coming week. Actually next week. We have the Civil Rights. He told me they can on the development and arts committee meeting that is on August 13th. I'm so not this week but next Tuesday, and then the only other thing I wanted to make note of is on Wednesday evening. I will be attending a monthly mixer that the office of arts and culture has this month. It will be held in District 1 at the Youngstown Arts and Cultural Association and it is going to be focused specifically on the question of the future of the office of film and music. So, I'm really excited to hear about the efforts of the Arts office as well as the office of Economic Development to engage with the broader Arts Community around those questions. Thank you for checking. A good morning. There are no pleasure way to items in the full Council agenda today. The next plus committee meeting is on Wednesday, August 6th. Sorry, August 7th, and just as a quick reminder, I need to schedule in District meeting for constituents. Please email our office and Carlene specifically. Freddy invitations for the night out block parties as well, please email Carlene as well. And then lastly I'll be hosting a lunch and learn next Wednesday with councilmember Bagshaw on wayfinders at noon here and the council chambers. So thank you. Very good. Check out for including me in that. So I got two things today. When is my own and one ever was his information for what's coming up for her committee? So first of all with our finance neighborhoods committee, I know you're excited about this, but we are having a special meeting on Wednesday Wednesday. Thank you councilmember Gonzalez and counsel present here all because I know this was an add on to your schedule, but we've got a number of items that we've got to get through this week so that we can vote on them before recess. So there's one item that we will actually vote on this Wednesday and that has to do with the wages of the hydro maintenance workers went into at Seattle City Light. I'm taking that over 4 councilmember Moscato, but then also we've got 5 supplemental budget ordinances of these will take a little bit of time. We're going to get through the exceptions ordinance the carryforward ordinance the supplemental budget the CIP abandonment ordinance and the grant acceptance ordinance. We've had a briefing before We will we will not be voting on this again and we just have to have a second hearing on it and then we will vote on that the following at the following meeting. So thank you for coming preciate it and we really have to get through all that. So what is my my staff said stop asking questions? So I will do my best to make sure that we were through with that on Wednesday afternoon. We also have a special backup meeting that we are holding on Friday. That's this Friday and if we don't get through this information, but I think that the threat of having to have a second meeting this week is enough to get us through on Wednesday. So for a council member War as she has a meeting this Wednesday, July 31st at noon at her Civic development public assets native communities committee. The first presentation is from Outdoors for all and it's a program dedicated to enriching the quality of life. It is at Magnuson Park Wheel of this and appreciated Bronson and all of his team. We also have an ordinance regarding The duwamish park acquisition the Christy Park donation and the sun park donation and apparently there was an ordinance regarding regarding steinbrueck Park that designed that was scheduled for the committee, but it required some action from the historic preservation board Pike Place Market, their meeting was canceled because they didn't have a quorum and so it's coming back again later this year, but I want to get through it. So from Sound Transit report from council member was she had their first Rider experience and operations committee meeting. The focus was on replacing an increasing a current lease for warehouse in yard space for Sound Transit at Kent why that matters to us is that the space will provide necessary support for the construction and operation of the forthcoming Northgate and East link extensions eight-year term 8.2 million dollars. And then she also attended a sound transit board meeting where they considered major items for the city of Tacoma extension. She felt that that was important for us to bring up because it was the first meeting for the public stakeholders and elected official similar to what we did on the for the Ballard and West Seattle alignment. So the last two items that she wants you to know about is the Parks and Recreation posting their big day of play on August 17th, and that's going to be at the Rainier Playfield and Rainier Community Center. If you've not been there, this is a blast and they Parks really pulled out the stops on it and then heard live in D5 is Saturday August 10th from 1 to 4 at the Hubbard Homestead Park, and I'm sure all of you will be hearing about that at least 10 more time between now and August 10th. So, thank you cancel member where I was going to Good morning, mr. President and I am going to report that there's no items from the housing Health Energy and workers rights committee on Sunday's full Council agenda, but we have been very busy. So there's some items in the pipeline coming this Thursday. We will have a committee meeting and it will begin at 9 a.m. Because we do have a lot of items to cover we will cover the hotel worker legislation in the last portion. So we're asking folks who are interested in signing up for the hotel worker legislation presentation to sign up on a separate sheet of paper. We will get to those after we include some of the other items on our agenda that are also very important the two other items that will be on the agenda for this Thursday include the multifamily tax exemption renewal or the mste renewal and report. We will help you having a briefing on that not slated for possible that we will do a vote on the next meeting. We do also have another housing-related item, which is a briefing impossible vote on legislation that I am sending around a doubt on this is from Central staff. Legislation related to House Bill 1406. We did see an announcement from the executive's office last week that we were happy to join in on. I believe the council member horrible as we talked about how we're going to take advantage of these additional dollars that the state has made available to cities and counties to build housing and our interest here is in bonding against these dollars to create additional Revenue in hand for both housing and then recognized and when do you need some funding for operation and maintenance but the priority being in building construction and capital. This is a one pager for your review. Would love to have you all let me know if you have any questions on this is an excellent opportunity for us to I think lead in the state and show other cities what it looks like to take this opportunity and to try to build housing very excited about the possibility of generating upwards of fifty million dollars. And then as we say that in the same breath recognizing that is not enough a year-over-year we would like to see that same amount and we'll keep fighting for additional Revenue in hand for housing, but this is a good addition. Compliment to our Housing Trust Fund and other sources. So thanks again to counsel to legislators who are the prime sponsors including Nicole macri and representative June Robinson Center of frogs as well as the leadership from speaker chopp excited to be able to move this forward potentially on Thursday so I can ask a quick question for point five million dollars a year. Is that what the city can potentially get as a result of bonding? Actually that is the amount that we would get from the state and then we would Bond against that the attention to get around 50 million dollars. So it's it's that is yes leveraging those dollars. But basically we could rely on those dollars every year to pay back the bond and that way we get those dollars in hand now to build house at your house cuz I just want to thank councillor Moscato for her leadership on this. This is really important that we act as quickly as possible. We have bit the The Authority the state of thority goes into effect in in July we have some time to exercise it but I don't think we should use that time I think we should act quickly and hopefully try to align some of these funds with our notice of unavailability 4th for this year try to get some of those dollars out the door and I think it's also really important to reference and keep in mind the fact that these City dollars will leverage other dollars as well. So this is really I think that important step for an effort that I started a few years ago and the council supported to use our City's bonding capacity for housing like we do for many of our other priority capital projects. Thank you. Thank you one last point on that just to show our return on investment for every $1 that the city invest we can leverage $5 with federals County and State dollars. So it's really exciting. At least according to the last presentation ideas. So thank you and we will ask the council president to hold it for one week. So we will potentially for able to vote this out on Thursday. We will ideally hear it and are full Council briefing on August 12th. Mr. President opportunity to speak at the regional coordination meeting. I'm sorry to attend the regional homes coordination meeting with council member Bagshaw and councilmember O'Brien. This is a continuation of the conversation that we had in our select committee on housing and homelessness where we're trying to make sure that the entities both are at the county and our sound cities and the city of Seattle are all working on the same sheet of paper and on the same timeline with the same expectations and goals. We think about breathing and Regional governance group. Just want to announce that we are going to have our second meeting. I'm to make sure that folks know that those discussions continue and to be super transparent about our efforts to make sure we're all on the same page. Nobody's getting a no-start of pressure to move in One Direction. Weather that we're moving as a cohort together as we create the regional Gardens effort tomorrow be speaking at the valley affordable housing Coalition on Friday speaking with the insurance at the Washington State labor Council AFL-CIO Union summer camp and Saturday. I'll be speaking at downtown to celebrate the 54th anniversary or the 54th birthday of Social Security Medicare and Social Security. So very excited to be down there with our friends and I think that's it. Thank you. Good morning. Everyone. I just have to get myself a little organized. I apologize for that. So we have a special meeting of the gender Equity safe communities new Americans in education committee this Wednesday, July 31st at 9:30 a.m. Here in council chambers. There are a total of 6 items on our committee agenda at the first item will be a discussion and possible vote on Council Bill one 19589, which we are commonly referring to as the DNA bill this particular Council bill will conform to Seattle municipal code to state law for crimes that require the submission of biological samples. So really what we're talking about is a follow-up on the city's behalf around the ability to be able to efficiently and effectively test to our backlog and deal with backlogs of rape kits that have existed both at the city, but across the state as a result of some lack of funding and some others were regulatory issues. I'm this this is a largely technical Bill designed to align our city laws with state law in a manner that allows us to move forward and deal with those backlogs. We have done Outreach to King County sexual assault Resource Center to the ACLU of Washington and do a few other organizations who were closely following this issue for privacy issues and other potential constitutional issues in the state legislature and all of them have signaled that they don't have any concerns with the bill. So my hope is that it'll be a simple conversation and it will be able to vote this out of committee so we can go ahead and get going on testing and advancing those kits. That's the rest of the agenda is largely dedicated to components that are required by the 2017 account police accountability ordinance, including a report from the community police commission office of Inspector General on a presentation of their mid-year reports will then hear from the office of Inspector General on there. Intelligence reports and then we will also I hear from the community police commission on their 2018 annual report. And then finally we will have a discussion and vote on retirement a couple of clerk files related to the Seattle police chief 2018 annual report and the chief of police audit report. So a lot of important stuff but largely largely technical in nature in terms of compliance with other ordinances it require these at reporting issues. I also wanted to circulate this consideration and signature this Saturday August 3rd at the Seattle Center are Sikh Community will be coming together to celebrate Sikh turban and this is an opportunity for us to wish them well and their celebration. So the sea Community will be celebrating sale Sikh turban day on August 3rd at Seattle Center to celebrate their Heritage and Culture and we really want to wish them a successful celebration. I will be attending representing the city council on Saturday and presenting the proclamation to the community and really excited for the opportunity to do that. So that's again at Seattle Center this Saturday from 1 to 6 p.m. I had an opportunity to join the Sikh Community intent. I'm in April and it was a complete blast with many amazing food stands. And for those of you who don't know super familiar with a Sikh Community tradition of giving people feeding people for free as a as a sort of a fundamental part of their culture to welcome people to get to their festivals and and it was some of the most amazing food. I have had the opportunity to enjoy so I really it's very family-friendly super fun. They're going to be having exhibitions around showing folks how turbines I get tied at the real. Awesome opportunity for us to support our community particularly in these trying times into into really stand there with him in solidarity celebrating their culture and Heritage Ranch. Yes, that's where she want to add to the effect of serving free food is actually something that's something that they do and all the good War us throughout the world and me obviously started in in Punjab, but it's sort of thing came as a social justice concept that nobody should go hungry or thirsty and then as a follow-up to that huge even that they had done which country controls and I were both that they also the women of the community at the same location of show where the organized a women's empowerment meeting recently having just a few weeks ago and one of the teams was of course for them to fart for us. Is he community in for women from salvation origin here in the diaspora to raise awareness against women's oppression throughout the world including in South Asia and they had really Incredible strength of Street theater kind of approach to highlighting how horrific female feticide can be and how you know about all genders of Gina children should be should be nurtured and should be encouraged and it was was quite a quite a quite a phenomenal amount but there are a lot of younger children who participated in anything that was really important for their empowerment as well types of collective Gatherings and actions to take place. So really encourage you all of your around to join us on Saturday at this wonderful celebration. I'm really honored I've been asked to present the proclamation on behalf of the city council to this community last week. Just wanted to mention that I was getting concerned with Ryan and I had an opportunity to spend some time in Detroit Michigan last week attending the local progress and you'll convenient. I have the privilege of serving on that board and so spent a little extra time in Detroit to fulfill some of my board duties and then the rest of us had an opportunity to either moderate or speak on panels. And of course, I attend a lot of panels on topics related for a to affordable housing to Criminal Justice Reform to police reform two issues related to climate Justice. I know they can't remember Brian O'Connor on a very well-received panel around climate Justice and so I so I also just wanted to acknowledge that one of our very own counselor mosqueta. Recipients of progressive Champion award named after adding ADI Barkan who is one of the founders of local progress in one of the original staff members of local progress. He is unfortunately very ill with ALS and his lost his voice and his ability to to really move but he has been a stalwart for many of the things that we have been fighting for here in the city of Seattle everything from economic Justice to climate just has to work a rights to bring a really dismantling institutions that perpetuate racism and white supremacy and it is only fitting that our colleague here to my last calendar mosquito was the first recipient of the inaugural ADI Barkan Progressive Champion award, which is a national words. I just wanted to have a moment to acknowledge her work and and she So gracious to acknowledge all of us in her words by making sure to mention in her remarks that none of this would be possible without staff and without us his Council colleagues and she drugged us up with her on stage. And so I just wanted to take a moment to acknowledge her accomplishment. Congratulations. Great. Cuz when will Brian Pyle on a really great to see great to have an opportunity to see some amazing leaders around the country. They're Minneapolis stood out. I think I'm almost half of their Council was there and some really great stories and customers Katie was going to head to head with a council member from from Minnesota for this battle and is excited to see Seattle win that one back to the West Coast amazing opportunity to hear from a very diverse group of leaders from large cities that we often considered Pier cities and also Progressive leaders from really small cities stories of Polk City Council Members on a purely volunteer basis often and very much more conservative cities and the stories they have about trying to figure out how to fight for Justice for immigration for for affordable housing in environments that are very different and what we're working and it's really amazing to hear the good work the people doing out there was very little recognition. They're looking for some help here the best ideas coming from the various cities cuz I know we've done that through the all ages and abilities with the work that will help an AARP you're doing but then it's a wonderful magazine you can just flip through and see if that's something that we could just emulate and do right now. So those things available we we pull together a book at the policy handbook and members who are who are members of the network have an opportunity that to get that handbook it's over. Mobile online as a resource and it is it is sort of in a list out the examples of different policies the different cities have advanced what the components of those policies are and shoes and we also have developed some more detailed tool kits on particular issues. So there's some in a budget analysis tools to evaluate. For example how much you're investing in law enforcement approaches as opposed to Public Health approaches to Public Safety. They could have healed better outcomes in terms of really changing and an interrupting cycles of violence in our community. And so I think there's a lot of resources available to leaders at all levels for for advancing local level policies that could really make a difference in our communities. Thanks for your service on the board to my pleasure. It was one of the folks that also has had a hand and found in the organization. He was there until it's great to see neck for a couple days and have a chance to catch up with him. He seems to be doing quite well. Station committee does not have anything on this afternoon's agenda. We do have a meeting tomorrow one of those lovely V weeks of the month and with enough work going on. We've added a special committee that will also be seven items on the agenda really quickly. We're going to get up presentation from community members on the green New Deal colleagues. Probably recall. We all signed a letter about a month ago supporting Community efforts to establish the green New Deal for Seattle there been ongoing conversations happening since then and so we're going to get a pic on a discussion with a few Community leaders have talked about what their hopes are for the city and kind of ongoing work they were doing trying to hopefully bring a resolution for it sometime in the next month or so to find a way out of a framework in groundwork for where we're going to go couple items related to Children's Hospital and 1 is fine. But I believe he started a number of years ago on their work on the campus in Northeast. Seattle will have the annual rsji report from Seattle Department of Transportation. There is a streetcar operations update will get I'm sure they'll be some tension on. So this will be the updated numbers on ridership and also fighter ship on the existing line. So the first Hill line in South Lake Union line, and also they'll be discussion about what the mayor's vision is for for the Center City Connector, and I believe there's a man asking their two for funding to do on going kind of engineering and design work based on Kind of the retooling of that project to that worth money with over the past couple years. We have an ordinance on cute reproduction. I believe it's intended to expand downtown area to include areas around Seattle Center for somebody commute reproduction work. We're doing and finally consider a resolution that expresses the city's concerns for Naval testing in the Puget Sound Waters and Coastal Waters up and down the West Coast specifically the impacts of that testing. I believe sonar related house on marine mammals and obviously the the condition of the resident with a population of Puget Sound is of utmost concern along with other marine mammals and how this Navy testing has impact on them that is it from the seed sustainably Transportation committee. Very good. Thank you. Cousin Brian. It's rather. Just wanted to send item. I wanted to note for the Cubs call as we do have the handbook from local progress that has various key model of policy and legislation in it. I'm excited to share that around and we'll see if we can get some more hard copies or electronic copies will send that link around for folks. Also wanted to say you're just a few more things. I didn't say about the event on Saturday and encourage folks to come congresswoman Drive Falls going to be there along with the band Smokey brights, which my friends have been plays in. That's well as Washington State labor Council in Washington can excited to be there this the Social Security Works Washington event, and it's the 84th birthday of Social Security and then the 54th birthday of Medicare, so, that's what we'll be celebrating and talking about protecting on Saturday at 12:30 at MLK Memorial. Thank you very much. Thank you for all your support. Okay, let's move into our next agenda item which is the city of Seattle events around 150th anniversary. Any prisoners Monica who also join you, please come forward. Without it appropriate to call full counsel just to show to make you aware of some events some exciting events are going on a relative to our celebration. So why don't I stop there and just start with introductions and dive in. Thank you. Thank you council president Monica Martinez City Clerk and joining me today are members of our city clerk team and partners from history link. I'm Peter back with documentary media and where the book publication arm of history link. Emory McCaffrey co-founder and executive director of history link City archivist I would also like to recognize a city clerk archives team members that are joining us in the audience this morning. They're behind me and that would include Julie Carson Julie Eric Fisher Sarah Shipley Libby Hapa and also Ashley Harrison from our legislative operations team council members. The city of Seattle is fast approaching the 150th anniversary of its incorporation in 1869. December 2nd will be Seattle's sesquicentennial anniversary say that three times very fast. Today we are so pleased to share our progress towards the creation of a commemorative publication celebrating Seattle's past 150 years through Holdings from the Seattle Municipal archives. The book is titled and it's right above on the big screen the city at 150 the story of Seattle in 150 object from the Seattle Municipal archives. This commemorative publication was made possible to an incredible partnership with history link and multiple City agencies that supported this project by contributing funds and or plan a partnership events leading up to the December 2nd anniversary. A special 150th anniversary logo was designed to help promote this momentous occasion. And we look forward to sharing this anniversary logo with all City departments and our elected officials to assist in promoting Seattle at 150 as well as the various community events. We have planned and that will be beginning starting in August. So we're already going to have a lot of community event involvement. In September of formal announcement and kickoff for Seattle sesquicentennial celebration will take place and coincide with special anniversary events that I will be discussing and in a short time. A quick look at the preliminary schedule list on your postcard which all of you might have. If you flip the other side will show 3 upcoming community events where we will have exhibits and activity surrounding the 150 those events include light in D5 at Hempstead Park on August 10th Parx big day of play on August 17th and S. Sparking day on September 20th. We look forward to supporting these events in promoting others that and like I mentioned will be highlighting shortly. We have plans to work with the city Pio teams and also promote go to the city websites Seattle Channel & Beyond. We are all so excited to collaborate with you our city council our mayor and All City agencies to ensure the special anniversary and the resources published and produced are promoted throughout the community and our team is available to assist you and coordinating those opportunities. at this time, I'd like to turn it over to an who will share the concept behind the city at 150 and the book we've been working on is based on an idea that the British museum used in 2014 history of the world in 100 objects, which juice objects in the museum to tell stories in different time periods. And I'm Different themes in books podcast and Exhibits Seattle at 1:50 stories of the city through 150 objects from the Seattle Municipal archives uses items in the archives to tell the city's history the items and items in the Box are all from the archives switch holds the records of City departments and its elected officials the objects reflect the complexity of governing the infrastructure and policies developed to keep a city running smoothly as well as the voices not only have employees and elected officials, but if citizens interacting with their municipal government, Each object offers a small story and community that touch on key themes in the city's history through time. I also wanted to mention that in addition to support from the executive and the legislative Department. We receive participation is Apartments listed here for their support of the 150 project Amor very grateful. Objects in the book illustrate different functions of the city and a variety of departments the stories balance different neighborhoods throughout the city. The objects show points of conflict as well as important achievements telling individual stories shows incremental changes through time as our worldview evolve Along With Attitudes microphone a little closer place. Thank you very much. We'll also have an online version of the book and will send out that link as soon as it's ready. It'll probably be in conjunction with the with the publication of the book. History link has been a great partner. They designed a beautiful book. The book will be able to be enjoyed it a variety of levels. The launch of the book is October 17th in conjunction with an exhibit that we're doing nsmt. Lobby copies will be available then. There will also be a public event on October 30th and Bertha Knight Landes where Jeff Schulman from the University of Washington will also speak on the value of archives and telling our stories today. We hope to see you at one or all of these events. We're really excited about the publication and looking forward to seeing it when it's October the time with them Peter back and also Marie McAfee from history Lincoln docu-soap really really please. This is a great honor and pleasure to work on this book. Seattle Municipal archives is a treasure you guys should all really happy and proud of that for us in our everyday work we use it. And in this case, it was a collaboration between the history link writers, of course my partner Peter and the archive so all of us played equal roles in this production as the encyclopedia Washington State History, I'm really happy that we got an opportunity to do something in this hundred 50th anniversary, and I want to thank you all for that. Opportunity. I hope you love this book as much as we do it's beautiful and it's a great way to sort of crack into the wall of history and approach it from different angles and you know just a dip in here and there and I think it's going to be great asset to the city. I'll just add that 150 is a very unique book and not so much telling the story of this of the city as giving 150 little opportunities to walk away with knowing more about how I see the begins and crows in evolve sobbed and then you knew before so I'm really excited for all of you to read it. In 1869. I was just in grade school at the time. But what would the father of archives that took place? What was the physical form? Did you have with pretty much just some kind of paper or I mean what what were you converting to show us what will be in the book typically for 1869 were using the Articles of Incorporation which actually held at the state archives. So we received a copy of those or more after that. In 1873 is an example of what was going on. How did you what were you I guess what were the Publishers looking at 2 to produce a product newspapers or something hours tiny overview of the carbs in. He hasn't been around that long for the early years. We often use legislation in combination with photographs. We don't have an object for every year because precisely because of that some of the early years probably because of the great fire that aren't a lot of objects to look at so it's time I leave for two graphs and and legislation ordinances for the early years. And in one of the tricks in in the design and in finding these objects as they they really are objects that are in this collection as opposed to going out and finding, you know archives in different Collections and putting them in the book. These are all Seattle Municipal archive collections. Question comes from schedule. I love this kind of reminds me of those books that we can buy by area by neighborhood in the city. I'm so having just moved to the West Seattle area. I have mine and I read all about the mosquito Fleet. So I know all about the bridges that you said connect our our way are is there going to be an emphasis on here and exploring the transit that we used to have in the city? We tried to balance all the different function of the city of her time. Whether it's social policy Transportation utilities, we made a spreadsheet in really tried to give equal space to tell the functions of city does a lot of work. So I want to put in a tiny plug for history link here because we have tons of that. So you go on History Lincoln type in transportation you're going to you can spend the next couple days reading about it. Also West Seattle or really anything in neighborhoods, and we're just the other book for publishing is at the same time is the history of public transportation in the Puget Sound region. So it'll be a comprehensive history of transportation from the very beginning to now in October actions are the question Michael Brian. I really appreciate this presentation this work and I do know it's great to have his Milestones to highlight the one to bring to the public all the great records. Did you all are the stewards of often? These exercises can be done is exclusively about cheerleading and I'm sure there's plenty of that to do but I really appreciate that. There's also shedding light on some of the problematic cases of our past 2 and I think it's critically important Hazard City confused of all the knowledge that we've done some great things and some pretty horrendous things and these are all part of our history or shared history and we have to recognize that as we move forward in and deal with it. So thanks for making sure that that was included two. If there are no other questions, I'd like to thank an Peter and Murray for joining me at the table and I just want to say it went has already been said there has been an unbelievable amount of dedication and commitment demonstrated throughout this special project. And I'd like to thank all those who had a hand in making it possible with that council members. I just wanted to ask you to reach out to us. Let us know how we might be able to support you out in the community as we approach this some sesquicentennial happiest go and we want to leave you with some sesquicentennial swag and and and we'll have a little bit more but this will help promote. We we plan again add to be working with the pios. The book will be beautiful as described and we'll make sure that you are all a part of the special events that we have planned. East will be October 17th October 17th Keep you posted and thank you very much. I just want to know if you have been pushing as I have with wash. To make sure that they restore the clock tower when they put in the new the new Ferry Terminal work on that. Thank you. Cancel. They're going to hold you. October 17th now. Okay. Okay, we're going to move into executive session and its presiding officer. I'm announcing that the city council will convene an executive session in the purpose of executive session is to discuss pending potential or actual litigation as authorized by law on a it gives us the chance to discuss confidential from the city attorney's office is always available and present during these meetings to make sure we reserve questions of policy for public open sessions to expect this executive session last for 1 hour. To will say to 1119 and if it goes beyond that time, I'll announce the extension and it's expected duration. And so that will move into executive session.", "end_time": 2809.0}]}