{"format": "raw", "annotations": [], "confidence": 0.9413377309437865, "data": [{"start_time": 0, "text": "Good morning, everyone. It is Wednesday, April 17th, 2019 about 9:33 a.m. Welcome to the planning land-use and zoning committee. My name is Michael Brian. I am the vice-chair of this committee but acting as chair today in the absence of former council member Rob Johnson on our agenda today. We have three items were going to first have a consider a resolution which may vote on recognizing the work of the north Delridge on the North Delridge action plan. Second item is a quasi-judicial matter, which will be a remand of approval granted last year to a project in Phinney Ridge and finally will hear an ordinance related to Mondrian inspecting vacant buildings near code for that. I've been join my colleagues. Solace and Saturday by now on thank you all for being here. I'm just a quick reminder to folks that agenda item. Number two is a quasi-judicial item. So we will not be taking any public comment on that today. We will have a proceeding when I get to that item and the appellants and I forget the legal term of the other side, but the talents in the defendant's I guess or the applicants maybe we'll each have time to present their case. But anyone else we have for folks sign up for comments will go ahead and do that folks will have up to 2 minutes to comment. Dennis dinosaurs first called Alexandra men than Michael Taylor Judd and then Steve Herbst l o Well, good afternoon. I know it's not Monday afternoon the two however, I found out when I took the peoples Academy for Community engagement that in order to get free land that was recently enacted why from governments and surplus land that we work to the land use committee that correct donate to nonprofits with the stipulations. They have to provide housing was with that Surplus land. Am I correct talking about State legislation that requires Sound Transit when they dispose of surplus land to do that in a way that supports affordable housing, list Aldi Statewide if that Surplus line weight beat a half-block long or whatever. You said they have the option of donating to nonprofit. So, is it the lights up to me? That's why I'm here. Cuz I want to see what I'm saying. A lot of work for a project to be done before we come to the subcommittee when we would simply Grantland start a conversation with this executive department. If you have landed identified do you like to start a conversation because you qualify my husband have a 501 c 3 nonprofit and we've been working housing for working with the office of housing. We can all be the best place to start. Okay, so I had it correct information. So the city know that this vacant buildings that are not be maintained through certain cold. Is that what that is? specifically they need to be Florida. So people don't inhabit them will get into the discussion when he gets back. Thank you vet. Alex Zakaria my daughter shooter a Nazi garbage routes from animal for my name Alexandra speak about agenda number one about what is come from then Bridge neighborhood guys for 10 year. I'm talking about was this every decision has to be made by local. people this local people posed to be control every 3030 what is Bill on Tuesday? Only come to this place for approving or disapproving but it's different story. We don't have this you control. Everything is don't have sense because we listen for the last man to urinate every day why people who live in these streets in this location know better what has better for exams in you because you by definition of a crook and I sent you belong to what is a color natural source of democratic Mafia. Did you stop a principle by definition you are a criminal in this exactly, but without every director of Department posed to be report to see people every month is a job as normal in a talking about was his hundred times. Nobody listen to me. No one from this chamber know on This Crew cuz this is his chamber Listen to It's very simple business principles of Community. Are you freaking idiot business principal is good for business City. So right now I speak to you Seattle MRI did generate super smart freaking idiot. Thank you very much. Good morning, Michael Taylor Judd former chair of the north Delridge neighborhood Council and a member of the ACT committee. You'll be hearing from us. Some of my fellow committee members shortly about the north Delridge action plan. I'm here. It says speak in support of the resolution. I can't believe we're here. It's been years trying to get to this point. I'm happy to you don't recognize the work and support we got from the city. We lobbied for quite a long time to do more neighborhood planning in North Delridge. We knew Light Rail is coming. We knew honestly the gentrification was coming. We knew a lot of change was coming and we wanted to get ahead of that and make sure as a very diverse neighborhood with a lot of low-income people a lot of immigrants as well as a lot of multi-generation people who've been in that neighborhood since before I even knew core got there that we wanted to be able to shape but that change would look like and as my fellow committee members will be presenting to you with the help of Department of neighborhoods DCI. Ascot and other City departments. We did a yeoman's effort getting all sorts of folks from every aspect of the neighborhood in different languages in different UVA, and use whatever was necessary to get as many comments and opinions and find out how people live in the neighborhood how to get around the neighborhood what their vision is for the neighborhood with a love and out what we're missing and what we need to bring there and we're hoping that you're a resolution and supported this action plan will help us continue that planning as we move forward in the future. So thank you very much. Thank you Michael and thanks for you and the communities work. I know that. Doing this type of planning can be can require a lot of persistence and I appreciate that and look forward to the day. Al Green you are not let's take a look at the tree ordinance. Remember the tree ordinance. Is that going to happen when the last tree falls or are we going to do something before that? It's now it's been over a decade since we've had anything that meant anything and Seattle does proclaim it to be self to be a green City. So let's get some action. Let's save the Heritage trees. Let's save those really big trees that do a very good job of cleaning up the air and provide shade. I might add in a lot of cases and actually contribute to a atmosphere that might be a little bit more. Human, then just steel and concrete which I guess is you're probably your favored medium at this point. It's probably not surprising when we look at you know, what happened with mha because we have we're going to raise the cost because he knew we have plenty of housing the city. The trouble is we have a shortage of affordable housing and 5 to 20 plus years much of this housing will become more affordable and the ghettoizing is I find particularly egregious part of this because we're not going to really require the housing to be in the neighborhood where you're raising the affordable housing in the affordable housing right now is the most likely to go down because it's where you can make the most money and we all know that even though the city is over Zone and we wouldn't have to raise his going to accept a lot more people as this is done to increase the margins of the developers because they need the money and we should take a look at this. Zoning code and actually enforce it in a weird having too much of this g-wiz zoning zoning that happens because somebody has a beautiful idea. Is there anyone else who would like to provide public comments on either agenda items 1 or 3 today? Yeah. This please introduce yourself for the record. Hi, my name is Rudy Pantoja and I live in Crown Hill and just met with the mayor upstairs about a sobering unit for North Seattle. I'd like to pass this on to you in regards to our issues of concern regarding increase Street crime Ballard free my grandmother. You understand. I don't need to go any farther and the issues we have ways. We find people laying down on the sidewalk with no place to go and a sobering unit with the heroin injection sites on hold right now would feel like Gap necessary north of the ship canal that we currently don't have other than the bus stops the sidewalks. The storefronts and stuff like that. So my time is up best behavior today, and I'm out of here to Ballard. Thank you. Alright anyone else seeing none will go ahead and close public comment and invite presenters for agenda and everyone forward and then would you mind reading the den that I'm one of the record agenda item one resolution 31880 a resolution recognizing the efforts of the north Delridge Community to prepare an action plan for their Community identifying a work program to implement the north Delridge action plan and identifying proposed amendments to the Delridge neighborhood plan in the comprehensive plan for consideration in 2024. And then an advocate for this project in before Council, even though it's been a long process at the cities and in so imperfect like to thank you for agreeing to hear this in this that we weren't sure whether or not given all of the considerations around Airing of the committee. So I appreciate that this Rose to a high enough priority for you to make time and as we heard and public comment, this has been a long time coming the working of the action plan and pulling it together. I took time but it it also taking time to bring this to to counsel as well. I want to acknowledge Michael Taylor judged for his his vision and making sure that the council actually recognized the plan by resolution which there was some uncertainty whether or not we need to do that and I'm he he and other members in the community felt strongly that was an important stuff that we should take. The last time the Delridge neighborhood plan was updated was in 1999. And as we are recognizing this plan, I know opcd has identified. Delridge is a priority. Neighborhood for planning in the near future because of the impending decisions around Light Rail as mentioned plan was released last August. One of the things I did after the action plan was released was too in the budget process get some funds in the parks department earmarked to address of community planning process to examine and enhancements to Trail access points on Southwest Brandon that is going to be one of the projects. I think we'll talk about today parks and said that the engagement process will begin the second quarter of the year. So we got that Goin but I think another in a really important point of the action plan and the adoption or the recognition of it by a resolution is to get us all on the same page about what the next steps are. So I think folks from Opie. CD and the community for working on this end up to hear more with the planning and Community Development is cultural center Delridge neighborhoods Development Association Unless you want to give us a call overview just very briefly this a resolution recognizes the north Delridge action plan at highlights key strategies from the action plan for implementation over the next one to three years. And that's an update to the Delridge neighborhood plan goals and policies for consideration in the Comforts of Clan update next year and David Goldberg is here and maybe he can talk a little bit about the planning effort. David really happy to give an overview about the plan. We have community members who can speak to their community and this really is a a process and a plan that speak to community interest in community priorities as you as, you know, never have plans provide a foundation not just prefer specific capital projects and programs but to give context to the efforts as the city makes in a given neighborhood over over a. Of years and we find that these cumin Documents really helped to shape projects first want to thank on the people who really stuck with us through the process and helped lead the community engagement at the table. We have three and David and Linda. Each of them was present for the entire process and devoted a tremendous amount of time to this in addition over the course of the planning. There is Nicholas Eames who came from Youngstown flat a new a new apartment complex. That was their Willard Brown and amazing contribution to the community part of the NBA in a real force in the community Rena tithing who's been together with Brett Eldredge grocery. Crop has been working to push access to Affordable healthy food in the neighborhood and you had a resident in the area Kim Justice at Pigeon Point resident Amanda Kirk from Highland Park neighborhood in Amanda Leonard. Also with Michael a on North Delridge community council member dorsal plant and then Carol Williams from the nature Consortium also helped us. Reparative time and those people really have to provide a community voice at every step of the way at the table. Nothing really happened without them there. We also want to thank the community there's ants that helped us to Twin Gates. I think for the first time for this community deeply into historically underrepresented communities and I was Paulina Lopez and Hassan what the pho Nguyen Rich Sommer to engage the use so cantiague who engage the Cambodian Community wengage the business Community has helped. So so, why do we why do we plan? We we knew that this neighborhood was experiencing growth and change. We also knew that there was capital projects coming to this neighborhood. So it was important for us to get ahead of that in the big one coming to this neighborhood is going to be the H line expansion and also Sound Transit 3, which is a which is under way that together with a community desire that Michael spoke to a really urged the department to plan for this area. Even those one that is not seen a ton of growth. It's an area that we know will experience changed so through the engagement we engaged for over 400 people and different variety of different forms and came up with six priority areas that are spoken to it in the in the plan. This includes supporting the person engaged communities developing Dynamic neighborhood destinations, improving access to Affordable healthy food craving active transportation choices nurturing a healthy Longfellow Creek Watershed and leveraging parks and cultural facilities to support the healthy Community. We did the project with an aim with a lens of Health inequity because this community Assets are largely around the open space and the health and cultural resources and no served as a an asset-based approach that will help improve health outcomes for this community this community in a broader sense does not fare as well as some of the Richer communities in the area and suffers from from some health inequities So the plan is organized to Jesse to these topic areas. They're largely efforts. That would be undertaken in partnership with the humidity. There is a number of them that would provide directions to Community Investments such as rapidride H. There are things that will be done through grants and so forth and and Council the support in the coming years. It really focuses on bringing the community together. I'm working from its assets the community and cultural elements the open space elements to Tunica Community together. I think a couple things that are worth noting is at Bell Road is very spread out Community. There's really no one place that people consider downtown or where you happen upon one another and for a long. Of time. There's been a desire to to use the two to work a long tail Ridge Way to provide those opportunities and those opportunities will occur around and over where they likely to see the future Genesee where we're likely to see the future rail station around Youngstown. come around the Heavy Brandon node where the where the opportunity to connect with Camp long and then parks there and then down with where the Home Depot is is is currently located. So these are the kind of The Shining points of the neighborhood that we hope to enhance over time and that's enough of me talking. I don't know if I think I'm going to toss it to you guys. I know I haven't prepared you for anything, but I just wanted to speak from the heart is what I want to say. This is a very interesting process to be a part of especially for myself and our community in the southwest area. A lot of our community members or circulate around what they know and usually generates about round their churches are there temples and for us to be able to provide a cultural center where we could bring things of our ancestors and to provide him education to our commune members and also provide, you know, everybody loves a Dragon Dance lion dance off some fireworks. Everyone saw if you get a permit, but it's a good place for Gathering so over time our family has been in the area for 40 plus years. I asked my paycheck, but but allows us to you know, really reach out cuz we've always acts like everybody an opportunity for worried about the house for a family are Wellness our happiness, but the sad part is like how do you fit into community? So this is where now we're getting to the part of forfeiting into our community and so being able to be part of process meet my new neighbors and get to know David and let the city. I found a process to be very eye-opening open up other avenues that our organization can the community. So what I look forward for this action plan is to see the development as we've seen over time changes from the Home Depot, which was formerly a Kmart for my we had a food giant. We all love to Food Giant and the star look forward to having a food co-op. I'm even though we're surrounded by so many options like the Trader Joe's and stuff. But we get to have some made out of hours. So so during the progress of this development plan. We want to see some of those things. I actually live at 35th. I was a baby came onto Delridge and then we lived around around the areas. I want to send a slow so I've been around so I've seen it but never been in the work process of seeing how development how this I mean 99 that's when I graduate from u-dub. So happy to see this but going forward with our own organization. We also want to grow so as counsel number. I'm her bill. She attended to one of her activities this past summer. Sorry about your car being blocked in a safe. So people can come out and visit, but we also want to grow and shelter ourselves when it's raining. So we've been very fortunate you in this past weekend. We had a function and we were just praying for Good weather and it didn't rain until after it ended so we were ruled us but my family has property would like to develop in order to support ongoing activities of the cultural center. So for our seniors for our youth so so we're going through process. So that's another learning process for us. So we hope to have a business which helps support help people love to eat. So if we want to place to come and gather for that and that will in turn help us support have a open space for our Cultural Center as well. So that's what we're looking forward to our end and then contain our relationships with d and d a and are our neighbors. So that's why we're sorry it took so long to yeah, I think from Again David with the dollars neighborhood Development Association, I think from a on a broader level. I just want to honor David and his work by Leading us through the process and chicken. Muscle City departments to the group we had presenter is coming into the advisory core team meeting is a lot to get to know what parks and S. And various folks were planning or doing a Delridge. So I think one thing I'm excited about for the implementation is continued coordination between City departments and Community after its we partner with a lot of City departments already. We already were doing that. We have more relationships now to this planning process both with our neighbors and other cultural institutions in an organization's but also with other folks from City departments so sort to speak to our organization's priorities align a lot with this plan, you know, our mission is integrating art nature neighborhood to build and sustain at at a dynamic Delridge and and most of these sort of action item categories are things that we are working in so I'm in a weave on seven affordable housing properties to Delridge the Youngstown Cultural Arts Center. We've done a bunch of work on the Longfellow Creek Watershed. Coordination efforts going on on a watershed level now that I haven't I hadn't noticed before or maybe they're ramping up in terms of the coordinated efforts. And that's really great. I'm excited to see more support for public events. We throw our arts and nature festival at each summer and it's too well kept secret because it's not some event that brings together a lot of these elements. We're really excited to work with Sound Transit and with our neighbors, of course, it's going to put displacement pressure on Delridge were not sure exactly where you're at. But and working with committee members already said make sure that their needs are heard by Sound Transit by City departments are wetlands project the 23rd and family is working with s. Spu Park City Light and more and so again just really looking forward to for the coordinated efforts of City apartments with our organization and with with other community organizations to to get This work done. Just want to honor sort of the engagement of Youth the various cultural communities. I thought we did a pretty good job actually through this process of engaging A diversity of voices and bring in books the table. So it's one of that and excited too kind of continue that engagement through implementation and through grant-making and through funding to I think, you know, 20 years ago was the was the plan of the last update things have changed a lot things are about to change a lot more to our organization. I think the advisory question is a whole really took on through. How can we preserve some affordability and engagement by these communities as things are changing around us. So excited to continue working with the city on I'm pre Hines and I've been in Delridge about 18 years. I'm over there because I was working at the Delridge neighborhoods Development Association back when we were developing Youngstown Cultural Arts Center in Croft Place Townhomes in the home in West Seattle Food Bank. I've seen a lot of changes happening Delridge both good and bad. I worry a lot about gentrification and some of this development pressure. So as part of this process. I also do want to honor all the work that people are doing but I would like to raise the red flag that you know when we put it down on the paper. You know, we need to be prepared to follow through and I think many of those steps are in process and there a lot of departments that are working on it. But I really worried that you would like the city the process takes a long time. Right? And you know, I see all of these Townhomes being developed along Delridge way which are the really pretty and they're nice and wealthy people can live there and it's bringing density to Delridge and doing a lot of good things that way but it worried that we need to find ways soon to make sure that we're preserving affordable housing and building new affordable housing or we're going to be a now going to be a strip of tall. So I think some of that that zoning work that is in the the plan. I know there's a lot of sort of look at study the zoning Sumsung like Portable housing pieces and the potential changing of zoning to encourage more mixed EOS neighborhood commercial higher density residential. I think those would be a real priority for from my point of view having soda seen what the development pressure is doing right now. There's a property that's in the neighborhood commercial area and on Delridge that's just been developed as townhomes with live-work units below right? We should I don't think it's really white people had in mind when they don't it neighborhood commercial that it would be townhomes and a lovely townhomes in nice neighbors, but I think that we have a chance to you know, for the the health of the city to use this the land that's very close to downtown Seattle to be a more dense and Equitable community and where people who work in the Lesser Professions that are supported and been an important part of our city can live in Seattle and live near downtown so we can have as those people and then also within Delridge, you know, I along through this process so all of this research about the health impacts and you know, I live there and I don't want that Health impacts. So in finding ways to make the community more walkable and to address a lot of that in equity mean I I try to do that for myself personally, but I know that Neighbors could use a lot of support with that. And then I would also like to as a third priority talk about the Delridge grocery Co-op specifically and I think whatever can be done to support that effort. I think that'll have a tremendous effect both on providing healthy food options and also becoming a neighborhood hub for place where people can gather there's actually a not too far from that location. There's a tiny coffee shop that just in the last year, but now it's it's crazy busy all of a sudden I used to be that that area was going to empty and dead and no one was ever there. And now, you know, you see all these young families and kids and there's a line for the coffee. So it's definitely happening, but I want to make sure that We keep a diversity of backgrounds and of income so that Delridge can continue to be the unique place that it is and then become that I support the work that is done. I hope that dissolves is an approval of this resolution and that we will continue working and making those actions happen. Seriously contemplate what our vote will be on his resolution. I just want to also uplift the fact that you made me. Remember that part of this resolution is also recognizing the comp plan amendments that you guys are proposing that the city consider and those recommendations are wearing the housing goals and policies are and highlight with some of those our community with a range of household types sizes and incomes including seniors and families with children and encourage their Rehabilitation of substandard Housing and Community the preserves and enhances residential character of single-family neighborhoods within the Delridge Community while also providing a range of housing types to fill that the diversity of Delridge neighborhood. So those are I think important goals to uplift and there will be the comp plan amendment process and I understand that okay. He will be reviewing the Amendments that you proposed. I also want to speak to you know, maybe not all of the things in the work plant itself or the priority actions themselves, but one of the items referenced about follow through and making sure that the words on paper actually become actions. I think one of the first recommendations if we can get to that right away if maybe there's already been some work done by by David and opcd. I think that will help us in that is to have an organizational structure that will Steward this plan and help keep. My and my colleagues in the executive seat to the fire on the meditation Peace So, I think that's a really important element that will keep us on track for the other parts. I really I really appreciate the appreciate the thoroughness and thoughtfulness this plan in addition to some of the women to addressing racial Equity outcomes throughout the work in there is something that's important and I appreciate the work to clean up natural stormwater both the way to improve the neighborhood then also improve water quality. And so and I just acknowledge the challenge that there's a lot of the robots plan and don't take it serious investment and you know if we can be for scarce resources that can be a challenge but I think this community is deserve some significant investment. And obviously there's with exciting to see the H line coming Sound Transit will be like the passing through the end of the neighborhood at some point in the near future Relic near future. Another word for needs to be done to really support and maintain the kind of richness in the fabric of the neighborhood as it will almost certainly grow so that it's a positive CrossFit all the residents there today benefit from as opposed to are displaced. Only box I might have some questions around the house and goals in particular. So an attachment see which is references dg-8 and it prefers it's the language that comes number herbold read out loud which provides that a commuter that preserves and enhances the residential character of single-family neighborhoods within the Delridge Community while providing a range of housing pipes for the diversity of Delridge household. How does that language in that goal square with the recent actions that the city council has taken around a proving that mandatory housing affordability program including in Delridge. So I haven't looked at the map recently, but generally But generally The mha Proposal did apply a range of different zoning types from residential small light which allows two homes single-family lot to multi families on sale Lau much higher density development. And so NHA being a they'll be slightly more dense than previously but it still allows for a range of housing types under a range of different zoning types and Delridge and the planning is not an urban villager and consequently the mha provisions that apply to commercial multifamily areas do apply there but Delridge began planning back in the 90s as an area that was identified as a distressed area one that we were seeking to in a moderate ways to emulate Economic Development and Community growth rather than in an hour. Urban Village Way, so the so the the amount of growth tilt a little bit more towards recognizing the existing pattern of of single-family development and within the planning area, which is quite large. It's not actually constrain two areas where it would like in an Urban Village designation where we would look to grow more housing. It isn't it encompasses a large number of neighborhoods in the area that identify identify as a community rather than being a strata that place where the city has historically try to focus more growth. It's an anomaly in our planning. There's two communities that are like this Georgetown and South and I'm Delridge weather to communities like this where we did planning recognizing that it drink stationary planning. And as we invest in that area this plan speaks to beginning a more focused look at how we can advance the community's goals in that area and bring opportunity. I'm for example, the station will serve an area that goes all the way to White Center in multiple communities so that the definition of community changes the the who has access to Opportunity that area question comes up and housing again will come up as soon as an issue to address in this area first and concern and not advancing things that will ultimately have the unintended consequence of reducing the housing diversity within various neighborhoods regardless of whether it's an Urban Village or not. I'm very close to Delridge just up on the hill and have seen the neighborhood change in a wave that is not taken into full account. I think the the diversity of housing is needed in that space and and that includes the full spectrum not just affordable housing but also market-rate housing and things that are in between to allow people to be able to build a community in a neighborhood that is mixed income and it's And so I just want to make sure that there aren't items in this plan. They're going to take us backwards as it relates to promoting those housing diversity options and that are really going to add meet the needs as I hear them from Folks at the table and also from the executive summary that really the goal is to make sure that there is an opportunity for people to have housing choice in these types of neighborhoods. And that's just an important thing for me is somebody who really believes and making sure that we are addressing the displacement and gentrification issues, but also recognizing that there are pressures that are going to continue to come upon neighborhoods like Delridge and others if I just want to respond that this attachment is mostly the existing policies related to the only thing The community is recommended for recommending adding or the underlined and strikeout language is old language and it is exhausting comp plan that I read out and it existed before there was residential Spa watt important to to recognize and I also went to reinforce the fact that opcd has also committed to begin station area planning with the community in order to specifically identify those areas that we do want intensified density in order to increase access to housing and access to Transportation infrastructure. So, I think everybody's on the same page is when one that stuff to happen for sure. Acknowledge that it's not that it's not an addition here. I'm just flagging my ongoing concern of language that you highlighted in your remarks that I worry about whether that type of language whether it's an amendment here or not can put us in a position where we might be at odds with the overarching goals of the stationary planning and other types of housing changes that might be required in that neighborhood down the road when intense attention because you be brought into this quarter. That's that's my concern. So I'm being asked her out on it as it is and it's there. So I have concerns and want to just expressed my ongoing concerns that I want us to be really careful that we're not promoting language in these. Documents that would be at odds with the end goal of as I understand it this record goals and policies will be back for consideration next year for actual adoption right now. They're being sent to the department for study and David's here listening to those comments to team that proposed the number of event amendments to similar policies Rapid City to make sure they're consistent with the tone cuz I think that's a shared objective throughout the city. I appreciate it. And I don't lie. I appreciate you finding that to the the rule that single-family neighborhoods play and single family development. It's it's the name itself is even complex because I'm for decades multiple families can live in a single-family lot, so it's can be misleading in that weighs. And certainly we were to see twenty years ago till today changed a lot until that's still there and what that means and how we interpret that. I think it's going to be important. Thank you. Alexander questions or comments today, but I might be proposing an amendment for a full Council one of the items in the work plan relate to the nda's work to build a wetland and agricultural education park on the Delridge substation. And one of the things that I've been hearing from the community is that we need to be doing more to coordinate with efforts with City departments to address both the maintenance in the performance of the BIOS Falls and Culvert. So I'm going to be posing an amendment at full counsel that will highlight and call out the need to support that that coordination. I just kind of came up with this on the Fly. Great, and if I can just make a quick remark, there is some language in this resolution and the attachments related to stationary planning in the context of the Sound Transit question. I have a conflict of interest in Sound Transit issues related to to The Junction in particular. This one is a little on the gray side for me in terms of whether or not I am allowed to take action here. And so I am very supportive of the resolution but in the abundance of caution, and probably I'm being way too cautious here. I'm going to abstain on voting on The Resolution just given some of the advice of gone from RSX percent. I will see if we have enough votes to carry this without your support and we're going to have to have a conflict of interest as it relates to the decisions about Sound Transit and how it impacts the neighborhood. So I apologize appreciate your ongoing transparency about that. And obviously the folks that are at the school dance team are very good at keeping an eye on unless that you've been you've been very transparent to that. And so and then tell her both anything between now and Monday is in a time to to work on this so great. So I would you like to move this. I'd like to move a resolution 318800 will second and so all in favor signify by saying I have any abstaining or recuse I guess yourself. And so thank you all so much. I appreciate your persistence City processes can be long and drawn-out and changing of personnel and body. Sometimes it seems dry gone, but the dedication and commitment from folks in the neighborhood who have been there for a long time is the only way these things happen. And so appreciate you being here and obviously bottom of work to do in the future overseas, but this will be before the full Council on Monday. Thank you so much. We will roll into agenda item number to know. What do you mind reading that into the record and we'll invite people forward to walk us through how we're going to do this agenda item to file 314-4253 man of the approval granted through clerk file through 14356 for a contract rezone application of 70th and Greenwood Ave LLC to rezone in approximately 12188 square foot site located at 7009 Greenwood Avenue North for neighborhood commercial to with a 40-foot height limit to Neighborhood commercial 2 with 55 foot height limit and a mandatory housing affordability suffix. Make a note to self cancel Central staff think you just reminding everyone that this is a koala juice a matter of time came to the council last year and the I'm King County Superior Court remanded to us for some action. And so keto if you don't mind giving us maybe just walk Us in the public through what's going to happen today and then I'll let you jump into kind of bring us up to speed. So today I'm the committee will hear oral argument and discuss every man from King County Superior Court of a contract rezone approval of the council granted last August found. The remand is on kind of an error issue. I'll walk through sort of a chronology of the legislative history here identify the issue on dream and walk through a couple of draft options that are in the memo. I just triggered it to you all yesterday, and then I'll turn it over to oral argument and after that the committee can discuss options and decide what to do now. An oral argument can you know it will rain here five minutes of the meat side and it's kind of split into 3 parts 5 going to be at refused us. There are a ball and Bob Morgan are they good person can reserve I'm up to two minutes of their time for rebuttal testimony. And of course the applicants will I'm speak second. I think both sides have olestra of exhibits that they want to distribute to you prior to oral argument right now. We got to where we are now in December of 2006 and 2016 7th and 70th and Greenwood Avenue LLC, which is the applicant for this project apply for a Massachusetts permit to rezone. I'm a side located at 7009 Greenwood Avenue North from NC to 42, NC 255 M of the African seeks to develop a mixed-use building at this site. Decide to split Sound area shown in green above and identified with number one his own neighborhood commercial 240 and that's the portion of the side that would be rezoned the other shoulder blue and identified with the numbers 2 and 3 are zoned. I'm single family 5000. On April 19th, I'm sorry in April in April of 2018 STI issued an affirmative rezone recommendation Penn State of my state of RI middle Policy Act decision and design review decision from there a examiner held at open records public Hearing in June of 2018 and recommended that the rezone be approved on June 5th, June later later that June on the appellants filed an appeal with the city clerk of the things having his recommendation and the council took up that appeal in June and August in August the Council of firm to hearing damage decision and conditionally granted the rezone application and passed an ordinance effectuating that approval on which I change the official and use bath and also accepted are executed properties and development agreement from the applicants the appellants Fatherland use petition in King County Superior Court alleging six errors in August of 2008. The court issued an order on March 5th, and then later amended that order after reconsideration on March 27th. I want thing to note here that there is also a change circumstance here, which is passage of mha Son. Of course record. I'm earlier at March and now that the commercial Corridor here on Greenwood Avenue is Zone into 255 m. So the second page of the memo identifies the issue on a peel there was six issues. I'm in the ladies petition six areas alleged by the appellants had to five of those 6 a.m. Were denied by the King County Superior Court. So far there's five of those six claims and there's one issue that the committee will be deliberating on today and hearing oral argument about 10. I'll just quote from the order from King County Superior Court. The reman is for the committee to consider the contract rezone approval and property using development agreement to dress compliance with SMC 2334 009 D2 which requires that a gradual transition and height and scale and level of activity between Zone shall be provided unless major physical buffers as described in subsection 23340. Oh-82 are present in the area where the commercial lot And there's a parcel number of shares a rear boundary line with the single family residential lot identified as addressed at 7010 Palatine Avenue North. So for the benefit of the public who may be watching this, we're really talking about a very limited area which is the intersection where I'm at the intersection, but the shared property line to Share a boundary line between one on the right hand side and 3 on the left hand side. So one on the Eastern side of the side and 3 on the western side of the site. So the committee will hear oral argument today site that is identified as to his already been preserved in the limitations in the food at the council accepted back in August to put a specified that Landscaping open space and the parcel identified as number to above it would be Preserved in perpetuity molasses part of the project and of the six issues that the appellants identified as errors. You said 5:55 of them the hearing center didn't agree but for one they did is that is at issue 1 issue number one Superior Court remanded that loan issue issue number 1 to the council. So that's so that is a need for a transition and height scale between zones. And again the reason why it's only identified for the area between 1 and 3 is because there is a transition between one and two is my understanding from you because of course, I'll ask the applicant the accounts we have here with us today who represented the city as well and the appeal. Are there a couple of options that are essentially draft and conceptual options that are available to you to consider it and this could be modified to committee discussion after you hear Laurel argument from the App Academy of Pelham spread option. Number one would essentially extend the protections that apply to option number to a parcel number to above and that we replied through the properties and development agreement portions of the site address to 7010 Palatine Avenue North. Identify this number 3 above option to would create a gradual transition between zones by requiring a setback in the project at that transition. So at the at the battery between one and three above and then there was a course an option here with the council could reject the reason if the applicant wouldn't agree to any sort of self-imposed limitations on Project an option 1 option 2 aren't necessarily mutually exclusive and there may be other options that the applicant an appellant will identify for us as part of their oral argument. Do you have any questions? I do not. So I think if it's okay when we proceed with the oral argument. and we will set the timer here and your parents are going first. And so they have the option is keto mentioned to reserve up to two minutes of their time for after the applicants speak. And so was used to determine in advance if they plan to do that now. Are you planning services to reserve any of your time for later? One minute one minute for later 4 minutes now, so no will set the timer for 4 minutes. All right, we have the documents to share with us. And so when you're ready to begin you maybe thank you for the record. I represent you all Bob Morgan were here in the council chambers. You may recall Bob Morgan. He worked on Central City staff. Essentially. The Crux of the issue is can the rear yard of a single-family House serve as the major transition between a five-story mixed-use development Rising right on the property line. So I draw your attention to the Aryan question. This is on three. So he's right on this shared zoning boundary line. This is the single family property, which is referred to as the 7010 Palatine property the distance from here the easterly wall. I apologize for the is the weekly laser pointer from the wall to the zoning boundary line is roughly 39 feet. There's a deck stairway walkway and that reduces it down to around 25 feet. The applicant proposes a retaining wall in here, which reduces it down even further. The question is does that provide a major transition between the shed roof property and single family property those exist. As a matter of code on the next page of the handout the first page of a handout as the judge's ruling the next page has the provisions of code and you'll see at the bottom that open space is defined as predominantly undeveloped to serve the purposes of providing a park recreational opportunities conserving valuable resources and structuring Urban Development in form. Now, I understand that. The applicant has yet a revised set of plans that the applicant will be presenting. I would note those plans are now presenter for the first time this committing in the city council reviews the record as it existed and doesn't sit as a fact-finding body to consider new evidence. If the applicant wants to change the proposal the applicant has to go back to sdci and presented for the applicants proposal doesn't cure. The problem with the applicant would do is essentially incorporate into the lot to the rear yard from the lot 3, which is the single family Palatine property. Now, it's still a rear yard to single family property. It doesn't disappear because somebody on a piece of paper has drawn green around it. The Crux of the issue is is the city council going to allow a device. Caliper to try to get around the requirement for a major transition by buying adjacent single family property and incorporating the rear yard of that property into the development, and there's nothing in the current code, and there's nothing in the code. That was just a mended that allows that the option one does not comply with code and if it is adopted by the city council, I will assure you that this matter will be back in superior court because that judge the judge will hear the action already expressed his doubts about whether that provided the major transition. I thought my 4 minutes is up. Thank you. Thank you. We will now hear from the applicant. And you will have 5 minutes and are arteries are these documents the two colleagues if you're ready, whenever you're ready, you may begin your this applicant is ready to construct a project that will provide family-size units micro retail affordable housing and is ready to contribute funds to affordable housing under. Mha the only question here today is whether the open space on the lot 3 partial constitutes a major physical buffer under 34092. The answer here is emphatically. Yes the court found that the open space in the larger single-family partial it which is a lot to hear is a major physical buffer in part because it is preserved in perpetuity under the Buddha on a number of occasions the court and its oral ruling stated that the project would be Client with o 92.3 provides open space that becomes a physical buffer and is also preserved in perpetuity just like lot to in the development sites. And that is what the applicant is proposing that the council would adopt here today and asked if the council approve the option 1 findings in reviewing the record lot 3 was not really discussed at all. In terms of compliance with the section for you to remain remedy is intended to be contiguous. But admittedly the plans did not do a very good job of demonstrating that the space should operate and be considered as one open space as the court recommended the applicant request that the council amend the puta to ensure that the open space at both single-family partials remains in perpetuity. Second as the court further suggests the applicant request the council it require changes to the open space area to ensure that it feels nicely landscape and open and buffers the project. I want to direct you to Electric of exhibit. Number one. This is actually a Redline version of the Landscaping plan in the plan set administrative record. 279. What we've done here is it was straight with the plants could look like in the council could require. This doesn't need to go back to sdci. This is something the council could require as part of its findings specifically some of the elements to remove to make this feel more contiguous would be to remove the deck and the about 2-foot retaining wall and remove the pathway along that the side so it feels more of the contiguous up in space and really kind of frames the area so it's much more contiguous. With this revised open space and the fact that the Buddha can preserve this open space in perpetuity. It's really presents an opportunity to preserve this and provide the sufficient buffer in compliance with oh 92 we have just a rendering of kind of what that would look like. This is just to kind of give you a sense of what that could feel like. Because of this we don't believe any additional transitions are setbacks are required and we asked you to.. Someone findings and reject the option to findings that are before you today and to be clear at the option to finance require setbacks that are not required by code for this project as it's one development site. So just like this option would not only would result in Lost units and result in a really a non-viable project hear it effectively a men's the code be at the puta to make setback not the part of Alandra moves from the process that design review board to determine what could be an appropriate transition hear the end result is that the poodle would not be would be rejected the site would not be rezoned and there it end up being a gap here in the zoning map itself turning to appellants arguments quite quickly. They claim the proposed Space is really just a backyard. This is a red herring first. This is one development site and no year rear yard requirements would even be required here because it's one development site to the Post open space on Lock 3 is over 60% larger than what would be required in a 15 foot rear yard requirement itself. Finally if this was an actual backyard, it could be fenced in there to be single family activity as an alarm if that under mha this project actually has an opportunity. Sorry because this isn't under mha and it's under a puta this project actually has an opportunity to better transition the nearby single-family Zone and preserve this open space in perpetuity, which would not be something that would would have happened under the mha joining the summarized in 30 seconds. I would like you to adopt the option one findings as amended and I'm in the Buddha to ensure the open space remains in perpetuity and require sdci implement the changes that we discuss today in the alternative if the council does not believe the open space is a sufficient physical buffer wework West an alternative option where the council would adopt alternative findings that either require removal. Single-family home or rebuilding a movement of the single-family home survive even more open space. Thank you very much for your consideration. I can't return to the appellant who will have one minute. No, thank you for putting the timer. As regards the notion of the rear yard for the 7010 Pauling Peloton property being a red herring. It's nothing of the sort. I would assume that members of this place probably have lived in single-family houses. There are yard requirements in single-family houses. The rear yard requirements is something like 25 feet. difficulty with accepting the applicant's argument is that this committee applies would essentially be setting a precedent that any developer who wants to avoid the requirement for a major transition and avoid the requirement for providing open space would do so by purchasing the adjacent single family property and doing exactly what they're doing using the rear yard for another property to satisfy satisfy the requirements of their development and that's contrary to code. Thank you gif. Keto Well, when I start calling we have a couple options that have been highlighted by keto and then discussed by both the opponent in the applicant. My intention today would be to proceed to a recommendation to give towards Keitel to draft legislation that would. Codify essentially what we may or may not agree on. So the theory of that first kid. Can you help him avoid the next we heard from two different lawyers who not surprisingly had very different views on what the court said and I'm curious if if that's for you to try to help clarify or if we should invite Patrick to the table if that's not really appropriate to just have some questions about what the judge's statement did did not say I think you can learn their certain questions. For example the question about a rear yard and a and a combined lot development or Not. Goodbye lot development development like those who are there multiple? Properties in different zones. I cannot actually answer off of the top of my head that is true that single family houses have a beer yard quiet. I'm not sure how that would be affected by the unified development site here. If you have questions about what the judge directed I think we could ask Patrick that it probably would also be fair to ask the appellants and applicants attorneys. If they agree with Patrick's interpretation of the judge's order, I would be interested in that, if that's okay with you all. I'm specifically there was a pepper. Do you mind coming to the table the the comment that I heard was? What are the when are the judge would allow Option 1 or is already spoken that option one before us Woods nitrification that the judge is already said that option one is not what he would like he or she would like to see I heard the applicant say the opposite. Can you tell us what you see in the judge's is Rheem and what they said about and how that might speak to Option 1 or option 2. Sure Patrick Downs with the city of Superior Court going to give you a summary of what I hurting during the judges oral ruling and then what was remanded the judge has no concerns that three was part of this site and there was a single family home as part of this project. That's crystal clear in my mind was also crystal clear in my mind is the judge had a primary concern. The backyard of 3 was preserved in perpetuity. And what? Came through the initial order and then the revised order is to lay it out for you folks and the council as a whole to determine should you stagger back a portion of a building or preserve the backyard of three in perpetuity. That was that's that's the takeaway for me. So I appreciate that helps I will respect that different attorneys may have different views on that. I don't know we heard his if I understood correctly was if we choose option 1 this will be back in court, which is somewhat right choose option to the project is not feasible moving forward. So anyways colleagues Based on my conversations. I haven't talked to Patrick before but with keto and I think with the advice of Patrick, my understanding is is what Patrick said in my inclination would be to move forward with option 1 and essentially Preserve in perpetuity the the open space on Lock 3 similar to a didn't lot too and to achieve what I understand the judges objective from King County. Superior Court is 2,000 mechanism, but I'd be curious to hear what you all think. so one of the things that I heard from the applicant is that if we didn't support option one that they would prefer that we order the Building in lot 3 to be removed and then look at that preservation of open space and because then apparently by removing the house the the issue of there being a real a real lot behind a single-family home doesn't exist anymore. So for me, I question whether or not it makes sense going down that road with if the if the results the same if the result is the same that you're still preserving it seems like the the appellants argument is is just based on the fact that there is a structure on light 3 and that whether if there wasn't a structure on lot 3 there would be no problem because there wouldn't be a requirement for a rear lat and so it to me it seems like a Nation without a difference and I don't know that it would be in our interest to order the removal of the building on on light 3 to just come back with the same outcome if that makes sense. I mean for me when I look at this to the extent that there is no harm or damage being done by the the lack of setbacks. If you will unlock one would be to someone who might live in lot 3 now the people who own lot 3 in lot one and it's all a single parcel that to me and clearly they're not saying that they're being harmed and whoever may choose to live in a building on lot 3 would know that that's the condition is not like they bought it under one condition and now it's changed and that's some sort of damaging to me to see you in the housing seems kind of silly. I imagine there's plenty people in the city that would love to live there despite their large building be in the backyard cuz it's better than not living in its structure. And so I hate to lose housing for that sake so I think it's pretty. Straight for tissue and understanding based on both the arguments and the review of these materials and Patrick's remarks that really it comes down to two issues based on the tree man from The Superior Court one is that there is a concern that even though the backyard the yard is could be sufficient in terms of that buffer in that tapering there is concern that it could be developed in the future because it's not preserved as open space in perpetuity. I see that as a potential technical error that should have been included in the in the Pud a but wasn't it clearly indicates that the fact that parcel to was in the p u d a in such a fashion is the president that I feel like I need in this case to to make a decision that option one is probably the best option in terms of making sure that that that open space is curved without the destruction of an existing housing unit Yeah, so there are maybe some technical things to keep in mind here. There is to effectuate the reason the council needs to pass our findings conclusion and decision document that probably some additional findings and conclusions that need to be made here the draft food up for option one sets out one potential additional finding which is that the rear yard of the 7010 Palatine Avenue North is susceptible essentially to the same kind of limitation as the particles of the south of it and there's a conclusion that supports that as well as supports the notion of a gradual transition between height and scale and the presence of a physical buffer and that is that the landscape to open space in the rear yard of the single-family lot at 7010 Palatine Ave North provides a physical open space buffer between land uses and allows for gradual transition between the height and scale of the neighborhood commercial Zone on the east side of the property and single-family Zone on the west side of the property. So essentially the Ready here in the council eventually, assuming that the committee that moves option one would be concluding that the essential 39.4 but 39-foot provided on light number three meets the directive on the rezone Criterion related to Transitions. Kiddle of a technical question on on this document they believe the applicants submitted today. It discusses removal of a walkway and a deck and I don't know if that's something that's One I guess his is is it something that's part of the record that we should be looking at or not? And if it's and then I guess my second question is is that are those removal of those proposals something that we need to contemplate or was that just something submitted? So it depends on what the council ultimately does, but in terms of this is essentially have here in the Alaska dividend paid his argument from the applicant about what they would do to meet the real and director from King County Superior Court. I miss you. So suggested that this would have to go back to stci. That's actually not on the council practice only sometimes I make amendments. I'm based on how Council decision making to country songs that have been proposed. I'm up front of the council. So what would what serve as a practical matter what I'm assuming that the council adopts option with chlamydia. Recommends option one here as a practical matter, what would happen would be that I would write a proper to use in development agreement there besides the prior one and includes an additional condition and some of those conditions would have to do with improving. I have to do is adopting and improving the landscape plan for parcel number 3 and that would be a directive essentially to ask you. See I said not to shoot a Massachusetts permit until my plans were changed to reflect that. God took my suggestion is no one. I know if I miss your folks correctly would be to go to prove option one and give direction to Quito to proceed is directed and her folks okay with that you'll help me with what I actually motion. Should I be making to give you that direction? I think if you would it, so if you were to move option one, I think you can to move that and provide some direction to me to drive to properties and development agreement and also a revised final decision which the council which type what you would substitute for Council on when this comes back to full Council if the applicant doesn't agree to any changes that the committee recommends I would not ask you to put a which case the reason would not proceed. But if they are willing to do that, then we would need to have a need to draft an ordinance that resembles the prior rezone ordinance and also accepts a new put on changing differential and you stop and then it'll remind me to will the before this comes a full Council. Will there be in agreement that the food is accepted or is it come to phone Council and then those discussions happened about the puta so their Ordnance except the property, and doesn't matter practice with that Council only accepts properties in Diwali rooms that have been executed by the applicant. So, I imagine this would take at least a couple weeks for you to drop it and have the back and forth until probably something that would be at for counseling early night. So we have a motion in second before us to to move forward with option one and get killed. Has keto so eloquently stated for the record. Is there any further discussion on this? One point related to the legislation that we passed earlier. We highlighted the need to have a discussion and some clarity around what a development light is. I just want a flag. That is something I'm still interested in and would love to learn more from sgci and Furniture working on it where we're at on that. Right. Now I think that tentatively is is an issue that I'm guilty up for the 2019 like you could Omnibus Bill and which should come to us sometime this summer. I'm unique set up witches wine recipe dinner up in court and there's been some comments today about the precedent setting or not. And I think there is some issues that there isn't clear that we could we could trust Pride some clarity movie part. So all in favor of approving the motion as strawberry keto to adopt option once and if I buy sang I I hosed understand it's okay. We will look forward to hearing from you. I will at the moment at least continue to be point on this likely will have a new chair the land use committee at some point, but I may just if it's okay with a new language Cherry pain over side of this at least for the purpose of discussion with colleagues. Just guns for continuity sake but I will bring whoever's new up to speed two and just have that discussion. Done with that. No one would you mind reading in agenda item number three agenda item three, but this is still a quasi-judicial matter. There's a decision to become before a council based on the comments from the appellants. It seems likely to remain and months to come home. So just as folks to continue to honor the doctrine of I forget what we're told otherwise and it's likely maybe sometime in ordinance related to monitoring and inspecting vacant buildings for compliance with the requirements of the housing and building maintenance code section 22.9 hundred f1010 of the Seattle municipal code and amending ordinance 1/2. 5704 and Ordnance 1257 to 7 to modify and monitoring fees and monitoring program requirements. So we do quick round of introductions cable framing Castle Central staff inspections to download you have any opening coming to want to make on this before you just jump into where we are at this isn't some ways a piece of plant housekeeping legislation. I can recite a little bit of the legislative history here and describe what the bill does. So for the benefit of those folks who may be watching and I think it was 2016 or 17 the council and then to the housing a building maintenance code to strengthen standards for maintaining a vacant buildings in that triggered an additional legislative process that culminated in some ways. I'm last year during budget and the council amended. I'm the requirements for securing vacant buildings to make I'm certain to make inspections mandatory in certain conditions so prior. To last November asked you see I had discretion to inspect vacant buildings for compliance with the standards for securing those buildings in unless last November the council passed on to 5727 that amended the vacant building monitoring program to make inspections mandatory for buildings, which have received three notices a violation for providing the requirements for securing vacant buildings that they're located on a lot for which eye development approval with side or if they were included on a list I maintained by the police and fire department of buildings that generated calls for dispatch and the council also amended the code to sort of salad with the criteria would be for coming off of the inspection list when buildings have been repaired and reoccupied and they've been inspected inspected for consecutive Times Are One initial inspection plus three subsequent inspections have been found to have no code violations or if they had got the permit to be demolished from the sale department construction inspections another cheap. Legislative history Harris at the council amended the 2019 proposed budget to a different position before you ask TCI and appropriation authority to implement this change in program scope. And I'm in the Cotswolds for deferred the effective date of of the regulatory ordinance that the council passed and change it to the fee ordinance to give sdci time to change administrative practices. I'm in anticipation of the change program. So the spell is in how many ways kind of a housekeeping Bell by the council intended to revisit some of the changes made back in November of it modifies fees for inspections for buildings found to meet the requirements of the code to better reflect the cost. STI making that inspection so increases that be slightly from $171 to $261. It allows for Billings to be enrolled after only one violation, If the violation is not remedied by the combined state established in the notice of violation wear if the first violation is remedied within the compliance. But a second violation occurs within one year from the date of the first violation and it also has buildings to no longer be enrolled in the program when there have been three as opposed to for inspections at consecutive inspection for that violations. I know some other clarifying amendments that were recommended by CCR that are reflected in the proposed bill. So that is my recap of the legislative history. Faith do you want to have anything you want to add or clarify or elaborate on for us about this last fall? And I feel very confident that these changes and with the work that we've done in the last several months to try to figure out how to restructure our program that will be able to seriously commit to this program and make most of it happened and the the one piece I just want to acknowledge for the council. Is that even with the three new inspectors and thank you very much for that. This program is designed to pay for those positions. So even with those inspections as the program first takes off it does call for a lot thousands and Sentence of monthly inspections. So we're going to have to work our way up to the full inspection routine and we will get there at may take us some months to really get to doing all of those inspections monthly and my recollection is that's one of the changes we made the change that I have some concerns about cuz it does give seci a lot of flexibility. I believe we removed the requirement for the monitoring spec inspections to be monthly and instead they have their there's a reference to them being sequential so sorry, but this is also something that I want to make sure that we're tracking so we can't call to monitoring program If it's 6 months. Of a monthly inspection is actually been removed from the legislation but it's something that we have to track very carefully. We are considering it's still a monthly inspection program and that's our goal so far as we look at how will we implemented? We we really want to do the monthly inspections and begin to see whether we're finding lots of those vacant buildings will fall off the monthly monitoring list and then we'll pick up new ones each month starting probably first with the new ones that are coming into the development process will also be managing complaints and last year again complaints continue to go up perhaps this year. They'll go down with more active monitoring. So we'll we'll find out and we are planning to be able to report back to you early in 2020 with our experiences. How many inspections are we? How to complete what's the record for people paying their monitoring fees and sewing and one other point I want to make for the viewing public whereas it might read as if a change in the ordinance for an enrollment trigger going from what was previously said three violations to one violation that might look like a big change but that was a change that was made because you Faith clarified with your business practices work, which is that if you went back after a previous violation, there would not be in another violation issues the the cases just merely left open. And so we do require in the ordinance that either there's not compliance with the first violation or if there is compliance after the first violation and you keep the case open you return two times. Within one year of of the day of the violation. So you're you're correct. We took to save what is still unfortunately a good deal of paperwork with reissuing notices a violation typically will issue one and if we need to keep that open and work under that one, we do plan to be back. We hope monthly but at least within you know, maybe a 60-day turnaround time for some of those follow up inspections is a is a body of work out there that will need to come under this if we passed this and so and the hope would be that through the work we do that a bunch of those properties will come off the list because they'll be compliant and then going forward as we have the normal development flow. It'll probably be over be easier with existing folks. Could get through that work on a regular basis, but the you know, the big wave of stuff is going to come through you just asking for some flexibility and recognition that would be a little patient there exactly thousands and thousands of inspection that it would imply to me that there are over a thousand vacant buildings right now. Well, we know that we have over a thousand demolition permits not all the demolition permit structures are vacant today, but they're going to be bacon before that demolition happens and we know that most of the problem vacant buildings tend to be vacant buildings that are in the development process. So There are if we're doing monthly inspections on those plus another maybe 400 inspections a year from complaints with monthly inspections that is thousands of inspections as we move forward. Can I just make one more addition as it relates specifically the question that you raised there is and I just want to highlight this because I think it's one of our objectives of this ordinance is to reduce the number of buildings that are habitable in the development process and bake it we want to incentivize developers to keep those buildings occupied. And so there is language in the ordinance that we previously passed that allows for an exemption for the monitoring program. If the developer participates with an organization that place has a caretaker in in the in the residence we've heard from an organization called weld that works with Folks who have recently been released from the criminal justice system. And that is one such program that is is functioning and has relationships with over a dozen developers in town and is working on doing that so that hopefully will provide some more of an incentive we hope so I appreciate this is like weld welding particulars really seems to be doing some amazing work and it seems to me like this is a win-win-win. I I I can appreciate how a developer who is trying to achieve kind of timing certainty in a world where their permits are take a long time and I don't know when they're going to get but as soon as they get it, they likely would want to begin construction and the process of removing tenants from a property can be time-consuming. My understanding is is once the long-term tenants have been removed. We provide flexibility on a short-term by working with welder other mechanisms to have tenants in there temporarily. They could be mood with the you know, they move in with the understanding that at some point with very short notice. This will go away and I'm truly sorry seeing more more developers walked into that or do they not really understand that or is it just not part of their business plan or I don't know that I can really answer that. I do think more and more developers are in touch with weld I know weld has made a lot of direct contact with the development Community. I I know Mary's place has done it, but they tend to work on the larger commercial projects in the hood. Lots of people into structures. So we at STC I have a monthly meeting with the Master Builders Group, so I'll be speaking with them in May about the startup of this vacant building. Monitoring program in June and we'll be trying to highlight some of the options that they have. It is a long-standing practice that for a developer who's gone through or started the tenant relocation process that is long as they are taking care of their existing tenants. If some of those people move out new tenants can move in and be informed that they may have to move out as soon as the permits are issued. So that's a long-standing practice but it is true developers really aren't landlords and until there is something that really gets their attention and I'm monthly monitoring fee may get their attention. We we we don't see a lot of people doing that on the projects we do we do. Exemption as well as Weld and I know that they're well themselves are doing a lot with Master Builders to develop relationships as pretty high-level because we want to know the circumstances before we say you can absolutely do this, but it says you no talk to his do you want to work with in relocation? Do you want to work with a non-profit? What's a caretaker that kind of stuff? Well, I hope that I appreciate the Outreach work if you are doing and continuing to do and I appreciate well doesn't have to go out and talk to him after Builders and other to make sure they were the program is anything we can do to uplift that and really create a known incentive structure to direct those two that I obviously if a building is uninhabitable then however, we can streamline no demolition just to remove that kind of Hazard is great. But so many buildings are habitable and there's so many people in our community who really could use some housing even for you know, a few months of the transition. And so I know the developers are not landlords, they're probably also not putting up plywood on a regular basis. They're not me. And like I know can be a real hassle for them and in cursive any costs, and so hopefully we'll see more and more than choosing this program and continue to support welder other organizations. Initial discussion on this appreciate the work to to amend is to bring back these changes to it now. I'm just trying to find my schedule so I can move it. I was going to move Council Bill 11949 7th Council on Monday. Call you thank you so much for doing this so much fun to Beach and land use committee. I want a farewell speech by last time.", "end_time": 5928.4}]}