{"format": "raw", "annotations": [], "confidence": 0.926234374123235, "data": [{"start_time": 0, "text": "Good afternoon, everybody. Welcome to the stable and transportation committee. My name is Mike O'Brien and chair the committee. It is a 2:02 p.m. On a Tuesday May 21st, really quickly. Today's agenda joined by my colleague council members want thank you for being here and stop by Kyrie 4. Thank you for being here to Advisory Board went to the Seattle Transit Advisory Board. Then we'll consider an ordinance the possible vote on authorizing acceptance of funding for grants for the Department of Transportation. We will hear of Titian for a vacation last week vacation adjacent to the burke-gilman trail near University Village. We will also take up an ordinance accepting a final Street vacation for Block 19, which is the the block of one of Amazon's projects in the Denny, Triangle. We will also look to Norton's to extend the permit for a sky bridge in South Lake Union. And then we have a series of ordinances accepting accepting Deeds for I believe it's over a hundred Parcels in five separate orders. It says so on that would be exciting to amend the agenda to add a chairs report to the agenda. I would do that right after public smut. That's okay. We need to do that now apparently so all in favor of amending the agenda. Favorite thing about tonight. So we will approve the agenda as a favor. I'm not sure if we can just say unless I hear anything. I'll prove it then we'll figure that out as we went through. We have some new rules here at city council. We just have one person sign up Miss Richard. yesterday Yep, it's on now. Good day everyone. I am a person that takes Transportation through the bus but by the time I get here, I'm a nervous wreck because oftentimes the buses are not compatible for us. So I come down here and it's kind of like the bully pulpit. They're the boys and I think she even children in school or not supposed to be bullied bullying is supposed to be against the law. So I come down here. I've lived here all my life. I've never seen this type of treachery and trees in all this the racism in all the filth that have come out of discrimination is all displayed down here. In these Chambers and I have spoken consistently against it. I've done exactly what I'm supposed to do by law to address it. Okay, cuz I'm a human being God gave me this voice to speak and I will use it. So back in the sixties. We used to get like a pope and even in slavery for just even having anything to say to address anything that was going wrong with us. I'm talking about black people in their communities in their homes and in society. That's why you see another person coming down here. Now. They trying to criminally insult our integrity and call it a criminal sanction because they are against the wall like that man with his hands folded doesn't have enough power to shoot us down. And so I'm still going to keep addressing it. Until the Lord says different because he's the one that directs me and guides me and instruct me in the way that I should go and I don't understand this mess up in here and I keep speaking about me not understanding this mess up in here and don't you know how to hold these people in the city. They don't know how to come to me and say we'll miss Richard. This is how it's done. They're taking your free speech and don't you let them do that to you because that's what they've been doing. Thank you. That's all I signed up today. Is there anyone else the audience would like to provide public comment? All right. See none will go ahead and close public comment and all invite presenters forward for agenda item number one. Oh, yeah chairs report. Thank you. Hang on a minute for Zehnder's. I wanted to take a minute to highlight a concern I have about bike safety might have some incidents that happened last week. And so I asked Kelly to tee up a video that someone sent in from 35th Avenue Northeast and ask ask you to play that second Kelly. I just recently redone Road Project. This is supposed to be meeting our complete streets policy. And this is a helmet cam on a bicyclist coming in and I've been a bike Commuter for 20 years and so I put up with a lot of stuff. But trying to encourage new people to put on their bike and come to work with folks passing at high speeds in a center turn lane. It's not designed for passing and like that. and not room for bike on the lane to to me this looks terrifying and certainly would not be what I would be implementing if if my goal is to Triple the number of cyclists in our community in line with our both our transportation plans and specifically our climate action plan and so on top of this I understand that there was a collision last week for a cyclist was taken to the hospital by ambulance don't have much in the way of details on that Usher will get But I'm interested in sending a letter to the Department of Transportation to ask him to comment on this video experience and the overall implementation of vision zero and complete streets on 35th Avenue Northeast. I specifically want understand when they announced that they were not going to put up directed by clan on there instead of putting a center turn lane. They made some claims that they thought that would be safer for cyclists in the current situation. And when I look at this guy's not what I see you until I want to ask one when they look at this are they saying this is what safety looks like for cyclist. If it's not that we made a mistake. I'm curious the two things one is how did we make a mistake so late in the game on something like this and to what can we do to correct that mistake? We have a strong commitment to Vision zero, which would be Eliminate all serious injuries and fatalities for any road user and Gwen just a short time after this work. We already have a serious injury and that video experience which I don't think is unique is really unfortunate. I'm customer smart. Yes. Thank you for including this and you guys tomorrow bro Brian at that is I did watch it. It's pretty scary. I don't think that that videos and anyway. Supporting the claim that the center the decentraland would have made things safer and I do but I want to go back and look at the press release that came out from the mayor's office in my recollection. They did make that claim and I know you're concerned about it. And also I support the questioning of the Department of Transportation as to what they think about this and and if they if they agree that this is not something that is promoted safety then what would they do instead? If you're if you're interested I'd be happy to the shared drive to the letter a in light of this. I'm also trying to think through policies that we should be implementing so that first we need to understand if if if they think this actually is a safe project and how that say. Being talked to you that that we really need to up our game if we want to achieve our goal of vision zero in our climate goals, and this does not feel like that was consistent with him. With the abandoning of the 35th Avenue bike lane was so they could just brought the light that we cannot have a city hall that talks about Vision zero without actually following through on concrete aspects of how we going to achieve Vision zero in every single project that is expanding bike Lanes expanding the fees for pedestrians to be going around the city of every single concrete project matters because without that Vision zero is a Snapdragon ocean. Alright, thank you for reminding me about my charger port. Thank you for participating that and now we'll move on to agenda and number one and I'll invite for the most part 5 to appointment of Paul Sherman as a member of the sweetened beverage tax Advisory board for turn to August 31st 2021. Once you get seated, I'll have you start by just doing a quick introduction the name of the first sure. I'm at the Espy a nominee for the board. Tell us a little bit about with Advisory Board does. I need to talk about Paul if you want, but we will certainly ask multiple questions. For having us here today. I'm also filling in for Bridget I go she's also with the office of sustainability and environment and she's fast the sweetened beverage tax Community Advisory Board text me in Advisory Board was established by the same ordinance that created the beverage tax and the role of the board is to develop recommendations for the mayor and for City Council on programs and services. That should be supported by the beverage tax revenues these programs and services must align with the ordinance and are there two benefits Seattle populations that experience the greatest health and education and equities according to the ordinance the board shall consist of 11 Representatives who are residents of the city of Seattle or that work within the boundaries of the city of Seattle. So today, we're here for the confirmation hearing of dr. Paul Sherman for one of the board seats that's been reserved for an expert in public health. So if you don't mind, I'll go ahead and interrupt but doctor Sherman as the chief medical officer at Community Health Plan of Washington. It's Washington's only local not-for-profit Medicaid and Medicare managed-care plan prior to joining the community health plan of Washington. Dr. Sherman worked at Kaiser Permanente of Washington. Where is responsible for Statewide for the Statewide care delivery system and oversaw 1200 employed clinicians. He is a seasoned physician and began his career in Pediatrics and a servant of variety of boards throughout his career including Group Health Community Foundation board and board of Washington Health Alliance. So I will turn it over to the committee for discussion questions. Civically you're interested in spending volunteer time on this board. So why it's important to write. Thank you for having me. He went into Pediatrics 30 years ago with the goal of working on the health of the Pediatric population and through my time at Group Health had various roles bedroom is always looking for opportunities to address Health inequity and improve the health of our population and that is continued now that I've moved to Community Health Plan of Washington where we as long as as well as so many people in the community are paying more attention to the social determinants of health and how we can work on those to improve the health of the community to serve the most marginalized and also his pediatrician. I have always had a big interest in Education so that the two specific Foci of this committee to to decrease health and education equities as really appealing one of the things that is critical for me in the board and frankly the the policy around creating a tax on sweetened beverage has its a complex complex policy issues coordinate in large part because of what I heard directly from the communities that are most impact is most impacted by excess consumption of sweetened beverages. Their the communities are targeted with the certain marketing materials or in a way that they're don't have access to healthy alternatives either Financial access or Geographic access because of the limitations of where they live. I'm in the end of the negative Health outcomes to come from drinking, you know, too many sugary beverages the concern I had is that that attacks that would be regressive are disproportionately fall on lower-income and communities of color because those are the very communities they're consuming the beverage disproportionately. It was critically important in the design of this that would hurt from public health officials was we both need to have tools to discourage the use of these products that are causing bad Health outcomes, and we need tools to invest in healthy are healthy options. And so I got to a place where I was comfortable with attacks. It was going to be disproportional with the understanding that we would invest those tax dollars directly back into those communities and with the kind of leadership and guidance from those community members on what the best investments were. Obviously, there's a lot of great needs in our community a lot of needs that I support. Broadly, certainly around housing and homelessness for a talk about Transportation needs later today. Those are all very good things that we have finite resource for resources for we need to find a way to invest but I personally believe it's inappropriate to take these tax dollars that disproportionately are falling on lower-income communities and fees are hard to use those to me are brought her needs. We want to keep those nearly Taylor and so that's something that I will continue to look at and really have looked to the the committee work. Pointing YouTube for the guidance on where those. I should go. We're also working on working on the budget this fall. I'm working on some bunch of language in anticipation of the budget coming to make it even more clear on the win. The mayor's hands over her budget that my expectation at least is that whatever revenues were collecting from this need to go directly back in those communities. I don't know if in your experience if how much tax policy do but imagine some thoughts on that beat. Wholeheartedly support everything you just said, I would say that the one thing I wish actually is that the tax was bringing him less Revenue because it was having more of an impact on Behavior really glad that will push as much as I can to keep the funds flowing to where they need to go to to effect does inequities and I'm with another thing that attracted me to the committee was at their the board was that the charter was so explicit about evaluating on what was going on and if we were being effective with the with the legislation and with the the dollars that really appeals to the scientist in me, and I also appreciate that and we've had some good kind of preliminary reports from the committee and look forward to getting more information from the committee and I believe research books at the University of Washington. Call exam any questions for Doctor addicts. I detest regressive taxes in general. We are in a city with the most regressive tax system in the entire nation. Unfortunately, we are also sitting in the wake of the Amazon tax repeal. And so I like you said I also wanted because some of the community members who had fought for their didn't like some of the aspects that ended up appearing in it. But here we are and so I really like to share the dub member of The Advisory Board and I know you are truly committed to making sure that now that the taxes in place to make sure that we actually use it in service of the community. set it is meant to serve not as a revenue collection set of tools because it's not and and at that time there were a lot of people who are you also using the term send tax, which is really anti-poison and type for terminology, and I and I'm glad that we were not doing that anymore and really seeing this film and equity lines. Thank you for months, and so just a little greater sense, but really just I'm what I'm really keen on seeing as someone who's really really invest in trying to make sure that they intended outcomes are going back into communities to a disproportionately impact in so, thank you. Well, we're excited for you to join. I really miss there's a lot of pressure on this group to do this right in terms of making smart Investments. I have a ton of faith in you and your colleagues on the committee. Cuz a lot of really impressive folks. There is also, you know, hopefully we can manage this of the money starts to diminished significantly cuz that would be the ultimate goal, but there will also be a lot of budgetary pressure on that and I really invite you and other committee members to to speak truthfully to all the elected officials on what you would like us to do and we will do our best to something else. I'll go ahead and move appointment with 01352. Controversy of everything. I personally thank you so much for your service this weekend before the full Council and I mean next week, which is on Tuesday cuz I Memorial Day so we will make it official then. I appreciate you taking the time out of your day to come down here and be part of this and thanks for Commitment Community. Thank you. Thank you. Play would you read I did not remember to it. All right. We have appointment 01353 appointment of Bryce Kolton as a member of the Seattle Transit Advisory board for a term to August 2nd 2020. Welcome, I think you just to let you know I'm getting over an illness. So I'm very sorry for my bad Batman impersonation. That's a good sound and I don't Lego figures out. I will start playing just wait until I start laughing and sleep. The Wheezy toy from Toy Story start with ya. So, my name is Bryce Kolton. I'm a Capitol Hill resident. I've been in the Seattle area my entire life born and raised. I currently work at Mercedes-Benz research and development North America sort of along the Waterfront sort of startup area back by Mercedes-Benz and working on through technical aspects of deploying applications two cars. I am a bicyclist. I don't own a car used by see it pretty much everywhere. Those are pretty much for my values lie, when it comes to the urban form. I got into sort of the urban planning aspect and transportation things after taking a small class in college and since then have volunteered with like Seattle Transit Seattle Subway the urbanist in the Seattle Transit blog a little bit. So it's it's an honor to be here before. Today, thank you very much the record Usher. So the transit Advisory Board is relatively new formed by the council in 2015. It's it's charged with advising s. The City Metro Sound Transit on issues relating to transit in the city. It also has a role that's called apps to do oversight of the Seattle Transportation benefit District funding that was approved by voters in November 2014 to help the city fund extra Metro service Advisory board has 12 numbers 6 appointed by the mayor of Five Point by Council which prices one and also I get engaged member. We recently had a resignation of one of the original board members. So we had at this vacancy in price had applied last year when we had an open call for appointments at that time. You still interested in able to serve so he's here with you today. Embrace had a chance to see you in the community few times and appreciate your passion for this sounds like you got a fascinating job about new technology and transportation. We see those things pop up publicly every once in a while we struggle with those and how they integrate them, but it's great that people are thinking about that. What are the big thing is the transit Advisory Board is the the public kind of Steward of the Penn Station benefit District those funds this or that initial. Call measure will expire at the end of next year generates. Probably close to fifty million dollars a year right now about 40 million of that's going to buy additional Transit need to figure out what we're going to do a quick because of the idea of living without that I know if you have any thoughts on the transportation benefit District or any of those other things you want to share with us a bit of talk about trying to go back to the county. If you get this is the same boat that was done after the county rejected the previous Bill O'Reilly prank many years ago. Yeah, I wasn't directly in politics. And so I don't remember much about that. But I seen rumors that King County is a whole may be more amenable since the passage of Sound Transit 3 was a success in King County. We may be able to hopefully go to the county level and get more of a cohesive structure are two possible. I believe the way the timelines workout is we could go to the county and if they don't actually approve it, we could throw something on the ballot for spring with in the Seattle area only would it be really nice to have the Tony kick in together so that we can more integrally tie the Regent together with Transportation Solutions. And one of the challenges is Seattle being vetted the densest part of the city tends to be the most supportive of Transit Investments. And as you get further and further from the core the top political sport falls off a bit and we do need a regional solution. I was a beehive Sound Transit 3 is the three County Regional solution. We have King County Metro is a bus Regional solution County Wide. And so how do we get is my service for everyone but also recognize the people in the city are willing to pay more for even a higher level of service and that's not a balancing act it hopefully we can walk in the coming months, but it's something that I imagine the commission will be weighing in on Call me if you have any questions for rice. official thank you for being willing to serve on the board and I used to live on Capitol Hill myself a few years ago and they depended on public transit for several years and there are a lot of people who do that still but I also hear from a lot of people and also my personal experience is that there are many community members who would like to in Downey depend on Transit but aren't able to because it just simply is not just given the given the current Density of the network and frequency simply aren't able to get about their day in a realistic Manner and will often use Transit but aren't able to do that on a regular basis is expected for get get to work. Let me know what's a recent article that reported statistics about how despite their traffic snarls. If you are in your car you the average time you take to get to and from work that is neither from survey respondent survey respondent setting is lower. When you drive your car then with the bus because the buses themselves are not efficient, but because the combination of the traffic on the road and also just not having enough enough of just widely spread network of routes and everything it doesn't help so it doesn't help people make that sodas bad decision due to do it. What do you what do you see yourself? And also, how can the boat? You know play a role in really advocating for a major expansion of public transit. I did I think there's no doubt in our minds and they shouldn't be based on everything. We know statistically the Seattle has the majority of them love their public transit it is there's no question about that. Look at the commitment people show during the cabinet over the decades, even those overall funding actually hasn't kept up in the world actually cut there still an over-reliance on regressive taxes still ridership us going up steadily over time. So sorry, I'm sorry. It's a long way to question but given all of this context. How do you see The Advisory Board in your own role in advocating for Progressive revenues to really just that do a major expansion of public transit. And also what are your views on making it free? So the point to point It's so even if someone who believes that the transit is going to be the necessary backbone, but successful transportation system. It's still foolish to say that cars or autonomous vehicles or whatever. They look like in the future are not going to be part of the solution. They may play a larger or smaller role but they're definitely not going away. They're just a tool in the toolbox more or less when it comes to advocating on the transit Advisory Board. I believe that there is going to be a lot of networking responsibilities on the board really trying to build consensus behind sort of a countywide transportation benefit District Vote or work with community members to try to make sure that when we vote on something like move Seattle independent neighborhoods don't start striking down the overall will of the voters. And I'm sorry, I forgot the the last question. I'm not sorry. I'm certain I'm not the only one about actually making Transit free and also ending the penalties for yep. Exactly. Yeah, I can say that I support a name penalties for fare evasion doesn't make much sense and it just punish his community members that are already at a disadvantage when it comes to Progressive Revenue sources. I definitely support that how we get there. I don't know. I'm not allowed viest and I'm certainly you know, hahaha, it's good. You're not allowed. So yeah, unfortunately, I can't give a specific idea of how I would do that. But if the opportunity presents itself, I will be sure to support a more Progressive Revenue Source then what were using currently Thank you. Bryce first, thank you for being Asian in the process and willing to serve card free myself. So I appreciate you being car for yourself, Bryant's and said before just how do we get more young people involved and really good, call the action. So I see your your your resume and your involvement bull the day she died in a being involved and staying involved. So please just want to be encouraging cuz I can be I want to just ask about your position stands on scooters. How do you say that? But I'm just playing into your car free lifestyle. My brother's yeah. I have a relatively informed opinion so far. I haven't looked at study guide and I haven't looked at 6. So anything in that I'm going to voice right now the unfortunately someone informed but if I would have forced to take a stab at it, I would say scooters can largely be used in much the same way as the bicycle. They have much of the same speed limits. They can use much of the same infrastructure. You're going to go somewhere speeds. And so I believe that scooters can be part of the successful Last Mile problem getting people to and from transit stations. They sort live right on the edge of what could be a successful location many my coworker. Is it live sort of like near one of the express commuter routes up in like Millcreek area, right and if they had an electric scooter, they would cut down a 15 or 20 minute walk till I tried so encouraging that type of safe roll out where people of all ages can Street successfully and safely and hitting that Vision zero Target while also decreasing the Reliance on fossil fuel vehicles one weight being those scooters is definitely in line with my values and what I think we should be working towards the city. I believe we've seen fairly successful roll out and sister cities like Portland and across the rest of the nation. I think we can look to what worked and what didn't their work in those locations in order to inform a decision here. And then just lastly I saw that you speak Spanish and Mandarin as well. I hope that you can use your skill sets to encourage recruit as vacancies come up to recruit from communities that might be reflected that speak those languages as well or multilingual broken, but my Spanish is all right. precious well, thank you so much by Ace Frehley despite your Batman voice today. I can tell your passion and commitment to thoughtful analysis of Transportation issues and look forward to having you on the transit Advisory board. So thanks for serving. Nothing else. I'll go ahead and move it to make you very much last week. And if you want to just read the short title and up to the first semicolon, I believe is how we do that. All right. We have ten Council Bill 11951 to an ordinance relating to the city's 2019 budget authorizing acceptance of funding from non City sources. Great. Thank you so much. I will start with introductions Calvin Calvin Calvin Council Central staff at us. She would like to take this off while I think I'll turn over pretty quickly. But I just know it at the beginning that a lot of this is very technical in nature in terms of budget revisions. Not necessary policy-related. They are largely grad acceptance and budget changes that are necessary to in inaction agreement that we have with the sound transit Washington Convention Center in others and I'll just fly colleagues. I have a small magnet. I'll be proposing at the end to broaden the acceptance in a to allow for the possibility that additional funding might come in the near future and just trying to streamline that so I'll talk about that attend the presentation. All right. Well, I want to thank you Calvin because you pretty much took care of her for slide there. So is Calvin indicated this is a relatively routine action that we're bringing forward to you today. This committee is familiar with a grant acceptance process for S. On an annual basis allowing us to formally receive grants or accept grants that we have been awarded and the applications to those grants were previously authorized by the council. So we're doing that today and in a few minutes Kristen will be going through that in a little bit more detail or also appropriating funds related to a previously executed funding agreements with both external funding partners and also City partners and then. Cases are reimbursements and then we're creating two new capital projects in our CIP for 2019. These last two actions are actions that normally the council would take up his What are the first quarter supplemental process but because the city elected not to do the Q on supplemental this year? We're bringing those actions combined with the grand septons to this committee today. Okay. So as I stated Christians going to go over at the state and federal grants Acceptance in just a moment or so. The total for that is 33.7 million dollars in some cases. We asked at the same time as acceptance. We asked for additional probation authority to spend the money is associated with those crayons when additional preparation Authority is needed. So part of the funding agreements that we're looking at additional in this ordinance are related to those 33.7 million dollars of acceptance, but not entirely obviously because the numbers don't match. So if you look at the funding agreements, we have a total of 16.2 million dollars from a variety of different partners for projects that you're already familiar with. And then we're adding two new CIP projects one for the Sound Transit benefit District, which you already spoke of, excuse me, Seattle Transit, which you already spoke of previously and then also for the north of downtown Mobility action plan. Set the details for those are in the ordinance in also in the fiscal and summary note. If you have questions be happy to take them now or offline, but Chris was going to walk through the grants. Yeah, so we're accepting a total of 12 grants from a number of state and federal sources there listed on the slide and also in your packets everything from some safe routes to school projects with Crossing improvements all the way up to funding for some of our brt corridors on their number two different grants for the East Marginal Way project and then a couple of funding infusions from FTA forever to fix guide way for the monorail in for the South Lake Union streetcar. Those are I'm a type of grand that comes to US based on the amount of service on the amount of mileage that we have on those instead Serta Grand sort of not but it's the way that we can have some maintenance funding for those services. Okay. Well that is in a nutshell. What's this ordinance is all about I believe council member O'Brien you had an amendment that you wanted to put forward the sale Department transportation does a great work on going to Regional Federal Transportation project. So appreciate the whole team that's constantly keep an eye out for opportunities to get a kind of matching funding from other organizations and appreciate you were to design projects. Frankly that both are consistent with our values and goals here the city that the score well on this level and end alarm if you want to see that's what's about the entire region but always pleased It soundtrack. Does that are competitive so that's great. One of the opportunities we have is this a couple pieces of it up there the transportation Improvement board in the FHA design and construction of the East Marginal Way by tivity I believe. Is an opportunity to there's a major project on East Marginal Way, this is essentially between the Spokane Street Bridge West Seattle Bridge and the King of the South in the Pioneer Square. The road itself is in pretty poor shape. It's part of the Heavy Haul Corridor, which is my understanding is a series of roads that are designed to a much higher standard so that the heavier trucks from the port facilities, I think with different chassis without doing damage to the road, but that that facility needs a complete rebuild which is a significant investment. It's also a major by Corridor because of its location for my Seattle not because of the friendliness towards bikes. It is a very when we showed earlier the graphic of Viking on 35th probably will be rated X to show biking on East Marginal Way some days. It's just feel like chaotic Street and there's a lot of a professional drivers, but they're in big rigs and then Bicyclists and then also regular people and vehicles trying to navigate down there and it's so it's really chaotic and can be terrifying times. My understanding was that project into phases in some of the money received from Grants to do the bike money needs to be invested. It relatively soon. Where is some of the money we have for the roadway project. We don't have we're still missing how much money is watching do some more fundraising to get fat on are we having a longer time line to do that? That is a way to Stage this work and there's another product of set of investment money that would come from potentially from the Puget Sound Regional Council. We're on the contingent West to this project didn't quite get funded but it's if some of the other projects don't need all the money or can't happen in this time. I believe Seattle would be the next this project would be the next one to get funding. So in anticipation that something might happen and in most years something does happen to free that up. I would like to amend this to also approve kind of a contingent receipt of this so that if that money comes through You don't need to come back here and you can actually get working on this right away cuz we'd love to see that project happen as soon as possible. So we have in front of you is what's title amendment number one and it simply has a couple has classes that talks about it and then add the section 7 which says the director of Seattle Department of Transportation is authorized to accept up to four million dollars of non city funding from the Puget Sound Regional Council for the East Marginal Way Heavy Haul project contingent upon receipt of final award for the Puget Sound Regional Council the funds would receive Shelby deposit deposited in the transportation fund. And then the number is 13000 which I assume is what general ledger codes of sorts, but that's that's definitely above my paygrade to figure that out. So I trust you on that one Calvin count as reading else that I missed on the description of that. Your colleagues if you're okay with this, I would like to move amendment number 1 to council Bill 11951 to write. Okay any other questions or comments on the now amended bill? Hearing none. Why don't we go ahead and I'll go ahead and move Council Bill 11951 to is amended. On-site Pursuit of Happiness and I thank you work on this keep bringing it back to us. All the time does council affect. Nothing comes through we protect our time. I hear that first day of the transportation policy board. all right, tell you when I read the short version of agenda and never for CF 3140 Petition of the Trinity Trailside LLC for the vacation of a portion of Northeast 40th Street between 24th Avenue Northeast and Perkiomen Trail sitting down in front of me. I got to see all these faces come around unless you mind starting the introductions fish with sand castle Central staff site Workshop Landscape Architects in Seattle Parks and Recreation list. You want to pick us off and we haven't been arrested a sure this item in the next item are both relate to the street vacations. Just as a reminder under state law property owners have the right to petition the city to acquire a street right right of way of fighting their property. This petition was filed before we updated the street vacation policies last year. So it has gone through a significant review by City departments in the design commission to look and make sure that it addresses his goals for circulation and access Protection of utilities light are open space in views and 90's policies under the previous vacation policies on site public benefits are preferred and you'll see that that's what's provided under this petition. We're still in a bit of a transition. What was it over a year ago about a year ago and specifically have those projects come to the city council least a little bit earlier in the processing and also the Divine commission but these some of these projects are multiple years will continue to probably hear a few more of these that that were in under the deadline but things were in the straddle. That look forward to hearing this The Authority that the city council has and also reference so, well the state has delegated authority to city council so they make every decision however large or small but they didn't establish criteria. So what we use to review vacations is the adopted Street vacation policies and his leash noted. They were revised last May so we're just moving into the the new policies. F. Has been asked to administer the program for the city council. So it's our job to go through the policies analyze the project and we'll talk about some of the procedural review as well as particularly with a design commission. And then we bring forward our recommendation state law requires that a public hearing be held before the city council can make a decision. So after we do the presentation today there at this was noted as a public hearing as well and we're very happy to be here today because this project was long and coming. I think this may be the very last project you'll see under the old policies and is a project was interested in addressing density. They wanted to provide more housing on-site and began work with a contract rezone. And so that means the project is quasi-judicial. We don't finish that and we don't bring forward their recommendation on the vacation until the The judicial action has been completed. And in this case the council finished its work on the mandatory housing before the contract rezone. So this project now drop the contract rezone and it is compliance with the new housing regulations in order to achieve the density and will be on paying into the image a fun. So now that that work is completed. I were able to bring the vacation recommendation forward so we have been working on this for a while. So we are ready to be here and I think they're ready to start with the student housing. So I think with that as background we were going to have a mark go through the project and then we want to hear from parks department and Michael on the design commission review and then at the very end. I did want to make a couple comments about the conditions related to work with MSP you and parks on other permitting. So I think we were just going to jump. To where it's at. So you can see what we're looking at greats. We've got a brief slide show up on screen will give you a little background and talk about our vacation no vacation Alternatives as we do then jump into that the public benefits and then with the Matrix at the end. So this property is about two and a half acres. We are proposing to vacate a section of Northeast 48th Street. It's a dead end street that terminates at the burke-gilman is really today used to serve just a small collection of apartment buildings three-story apartment buildings. It was almost like a little private street. It's located in the University District area neighborhood just off of 25th, and it's a looping road that it sits on. So again, it's almost feels like a bit of a private domain that is not connected into the street grid neighbor to the South is University of Washington. To do East is University Village and then we get into some commercial properties to the north. And of course the burg up on the west side. So is the view of the property you see the existing buildings that can a collection of three to four storage walk-up apartment buildings. And again, you can get a sense of the the looping Road there off of 25th arterial and then just off the pace of the left is the motor pool site for the University of Washington. And then another set of images taken from the Burke using the bottom or north and south. One thing I want to point out here is there is a connection up in the neighborhood upslope. And so there was that we did have communication with Community about it having connections across the Burke and into the commercial District along 25th Avenue. So we did reach out. I was grabbed great Fortune is sitting on the street vacation committee. So cancel my bro Brian. I did bring that to our clients early and it is very effective. This neighborhood doesn't have a super strong identity. You mean with residential we actually reached out to Ravenna Bryant Community Association and there was a subset called Ravenna Springs that we did actually meet with serve on several occasions. So we took the opportunity with Cascade Bicycle Club Kelsey measure when she was with the club is Advocate and then he first as well in feet first at the time didn't have to have it executive director. So we use one of their Committee Member so there was a really involved to discover where we might go with public benefits and you'll see that in a moment. We also met with the parks with chip here to my left and spu time and then green Seattle partnership on Fortera relative to some restoration improvements in and of course our neighbors University of Washington Christian Kenny the landscape architect. And with the university in a neighboring development CU star our Gracie Grace star in any Village. So the vacation no vacation Realtors up on screen. The main thing I want to point out here is the connection for the neighborhood the existing connection that uses Northeast 48th is exist. It is not accessible connection. It is somewhat circuitous in our proposal was firmly based on being able to shift the mass of the project to the north with the vacation of the street, which gives you you can see on the screen that direct connection to 25th. It also works in tandem with University Village's new parking garage. It's going in they are improving the intersectional see that in a moment. So there's a direct safe signal connection to the nearest University Village Inn 25th Avenue in particular has Transit. This is the proposal. This is where we are today, and I'm going to go through the benefits. But it before I do that one of things. I wanted to point out and Michael might want to chime in here. Is it in our work with design commission? It did there was a we went through to Urban Design Merit meetings, and there was concern with our no vacation proposal and where we put in our best foot forward. What did enables to do is not only prove out that the vacation alternative is better. We actually had a really good discussion about that open space you see on screen I would call a comment and this is a product of be able to shift a mass around getting the best aspect for what is essentially a public space. It is not a public benefit. We did not put that on the table, but it was an outcome of the public realm discussion with with some design Commission. Do you want to go back to Seattle for think this slide really hits on some of the concerns that were raised by the commission and I think without it without question. I think that the applicant was able to provide an in-depth analysis about the vacation and no vacation alternative really relative to the some of the fundamental issues at the commission looks at which are how are building siding massing the site plan opportunities for open space affected both by the vacation in the notification alternative and the work that they that the team did really helped develop a positive narrative that said if you're vacating that right of way you're able to shift the building up in a meaningful way that provides an open space connection that connects to the trail in a much more meaningful way than the existing right-of-way would have offered that you can see here that the right of way under the vacation alternative is kind of in the same place. North but you have that whip that the right-of-way offered before and you still have that view corridor the challenge there would have been grades the great changes are much more significant where the where 48th was the you wouldn't be able to access the trail in a meaningful way or cause significant challenges with Ada let alone accessibility for people using bikes or pads. So we actually there was a fairly rigorous Alternatives that we asked them to provide and it really helped the commission get to that fundamental question is which is if you take that right of way out of service. How is the plan and how are the public amenities that can potentially be developed protected in an enhanced in a more meaningful way then if the right-of-way was retained. 6 Ramona Street at Did this ever again. The vacation proposal there are three each story buildings at student housing and see you in this pop-up view you get an idea of the mass and we are again very conscious of pulling the mass for this to the north to give the daylight to access airlite views to the South into the public connection and is Michael mentioned it is it will seem like an extension of the right of way to get to the burke-gilman. So don't jump into the public benefits terrified of them. And here's the five. I'll start with the the direct connection. We just spoke of so we had to break for should never be able to work with another project was active in just ahead of us nursing University Village parking garage. There were improving the intersection of 25th 25th is not the most friend friendly Street to pedestrians. You know, it just thinking about the video you showed earlier will 25th is not great either and the neighborhood knows it. So this was a very important thing to them. In fact, they wanted us to think about the other intersection to we focus our energy where we knew we could accomplish the lot of getting across 25th and all the way over the burg very safely. So this first benefit is just that it's a 16 foot wide connection it is it if you don't find us on the Burke either, I mean you find some small connection we have to work on the one at Children's Hospital, which is a winding. It whines its way down in the Sand Point Way, it doesn't happen often. So this is a generous connection. It is a ramp. It is an eight percent does meet ADA requirements. So you do have a Landings are four of them are three of them that get you down the street grade and then we continue to work with us. On how you safely get across which is a very quiet street here at the corner of 24th and 47th. The bigger issue is probably the motor pool. There's an ebb and flow with the motor pool in the morning and afternoon, when all those vehicles are coming in and out. So there is a coordination. We determine that come across diagonally and anyway to see the moment is another benefit is a curbless street was the safest approach to this in addition to that and I'll get over in a moment. There is also a connection off site to get you all the way to the intersection. So this is the curbless street that we're proposing and the benefit part of this is not the frontage improvements. It's the other half of the street. So from the Centerline do East improving the entirety of the street when we proposes I still call the share you Street. We did not have that type ology. We're not get adopted by us. Now. There's a curbless street and it is a standard. So that was made it easier to adopt. So this is primarily a pedestrian oriented Street. We still have parallel parking but we have more landscape more generous sidewalks in really pedestrian controlled Street environment. And what is it a particularly quiet Street? In an extension of that on 47th really was an important link to get us to that intersection, which is a new will be a new signalized. It is a sigmoid crime scene, but it gets realigned in the crosswalk. It's real I ain't with it and it does get you directly across the street into an ADA connection down into U Village. And that again was very important to the neighborhood. Another benefit benefit is amenities along the trail and these are important in the event in the sense that we don't get them off and we don't get a water station. We don't get any wayfinding or very little of it a bench is almost a rarity along the burqa trash can so these are things amenities which we proposed it again the neighborhood very much like that and use a rendering of it. So again, it's it's a bike Fix-It station water a water bottle bottle bottle filling station with doesn't happen on the burg bench trash recycle and waste finding what y'all talked about in the moment. 4th public benefit is restoration along the Burke you see this going on in very seriously work with the friends of burke-gilman trail at Fortera and green Seattle partnership and parks to determine an area. It's essentially the frontage which is off site and within spu and Parks property directly fronting the site. And it'll end on wayfinding. So we've been tracking the wayfinding program with s. It's in its conceptual phase right now. I got him to sit on a stakeholder committee for that as well. So we're waiting for guidelines to come out and we will use those guidelines then to deploy our and determine location to so we've got a range of science. We propose plus one kiosk at this intersection in screen and then I just turned on the public benefit Matrix, I won't go through this but as you've requested in the past, we've provided cost of on the right-hand column associated with the the drug cost of developer for that public benefit item. And that's the end of the presentation. Thank you. Parks gallon and I'm here related speak in support of these public benefits. I think that you probably all know the burke-gilman trail major regional facility that's managed by the parks department and its success really is well thought out access points. We don't want access points everywhere. We want them where where they're needed think there's some connection to you Villages and Miss part of the trail is lacking any kind of connection. So this is a huge benefit to the trail. In addition is Mark said, we don't get those kind of amenities on the trail is kind of in a way. It's kind of like an on-ramp to Highway cuz it's wider there. So there's a pull out place for benches in in water station. And there is a friends of burke-gilman trail that is extremely active about restoration of this of all the vegetation along the trail. So they're very excited about this as well. So yeah, we've been working with Mark and his team since the beginning we've provided all level of comments from they've been through our standard review cycles and they modify the project Cornelius. We are we really appreciate the collaborative relationship and we look forward to these improvements. Michael anything else from the design commissioner you already touched and I think you know the commission always looks for that big move. Where is that equivalent value as a result of the vacation? And and I think that in this case is pretty clear that big move as you're creating not just a connection. To utilitarian connection. It really benefits of a variety of users pads bikes much more than what you would normally see with just a simple connection and I think this sets a good standard for the city to follow in its own work. Doll I said someone who uses my bike on the burke-gilman occasionally and and occasionally is going to U Village. It's always a head-scratcher frankly. Do I go across one of the overpasses into the parking lot and pick my way up do I go around the back side and sneak down from there and this at least the way it's portrayed here. It's going to be like, oh there is the University Village. That's the way I go and it looks like it'll be a very logical in a can of shortest distance between two points and a safe Crossing of an arterial. Well, I needed that so that look outstanding the wide spot on the path an opportunity with the bike Fix-It station is always great. Hope we can be maintained and a water bottle filling station is awesome. And so again, Does will be owned and maintained by parks department or by the by the property owner and they'll perpetuity by the property owner? Actually, it's great to hear us when I say you imagine design commission had some work on making that part is too. So thank you for doing that the the kind of not public but the open space is adjacent to it looks great, too. I don't really know how they're going to manage that but it certainly looks you know, someone inviting if you're not part of the public benefits health benefits specifically because there was some uncertainty on the part of Trailside as to how easy it would be to manage is that it be designed in a way that's welcoming to the public so it won't be fancy but it won't necessarily be programmed either and they're looking at some retail opportunity. So if they're The little coffee shop or I don't know what you what you want when you get off the trail ice cream or something. I would be available to everyone but it's not defined as a public benefit. So we're not obligating them to manage it in a specific fashion design commission discussion. We had we actually started out with a fence. So this is student housing and in so security is of a concern. I think the analogy is the student housing over in the U District side. They've seen as a few know the last five years which they have open Atrium Courtyard spaces that flow through so similar to that there's a very modest amount of retail and it's actually up on the screen here just the end of the building so carefully placed at the trail connection to be successful. So that would be an attraction to come down his face and I can imagine the client programming message from time to time W events. So it's were trying to be welcoming that also, you know, it's it's semi-private space. It's like a maybe a front yard, but very approachable. How are Cerwin II the State student housing? Is this private soon as we clear about that? Yeah. So, yeah, so rented by the Tillerman multi bed units are being rented five units and the the the bedrooms will vary from 2 to as many as five and there is below grade parking and bike parking and that's one of the reasons for the vacation is to provide to provide that continuity below-grade. So there's fewer curb cuts and vehicle and bike entry points. Those are really channel that Northeast 49th. 65 units units engagement with ever been a Brian association meeting when you came really quickly. I want to point towards the what I've heard it before and I'm just curious if it came up at any point about public benefit as you get further right along the burke-gilman at night. It gets to be pretty dark. Was there any conversation about just lighting or trying to provide some lighting around there was and actually to the right there are lights right away. When you swing around to Blakely place the canopy of the Trees of scares them some way it is at its excellent. Maybe question for for chip. I don't mean to pass the back here, but the Burke is mostly unlit what you hear from the neighborhood as they'd rather walk on 25th as treacherous because that could be or even cycle on it because it's lit and so that's a ditch a broader conversation with the Burke. We decided to only light the connection. So right at the connection and then down to to the intersection to be consistent with the majority of the Burgh. And that was a conscious decision collectively with Parks. So this is probably discussion be on this table. But chip is is there a specific policy and I don't know if there's a policy but I think much like our Parks. We we tend not to Litem in a lot of his cost reason because you got to lay the conduit and maintain the lights and so I don't know if it's a conscious policy against it, but it has to be a special situation where we do like that and we do like certain specific areas, but not on the burke-gilman. I don't think so. It's worthy of a thank you. Okay, so calling I think it might be potential for the future conversations about public benefit. If there's an opportunity I can definitely see how you know why we don't do that being as it kind of a budget conscious decision, but I think potentially if there's an opportunity to do some private development that circle like that's surrounding the Gilman that might be an opportunity to provide it as a public benefit in the future. So I just want to make that a little bit more of a aware of what we can do in the future Place way. Okay colleagues we need to ask your Indulgence for a moment here the agenda. I did not note a public hearing. So I'd like to amend the agenda to add a public hearing to agenda item number four and just know that this was noticed in the Daily Journal of Commerce. We just failed to put it on our agenda. So I'll move to amend the agenda on Cypress TX and I will go ahead and open the public hearing sign up for the public hearing. Anyone else like the comments for the public hearing? C9 I'll go ahead and close the public hearing. Thank you for doing that. We believe we have all of our rules in order here. So I'm going to propose that we go ahead and move this legislation out of committee. If we're here in the end of a convenient time. We need to do something different. We'll figure that out. And before that you should wave the casserole sit and really respect you from having a boat on the date of a public hearing. So I would move to suspend the rules to allow for a vote on this item on the same day that we have the public hearing. All in favor signify by saying hi to the rules are suspended so we can go ahead and proceed with the vote on this item if he's okay with that. I don't see this is terribly controversial reserve the right is it goes to full Council if there's some things that come up or people have some concerns about the process that we can revisit that that sounds like a great project. I want to hold you all up any longer as possible to her future Development Across the street is there is that planning works there, who knows to be determined it is actively in the works. So and I'm working on that we were able to really coordinate the curbless street design and the timing there's been a lot of interaction out there on the site so I can imagine just buy the shape of the land there could be, you know thousand students living in this area. No, man's land at the moment. So the text be right ahead and move. Kurt vile 314380 on favorite thing about tonight All right, we'll move on to agenda item number five people. You can stay here. I guess Kelly do mind-reading in that again. Cancel bo1 19527 and ordinance taking the alley and block 19 areas of the Sarah e Bells second edition in the block founded by 6th Avenue Blanchard Street to 7th Avenue and Lenora Street on the petition of acorn Development LLC. And we'll do not see why we do around of introductions against for the record this what's in Council Central staff. John Sabo and I just stepped off the shell design commission a couple months ago and review the Trailside project this chair so excited about that one. Okay, so we're pulling a presentation and listen to everything you want to say this. So the last item would Grant serve ability for the Trailside project to build the improvements that they're asking for. Once they are completed with the project. They'll come back for a final Ordnance basic checking off all the box say that they did what they said committed to doing and that's where we are with this project. They've completed all the work for the street vacation. They're asking for your final approval and the final approval is basically based on whether or not they completed the conditions and provide the public benefits if they committed to so there's two there's two Council actions in any street value vacation. We just did was the first one which is where we make the policy decisions and decide it's okay and then there's a second decision that comes back to us. At that point we were all really doing a thing as a checkbox. It's it's a ministerial decision is still thank you PowerPoint on this. I thought it might be a good reminder of the background at the time that the council reviewed this project. It was one of three there were three alley vacations. They all came in under separate petitions and it was the anticipation that they would the final vacation ordinance in the projects would be closed out individually, but with the three projects being together black 14 19 and 20 since we always are so clear and we're we're talking about that the city council was able to look at a larger package of public benefits and different things were assigned at different times on one of the public benefits for these three projects of her example was a new streetcar and the city council required that that them For the new streetcar be provided when the first project was done. So that 3.7 million was provided for the new streetcar before their first project happen. So they're different parts and pieces and phases. And so what we're looking at this is block to block 14 has been finished and when John gets in and we see the map the locations will make a bit more sense but also because the three blocks went through at the same time, they did look at land use zoning criteria that allowed them to move some things around on the side and there were public benefits associated with the plan Community Development. So we see different kinds of vacation criteria and public benefit criteria from the the PCD as well. So when the council looked at this we had charts of what obligation went with each project and what obligations were associated with the vacation and what Associated with other land-use actions. So we've implemented that and the developer has been very careful and following that so this is the second one in what you see in terms of the public benefit is just what is associated with the vacation of this particular blog. There's one more that will be doing end of this year or early next year. And there's a 1/4 project that came online following these three that will probably be next year as well. So this is been a 7 almost to eat your journey, and I know some of you have seen me before so is Deborah mentioned in Lish. This is part. This is really a kind of high-level. Look at what is much more detailed report to show that we actually did what we said we would do or exceeded that so there's really no controversy here there wherever. Going to highlight any changes but really that we delivered on her promise. So this is reminder. There are three blocks that were part of this project originally is Beverly mentioned. 14 is already been built and approved Glock 19 is the one we're talking about now referred to as day one and that includes both the high-rise 37-story Tower and the Spheres. And then block 20 is in construction and actually only a couple months away from being opened than it active as well. Of the only thing I mentioned is the reason want for our vacation is just a reminder. These blocks were a little bit narrower than the typical blocks in Seattle. And as a result of some actions the 1920s when they widen the roads in addition the way that the blocks are oriented long and narrow on through the north-south axis when we put buildings of any size as allowed under the zoning we end up with really buildings that are a wall towards the water. So we wanted to open up views by rotating the buildings and allowing those view to be opened up towards Elliott Bay. In addition these particular Ali ran into Westlake has a diagonal through the city and end up in five or six way intersections, so they weren't very useful because of that unusual traffic condition. And on top of that when we wrote to you, then we're able to go to able to create some significant public open spaces. And this block is I think it's protectli. I one of the accomplishments as can be viewed in this particular side. You see the block is it was before surface parking and essentially one and an addendum to that I had on to that building that was there. That was only one story in height. And now we have high-density Urban use together with significant public open space. That public spaces multi-use and it is entirely public you can see that are they using for farmers markets the summertime it's also a place they can kick around a ball on that lawn. There's a survey Amphitheatre seating facing towards the east and South and Southeast above where you can sit in under the rain or walk under it out of the weather. Is there really mention? This is only one of multiple public benefit packages. The first of those was the package we created to go for the base Farr to the max fer. That was allowable. We didn't exceed that of course, but we did go to the Max and we use those Open Spaces principally as one of the means to get there along with ttr's from preservation. And then there was a planned Community Development. This is only the second one the city that ever been done. The first one was for Union Station and we actually had worked on that project long ago and so were their benefits with that including like the operational and maintenance operations and maintenance of one of the streetcars for up to 10 years and also the idea that we hired to be leaving gold and then we're going to shoot for anything more than achieving you might remember that we went and hid of District energy on that block which is what places I could really exceeded what we were trying to do and then the alley vacation benefits or what we're here to talk about and I'll quickly go through them. You're not lying here in his Beverly mentioned some already done that the two in the lower, right? We purchase A Streetcar or I should say that the client did and then we contributed to a future park right across Westlake some what's something you can call the enterprise Park. And then there are a couple still coming when black 20s complete Willow created a sure use or curbless Street on Lenora between Westlake and 7th Avenue in on Westlake. Burr going to do some additional improvements. We did actually most of them we did the first block fourteen, but there's a few more to come when we complete this block this adjacent to it. So I'll go to each of these others that are associated with this particular Valley vacation the continuation of the Seventh Avenue cycle track. This is a track that's on either side of the street a one-way in each Direction separated from the the sidewalk by Trees and Landscaping and substituted separated from the the street as well as the sidewalk by Landscaping. So we have a true cycle track on either side. I'm Blanchard. We extended the Green Street. It was really hadn't happened on either side of that up to now but we did then set the building back in the dish in 10 feet. So we could have the show Landscaping including trees and create a cycle track on that street as well and wider sidewalk than required. The brother additional voluntary setbacks and the most significant of those by far were those associated with the Spheres one of the things this purpose of the Spheres is is it in fact to have a garden and which you can work during the year all year round and we wanted to sit in the garden and that Garden them could be shared with the public because it's on the right away is on three sides as well as that public pause in the middle which includes only planting that is similar and then somebody in the same as with inside the building but also then the outdoor seating and a little bit actual sidewalk than we otherwise would have achieved. The weather right away is improvements the Doubletree El a along the the Seventh Avenue cycle track signature canopies that you know, when the original idea for that which has 2 Straight flat canopies when we were doing the original and design that when we got into the Spheres and saw the opportunity for doing something special we created these really hard pieces of canopies that people can walk under or sit under a comfortably and take advantage of it and they're also invite Vines to grow up them finding at the base of most of them. There's no signature or peace and there was none promise on this block. There was on 14 and black xx and both of those are 130 complete. The other ones been installed and not visible yet here though with the addition of the Spheres we had in addition to the crafted pieces for things like the utility covers in the benches the lighting that we did along Blanchard Greenstreet the Sirius itself Services significant a public ass at nymity the lighting. You're welcome. And then I really the last one here is this idea but additional overhead weather protection again being provided by the tree canopies that we had designed. So with that just went to open up for questions can the highlights of each but happy to answer whatever I can. I'm taking any questions. appreciate the presentation but I think this is just a good example of what a public-private partnership to look like with regards to providing public benefits a thank you. Thank you. I appreciate it with you in a couple of projects. But this is been a pretty exciting when I know that has a long history around the world, but I certainly see those spheres in a lot of photographs whenever Amazon is talked about globally and so I'll be curious to see you in some point and you could you go back and see what is the most anything else I would guess. This might be towards the top of the last we already know that it is any more impressed than others and most recently can the Wall Street Journal video. I'll give you a call to her this year so I can find it online but it's has been very exciting to be part of this in this client has been extraordinary. Some so we're here at the end of this project has proven the ordinance to Grant the same we passed the ordinance and then there's work that's done. We're the title changes week. Like they reflect the figure does the fee for the right away Amazon pay the fee on all three of the alley vacations early. So they paid two years ago, so I could see it's been paid on this it was 5 million. Something any other questions on this bill? Can I go and move Council Bill one 19527 2nd on! I look forward to coming back for black 20. All right. We got one more before you get into all the fun things cuz you made me remember 6 into the record AR Westlake LLC permission to maintain and operate a pedestrian Sky bridge over the alley in the block bordered by Westlake Avenue North Terry Avenue North Thomas Street and Harrison Street for 10 year term renewable for to successive 10-year terms. Welcome, why don't we start with introductions Finance Seattle Department of Transportation. Amy gray Seattle Department of Transportation address of a lot of other stuff. I've been in other committees on Civic Arena. So it's just taking a second. I'll just introduce us. So this Council bill would renew the term permit for the Care Westlake Terry Skyridge for another 10 year term temperaments are generally they're usually granted for a 10-year term with two renewable 10 year terms as soon as the would be the first renewal. So there would be one more 10 year term 10 years from now to until it gets to its expiration. Got it. I was wondering about that cuz so the renewals come back to us in addition to the to the ordinance. Like if well when some of the old permits had affirmative action language, which with initiative was no longer deemed illegal. We have would have to do amendments that. So we bring things like that if it's just everything Remains the Same nothing's new. There's no insurance language or we don't need to change anything like that. Doesn't have a new revocation director type this position. Then it would just be an administrative renewal but we're doing some changes the language here to make it compliant with current laws. So this Skyridge is in the alley. I think there's an image of it. It's between two Office Buildings one on Westlake Avenue North and one on Terry Avenue North Kaiser Permanente on this was originally granted to Group Health, which now is Kaiser Permanente and they have some other office spaces in there. There's a map showing the location of Westlake. CA So the permit is expired but this permit this ordinance has a ratifying confirm clause which bring it would make it effective to the last day of expiration Care Westlake. Terry has been paying all their fees maintaining their bond providing insurance information and doing the inspection reports while we get to the renewal. So they are compliant and I started recommending approval is coming back to us cuz there's some subs in new changes there anything room policy perspective about not really it's just how the risk manager city of his manager wants the insurance languages to be a certain way and wouldn't that is opened up. We look at the new code drafting manual that's put out by the city budget office as far as what language was supposed to be using and taking out just cleaning up the language to the current standard and celery but it's mostly things will change with it comes to Insurance language from 10 years ago. I defer to the City Experts to manage that unless I call you want to dig deeper into Insurance language. I see shaking of heads excellent questions on this. If not, I'll move Council Bill one 19520 2nd and Q. Kelly I'm going to ask that you read again. I want you to take away our water bills version of all five of these at once just to get them on her record, then we'll move him. That's okay. There was a time to be clear when we read in all these not just the committee, but at the full Council and the clerk at the time was amazing it reading really fast that met the legal requirement of audible, but man she could rattle the stuff off accepting various speeds for street or alley purposes laying off opening widening extending and establishing portions of right away. Cancel the 2 to an ordinance accepting easements for public sidewalk Street or Street Ally and Ally turn around and traffic signal purposes. Cancel boa one 19523 and Ordnance accepting various speeds for street or alley purposes laying off opening widening extending and establishing portions of rape. Cancel the 5 to 4 and Ordnance accepting 20 limited-purpose easements for public sidewalk alley or Street and Alley turnaround purposes. Yes, please. Baby had a mom. this one Are there two more are there two more presents? No, two more bills to read in 5 to an ordinance accepting various speeds for street or alley purposes. And one more for good measure Council one 19526 and ordinance accepting three seats for street or alley purposes laying off opening widening extending and establishing portions of right away. This is the stuff we live for the transportation committee. Cuz I'm really excited to have you here for this Council briefing all joking aside these of the Project's my understanding what you like to explain in more detail. But these are you know between the five bills there's a hundred different easements or deeds were accepting and I assume these are all development projects that are happening around the city than often involves pretty minuscule Parcels of land but these are land easement of the actual print properties coming over to the city as part of the development so we can maintain whatever the city does transportation rather uses, but I will hand it over to you all to talk us through all of these reductions. Thank U migration. The purpose of this legislation is to accept dedication Deeds easements. Place the property address. Stewart's diction and designate the property is right away. The department of construction and inspections May determine that a developer is required to dedicate probably due to the city under the city's land use code. Developer since I met her submit a letter of intent to dedicate the property as. Then performs environmental entitled due-diligence review before any property can be dedicated as right away. Once the property is cured cleared for acceptance. The Deeds are easements are signed. and recorded property dedicated to the city is used to widen streets alleys in sidewalks to meet current land-use codes requirements. The city Charter requires that the deeds and easements be accepted by ordinance. S. Presidents prepares and presents Council bills to accept 20 Deeds or easements at a time. Once accepted the dedicated property has been used to enhance sidewalks streets. And Ally throughout the city. We are here the to ask that you accept the dedication deeds and easements. and that concludes the presentation if you want to walk through all hundred parcels and explain them to me or should we just I think this is fairly as Lee said earlier ministerial. I'm sure there's a good reason why our predecessors decided these types of actions to come to the council, but we certainly try to streamline as much as possible and I don't have any specific concerns about this, but if you have any questions or concerns we can dig deeper. Well, then I'll go ahead and one of the time let's see her make sure I don't miss one here. So I'm going to start with agenda item number 7 and I'll go ahead and move Council Bill 11952 one second. I was in favor signify by saying. That passes and we got a full Council and next one. I'll go ahead and move Council Bill 11952 to I was in favor signify by saying I imposed that goes a full Council. Jeanette number 9 Council Bill 11952 3 I'll move that I was in favor signify by saying hi. H&M 10 Council bill 11952 for I'll move that A passes and cancel Dillwyn 195254695 Council bill. I'll move Council Bill 19526. All of those bills will go to the full Council on Tuesday, but thanks for all your work on this weekend to do the relatively quick and easy part, and we even save Kelly a little work, but I didn't read the whole thing in but I imagine each one of these Parcels required be no legal review and property you entitled review. And so I know there's a lot of folks on your team and by the law team did put a lot of time into this photo and diminish that this is important that we do, so, thank you so much for your thank you. Thanks so much for the committee will go ahead and thank you.", "end_time": 5761.0}]}