{"format": "raw", "annotations": [], "confidence": 0.9472064038320464, "data": [{"start_time": 0, "text": "Good morning. Everyone. Today is Thursday, July 18th. 2019 order its 9:40, and I'm sure he's the most number bagshot and council president Harold. Thank you so much for being here and for waiting for us really appreciate you being here today race and social justice initiative report. Thank you so much for being here or less everything and discussion and possible vote of the notice of intent to sell legislation that I had a good chance to work with my Council colleagues councilmember backs on some various amendments set it to bring that forward in the discussion on that and then lastly will have a discussion discussion on our hotel worker legislation is to parts today, which is specific to retention and workload. If there's no objection today's agenda will be adopted on today's agenda. Adopted. Started I do want to take a moment of personal privilege and I did have a chance to go down yesterday and visit with our good collie councilmember mellow from Tacoma the folks from Catholic community services. I had a chance to talk to you some of the direct providers they're into or what they called their stability site of the large tent that has on the ability to have enhanced shelters in the tent and also the pallet shelters outside that provide privacy two to four beds and to visit the facility. It was really a great experience. I want to let you all know how much they appreciated us coming down other cities Everett Lynnwood Vancouver. I hear are also going to Tacoma to take a look at their strategies there and wanted to bring back this PowerPoint as it had just been presented to their Committee of the day prior on Tuesday. I'm one really exciting statistic to share with you is that when folks come to this enhanced shelter this stability site model. Replacing about one-third of the residents into permanent housing a 1/3 placement is incredible at we're really excited about our placement Department of Housing and about 22% when they come out of enhanced shelters versus math on the grounds about 5 or 6% So I just want to bring this back for you and share that really great experience and low for the invitation and the great work that they're doing. So at this point was moving to public testimony. We do have quite a few folks sign up for public testimony. I believe we have 25 people. So in order for us to keep this within the time frame, we're going to aim for a minute testimony recognizing that folks may go slightly over but we're going to ask you to keep it relatively short. We're going to give folks if it's okay with the council colleagues. We're going to try to cut this public comments off at least and a half an hour. And I think if we keep it to a minute, then we'll be well within that will hello everybody the first people that we have How much for being here and I'm all call the next names in the moment. Thank you council members. Annie and I are both with MLK labor represent start my testimony in support of initiative 124 by saying that I believe in the hospitality and entertainment Industries in our city and I think they're important and when you care about something and make it better and you want to make up modern and I think that initiative 124 did that and that's why it's a priority for the labor movement to protect that policy in its entirety today. I wanted in particular address the overtime struction worker overtime is a central Labor rights policy that people like me enjoy and I think it's one of the most important policies initiative because it's about workers bodies and women workers bodies and we want to make sure that when somebody is overtime backbreaking labor literally breaking shoulder breaking labor that that is not incentivised. It is disincentivize that they are adequately compensated for the sacrifice that they're making me high and I'm a logistics director MLK labor prior to that. I worked in the hotel industry for 7 years during that time. I worked in many departments from the front desk to cells and housekeeping. I was actually not a hired housekeeper, but I was asked to work as one because we are experiencing a very high turnover in that department during my time as a housekeeper I stripped. Cleaned up to 25 rooms at a time and it was strenuous and sometimes painful work. I popped Advil like handy during this time the legislation as proposed strengthens the workload protections contained initiative 124 and ensures that workers have agency and working at a safer and more sustainable Pace. We strongly support this legislation. Not only because it will bring long-overdue protections to some of the most vulnerable workers, but also bring Justice to the 77% of Seattle voters who passed i-124 back in 2016. Thank you. Jim Miller followed by Dustin Hinkle followed by an van vandehei homeless in Seattle since 1921. We are deeply concerned because we've become the subject of an opposite labor standards investigating investigation regarding are hiring practice with a fair chance ordinance. We've been advised by Deron Williams. One of the best one of the investigators that the oil has plans to issue findings and find against millionaire Club charity and excess of $40,000. Mr. Williams leap in logic is deeply troubled the few individuals who were ejected from our program include those with felony charges of rape child rape sexual offenders in armed robbery. We cannot in good conscience, please those type of individuals in hospitality industry, Weatherby CenturyLink Tom Douglas restaurant a residential worker or any other place. We just cannot put anybody at risk and that's what we're being asked to do by the office of the labor standards Zamora. Thank you. My name is Dustin. I'm employed at the Hilton Seattle. I started my career. Kentucky Fried Chicken making less than $8 an hour and I've enjoyed a lot of protections that cities are put in place, I come from a family where my mom is a hospice nurse. So is my sister. My dad is a police officer and my mom's wife is a hospice nurse to my family like you is. Into a line of work. We're making an impact in people's lives. It's important. I think most of the people in this room want to be of service to others is to you with the workload. I think of it is an analogy. I can think you have long days here in the council chambers and you might want to go down to City grind espresso at the end of the day in order a coffee. Can you imagine if the bill was $63 and you said why is that well 3 for the coffee, but this is the 51st coffee I've served today. I just hit my quota. So now you owe me another $60. That's what the workload does. It puts it on the It's not the customer. Not a Perfect Analogy, but think of the golden rule. That's what we do in Hospitality. Thank you. I'm an vandehei and the director sales at the Hilton Seattle. Some of this legislation is truly inspired kind of sentence make sense. Not one hotel employee in this room will disagree with me when I say that bill Marriott said it best if we take care of our employees, they will take care of your customers and business will take care of itself some of this legislation that applies to Hotel tenants insurance safety initiative and overtime require additional due diligence. If you really want to protect Hotel employee well-being you will address her will ultimately cost them their hours their benefits and their jobs. I walk to work in just this last week. I was hit with a 2 liter bottle full of unknown liquid. I watched a naked man walk down second. I was solicited for Eagle Drive illegal drugs on 3rd and python my way home from you. I watched a man urinate on the Windows of wild ginger while diners recoiled in horror. I routinely past people shooting up and every morning I passed by store owners who have to hose down and bleach their entries which are used for public urination billion dollar industry in Seattle and companies and tourists are going to leave a mark Chelsea and then Amanda Landers. Good morning. My name is Mark Simone on the catering manager for the Hilton Seattle. I worked in the hotel industry for 8 years. I started my little closer and then I moved up to Convention catering and then Sales Management just this past year. I stepped back into the industry. But I love after serving my country. My question to all of you is why are businesses who lease space in hotels being treated different from a business to lease space in an office building these businesses who lease space in hotels are like family. We depend on one another to provide outstanding memorable service to our guests every day when I'm out in Seattle meeting new people or talking to one of our value hotel guests or taking them on a tour. We have homeless people screaming or removing their clothes. Sometimes I have to walk our guests to their destination just to ensure their safety, but let's keep focusing on requiring overtime for All Hours worked. If you even employees exceed the mandatory minimum workload buy one square foot instead of safety. I can't think of another industry that is required to pay overtime for an entire day's work. I truly feel What fighters are still not in order please address? Thank you very much welcome. Hello. Hello. My name is Chelsea Hoffman. I'm the HR Director at the Renaissance Seattle Hotel over the years. I have worked in multiple Industries. I started out my career as a laborer loading hundred-pound rolls of foam and some ice by hand. I have now been in a charge hyperbole for over a decade and never seen legislation that would clearly benefit a group of employees over another. Our laws are supposed to be written to create equality. Everest discrimination. What I don't understand is how the hospitality industry is being targeted. Are there other industries that are required to pay based on workload does a meat Packer get paid more for packing more boxes. I don't believe civil servants have this kind of benefit either for helping more people how about delivery drivers and salespeople are those Industries required to provide the same type of location design devices that are being proposed the hospitality industry. The hospitality industry does care about their employees at the Renaissance. We employ 250. The proof is in the numbers nearly half of our employees would not still be at the Renaissance after 10 years. If they thought they were not being treated properly 15% has been with us for over 20. I ask that you not approve this legislation that it's legal and financial hardships on our industry to Terry and then juergen Oswald. Good morning. My name is Amanda Landers on the director of front-office at the Pan Pacific Seattle. I have worked in the hospitality industry for 7 years and was recently recognized as Washington's Hospitality emerging leaders 2018. The hospitality industry is incredibly unique all of us put everything that we have into our work. It is backbreaking and we love I have worked closely in all of the Departments including housekeeping for many years. I've done the job. I know how valuable their work is and how strenuous but to pay one square foot of overtime for the entire day a burden to the hotel and it demeans the work of all others as well. I'm sorry just so you know wanted to ask, you know, are we requiring overtime payment for our pizza delivery men are retail attendance mail Personnel medical professionals. Seattle in a workers themselves or anyone else besides just the specific worker in the specific industry. Thank you very much song Good Morning Terry. Let's grow to a chef and owner of Lulu in Nadi Sheraton Hotel my relation with utilities. I'm just a lazy. I have a lease and that's my entire business with them. I'm here to plead then you review the word ancillary because it puts us in very critical situation myself as well as 58 family that work with us. Please review that's and remove it. Thank you Stefan. A good morning at council members. You can polish a turd and I think that's what the council is trying to do. The original initiative was written by Nas on legislators and not surprising. It results in justifiable lawsuits that I'll being upheld your legislators. Do we drive without trying to near the bad parts and then adding even unnecessary other things as a matter of fact don't do it at all retention for instance. It's not necessary hotels gets all day in and day out. There's no need a hotel owner that shows up with a School Bus full of new employees. We need employees doesn't know he's losing their jobs when he Hotel sales we have standards. What's next you heard it from other people. I mean if we focus on Elston Tacos on everybody, so my recommendation is focus on the things that Seattle orders really care about Public Safety Transportation housing homelessness. That's enough work for all of us to take care of. Thank you. And then Braxton Myers know how hard is it to work after one day you'll finish if its 38 best and the supervisor asked you to do calendar a troll to our time. You told them that I'm so tired and wanted to go home now. They won't like it. If you got to the tools to make a how much from their eyes we have the tools to make as much as well. So that's the difference. So the lights all wheel with the weather to take the overtime and then we have no choice so they they still penalty for them because they will either they fought at We don't have to go to hell. But after 11:30 for pasta in the office, is it in the real world? We talked to the happy birthday with both of us. If we don't know how to thank you. I appreciate it. Thank you. Hi Stephen, Stephen Morris with Unite Here Local 8. I would like to address an important misunderstanding in regards to the Y close protection initiative 124 this legislation contains a provision that workers receive overtime pay for the whole day. If they are forced to clean more than 5000 square feet per day or per shift. This is not a provision that is intended to gift workers money. Isn't it? It's a provision that is intended to make sure that workers are not being put in unsafe situations in workloads that cause injuries in people wrecking their bodies in people are basically having long-term consequences for the hard work that they do. I think if there's one thing you can do as a counselor it is to hold firm on the provisions as proposed because that's the only way to disincentivize abuse of housekeepers in the hospitality industry. That is real and happening everyday here in Seattle. Thank you. And then Steve a Sasso. Hi Braxton have enjoyed working with in the Seattle city limits for the last five years. Once again origin Council to take a very strong. Look at what it is that is being proposed. We talk a lot 2 weeks ago about Optics. I think the Optics play into a very large portion of a kind of this argument that we're going through today and have been going through now for the last two-and-a-half 3 years and that not only they're not only is there concern with ancillary businesses being brought into this legislation, but not every hotel in Seattle is owned by a multinational corporation. My property that we represent is owned by a first-generation cream family. They came here in 1976 were not fabulously wealthy. We're not married. We're not Starwood where a small family-owned business and we intend to stay that we want to work. With our employees we want to be as a faster than players. We possibly could be but as we run the numbers for Initiative for the for replacement initials for 124 it literally and this is. I'm happy to sit down with each and every one of you would review the numbers it places our business in bankruptcy in place of business in the red. By Steve and then Jenny race. Sorry for the most pronunciation. Hello, my name is the most runs on this is patience. I'm curious how things are going to play out with this in general. And I have a applicable question to OLS and how they handle things originally. I started playing with Cher and I dealt with them for a while in October of 18th 2018. I started an inquiry with Labor & Industries regarding unpaid wages. It sounds something some of that a lot of people might experience here with some of their situation is well, the termination was made in December of 18 that they'd failed to pay wages. They said this was a Leo of ranch for $6,760 that they still continued on page of the States became Final in June on June 30th of this year and they are now in collections of July 5th. This is room regards to another issue that I have with them is housing on August 18th. We have to start a lawsuit against them because other agencies within the city of Seattle have not taken any action assistance including the office of housing, which has a Seattle Levi agreement that has strict requirements. Enforcing I went to Alaska in October of 2018 to this day. I have no response. So how are they going to handle any of these people's concerns Ephesians. These rules are placed in their mistress Kate of one last thing. I talked with some of you recommend it to me. Her name is Aaron house as your housing department. That was February 27th this day no response from her again either love with you. I know you have written testimony happy to do so. Thank you for being here. So followed by Jenny Reyes followed by Shannon Sheeran. He's a one minute. I'll try to be quick. Good morning. My name is duse also and my hotel is a member of the Seattle hotel association and I'm a resident of the Capitol Hill Neighborhood. I worked in the hotel industry for over 25 years and some of the others that have talk text and spoken in the past few weeks. I've had multiple experiences and seen a lot this includes washing dishes cleaning rooms being a dues-paying union member working with large corporations small family-run businesses partnering with and more often than not supporting elected public officials who may not always share the same views that I do but I haven't seen as a city council look to quickly rush and pass complicated legislation under the guise of one or two items when in fact a hundred plus Pages written is far-reaching and has multiple unintended and negative consequences on businesses and workers. You've heard many speak about this and surely this committee is well-informed and aware of this. I ordered you to listen to All stakeholders and acting a common sense and impactful matter when it comes to your role as an elected public official. Especially as it pertains to this legislation on a final note. I was hesitant to speak today as I've heard about and read about the echo chamber politics that takes place of X in the series impact as on all Seattle City residents that live here. I'm hopeful this committee considers the feedback presented as it relates the legislation so that meaningful progress can be made for all involved which includes everyone in this room and the city is at Seattle Hempfest. Hi Jenny by Jenny is Shannon Sharon Linda Morton and then the ghosts key. Hi morning city council members are my name is the presidency in downtown Seattle. I joined years ago. When I came to this country. I have been working in the hotel industry for forty years. Now. I joined welcome and given an opportunity to provide hotels have the most population within the workforce minorities in people that made mistakes in the past and given another chance. I believe this legislation is Inspire because it shows that we want to make things better for our Associates and we care about us and I have safety practice in place to protect them. However, this ordinance is specifically those items that are trying to regulate were loading health insurance needs additional review. There is no the industry that requires to pay overtime that I'm tired at work. Thank you so much for listening working towards improving this illustration. Thank you very much. Good morning, I cancel and my name is Shannon Sharon and then he's director of Hotel Sorrento. I probably look somewhat familiar because I testify every opportunity that I can I deeply believe in this legislative process. I respect the roles that you have and and the complexity of this city. We are at a very significant Tipping Point and the cycle of this ordinance and what impacts is really important and I I I continue to believe that there hasn't been the right amount of consideration. There isn't a great deal of care and concern that our industry provides to our employees. Are we are wanting it's not us against them. We've communicated that we've shared that we've illuminated that what is troubling is this legislation every stripe just seems to move forward and expand into greater complexity and it makes it more difficult for anyone to enforce doesn't take into effect even the sustained of My hotel is a small hotel locally owned for almost 40 years. And this is a debilitating blow as we continue to expand the ordinance and persecuting industry that doesn't have the bandwidth to accept or tolerate this legislation testimony. Appreciate it. Linda baller by Steve you don't look like Linda. I'm sorry. Thank you so much. I'm Linda Della morte and co-owner of Terra Plata and the president of China restaurant Alliance which represents more than 2,700 restaurants in Seattle. Most of which are small businesses. I also serve on the mayor's American small business advisory Council along with you Teresa the sponsor of this legislation the legislation you discussing is not just about hotels. It's about restaurants and other small businesses. Devoted On The Border's pamphlet written by supporters. If I 124 says housekeeper six times that there was not one mention of small business or non Hotel employee. This was never about small business Community decided to include us the definition of quote. Ancillary Hotel business on quote. You're putting small business and restaurants in the same category as hotels simply because they lease space from a hotel rather than an office building across the street. Tampax and consequences of this legislation intended or not to be devastating for a small restaurant or brick-and-mortar small business owner and their workers that depend on their business for their livelihood Seattle's restaurant in small business security sounds together. Please do not put us in the same category as hotels when that is fundamentally not who we are and thank you so much. How are you? Hello. How are you? My name is Steve ososki on the general manager at the Hyatt Olive 8 in the Grand Hyatt. I'm here today to speak about a number of things one of which has the additional foot square foot of workload that puts an incredible burden on the hotel. I often look up what would happen to the city's budget. If a police officer firefighter was placed with one hour more of time. What would it do to your general budget? It would it would decimate it at this point housekeeper's enjoy the overtime and this puts the hotel at a real opportunity to to hold firm on trying to maintain a budget second all I can't for the life of me understand how we've got several businesses that are Jason of the hotel that are small businesses that the unburnt undue burden put on them as well. It doesn't Santa's competitively disadvantage. I think we have to call this for what it is. It's a membership drive and that more than anything is that why was the CBA carved out of everything other than Panic buttons? It really is against economics for what's going on. I'm just disappointed and where we are big time, please and look at this. Everyone who's come to testify. I was just want to do one last call or is there anybody else who like to take a minute to testify I think some will get you signed in? Good morning. Hugs number is Abby Lawler with Unite Here Local 8. I just wanted to do a quick refresher for folks and then also some of the pieces that were included in in the initiative the legislation and it's Initiative for him was filed back in 2016. All of the folks in this room had the opportunity to see the text then the city of Seattle is the population of immigrant women in the city who been taken advantage of this additional protection husky price to do a level of work that was resulting in Pain & Injury is a holdover from the original initiative as is the coverage of ancillary businesses. And those were things that 299,000 folks. the city spoke out loud and supportive Okay see none. I just want to thank everybody again for the opportunity to hear from you. Again, Abby speaking of the road to get here today. Thank you for that reminder. And also thank you for all your work. We know you are moving on so you can continue your education and if we don't see you in Chambers anymore will remember your words and appreciate your time. Thanks everybody for being here and we're going to move on to our first item of business. How do you say if you could read into the record of the first item of business, and we will proceed and just one more reminder for folks if you did have testimony and you do what I say at all. Please send it to us, and we'll make sure that that's a copy of that available for our entire Council agenda item one office of labor standards race and social justice initiative report for briefing and discussion wonderful in between by Mark garfinkel director of oh, well as Darius Foster business engagement specialist in a while as Margaret from good to see you back Sara senior labor standards investigator at the well as and Margaret, please do correct my pronunciation of your last name. Thanks all for being here and I want to say thanks for Waiting to your presentation to today. We have a robust agenda last week. I appreciate you coming a week later. And why don't we start with introductions Margaret wise the senior investigator at the office of labor standards. So why don't you just go about 25 minutes for this? Thank you for this opportunity to 40 less 2% on rrisd. I work on rets the racial Equity tool kits from 2018. My OS colleagues are here to give you the details of the work, but let me just say a few things first. I am very proud to say that our sji principal are really baked into our mission. We try to be very intentional about focusing our efforts to help most vulnerable workers many of whom are workers of color and immigrants. This is Elected in all of our efforts from policy development Outreach enforcement as well as her own internal processes, including hiring and promotions, but we know we need to do more than that. We have also worked hard to shape our office culture in a way that demonstrates on a daily basis its commitment to racial equity in the past as you may know all this is done. It's rsji work as part of office of civil rights OCR in 2018 significant of significance to us is that we separated that are STI work from OCR and we created our own change team and processes. We welcomed that change because we saw it as a bit like adolescents separating from their parents a necessary step for our young Department to stand on its own two feet and develop its own rsji culture. We also created a leadership change team committee, which meets monthly this is a forum for continuous discussions between the our management team and our change team which consists of about 10 people which is about 40% of our office. I don't mean to suggest that we have figured everything out by no means one of the toughest areas and for which there is no clear roadmap is how do we create a culture where our staff can feel safe to process and resolve the daily issues of conflict and racial pain? I've learned a lot in my first year and a half on the job and I have a tremendous respect for this City's dedication to race and social justice as a white man in leadership. I feel my role is to stay humble and apprehend model and approach that values listening and learning. I want to thank my staff some of whom were here today for their dedication to this incredibly important work. And I also want to give a huge shout out to the IRS git Meadow. CR. They've helped us a great deal. They do great work with a small group and they really been wonderful to work with them. And would that all turn it over to Margaret to started off? So I'm Margaret wise senior investigator with ls and also have been serving as a change team Kool-Aid for the Department. I'm sorry to be talking about some of our challenges from 2018 as well as some of our sex the successes and then we'll provide a brief overview of the racial Equity tool kits that we ran in last year 2018 as Marty said was a big year of transition for her change team and splitting apart from OCR came with a lot of challenges as we tried to determine what the best structure would be for moving forward. And we also have lots of staff changes in the last year a lot of growth and staff as well as Martika. Rihanna's the director and so with that came some adjustments and we as we focused on how to both meet individual needs with folks coming in with different backgrounds experiences perspectives while also kind of building a base line of shared understanding throughout the office. We also one challenge despite stat staff growth was maintaining capacity for continuing to push forward with our sji work as folks are moving their day-to-day work. Some of our accomplishments despite those challenges were that we as an OLS change team drafted our Charter and work plan. We adopted a committee structure whereby we split work into subcommittees. So we're able to focus on different areas some of those committees as Marty described were the leadership monthly leadership team meetings. We have Kool-Aid to attend monthly Citywide meetings activity encourage collaboration across departments. We have the RIT Coordination Committee and finally An Education and Training team that helps coordinate all staff learning opportunities as a change Demeyer membership Grew From three people on The Joint change team to 10 out of a staff of 24. So it's been really great to have more representation across that of Another accomplishment was that following are all staff Retreat discussion at the end of 2018. We decided to send all staff to people's Institute undoing institutional racism training this year. So we're looking forward to that will work with the rest of the Seattle. What kind of training is being done for your staff for external relationships? Sure done. Bias training internalized bias training as well as staff has attended the city of stuff, but I don't know if you want to expand on I think some of those principles that both apply to internally how we operate as well as how we interact with outside like Woody work that we try to reflect internally is also something we try to demonstrate externally as well. It would be an example of that Marty micro aggression training. It's just as important to be aware of those possible microaggressions for your co-workers as it is with working with people who call in businesses workers and so forth apologize for that when you're dealing with external client. one of you sat down with them and sort of see the train them or used what you're learning and how you deal with them. I guess that's why I was trying to all right. I'm not sure. I'm understanding the toll this internal training sounds like you're you've been doing too many structures in the work plan on trying to see how it should I what actions you've taken dealing with? Who you're investigating their employees or employers what it changed you you did you take a left turn at the right turn who how did it sort of manifest itself in in the actions that your department are you in terms of our racial Equity training or in your race and social justice training that it sounds like you've attended the micro aggression Workshop War some of the training that took place internally. I'm trying to see how then resulted in actions in the field. Is that clear? Is it unclear I'll keep going. I'll keep trying if I can. Okay, there's been a variety of training to go through the internal City Cornerstone program as well as folks who have come in. I don't know that I can identify a specific example of where the training has changed a particular person's treatment of external customers if that's what you're asking, but I think it's an ongoing process of education and learning about how race racial equity and approaches to racial Equity affect different people both within the office and as well as the businesses. I think that's what you're talkin about the businesses that we investigate somebody else had one more comment on that question from customer arkells president Harrell. the reason I make this line of inquiry is because all of the train is great and I applaud your department for sound like everyone went through it. This is great and we want to encourage that. But if we can't cite examples of when were putting it into action, then then we have a challenge here. And so I'm I'm always you and I is all the Departments the same series of questions. How does it result in what you do? And I and I didn't hear any we have enforcement priorities. For example, which look to trying to highlight the most vulnerable workers to people with the lowest income as well and many of whom were people of color as well as industries that are why would call High Risk Industries. So in terms of focusing our enforcement work wear try to Infosys focus our enforcement work in with an eye toward racial Equity as well as who are the most vulnerable workers in Seattle and we can help. So those those are changes that we look at Through the racial Equity toolkit. You're going to hear about for example our website. How do we make the website more accessible to the general Community both workers? And so I'll come back later because I'm happy to chat with this with you offline about this and we can we have more time we could chat I prefer to do it openly but we can chat offline as well. I'll come back to it because I'm still trying to understand their minority owned businesses out there that have their unique set of cultures as well. Minority-owned business owners that have cultures embedded in the organization and my understanding of this working in the last decade has been that part of the Arts GI Training Center shedding those cultures and as the author of labor standards, which I think By Design as sort of a neutral part of this understand that you come in here and look at the legislative charge of your group. Can a culture of the organization's as well that one of the issues that have come up early in the onset of us labor standards was we realized during the minimum wage discussions that a lot of businesses. Businesses from The Immigrant Refugee committee business is owned by different organizations. They probably are running afoul of the rules little bit and when we encourage the minimum wage, cuz he wanted everyone to make a working minimum-wage. We realized that in the training peace and how we deal with many of these organizations lottery for cash businesses. They're having nephews and nieces working there and children they're paying cash and then rather than put them all out of business. We made a conscious decision to invest in training such that we we didn't treat them differently than a big box retailer, but we understood their cultures. That's essentially RCI work as well as I get into the discussion. We heard testimony today that that wasn't a cheap but we had a presentation by the small business advisory Council and and I'm sure you might have watched it. But that was also a rich part that discussion that your office is failing to understand the cultures of the organization's you're investigating as well. That's so I'm trying to get to how we're going to appreciate that. CJ can gagement and Outreach and so I'm going to ask that made the stakeholder engagement. I think that that will be really directly related to the council president inquiry about how do we engage with especially some of our smallest businesses and folks who might be from those minority communities in limited English-speaking communities as employers and workers and the coordinator of the Strategic enforcement racial Equity tool kit in 2018 limited resources to the Maximum Impact in the community and its how can our work create ripple effect too broadly encourage a culture of compliance with Seattle's labor standards. It includes strategies and tools that are broader than the traditional investigation such as education relationships and press as ways to increase compliance in 2018 or less. A lot about strategic enforcement. We engaged with our community and business partners. We talked to National experts Janice fine and staying and we did office-wide thinking about how we can work strategically. It's a really big complex topic that involves both external and internal components. And so for the racial Equity tools we decided to focus on OLS is internal systems. This is because your teacher Can porcelain is the strategy that could potentially touch every single person inside of OLS. So the ret looked at how can we die at design a strategic enforcement program that will have maximum charitable an inclusive result inside law office of labor standards for their iata. We hold individual hour-long interviews with every single person at the office of labor standards conversations asked people what they understood about strategic enforcement what type of program they would like to see whether and how they would like to participate and if they saw any barriers to participation and Persephone the conversations highlighted how smart talented and committed to the office of labor standards Mission every single person in the office is and people highlighted both Equity concerns and brought up a lot of great ideas. Some of the main things that were repeated by many staff were the feeling that strategic enforcement policy should have us working together more create leadership opportunities include accountability to our communities and learn from past experiences. And so a quick question gets here. Can you talk a little bit more about the systems of accountability to the community particularly around strategic enforcement when you first opened up you talked about listening and learning being a critical value what kind of input are you getting from? The community that helps you reflect on this system of accountability sure. So I came out of this racial Equity toolkit. What is a draft policy and procedure guide how we systematically approach strategic enforcement and educating oneself and implicit bias. Is that having systems that are that apply you known the same. Helps get around potential implicit bias that can come in decision points. And so that was an important part of this process. There are we have a document that was developed to work with national experts internal thinking 20 questions for strategic enforcement campaigns and those include questions where we would engage with community business partners about like, you know, where are the industries that are really having the the impact and like what are ways to affect those Industries to eat to have a ripple effect in this industry is are there particular businesses that would tend to influence others. Are there Association to attempt to influence others. What are the true experiences of workers? What what are the violations that they're experiencing? It's a rest of it on the front end there is community and put in this is when I say community and talk about community and business we have we do have funds that we spend a lot of money. Community Assistance in our work consider our work and hopefully, enforcing with Community Partners from impacted that represent impacted communities and then there is a kind of like a debrief Lessons Learned where in at the end and work would be looking at actually asking people that were impacted by the Strategic enforcement campaign. How did that land? Was it successful or their unintended consequences? What should we do differently next time? That's that's very helpful. Turns the Strategic enforcement. Do you treat during the investigation process immigrant and minority owned company identical to a big box retailer perhaps publicly traded or part of a large conglomerate. Do you treat them identical any enforcement strategies? I don't I don't think so because it going to be actually do for instance. If we did fine. I mean, you know, we would try to meet people where they're at. And so for one thing, you know, if there are any accessibility access needs is a part of every single enforcement action, but doesn't even when it comes to food you find violations that like workers have actually been harmed by this business whatever this business is background might be we take into account Equity considerations when assessing damage is done penalties. So good example, we know that there is a high amounts of wage theft at 1.4 have been corrected in the fast food industry. You notably Jimmy John's has a lot of press attention to the way step that occurred there industry-wide investigation. Recognizing that many of the same violations are currently in that industry. We need to strip do strategic enforcement looking industry why but if there was a Jimmy John's as it comes Presidents Day and then has clearly, you know, a number of attorneys in the pockets and can kind of have more resources to bear and versus a Santa little mom-and-pop that happens to be in that industry. There's a difference in approach in terms of how you investigate potentially the conversations you have and then the potential penalties has things like that, you know, but I would like to just say it says this this conversation is shifting a little bit I swing through what is our investigative process and what is strategic enforcement you're absolutely right in strategic enforcement is looking at impacting sub-sectors of Industries in trying to create a ripple effect. Thank you for the reminder. Ask about our about how does the internal trainings effects are external work and you're reminding us that this is an internal process that you all have taken on to better identify individual by us and system-wide. Maybe I'm biased and how we do investigations. But this is really internal Focus for the rsji toolkit by filtering how you investigate. I was I was describing strategic enforcement investigation. So I stand corrected so identically or is there a nice shade lense as well as during investigations a person and an office makes a commitment to take an anti-racist approach. You don't just do that here and here and here you do it and everything you do. And so I think all this education that we've been talking about has been helping us build our lens and then I think also the racial Equity tool kits that weed. Last year and in Prior years have looked at small aspects of our work. I don't know if you've ever engaged in a racial Equity toolkit, but it is a massive undertaking. And so that's why this year we focus just on the internal processes to office of labor standards, but the training and all the consideration all the work that we do really does pay dividends for both internal and external relationships. Thank you. And this is reminding me I would love to have a overview of some of the Strategic investigation components as a standalone. I think the questions are really warranted in terms of our commitment to trying to make sure that there's more effective use of your all-time and I think applying the race and social justice lens to how that work is done is really critical. So I do think that maybe what we could do is an additional briefing on how that lends is applied and what that strategic investigation and other components of your work look like at another Point as well because I think the questions are really valuable. I understand the The says that the council president is getting at I'd appreciate it and also think it could be its own Standalone meeting as well. Definitely. Let's see if you have a few more slides and then we'll entertain a few more questions. I could just pick up just to give you a quick overview of the policy and procedure guy that we drafted at has it was built around these sections. How does OLS identify and select strategic campaigns? How do we stay accountable to the community in our Community Partners? How do we free people live within or less to work on strategic campaign? How do we determine who works on? What how do we manage the work and who makes the decisions and how do we evaluate the work? So in early 2019 the ret committee proposed this guide to all the staff and management. It was well-received management adopted many of the recommendations but a single strategic enforcement policy and so management actually use them to inform a new training and professional development program in the office. I will let this continuing to work with the Strategic enforcement ret in 2019 to evaluate the policies and procedures as we put them into practice. So we expect to have a revised and updated strategic enforcement policy and procedure guide at the end of the year based on our experiences as well as some lessons learned from actually trying to work through this system. I just in case you weren't sure this is a picture of the North Star and OLS is stealing are many little boat stores are Northstar, which is to effectively use limited resources to create a culture of compliance with Seattle's labor standards equitably and inclusively. Thank you in various. I did not mean to engagement specialist wouldn't feel free to chime in on any aspect that you'd like on the rsji effort. So yeah, so I was part of the the team that focused on me the website ret. I'm so most of Seattle labor standards education material and training available to workers and employers is is housed on the oldest Type R. Go for the ret was to expand access to education material on labor standards by defining gaps in access to information and establishing an internal policy to ensure greater greater visibility and access to educational material specifically Orbot for communities of color. This includes individuals with disabilities popular populations with limited English proficiency and limited access to technology in our initial phase of the RT. We Engage The Following stakeholders community business organizations and workers. Business owners specifically small minority owned and owner resource businesses and professional service providers whose clients predominately include or includes populations of color limited English proficient populations and small employers by chance. Sorry to interrupt your brother. There are are contracted to provide labor standards Outreach education and technical assistance to employers and workers to Oasis Community and business Outreach funds professional service providers for entities that provide Direct business services such as payroll providers. For example ADP pay checks or CPA certified public accountants. So as a result of the feedback provided by the stakeholders age, they offered some valuable Insight simply by primary issues and recommendations were laid out and they are as follows issue 1 the website is in a date with tech-savvy documents recommendation is to increase visual elements and documents for easier, to processing and understanding is she to website contains too much legal. Jargon. The recommendation is to simplify Language by using common everyday words and reducing language to the most critical point is she free website is challenging for individuals with limited English proficiency a recommendation is to include more language options at the homepage and add those options to the top navigation bar of our website. The Don Page freezer visibility in Access. Is she for Website Layout is overwhelming and challenging to navigate? Recommendation is to condense web pages streamline information limit hyperlink in limit hyperlinks within the website for the webpage has an issue 5. There's a need for additional labor standards tools to support employee compliance recommendation is to engage and communicate to public to the public recent website development. Is mapping exercise is one example of the steps were taken to fill Argo and presently working with the OS Communications manager and it's Seattle it web architect on remapping and reorganizing the oldest website. They sell stakeholder feedback. Our time frame barring any unforeseen circumstances is to implement all recommended changes by chikku for quarter for 2019. So by the end of this year, we will continue to respond stakeholder feedback. I'll be serving through a Community Partners and moving forward and we will evaluate the website annually and we intend it published Authority on the website report updates periodically. Thank you for all of our websites and then we should wrap it up. Thank you. Thanks to all four of you and Marty I especially want to thank you for Korean Bowl. It's the Library Council Central staff when we're delighted to have her on board. She's a real asset. I wanted to say thank you for the work you're doing I appreciate the value of listening and learning. I'm am particularly focusing on education in the community, and I just want to express something that I've heard a couple of times in the last three weeks, which I find concerning Marty. I gave you a quick call about this a few weeks ago rather than feeling supported and listening and heard. I've heard on two occasions a sense that a well as two has been combative and disrespectful and not working with small businesses. So I just want to say, this This concerns me deeply and as we were talking about true race and social Equity that it goes two ways and not just internally, but it's got to be external. I'm happy to come back and talk to you about this. I'm I'm concerned about what I've heard and because I've heard similar things just in the last few weeks from two different parties with exactly the same complaints. I think that we've got some work to do. So happy to talk to you about that. I'm happy to chat with you or anyone else about the specifics of any situation. We I do I will say that we on the enforcement side and I'm assuming this is on the enforcement side. We take very seriously the legislative command that we investigate fairly and impartially the laws are powerful lost there. They cover a lot of requirements and we and I think everyone on the enforcement team Endeavors to look at these fairly and impartially and call it where they see it. But if there are specific instances that need to be looked into I'm happy to do that. Thank you. Go ahead and thank you. This is a I will go quickly but this is extremely important to me because I've heard a lot of testimony about when you say the organization and fairly and impartially I know you charge to be a neutral Arbiter but I'm getting a lot of feedback that that is just not occurring that way. That's why I was trying to trying to understand the philosophy behind the rsgi there seems to be little transparency in the office from the feedback that we're getting in terms of documents investigation that occur and what you're sharing with them in in the point. I guess I'll share my frustration. I and I and I look forward to some ongoing work is it when we created the organization we really wanted that are as she has to be there that you're dealing with organizations many of whom do not trust the government. They don't trust us. They don't trust what we're doing. So we were willing to invest resources making sure that you're in these organizations dealing with the employees and understanding their unique cultures and their overwhelming feedback is that's not occurring. Is on another presentation every other department does the purchasing and Consulting contract to see where you are in terms of your numbers and maybe that you didn't get a feedback but we're also trying to do is capture how well you're doing using minority and women-owned businesses for your purchasing and your Consulting contracts her no criticism about the website at all, but there has been a lot of criticism on how it the training manifest itself during the during the process of investigation and resolution that there's not a lot of training being done is just seem to be heavy-handed on investments investigation site. So I hope we can work more collaboratively together because there seems to be a complete misalignment on what's happening out there in the field in RCI work. I'm reading a body language see that you disagree so we can talk maybe I'm over reading it. But that's why I said I do it openly and transparently cuz if you have some pushback just push back because I'm getting all of this feedback. If it's helpful to us to hear specifics when broad statements are made I can be specific right now would be very specific if you want those. I'm going to be real specific and we will have an opportune budget before should we can try to do that before budget because the education fees first investigation piece is in a disaster small business advisor group who came to a morning briefing and I will also say that at the conclusion of that conversation people who were there when you came to talk to the small business advisor group acknowledged that your presence in that meeting and the conversation that you all initiated at that discussion really help to open the door to her future discussions and they express appreciation for you being there and here So perhaps we could do is get a follow-up from them as well on how those conversations have gone. I'm going to cut this conversation off and also acknowledged that talk to you some used at the University of Washington about public policy making it was a room filled with about 200 students and I asked this all sounds great what you're working on but how do you make sure it works? How do you make sure that the laws that you're passing are actually received by the people who are intended to benefit and I talked about the work of the office of labor standards, especially in light of the fact that we didn't have OLS when we had wage. That's past we didn't have a robust office when we passed sick leave for the first time and the work that you all are doing is actually making it possible for the nationally-recognized labor standards that we've passed here and watch you actually be experienced by the workers. And we also know to the council president and councilmember backshots point that unless workers are in a place where their employer understand the And other obligations under the new laws and those workers never experienced the benefits that we fought so hard for so it's a both and approach and I will ask you all to come back to talk about investigation later, but we are about 10 minutes over. So I want to thank you for your time and appreciate the work you're doing internal and external on committing to raise in Social Justice efforts and thank you very much into the record item number two. Agenda item number to cancel Bill one 19537 and ordinance relating to the sale of low income housing for briefing discussion impossible vote introduce yourself real quick. Chili Traci Ratliff Council Central staff. Wonderful. So this probably doesn't need a big T up because we've talked about it now at least twice intent to sell legislation again. I want to thank our my Council colleagues councilmember bag shop for both creating opportunities to hear directly from those who sell properties that are multi-family properties ever working with us on some legislative amendments. I think it's really exciting. What we have in front of us. I think I'll save my comments as we walked through the legislation. And did you have anything we have should have in front of you that I sent out last night and that is also attached to the agenda is the substitute legislation that I will be walking through and highlighting where we have made amendments to the legislation and that would be bruising. He ate if you don't like it, cuz you're going through this. We have focused on small businesses and small buildings and buildings that are 5 and more units and if you can go through that because we have heard from listen to and tried to amend this ordinance based upon the feedback we've gotten from both people that own units that are two to four units and then also larger ones correct correctly and so on the Seattle Channel viewing audience at home, you can also find this information link to our website. Sure. So let's just Dive Right In to the Amendments that are being proposed in the substitute. So the first one which is really the probably the most subsidence change made to the legislation begins on page 3 line 14, it's subjections D3 and this is the amendment that Babish has a tiered notice requirement that is in fact based on the size of the building. So what this amendment does is it establishes different time periods by which certain things have to happen. So let's just take an example of them will take my building size with two to four units. So 15 days after the owner has issued the required notice a tenant or non profit housing developer or the Austin housing or sha has to provide to the owner a statement of interest that they are in fact interested in purchasing the building if nobody at the 15 days issues a statement of Interest. The owner is free at that point to go forward with the sale of the building. So it is absolutely yes, right. So if if I had a 4 unit duplex, which I don't but if I did and I put a notice up in the building and maybe the entryway bulletin board saying I'm in 10 Ulysses property in 15 days. That's the notice is required by is not 15 days at that point but it's a notice that they're going to intend to to sell a building and they have to do it in the case of a listing in 90 days before they would intend to list so they have there's a Time. By which they have to pay in advance of listing now. That's the one sitting area where there in Canada list. There's the other scenario in which they get an unsolicited offer. So they have to issue a notice before within two days of receiving that that that that unsolicited offer. Let's let's say it's Bruce's building and I give him an unsolicited offer. He had that point has to put on the bulletin board notice for 15 days before he can accept my unsolicited. Nobody. Nobody responds at the 15-day Mark. He is free to go ahead and list and and or accept that offer before his building that is absolutely correct. This change is fundamentally what we started with. Which was initially said you have to go give a 90-day notice before you intend to list and you can't go forward with accepting an offer listing or anything else until that 90-day elapses we have now said no, we're actually going to say we're going to give these different time periods by which people have to express their interest is expressed interest to get another. Of time depending on their tenant or nonprofit to show their the next phase which is their ability taxi financially consummated deal and that's in the case of tenants or tenants groups. If they don't at that point show that Financial liability or ability again, the owner would be free at that point to go forward with the ability to list or to sell the property. And in the final tier is say that somebody has indicated their interest in purchasing. If every tenant that they've shown that they have Financial ability or a nonprofit has interest than they have 30 days after that statement of Interest has been issued to in fact submit an offer and if that that's 30 days, they haven't they don't submit an offer to the owner to buy then the owner again as free at that point to go ahead and to list and or proceed with the sale of their property that's for the tutu for you and I building moving to a larger building a 5 + unit building. So for that first statement of Interest time. It's 30 days from the receipt of that notice of intent to sell the next. Is 15 days for if you're a tenant showing at you have the financial wherewithal to purchase the building and then finally if you can do that or if you're not probably doesn't have to show that you have 90 days from that time at which the statement of Interest was issued to in fact submit an offer. What clarifying question or more housing units description with that cover homes that now with ARP attached dwelling units and daughters never messed up. The user. He's very clear like that for those structures that have to The requirement that somebody it's at least 80% or love you and as far as so at least one of the units and the building with its 2 to 4 or 5 plus have to be affordable for the rate for somebody at 80% of Ami and if it's not then they don't have to issue the notice. Is that going to have a negative influence on what we're trying to accomplish one of the unintended consequences? I want to avoid as let's say once again council president for units. And right now one of them is Affordable because I don't want to do this notice. So I'm raising the rates. So now it is full market rate for all four of them. So I know we're asking for a report at the I think it's the one year into your mark on this but so I'm not sure that we would be able to pay that evaluation. I don't know that we would be able to prove that if somebody is getting around noticed by raising the rents. I suspect the tenant could note that for the razor runs and then they you know, we hear that they put the building up for sale attendant could do an individual complaint to the city about that and say we think they may have And I'll try to get around this notice requirement and we would obviously have to do an investigation. Interesting looking always a concern about unintended consequence, but I was not something that we've heard so far some more questions about the tear notice requirement. I'll move on to the second page 6 online 12 and this is the amendment that would request the sea otter and the office of housing to conduct an evaluation of our compliance with the nose requirements about two years after we actually implement this legislation and I'll report that would be due to the council by December 30th of 2021. And thank you, bags are for your interest in that Amendment. Number three. This is found on page six. It is a new section section for soaring online 18. This would request the off of the housing to facilitate workshops with stakeholders to discuss how to enable sales a buildings to interested parties, including the provision of technical assistance to 10 groups nonprofit housing developers, and other organization is to assist in the purchase of buildings. That might be up for sale. So I'll come out on this one very quickly. We had a quite a bit of a conversation at the last meeting around the importance of not just making sure people have notification but then how do we help when people are interested in pursuing this option getting them access to preserve the structure or as individuals? Like I keep thinking of my example, where are 8-unit apartment when it for sale if those individuals wanted to come together and collectively purchase what tools are we getting them? This is one of the recommendations also in the National League of cities report that I handed out at the last meeting still at 8 the education and engagement that we would potentially provide to prospective buyers both 10 as tenants and does nonprofit a developers nonprofit organizations that are getting more into the area of wanting to help address the housing crisis in their city. So, you know think of organizations like El Centro who until seven years ago. Wasn't interested in potentially doing development for affordable housing and now is really looked at as a great model of how we create affordable housing for especially our communities at highest risk of displacement. So I might as well who worked with us over the last week to try to find some language that align with what her intent wasn't with my intent was and I think we have good a good compromise here to make sure that we're doing Workshop to help build connections between different parties with the hope of creating new buyers. And also helping to make it easier for those seller so that nobody is in a situation where somebody raises their hand and then has not ability to follow through reached out to any of the lending institutions to see if there's some partnership opportunities. I think a couple years ago that help me out with this council president. I think it was called Express, but it was a I think it was a credit union not positive on that but that they had loans available for end and it was lower than Prime rates for organizations that would like to participate in something like it's the antennas at those folks will be at these workshops to be a resource potentially to 10 that groups or to a non profit housing developers are other community organizations who might be interested in a future purchase. And I know that we've done this with office of housing that we've got so many available, but it obviously it's not going to cover the world. It's going to cover it up you it's not in it. Yeah, that's one of a rider who can be here today, but I did send us an email that clarified what the pot of money is it they currently have in. So I think that gives us a good base to build from I'm also to your question first question. I just want to publicly acknowledge and appreciate Raza Development Fund who does exactly what you're talking about help with folks who potentially don't have access to traditional bank loans and help get so Into mom that help purchase a building to create more affordable housing there on the kind of the more developments funder side. What's the right word? I'm not there not a bank, but they are a funder they'll provide loans and I'm support is at the front right there cdfi. I think the more information we can have about organizations like that. They could be useful that we could access the potential buyers / Builders could access it's going to be better for the Hope program. So the final amendment is a metaphor in this is found on page 7 I'll be getting online one and this would request the office of Housing and Seattle Department of construction and inspections to develop strategies to enforce the provisions of the ordinance and to provide a report to the city council on such strategies and any additional cost to implement stats such strategies and they would a submit this reported by September 30th of 2019 and make sure that this is a feasible to implement and the word is getting out and that we do maybe more proactive job on our side of identifying where there's buildings that potentially meet this match at the start of the hybrid between what council member her more than I were discussing at the last meeting and to get that information prior to your budget deliberations. I think is a really good timing for us to consider. This I Swear to him and I hope that in that discussion we identify What are problems were rather just pouring resources into monetary enforcement because we weren't we weren't enforcing very effectively I've been told it $500 sew in analysis is or was it just resources or just commitment I mean that we needed her to Enroute strong versus weak what the problem solving what the causes are as opposed to just pouring money into I'm assuming that this amendment captures that it's always going to be an issue of priorities and I think we will hear from o h when they report back to the council. What do they see is a priority as a relates to this specific ordinance to be really clear. We don't have resources that are going to allow us to purchase a lot of these buildings. I think that's what the intent is to try to get help enable tenants and nonprofits to purchase these buildings, but we don't have the resources that allow us to do a lot of this at this point unless we have some tax of money that we don't know about. So I think that is what them because the balance for the outside housing in terms of how much staff you allocate to doing. The monitoring enforcement went in the end. You can't help us ill at 8 the thing that I think everybody would love to do and we will when we have the opportunity, but we just have to come to recognize his limited and then they have to make decisions. How they allocate know we can still say. Hello. We want you to do more of that. It will find you to do more of that. But at the end of the day bility to in fact have resources available to help facilitate some of these sales. It is limited. We just have to be clear about that small component to the larger puzzle information more available and potential more potentially more tenants or nonprofit developers can reach out to organizations, like cdfi and leverage additional dollars or lending opportunities. Then we're creating more opportunities than just the city of Seattle can do alone or just Seattle Housing Authority. So thank you for acknowledging that we got to do a look back as well and not just going to Pat ourselves on the back if this passes to come to us and September I wanted to see if there's anything else I sorta got ahead of myself and I are colleagues. I want to be Sore Eyes Wide Open about this is not going to solve our housing crisis. This is not going to make it possible for every nonprofit organization or tenant to be able to potentially purchase these buildings that come up for sale. But I think as we've seen in other cities like San Francisco and the City of DC that this element is an important component of the puzzle and as we make a commitment to try to figure out how we can help especially those organizations who are looking to house those who are at the highest risk of this place. And this is one opportunity. There's an element of this that's also reflected in with the mayor and the executive office is considering around strategic Acquisitions. We've been having conversations with them as well. I think it complements it nicely. So again, hoping that our puzzle continues to grow and that we continue to add pieces to it and love to take any questions. I know Erin house did a lot of research on this to Tracy. Thank you for your intense research on this over the last six months and if you do have any other questions happy to entertain though Open to what I think we've accomplished here, which is to separate the larger in the smaller and allowing ways for tenants to get that word. But without syncing the possibility of a seller selling within a timeframe that market-sensitive, so I want to acknowledge that and thankful that we did some work on it. Thank you for your being open to that and Tracy for going back and looking at what San Francisco and other cities are doing my understanding is that especially now as we're doing these tears and different gaits of people at the walk through that it's consistent with what those other cities have done well for yourself wildly out of line. All the good thing is I would love to consider emotion the moves out of committee after now three times its if you are so inclined I would love to move that the full counts are frightened of the committee consider passage of 1155 37 for the full Council Sims, 3 as amended version d8 when it wasn't listed for both on the agenda was listed for vote on the agenda. I believe what Do not cancel president because I did not catch that. Okay good. Thank you for catching that it's been moved and seconded. Are there any other? Okay, I wasn't ever but I thank you very much for your work with us to amend this legislation. We will get the script in front of me. So mr. President. I may be able to ask for this to be considered by the full Council on Monday, July 26th before noon, right this second full counsel. I notice of intent to sell legislation which were, we are referring to her as our noise legislation. Thank you for your work on this Tracy and Aaron. Okay, let's move on to our last item. We did extend this committee agenda until noon. I know that many Council colleagues have hard stops at 11:30. So appreciate your time absolutely recognize that you may have to leave early for the reminder. Agenda item number 3 Council Bill 11954 an ordinance relating to employment in Seattle for plans to employers to limit room cleaning work clothes for certain employees for replacing a discussion agenda item for cancel the 1 1 9 5 5 6 and Orden s relating to employment in Seattle adding a new chapter of 14.29 to the Seattle municipal code for briefing and discussion. Turn names into the record, please. I am Korean a bowl of central staff Central stuff you so much for being here. Now the sixth time we've had this conversation in full command of her full counsel goodness sakes in our full committee agenda and we have also had a evening briefing on this and I thank you for being here and co-sponsored legislation. We have an amended time frame that I wanted to share with folks. You know, many of us are very interested in the details. We are policy wonks, we care about getting details, right and after conversations over the last six months. I also acknowledge that there is ongoing discussion and we want to be responsive to some of the items that have come up. We have gone ahead and add basically another for opportunities for both public comment and for us to engage in a dialogue at Council you will see in this agenda. Have added August 1st, August 15th and August 5th to the council at the committee agenda to give us a robust amount of time to walk through the details as we heard earlier. There's four components of the legislation to two of which we will do issue identification for today, which is worker retention of workplace. Injury plan is after 2 weeks, then we will have the chance to vote on those amended section at that point on August 1st. We will then have issue identification on the healthcare and the harassment sections after again 2 weeks. We will then bring back amendments and have the chance to vote on those Amendment then after another two weeks. We will bring back the full Council bills all four items with the hope that with that amount of processing and time between each meeting at full two weeks between each meeting that we will be ready to potentially vote on the legislation as amended from this committee and then bring it to our full Council for consideration on September 9th. Ample time before budget starts and that gives us basically another 6 weeks of discussion. I want to make sure you all had that I believe it's already in your binder is as we've distributed through out the count the floor but wanted to be very explicit about that to the folks were in the audience and also to anybody who's doing thank you for your ongoing work with us. We have two items for issue identification today work a retention and workplace injury. And if you do have anything that you like us to project on the screen, perhaps that the memo that you have in front of us we can go ahead and throw that up there and I'll save other comments before as we walk through Gonzalez's co-sponsored legislation. Did you have anything else that you like to add before we start walking through the two items for issue identification today? I'm only that I appreciate that. I'm going to work between our offices in terms of recognizing the importance of having a little bit more time to consider some of the issues that have come up in both. Public testimony throughout the prior hearings that we've had and in our own internal conversations with each other about issues that we recognize still need to be subject to additional discussion consideration and deliberation and a public process. So I really appreciate the ongoing work together to collaborate on making sure that we have enough time to have the best version of a bill that we possibly can to ultimately meet the underlying policy goals that we are trying to accomplish with these four different bills. So thank you so much for that. Thank you and walk through on the two items were talking about today again worker retention and workplace injury. Thank you. So as you noted today, we are focusing on two of the proposed bills. It is the protecting Hotel employees from injury ordinance and the hotel employees job retention ordinance. There are three discrete issues that have been identified for further discussion. The first one addresses what are informally referred to as the overtime pay requirements in the ordinance protecting her hotel employees from injury. And what does requirement basically does is require employers to pay employees at a higher rate when they perform room cleanings that exceeded maximum floor space 5000 square feet in a work day. That is eight days or longer. And the ordinance worked 8 hours or longer. Thank you. That would be too long payment for all the time that the employees are performing work cleanings for that work day. So if it's a 10-hour workday they be paying the 1 and 1/2 x rates for the entire 10-hour workday or any other industry or we do that for the entire workday not to my knowledge out of there being other cities who have done this. So I think it's really important that we know that Long Beach and Oakland have passed ordinances limiting workloads to 4000 square feet, which is a thousand square feet less than were talking about here and they're also doing double time for any amount for the entire day for any amount that triggers that I'm over that square footage. So we're talking about time and a half for the whole day if they Over 5000 square feet in Oakland and in Longview, they do all they double time for square footage that is cleaned over 4000 square feet. So they're ordinance that they have is stronger than the provision that we've outlined here so far. I'm that was new information to me as well. So I wanted to share it with you all so I think it would be really helpful. If Council Central staff could pull together a document a memorandum that sort of lays out the different components of some of the other laws. We know that exist in other jurisdictions hit on some of the similar plants. I'm pretty familiar with a Long Beach effort. I went down there a couple years ago and had a good conversation with their local Unite Here chapter and their council members and other folks on the effort that they were trying to undergo to pass a similar packet legislative package in Long Beach. And so I think it would be real Helpful to have that that has Millie also went to initiative in in Long Beach, but he would be really helpful for us all to have sort of bad is a foundational setting of other cities that have taken similar legislative action. Either be a ballad or help manic really wonderful app. I just want to add that to the request that we may perhaps that is one document originally had a document that said what was initiative 124 what was being proposed in our language here? And then we were asking for a document that identify proposed amendments corresponding to those sections adding a column that says where we see similar legislation either other cities in other industries that we have currently also if there's been any look at is there an option to reference to double-time going back from our one? Is there another option? Is there a I don't want to call it a penalty, but maybe it's an excessive hours are inexpensive excessive. CB that gets added on I begin to worry about getting into areas like time-and-a-half or double time going back to the beginning. I might just like to see if there's some other Alternatives may be reaching the same result which is really minimizing how any work or is taken advantage of but at the same time separating that we're not looking at a time and a half or double time itself. That's a good point in as a reminder on my think the legislative intent is important in this section of the intent is not to add dollars to the workers of pocketbooks. The intent is to help provide a disincentive for anyone being asked to work over that 5000 square feet work requirement. So that's really important Point. How do we feel that intent is part of the question that we're going to be going through over the next few weeks. I will also say that I was watching the body language and some folks in. Front row over here. When one of our people who publicly gave comment earlier saying our workers enjoy the overtime and the workers in the front row were going not the case. So I think that we need to acknowledge that there's a difference of opinion here and we're trying to thread the needle get that counts in this particular space around time to half double time that we also don't have to look too far away from home to look at policy decisions that the city council has made in the labor standards based around creating a disincentive to overburden employees or to put employees under undue pressure to do something that they may not want to do in our secure scheduling legislation. We have a model that that that strives to accomplish that deliver on that policy perspective both in the car. Text of the situations in which somebody might need a shift change or want to shift change or pick up hours or leave early. There is an incentive in the legislation that or a disincentive legislation related the penalty paid to sort of discourage the sort of short you noticed type of situations. There's also specifically related to the health of the worker aspect around around the openings as we like to refer to visit would get River do I opt in an industry is either the incentive there is if if somebody works on a clopening within a certain. Of times at hours, there is a requirement for the employer to pay in time and a half. I believe it is a to the employee in those events or doesn't prohibit the employee from taking up a double shift. It does however require that the employer compensate the The employee for having to for making the decision to do that. So I think we have examples of event hero ultimate Lee the the the policy that was driving us in the six rescheduling contacts was as you stated. It wasn't about giving the employee more money. It wasn't about penalizing the employer it was about recognizing that there are physical harms and mental harms to employees a house in doink openings all of the time and in the event that they do Duke openings because they've chosen to you for whatever reasons they chosen to do that. It is only appropriate to compensate them for that time could reminder. Thank you for that example of cuss words in it. finished their 8-hour shift But they did not do 5000 square feet. They did 3000. They just a little slow that day. I don't know what's fastest low in this industry. So, excuse me on that one, but then they want to work extra hours that day for whatever reason. Does it still trigger the 1.5 for the full day, even though the below the 5,000? I thought I heard stuff and say it 20 triggers if they went beyond the 5,000. So if they didn't do 5,000. They want extra hours. So after the whole day if I'm understanding correctly if they did 3000 square feet and say 6 hours or 7 hours and they requested additional square footage to clean and the employer agreed and then at that point they went over 5000 square feet. They still would be oh the 1.5 by the 9th hour if it's the 9th hour than that is 4000 square feet cleaned in the work day. It doesn't reach the maximum Force Base and they are played at regular rate. Unless the ninth hour is 5000 square feet and they work Beyond 8 hours. Do you have to be both for the 1.5 to apply for the full day square feet? It can be less than 5000 square feet if they're working if it's prorated say it so it say for example, they're working a 6 hour shift and they're not cleaning 5000 square feet, but maybe they're cleaning 3000 square feet. I haven't done my math, but it can be the 5000 Square maximum Force Base. It can be prorated based on the length of their workday. If it's less than 8 hours. I think you were asking about an eight-hour day where they worked six thousand square feet. Is that what you're asking? Beyond $5,000 we paid 1.5 for the full day, but I thought I heard Stephen tonight and I just want to understand it is if they didn't do 5,000 but they want to do some overtime. It does the 1.5 full day doesn't kick in cuz they haven't reached the 5000 square foot thing for the 1.5 gig in for the full day showcase. I just want to have employees work more than 5,000 cuz that bad backs bad apples bad knees excetera like we get that and so then it becomes of work management issue that the hoteliers if you will met at 5000 in bringing other people I supposed to do it because they're not going to want to withstand that. 1.5 full days. So that's sort of the threats what we're doing. But it seems to me that if you do have some employees and I hate to say this in this world of political correctness, but if you have some employees that perhaps there in college and they really want to do all this they want to work more than 5,000 to physically fit and maybe there could be some Wellness checks or something but they say look at I want to do 7000 cuz I'm trying to pay my way through school. How do we allow that? If a person has Wellness checks are capable of doing it. They're not my age and we still want incursion Porter to allow that as well it is there a mechanism. I wish we could encourage it if it's appropriate. My kids could do something like this, but I can't we don't we put we sort of this like one-size-fits-all the same as when you go beyond that 8 hours and five thousand square feet. That seems me if if we are really concerned about the wellness of the employee, which I think everyone is including the hoteliers in in many situations, perhaps they're not in these situations as well. But we could do like a wellness check and encourage it in those situations where the person just physically capable and willing to do it my concern about this legislation is that increases perverse incentive for people to because they need the money to go beyond the 5000 square feet in if they're at their own expense and their own health and then you know, if the practice continued they do 6000-7000 and there they bring home a bigger check but it's really going to hurt them in the long run because I think it's a policy option vs. Sort of a technical question the legality of it. I think that the example that council member Gonzalez shared with the clopening as if there's people who want to do that they're absolutely able to if they have them have signed up for that type of shift and that's something that they like to do, you know save the extra time and a half for the short. Of time prevents potential that they're working in the summer and they're able and are capable to do that next signed up willingly to do it on that is something This legislation has allowed for but it also recognizes that much of what we're hearing so far is individual to feel that pressure to work the extra time. So it's not about not being able to be trying to create that does incentive. I'm so I think to answer your question. We have created the ability for those who do have the ability interest in doing so I'm to be able to take that extra workload on but the reality is from many of these workers who we've heard have worked in the industry for years is that they are in situations where they're going to work more than they actually can and the consequences. We have higher rates of back injury in hotel industry for these workers than construction and coal mining and with that level of back injury and and I think overall health complications that are created by this excess work load. We have a real opportunity to really limit the square footage like these are there isn't then I think and will continue to look into I know I saw a simple. Stop taking notes. I think the answer to your question is we have created the ability for those who do have the ability to continue to take that excess work on and for those hoteliers who want to pay that extra amount just like they do for the clopening example. They still have that option byproduct of the legislation still tell her she's drinking a lot of overtime. I mean, I don't know what I would say trinity because It's going to take the bottom light out hotels. And so so how can you create an allowance is sort of a win-win for the employee in the hotelier. It fundamentally comes down to the the argument of the points that you are making council president Harold are fundamentally. What were what we are in the secure scheduling contacts around flexibility and the argument from restaurant and retail for the industry side of folks was really like these employees want to work more time and they want to work more hours and that might be true for some employees. But I think we learned in the secure scheduling contact that that was a minority of the employees not sort of the whole industry. And so I think it's important for us when we're cracking this legislation is to really craft legislation to make policy choices based on what is sort of more of the mainstream perspective and an answer of Desire of the workforce as opposed to what a few people might want. Otherwise, we're going to we're going to create an exception in the rule that you can drive a truck through and I'm not sure that that's what we really want to do. So that's one thing the second thing I would say is that again. I think the policy choices before us is what is the problem that we're trying to solve for me. It's not about getting more money in the pocket books of employees as a matter of law or the matter. Of course, it's about prioritizing the health and well-being and the safety of workers in this context. And if we create a spade a set of laws that effectively is 2 + it doesn't mean anything because you can always find an exception to allow workers to work more. Then we are cutting against a policy position that really is designed to prioritize the health and safety and the well-being of workers as opposed to the finances of the worker. So again, I think we just need to to really focus on the flexibility aspects of the concerned that will that will not serve tie the hands of workers or hotel management so that if they have a reasonable legitimate need to have more labor Delivered to them to clean the rooms then they have the flexibility to do that. But when they make that choice, they understand that that that the employee deserves to have the time the extra time and effort and exertion and physicality of doing that work that that worker deserves to have that valued and compensated in in a in a more fair way and I'm not saying that in a pain I'm just minimum wage is not a value, but I just think that there's a policy position that is important for us to take that says we think that it's important to protect the safety and well-being of the worker in a fashion that we want to create a disincentive to just constantly have that employee come back and do more hard work for the same exact rate. I appreciate you bringing that up. And I know there was a mistaken as we're doing issue identification. I believe it will be reflected in our next memo as we consider these ideas and Harold. I just want to underscore that I hear you in terms of looking at what other examples main system will do some additional research protecting employees from injury in the auction Beltline is just a recognition of how hard this work is often times that you think about 5000 square feet. But if you ever had to clean 5000 square feet if you're expected to do that every single day, it is a Monumental task. I don't want to underestimate. So we're trying as I say to to balance what were asking at the art workers to do but at the same time recognizing what the needs of the hoteliers might be I think there's a balance here that we can reach but I do want to say if you want to acknowledge the work that is done because Frankly, if you've ever made a king size bed by yourself that is a challenge and it in itself and if you have to do 15 of those a day, that is a big deal. Thank you. All right, let's go to section b or sorry 1B definition of surname is cleaning floor space is set at 5000 square feet. Floor space can actually be reduced depending on the types of rooms that employees are cleaning. And if the employee is cleaning with what is called a strenuous room cleaning, then it actually that maximum floor space is reduced by 500 square feet for the 10th strenuous room cleaning and for each strenuous room cleaning there after so then the question becomes what what is strenuous room cleaning the ordinance defines it as the cleaning of a check out room and a stay of a room that includes the cleaning removal or Set up a cot roll out bed Hideaway sofa pet bed or crib and that for the most part and beers. What is in initiative 124 something that is due is an additional requirement that a stay of a room that has not received a room cleaning for more than 24 hours. And so that's recognizing situations were perhaps there's a green cleaning initiative happening where the guest is not having their room tidied for the duration of their stay in an effort to wash beer Towers or to change Pur sheets. So we've heard from stakeholders that perhaps for that third prong perhaps more than 24 hours isn't long enough to reflect a situation that is a strenuous room cleaning perhaps it could be increased and idea could be more than 36 hours for employers, but we've heard is this could represent a more realistic. Threshold for rooms that Merit the title of a strenuous room clean for employees this could impact their additional pay requirements in impact the protections of the ordinances far as protecting them from workplace injury it focuses on really whether the additional 8 hours materially affect the safe working conditions and the workload give me the work loads of employees. I want to Echo what you said we did hear from stakeholders and we're looking at the top of page 3 on the memo from July 15th. Thank you Karina for dropping this for when you see mended we've heard from stakeholders. This is really exciting because as complicated as legislation that we have heard from both of us work in the industry as workers and those who work in the industry as managers and owners. They say that they think 36 is a 36 hours is more in line with what's appropriate. So I'm feeling pretty good about the feedback that was received so far around potentially moving this from 24 to 36 hours and I would also welcome folks to continue to send us feedback. They haven't been shy so far. I think you butt on the 36 hours. Peace. If this feels like we've gotten that component, right that is one small step in our conversation here 36 hours makes sense though, cuz I'm sad and a half. Into a hotel be there for two days. We can explore additional hour requirements for flight hours back from both workers and hotel managers and we've deserve one of the areas where there's not kicked the Hornet's Nest more especially if I just finished cleaning up and then to stay over blah blah blah checked out of what what is Check out room means that the guest is checking out. So the room needs to be completely turned over and prepared for a new gas as that's a significant amount of work 3624 issue apply to everything a check-up room and a stay over room. I think number three are we just what was negotiated a 24 to 36. I try to understand there's a 36 hours apply the one two and three or you know, that's a good point. It would seem to make sense that this idea that a room requires more cleaning if it hasn't been looked at for 24 more than 36 or other number of hours of weather at stay over or check out that's going to Merritt strenuous cleaning is if that's what I'm boring you say. Check a room is everything right? So look, for example if I'm staying in a room for 3 Days the cleaning doesn't have to be at checkout room. It's a stay over room for the second day in the third day. So last days when someone checks out the check out of his room to someone checked out of sitting there and you don't get fresh sheets. Don't scratch. Don't do the full 100% scrub. and if they over room the intent was that the 24 hour or 36 hour. Would apply to item number three only. It wouldn't apply to check out room or to the rooms with those particular items like a car that bad cleaning is in a room where someone checked out. That's right and everybody's fine with that. Yes. And thank you, but I guess I will just follow up with you on any of the conversation we have for the next 25 minutes here. Thank you. Thank you and me once in the language that were using that would be helpful to clarify on the number 24 vs. 36 again. Feel free to give us your feedback. I was feeling pretty confident about the feedback. We received from both parties and looking forward to hopefully getting this over the hurdle at the next meeting. Thank you. Crab, okay. So I'm moving on to the hotel employees job retention ordinance the primary issue that we've heard about this ordinances coverage that includes ancillary Hotel businesses and to set the stage for the larger picture all for pores proposed ordinances in this package of legislation protecting hotel workers cover employers who own operator control hotels of certain sizes 3 of the ordinances including this one the job retention ordinance also cover ancillary Hotel businesses. And in this ordinance also has an additional threshold for coverage that an ancillary Hotel business has 20 employees worldwide. The definition of an ancillary Hotel business is contracted least or sublet premises connected to or operated in conjunction with the hotels purpose or providing services at the building. So this these are businesses that lease space from the hotel. It's connected to the hotel's purpose or operated in conjunction. So it's helpful to know for a reference that initiative 124 also covered employers that met this definition the initiative 124 didn't use the term ancillary Hotel business, but it did cover them. So it's not a new idea actually in this proposed ordinance. It Narrows the application because it has that threshold requirement for 20 employees worldwide. And one I think that's really important. I hope so still got a chance to hear that here and who might be watching online. This was included in the initiative 124. In fact, the language that we're now talking about specific to the section is narrower. I also want to remind us as we have a conversation around ancillary businesses for the section. This is not yet our discussion opportunity for how it applies the hell can't we are going to do that. I promise I love her healthcare, but that's going to happen in two weeks. And so this is specific to of our discussion today around retention. What we've heard from employer stakeholders are concerns about the impact of this ordinances requirements on small businesses who are meeting this definition. These employers have shared the belief that the definition is too broad and their opinion and includes businesses that they believe might be 10 gentle to the hotel's purpose such as floral stores clothing stores hair salons day spas at restaurants and coffee shops. These types of business might be located on the hotel premises and also serve the general public with or without customer access into the hotel. So several ways to address these concerns one is for administrative rules that would be developed by the office of labor standards to clarify parts of the existing definition. So rules could clarify what it means to be in quotes connected to an operating in conjunction with the hotel's purpose providing services at the buildings and the rules to determine whether that restricts certain types of businesses and other approaches to amend the language to be more specific and establish more discrete parameters such as covering businesses that support the hotel's core function or the businesses that provide services directly that benefit the hotel guests again, it's possible that these amendments still would require clarification from administrative rules, but there's more guidance already baked into the ordinance. The third approach is to slim down the net definition more and to focus on specific types of businesses such as for example Food Service establishments is food store service establishments that either exist on their own on the premises or even further contract with the hotel. So that's recognizing situations where the business is truly are serving a function of the hotel and if we look into the past one remembers hotels that we're doing it all hotels that had employers that were providing the Food Services. I providing the gift service or the gift store. Retail service and directly employing the hospitality management. So this could recognize that for some hotels that function is being contracted out and in so this it would cover them. Another option is to eliminate the coverage of ancillary Hotel businesses all together. A question around food services. So I when I think of Food Services, I'm also thinking of coffee shop. Do we have to say food and beverage to include coffee shop and bars or is Food Services all-encompassing of Moore beverage oriented secure scheduling there are industry code definitions of food and beverage establishments and we would need to think about that. We would need to think about does the ordinance intend to cover coffee shops, or does it just intend to cover a full-service sit-down restaurant is it does it intend to cover a fast casual food service establishment that would need to be considered as our process is to identify issues. I'd like to make sure that we as we're talking about food that were clearly talking about food and Beverages and I want to just make me My colleagues in the public aware. Obviously, we are accustomed to having coffee shops and bars on premises and I think that that's in addition to potentially a full-service food restaurant. So what that's really important for me that the exact definition the encompassing of a beverage oriented businesses as well throw out a little note of caution. Once we start getting into types of establishments and that's that, you know, it's really It's hard for me to imagine a definition that would effectively be a response to the wide inventory of the types of businesses that might be co-located with hotels that are either Contracting with hotels for services or who are really part of the core function of a hotel. So people that comes to mind as we say here is around the food and beverage thing is there's like we have this list of different types of businesses that we didn't include retail for the night. So I think start getting putting ourselves into a situation where we have to enumerate everything that might be possible in in sort of co-located businesses at hotels. And so I think the challenge here will be to come up with the definition that perhaps is a little bit There's a little bit clearer around sore. There's a little clearer and more solid wizard of who are we trying to cover and why and I don't have a clear answer for you as to what that is right now, but I do want to just throw out a caution on that piece in and out conversations about how we serve Russell with that definition so that we're not creating sort of an enumerated list and then that if you're not you're not covered even though you could be located within a hotel. Thank you for that. This retention ordinance peace were certain negotiated because I bought it for it to 70% and 80% are rounded up. My focus was on the the housekeeper's quite candidly these the safety in the health of those employees and well did the term average of 10 and social? Well, I didn't pay that any mind. I didn't see it. But what kind of late so I think that when we use has served the argument that that that what that's what the voters one and I don't know if that's completely accurate maybe people all thought all y'all got to get those tenants to to make sure they're the reason why this conversation was difficult for me because I want everyone to have these these these benefits whether they're 10 it or not, but it does seem like we are sort of cherry picking little bit that if we have the smaller businesses, even if they're 50 plus that they are now treated differently just by virtue affect the rent a hotel Just by virtue of that fact alone, but they are they could do that identical business three blocks away and then they're not covered. And so it was seen any that if our core competencies legislations going to be the protection of these housekeepers than this part is inconsistent. This part doesn't make sense. So I'm trying to see why we would cover just by virtue affect the tenants. I think I heard some tests on that. So I'm sort of struggling with this piece a little bit and didn't with Stefan and the great advocates for workers. Why can I not even sure why they're so best in this piece as well? Maybe it helps them in the work that they do. I don't know but I do miss line. That's one of the questions I was asking about hearing in the city. I don't know who these businesses are. Have we heard from them? So I'd like to see a little work done on. I mean it I like three that have 50 plus are there a hundred that I don't think we've done that working. So it'd be nice to know who it affects before we just heard to say this is good policy. And then and then the global work we do if we want to look at those small businesses and try to give them the protection that they should have. In alignment with employees that work with a larger corporations, that's a different discussion. But in this legislation, it seems to be a little Miss alive. That's just sort of my transparent dialogue in this issue about thank you and I will appreciate appreciate that. You're in that there's one item. I'd like to flag as well use the terms core function and then on item see here we talk about contracts a one area that I've asked for feedback from the sticklers both on the hotel industry side. And from the worker advocacy side is to help us with an understanding of what it might look like to Define business relationship. Sometimes there's a business relationship that is not a contract. Sometimes there's a business relationship that provides a core function to the gas of a hotel but they are not considered core function in terms of their not cleaning rooms at the hotel. So one of the other areas that I'd like us to continue to explore is where we have another area. Stop Shield. I used a definition around business relationship and that may be of interest to our Council colleagues as well functions piece. I'm not sure we've got to find that in the ordinance. We have not and so that would be something that if it were added to the legislation, it's not in there right now right now. It says hotels purpose that could be defined in the ordinance. It could be a hotels core function is doing at providing room accommodation overnight accommodation. And I want to also I believe is defined in RCW. So they're potentially is a place for us to pull from mocha made on both sides about that particular component is released ancillary businesses. And so I think that the finding it as housekeepers only is in is too narrow, I think Sing it is everybody in the sun. It might be to God and so I just wonder if there is a better a better more appropriate way for us to sort of think about what the core function is of what does it mean to deliver Hospitality services to a person who actively rent a room from you for a set. Of time I think is that is it might be a helpful construct for us to look at in determining whether or not we can come up with a clear definition around Coast services that might address the issue that I signed earlier around move perhaps moving away from enumeration of types of establishments and really focusing more on this thing. They do that would be really the anchor of of who would be covered. various different parts of this legislative package But I agree with that but getting the the list of the businesses that are affected by this at that should be fairly attainable item engine without rescheduling we struggled with it and paid family medical leave. It's just we don't and we struggled with it. When we looked at the employee hours tax in terms of who would be impacted by some of these issues. The city just doesn't ordinarily track this information and if it does can FAS considered proprietary and getting the tenants the tenants of the hotels just one of the list I'm not the employees just to tenants of the hotels that's got to be a finite list of that's got to be a courtesy of OLS is a list of the hotels that are covered by this ordinance. Knowing that businesses that the hotels contract with our sub leads promises with that seems like a heavier lift to find out what there would have to be a questionnaire sent to them and not quite sure how we'd find out that information field trip. I think they're somewhat organized by virtue of the testimony. We hate her. So, let's see if we could try at least instead of just saying we can attend I think we should be able to get if we offer to stay over a check out room West. Okay, and I think we're at the end of your impressive memo here as there anything else that you like to say as we look at these two 2 components of the overall package in our attempt to try to identify issues we want to underscore we have two weeks prior to when we're hoping to bring back these two components of our package for potential vote on Amendment. And obviously there will be more chances as we vote on the final package all together, but the desire would be to bring forward any amendments on these two sections in the next two weeks for potential vote any other comments on these two sections of thank you for your patience. Thank you for your patience. As I appreciate it a reminder. We will have a chance to have a discussion in 2 weeks from now. Our next committee meeting is on July 18th. Will we will be discussing part. That's today. Alright, thank you one which is Aubrey related to Safety Council Bill one 19557 and part three which is related to the healthcare components. A lot of research is happening right now. I want to thank both of us from the hotel association and from night here and the folks bows on the side and the managers who come to your comments and questions and concerns have been well-received and we hope to have on some materials for you all to look at a next week. So that people have ample time to review prior to our committee meeting these two sections do let us know. If you have other ideas that you like Central staff to look into I would assume that your deadline is relative. Early next week for trying to craft amendments to the section. If I say Wednesday is that too late if folks get you information by Tuesday, I think that that would be preferable that you can then generate some information for us by Wednesday and Thursday and that will give us another full week in theory to review some of the potential amendments. I do know if you have any questions or additional amendments that haven't been identified today and that's where our full Council colleagues if they're watching at home. I hope you are hello and we look forward to talking with you about this legislation in advance. So that potentially we can work on amendments together that will ensure a smooth meeting next week. We do have I believe 90 minutes allocated to this in the upcoming meeting. So it's plenty of time to talk about both amendments to these two sections and then to do this issue briefing as well on the other two components and as a reminder for everyone who is interested in coming to testify Final vote in our committee will not occur until the September 5th date as according to our new timeline at 9:30 a.m. Included in the agenda hotel workers industry-standard legislation on the two components. We talked about will also have a chance to hear on the MST renewal and annual report. That's a multifamily tax exemption renewal and annual report items forward. Again. Thank you so much, and we will adjourn for today. Thank you. Cancel College.", "end_time": 8071.8}]}