{"format": "raw", "annotations": [], "confidence": 0.9322425264938204, "data": [{"start_time": 0, "text": "Good morning, the August 7th 2019 meeting of the planning Seattle planning land-use and zoning committee will come to order. It is 9:36 a.m. I'm Abel Pacheco chair of the committee. I enjoy my council member O'Brien. And so we have three items on the agenda today briefing discussion impossible a resolution 31896 the annual comprehensive plan Target set resolution a briefing on Council Bill 119600 updating our city seba policies and a briefing from the Seattle Planning Commission on their neighborhoods for all report. My schedule plus meeting is on Wednesday, September 4th starting at 9:30 a.m. Here in council chambers before we begin is if there is no objection today's agenda will be adopted. You're not at this time will be taking public comment on items that appear on today's agenda. We have 10 minutes a day for public comment speakers are limited to two minutes of public, Niven speakers, a season 2 minutes microphone will be turned off speakers are asked to begin their comments by identifying themselves and you denied on that they wish to address as a reminder public comment isn't limited to the items that are on the agenda or within the purview of this committee. First heartless is Cori Crocker. Good morning council members to my name is Corey Crocker. And I have a home in small business and have lived in the U District the past twenty-eight years and I was very concerned when discover the proposed amendments to our City's environmental review process in compliance with the state of Washington Seafood regulations. And my question is how will the recommended changes impact our local community as we become a high-rise urban center. I'm all you visitors. Are you District? But allow me to put our challenge into perspective. The average height of development on the app is about one-and-a-half Stories. The current zoning can go up to 265 ft what you're asking us to do is to take it from the floor to above my head right behind the alley of the ad you can go up 320 feet. That's an incredible amount of change in our small District in a very short time. So we have welcomed or density with our 2017 upselling than any other urban center outside of contiguous downtown. We're doing our fair share. We want to make density work, but we are losing our small businesses 65% of them are owned by women are people of color with the adoption of the UPS on two and a half years ago you the council promised our community 7 companion resolutions to make it work. One of them was a historic district on the Ave. Another one was the Legacy Small Business program so far there has been very little progress on both of those let alone the others. A council member of cheka, when you were seated after your appointment. You said that you would likely support up zoning the street known as the Ave while seeking to alleviate concerns held by small business owners there. So we're asking you were pleading you to please consider the impacts of these changes to our small business Community. Thank you. Thank you. Thanks. Carlos is Rick McLaughlin? When I heard the rumor that you guys are going to try to strip out some of the ordinances of C, but I thought it was a joke. I really laughed. I was like, why would they ever try to pursue limiting the rights of residents and citizens of Seattle to be able to help guide how the city grows and the only answer to that is essentially they're trying to take the rights away and they're trying to make it so they can grow. However, they see fit without the consult of small businesses and residents. So, I hope that the rest of the council sees this as a joke because I see clearly has a joke. I mean, why would you try to take away the right to an appeal and limit the ability of essentially development in the city? At the end of the day developments going to happen. It's going to continue to happen. It makes no sense to try to take away the voice of the people, and that's what you're trying to do today. So I heard you to pull this ordinance off to remove the bill and to actually assess where your heart lies, and if it's with the voters and the residents in the citizens, or if it's just with development firms, so, please take a good luck and thank you. Thank you Rick. I also this little side coming Rick owns Big Time Brewery. It's a little early, but it's an award-winning Brewery in District 4. Next on her list is Laura Lowe. Good morning, everyone and happy day after the election. So I came here today to talk about the abuse has that I've seen the Ceiba and also to see how wonderful the neighborhoods for all plan is. I know both of those are on the agenda. So this ePub use that I've seen over the last 4 years following landy's closely as a volunteer housing Advocate endless delays using the stand iron metal protection act on a local level to prevent affordable housing being built it for preventing safestreets projects across the city really Common Sense things that need to happen during a housing in a climate crisis and how folks are able to use the way seba is right now, we're not getting rid of sibo. We're just making some little changes that will make it work the way it's supposed to work and not be able to be used and co-opted for obstruction is purposes especially during the urgency of climate and housing crisis. We need to make sure that folks are acting in good faith and Racine super uses never almost never in good faith. It's always being used to delay delay delay, and it's resulted in many dollars lost for affordable housing and injured because they didn't have the safe and infrastructure that they needed across the city to get around safely. So I'm really excited you're working on Subaru for him, and I'm really excited to hear about the neighborhoods for all updates and plan from the play. Thank you. Thank you. Next release is Megan Cruz. Good morning. I'm here to talk about 119 600 and the dismantling of seat protection yesterday. The council has a rally about the Seattle Green New Deal. They urged us to join a board and fight carbon emissions and climate change research that they see as the number one crisis and the very same session the Consol her to report finesse. That supported developers paying a one-time Transportation impact fee as an alternative to performing Ceiba mitigations something that's meant to protect the public and today's ordinance the mayor and the council say they believe C4 review is largely on necessary and can be supplanted by the city's codes and design review board. Doesn't anybody see a disconnect here over the last few years design review has narrow disco downtown where I live. It's all about Tower Aesthetics and how it fits into the skyline citizens chalk. The neighbors talk about issues arising From The Towers transportation and waste design a tight bulk and scale in packs to smaller neighbors. The answer is always the same. We're not experts in this area. It will all be addressed at ceva yet this legislation seeks to shift technical parts of CPA review to a design review board that doesn't want that and isn't qualified for it admittedly cepa is a uniform Statewide standard for environment environmental review. It's a backstop legislation to ensure environmental best practices and citizen participation developers are calling for its dismantling because of their unsustainable designs if they're being challenged instead of looking at the repeated nature of these challenges and fixing what's going wrong at design review and mop this bill Chastain's roll steam rolls over public protections. Please go back to the drawing board with this ordinance projects would not be challenged if they started with neighborhood and put and sustainable design. Text Sarah less is Charlie lawyer. mayor, sorry Charlie I'm not sure what the plan and is not once again seeking inclusion in a comprehensive plan. A resolution before he was almost word-for-word the same resolution the full Council approved unanimously in 2016. And again in 2017 these resolutions requested the executive to evaluate the stadium District plan make recommendations for potential amendments to the comp plan in 2018 committee recommendations were made but no action was taken. Our joint PFD PSA committee has met every Criterion mandated by the Executive Inn in Council or docketing our proposal it move forward Again by the council our proposal would change nothing in stadium District zoning until and after the mayor's industrial land you study and after the city's rigorous land use process on each new zoning requests in the future. We've heard some concerns about our proposed on we listen to them. We're ready to address them such as potential boundary changes future uses in and adjacent to Industrial and Maritime lands study of those lands. If conducted in a more timely manner could provide some needed Clarity from moving forward in a landscape with intense private developer interest, especially on currently publicly on land and in the stadium District or the zoning permits office development, but not the mixed-use development and public use needed my Pioneer Square the port soon to be named Cruise Ship. Terminal operator and the publicly-owned stadiums. Please approve this resolutions before you which meets our needs for both schedule and plan review work with us to address any concerns you have and help us carry out our statutory responsibility to protect the investment in our stadiums on providing Workforce housing new compatible Light Industry and Training facilities for young people seeking good non tech jobs making things jobs, which I might heavy industry are well suited for the healthy safe and vibrant mixed-use neighborhood we envisioned. Thank you thinking my Aurora. An external this is Eric Fitch and Chad's Sue wood following Eric. Thank you for checking accounts members Muskegon O'Brien. I'm Eric Fisher on behalf of the Port of Seattle in the seaport Alliance you spoken to you before about our support for the working Waterfront. And when you got to work featured deal on those issues, we have asked you not to talk of the post dating District complement its before you today. We know you'll be speaking more about that later in general were opposed to moving removing lands from either the cities to manufacturing industrial centers without the benefit of a comprehensive region-wide industrial and review the resolution before you today includes not just the stadium District, but other properties in both of the city's next and we have been given a firm commitment from the mayor that she will be soon reconvening a reason why review of industrial and just the word on the manufacturing industrial centers or mix they are engines the power Regional economic growth and diversity the Ballard North End Nick host more than 10,000 dustrial jobs as of 2015 and as of 2617 year olds. I found that there were more than 35,000 jobs contained in the duwamish mick. These are jobs in an array of Industries available even to the city City's residents who don't have a college degree. We thank you for your openness to discussing this important issue with us and supporting a deliver to Regional process. We look forward to continuing this conversation with you before we thank you. Thank you next. Members of the council my name is Chad seed for us businesses that work to provide middle-wage middle-class jobs for the city. And for our region are we oppose the action to dock at the stake in District plan and other actions that might become before you to address industrial and so we have a comprehensive review of of industrial bands as proposed by the mayor recently in the letter to the council the industrial ants in our city our are important for maintaining jobs in our city for for sustaining working-class opportunities for people from all the education levels, whether it's high school college or elsewhere. We don't have those jobs. If we don't have the industrial plants in our city and we must maintain them the maritime industry in particular needs to have those industrial lands at 2. How to operate we have unique characteristics in our city that provide for a deep-water Harbor at freshwater moorage inner cities, those things don't don't know swear. We can utilize that unless we have the plans to use access That Into You So Sports and those other sports facilities, we need to maintain those and so any actions that take that are taken to address industrialize must be part of a comprehensive plan considered under that plan first. Thank you. Thank you. Next is Carlos constanzo. And Lou Bond is after. Good morning. Chaptico. Thank you. I'll name is Charles costanzo American waterways operators on the national trade Association for the tugboat and Barton Street also serve on the board of the Washington Maritime Federation Statewide Association of trade groups that supports policies that strengthen Washington Maritime also speaking in opposition to the docketing of the amendments. Sweetie today as a as a sports fan, but also on behalf of the literal Seattle Mariners city of us is Identity. The maritime trade the exchange of ideas the coming together of diverse peoples and cultures and the maritime industry that supports the livelihood of thousands of Seattle residents say you'll consider changes to the Future land use map and I would like to remind me that these choices one form of ability sustainability and livelihoods for future Generations 17 in 2017. The combined economic impact of washing Maritime industry was near 38 billion dollars for the direct revenue of / 17 billion / 70000 washingtonians are directly employed in the expanding Maritime sector with average annual salary of $65,000. The maritime industry in the industrial and it occupies Sports an additional $190,000 throughout Washington this vibrant Maritime sector supports a diverse Workforce and drawers on a vast network of supplier businesses jobs are working Waterfront in our Region's manufacturing businesses pay a living wage to support a family that can support a family and in many cases do not require a college degree. We were we oppose the removal of manufacturing and Industrial and around the industrial epicenter of the Port of Seattle along the interstate Corridor and Indian do Amish industrial area. Please let us stop taking manufacturing industrial centers in them over for sports or entertainment complexes. Stop threatening to take those lands that damages the confidence the sink down roots and keep our communities working. It hurts working people when they threatened to disrupt land use that sustains good paying jobs and replace it with land use choices that support jobs that don't play as well and makes her City less affordable less livable and more of a playground for The Wealthy. Policy where Maritime City trading City they made us what we are and we can't seem to achieve escape velocity from these proven bad ideas. Aw overages the city council to remove from docking actions that the private cities manufacturing base of industrial lands alternatively. Please refrain from actions on docketing until the city can beans a comprehensive Citywide update your industrial land use planning framework. Thank you. Next is Lube on and Bryce is following. Thank you for hearing us today. My name is Lou Bond and I'm with the Melbourne Tower been the manager there for 32 years 3rd and Pike some of the concerns I continue to share is where zoning is different or up Zone from zoning areas that haven't and we're at 3rd and Pike and does zoning up zone between 2nd and 3rd and a half block where the Ali-A joins one of the challenges that we have that this would not allow a directors. Will the change is that the alley is our primary use for our half block for all Transportation type needs all deliveries of any kind. 3rd Avenue became the bus lane. So we've lost our front door Pike and pine have been restricted from three lanes down to one lane because of a bike lane and because of a bus that sets on Pike Street as a temporary place to park so cutting in on on Pike or Pines become very difficult 2nd Avenue and turning off of it a new development wants to be put there. And they want to come to bypass all these kinds of impacts that are going to place a burden on our neighborhood, and I don't think that this kind of design change that doesn't give it that all of those kinds of concerns that comes up with the neighborhood plan that's going to really work long-term, especially as zoning areas butt up against one another like ours, so I'm really against this and I think that the seafood really important that we continue to be able to vet those concerns as it relates to Neighborhood by neighborhood because some of these zoning changes are are very broad sweeping and they don't really deal with specific neighborhoods that are going to be greatly impacted like ours. So we're hoping that you would vote that down. Thank you. Cherub members of the committee. My name is Bryce Aiden here on behalf of futurewise. Today. We're here in support of updating cepa regulations and embedding state regulations into city code during this last 2019 sessions utilize work really hard on House Bill 1923. We don't take C4 Safe Harbor gently at all. We understand the needs and requirements that she provide for communities. We also understand that were in a housing in climbing emergency and we have to weigh those when we weighed those throughout the entire legislative session to figure out how to move forward and tell you what this still does not do this still does not exempt Sea by the city of Seattle when they go to update their development regulations or land. Use codes are still going to have to go through receiver process. Any is there still going to have to do a number of an ESR checklist? They're still going to have to do a number of Outreach. So just to be very clear. This bill does not exempt that the other thing it does not exempt. Level CPA requirements. So, this is just for these 12 actions that are allowed under under house bill 1923. So I'm here today in support of that in addition. I think that they're moving forward. We we understand that. We do need this. We understand that that as we move forward. We want a comprehensive conversation on those 12 actions that could potentially happened to make sure that we are taking the Empire and understanding and we we look forward to working with you and implementing this moving forward. Thank you. Thank you. I'll call you if there's no objection. I'd like to extend a public comment for another 15 minutes here in a Russian accent public on another 15 minutes. Next Wireless is Alice Lockhart and Jess. Wallace is after. Good morning council members. I'm Alice Lockhart for 3:50 Seattle Housing team and for our children and our grandchildren and their hope of a livable future. I love that soup. The reform is on the same agenda today along with the neighborhoods for all report in Seattle the primary use of cephas seems to have been to obstruct legislation that would allow climate-friendly development and helped curb climate destroying sprawl this use of environmental statutes to harm the environment and preserve a climate destroying the status quo is frankly she and I am sick of it. The climate clock doesn't allow for further delays and instruction and happily the state of his health fully updated there Statute in ways that allows this form at the municipal level. Oh no, thank you for your work on this issue. I also love the careful analysis and the neighborhoods for all report. Which Chronicle Tell racial covenants redlining and more recently exclusionary zoning have been used to restrict access to many of our most verdant and pleasant neighborhood where opportunity is today limited to those who are wealthy enough to afford a single-family home housing reduces per capita carbon Footprints, and we know that only wins Seattle single-family neighborhoods become more will we be able to provide them with enough frequent enough transit for climate-friendly commutes for opportunity for our neighbors and for our children's and grandchildren's future now is the time for Cipro for man to welcome new neighbors to all of Seattle's formerly exclusive neighborhoods. Thank you. Jess Wallace Good morning. Cancel. My name is Jeff Wallach. I'm also at 3:50 Seattle but here to speak on a different issue about the comp plan update and the proposed docket titled climate change and fossil fuel storage in production yesterday. I was here with Community leaders and over dozens of community community residents talking about climate pollution and talking about the impacts of pollution on our house. We know that fossil fuel infrastructure threatens our communities it shortens life span to create respiratory issues that leads to increased hospitalization and it contributes to The Climate crisis, which the World Health Organization has declared the greatest Public Health Challenge of our time and local governments around the Pacific Northwest have recognized that can be done to use Innovative strategies to protect the health and safety of local residents by changing land use zoning code to prohibit new major fossil fuel structure Portland at this first in 2016. And since then we've seen communities in Whatcom County Aberdeen Vancouver Washington follow suit, most recently the port of Port of Vancouver. Do you think it's land-use authority to prohibit new major fossil if you want the structure to protect local residents from fossil fuels threats and to make sure that the port is making smart investments in their economic future that are in line with the health and safety needs of local communities. So I'm here today to encourage you to move this study for it and for the city of Seattle to consider what it can do to protect local residents from fossil fuels threats earlier this year King County made a similar move past a moratorium a new major fossil fuel infrastructure and kicked off a longer-term regulatory right to consider what the county can do it. It's land use authority to protect residents the city and the county can work together on this and the city of Seattle can build on what King County has already put in place and its comprehensive Plan update to make sure that as we move forward into a climate change future we're doing everything that we can to take care of people here protect health and safety and we are clinicals and you and then it's fall. Brittany Bush ballet Good morning. My name is Barrett Erickson. I'm the Workforce Development director for the sailors Union of the Pacific in a resident of Queen Anne. I'm here because we oppose all removal of Lance from the maritime industrial center. And I'm particularly here because I'm a member of the Seattle King County Workforce Development Council. And I'm also a member of something called a marine Transportation National advisory committee. And we advise the Secretary of usdot on Maritime issues. My specialty is Workforce Development policy in the maritime sector and so from federal to local Maritime Workforce policy is being developed over and it's in conjunction with the use of proper industrial and using American sector VIs. . She has put out a solicitation for major infrastructure ports grant that I'm sure that the Port of Seattle has applied for four more infrastructure development the Workforce Development Council is developing policies around the maritime sector for job training. All of these are all of these policies need industrial lands to be maintained. So we have the jobs that are available to the young people that we are training for these jobs, and that's pretty much right up to say. Thanks. Thank you. Texas Brittany Bush Bley and then Steve rastello Hi, good morning. Council members and Brittany bush people lie on the chair of the Sierra Club Seattle group, and I am here this morning to express our support for sea level changes that put Seattle's hebra process in line with current state guidelines that provide predictable and reasonable hearing examiner timelines and encourage infill development encouraging infill development. As we know is one of the most important Urban environmental acts that we can take attacking both of our major sources of admissions at the same time. I welcoming smaller and more efficient homes into our city and reducing car dependency making more people able to walk bike Transit and opt out of using cars, I think it is incredibly reasonable changes that will actually protect our environment allow us to act quickly and we aren't sore. Thank you. Thank you. You all are for saving the trees in the Amazon, but how about the trees in Seattle? Great environmentalists that you are we're going to strip CPAP. We've already stripped out of design review a great deal of the public input if you're going to make cepa move faster. Put the beginning of the project put your climate change put your parking put your scale as the two zones come together. Take a look at access have a real design review not the color of the Hardie board. Not just the very simple things you're doing now because I'm review is not doing its job if design review was doing its job the argument that the backstop is getting too many things. Why is the back stop getting too many things because you're not doing anything at the front end. That's the problem you're trying to keep people out of zoning the people who live near the projects of people who worked in the projects and we must put people back into the process or you're going to have continued problems. Many people really wonder what's the difference between developer approved Democrats and socialists and Republicans. You have the Trump agenda for land use your big-time developers get whatever they want. Now the smaller developers and people are just trying with a porch on their house. They don't like you that much but the big-time developer seem to be your friends. Let's come back to the citizens and let's bring people into the process, you know, this has been very hard to get close to I keep bumping you this sign that says property of the big-time development industry are property of I don't think you really care what people think poopy wrong, please. Thank you. Steve Nexus Dan mackensen, and then a final of the final person analysis David Ward. Warning councilmember sink for the time today. I'm Dan the kissing with ILWU Local 19 and present Washington area District Council. I'll W represents workers on the waterfront and we oppose docketing the amendment to the industrial Lance. We feel that we look forward to the industrial lands panel study. We do we're pretty confident that it's going to find it the industrial answer for you. Last. I remember the Great Recession we had during that time the lands and so do I make car always in the high 90 percentile of usage and it didn't decline our membership during the Great Recession grew by 30% So there's jobs out there. I want to point out one particular piece of property pier1 over West Seattle real small piece of property zoned industrial fully utilized right now. It has Industrial Equipment supporting industrial jobs in the city. Thank you. Thank you. Next is David Ward. My name is David Warden. I'll be speaking to the seat issues today changes to the seafood policy is nothing short of outrageous gutting of sibo and a truly anti-environmental bill. It's very pretty and very Pro developer at the expense of Apollo giving SDI. Say over CPAP policy. When s d i s t i c already has ignored many seat issues and weights many requirements for Darrell developers is truly too damaging to the public. You also would exempt further projects from C4 review and limit to hearing examiner 220 days. Both very damaging policies. Also removing the language to stop projects from moving forward while under appeal will allow developers to continue getting permits without dry environmental policies that increased traffic eliminate trees displaced people create further infrastructure problems further further. combination of these policy changes will make developers ecstatic since they have them since it will it will virtually lemonade developer account ability to see but something that they have been looking for for years. So I heard you do not do this. It's going to be very damaging to the city and it will make a lot of money for the developers. Thank you. Thank you. Is there anyone who did not sign up that would like to speak out to? Okay, make sure 3 but can you please be sure to sign up so that we can have it on the record? Call Ace if it's okay electric send for another 10 minutes. You can sign up after speaking. Lausanne Lions on behalf of the public facilities District in the public Stadium Authority. I would just like to say that we unequivocally support preserving industrial jobs and the maritime industry within the city of Seattle our proposal to look at a stadium district with respect. Our Comm plan amendment is based on the fact that there's virtually no industrial or Maritime you slap in the stadium District area and is Mary Warrior mentioned earlier when it comes to talking about Freight mobility that Lance already commercially zoned it will get developed and it can be developed this offices low-rise offices. So I hope is that we can take advantage of the opportunity. Did you mix juice down there including some Workforce housing? Because when we look at our population Seattle right now half of it is the age of 35 and under and housing prices have doubled in the last six years. So we don't want to get in any way impact industrial jobs at the maritime uses but there's tremendous opportunity there now with in this small area to do some very Innovative things. We've gained letters of support from the Housing Development Consortium representing / 175 different agencies from the neighborhoods the alliance for Pioneer Square, Dr. Residents a Pioneer Square from the Chinatown International District also from all three teams Friends of the Waterfront and the Seattle sports commission. So this is been looked at for many many many years. Now it at one point was within a former mayors top 10 priorities. It has continued to get shelved. I'm so that Every issue within all of the industrial lands of Seattle is studied and combined with the small area in the stadium district, and we'd like to say it's Unique and deserves some attention sooner than the next 3 to 4 years. Thank you. I'm Jessica Simpson. I volunteer with the Capitol Hill renter initiative and share the cities. I'd like to speak in favor of the sea perform. This bill has not been pushed forward by developers. It's been pushed forward by the environmental Community here in Seattle. They recognize that see Plaza currently stands is not doing its purpose. It's being used to block the urban infill and bike lanes that we need to advance our climate and housing goals as a city. I heard you make these common-sense reforms and help make a infill development within Seattle much easier to do because that is fundamentally what we need to do to meet our climate crisis and are housing prices. Thank you. Thank you. Hello, my name is Jeffrey. I am here to support the changes that you are proposing for asifa. I am a I'm not a developer. I have I am a substitute teacher. I am not a member of any organization. My opinion is that we have a climate crisis and that whenever I read the news. Whenever I see what CP is doing, I never hero cipa helped us do this environmental thing. I was here. It's stopping by Clans. It's stopping all of these proposals. That would be good for the environment. So I really strongly to push forward with what you're doing, and I guarantee you if developers. I'm sure do support this. I'm not saying they don't but there's a lot more people in Seattle then developers, and we can just cross something off the list just because developers support it. I'm not like some big developer supporting person. I'm anti-capitalist. Just like the rest of you, but we need to do things that are going to help the environment. Thank you. Thank you seen it there. No additional speakers. We will close public comment and move on to the next agenda item. Our first item of business today is a briefing discussion Impossible on the comprehensive plan document Solutions. And would you please read this item to the record agenda item one resolution 31896 a resolution identifying proposed comprehensive plan amendments to be considered for possible adoption in 2020 and requesting of the office of planning and Community Development in the Seattle Planning Commission review and make recommendations about the proposed amendments. So we're going by members of the council Central staff. Will you both please introduce yourselves and refresh us on the docking process a good morning. My name is Eric McConaughy. So most years the council provides an opportunity for members of the public to proposed changes to the Seas Conference of plan, The plan is a 20-year policy document that guides growth and development across the city. This stage is not approval or disapproval of any particular change the plan at this stage. We are looking at the proposals that have been received from the public and deciding whether or not they meet the council's criteria to move forward for further analysis and discussion items that are docketed would be sent to the office of planning and Community Development and they would be requested to provide a recommendation. And if anything is proposed to move forward do environmental review on change of circumference of plan related to that. We received 14 Amendment proposals this year two of them met the criteria on their own to move forward and then be Stadium District proposal. Could meet the criteria if considered in the context of the broader industrial and study of the mayor has proposed. I'm going to just summarize the criteria that are in the resolution and then kick it over to Eric to discuss the resolution this in front of you. So the council criteria are as it an amendment used to be legal. It needs to be appropriate for the conference of plan consistent with the comprehensive plan or and it must be practical to consider the amendment. So there has to be enough time to study IT staff has to be available to study it and it should generally be consistent with the overall vision of the compline. Infiniment has been previously been proposed. Then there needs to be a demonstration that things have changed since it was last proposed. If an amendment would change the neighborhood plan, then there should be a demonstration that consultation has happened it with the group. That is what we're seeing that neighborhood plan. Ben needs to actually be some sort of material difference that would result from the amendment. And then there are limits on proposals to amend the Seas future land use map. So it the amendment needs to be of sufficient size. It would be actually visible on the city's future land use map and result in a significant change in an area. I want to listen that laughs when I believe that was a change Tramaine. The last two years is the idea there if it's if it's like a personal change don't go to the comp plan process. But if it's more of a area-wide multiple blocks, that's what I need to go through that the distinction they're generally has two boundaries for the urban centers or mint manufacturing industrial centers because that's a significant boundary regardless of size that that would be a change. That would be the criteria. If there aren't any questions about the criteria that folks have been using that you all have considered Planning Commission and obesity has considered to lead to the docking resolution is no questions about those and I'll just step through the sections of the Revolution that was introduced to that's all right. The first section as I mentioned asks for a b c d to both have to do with changes to The Flume. The one has to do with the area up in Northgate in the second. I bust Seattle the second section deals with manufacturing and Industrial plans. It talks about looking at the state industry proposal that was proposed this year in the context of overall process of industrial lands as well as a repeating the request the council's made before for three site specific considerations for comprehensive plan amendments. I want to say before. They were adopted in a previous rounds and haven't come to a conclusion Section 3 asks for look at impact fees. This is also consistent with a penis resolution fees that are provided for under state law that would do what public streets roads and other Transportation improvements. Hopefully on parks open space and Recreation facilities and school facilities section, 4 released amendments that were called for his part of the mandatory up of housing affordability legislation. Section V in similar Fashion Harkins back to a previous resolution of this has to do with looking at amendments that the folks and Delridge have recommended. This was taped it. This would ask opcd to look at those do environmental review and bring those back to cancel. Those are attached to the revolution. Those those proposals were changed the policy and then 6 + 7 sqrt. Take care of some of the heavy lifting of the bill which is to formally ask for the review the section 7 so that the record is complete list the Amendments that were proposed this year that will not be considered. So there isn't store the blank spot on the map about what happened to the things that were proposed and weren't recommended for 4 review. And that rounds things out. I do have one request for a technical Amendment, but I can get to that after answering any questions about the sections of the resolution. Calling Santa questions. I suggest to be crystal clear the resolution considering the day just as the amendments to a docket that would only cause for the study and so it's not an actual decision at this will happen and it's just for further consideration for the opcd. Correct? That's correct. Historically the comprehensive plan amendments were considered on a fairly. Consistent schedule the last few years that seems to ship to the date of last year. We did comp plan amendments in December this year. We didn't come in early March. So I'm curious. Do you have a sense of when we will be considering when the council will be considered income plan amendments next year or is it just really hard to tell in today's environment in the coming year. We should be on a regular schedule which would have the council reviewing amendments in March. I just a process question. I know that there's various pieces of the piece of legislation in front of us that folks have identified a potential amendments are questions about how would it how do you want to go about those are you going to do with the technical moment? And then those some more substantive conversations acknowledging first and third much I've heard in the last couple of weeks from both labor and Port industrial and that we continue the conversation. If you don't my hope is that we can pass the resolution today as is with continue discussions. We continue those discussions and bring them before the full Council on Monday. So that's my my my my my clarity's a whole life to the process. So I'm so I'm going to head up to now is hopefully straightforward easy to understand technical Amendment typically with the a resolution deal with docketing. It's it doesn't call for the mayor's concurrent resolutions and they're sort of general form quite often call for the American Crane. And in this case on the Goof. I prepared it and then late in the game realize that this resolution because it is the council's formal request to the executive to take up this work. It doesn't require the mirror to concur. So simply this would remove the mayor's conference that would happen both in the opening a section of the resolution Clause portion of the bill and then in the signature page. Stallard us so I would move the Eric mcconaghy goof Amendment. What's the land after me? Okay, is there a second? All right. All is there a place by its a real Amendment now? It's a real thing realize you and I can proceed with moving forward to passing resolution and acknowledging that would contain the conversations with an expectation that on Monday for the full Council opportunity to be here. I appreciate the testimony that we've heard today. I think that was some of the things that have come to light from the last few weeks on this discussion and especially in our discussion with the public today really sore to drive home the desire to keep working on this to make sure that there is a sense of urgency around especially I'm looking at industrial and through a comprehensive lens across the city are we heard a number of people today talked about the need to move forward with the comprehensive Regional industrial review sort of panel or task force that the mayor of conducting I Sing if we can engage in a conversation briefly on the amendment that councilmember O'Brien had initially worked on and I'm very supportive of this. Well, I don't see a number on this one. But do you have a copy of this idea copies? Okay. I miss her if we could I'd love to talk about the contents of this potential Amendment so that we can have a discussion about it. What's the weather outside? Sure if I could jump in. I may be before we can talk specifically to this. amendment I would love to spend a few minutes maybe talking just about some policy questions and I have a couple questions just about technical things about what's happening because the I've been through this a bunch of the legislation is just a little confusing to me and I could use some clarification and help with the public to so the sessions lodging around industrial manufacturing industrial amendments and what we do with industrial zones, and I wanted to say that we have been asked I think every year I've been here for various changes to Industrial lands in the more recent years. It's become clear that this very controversial when we start talking about industrial and there's multiple parties we heard from lots of them today. They're generally all parties that I want to support and yet there's conflict there and battling out over amendments parcel by parcel seems like a very difficult. If not an appropriate way to resolve industrial and policy and so we have asked the executive and I'll say the executive probably because it's been multiple to conduct come forward with the proposal on Industrial lands for policies moving forward that brings together all these parties that Certainly have conflicts around specific Parcels in Ultimate probably have some different visions of where it goes. But there's also a lot of alignment that there's probably a sense that things are Nestle working great for anybody right now either and the hope for me has always been that if we have a policy ideally that a mayor would propose after convening groups and if the council would then weigh in on then it would be much more straightforward to consider parcel by parcel decisions in context of is this consistent with a policy or not for reasons? I don't fully understand but I'm sure I'll be there in legitimate that industrial and group has been convened and but no policy has come forward and the convening has been sporadic and I continue to believe that that is a necessary step before we can legitimate look at industrial and we have made some some changes to Industrial and to their intervening time. Most recently. I believe we If you were a small parcel near Seattle Public University, the reason that I was comfortable going forward with that is because all the parties who were here, but disagreements were generally aligned about that has broad consensus, but it's very few little Parcels with his broad consensus about and essentially where to place where there is community members or organizations have the power to veto anything or stop something going forward, but there's not enough power to actually make some changes that could be worthwhile. And I think that with the proper leadership that could happen what I'd like to see as we move forward chair and I thought we talked about this. I hope we're in agreement. Is it some language in here that once again, the rocks are asked to request the executive to continue restart start, whatever you want to call it the process to convene folks that have interest in industrial lands or lands near manufacturing dustrial centers and come forward with a proposal that the city. The council the public can evaluate and hopefully adopt some sort of new policy for a new framework. So in light of that but I would like to see with this with this proposal and then. I'm sorry that I've been distracted the last two days and have nails give you Clarity prior to this but would be that we not move forward with docketing any of the industrial and changes rather. We ask that the executive once again come forward with this. I believe that the executive is preparing to do that momentarily. Anyway, so hopefully we can do this in a way that then we're asking something that she plans to do anyways and remove any of the other docketing items. I think it's appropriate actually States explicitly that there are projects that are in a q that people have been waiting on for a number of years including the stadium District including a number of specific Parcels. The waska sites one that I know is coming up that washed-out will likely be selling them. Two years but that the city council at least the moment is not a prepared. I say it would be premature for us to even do a docketing action on these until we have some clarity about an industrial and kill policy proposal from the mayor that the council had a chance to review and hopefully adopt. I don't think I have quite that language ready today and I think my fear that I wordsmithing that on the fly without getting legal review is probably problematic and so ultimately I would like to do that. I think they're pieces of that that my previous amendments touched on. So when was it was removing the language that as it's written here about a stadium district one was removing the reference two Parcels that are listed in section 2 a b and c and rather include those in a more broad statement that says this is the this is the Visa the steps that need to be taken and these these projects are essentially it's premature for us to make any sort of decision until That's how that process happened last and the last thing I asked obesity about whether or not we executive has had identified the stakeholders a timeline and so forth and so it was still unclear. And so I've been encouraged that there seems to be moving in that direction, but I do agree with you that I think it's best to have a conversation comprehensively about what best to do with industrial and this has been an issue that has specifically to the state and District proposal. It's going for so many years and so my thought process accepting the recommendation from the Wii What's I spoke to the Planning Commission and chairs? They said to me while you know, we're not going to get into the best for last conversation, but objectively, this is nothing criteria therefore. So I accept that recommendation because of Jack Elliott met the criteria. So again, I think I do think it's best that we have this conversation a couple of years ago. And so I'm at the courage that you can find language that and you won't work on some language that would help us find a resolution most comprehensive for all. Saint Francis was a technical question when you walk through the criteria, one of them was we won't reconsider. Something has been considered before unless something has definitely changed. How does like the stadium? I don't know exactly we talked about that and half is aleutians. Similarly. I know we've talked about Pier One. I think every year I've been on the council but those are still here is that consistent with our criteria because they weren't actually considered or what they have been requested for they've been added to the doctor in previous years. The executive has not provided a recommendation on them. So so if the book has not been closed on those particular items because there has not been and I love you and love ya got it. So I don't hear any disagreement with anything that I also have been thinking and looking at the language. I think the two prong approach the both of you are describing is a really healthy conversation for us to require both of the executive if there's going to be a commitment to a task force. We don't want to be as one of the speakers said we don't want to be here in three or four years having the same conversation yet again. I also think that it behooves us to recognize I think what we both have said, which is that identifying areas as the current legislation does in a D&C really does feel like a continuation of this piecemeal approach and as we think about the need to look comprehensively across the city across all of our parcels and to recognize that this needs to be done in conjunction with the exact work Workforce training opportunities and Workforce opportunities on the horizon industrial creation new and emerging Industries on additional. Something I feel like a really does make more sense for us to pull the language today as suggested in this amendment and then work between now and when it comes to full Council on Monday to do exactly what you to have both articulated to make sure that there is a clear timeline for that task force to make sure that there's clear individuals are entities establish as you discuss and to make sure that we reaffirm our commitment to wanting to look at this through that comprehensive plan. I love the language you use I'm sure I didn't use it exactly right but my desire to would be that we do move forward with the legislation amendment in section 2 as proposing this amendment to really show that this is at there is a need to not pull out certain components to be coordinated and to not Silo our analysis and effort. I think we can also recognize that in the testimony that we heard there is a real interest in making sure that as a city We are both investing in protecting and growing good living wage jobs good union jobs. And then we also recognize there's a balance that we need to create housing specifically. I wouldn't say it original office based housing and I think as we look at the land through this more comprehensive analysis that potentially is on the horizon with tight timelines with a clear understanding of who's at the table and what the direct it is and we can do things like consider working for its and housing we can do things like we've already done with cleaning bike Lanes along the truck four doors. That's my bike route everyday. I write write down East Marginal Way and I have the benefit of leaving at the truck drivers everyday as I'm kind of weed in and out and they've been tremendous to work with but it doesn't have to be in either or I think if we pull these amendments out today and we look at this room or comprehensive plan and I will be fully supportive of any of them that you bring for it on Monday to create those timelines clear schedule and a clear understanding of But the task force will be looking at it would make me more comfortable with this because again, I don't want to go down this piecemeal approach when a coordinated strategy is really what I think we need to support good living wage jobs to support a more comprehensive analysis across our city as our cities growing both to match the needs for industry and the folks who need to live here. So I would love mr. Chair to have have you all consider the amendment that's in front of you as as proposed in section 2 and I believe so a couple moment that are really more about kind of processing timing one would be to leave the underlined legislation and change except. I have a separate Amendment unrelated to this they will bring later with an understanding we can work on a comprehensive Amendment or set of amendments for Monday. That would result in US passing out of committee the the unamended piece of legislation, which I know some people in the audience support and some people are fearful of alternatively but I think I hear you proposing is to make the amendment that I had proposed earlier which would strike the language about the stadium District to remove the references to the three Parcels a b and c for The Flume docketing today, which I do support removing and so we could remove those today with the understanding that that's part of what I'm hoping to do when there's more work to be done by Monday in my mind. The end result is identical. It's just a matter of do we do part of it today or do we save it all for Monday? And I guess I'm curious what it's my preference bill with the understanding that we will be working towards an amendment on Monday so that we can have the full support of the council. Is there is there concern with the amendment as written? Mr. Chair by law to have a review but because of the time I leave not received the answer again with the base legislation and section 2 had been run by law. We are basically talking about striking language that had already been a month I have lost so there wouldn't be a legal concern here. Hopefully not I want to err on the side of caution. But either way if we were to take it everywhere. To take action we could figure out by Monday if we were to take action today and it turned Outlaw said you shouldn't have stuck in that word. We could also add it back. So. Councilmember Mesquita, if you would make your case why you would like to take action today? And then I'm going to be the middle sibling here apparently and I know that we all are interested in the same goals. We all are interested in a comprehensive plan that allows for us to look at the the changing nature of our city the growing population the need to encourage more dense opportunities, by the way of the legislation you will be considering it a minute and want to thank the folks who come to testify especially around House Bill 1923 and all that. We're doing to try to create a more inclusive and density as we do so though. We also recognize that when we look at industrial and there needs to be a comprehensive analysis. And the way that the legislation has been written with these three sections are with these three areas specifically pulled out does not feel to me that is in line with the goals that you articulated cast member of Ryan you mention. 2015 2016 2017 the ways in which we've tried to ask for this type of analysis to be done, and it feels like that comprehensive review still needs to occur. I fear that if we go down the route of having a VNC specifically called out like this, we won't be able to accomplish that, comprehensive approach, and I also think that it's signals are interest on Council and really ensuring that as a task forces for the Gathering booster chair. You've asked for more details. I repeatedly that those details truly do look Citywide that they are comprehensive in nature and my intent is to make sure that we don't get into a situation where were signaling any interest and parceling out these individual Parcels, but instead want that comprehensive analysis to be completed as you have requested multiple times, so I would definitely like to move the consideration of Amendment 1 sections 1 and 2 1 and 2 and 7 on so that we can send a clear message. The goal here is not to fill out these pieces, but the goal is to truly create a comprehensive analysis. And and then also make sure that we have Language by Monday that includes that Vision that you've articulated so clearly the both of you. Okay, so I am one one thing when we call this the amendment to not talk at the stadium Amendment proposal because I have an amendment when that I'm too broke for its label. I just don't want to confuse the viewers and readers again. I don't I think this is a meaningful and yet at the end result. I think we end up in the same place. I actually think that I will support you counselor Mesquite and I'll explain my reasoning even though we're going to end up in the same place if we move through with this including as is clear to remove it at full Council. I'm concerned that I'm going to spend a lot of my staff. So I'm responding to calls as to why this is in there and so it which and we'll just have to explain it when I plan to remove it on Monday and I think I will side with you at this moment just to remove it now since that's clearly what I want to go with you understand this more work to do. So if you want to move that amendment, I will second it. I'd like to move them and went to not Dock at the stadium with the copy at that. I fully support the chair in the the needs create the sideboards the timeline and the details of a needed for the task force that you've been asking for over the last month plus and in to be clear I shortened version but it also doesn't talk at three sites specifics there and I would second that. first and second support and I'll say no more discussion. And then I moved to adopt a resolution 3106. I have another amendment that I'll share with you all know. What can I ask you to drop? This is an amendment around Public Health climate change in fossil fuel storage in production. It would add a section section 6 amendments to the environmental element and this is what it says the council requested opcd in consultation with the Seattle Department of construction inspections the office of sustainability in the environment and sustainability. And environment environmental justice committee draft evaluate undertake environmental review and provide recommendations for potential amendments to the environmental land use or utilities elements that would clarify the city's intent to protect public health and meet its climate goals by limiting fossil fuel production and storage. We heard Reef in public, today. We've also heard I'm over the past few years and see what the county did about putting a moratorium in moving towards legislation that would prohibit fossil fuel storage and a new fossil fuel investments in the city in the county and this amendment would ask that. We get a recommendation back in the comp plan to do something similar on next year. So I will move Amendment 1 assessment for the discussion. All in favor, say aye. Schedule for your clear message to us and to the public and the executive that you do want to do that task force move forward so that we're not in this them staying pattern. So we'll look forward to supporting them as that you bring forward on Monday special this role of of land used as objective as I can be in terms of and regards to what I think is so hearing if there's no more discussion, and then I moved to a resolution 31696 as amended the resolution passes. Our next item. Thank you. Both for joining us today at everyone else will be back before the council the full Council on Monday, August 12th. The next item is a briefing on updates to our city a CPAP policies know it would you please read the abbreviated title into the record agenda item to cancel Bill 119 600 in ordinance relating to environmental review and then in sections of the Seattle municipal code to clarify timelines and the content of administrative appeals to authorized the development of directors rules to clarify the content of environmental documents and to make Corrections and Technical amendments. All right for background members of the committee were recently asked by several environmental. Advocacy groups to look at recent updates made by the state to see Peppa and it just city codes of Coeur d'Alene and response. I have work with customers O'Brien and proposing this legislation to both Alliance city policies to the states as well as to make our other fixes and improvements to focus on seba on its Environmental Protection and 10 list is back from Central Council staff. At least. Would you please give us an overview of The Proposal? Thank you. I thought I would be talked about this at the next for committee meeting. So I thought I would give some background on the find some key terms that will keep coming up as we're discussing the bill and then describe the key changes in the velvets in front of you. Washington State Environmental Policy Act was adopted in 1971. It requires environmental review prior to governmental action. So contrary to what you heard from some of the commoners this morning Sefa requires that environment review be completed before a governmental action is taken. The goal is to provide information to decision-makers regarding probable significant adverse impacts of actions that count that decision-makers are considering and allows for the mitigation of those impacts. Unlike some other areas of City Recreation cepa is really driven by Washington state law the revised code of Washington Chapter 43 21c and Washington Administrative Code chapter 197 11 both dictate. What can what needs to be in the city's tea per regulations and so the municipal codes structure mirrors and incorporates verbatim sections of the Washington Administrative Code. CL code can be more restrictive than the Washington State requirements that can require that more things be reviewed than the state law requires, but it can't be more permissive than state law. Some of the key terms that you'll be hearing this we talk about this. Action under seat but in this is because she pays his own world that has his own terminology that is not necessarily used in other parts of the law or even land use regulation undersea find action is new or continuing activities proposed were approved by an agency. It also includes new revised rules regulations plans policies or procedures or legislative proposals to fight. Divides actions into two different categories project actions where something is going to be built as a result of the governmental action and noun project actions, which are a plant policies and regulations and it requires different levels of review for project and nonprofit actions because there's different level of certainty for the environmental impacts of say building a street compared to adopting regulations. The guide house treats will be built in the future. CB Define elements of the environment which are specific topics that need to be considered. Those are specified under the Washington administrative code and the Seattle municipal code and their split into the natural environment and built environment. I'd like some comments that I think you've been receiving from the public and economic considerations are specifically not an element of the environment under state law and regulations. under-seat that there are a list of projects that do not need to be studied. So if unless something is under seat belt categorically exempt it needs to be studied. The categorical exemption means that there is a category of actions that the government is taking that does not need to be studied under seba. At the end of the super review processors that determination which is the analysis that a proposal either has or does not have the potential for significant adverse impact and its termination is published either under the termination of significance, which means that there's the probability that there will be a significant impact in which case in environmental impact study needs to be developed or determination not significance. If there's a turd termination of significance and environmental impact statement must be prepared than an environmental impact statement must be prepared and general environment impact statement is called and he is and there are drafty is s or d e i s s and finally i s s r f e i s s a f e is finally environmental impact statement and determination of Nantes significance are each subject to appeal. Anyone with an interest in the action being reviewed can appeal a DNS or the adequacy of Annie is to the Seas hearing examiner when the determination is issued or after approval of an action, they can appeal this determination or Eis to the courts and under those appeals substantial weight is in burden of proof substantial weight is given to the agency's decision and the burden of proof is on the appellant to show that it was clearly erroneous. Finally there is a concept of a lead agency. And that's the city department is in charge of meeting the super requirements. So it's generally either a department is reviewing a permit application from a private party or the lead Department that is making a proposal. So cancel Bill 119 600 there three main changes that would be adopted Under The Spill. The first is to incorporate new categorical exemptions for an art project actions. That state law has said candy. categorically exempt so as I mentioned earlier City of La can be more stringent than state law. Currently City Light is more stringent than state law under these categories. And so we need to loosen the bolts to be consistent with the state law. The legislation would increase threshold for development in urban Villages under the state's cepa infill exemption provisions, and it would add a timeline for curing Samara pills. They're two different categories of categorical exemptions for nonprofit actions under state law that the bill would incorporate. In 2012, the state legislature amended seat regulations to exempt amendments to development regulations to ensure consistency with the adopted comprehensive plan. So what's the plan has it been adopted if their development regulations that flow from changes to the plan and the plan has been studied under any is then those development regulations don't also need to be studied several of the development regulations to ensure consistency with changes to the city of Shoreline Management program amendments to development regulations that provide increased Environmental Protection for critical areas Shoreline areas. And then amendments to technical codes to ensure that our technical codes the building energy housing plumbing codes are consistent with state law would become categorically exempt under this regulation. These were all permitted to be changed to Stateline 2012, but they have not yet been incorporated into the city's regulations. This year the state legislature amended Sefa to provide interim and permanent relief from soup appeals. So under this new State lost sheep a needs to be done. These types of actions are not categorically exempt, but there's no appeal permitted. of the Cities Sefa determination So if you decide to amend the super rules and act on a proposal. Before April 1st 2021. Nope, no appeals would be permitted of Supa determinations for upsetting 500 or more Acres around a computer Light Rail station of stoning to 50 or more acres in areas with frequent Transit service allowing duplexes triplexes and Courtyard Apartments in single families on Lots allowing accessory dwelling units in single-family songs on set meter in size when it's and that's already been done adopting a Siberia plan adopting a planned action ordinance like for yesler Terrace increasing categorical exemptions that encourage Urban infill Development adopting a foreign-based code allowing duplexes on each corner light and single-family zoned areas or allowing for subdivision of lots into smaller parcels. This year's Bill also permanently stated that Transportation analysis. Under-seat though would not be subject to appeal. Based on Transportation impacts if traffic or parking impact fees are imposed. or the city's traffic and parking or traffic and parking impacts are explicitly mitigated by the city's ordinances preliminary review by sdci says that Probably traffic and parking impacts are not expressly and Medicaid by the Seas ordinances. So either something would need to change in the city's ordinances or an impact. They would need to be applied for these Provisions to go into effect. Second big change is to increase threshold to development in urban Villages. Not all new development proposals are subject to see but today and the state allows for higher thresholds for project Enfield development projects are consistent with the comprehensive plan. So currently under the city currently process City buildings with fewer than for a residential units are categorically exempt they don't go through in the family area is the threshold is 20 units and then our Urban centers the threshold is 200 units. That only applies until Urban centers comprehensive plan growth estimate has been met if the growth estimate has been exceeded or is close to being exceeded then a project with 20 or more units needs to go through seat by so the infill development regulations only apply up to the conference of plant growth estimate at which point the lower requirements to apply. And the restaurant looks basically that the key is for the conference plan is already studied a certain level of growth in our Urban centers and we don't need to redo that analysis on a project-by-project basis. The legislation in front of you would apply the same exemptions for development in all Urban Villages as for urban centers. And again, once an Urban Village meets its growth estimate or has had growth to his estimate then the lower requirements would apply the memo I prepared for today's meeting has information on where Ben go with his are in relation to those estimates. It looks like rose. Is basically a door above its 20-year estimate already given the amount of breakfast in there, but there's some other neighborhoods that are at basically 0% craft. And when you say Evan Villages at both Hub, Urban Villages and and the regular Urban Villages estimates for commercial growth in our Hub Urban villages. We don't have them for our commercial in our residential Urban Villages. So for commercial development The Seafarer exemptions would only apply in the hub Urban Village in a purely residential project. But if you were doing with ground-level retail and Urban Village, not a hoverboard Village, then that would include some commercial space which would trigger a secret requirement. Yeah, and there's some we can get into the Weeds about next week's versus non mixed-use buildings that you and so if we if we wanted to change that in future that would just require us to have some Targets in regular open Villages, which is a completely different process. Define major change in the legislation is to an add a timeline for hearing examiner appeals over the last 10 years. There has been 58 appeals of Sheba determinations. The shortest appeal was 33 days, but the average length of a sea Popeil is 124 days and the median is a hundred and four days recently. Some very complicated pills with multiple appellants covering basically all elements of the environment to go away the amendatory housing affordability appeal took 392 days to hear. How do time limits in appeals for four pills in this legislation legislation compared to other jurisdictions? Good question. I was just about to get to that King County has time limits for their appeals. They have a 90-day limit for an appeal that they're hearing center can extend. To 120 days upon notice to the parties and Then it can be longer. If all parties agree this legislation star takes that framework, but based on past experience in Seattle. The limit would be 120 days is 150 days. Basically if the hearings ever decides that's appropriate and then longer time frames would be allowed. at the agreement of all the parties I looked at the accessory dwelling unit legislation which had an appeal of its determination of Nantes significance and its appeal of the finally is and if both appeals were limited to 150 days for months would have been saved from that process. It would have created more work for the attorneys and the appellants a prime. They would have had to work faster. But and in a complicated feel they may have mutually agreed to extend that time frame, but it would have been a complete form answer earlier. Double check on your question. Will you also interested in kind of comparison to other municipalities in other states that might be helpful, especially as we look at Minneapolis and all the great attention that they've received your other cities that are being Innovative in this realm I'd be interested in that comparison as well. I'm certainly interested or appear cities. Do I just want to acknowledge that the complexity of different state laws are going to make it pretty hard for the I don't want to send you on a two-week research project. If it's if it's really complex for a comparison that be useful but it may be the state laws are just so different than it's hard to compare. I'll see what I can do a handful of states that have similar environmental laws. And so there may be a good comparison. How long do the hearing examiner appeals process? How long does it typically take in Seattle? And it depends on how many parties there are the number of issues that are being raised again. The shortest was one person who raised one. Issue with the Sleep analysis and that was done in 30 days. I'll just say that I'm in recent experience has been at least a couple instances where where the appeal process has been extended. Sometimes multiple times simply because attorneys representing the party were on vacation or at one point. I think someone was switching attorneys and needed to listen to we start the clock over and I am 100% for people there should be an appeal process. I think that that generally the intent behind the city's laws are great. But when you know, when attorneys vacation schedules preclude us from making policy decisions that affect the whole city that doesn't feel fair and so an attorney can change their vacation plans or a client can pick a different attorney is not a vacation, but we shouldn't Call City on hold but those types of actions. I really appreciate you bringing that up. And I think as the chair has talked about in this Council has talked about before we need to be looking at all of our policies, especially in zoning and land-use through this racial Justice original. Rsji analysis. I'm I brought this up when the hearing examiner was appointed as well. It does seem like we're doing a disservice to our community at large when we allow for those who do have access to the ability to have defended Pockets to fund attorneys to just take a decision to go on leave and go to in other parts of the world leave the country completely work, dating that schedule at the risk of what at the risk of how much housing of how much time lost so I think that's important that we would continue to bring that up and to recognize that could be an impediment to both our desire to move forward as a city and I think that there's an equity embedded in that privilege that's associated with just being able to pick up and leave and go across The pond if you well for vacation appreciate that point and that has been a frustration of mine and frankly in conversations with the hearing examiner recognition of how this process work. And so Again, as I mentioned before I feel that it's important that they're in our appeal process has to certain types of decisions and we can make some policy decisions about which types are eligible or not. It's also critically important that that appeal process is equally available to all the people of Seattle and well, you know, this is one of those differences between equality and equity and some of the trainings we might go through. Well, technically this is equally available. It doesn't matter your race or color are your religious beliefs you can show up make an appeal. The reality is individuals communities businesses that have more resources. I have attorneys and are tracking the stuff and have lobbyists following this are much more likely to make these appeals. And in fact that the hearing examiner sees is it that they're almost 9:00 or maybe no low-income communities are to me as a color that are making these types of appeals. And so the way this is playing out in reality is very an equitable. And on top of that there's been a recent Trend which I hope we nip in the bud immediately for once people get into an appeal process. They didn't ask for special treatment. They say I know there's a legislative process, but we would like to have a private negotiation with folks in our Airbnb legislation a previous council member counselor Burgess agree to that process and agreed to then he made a personal commitment to what he would do. I don't you know, you can't commit to any of the council members. I don't think that was fair. I was asked to do that as part of the backyard Cottage legislation. I was insistent that just because the Queen Anne Community Council has the resources to the appeal doesn't mean they get there going to a private secret negotiation with me to try to come to a settlement. We will have a legislative process where everyone can come and provide public comment people can send us emails and home, but I'm not giving one group at your special treatment. Tell the rest of the city. I already made a deal with this group and I'm done. That's not fair. And I don't I don't believe that those groups are explicitly trying to be treated favorably. I think they're trying to use every vehicle they can to get their agenda. But the result when you look at how the city governed equitably is that it's not fair. And so again that is a little more about how we as a council react when this happens, but I do think limiting the timelines on these is a way to try to level the playing field and there may be things we need to do to it to help groups it never show up at these get resources so that they can make appeal so we don't see the just know this isn't just about saying no more peels. It's like I would like to see, you know, low-income groups who have concerns that may not even be tracking legislation have the ability to say we would like to be able to peel and housing assistance doing that, too. I concur but I am I my thought processes as regards to the appeals is objectively, you know who use who uses a tool and to provide a more clarity behind that process so that it's not too comfortable. Brian's Point used word of what we've seen examples of attorneys going on vacations. That was probably the objectively misuse of the process itself. So I appreciate more clarity on that any other questions. Have you finished your terms of meeting these deadlines the legislation allows the hearing examiner to hire? Jane Sanders Pro Tim to help meet statutory deadlines as the budget process occurs. You should consider providing some funding to the hearing examiner to allow them to are those hearings cameras Pro 10. Other changes in the regulations, it would allow the department of construction inspections to draft directors rules regarding elements of the environment where there are complicated or where there should be serve a consistent approach to doing a analysis of a particular element of the environment SDC. I could drop the directors rule which does a propeller comment. To survive and provide more predictability and more comfortability between environmental documents. At the legislation clarifies the analysis of subjects that are not classified as the environments of the element under state cepa regulations are not subject to appeal. For example economic issues are not an element of the environment under state law and they happened the subjective appeal in the past contrary to the cities. And finally, there's a contradictory section in the CPT regulation that contradicts the land use code about when a permit can be issued. So this legislation deletes the language and the lies on the land use code language is which is much clearer and provides better traction. I'm supportive of all those I think. But see I wish I had you listen to run away so I can remember them. But the the getting rid of the ambiguity between the two certainly makes a lot of sense. What was the other points you just made you can find me the SPCA director Scrolls and elements of the environment that are not soaked to the directors rule. I think it would be great. If you know your best friend's New York City that I think has a a guideline would be great to give Clarity so that I think we would all benefit from this. I think the council would benefit hearing examiner with Benefits Community with benefit understanding know what the process is to go through and I think potentially two are too whether this is it a tool that's used equitably across the city providing Clarity two groups who are overwhelmed by a legal process. It would be great. If there is a simple checklist. So without an attorney someone would least know how to do that. So I think that clarity Great stop. And then sorry you're getting the other one clarifying that environment or what you started out why we have see palazini palazon. It's to make sure that the policy maker which I am at. The moment is informed as I make a decision not necessarily to tell me what to do of though as someone who's been on the other side of these off and wish that the person would follow exactly what is best. But at least we have to be informed and I think it's great that the city says, well you do in the analysis do some economic analysis to because that will help inform a policymaker. But as you mentioned it was never the intent that if that an economic analysis is not agree to buy some party. Did they can appeal the adequacy of the economic analysis. That was something that we voluntarily adidon States top of state law so that we just have more information but clarifying that those types of additions Not subject to appeal there simply things that we've asked if we can be even more informed is really good example for the wish you find a better that but the burke-gilman trail is is again for like the umpteenth time the it's been appealed to seba and we met all the requirements except the the this is the King County Superior Court. I believe went back and said you need to do more economic analysis cuz we don't think that was sufficient that mean is that so, you know by clarifying in our La, you know, the things you didn't follow you on laundry believe that are the laws pretty clear that this is an additive thing. That's not a peelable. But however, for whatever reason it wasn't clear enough in Superior Court judges agree, but we can clarify that too but that won't mistake won't happen again, and I've had this conversation before and so that's why I wanted to make sure for the people make them more specifically. A lot of the comments we heard today. I've received some emails from some of the folks in here today to that any chance to read. I believe that that it's critically important that we have environmental protection laws like Sefa and like people and I think it's also critically important when they're not when working to meet the needs of what they're intended to do that we adjust them and as someone who has served on boards and starts today on board to environmental organizations, very cautious about changing those things for fear that they might do more damage than good. But when I look at what's playing out in Seattle now three recent examples when they were still in the middle of the burke-gilman trail that has been appealed multiple times by a small handful of businesses that have prevented a bike lane from being built for decades now against the wishes of the environmental community. Backyard Cottages broad support Among Us environmental organizations a neighborhood group appealed that because they didn't feels good not clear that they require you to represent the broader neighborhood. It just requires that someone shows up they can figure out how to do it. I am currently unable to move forward on Transportation impact fees because developers have challenged the seba adequacy of us including a transportation plan in the comprehensive plan. We have been delayed over a year now for almost a year and implementing Transportation impact fees because developers have challenged developers. We have a select group of homeowners. We have businesses. I have not seen in my ten years here and Environmental Group challenge the C fund and that's why I believe we have environmental organizations here today saying we are ready for this to be changed because this law that we have supported his being used to undermine the very policies. We are trying to it. So we can argue about who gets to speak for the environmental community. And are you are these policies are good again, there should still be processes for this but I'm certain things were said. No, we want to go this direction. Let's make that easier and other places we say let's have an appeal process. Let's figure out how to resolve that in three or four months not a year have a lot more conversation. So I'll hold back for a little while here, but hopefully we can get something resolved that look similar to this in the next month or so. Hopefully we get there earlier about what I said in terms of my appointment process and counselor mosquito man made the comment about holiday experiences shape so much of our our policy making framework and so for me, it's you know, the luxury Being able to live close to where I work be able to move without a car and how do we create those opportunities for more people and when I see abuses of the process that is not being used in 2010 and form and more specifically for the reference example that you've said. Yeah, I think this is an opportunity for us to say how to reform it so that we can provide the info on the density that we eat around Transit. So we'll have more discussion on this is there no further questions. I like to next move is to the next meeting on September 4th, cancel your leadership and moving forward on implementing the components of House Bill 1923 into our state and to our city statue. This was not a battle. That was one easy and The Halls Olympia and I know that some people who were in the audience today participated on behalf of the city and then as allies with the city or the city partnered with to advance with the community really saw as you both articulated as an opportunity for us to update the way in which this tool is being used more appropriately apply it to our desire to protect the environment. We know one of the best things that we can do to protect the environment is to stop being a mega communiversity and we are the third largest major commuter city in the country people traveling one and a half two hours a day to get to work and then back home. So I'm really excited about the way in which this legislation both Mary's environmental principles and housing Justice allies in combination with I think good governance and City Planning strategies just want to say thanks to some of the folks that we worked with during the legislative session, especially representative Joe Fitzgibbon, who was a huge champion on this. Is there a club and a future wise and sightline as well. And then also a huge amount of appreciation for the Washington State labor Council AFL-CIO who works on this because we recognize work in a place to live as well as I want to do the hard work that they do everyday and then lastly I would be remiss if I didn't say thank you to the AWC. We had some tussles back and forth on positions on this bill and ultimately the team who was representing us as a large member of the association of Washington cities. I did help a come up with some language in the end that allowed for us all to be supportive of moving forward on 1923. Only Aunt Lisha if you remember that was battles in the last few weeks of session there and just want to knowledge that is not easy with the moving Target. In legislative process amendments can change your position wildly from very supportive to not supportive and what they did with us recognizing our strong desire to move forward on this legislation was I think help carve that path forward. I know it's not easy and just want to thank those leaders and the legislators and our lobby team and the NWC for helping us get to a product that we can now move through your committee with great urgency as you've all of this crap today. So thanks to you two for continuing to push this forward. I really appreciate it. Thank you for being here today again. Will we have the next discussion on September 4th our final item of business today is a brief discussion with the Seattle Planning Commission on their neighborhoods fraud report know I would you please read listen to the record agenda item three neighborhoods for all report. MTG filibuster anything reminder table, please introduce themselves and kicks off. Of the Seattle Planning Commission. Good morning. My name is Michael Austin and I Alright, well, I'm getting ready to go. Thank you so very much for your report. And unless you're going to tables had a chance to review it, but I wanted to highlight it because I think there's just a lot of good things that we never stated in the report but also just being able to amplify what I think the direction that the city should be going in and for what we can do moving forward on this committee to keep it going. Write thank you. Mr. Charron council members for the opportunity to brief you on our recent report neighborhoods for all we're going to start with a little context of what urged us to write the report and Michael and Rick are going to get provide highlights of the observations as well as some suggested strategies, and we certainly want to leave time for questions. Thank you. So what did we were a person would like to acknowledge in this report? And just who you are as a Planning Commission and I should note first on the next slide Ashley. I apologize Rick. It's okay to bring the mouse over this time. We are in the position of privilege to exist to serve you the mayor and departments at the city and advise advise you all on to print planning policies practices and programs of the city. We are comprised of 16 individuals who represent different areas of the city and we serve as an independent advisory body on that and I should know too that we are made up of renters and homeowners as well. I'm here and of course one of the things that we do Steward and this process is the comprehensive plan. So both the previous one and as we work into or in a comprehensive Plan update, we always try to keep in mind the work that we do and just making sure to revolve around the conference of him policies and implementation on here. And with that something that we noticed was kind of interesting. The next life kind of identify something that that really stood out to us as we are looking at our housing policies and I know this information is not shocking too many and I also want to highlight that we have had the privilege of also I knowing that many of you have also looked at a report before and so we really do appreciate the time that I come and speak to it again, but this really stood out to us that the fact that Seattle over the last 10 years between 2010 and I'm getting that date wrong 2007 and 2017 actually grew by over a hundred thousand residents at the same time. The number of units being produced. Of course, I have not been up to speed at the same time and the set of course has very interesting in packs of the city and not just in PEX today, but also looking at the past history of redlining our community as one highlight aspect of the history that we had of racial disparities that have been placed in the city and this of course is just one example, but of course, we also have other aspects SSI racial covenants and also different types of 90s practices that Course have negatively impacted our communities of color in the community what this means of course is that has trickled into our future Generations ability to gain wealth. Whereas our communities of color have not had the same advantages and privileges as as a communities that are have lived in the communities that are identified as blue in here who have been in white communities. And of course that wriggles any what we see today, not only just the fact that this Mathis identifying here is identified all the areas that are single family zones, but many of those neighborhoods were previously identified in blue while many of the other areas are identify as either hazardous or definitely declining. I'm have had been up Zone 2 or I'm experiencing up zoning and taking on too much of the burden of our growth in our community. So with the two we wanted to put together a series of observations at the Highlight what we have found in our city and the study has taken place over the last two and a half years and so much of the information might be from 2017 and 2018 that we still feel like it is very relevant today in one of those things is looking back at the map itself and and something that really stood out to us as according to our calculations. And what we did in this calculation was weak because many communities are many people calculate single family sounds differently on here and for us it was taking a look at all the land that's identified for residential uses and when you factor out all the other uses and just focus on residential over 75% of Seattle's residential lamp is identified for single-family uses in a report to and definitely let us know if you have any color find questions along the way I want to hear but only about 5% of the growth within the last 10 years of our study of the area that we looked at 9 he had actually taken place in single-family sounds while I'm watching the majority of growth has still taking place in our multifamily zones and that has thank you for the breakdown on the amount of land in Seattle. That's zone for single-family use. So according to the amount that you have here when you look just at residential and 75% of our residential Amazon for single-family you and is that taking into account is that taking into account the more recent? Quote Citywide ABS on that we did. Good questions for this study was done prior to the passage of mha so the 6% of single-family zoning areas that were covered in mha are not reflected in. This report was released in December of last year the importance of why we were moving forward with the mha I rezone and the conversation that we have had over the last year about the need for the racial Equity tool kit to be applied to our current planning policies. So I put it in quotes because I think we all know that's well. It was spanned the city. It wasn't truly a Citywide up Zone. And as you mentioned it was just 6% of the land would be helpful. I think for us to make sure that nobody gets misinformation out there to rub out the 75% number and if we do some back-of-the-envelope math, I'm I still believe will be close to 3/4 in terms of how much land. He's on for single-family. Use. I also think that there's another calculus that folks have done when they take out for example land that has parks and Roads and public right aways and continues to show that we have the vast majority of land across our city that's on for single-family. You still able to calculate in this 6% number I think could help us continue to articulate the the the immense amount of land that's currently zone for single-family is the second thing if I give you permission to the diet and held it up many times and in conversations with our friends and our counterparts in Minneapolis, when we ask them what led them to a residential zone change. The city they said that it was the backbone understanding that their current policies were facilitating and extending continued housing segregation based on the fact that former red lining policies and and Loan lending policies had not equitably allowed for people to live across the city and I think that with the understanding that this type of analysis has led to other cities being able to move forward and ways are both courageous and also completely over do in our need to access public policy makers. I'm very excited that you all have taken this report on and that you have moved or with publishing it and I think we all know many of these elements but having the data points in hand to do what I think Minneapolis has done to hold up the evidence of why change to AR zoning Falls, I so need it is incredibly important. So thank you for asking with conviction and with urgency last year and I'm very excited that this is a great way to dovetail to the bill that the Sharon customer Ryan have just discussed because this is the why that we need to act with her and see. Thank you very much. And with the two is another observation that does highlight this need and in a different kind of way to this is looking at in terms of the idea that we talked about which is the missing middle. And what is the missing middle? I'm in here or what we identify as the fact that a large number of units are either going to be single family that are constructed or 20 + units in one in one building at the same time. We're kind of missing or have a lag in the production of units that are more than the multifamily but smaller number of dwelling units per for building. That's totally housing units across the city of the 2016. And something else I'll be identified with here is kind of winging it back to I'm just providing opportunities for individuals of in Seattle in our community. Whether you're a new resident of our old president or multi-generational family likes living here and wants to stay here. It's important for us to identify that there needs to be housing opportunities really to make sure we can provide for all the individuals that want to be in Seattle on Sunday in Seattle. I'm on here. It's so the what's happened is because we have huge disparity between housing typology is whether it's multifamily down to single-family. It really limits the opportunities for housing that we can use to accompany or accommodate those who wish to Asian place in their Community or those who are are moving here or younger and wish to stay and put on roots. And something else that really stood out to us that we thought was fascinating. The study was the fact that many of the neighborhoods that we often kind of speak to her or feel nostalgic about in terms of character. And I know that's a loaded term, but just the way that we appreciate a lot of communities. I want this example taken from Capitol Hill, but we also talked to Fremont in Wallingford have actually experienced downzoning. So this the units are actually duplexes and they were constructed before they're actually down Zone into single-family units the photo shows like this happens to be the two families with two doors. Covington tracks in the neighborhood. Please remind you why we talked about racial equity and why it's important to this chart really assist exemplifying one other kind of indicator that identifies how the previous history of our race Pace kind of legislation has actually trickled into the lack of opportunities for our communities of color supposed to our communities that are white and in here Seattle us homeownership rate by race aquarium to the 2016 American Community survey indicates that 50% 51% of our homeowners are white and then it trickles down less so for our communities of color and when it comes to distribution of homeownership, we have a different indicator in a report that actually done if I said that rate is actually much higher. Do you also have further information on them on the age breakdown? like millennials That's a good question. So we don't have that in the report, but but it's definitely something that we can look into. and and something else that really stood out to us is the fact that we eat we talk often about that, you know, the fact that we are one of the fastest growing cities depending on how we look at the statistics in the United States yet the same time some of our neighborhoods are actually experiencing a decrease in the number of individuals living in that area and I should know that University of Washington's major institution down tree should be exempt from this this decrease, but the other areas that are highlighted in various shades of red or pink eye are areas that we do consider and end think this is very interesting and it also contributes to how do you think about its ties to hire change switch and going to the next slide this exemplifies one example of why it's very important for us to make sure that we really think about this and holistic Manner and as council member must talked about at the previous briefing it's important because the as we continue to as if we are not providing opportunities to ensure that residents can remain in our community and we Push them out then it does increase the amount of vehicles on the road, which is a huge contributor to CO2 emissions in our environment. And this is just one indicator has pulled from Seattle's office of sustainability and the environment but you can also find very similar Educators also from up here cersei's 20/50 Vision plan, which has very similar information. So this is this is actually pretty new information by the something with all this very relevant to share. San Marcos reviewed the observations that we have in our report. I was going to quickly go over some of the broad strategies that were proposing or suggesting related to expanding housing opportunities across the city. This is not these are not legislative proposals is you just simply some broad ideas on the first of those is to expand Urban Village boundaries to reflect a 15 minute walk shed around frequent Transit. Now the Urban Village strategy is based on sound transit-oriented development planning principles, but its implementation really is not particularly in residential Urban Village Village boundaries should reflect a 15 minute walk shed around frequent Transit, but instead what they reflect is really what was negotiated with adjacent Property Owners a quarter-century ago. I really think it's time for us to revisit and revise some of these boundaries. The second strategy is to designate new Urban villages in to establish criteria for that designation around existing and plan services. So this images of Madison Park which has a vibrant commercial District Waterfront Park and is slated for bus rapid transit in the future. We think this is one of a number of locations around the city where we could consider establishing new Urban villages. You have some fans in the audience. We're we're also suggesting the creation of a new class of small-scale urban Villages or what we call Urban Hamlet's around existing small commercial districts parks and schools. Now, I live in district 6 between Wallingford and Green Lake in a small commercial area, which is come to be called tangletown. We have a very small commercial District could very much benefit from additional housing a greater variety of housing in the people that live in that housing could support the small-scale local businesses. If you ever decide to leave my sister to come district for you're welcome. I love I love that concept similarly live. I live in what I would call up or Fremont and there's a commercial note there. That is vital. I mean, it's one of the greatest things about for Hamlet and We suggest creating a new zoning designation that promotes the intended physical form and scale of buildings by renaming single-family zoning to Neighborhood residential now, there could be several categories of the neighborhood residential that would allow for housing types to be more tailored to their existing neighborhood context in contrast to the existing one-size-fits-all single-family zoning that we have today and unlike the single-family zoning designation neighborhood residential would speak to the intended form and scale of the neighborhood and the buildings within it and not be so suggestive of who should and shouldn't live in the neighborhood. I think it's also important to note that the single-family zoning designation has really been a misnomer since the mid-1990s when we passed our original accessory dwelling unit legislation allowing two households to live on a parcel. Appreciate that point where can I appreciate your work on that? And I'm sure you're all the way up at the legislation. We just passed out for the comp plan document included recommend an alternative name for single families own such as neighborhood residential and proposed comprehensive plan amendments to implement the strange as appropriate. So we are taking your advice an hour before you even gave it that's great advice for you can get it. So the next strategy I'm up to speed here is to foster a broader range of housing types in areas with access to essential components of livability by allowing a greater diversity of housing types near Parks schools and other services now in addition to this we could develop design standards to ensure that new development is compatible and scale with existing neighborhood, but we should revise parking requirements to prioritize housing and open space for people over cars. The next strategy is to retain existing houses while allowing housing types that allow more people to live in a burrow every neighborhood. By allowing existing detached houses, for example to be divided into multiple units to allow additional units on Corner Lots Ali Lots along arterioles and Zone edges. So for example instead of just looking at lot size and lot width and depth we could also look at lot type which would provide us with greater flexibility. We could incentivize the retention of existing houses by allowing flexibility when more units are added. And the city could provide Technical and design resources for homeowners to redevelop and retain ownership of their properties as opposed to selling them off to a developer. The best strategy is to encourage compact development of detached houses on all Lots by reducing or removing minimum lot size requirements. We could create incentives to build multiple units, especially on larger lots and we could limit the size of new houses. Now, we just passed accessory dwelling unit legislation the most Progressive in the country that does those last two things, but we think we could go further by providing opportunities for more home ownership in our single-family neighborhoods and allow more households access to the wealth building potential that homeownership provides. The final strategy is to ensure that new housing in every neighborhood supports greater household diversity. We have an ever-growing number of seniors who want to age in place and are having difficulty doing so we have extended families multi-generational families. We have groups of unrelated adults who would like to live together and intentional communities like oh housing, but we simply don't have enough flexibility in these zones to accommodate all these different kinds of households. We also suggest a formal definition of family-sized Housing and the adoption of family-friendly design guidelines that would encourage things like the Courtyard Apartments that you see here that simultaneously provide increased density, but also provide shared open space for families can thrive So those that's just a brief overview of some of the suggested strategies that we have in the report. Sorry. Thank you on the Courtyard Apartments. There's a few of those in my neighborhood and they're just took the great they are fairly small scale the folks. I've known who lived in them love what they provide they're typically one-floor living currently looking for a place for my mom to live without stairs. And that's hard to do. She can use theirs just fine right now. And so that's what she's attracted to because that's where most the options are but she knows that that may not always be the case. And so that we don't see those is is the challenge that that right now the place where you build the courtyard building is the same the same piece of land. Do you know the five story apartment building on and so it just doesn't make Financial sense to build five units is 150 who wanted to do this. We need to put that in the context of the could build single-family homes or Courtyard and then it's going to be more will see more options taking it is that allow it in more places and then secondly, we would need to incentivize it through the specific glad that's really a significant part of this effort is to start a conversation. So we should we could begin talking about how could we do this? What would we really like to do and what might the legislation look like that would incentivize those patterns of development? And that you should be talked about this in the duplexes similarly with Courtyard Apartments. You know, how complex and how what is the likelihood we get it right whatever that means with the design standards to say, you know that I don't know the Courtyard Apartments. I see you're probably 60 70 years old in my neighborhood that probably different building materials today. They're not going to look exactly like that. People will talk to you in fear that these will be big ugly things. I mean to think we have a high level of confidence that a process that they took communion plate we could design something cuz I'm Sarazen place that would create something they were hoping to get. Yes now, it will be a very interesting conversation because one could do for example form base codes that are very prescriptive or you could have no design standards whatsoever. I think what we'd be I'm speaking out of turn here. But but I think what we would likely be endorsing in the in the commission is a balance is an appropriate balance that is both respectful of the existing context. But also provides enough flexibility for us to look forward and really address our current and future housing needs in these neighborhoods things. I have to continue remind myself is that the time, you know, the the building types that we hold up today is the icons of the character the neighborhood were probably highly controversial at the moment. They were being built because they were taking over farmland or whatever it was at the time and so does evolve mean single-family neighborhoods were very controversial when they were Bill we heard a lot of the same criticisms at that time that we here today. Everything looks the same. But they were cheaply built they were taking up too much land that's not to suggest that the buildings that were building today will be held up a hundred years from now is fine examples of architecture, but I think it's really important to note. The change is difficult and much of this is just the sort of shock of of the new and and we will get used to it as we move forward. Thank you Anton to your point at you know, one of those are the things that I am mindful of is no cancel the the broader topic about Vision 2050, you know, what was the region grows? And we expect anticipate 1.8 million new residents were these were there by going to live and so, you know do we want folks to be more living on the on the in the suburbs or do we want a future that has a our communities be more walkable livable? And so I think your report draws a pretty good blueprint for us how to get there. So I appreciate the work that you've done the volunteer time and effort cuz I know is it's it's a labor of love. So I appreciate it and with that I just want to say thank you and make That you had all had the opportunity to Daylight your work before the council and as well as to this committee, we really appreciate the opportunity. Thank you. So this concludes the August 7th 2019 meeting of the committee as a reminder. Our next regular committee meeting will be at September 4th at 9:30 a.m. Here on council chambers. Thank you all for attending. We're drunk.", "end_time": 7879.8}]}