{"format": "raw", "annotations": [], "confidence": 0.943495142967143, "data": [{"start_time": 0, "text": "Good afternoon, everybody and welcome to the special Committee of our Finance in neighborhoods committee. It's made 23rd. And the time is 2 p.m. I'm Sally Bagshaw and I'm joined by Alistair MacLean in my office today. Thank you so much. And I think the first item of business is that I'm supposed to approve the agenda. I'm hearing no objections from anybody. So the agendas going to be adopted. We've got five items on the agenda and there is no one here for public comment. So let me just identify what's on the agenda. We've got the reappointment of Christopher make it is marbles as members of the community involvement commission, and we will have three ordinances relating to Historic preservation adding Landmark designation to parrington Hall two or more Mount Baker Community Club clubhouse and the Seattle tower on 3rd and University Street in downtown. So one more time. I'm looking for anybody who wants to comment doesn't appear that anybody. So we are going to move right on to our next item of business. Unless Allison you have any objection would you read them in for the appointments? Absolutely, and if your item number one appointment number 01351 reappointment of Christopher maykut as a member of the community involvement commission for a term to May 31st, 2021 and item number to appointment number 01350 reappointment of Thais marbles as a member of the community involvement commission for a term to May 31st, 2021 and Hillary welcome if you'd like to introduce yourself and I think your are you new to Department of neighborhoods know I just need to do this to us a job. I am the coordinator of the peoples Academy for Community engagement or Pace, which is Department of neighborhoods Civic leadership program, and I just started Staffing the community involvement commission or the cic. I'm since this March we love that love PACE program and appreciate all that department of neighborhoods is done for that. I'm glad you're now stepping in to cic. I think it was a great add. Thank you very much. Okay, so I think, you'd like to discuss we can read and adopt both of them, but I'd like to hear from you about your recommendations. So we are hoping to reappoint at Thais marbles who has been on the commission for about a year and I actually haven't gotten the chance to meet Thais because she's had some personal obstacles to coming to meetings. I'm since March but I hear that she's a really valuable member of the cic and she really wants to be reappointed and the other members of the cic of Express that they would like to have around as well. When we have meetings can't I use call in if she's available or don't that's a really good question. I don't know if they've tried that yet that most of the things have just prevented her from personally involved in anything but usually what will happen is they just Express that they can't come and that's kind of how they work with their absences if they express it. That's okay. And then for Chris I might have had the pleasure of working with him. He has been on the commission again for another year and one great thing of what Chris has been working on lately is he's really taking charge of the revamping the public comment process and procedure with the cic. He's really passionate about making sure that the folks who come and give public comment feel heard and responded to and that it doesn't just get lost Into The Ether and so he's been really taking the charge in that Sharia pointing him would be very important to the cic. But just for the record about what are the goals for 2019 for cic, and what do you see moving forward? That's a great question. So the cic right now is operating with three different work groups. One is at grant-making and in this work group. They're going to be at reviewing the city's at Grant's landscape and they're going to be looking at how to improve the process for communities, especially for communities who aren't currently accessing those resources and they really want to work on developing or advising on consistency across Grant programs and Clarity and then collaboration across Grant programs as well. And they've met with Teresa Bui who is the program manager of the neighborhood matching fine, and they have other plans as well to meet with other Grant reviewers II work group is right now names Outreach best practices. They started working title. But their task is to survey the major departments like s. Seattle City Light opcd and spu and ask them about what their best practices are for outreach and engagement and I hope to be able to share those across the city and then the third work group is the census 2020 workgroup and they are going to advise on strategies for reaching historically undercounted communities and they've been working with Elsa from our department who is on the census task force. So Outreach best practices. I really want to come in and Department of neighborhood dealer PACE program and some of the others that you have done just to reach into communities and find the natural leaders that have both the ability to speak a language and the culture. I think that's really move forward with that. And also thank you and extend my thanks to whoever is working on the grant programs. And when I first came here 10 years ago, I could never keep them straight. No between What's most parks in when you could apply for something else and One S. Had a grant so the fact that we're having one portal now, I think makes a huge difference for the community. So thank you for that on the census 2020 if you will if I may ask you to reach out to a council member Mesquite his office as well. She's very interested in the twenty20 has been pushing to make sure that people who are may or may not be natural citizens. But to make sure that they are counted that they're involved. So if you just met sejal was working on that and her office, so that would be helpful to our appointments here that we should consider. Okay with that, I would like to move the reappointment of Thais Marbles and also the reappointment of Christopher maykut both members of the community involvement commission. Nobody seconding this I'm I'm moving I'm voting on this so we're will assume that they passed unanimously and this will be off a week because this is a special meeting on Thursday. We won't be voting on a Tuesday after Memorial day, but the following week. Okay, very good. Thank you so much for coming Hillary. Okay, the next items of business pretend to everybody who's out of here in the audience. You are all such a quiet group. I look forward to having you at the table to want to read both of them in for 3 of an item number 3 Kempsville 119 / 95301 ordinance relating to Historic preservation and posing controls upon the University of Washington parrington Hall item number for Ken spell one 19529 and Ordnance related to Historic preservation import and poison control's upon the Mount Baker Community Club clubhouse, and I don't never 5 but one 19528 an ordinance related to Historic preservation and Posen controls upon the Seattle Tower. Very good will thank you all for coming Jessica. Do you want to start with introductions and we'll just go counter-clockwise? What's on my name is Jesse Clawson. I am from akola Hillary and I'm here representing the owners of the Seattle Tower. Thank you, Nice to see you. Again. Peter chair of the landmarks preservation board already settled apartment neighborhoods. Arizona Department of Neighborhood Place to see both of you is always Julie Blakeslee land use planner representing the University of Washington. Nice. Thank you, Julie and I think Allison would like to kick this off because she spent many years in parrington Hall. Just kidding just Okay. Well. Which one are we taking first here? We're going to go with you. W you can tell us I think that accept item number three. So it looks Aaron and Julie if you would like to. Okay, so I'll start with University of Washington parrington Hall, but I'll just quickly back up and remind us that the board considers six standards. And in addition to choosing at least one. They also have to determine that the building has Integrity or ability to convey its significance. So I'm doing today by Julie Blakeslee, and this ordinance is to codify the controls and incentives agreement that they signed with Sarah the city preservation officer. So I'm Harrington Hall at 4105 Memorial Drive Way Northeast. I just was designated by the landmarks board on September 5th, 2018 the board elected standard C D E and F. They the control teacher say identified are the building exterior a portion of the site, which is basically the area just around the building and a portion of the building interior on the top floor. Hall was built in 1902 by Johnson Allen, depending on how are you going to do that subject building was originally known as science Hall and was constructed constructed as part of the University's campus oval plan originally originating in 1898. The goal of a master plan was to look at linking together before existing Collegiate structures in the administration building that we know is Denny Hall The Observatory which has since been relocated further north and west I think or Lewis and Clark residential Halls that both remain today science Hall was the fifth major building and continue to serve the engineering and science programs for 30 years. I went on to house The English Department and was later renamed after dr. Vern Lewis parrington a preeminent English professor and Pulitzer Prize winner. In the late 1980s it became home to The Graduate School of public affairs and continues today at the Evans School of public policy and governance. Would you please go back to the previous slide Aaron? So clearly it's a beautiful red brick building is it is the lower right-hand corner? Was it the same color was it? It looks like a much lighter when I was a student the building looked pale pink, but it was actually painted white and it was painted white a 1908 in preparation for the Alaska Yukon Pacific Exposition. So that's why you see the lighter, and then didn't they in 19. Let's see the mid-1990s strip all the paint off the building and restore the brick finish. It looks pink because the red brick the white paint that were part of the World's Fair and so they were trying To create this cohesive Lord between the new buildings on the existing buildings on campus guys are cool with us. Yes. We are how many buildings have Landmark status on the campus? There are about four buildings that have National status. And then this is the second of the local landmarks. The first one was the asuw shellhouse also called the canoe house. Anything else on this one? It's going to be a problem with the landmark. No, we wanted to land market so that we could understand for the remodel. What were the appropriate boundaries and and features for preservation, but our interests, we have to keep remodeling to preserve our buildings when they're over a hundred years old. And so what are the portions of the Interior? It's the upstairs the two classrooms at the top where they're circular rooms with roof Skylight in them. So it's kind of that open volume of those two spaces. So those will be preserved or you saying they need to be remodeled to the exterior stays the same but they're remodeled on the interior. We're only doing some systems upgrades and a few classroom and office upgrade. So it's a partial remodel And we are just making sure that end. In fact, there's a window that has was closed up in the past. We're trying to determine if we have budgeted such can we reopen that and restore that so it's mostly about the building is not Air conditioned and there are some spaces that are pretty difficult. So we're trying to condition some of the spaces and in that so it's not a computer technology improvements on the inside to Taylor the controls agreement around knowing that this project was coming so that much of the work that's being done by the u-dub either can be administratively reviewed by Aaron Moore doesn't need to be reviewed. All right by the board and so what happens what's what was the decision? Today I agreement was signed and that's what kind of flying here. So as an example of one of those things that we added to the agreement was. The plan to see right to it. If you were at the campus today all of the windows here and wrapping around to the back of this classroom or bricked in so the goal and one on this end and so the goal is Julie sad if they have budget is to put back in wood windows to match the original configuration. So I review that with University Washington facility staff and capital project staff and approved it. So you are very good at a timer right? Well since we're here and it's going to put you to make sure I've got the right resolution number. This was all right, so it's Council Bill 119. 530 relating to Historic preservation and posting the controls upon the UW parrington Hall. So I'm going to move that this Council Bill be adopted a new forward and all these people over here are seconding. It's so all those in favor. Say aye aye. No Po's no abstentions. Let's count on this one being done. Very good. Alright the next item. I'm Julie. You're welcome to stay if you'd like. The next one is our Mount Baker Community Club clubhouse. Thanks to both of you for coming appreciate it. Love that Clubhouse. So Aaron, do you want to introduce? Thank you. So this is ordinances to codify the controls and incentives agreement that City preservation officer signed with the club. Susan Mount Baker Community Club clubhouse at 2811 Mount Rainier Drive, South the board designated as a landmark on October 17th, 2018. They selected standard C&D and they designated the site and the building exterior was built in 1914 by Sir Charles Sido Sea and the organisation begin in 1908 as the Mount Baker Improvement Club working to support new Municipal Improvement projects for the neighborhood like Street Paving garbage service sewer systems virus patients excetera. They also took on larger lobbying efforts to support better trolley access. They also were in opposition to a planned RaceTrac so they had a number of things I think about the clubhouse as I said was built in 1914 has been a Gathering Place for community events speakers political rallies in weddings for over 100 years. The club was associated with a hunter tract improvement company that plaited in developed the surrounding residential neighborhood like most of Seattle properties at that time, the restrictive covenants that were placed on properties and their two notable court cases in the city that are connected to the neighborhood where they sided with the appellants over then permitted to purchase and are built homes in Mount Baker and the club. The club was like the neighborhood primarily segregated and turn until the early 1960s when a group of younger residents challenge these attitudes and is 1967 the club adopted new bylaws and emission of inclusion, which was an example for the rest of the city and from that point forward. There was a steady increase in diverse membership and Leadership and a change to allow community members to join without owning property. And this eclectic building exhibits are Craftsman. Mostly Craftsman influence humans designed by Charles Sido. See he and his father built a number of private residences in the surrounding neighborhood including an area named Josie Terrace and the home of Charles pedo. Is he on 31st Avenue is a designated Seattle landmark. Give a cc and there's an owner of another Dosey house sitting at the table. Till I would love to hear from you gentlemen tell us about it and and what you're doing with the club and and how you decided that you wanted to promote. This is storical designation on the board for 10 years now and it's just it's become recognizes that hard to Mount Baker. So we are a place to gather. We are unimportant venue for the neighborhood for both entertainment and and political discourse events that are happening in the Rainier Valley. A lot of the planning exercises were held in the clubhouse. We are well used and well-worn. We've recently completed a capital campaign and raise the funds to renovate the building. I'm basically patch and paint but the entire building and we Decided that at this point it would be important to recognize In This Moment In Time and landmark the building at that point. It has been modified over the years. It's it's not very well-documented so I couldn't really tell you what it was like on the inside of the building at the time. But again, it is a well-used and well-loved landmark in the neighborhood. So we felt like we deserve recognition else you'd like to add Community suggestions if you torn down in may be redeveloped into something else and so there is opposition to that. So I think to answer that was you know, we'd we did the capital campaign and just started to raise funds for it. And then I think making it a landmark will help ensure that you can survive into the next. Syphilis curable future intact. Well, thank you for doing that and it is an extraordinary beautiful building and having been there multiple times. I know as you say how much it is used in left. So well done for that department of neighborhoods. Anything else are in Terceira you'd like to add. Okay. Well, I'm going to move that we pass this ordinance. And of course I keep slipping past things here. Sorry. Thank you very much. Keep passing is so this is councilman 119529 by relating to Historic preservation and posing the controls upon the Mount Baker Community Club clubhouse, and I'm going to move that we we pass this ordinance. All those in favor say aye aye going to post none no abstentions. So I think we're pretty good on that one as well. So this also will come to our full counsel or a week from this coming Monday. So it's the week after Memorial Day. All right, Miss Jessie Clawson. Do you want to move on to Seattle Tower? You tell us a little bit about this and then I'll ask Aaron and Sarah jumping So Seattle Tower is one of those landmarks that was done a long time ago and kind of was never finalized until next how long how long ago it was designated for I was born June 15th 1977 to get the controls while they're there was a control agreement signed I think in the 80s or 90s, but there were some legal issues with it. And so I renegotiated a new set of controls with the current owner Center across the street and how long have they own this? I know that there's been multiple owners of what's going on. No issues everybody. I mean it is a landmark tickets a designated Landmark. It's just the controls needed to be redone so and doing talk a little bit Aaron or or Sarah about the controls. You've negotiated the controls. We negotiated. We really worked hard to come up with as many items under administrative reviews weekend. So signage security systems equipment and lighting changes that they wanted to make to the interior Lobby on 3rd Avenue some other two. Changes that they wanted to make on the various levels on the exterior outside of the Tower. So we we had quite a long laundry list of of things that I think it'll make it easier for the owner to do what they need to do on a daily basis are willing to go along with this so I can prove dad's and anything else. I think this is one of my favorite buildings. It's really an interesting. I think an interesting building the Building features multi colored brick that have when it was built required a daily delivery of brick that gradually lighten skin color from the bottom to the top of the building. Was this the maybe I'm confused about this but was that the one that was supposed to look like Mount Rainier that is the one that it was called Northern Lights building. So that's the northern life tower is the former name of the Seattle Tower. Features on the building that are finished with light terracotta that resembles the snow-capped rocky Peaks and that there's the stylized metal rods that resemble Ave evergreen trees that surround the building. It was one of the tallest buildings in the city skyline for a long time and that's no longer the case and but it is still pretty much the most prominent Art Deco building in Seattle. It's beautiful were talking about this earlier and I was like, I just couldn't get my brain wrapped around this cuz I know that we talked about the Northern Lights building on multiple times. So it's now reaping rename Seattle Tower and when you go up in the building so skanska for one of their neighboring projects had the top floor rented as their leasing office cuz I have great views of their project site got to go up there a couple of times. It's this incredible like Observatory is a very very tip top. If you ever have the occasion to go up amazing. What is up there in the top now, there's a lot of small office space in the building like the Seattle Tower. I think historically it's had many different offices because of its relatively small floor plate. Is it and it's going to continue to be office not none of mixed use anything else you'd like to add. It's beautiful. No question. Nothing more agreement. I didn't but the client somebody did okay and nothing else to add then I'm going to move the we pass Council Bill one 19528 pertaining to the new Seattle tower all those in favor. Say aye aye unopposed no extensions done. Thank you, but no. Thank you for coming and thank you as always for these really good write-ups know they're fascinating history. But you know who's going to love them as is in about fifty years when people look back and going to do so, it's not really appreciate your doing that. Okay? Well, I think that that is the end of our agenda today. So I'm going to just announced at our next meeting of the finance in neighborhood committee will be Wednesday, June 12th council members. I hope will join us for that Alison MacLean. Thank you so much for organizing the special meeting and the meeting is adjourned. Thank you.", "end_time": 1707.6}]}