{"format": "raw", "annotations": [], "confidence": 0.9574489310636358, "data": [{"start_time": 0, "text": "Good morning. Thank you. All for being here. Today is Thursday, April 18th, 2019 the housing Hills Energy and workers rights committee will come to order it is of the committee to share with the committee and joining us for part of the meeting today as well. As our alternate we have five items on the agenda for today. The first is the office of housing 2018 will report which is a command and attachments. Thank you officer housing for your work on that response and recommendations on the expansion of the home repair program of legislative intent that he Prime sponsored and we had the opportunity to co-sponsor Wisconsin armor bagshot. As well as the as well as the discussion of possible vote on the paid sick and safe time ordinance that we are going to consider today, and finally a resolution supporting and responsive workplace has in the city's legislative department or legislative branch. I think I accidentally said content from are fossa who are also with the office of housing a sister for the confusion. So those five items on our agenda housing and paid sick and safe time and the response that we're putting forward for the legislative Department around safe is sick, and I'm sorry we're related to safe and responsible workplaces. At this time, we will go ahead and open up for items that appear on today's agenda. We have one person signed up. Thank you so much for being here Sandra Taylor if you'd like to come to the microphone, you're welcome to testify. Good morning morning. Just ran into one of those. There you go. My name is Sandra Taylor. I am the Seattle preschool program coordinator with child care resources. And on behalf of the six family child care programs in child care resources Seattle preschool pilot Hub. Thanks so much for the opportunity to present our program to you and more importantly for including in-home family child care programs in this spp pilot over the past two years Family Talk accounts for 20 to 30% of all preschool slots in Seattle and offers children and family such Rich experiences. We are so grateful to be included in this program. I am excited to touch on a couple of highlights of our work over the past two years as well as thoughts about where we could go from here first. It's important to point out the uniqueness of the family child care model FCC providers cultivate and maintain much deeper relationships with both the children in their care and their families largely due to the intimacy of an in home environment with fewer children. This deeper understanding of children's needs and family situations combined with a nimbleness of a smaller program impact how a provider customized has her teaching caregiving and parent involvement. These two unique strengths definitely contributed to the positive outcomes the pilot participants experienced and it was easy for all six of the FCC providers in my pilot Hub to identify differences in their programs pre spp pilot compared to their programs today for significant improvements to all of their programs include evidence-based curriculum to guide daily learning activities assessment tools to better track children's development and progress towards Milestones access to free third-party Health screenings that identify learning barriers such as Vision impairments or developmental delays that need medical intervention and biannual observation from a u-dub assessment team to track the outcomes of the tools. One sec assessment recently reported that the vocabulary level of children and NFC Pro programs was equal to or higher than that of children in Center base STP programs. These program improvements help increase providers confidence going into upcoming rounds of early Achievers re-rating Cycles were some what were some or all of these FCC programs will likely Ernie level 4 rating. Another recent highlight was our experience participating in the sppk study coordinated by Seattle Readiness Consulting. The FCC model is very different from a center-based child-care model particularly around Staffing and capacity to participate in such activities without disruption in their program. I was very impressed with the flexibility shown by deal and the consulting firm in accommodating the unique schedules and availability of the FCC participants even hosting an evening focus group that begin began at 10 p.m. East Coast time. The recognition and accommodation of FCC scheduling challenges meant that all six programs were able to participate in which conversation together looking forward with these new resources in place at the stronger programs. There was a clear desire and natural progression to focus on quality and reflective practice to Foster further growth and Improvement additional needs one clue support and getting certified for the tsg assessment tool and the means to hire ample staff to perform regular assessments without learning destruction. Thank you. Thank you so much Sandra and we'd love to also I have you if you are planning on it come to the 2 p.m. Agenda equity and new Americans and education committee were going to be a little bit more this afternoon as well. Really appreciate you being here. I get to sit on that committee as well and we know that everything real. What is a childcare and child care access also creates greater Workforce debility and housing stability. So definitely ties into our work plan. So thank you for being here this morning and study they can share with you more information about this afternoon. Anybody else here to testify? Okay see you then that will close today's a public comment, and we will move on to the first item on our agenda. But it if you could read into the record item number one and while she's doing that if we could be joined by Steve Walker the director of the office of Housing and anyone from Central staff is also welcome to my agenda item 1 office of housing 2018 annual Investments report for briefing and discussion. Thank you all for being here and let's go down the line and do introductions. counselor mosquitoes office Steve Walker office of housing welcome. Thank you so much for being here. We're excited about this conversation as the first of many conversations today to really tearing up for us at the framework for our future discussions around the administration and finance plan and as well as discussion that we heard a lot about last night from some of the candidates interested in serving in District 4. There's a need to talk about updating are multi-family tax exemption program the renewal and update we will be talking about this summer and I think we'll also helped us think about how we on successes and takeaways in these Investments solution to housing and affordability in this area and the homelessness crisis that Seattle is facing as we talked about before this is an issue that cities Across the Nation are really grappling with and we've had a lot of cities come to Seattle before and learn from us, which I'm really proud of and in this day and age were also learning. Other cities and how they just filled up skill that many of the program that we piloted with additional resources. They've been also be able to be successful there. So as we look at how we're making investments in affordable housing, I'm especially interested in how we're supporting community-driven projects that serve dos were most impacted by housing displacement the cost of housing this housing. The homeless is Crisis and particularly how our better serving communities of color who definitely are showing a growing interest in both site control and getting into development and ownership and self-direction of projects with in their communities that not only create housing the great cultural space as well. You know, we talked about plazas and child cares and small business opportunities and community centers as well as senior programs that can be operated out of buildings that are being generated to create affordable housing as we begin to get more into the conversation around the payments coming in through. Mha How we'd like to see those Divya. I'm very interested in how identifying other resources for more robust investments in affordable housing such as bonding against existing Revenue sources, which I know something we talked about last year and we wanted also get into conversations around what other revenue streams maybe we should be taking advantage of that have a high return on investment that we haven't yet taken advantage of really interested in your takeaways on how we can braid funds one of the concerns that we heard is that there's often silos within government. That's nothing new. We have a lot of really great programs, for example, or Equitable development initiative. I think mirrors some of the work that you are trying to do in the office of housing, which is not making sure that we're not only investing in the housing units, but as we talked about those cultural spaces, so love to hear more on what we can do for him forward to continue to braid ETI funds with office of housing funds and to realize that project That invest in housing and cultural space really do create Community you come in. That's okay. Traffic is really bad. I let them know you were joking about that sides that are being generated and in North End especially around Child Care Facilities, which is a really great opportunity for us to learn from what we've already done and see what we can do this year to bring in more of those Community desires and make them actionable in your plan. So with that will turn it over. We know you guys have a few pieces on the agenda. So we want to run through it as fast as possible about an hour for three different components. Great. Thank you for that intro and I'm going to kick us off and we're going to tag team across the table here, but we are excited to be here today to share an overview of our annual investment report, which is a wrap-up of the impacts of all of our programs during the 2018 calendar year from rental Housing and homeownership Development to home repair and are weatherization activities. We have a lot to share and before getting started on what will be represented here as selected highlights of the year. I want to make important note that we have submitted all of our annual reports to you. They are all on our website. And that we take very seriously a commitment to both stewardship and transparency. I'm with that. I think I'm going to turn to Emily. So like to remind us before we launched into about 40 minutes of presentation about dollars and buildings and sites and acquisition that we're really always talking about people when were talking about housing and so wanted to touch really briefly with a reminder of who we are building housing for housing is about the people and it's about the individuals and families who are living on the street or in shelter veterans and working people many of whom have were born and raised in our region who are exiting homelessness to live in affordable homes on. This is about the families that have lived in Seattle neighborhoods for Generations were watching their neighbors priced out an affordable housing investments allow them to stay this is about the people who make up the backbone of our economy and able to live near where they work like the 15,000 certified medical assistants in nursing assistants countywide who are foundational to Health Care Services. And are making at or below 60% of area median income is about Gwen Anderson on the upper right hand corner a resident of North Haven, which is a senior housing development in District 5 and who is able to live with dignity and build strong Community with other residents in affordable housing medical and dental facility, which is which is a Wonderful by product that we did not see coming, right? As much as housing is about people it is also about place. It is fundamentally about creating an infrastructure of equity for our city. It is the infrastructure that ensures that low-income people are included in the fabric of our city and I think of affordable housing is really essential Urban infrastructure, and when we invest in it, we invest exactly to your point council member misguided not only in the housing units that come above butt in the delivery that comes on the ground floor and that includes places like Child Care Centers Health Care Centers and Community Gathering spaces. We have examples from last year's investment of Community Focus units like at yesler family housing with childcare on the ground floor or in community-driven projects Like Chief Seattle club, which is providing both housing and Health Care Facility in community Gathering space. It's about infrastructure that also aligns with our significant investment in transit infrastructure something we clearly think about it infrastructure. And when we do transit-oriented development, we're not only making the best of both of those Investments, but we're also ensuring that low-income people who are the most Transit dependent are able to utilize our Transit System. Today we're talking about our investments that sum up a lot of the resources that we have. These are resources that come from a variety of places including our house and Levi are incentive programs and other sources that we'll talk more about but a really significant source that we have is the Seattle Housing Levy and on that specifically we wanted to point out that one of the attached reports that we submitted to you all and that's available on our website demonstrates our success at delivering on the housing Levi promise. We are two years into the 7-year housing Levi and in all of our programs. We are either meeting or exceeding the goals that we have promised to voters. So at this point I'm talking about that one for fun source to our programmatic investments. We're going to start off with the 2018 awards for rental housing funding. This was a high-water mark by any measure for production. We made Awards to 10 buildings comprising a total of 1197 units of affordable housing one reason for such a high production number in 2018 was an extraordinary level of Leverage and that is in this context fancy for other people's money. The purchasing power of each City dollar was Amplified to the tune of over $5 of other people's money, and that means that 1,200 units are being delivered. Forest City investment of only 68 million dollars that works out to about $56,000 a unit which is a very good deal. If you want to look at it a different through a different lens. Remember the each of these units is income and rent restricted for a minimum of 50 years. So that means that when you look at those 68 million dollars annualized over that term you are buying about 60,000 apartment years of affordable housing. It is a Smokin deal. I will say that the this level of Leverage from this year may not always be replicable. There was sort of a Confluence of events this year that both we and our development Partners recognized and pounced on so, you know normally wear in sort of the three and a half to $4 leverage ratio, but it's certainly a moment to celebrate right now. Welcome council member O'Brien. Thanks for being here. Go ahead. So, how'd you do that my expectation that you lost that is as we expand our housing investments. We will run out of the leverage dollars and we should expect to go from the $3 down to the $2, correct. And so what's the magic you worked or is everyone else stepping up their game to I don't think the feds are actually a very technical point the federal low-income housing tax credit, which is the biggest source of Leverage that matches up to our dollars the federal government designated some new areas in Seattle north of yesler as a designation called a difficult to develop area and you get a boost on the value of each low income housing tax credit. So it just really amped up the amount of private Equity coming into these projects and one doesn't know from year to year whether that designation will sustain we are hopeful that it does and in that case. You would see a new kind of Packard in terms of investment, but it was entirely because of that Federal designation geographically. But the point you made is true that there is a point where as we scale up locally. There will be a diminished return on the ability to leverage we are not there. So I don't either that or we've been telling you is true. It's it's you know, it's not a problem. I want to say I hope for both but we still have great leverage opportunities if we can scale locally and so the big the big pools that I'm aware of our are HUD the way I know how many Section 8 vouchers get assigned to projects the the state Housing Trust Fund and then the federal year-to-year the politics the winds are blowing one way or the other and those can be robots to or not. And so I guess there's a bit of like always bracing for the fact that any moment one or two. Sources could significantly go away or diminished right? And that's why we always end for tickly to Emily's point about delivering on promises we forecast for not a best-case scenario but a middle to conservative scenario. So again, this is a moment to celebrate but we also don't want to set up a new false expectation to sources shown on that pie chart on the right that have the that have some untapped potential are the to sort of Grey frames the 4% tax credit that gets coupled with a tax exempt bonds. That's a space where we can take advantage of additional leverage opportunity. If we have the local resources to initiate that I did want to just March quickly through the pies without dwelling cuz we are pressed for time. We did make some reinvestments this year 7 million dollars for 231 unit. These are usually for older often sort of historic character buildings where a systems or structural upgrade both extends the useful life of the building and also extends the affordability term, which is an important pairing there. I will say that the levy stands out as the foundational source of our funds. It's the blue Slice on that pie. It was also true o or orange Send the reverse but about a similar slice of pie was a one-time infusion of 30 million dollars from the Washington State Convention Center expansion. That was of course one time but it was wonderful to be able to capitalize on it this year and it will be quickly going out the door. We've already talked about The leveraging Source One Thing Really distressed here though is that those tax credit Equity slices that's private investment and the bank Bond financing that's tax exempt debt to private activity Bond. So there is a lot of money that is not local public monies that is coming into these projects next line another statistic that you threw out that I think is important is you said that it's about $56,000 per unit here tell us what the difference is because we often think that affordable housing construction is about 300. $50,000 per unit. So how do we get to 56? Thank you so much for asking that 56 again is a matter of Leverage. So when you have $5 of other people's money coming it in matching up to every $1 you have delivery unit for $56,000 to City resources. I will say that we modeled for the levy about 80,000 of City. So again that speaks to that conservatism. But again, it's very important to understand that even under the most conservative. Scenario City dollars are Amplified many times over on with other resources to deliver each unit. And it's a series of Pies the work that we do at the office of housing is suffused. Obviously in values but effective Administration is also one of our calling cards each exercise in Public Funding. No matter where you are is a matter of balancing priorities and that is what particularly the left pie on this chart starts to capture. You see a pie there of 10 buildings. These are the buildings funded in 2018 and to homeless projects to are for special sectors including seniors and people with disabilities in this case chronic mental illness. And then the the orange slice is of low-wage working individuals and families. It's important to realize and Steve will touch on this in a minute even within that orange slice of those six sort of general population buildings. There is a great deal of variety of project types and Potentially councilmember Moscato to your point about Community responsive ground-floor uses and community-based Partnerships. Those are the types of properties that also fall within that orange slice the middle by a quarter of the units are for people with extremely low incomes 30% of area median or below and that speaks to the fact that again in that orange slice you are seeing blending of income levels. These are not all just sort of generic 60% area median income buildings. Those are very very important to the overall picture, but it is also important to be able to blend different levels of affordability and when possible And then the final pie let's just pause here for a moment and look at the slices of the two three and even four bedroom units that is 36% of the total production. People talk a lot about the importance of affordable family-sized rentals in the city. This is the one sector I can think of where that is being delivered on a constant basis. Again. Those are located in those six buildings yesterday a couple of Us Walkthrough a building that we funded a couple years ago 8th and Jackson. It is definitely worth a visit is just finishing up right now. It's incredible. It has 44 two-bedroom units and they are already leased up. So there is clearly active demand and great benefit Doug being delivered by this kind of unit. I'd like to but if we were to just look at the three and four bedrooms, what is that about 10% so it would be helpful for us to have a better sense of what are our goals for especially three bedrooms cuz I appreciate what you're saying here. A lot of families are going to be able to benefit from having at least a two-bedroom as we think about the nuclear family being larger, especially for some of our immigrant Refugee communities and wanting more people as we saw from the Seattle times are for just a few days ago. I had to be able to have a place to keep their kiddos in the school district here and Seattle and be able to stay in Seattle. I think you need to continue the scale of our number of three and four bedrooms. So would love to hear more as we go forward. What would be a goal of ours around three bedrooms and do other cities have goals that they're aspiring to that are larger than 10% and that is a great point. So fruitful conversation to have again that gets to that point of administration in terms of balancing priorities when you're working in the space of a single adult homeless people those are clearly going to work against achieving the goal of having a dominance of three bedroom units. It's also important and so again working Balancing exercise is how we spend I would say much of our time in the office of housing. My understanding is in the market rate units that are being produced two bedrooms and above is single digits. And so this is just a man obviously were being very intentional and dealing with subsidized subsidies here, but it's amazing to see this many to three and four letter words being produced at the percentage is great. But the absolute number of units when were producing 1,200 units and we're getting 30% I mean, it's one thing we did three units, but it's I think it's something in the neighborhood again. I can't do math off the time and I think that 430 units we should understand that that's 311 two bedrooms 106 3 bedrooms and that 24 bedroom. So the times that by 2 and 1/2 for 3 Individuals being able to live there. That's great and thank you for that reminder. What's concerning me? Cuz this is what this conversation has been going on about two or three bedrooms for a while since I've been here and balancing that with Sheltering individuals or couples that can live in one and so we know the demographics of course of Seattle or have changed drastically as well as our population continues to go up and my past experiences building housing in Indian Country. There's no such thing as it is a one-bedroom be there just isn't everything is built to three and four bedrooms cuz a families and extended family. So we could have have a western attitude and concept that there's a mom and a dad and one kid, but you don't have a mom and a dad and a grandma and Auntie you taking it in these you taken in you know what I mean? I'm trying to calibrate the city to start thinking that way that extended family, which is recognized under federal and state law for many things. It's some point. I'm hoping that we can buy more. I said in a law that we don't just focus on everything is a one or two bedroom and particularly in our district, which I was concerned about about the transitory development that's going on at Northgate. We've been working with Simon properties in those Folks up there and the Wallace and Thornton Place people as I keep hammering away is I don't want to see one bedroom two bedroom condos. That's not what we're going to be seeing particularly with two brand-new elementary schools online one school has 1600 students. So I'm hoping that we're planning not from the 1980s but in the next and I think the census will bear this out. So that's where my head's at as far as planning Citywide and I'm hoping that at some point we can can cata find it's not just anecdotal. Thank you. So I'm going to transition to talking about those same 10 projects but in a more thematic way and this is a list of projects that you're familiar with. We are here with you in January when we put before you sort of our 2018 Awards & broke these projects down. So I move fairly quickly, but I think it's worth touching on them again again organize thematically here. I'm with the first thing thing being homelessness and we know that housing is what ends homelessness and thank you. I will point out on each of these two projects is a few unique characteristics as you know, the K site the second one there is taking advantage of publicly on city-owned property. And the first one is to your point earlier councilmember Moscato. This is where we are and have been successful and braiding funding with e d i a z t i is participating in investment on the ground floor. Yes. Are those the power of a community that knows a community that talks to people to give them the services they need to get them indoors. So I'm really proud of that that have some just one institution that thinks it's their job to not really use the gems on the ground those social organizations and safety nets that have been in those communities and all those those those groups and know how to house them know who they are. So for happy about that. There are as you know, many different populations in our city with many different affordable housing needs here are two examples from this year's funding where we are supporting specific populations and their needs the first being a senior project in North Haven at North Haven where we're supporting seniors as they age with dignity in an affordable home. The second one is supporting individuals living with mental illness at Yancey Street housing. Steven the Yancey Street numbers in The Leverage. They're not going to do the math, but 1.5 million at Citi investment. Is there a lot of private funding for mental illness? What I know of at least in contrasting those two one of the things that stands out is that we're taking advantage of the 9% housing tax credit as opposed to those tax credits and bonds or the financing is different and when we can tap that 9% credit off, I mean that's that's our largest dollar-for-dollar leverage opportunity. There could be more nuanced and I'd be happy to follow up with you as the city's portion deserve. Well this time I mention the operational costs are not included here. And those are probably signature this one in this one got there calculators going but I'm not and we welcome those questions to ask in anticipation of more math questions. I think I'm one thing that is also in play. Behind the scenes is when we we work closely very closely with the other public defenders on the county being a big one. And so sometimes we are you negotiating with the county about you go deeper in this project will go deeper in that project. And so sometimes that's what's also at Play. Miriam reference this this is the balance of the six projects that you know calling him low-wage Workforce housing is not fair because each one of these is is unique and balancing multiple priorities with limited resources that are heavily oversubscribed is a very challenging Endeavor and it requires effective Administration. I wish to call the staff at the office of housing that do incredible job of sort of balancing all of these on competing priorities with the resources that we have. And so again, well categorized as a low-wage worker housing each of these six are unique and I'll find out a few of their uniqueness is they represent different developer types mentioned a few times today. I'm community-based organizations, but also represented here are is our work with some for-profit affordable housing developers that helps us get to scale. The projects are scattered throughout the city an important source of Cornerstone priority for for us over the last 30 years of investing. These projects also include innovation in Building Technology specifically the fellow Apartments. And then I mentioned efficiency to scale you can see and it was reference earlier type in that we just walk through yesterday that's beginning lease-up is a 327 unit project, which is one of our largest. If not the largest new construction project that we've taken on and it's beautiful. I'll also mention that at the Maddox apartment where we we're sort of a few years back. We supported in the state-funded a massive environmental cleanup. So this is taking a Browns field and turning it into eventual affordable homes. And then as has been reference, there's a diversity of unit types from the studios and whines but most importantly the threes in the four bedroom units. Think I'm looking at the the names of the night Alex there, which I assume is the the developer and about half the names I recognize is folks it show up on these reports on a regular basis, but a bunch of the names are not familiar with are we seeing new players entering the market or new players coming to the region or are these more private developers are getting into affordable housing? I think the first two categories you name these are these are new developers that are getting into the region. Maybe there's a couple of those are a g MD and GMD on this list is Inland on this list. Yes and Inland group. Those are two for-profit affordable housing developers that have found a way of participating in the in Seattle, which is fantastic. We also see these new community-based organizations represented here Fame at the very top that's a fantastic opportunity organization Vision, which is taking advantage of a housing that was built in the central area in the 70s and it has been realized by Fame that they can add density to this being assertive. Garden style developed Community this very valuable and very centrally located and so we are participating. This is the first phase of two phases where we will be adding significant density and significant number of three and four-bedroom units really exciting. So that's a small community-based organization that they have housing and they are going to identify that housing. It's great. You know, we've been talking about the challenge around affordable housing for a number of years. Will you all do this everyday forever, but it seems like the call went out a number of years ago that we need to significantly increase and it seems like there's the market or whatever respond Anderson stepping up GMC was before the Scandal and transportation committee a couple days ago because they have a project that will never show up on that. So maybe it will on a different list because they're going to build 211 units of affordable housing at 60% of am I believe they beat 80% but without any of Housing and other light there was an acquisition funds that I will be paying back shortly and so great to see other tools coming in in addition to 1,200 units at the city subsidizing that there are people figuring out ways to do it even without City Subsidies and thank you for pointing that out. We're going to add 10 more minutes to the clock for this item. I know you have a few more slides before we go into the second which is the statement of legislative intent will also have to read that into the record. So just want to let you know we'll pause at the end of this presentation and then we'll do this by referencing the reinvestments that were made in the in the funding round and I will just note that as we've talked to you before stewardship does not end at at funding and creating the unit but it's a living and walking alongside that building in that unit for 50 years and sometimes that means coming back and reinvesting and some of the systems and repairs that are needed and that's what's reflected here in these with these for sponsors that represents nine buildings. And if you can see 231 units that are aging buildings within our affordable housing portfolio. We want to keep them fresh and up to code. I'm taking my bro, Brian just heat up a conversation about our acquisition and preservation program. We have a 30 million-dollar program of funds that uses short-term lending of our long-term capital and operating and maintenance fund. This is a conversation also teeing up as council member mosquitoes mentioned will be coming in front of you all with our administrative and financial plan and housing funding policy is this is one of the proposed changes that will be talking about availing additional resources as part of a revolving fund to be able to take advantage about with acquisition opportunities as they arrived as you see on this some of our acquisition loans were used for land and some were used for multifamily buildings that are existing in some cases. We are likely to be the permanent funder of that project to have our long-term money in that regulates it as affordable in some cases like at Willow Crossing that was just reference. We are the acquisition funder and so we What is a regulatory agreement on the property by virtue of that acquisition loan, but we will not put long-term funding in the project a really exciting opportunity. We see more chances to use our acquisition lending in that way through partnership with the Seattle Housing Authority in partnership with other folks especially as we see changes in the market to make sure that were able to capture buildings that are there and and hold them and as a affordable. At this point that we is expended 28 million of the 30 million dollars of authority that we have. So we'll be seeking the authority to be able to resolve this fun. We will definitely be ready to do that. This is great investment. I think this is part of our more exciting body of work at the office of housing in part because of Jenn Librax. Here's leadership. We have had an increasing commitment to permanently affordable homeownership at our office and used to be that we primarily funded down payment assistance that supported first-time low-income homeowners and buying a home. In this case. We've made a investment of 68 units at our first city-funded limited Equity Co-op as part of Home sites a fellow Square campus. So these are households that are we living as part of a Cooperative model. This is another place in which we're braiding EDI funds while we participated in one of these buildings. The other buildings have support from the Equitable development initiative to deliver on a multicultural collaborative space and other uses. So this is a really significant step for the city of Seattle in the office of Housing and supporting this Innovative financing to support low-income homeowners. It's also A multi-family building. So it's home ownership in a multi-family building capitalizing on both density and the stability that's achieved through homeownership more modest investment to take some homes that were supported through down payment assistance and convert them to be permanently affordable with Habitat for Humanity of interest to this committee and for a work plan going forward. I also see this is not just a homeownership opportunity for creating housing stability, but truly an economic stability issue for our city at INR workers at large because of the lack of retirement Security in this country often home ownership is one of the only ways to have a guaranteed potential Revenue Source or Equity built and you know when we go to places like when I went to Berlin in Germany, they were saying that 80% of our city our renters will we have 52% of our city is renter's we all want to make sure that rental rental units have stability and are affordable. Well, but the difference between here and Germany is that they actually have more retirement security and pension through their work. And so without that type of I'm back. For workers and retirees. We need to be able to create this Equity option and you know, my husband, I would really lucky. We just got the keys to our first townhouse and one of the things that I want to do in through that experience to say that was an easy, right we had to dip into our retirement and that's very scary and what we were in a really good place of privilege having good living wage job that is not the reality for so many of our families in Seattle. So we'd love to help amplify the work that you're doing especially around home ownership recognizing that this is an a worker's disability retirement stability issue as much as it is about creating a access to housing stability. So thank you for your work on this and will continue to amplify all the work you do it. Oh H, thank you and I should also mention. This is a really important place to say that this is also a body of work around racial equity. Explicitly we have a racial wealth Gap in our country in part for many reasons, but in part because of the way in which the federal government subsidized homeownership largely for white middle-class people at the expense of communities of color. This is a modest way to Target our programs to low-income people including communities of color and help to close that Gap at lbl very much. Thank you for saying that really appreciate the real dedicated focus on Lakeland Electric coops, or other tools like that and it's great to see if project it's ready for that and hopefully you will see more opportunities going forward 2 and 1 of the things that you can look forward to also an R and F plan is some work that we have around accessing publicly owned land and doing home ownership development on publicly on-site to grow a continued pipeline of opportunities to support this work the fundamental underpinning of everything that we do at the office of housing is about Furthering fair housing in furthering fair housing is about a few things first. It's about serving diverse populations, including protected classes seniors people with disabilities and communities of color II. It's about geographic distribution providing housing Choice across the city and what you're looking at here is our 2018 investments in rental and homeownership napped on our two maps that come from our growth with Equity analysis around access to opportunity and displacement risk. And in either way that you cut it. We are both addressing displacement and we are advancing access to opportunity for communities the Third Way that our investments affirmatively furthering fair housing choice is in the way in which we lease up and sell all those units. And so something else that you'll see in our administrative and financial plan is the extent to which we own our investments to deliver on additional anti displacement Solutions around Any preference and affirmative marketing? What map you know, we have talked a lot and tells memorize I appreciate your comment about numbers and math and it's important to bring the conversation back around to the people. I'm fully one-third of the staff at the office of housing actually does direct service work through our home repair and weatherization programs. This is part of the soul of our office. And one of the things is very very moving is to see the thank you notes that come in to Jennifer's staff for going into people's homes and helping them project manage very complicated projects in terms of and flip to the next slide are weatherization program. Lots of numbers here 26 multi-family buildings address this year upgrade to a hundred and one single family homes doctor home repair. We have 44 low-income homeowners who received that type of assistance and I will say cuz I can't come to the table without saying it remember but for $15,000 to address a leaking roof or broken side sewer a low-income person is at risk of losing his or her most important asset not only for him or herself but also to pass on generationally and so these are extremely powerful tools in the space of anti displacement o h has over the past couple of years really ended up with a revitalized rejuvenated embracing social justice initiative change team. These are programs that got intensive scrutiny under a racial Equity toolkit to make sure that we were doing the kind of Outreach and engagement to make sure that this direct service was addressing exactly those people who are at the greatest risk of displacement at this point in home repair. For example, we are currently at 53% people of color. I will also note that both programs are very heavily dominated by seniors. Which is again another reason why the Personal Touch the in-person project management support is so important. We know historically that that has dead people that when we talk about gaps we were talking about people who are deliberate in creating those gaps whether we're talkin about homeownership education house voting and across the board, so this gives me hope so, thank you very much. I'm a few upcoming challenges and opportunities like to highlight our takeaways from our investment in 2018 are are several first council member O'Brien, you mentioned operating and maintenance and services dollars that goes into our projects to support populations who have service needs and that is a key piece of what we've done what we do we've been able to front load significant investment in permanent Supportive Housing as part of our Levi resources these first two years. I do want to call out that our ability to continue at a sustained rate of production of permanently of a permanent Supportive Housing requires additional operating and maintenance funds once was a time that we could count on the federal government to provide that through McKinney or other sources that is not the case anymore. So our ability to scale up on psh will require additional operating and maintenance funds. 1 TSH project a year and we're up in that to appears to be about to a year. That means is at the end of 10 years. They're 20 programs projects out there that need ongoing give me the capital deal is one deal and that's really important that the operations of these is a lifetime of operations. And so that is a cumulative impact. It's a lifetime of operating support and a lifetime of Service delivery to your question earlier about the use of vouchers in our projects. You know, we had a generous commitment from the Housing Authority for this Levy to produce 300 doubters that we've been project-based to provide operating and maintenance support in our permanent Supportive Housing buildings primarily and we have at this point utilize those three hundred bucks or so in order to keep going forward. This is a place where I will need some attention publicly owned land. We continue to be excited about delivering on publicly on sides. We're working with Enterprise. Runners on their home and hope initiative we continue to find sites that we can then RFP we were excited to be able to deliver very quickly on the case site in terms of producing an outcome on that side. What we want to remind everyone is that publicly on sites can do one of two or both things primarily and that is that can produce low-cost lands that helps reduce the cost of our projects or two. They can provide access location to leave to communities that that otherwise we wouldn't have had access to so we'll keep an eye out for both of those opportunities and have some that will bring to you in the coming in the coming months that we have continued to want to do strategic site acquisition. I won't dwell on this what this will require a change to the administrative and financial plan to build upon the work that you allowed us to do in doing either direct acquisition of sites are buildings or doing so through our partners and then finally will have an ongoing body of work in the coming months about producing Equitable outcome. Community preference affirmative marketing both through our changes to the administrative and financial plan which empowers this body of work and then also through a process of working closely with the office for civil rights or City attorney and the community to build guidelines on how we Implement those policies. The next few slides were about Investments on the incentive zoning and are mandatory housing affordability program. I can touch briefly or we can come visit you a different time to talk about these all of this information is covered in thorough reports as we mentioned that are available on our website. These are two programs that are in place that help us both deliver unit on site in market-rate developments and also that have the option to make payments to our office that we've been invest in the ways in which we've already discussed through this presentation. So these few slideshow our units that have been placed in service through performance or the dollars that have been collected and expended by Incentive zoning and mandatory housing affordability program one thing I'll say really quickly. Is that a big question of mha and our incentive programs is what it looks like to produce units on-site versus producing them through our investment on this slide. You see a building that has units on site performance units included in a market-rate development on this slide. You see dollars that have been invested in affordable housing through our investments and I think you could see that all of these are high-quality buildings. Excellent. Well, thank you very much. This is a really a moment to celebrate to celebrate all that you and your team at the office of housing done has done and you know specifically director Walker. Thank you for shepherding us through these last few years 5 years write 5 years in this type of housing does not happen overnight. So this report is really a reflection of your entire tenure at the office of housing. We have a lot to celebrate because of your work there and I don't want that to go unsaid we know that this has been very much help should be driven by your direction in your leadership. So thanks to you. Thanks your entire team for getting us to this point. It's hard to see some of your tangible Investments immediately, but I think this for this year's report really shows the long-term Investments over the years and the other final questions. We're going to have you guys back I think multiple times in the next few months here. Good two years three years. The typical time cycle is two to three years on the development cycle is exactly the same as what you would see in the private Market. Obviously, there's the the front end we make an announcement and award long before a private Market person would even surface in getting permit. So there's a. Of time up two permits and then construction. I think the building we were just talking about today type in that is just around the corner is really worth of it was awarded at the end of 2016. So it's a it's a standard turn around for a major capital investment connecting with council members get his head there. We declared Housing state of emergency about three and a half years ago and receive a lot of criticism for Not being able to respond as swiftly as possible. And I think that criticism is fair and legitimate and we need to continue to help you said Steve the solution to homelessness is building housing and building housing takes years to 23, but there's probably even a year to work before it comes to us and we make Awards and site acquisition in those types of things and you anyway see what the work that you all are doing and all of the Community Partners out there that are part of this are the challenges when we say, oh my gosh. We need to build a bunch more affordable housing. The reality is if everyone jumps to it immediately. It's going to be four to five years until he see that and when I look at these numbers and where we've come from that is starting to materialize now, and the reality is that means the thousands of people that when we declared a state of emergency, but had to wait and that's real and There's some harm being done there, but I think two years ago. We opened about 250 units of Housing and we are now at a pace where we are funding over a thousand units a year. It's not clear that it sustainable but we've had a series of one-time heads and there may be a few more one-time hits in the next day or two. They can help that and so maybe it is sustainable with a concerted effort. I don't know but do you guys have responded in an amazing way your team that the team hear the team is not here and frankly the folks that that you partner with that of all up their game. It is really amazing to see and I think I don't know what's going to happen how this will materialize on the street while ago but I do know is thousands of more people believe finding shelter. If we don't stop the inflow ending homelessness, you know will continue to be overwhelmed, but it may be that you know, we've quadrupled the amount of housing. We're putting out in the year before Year and that if we can sustain that for a few more years That's going to make a noticeable difference. The other thing I wanted to say is the transparency with which you all do your work. I mean, he's a really big reports but that there is so much information in here and it's so amazing to be able to go look at any year at any project and see what is the spread of units who are the dedicated to what is the mix of funding? What address is it at? What neighborhood is it in and receive a lot of criticism for folks who are critical of government in general and that's fair to do that. Sometimes I get frustrated because they're worth that you all get slumped in and where does that money go? I'm like, what do you mean I can tell you exactly where that money went on any given year and who's living in that unit today and the challenges you all face is different than the different departments, but I really have been impressed with the transparency in the reporting you do to be held accountable and demonstrate the folks in the Do you know when we struggle with things you're clear about that when there are good things that happened but maybe One X or clear about that and I am just really proud for the city of what you all are doing. I think it's some of the best in the country. So thank you. I want to hear it a lot of what I was going to but you said it much more eloquently than me cuz you've been doing this a lot longer. So thank you counselor Brian, but there is a lot of work and there's a lot of information in the 2018 report. So if this is what the future looks like, I'm excited to see this time next year when we sit down that the trend is going up. Am I know that doesn't make the news all the time because you know people don't that's not what they want to focus on your not going to take the time to see that we started here and we're we're moving up and we are addressing how we shelter the unsheltered. I was just at the opening as you know, what the climate place and that was amazing hundred brand new units and three people were moving in the very next day. And I don't know if they're at capacity. But it is just an amazing. We also did the Tony Lee house and with Pre-K at the bottom and I can go on and on at North Haven and you know, what we're doing up in holler like a Bitter Lake in Northgate and just what we know we do Citywide. So I just First Watch just want to thank you cuz I know how hard you guys work and we meet with you all the time and you're always always down talking to us about not only 8 homeownership program, but the weatherization program making sure Elders can age in place that home ownership is one of the biggest ways to gain wealth and to pass it on to your children into end to maintain it. But the other issue that came up that I still didn't may be in here. But if you can just briefly and I think you were there Steven you invited me, but do we have have we ever put together as this? Is there a private-public campaign because remember when we were at Mercy Housing in the Allen Foundation gave 30 million dollar For that is that how do we help you go out to these the private sector to say, you know what? I knew you were unhappy about some things. We did you want to help this is how you can help and do we have a do we have a plan for that a public-private partnership insane like we did with the following Foundation? Yes, I'd like to think that we have a plan but I think it's a plan that needs scaling. I think it's a plan that needs to take advantage of our track record and to your example. That's an example where private investment focused on a project. I think we need to find a way to scale private investment and philanthropy the scale against a mission to address our affordability needs throughout the city not at the project level. What do you mean? I'm sorry. I don't understand. I think that when that investment was focused on a project we need to focus investment and scale that investment against the entire issue of affordability not at the project level and I think it's the key is to use our track record of success to to accomplish that so when is the next sample is just to expand on that in the total leverage resources pie, for example, you see the the portion on owner contribution and fundraising and in many cases. There's a lot of our are nonprofits are working hard to get their own philanthropic contributions to support their own building in other jurisdictions. So for example, like in Silicon Valley, they've developed a trust fund in which private donors can provide funding into that trust fund that is then administered by a public entity to put into a range of projects so that the present system is more that the the fundraising and philanthropic support comes at a organizational or building level as opposed to other areas that have done it through the government level. So I'm going to be quick cuz I know count the chairperson here is going to but that's the model that I've been looking at from Cherry my committee when we have friends of the Waterfront. We're raising hundreds of millions of dollars, but I have friends of the library. I cannot tell you what these groups do and we've just fundraising is we need a Fiscal Agent but the point is what I hear from a lot of people with a lot of money is We want to help and we don't want to give it to the city because we don't think you know how to spend it correctly. I'm like, okay, what organization would you give it to? Is there a physical agent? Can you create that and I don't know if it's office of housing or hsd and again I'm a little bit out of my depth here, but I'm going to say it. Anyway, I understanding what I would like to see happen is that we do have we start thinking about the model that you just spoke of that trust fund and if it's always that that does that I mean, please count us in on doing that because we have a lot of people who want to give money to address homelessness. They just have and it rightfully. So I think he'll summer Brian is true. People are angry about what they say. They're upset about the tents there is upset about people not getting services medical and the mental health issues and all the things that we're dealing with and you're right. We can't just build a hundred thousand homes in a year some people get angry and they call her office or why can't you just build more houses? Because the world doesn't work like that. However, I would like to start some kind of initiative and on how we plan that out. If you could get that study to me or that that project I would I would love to work with council member chairperson the scada on how we start just looking at that and if that's a state matching issue if it's a county saying cuz I know I'm going to start looking to the county responds to the homelessness. I think we have to be and I would even call it in Nevada that just seems to make sense cuz we do it in every other field where we want private money, but the people want to give the money to a Fiscal Agent or a PDA or another vehicle. Fine with its own board but works with the city or state organizations and departments to make sure that it gets out there to the quickly. But that's the nice thing about the private sector is it gets out there quickly and we're not caught up in you know, 1900 committees in 1400 public hearings. Not that I'm against public hearings and committees, but I kind of missed a private-sector for that reason just getting stuff done. Thank you very much a picture where I was and I think that the materials that you private provided today help us counter that inaccurate narrative that somehow there's confusion on where the dollars are going that I think you've done really well as identify specifically where the dollars are going the exact type of housing that's being created. The type of workers families retirees students that are able to live in those home where those are all throughout Seattle. I think that we have been constantly asking our other departments including the human services department to help us with exactly this type of data so that we have something to point to in the ideal world. We would have a dashboard of key performance indicators that show not only how we how we are helping folks get into shelter. But how we are then helping them get into housing and without scaling up the amount of dollars that are going into housing. There is no exit from shelters in our shelters remain at capacity. So you all are providing us exit from Stability and the exit from homelessness and exit from shelter. Once we can help scale if your dollars and I think that is also a call to action on our part in a weave senior. Nofa dollars go from 94 million dollars in 2017 to 96. Sorry to 76 million dollars last year in 2018. And at best it looks like this year were talking about potentially being able to anticipate 60 million dollars that is not the trend that is reflective of the need in our community. So we will double down our efforts to make sure that you have both a capital dollars that you need and to your earlier point the ongoing operation and maintenance sellers to make these bum housing efforts successful with that. I have a suggestion for our agenda moving forward O'Brien who had to leave for another meeting things. I'd like to suggest is that we build in the statement of legislative intent report back in our meeting next on the administration of Finance plan cuz there's a nice Nexus there and perhaps we can go to M3 on our agenda to wrap up the office of housing report to us where we have the opportunity to also invite to the table. If you'd like to join us get a free man from the Seattle Central staff who's going to be here with us and Freddy de cuervos. If you could read im3 into the agenda regarding Fort Lawton development plan and related legislation process that be great. Thank you so much. Are you taking off your going to stay here? I come to save your presentation and teens meeting cracks. That's where we will talk about the ANS plan and the statement of legislative intent development plan for briefing and discussion. Welcome Emily Alvarado for the record of housing. Kenny Pittman office in a government relations Council Central staff and if the Lantern House in Christmas gift ever was great. Thank you for being flexible with us as given the excitement around the annual investment report from Office of housing. We want to spend as much time talking about that. Thank you so much keto what you like to walk through any of the staff memo that that has been created by you and Tracy sure. So I'll be pinch-hitting here for Tracy. Who's El today. I'm so you do have in your packets a memo from us at April 15th that by merely highlights some of the process going forward today is an initial briefing by the office of Housing and the office of intergovernmental relations on the Fort Lawton Redevelopment plan a lot of background here, Looking forward to a June 10th. 2019 full Council vote on The Next Step will be of a more Fuller briefing on May 2nd. I'm a discussion of issues on May 16th a public hearing on May 21st at Saint evening public area. And a discussion and possible vote on June 6th in anticipation of a June 10th full Council vote level overview of what to expect in the next coming meetings. Do hope that the viewing public in our Council collies get a chance to join us at the upcoming things that will be on May 2nd and the public discussion on May 21st will be very interesting as well. Would you like to walk us through your presentation? I am really excited to be here to kick off a introduction of our 2018 Fort Lawton Redevelopment plan. This is a tremendous opportunity that has taken over 14 years to get to this point and what I'm going to do really briefly in my few minutes is to walk us through those 14. And then end with a teaser about the vision at Fort Lawton that brings both significant Parks and Recreation space and affordable housing for homeless people low-wage working individuals and families and homeownership to the community in Magnolia. 14 years were going to do it in two slides though that comfortable. So just for orientation. I want to remind us that Fort Lawton is a 34 Acre Site. It is currently owned by the US Army. There is the lease agreement that is leased by the city and it's located in Magnolia and you can see the picture above there. It is adjacent to Discovery Park. It is not in Discovery Park and it is presently occupied primarily by parking lots and buildings as you can see in those photographs in 2005 when this journey began BRAC commission listed this property as Surplus and then in 2006, the city was officially named the local Redevelopment Authority. And that really meant that we were responsible for both creating developing a Redevelopment plan in close coordination with the public and also soliciting and evaluating notices of interest in on this point. I wanted to flag that's the Federal Regulations around the bracket process really emphasize the extent to which we do Outreach and engagement with homeless service providers. It also includes a notice of interest for other public benefits, but he's heavily emphasizing our work around supporting homeless people and so the initial notice of Entry process was helpful to identify homeless service providers who were interested in being part of the partnership at Fort Lawton between 2006 and 2008 there was significant amount of public engagement as part of our inclusive and thorough process there were over 15 public meetings. There was a tour of the site and a BRAC Workshop that included with the homeless assistance provider. And the community-at-large including Magnolia residence based on that engagement in 2008. We drafted and city council adopted the Fort Lawton Redevelopment plan at that time and there was a resolution approved by city council that let us go ahead with the application to federal agencies to acquire these sites as you see in that right hand picture this the plan that we submitted was. In fact approved by the federal government at that time. There was then a lawsuit in Superior in court of appeals which upheld the determination that the city had failed to follow its environmental review as under cepa prior to council adoption of the plan that really paused installed the process because it would require us to then go ahead with cipa and at the same time as you may recall there were significant changes in the economy by virtue of the recession. Really caused us to reassess and reimagine the plan that had been adopted primarily the Reliance on a market-rate housing component, which was the underpinning of a part of that plan. So as you'll see in the refreshed plan or updated plan all of the carryover pieces remain the same about serving homeless household than our partnership with our Community Partners Catholic Housing Services United Indians of all tribes Habitat for Humanity and Parks and Recreation space, but it changes the concept of the market rate housing to produce more affordable housing and more parks and open space. It was in 2017 during this long process that the federal government was getting antsy about how long it was taking our city to move on this make progress on this end. So as by virtue of that we entered into a lease agreement which set some terms and conditions and responsibilities and a timeline for a student move forward and take action and notably as part of that lease agreement. There was a deadline by January 1st 2020, which is now not too far away for the city to have done a series of things including have a plan approved by city council submitting that updated plan to HUD for approval and submitting a request to the Army for Acquisitions of the property. I'm in the process of twin 2017 really building a pond all of the fundamental Community engagement and underpinnings of the plan that were established in 2000. We did some more work on in 2017. We did a complete cepa scoping process and Danny is and finally publishing. The FBI is that included public meetings public comment period and updates to the plans several times based on all of that engagement appeal to the adequacy of the ear is to our hearing examiner and after several months in November of 2018. The hearing examiner determined rfe is to be adequate we've been drafted the plan. The plan is substantially similar to what was included in the FBI is is as required and caring forward much of the components from the original. 2008 plan while adopting it for updated economic conditions and that is the plan that we're excited to work with you on in the next few months and I do have a sense of how many meetings total including focus groups that you have engaged in. I would imagine it's around 2016 to 18 from the 2008 process and then it was at least walk 4 to 5, but this processing So just ending with division at Fort Lawton and we're really excited to move forward. This is a publicly owned land to reimagine it as an affordable and a livable community that creates opportunities for people with low incomes to live in this community in which there is very little affordable housing presently the key components of the plan just reminding folks that over 60% of the acreage would be dedicated to parks and park related uses. Although I'm from the office of housing a significant portion of this plan is about delivering parks and open space the other Special quick question. So unlike unlike Magnuson. We don't we don't own the land the federal government continues to own a weed. Whack process what we'll be doing and asking for public benefit conveniences sober housing for seniors the homeless seniors housing to get 100% discount some of the other housing we get percentage is discount and for the open space to get hundred percent discount. So we playing to like Department of interior and other federal agencies to get discounts or land for free but is the end-game to Own It by the city and then less we work out something with our partners where say like for Catholic Housing Services, we can transfer the land to them or the Habit think it's likely for the homeless housing that it would be city-owned with a long-term lease to The Entity for the workforce housing that's still up for discussion of how it gets transferred and for the Habitat for Humanity homes. Would actually have to be directly transferred to that entity because there will be ownership of the land by low-income homeowners sign so cuz looking it back as soon as I've actually read the deed it Magnuson and what uses and how that got changing had to go through interior and all that. Are we looking at some point in time would we say that the city of Seattle is going to own these these 34 anchors? Will there be conveyed to as far as we will be conveyed to the city when we submit the application is not the Redevelopment but separate application to the agencies and then they have use requirements on them for like say a 30-year. With the exception of the parking Open Spaces in perpetuity. So but the minute they transfer once we submit the public benefit conveyance applications are due the negotiated sale. It's our property Publix benefits of advanced piece. That's when we'll hopefully the city will own it and will continue with those stipulated uses exactly. So the 60% is for parks and park related uses in the remainder includes a range of affordable housing types and uses including a building of Supportive Housing for homeless seniors that includes on-site services on a portion of the property for affordable rental housing for Louis Working Families and individuals at 60% of area median income in below. That's roughly $60,000 for a household of 4 and affordable homeownership opportunities for low-income homeowners through habitat for humanities model, which is Affordable to household up to 80% of area median income roughly $80,000 for a family of four. And we're excited as we move forward to talk with you and both our Community Partners who are really going to help bring this plan into implementation and to discuss more of the details of the plan. Any other questions cuz remember was okay. So again, this was intended to TF a series of conversations that we're going to have in this committee going forward following the years 14 years of process and engagement. The more recent ones that you've had including last year and the year prior. I am very excited that this legislation has been transmitted to our committee. We have as a courtesy to our Council colleagues distributor to binder yesterday that includes all of the materials we've received from the office of Housing and we will look forward to having a conversation going forward about the creation of the variety of affordable housing options again for vets and seniors for first-time home ownership options for affordable rental units. I want to reiterate the preservation of 60% of the land for open space and Parks. We're going to have a deeper dive into this conversation on May 2nd, and I want to flag for We will be joined at the table by the office of housing the parks department the United Indians of all tribes Catholic Housing Services Habitat for Humanity and we'll get an overview there of really what's in the detailed proposal. I will also have a chance. If as if we'd like to add a few things ask some questions see what else we could potentially do within the limitations of the existing he is and we will have a chance to hear more about the legislation at the May 16th and June 16th housing Health Energy and workers rights committee with the intent to have a possible vote on June 6th. I want to remind folks that there is going to be a public Hearing in the evening on March 21st right here in council chambers that will be inviting folks to come in and have a discussion with us then May 21st and 21st. A child care provided at the hearing so want to make this accessible to all of our residents route Seattle and feel free to reach out to our office. Thank you for being the point of contact. You can reach out directly to me or to funny that you can find us on our website and let us know if you need that accommodation and also interpretation. We create an accessible committee qerim see I was required requiring that drives me crazy. But anyway, this is why I got past me when you on the last page when your vision for redevelopment and you list the core components. So what happened with this I know for the Seattle Public Schools, what are we doing with them quickly kind of know because we were involved in it to some degree of being and I was involved because of parks and the athletic play Fields, but How much space is the Public Public Schools partnership? And what is the use of neck? And is that go into the public benefit piece? Yeah, so we are working closely with the Seattle Public Schools My Hope Is that they'll be able to join as well? And the intent there is to Avail the opportunity for them to access it approximately 6 Acres of the site to create two multi-purpose field athletic fields. They would be moving forward likely under an educational to have that that property conveyed to them for the purpose and use of an athletic fields in the event that they choose not to go ahead with that conveyance. Then it would be taken over by our parts department credible audience through Seattle Channel. You can find all of these materials as including the Redevelopment plan and the companion legislation posted to the housing Health Energy and workers rights committee website. I'm so you can access all those materials prior to our upcoming committee meetings and convey our appreciation for all that you do. So please pass that on in your meeting. Thank you. Thank you very much for being here. Okay, let's move onto item number for and as we do that if we could be joined by our friends Dave Westberg Vera mcmillion Jimerson my eater from Central staff as well. You are all welcome to join us at the table as we read into the agenda item number four. Agenda item for castle built one 19499 and ordinance relating to paid sick and safe time extending paid sick and safe time to employees of the Seattle school district for briefing discussion impossible vote. Welcome. Thank you so much for joining us again at the table or really excited that you could be here. Thank you 2609 friends and Dan if you want to start with introductions will just go down the road for reading into the public record your name Council Central staff deputy director. e business manager local 609 Child Nutrition services David Weissberg retiree, thank you all for joining us. And as you know that I got to pull the microphone close. She can move these all around make sure your green buttons on so we can hear you want to get into this legislation. We had the chance to hear from Folks at 6:09 2 weeks ago. Thank you so much and really been engaged in this conversation for over a year. This is something that I thought love was a long-overdue conversation around how we make sure that not only are felons getting access to the letter of the law which is access to paid sick and safe time, but that folks actually have the ability to call on someone if there is a lack of enforcement so that nobody gets retaliated against when they use their sick and save time. So the people know exactly that they have someone on who was helping to monitor the benefits that we work so hard at the state and local levels in women in law and also through benefit Agreements are really excited to have you guys here Do you want me to want to go first as you mention the central staff memo is linked to today's agenda and I'll just briefly walkthrough the content the city is paid sick and safe time law has been in effect for several years. More recently State voters approved initiative 1433 creating Statewide paid sick leave benefits for qualifying employees the city updated its paid sick and safe time law to be fully consistent with the state laws requirements. The state law. I'm sorry. I'm speaking now about the state law in the state law allows municipalities to adopt regulations that exceed the state's requirements and the cities paid sick and safe time law does in several regards include higher level of requirements. Seattle Public Schools is required to provide sick leave benefits that are compliant with a state law. However, Seattle Public Schools is currently exempt from the city's paid sick and safe time law because the cities locks Presley exempts all local governments besides the city of Seattle. In brief the current bill would have the effect of changing the city is paid sick and safe time law such that it affirmatively applies to the Seattle Public Schools staff memo notes that there's a potential Amendment clarifying the intent of the bill and I understand that the sponsor I will speak to her amendment when the time is right. Thank you. So we want to open this up for an opportunity for you all to help firm up the issue that were talking about today as well. Really there were excited to have you at the table haven't had a chance to see you in person yet. So thank you. I think the Dave and Mike's are coming back as well. So we will turn it over to your team to see if the conversation you like to have and then we can talk a little bit more about the legislation. But very high thank you for having me. Like I said, I'm my name is Vera McMillan Jim Morrison in the first thing I would like to talk about is a year ago March. I was diagnosed with stage 4 cancer. I am a survivor. However, I've been with Seattle public schools for 18 years 18 and 11 after running out of my sick leave. I received a phone call that told me that I no longer held my position at my job that I could come back as a Fab and reapply for another open position if one was available. Okay. So at this time, I am truly fighting. I have one more day one more day with my family. I understand that the bus drivers are milk hairier and other people outside the district that deals with our schools in particular. They're covered by this amendment. Why not us we need protection. We need to be protected and I hope that my story is just one of many and I'm so happy that you invited me to come down so I can share my story with me with you guys, but it's not the first but I hope it would be the last of you know, that we have to go through something like this to ask to be protected. There thank you so much for sharing this story and the four elements that you the chair laid out pretty clearly and introduce introductory remarks that we've included in our emails and communication with council members are ones that were generated for us by our outside attorneys outside attorneys by our attorneys. What what's the difference between Weston was what's the difference between 1433 the state program and the cities implemented program that took place last you and her so that's why I asked a question and that's when our attorney came up with these four important elements that we're not expecting to break the bank and we're not expect you to call upon the city to solve very many problems for us. Some of us here we talked about 5 people that I could think of there's one other person but that's about 1% of our members and so is relatively on infrequent and but when it does happen people like Vera need to have someone to call upon so that she doesn't anguish if you were on the other end of that phone call that were made at the end of October when she heard about having to reapply for her position with the needle in your arm, I believe in a port chemotherapy Vera and her niece were screaming and they were anguished and this isn't just on the phone with me. This is you know, when you turn the lights off at night and when you wake up in the morning, this is a constant concern Indira put it really well. She was fighting for one more day and this is about supporting Working Families and having some empathy and sympathy with primary. immigrant primarily women low-income low-wage employees that all work within the city limits of Seattle and for anyone to suggest that they may oppose. It seemed somewhat counterintuitive to those ideals of social justice and economic protection till you're welcome thing else to add. I think that David beer have summed up our position pretty well. Thank you. Thank you for both being here again and for working with us for a very long time to try to bring this forward councilmember herbo. Thank you for being here and you've also been a champion and engage with the folks at 6:09. Is there anything that comes out of Juarez or comfortable that you have asked questions before I talk about the amendment to the legislation? No questions. I appreciate you being here and sharing your story once again, and I'm sorry that you had those experiences for restarting. Your rights as a worker. Wanted to share to adjust. I know that's a personal story that I had cancer three times in the first two times was the whole chemo bald head thing. So I know what that's like and so I emphasize and I understand what you're saying. I want to thank councillor mosquito and you guys were coming here today for sharing what we had gotten some briefing and with dance memo to try to understand the law behind the scene on what's a certified worker was a non-certified worker. So please don't do any of my comments or concerns or questions that I don't understand or I don't care. It's that a lot of times we want to do the right thing with but we also want it to legally be upheld. We want it to be not just a resolution on Origins. We pass thinking it's the right thing knowing that we're going to go to court or going to lose. We we try to have really good laws. Do the right thing that withstand judicial scrutiny and we want to do the right. And so I don't know if you've ever if you don't know if you if you know me. I'm a little bit more conservative about making sure that we do it right. I don't like to just fly by the seat of my pants. I like to do research. I like to look at evidence. I look a little facts. I like to look at the law and then I want to put on my legislative had say, okay, how do I get there? What are the challenges? And what do I need? How do I rewrite something or challenge something or work at the city attorney's office on how we get there and we've done that way if we need some things we win some things we lose but this is really important because this as you as you shared, you know, this comes down to healthcare is comes down to in people's lives. And so, you know, and that's something the lawn doesn't always reflect with lawn and 10th, you know, they're going to have a fight about who's a certified employee and who's not That's what this is going to come down to some degree. And so for me, I'm still in a learning phase reading the information and the leadership of cancer and mosquito has been great. She's been educating all of us and I'm the city attorney's office has as well as Dan given us the memo. So there may be more questions. And so again, thank you. Thank you. We have delved in a little bit into some of the legal challenges that this proposal may result in I think it might be appropriate to talk a little bit about whether or not there are non-legislative options that we could pursue as well. Damn. Could you talk a little bit about those options? Sure. I think one of the options that that has been floated as a possibility would be As an alternative to legislative action changing the city paid sick and safe leave would be in agreement that would be akin to one that the city has previously entered into with a school district for both parties to agree on terms for the city to enforce some Provisions that I guarantee employees of the school district to get access to the sick leave benefits to which they are either legally entitled or are entitled to under their collective bargaining agreement if they are represented employee. So we do this all the time and law sometimes the facts don't fit the law in the intent. So we engage in what we call interlocal agreements. Where I use this analogy a lot when I represented tribes tries to be fighting with counties and cities about who has jurisdiction and I used the line, you know, when there is a polluted water should we get sick? It doesn't really matter who has jurisdiction is got to get fixed in one of the tools that we used in Olympia and we use ammo Statewide and everywhere are interlocal agreements where we know we agree that there's a difference but we agree that the goal is it is it for the greater good and if you can get the Seattle school district and the city of Seattle to agree to some type of interlocal agreement to cover non certified employee for me is a lawyer just in a gannet. What does the stump liminary that's always a safer and better route because then you have discussion and you don't get into collective bargaining other issues rather than passing an ordinance that is it going to be upheld. The way we look at the legal landscape now and that's what my concern is. The council member wise was we need a fix and at this point we've been working on try and identify a fix for over a year. I know that the folks at and 609 I've been working on this for longer than that have someone who's worked on developing public policy for you know, 15 plus years in the halls of Olympia. And here I am absolutely open to continuing to identify various paths to get to our end goal today. I would love for us to consider the amended legislation that we have in front of us always in a willing to continue that my door is always open to have these discussions. But as for me, I think that this piece of legislation offers us a fix especially as amended one of the issues that you've heard so eloquently from the folks at 6:09 is that they have as the law allows at the state level. Down for us to I'm offer benefits greater than the state floor and one of the challenges though is as we've done that and you've mirrored what the city has been actually you've done better in some places. You still aren't being challenged in your ability to access the very leave that you've already negotiated. And if you were working anywhere else within the city of Seattle, you would have the guaranteed right to access and have your your sick and safely protected free from retaliation free from intimidation guaranteed your job back. That's critical and that's actually coming from the health perspective. That's very important for your recovery as well sell for me. I'm I'm really excited about the opportunity to bring forward the amendment that we're going to talk about here in a second. I'm always continue to engage in conversation with you all appreciate that the central staff memo and the creative thinking here and if I might transition into the amendment that were talking about because I think it helps us really identify the workers that work. Looking about 8 before we get there the amended version of this ordinance would apply to are those at the school districts that have to work several jobs in order to afford to live in Seattle and we're glad that many of our members remain in Seattle. We'd like them to be able to and so appreciate your comments as well. I'm going to hand out the draft so that everybody has it great. Looks like everyone has it on this side of the things that have come up in our conversation since the legislation was introduced is the intense and the intent of David said and thank you for putting both of face on this issue both in terms of your description of the policy, but also verra, thank you for helping to come and help us. Remember what we're talking about in terms of the meat of this policy. Thursdays are workers who are cleaning on the yards at the school grounds who are serving food at the school grounds who are our non-certified staff, and we wanted to put this legislation amendment in front of you to really clarify that it was the intent to focus this legislation on our non-certified staff any questions about the amendment. Okay. So before we consider the actual legislation, I'd like to go ahead and move to a men Council Bill 119 499 any other comments they loved it good for nine nine that I opposed great. So the amended bill is now in front of us. Are there any other comments about the bill before we moved to I'm consider the bill as amended. Okay, so I'd like to move that the committee recommend passage of amended Council Bill one 19499 All those in favor say aye great. Thank you. So I got the approval votes to move out of the committee vote of two guys and one abstention. Thank you so much for the explanation earlier, Remember where I'd appreciate that and we are very excited to be able to say that this is moved out of this committee. Really appreciate working with you Vera. Thank you so very much for coming forward. Yes and will continue to stay in touch with you as we talked about next steps because this issue is not going away. And as you said you want to be the last story not just Astorian in the long history of this issue needing to be addressed. Thank you Mike. Thank you, very Okay, and I'm sorry. Thank you very much Dan. Thanks for meeting agenda r v item of business and while you're doing that thanks for joining us at the table with agenda item 5 resolution 31879 a resolution supporting a safe and responsive and responsive workplace in the city of Seattle's legislative department for briefing discussion impossible Fallout. Thank you handsome arrest for being her for that last item will come to the table Lisa. Thanks for joining with us. You want to read your name into the record just for formality for release of the council Central staff? Excellent. Thank you. So we are on our last item of the agenda and more as you and I have had a chance to talk about the issue of safe workplaces a prevention from harassment and intimidation let alone assault rrd need and desire to make sure that we are not only preventing people from ever being in that situation. But also changing what it means to have appropriate or inappropriate behavior in the workplace. We've heard stories time and time again from Silence Breakers and Frontline staff. It was in the city across the city about dangerous for Clear his situation as situation for inappropriate comments were made and sometimes those inappropriate comments don't rise to the level of being illegal and that is often meant that in action. Has happened then as our culture of continues to evolve as our understanding and our intolerance of inappropriate behavior becomes in terms of norms across this country. And in the city Wilson want to be responsive as employers. I've been really excited to be part of the interdepartmental task force across the city that has looked at Citywide policy changes that are needed to implement safer workplaces. And as we treat the office of the employee on bud as we create the independent Human Resources investigation unit. One of these things that is really stood out as the need to make sure that the folks were working right here in the legislative legislative branch separate from the executive branch that we also have the chance to look internal to our Personnel policies to make sure that not only are they helping to prevent retaliation intimidation harassment, but that we're doing a better job of the Finding what type of behaviors were talking about in today's day and age and that our Personnel policies are truly reflect of our expectations and Norms here at the city. This is also a test subject. So I understand you know that especially with the some of the news that came out yesterday. This may be a triggering topic for some of our community members and I think, more than the entire Council have expressed that we are standing with those who are survivors folks who had me to experiences and I just want to say that for anybody who was triggered by both this conversation or the news yesterday of unsafe or toxic workplaces were processing their own experiences. We stand with you. We also are continuing to work to make sure that our city especially those who work for City. Everyone has a respectful and safe workplace and not only will we do that for city workers will continue to do that for our partners across the city so that this is a great place to work. Time to be able to start your career and your career have kiddos here or retire here. We want this to be a great place to to to be both in our city and specifically here in the legislative Department the legislation in front of us some processes that we went through with that are legislative Partners went through last year where they identified a task force to come up with recommendations to change their policies and Norms expectations documents at the state legislature. I believe it was represented Nicole macri through House Bill 4401 that was able to celebrate the implementation of the recommendations this year after year as Longworth of process that they went through and you know how we had the foresight to both do that and I d t maybe we could have done it all the same time, but I think it was really important that we did the IDT first and then we can pull from some of those suggestions as we look at our internet. I just let him department. So I will stop there because I'm really passionate about this. I also before I turned over to Lisa and I also want to say thank you to the folks who are on the front line. We send out a draft of this legislation over two weeks ago and asked folks from the Departments that are represented within the legislative branch it to give us feedback on what they saw and a number of individuals Frontline staff a middle manager is getting came back to us and said we'd love to see X Y and Z reflected in your legislation. We did our best to incorporate as much of the feedback as we received. And so this is really already a collaborative process that we put together to give us the foundation for coming together and creating a task force to change our Personnel policies right here in the legislative Department legislation, and then send. Try to keep this relatively brief. Ocean 31879 has three sections in it. So section one will describe the city council's expectations with respect to the behavior of each member of the legislative department and that includes employees elected and appointed officials and contractors to the Department. Section 2 Then goes on to state that members of the legislative Department should be treated with respect and not subjected to inappropriate or offensive language and expresses the council's commitment to protecting legislative Department employees from unlawful harassment by members of the public. Finally done Section 3 creates an internal Department working group. That would be facilitated by a neutral third party to review policies are existing policies pertaining to workplace expectations and how that review done by September 1st of 2019. That working group would be would be sort of balance between the management and staff. So you have representatives from both groups and would also have a representative from the council president's office ally department and the office of the auditor hearing examiner and Inspector General are invited to join. Of course, the Law Department would be giving legal review to any amendments that would be proposed policies. And then the the working group would invite the legislative Department recent social justice initiative change team to review any proposed revisions to make sure that you had a full perspective on that. That's the substance of the resolution councilmember. Excellent. Thank you any questions from you or any comments. Thank you so much, So what are the things that we've been talking about a lot here in the last few weeks has been the situation that you know any of our staff and I think that's his council members have been experiencing which is those threats of physical violence and sexual violence. This is I think legislation intended to create a safer workplace internal to the department but also set some expectations for those who are engaging with our department, especially our staff and no one especially our colleagues. I'm should be on the receiving end of that type of violence and I think that this is not only an important element for in in terms of expectations of electives because we've also heard repeated stories from the state to the National level of inappropriate behavior that we want to both prevent and address in terms of elected but also for protecting our staff and protecting electeds and want to make sure that we're never in that situation where that Permitted Behavior throughout it is the city of Seattle's legislative department and then on page 2 when we talked about Beatriz all the city council, we conduct ourselves. And then when you triggered for me is when you talked about not only how we behave here on the legislative branch with our colleagues and people we work with but when the public comes in and then you brought up the external forces that we deal with and of course everybody has seen some of the things that we have been subjected to in the three over three years that I have been here. I have been and subjected to some of the most vile and sexist and racist names. I've had death threats. I've had people post stuff in my yard. I've had people come here. Call us horrible names and do horrible things and I am of the harassment discrimination. We talked about bullying and that's that is not a First Amendment, right? And I just want to make it clear that you know getting back to what councilmember Moscato is saying and what we all hope is that this is a public space and it should be safe. Everyone should feel safe coming here. One of the concerns I have and I want to thank our security folks is that before the cameras come on their members of the public that harass our clerks on a continual basis and when the cameras are off, they sometimes continue to do that and I am kind of sad and that we have to pass a resolution to tell people how to behave I just be kind just to have civil discourse. And I don't know how we got here. I'll have an idea actually, but that's neither here nor there right now. But the resolution of help is a step in the right direction and not just a paper tiger that we really are resolved because we're now admitting that there is a problem. It has escalated Beyond people just disagreeing with us is escalated where we've had to have SPD come to our homes and make sure that we're safe. And quite frankly. I just don't think that that can continue and my fear is that it will escalate. And I hope that the public sees that I'm hoping that we are trying to set an example where we want to hear what people have to say, but that there are rules in a public space and I don't think you should have to have a rule that says Be Kind be respectful don't bully don't harass don't threaten don't give deathreats. I mean my God is just common decency, but I want to thank you for putting this together because now we're having an honest conversation that these issues are happening and now we have something to work from someone and thank you for your leadership on this armchair chairperson mosquito. Thank you very much against us within the last few weeks having seen our staff who are on the receiving end of many of the calls and emails and also recognizing that internal to our departments. We also want to set All of expectations that while we won't tolerate for that from outside. We also won't tolerate it from inside. I think this is a good holistic approach to updating our policies to ensure that we both are protected and safe in our places, and that people know that when they come here, they will be protected and safe, and that includes folks who wanted to come testify or wanting to come work here very very honored to work on this with you and if there aren't any more questions, or perhaps we should hear this going forward. Thank you. Thank you, so I would like to move I would like to move that the committee recommends passage of resolution 31879 a resolution supporting a safe and responsive workplace in the city at the city of Seattle legislative Department. Great. Thank you very much, The resolution 31879 has passed. I voted this committee. We will bring this a resolution to full Council on April 22nd for a full committee. Vote. Again. Thanks for the front line staff on to Lisa for your work on this and to the state legislature as well for initiating process so that we could also follow in due order has been going on for a long time. I really want to thank this Seattle women's commission the Northwest women's political caucus all the women organizations that have come forward with their own resolutions and letters of support to say that this is not okay. You cannot Target people on their gender and their race that is not okay. So if they're listening, I just want to thank then there's a really good people that's reached out. Cassidy been supportive Jazz and thank you to the individuals who also came to testify in the last few weeks walk in the park. And this is tough work that we do and we expect to be held accountable but we don't expect to be put in danger or to be assaulted and neither do our staff and neither should anybody who works in the legislative differ between three and six hundred phone calls and texts a day and I'd say for about 3 weeks we heard and saw and read it had to turn over to SPG some of the most violence. Sexist misogynistic racist things you've ever seen and I I think it's sad that for news outlets asked for the information and only one person wrote about it. And I was Erika Barnette were these other organizations all got the same material, but apparently that's not news. So we are no longer without your hard work to get us this resolution. Thank you for all of your research and for working with our office. Thanks to sejal free car chief of staff for her ongoing work on this but I want to thank you for your ongoing work interdepartmental task force and for your help to set up the office of the oil Co office of employee on all of these issues are going to make a huge difference. So I think's for the work that you do is win Kishore security folks. You're always so good to us for taking care of us. I really appreciate that. You always check in with us. You always ask how we're doing. You've escorted me to my car and I really want you to know. You guys have been good to us, and I appreciate it. Thank you. Please pass it on to your colleagues. Okay. I wish I think we are at the end of our gender. Are there any other items for the good of the order ready? We'll do the labor standards advisory committee appointments to Seattle City Light review panel appointment the office of a reminder we send out some we asked for folks to give us draft questions by Friday. I think at 10 a.m. Tomorrow. We have some questions that will be sending around for folks to add to if you want to take a look at what we have so far but a half-dozen she could get a few back by 10 a.m. Tomorrow Friday. We will send that off to eye doctor Khan and she will get back to us with her answers that we will circulate back to you all before May 2nd will still have the hotel workers industry folks will be coming forward to share their perspective on our ongoing work to create Hotel worker safety and we will have the Fort Lawton land use full briefing. Pact agendas going forward. Thanks in advance for your time. Thanks so much for all your work. Appreciate it. The meeting is adjourned.", "end_time": 7254.9}]}