{"format": "raw", "annotations": [], "confidence": 0.8989437910226675, "data": [{"start_time": 0, "text": "Sally's okay, here we go. Good afternoon. Thank you for being here in City Hall the July 29th, 2019 city council meeting of the full city council will come to order 2:00 p.m. Bruce Harrell Fresno the council the clerk. Please call the roll. President Harold a present in today's introduction and referral calendar will be adopted. You know Jackson the introduction of pro calendar is adopted in. Seminole, if there's no objection today's agenda will be adopted in objection. Today's agenda is adopted the minutes of the July 22nd 2019 city council meeting have been reviewed and there's no objective Ministry sign. I hear no checks in the minister being signed. Presentations I do not believe we have any presentations today, which will lead us into public comment and this time we'll take all the comment on items that appear on today's agenda or introduction for a calendar or work program and I do not believe we have any people sign up for public comments afternoon. So we'll close the public comment section and I'll ask her to move to the first agenda item, which is a payment of the bills and please read it into the record 58067 claim for the week of July 15th, 2019 through July 19th, 2019 in ordering the payment thereof Budapest Capital One 19586 to move to Second the bill pass any comments. That please call the roll on the passage of the bill Eaton favorite unopposed. Please read the number one one cancel both went to 19583 Lillian to her patients for the office of arts and culture and then he born in 2574 which adopted the 2018 budget and lifting improviser and post on the Arts office of arts and culture is the cultural space budget control level by Seattle City council Greensheet to 5 ft 1 2019 committee recommends a bill pass Herbalife Reserve this room for an hour or so. You can make this last for a long time. I shall I can't remember her both. Thank you, but I'm going to try and show some leadership their Council Bill 1195 83 is accountable to lift a Proviso on $150,000 in funding for Town Hall Renovations approved in the 2019 budget the funds added in the 2019 budget require a public benefit to accompany them. And so we've used the time since the the passage and enactment of the 2019 budget and today to have a negotiation with Town Hall on what that public benefit is. And the agreement was to focus their the public benefit on race and equity for community-based organizations. And as a result Town Hall will provide up to 50 hours per year of free use of their one of their rooms that you can you can book in a make available for events called the reading room. And it will be provided to 501 c 3 S other community-based organizations and Community groups as well as access by City departments for program related to race and equity. And as I mentioned earlier this morning there have been previous allocations to town hall 4 cost associated with their Renovations and there was a different set of public benefits negotiated for that dispersement of funds. I think very much any questions or comments on this bill. If not, please call the roll on the passage of the bill president Harold Payton favorite not opposed. Okay, if not, we stand adjourned and it won't have a great rest of the afternoon.", "end_time": 297.0}]}