{"format": "raw", "annotations": [], "confidence": 0.9359543748604234, "data": [{"start_time": 0, "text": "I'm calling the elected leaders group meeting to order this morning. I want to welcome everyone to the final elected leadership group for Sound Transit Westfield to Ballard Link light rail extension project. I'm Joe McDermott King County council member and remember the Sound Transit board. I coach her that this group with my colleague council member Michael Brian. I'm from the city of Seattle this group includes. This is the same script. You've heard me sure before I'm Selective Sound Transit board members members of the Seattle City council commissioner from the Port of Seattle and has a special meeting of the city of Seattle's sustainability and transportation committee over the last year we've gone through three levels of screen and if learned a great deal about the corridor alignment station location Alternatives and the communities interests and priorities the community engagement has been robust understand key issues and some promising ideas. And this is just the beginning of the conversation started during this process will continue through the draft Environmental. Impact statement in the station planning continues I'm going public input is essential to getting this right? I want to acknowledge that the screen process hasn't been easy projects like this never are we're trying to thread a needle through a built environment and beloved communities some of the conversations been hard on Residence Inn on business owners who want to understand what this means for them and I want to thank them for staying engaged providing feedback and bringing solutions to the table. I also want to offer some other thank yous to the stakeholder Advisory Group these dedicated volunteers to put an incredible amount of time and brainpower into this project. They've served their Community is in this process. Well, they trying to balance neighborhood interest with technical information on any members of the SAG who were present. Thank you very much for all of your labors and also to the Sound Transit staff. Do you guys ever sleep? I believe it because what because whether it was early morning meetings as recently as this morning or late night on emails and Community meetings. I don't know when you get the analysis and the project work that has been silver best done in between. Thank you. I'd also like to thank my colleagues around the table here as I look forward to our conversation today. And as we prepared to discuss which options would like to see studied further. I thought I'd remind us about our role in this process in addition to appointing members of the stakeholder Advisory Group. We've been asked to represent the communities we serve and share Community priorities consider the needs of the project within the context of the greater regional transit system work with project staff to understand and evaluate trade offs and make recommendations to the Sound Transit board. That's no small task. They know we're up to the job. Look forward to this work with you and I turned over and introduce my coach Eric Michael Brian. Thank you so much Joe. Thank you everyone for being here today. I want to take a moment to welcome my colleague city council member Debora Juarez. Thank you for being here today. She's your days away from everything the city of Seattle on the Sound Transit board. So I appreciate you being here today. Today's meeting is Joe side is a combination of a lot of work. It's been 17 months since we convened. It seems like just yesterday that we started it does a lot of great opportunities that are in front of us and also challenge we face in we look at this project Corridor and want to highlight the war of the racial Equity tool kit, which is help highlight stationary is that will be discussing today as key areas to dedicate enhanced engagement and Analysis efforts. This has been a great joint effort between Sound Transit and the city of Seattle which will lay the groundwork for future engagement and Analysis in these critical areas. Building light rail in our Denson dynamic city brings many exciting opportunities to address Mobility challenges, but these opportunities are not without near and long-term impacts. Do you like to leadership group has sought to determine how to maximize what promises to be exciting Light Rail investments in our communities Mobility housing community and Civic development will also maintaining Community character in the Deep cultural and historical character of the neighborhoods that this rail line will serve I think everyone I want to thank everyone for the engagement analysis that is shaped the project to this point, but also acknowledges a lot more work to do so many possibilities to explore to make this project one that will truly transform our city will maintaining the assets that we love about a community's first and foremost the people in our communities. Thank you so much for the community members who participated will get the public, in a moment. But first I want to turn over to Peter rogoff to say a few words. Thank you. Mr. Chairman. I too also want to thank the co-chair is mr. McDermott. Mr. O'Brien for all of the work that they put in. I also also want to welcome everyone to the final meeting of the EOG for the West Seattle Ballard project field will call the back in 2015 and 2016. When Sound Transit engage the region on what projects they wanted to include in the st3 plan. There was a resounding outcry to deliver project several years sooner. This continues to be probably the most frequent thing we hear as feedback. Please build it faster. So back in 2016 after the ballot measure passed we developed a system expansion implementation plan that Maps out a way we could realistically shave three to five years off the delivery of these projects and the key to that plan was for delivering project sooner was to do business differently and partner with the community and municipalities differently the establishment of the stakeholder Advisory Group and the elected leadership groups was at the very center of that plan and I'm pleased to say that the concept is working very well across the region are elected leadership groups for the I-405 bus Rapid Transit project traveling through Snohomish East King and South King County has already issued a single recommendation to the Sound Transit board. Arielle G. For the 522 bus Rapid Transit project through Seattle Lake Forest Park Kenmore Bothell in Woodinville has also done the same. Are elected leadership group for a light rail extension from Federal Way to Fife and on Tacoma as well along the way to recommending a preferred alternative to the Sound Transit board despite. The many complications presented by running light rail in proximity to tribal lands and sensitive waterways. And today. We look forward to receiving your recommendations to the Sound Transit board for the West Seattle Ballard project so we can deploy these projects and all the projects in the st3 plan in a timely way that fits within sound transit's fiscally constrained financial plan. Our partnership with the city of Seattle on this project really has been tremendous. We are very grateful for the collective work of a great many citistaff across a great many departments. Thank you for acknowledging the hard work of the Sound Transit staff was work with them side-by-side. These many efforts are all rooted in the partnering agreement reached between Sound Transit in the city as adopted by The Sound Transit board and the Seattle City council back in December 2017. We look forward to our continued work together executing. The many tasks called for by Department in agreement until we can all celebrate the opening of this new rail line. A collective effort the commuter engagement around the project have also been tremendous over the last year-and-a-half. The project team has really has really done it all with 17 open houses forums Community workshops nearly 190 separate Community briefings table 226 fairs and festivals process more than 5,600 comments and questions from the public. It held three extensive online open houses and send 25 email updates to an ever-growing list of subscribers. As you know, there were fourteen separate stakeholder Advisory Group meetings, and now we're in our seventh and last elected leadership group meeting. The team has engage the community in the stakeholder Advisory Group by clearly presenting the trade-offs for various alignments and station locations as a result the stakeholder Advisory Group, which two significant sets of recommendations to you the LG one preferred alternative that would require a third-party funding and one that would be cause compatible with the project that was presented to the voters in the st3 plan. Blg along with the stakeholder Advisory Group has committed a tremendous number of hours to this work. So please know that we're incredibly grateful for your engagement and your guidance. I hope you will accept my thanks on behalf of Redmond mayor and Sound Transit board chair John marchioni as well as are to board vice-chairs University Place. Mayor Kenneth, Keele and Everett city councilman Paul Roberts. They along with the rest of the boys look forward to receiving your recommendations to help their inform their actions. And may the only thing I would just add to amplify what Joe McDermott said these decisions are hard. But I hope people were will keep in context what is being recommended today. These are recommendations to the Sound Transit board with the sound transit board won't be deciding what project we will build. It will be deciding what projects to put into the environmental process what alignment in alternatives to be studied over the next 3 years including preferred alternative so we can try and move those studies along in a in an expedited fashion so we can get the shovels in the ground sooner in the project to the public sooner, but we're not choosing the project to be built either today or even in May or choosing the alternatives to be studied. Thanks very much. Thanks so much Peter. So we're going to jump in with public comment. We have about 15 people signed up today 16 people signed up today and have a full agenda. So I set the clock at 92nd. So folks love a man and a half. Each to comment will call name Suite A time. You can come up when it's your turn. Kevin Freitas is first followed by David. Sorry Dale mulch offer and then Mark Johnson. What's are Kevin 1 second, the hit the button there a light on. All right. Thank you my family and my neighborhood support Light Rail in West Seattle if it's brought underground in a tunnel, my name is Seattle residents at 36th and Edmonds. So right near the affected area teen years and saw the Link light rail their belts for the extension of the Sounder rail built through downtown. And when I moved to West Seattle or when I move to Seattle, I live in Columbia City about three blocks from the Light Rail station there in the daily. I'm telling you the West Seattle. I voted against st3. That's not because I don't like Transit light-rail. It's because I recognize what I consider table scraps and in my opinion the that's elevated Light Rail in my Seattle of any kind, you know in Tacoma win any project came to you know, what your neighborhood or to the city We really had to fight and we really had to try to ask for just more than those Bare Bones and that's what I'm doing here today as we learn to speak up just to set a better stage for developing that community and I'm really just here to do the same and ask the same for West Seattle. I provided photos for everyone that I went along the entire light rail line to snap. Just going to get a sense of the human scale of what elevated rail really means, and one of my biggest concerns is that the elevated rail is it currently exists anywhere along the line he is not in the neighborhood, and it's going to be right in the heart of West Seattle. So, please keep that in consideration as you've already really appreciate all you're working and time. Thanks. Cardell does a button on the face that is push that the green light to come on a show for the stakeholders Advisory Group recommend Co recommended to options for the Ballard station in the context of third-party funding needed to be secured. One of those is the blue line tunneled to 15th. The other is something that came out of scoping comments from me for a station at 20th and Market. I would like to make sure you understand. This is not the same option is what was rejected in level 1. This is a different route. It has a shorter tunnel than what the blue line would have sew-in ought to be cost-competitive and it gets to the heart of the Urban Village. Should have a greatly higher ridership. Also, I personally walked around to the neighborhood 120 flyers and I can tell you the business owners in Ballard. Definitely prefer the station at 20th over one at 15th. And I also kind all of the lights for pedestrian use and I can tell you it takes 2 and 1/2 minutes just to get across 15th from a station at at May 14th to think sale Mark you're going to be followed by Dennis Noland then John Houlihan and then Lisa Coon. Good morning, Mark Johnson have an architect on the Seattle design commission here sharing some comments from the commission today. Thanks for having me a variety of station options and alignments meet you guys for the CID including a Fourth Avenue Viaduct replacement precluding viable options with Outrigger lessons, the public process lessening the public process will hobble this once-in-a-lifetime Civic opportunity the is it fully about evaluate the implications of converting Union Station and the adjacent public around that we have here. I'm into a multi-modal Transit Hub and the effects it has on the Pioneer Square and Chinatown communities in a transparent and substantive public should begin right away. I mean, it's part of today's conclusion to inform the visual impacts of elevated guideway Sensations as we heard earlier engineering preferred Concepts aren't quite enough bringing the community under that conversation is is quite important. So let's joint government structure that's being built. Be empowered to Advanced transit-oriented development while Sound Transit the city the county and various PDF have individual expertise. They should band together to create success 48 in the Chinatown International District Denver, LA and DC created similar Partnerships for their Union stations. We can create joint governance here for our Union Station. Thanks Mark Dennis. Good morning. Today is the EOG members will recommend the Sound Transit board routing alternatives for study and the Eis as a homeowner in the Youngstown North Delridge neighborhood. I respectfully request you recommend for inclusion in the is both the pigeon Ridge Tunnel route and the Andover ganci Avalon route. These two routes Mary additional in-depth study during the is both routings over at the needless destruction of our Youngstown community and Holmes. Highlights of the pigeon Ridge Tunnel for out with the the guideway would be next to and not to wear Youngstown neighborhood. It would also save homes on Pigeon Point and eliminate the writing difficulties are parallel in the west Seattle freeway construction impacts on Delridge Way businesses. The Light Rail station would be in their most preferred location in an East-West configuration straddling Delridge way at Southwest Genesee highlights of the end of the answer Avalon route this route as a potential for the most significant cost savings that would allow sound transit to stay on budget combining two stations into one with a Transit Hub beneath adjacent to the station. This is an open undeveloped areas current uses three large street-level parking lots, please and courage the members of Sound Transit board to place these to write an alternative to the IRS for additional study R&R Youngstown neighborhood is an example of a professor at once. We'd like to see it saved. Thank you for your thoughtful consideration. Thank you Dennis, John. Good morning. John Houlihan Houlihan law. Thank you for the opportunity to provide public, today. I'm here on behalf of two of my clients. One is Centerpoint properties trust and the other is Coastal transportation. Centerpoint properties trust is a large National industrial Reit. They own three significant terminal warehouses at the West Seattle Bridge adjacent to Terminal 5. We've submitted multiple comment letters in the scoping process as well as a public comment. I'm here just to reiterate that. I for Centerpointe property their tenants which are in the freight and a marine trade industries that we would support a south crossing of the duwamish river and specifically request that the north crossing which is not supported by the stakeholders group or the Port of Seattle be eliminated from further consideration in the ER is the north crossing would have a large. Putting land in mediately and the Centerpoint properties and essentially eliminate those operations Coastal transportation is one of the last intercoastal shipping operations that serve it Alaska Aleutian Islands are located at the Ballard bridge on the South side at the foot we would request and have made comment that Ballard Crossing include the tunnel options including the most recent 20th Street Station and tunnel option of 14th Street high level bridge will essentially bisector property and cause them to be relocated out of Seattle. Thank you for the opportunity today. He John at least you're next and I'm following Lisa will be a Alexandra men Michael Winkler 10, and so he's already Patty. I am Lisa Kuhn. I'm addressing the orange line going into West Seattle the elevated line. My first question is who Outside The Sound Transit Echo chamber isn't favor of the Orange Line plowing through West Seattle. My second question is is this being done for the people or to the people and I have an analogy about the elevated line being presented in January. It's like having a desire for this wonderful tattoo and you wanted on your arm and it's going to be really glorious and it go to the tattoo artist and the tattoo artist lock the door behind you and says guess what I'm putting it across your face and there's nothing you can do about it. And the question is do you think that the person who's getting that tattoo is going to be happy with that. Do you think they are not going to be very upset? So, you know This is I guess all I have to say to you at the moment. Lisa Lisa Alex Zia Kyle my dirty free computer or not. You got to beat your ass from Animal Farm a criminal up on GTA killer. My agenda right now talk about Equity. I totally confused about what is this mean? I know 50 percentage people from three to four million again soundtrack again soundtrack for The Many you're here and never see one who represents is 50 percentage is the number one Party City with no to get stop a principal and I'll give you an example of who you are. You're not only freaking nuts are Fascist. You are mentally six Psychopaths. That's exactly who you are Consul Gonzalez Constitution a crime five times. Open public meeting. 5 * 5 * no one in court recognizes and punish care No One console. No one picture out go out to be a late law 5 * Court recognizes. No one talked out OCT Seattle number one Fashion City with not so you stop a principal in my nose is so right now I speak to everybody stand up American stand-up, Seattle. I'm so Michael is going to be next followed by Savita and then Kathleen Johnson. Good morning. Michael Winkler chain with the Seattle Chinatown International District preservation development Authority. Skip town established by the city of Seattle in the community in 1975 to work for the conservation and renewal of the unique and cultural the unique cultural and ethnic Integrity is characteristic of our neighborhood at this time. Skip to a sound transit to carry all of the level three Alternatives into the draft Eis process. Let the process do its job Sound Transit staff have done an excellent Community engagement process to this point. They've met with and heard from the range of stakeholders in the Chinatown ID and they've done their job and we'd like to thank them because we know it's not easy that's uleta and carrying the fact that we can't narrow down. The alternative is not a reflection of them of them doing a bad job. They have heard with a community wants as goals and outcomes, but there is no concern. Susannah preferred alternative at this time. We ask sound transit to design with the intention of meeting goals and finding cost-saving opportunities to make a better project that he is process will give the community and you the information we need to have the conversations about a preferred alternative in 3rd party funding after the draft Eis state. So let the process do its job, please carry all level three alternatives for word into the draft Eis. Thank you. My name is a board member of the wing Luke and I am also a member of the stakeholder Advisory Group. Thank you again to the Sound Transit staff for all your hard work these past this past year-and-a-half. I ask that you carry all the level three alternatives for word into the draft Eis. That's the purpose of the IRS and especially for the Chinatown International District. This neighborhood has traditionally been left out of decision-making for infrastructure projects. Sound transit's own racial Equity toolkit report reads. The CID is the only station area with a concentration of communities of color based on evaluation results and Community feedback. It's unclear, which Alternatives would pose the greatest net benefits and continued meaningful engagement with the community building on the foundation of centering race and low-income communities during the Alternatives development phase will the important to continue to understand the potential benefit and burden of the options that are being studied in the is it works on climate change issues for over 20 years since 2010. I've been the development director of climate Solutions. I should be the first person here advocating for faster and cheaper public transit projects to reduce carbon emissions. However, you cannot do good environmental work or climate action without an equity framework and addressing the issues for the neighborhood. Please study all the Alternatives in the IRS process. Thank you. Thank you for the offer. I am Kathleen Johnson. I'm from historic South downtown. Thank you for allowing me to speak to the elected leadership group today and thank you to sound transit staff for their efforts and working with Chinatown International District in the Pioneer Square communities as my colleagues have already testified. There are many unanswered questions and important details at our community Sound Transit and our elected leaders need to answer before we pick a preferred alternative alignment. We are asking that sound transit Advanced all of the level 3 options in the Cid in Pioneer Square neighborhood and use the Eis process to focus our choices. We recognize the budget is a significant concern and we wish to see the Ws blet unleash its creative engineering potential to meet more of the neighborhood clearly articulated prepped priorities within the funding available and Define more clearly where and what level of third-party funding would be needed, but it's too early to make these important decisions now and we ask that sound transit usually is process to sharpen a pencil. And to do their good work. Thank you again. And then Lisa Howard and something Blanton. Good morning members of the elected leadership group. My name is Mike Stewart. I am the executive director of the Ballard Eliason first. Thank you for the opportunity to serve on the stakeholder Advisory Group. I'd also like to thank Sound Transit for conducting really very thorough and substitute my engagement process on behalf of my Ballard colleagues who served on the stakeholder Advisory Group the north Seattle industrial Association and hundreds of businesses and thousands of residents that we represent. I'd like to restate our recommendations made to the SAG Ballard is Unified in its approach and encourages you to carry forward two options for studying the E is the first option is an alignment. It would terminate at 20th Avenue Northwest just north of Market Street will be LG has reviewed this same station location earlier in the process is a different route. This route lines further east 300 via voice Fisherman's Terminal and includes a shorter tunnel and ship canal crossing crossing in the previous version III Bears mentioning that this option Wishing through the recent he is coping process and clearly demonstrates the value of seeking Community input additionally this station locations at the core of the Hub, Urban Village and would serve the density and Ballard that is already there delivers on the promise of providing additional Transit service to a community that has agreed to accept the impacts of additional residential density II recommended options to Blue alignment terminating at 15th Northwest because of cost projections are the same we would suggest it the 14th Avenue Northwest tunnel be removed for that reason Thank you, Lisa. Thank you to the LG today for letting us have the opportunity to share our thoughts. My name is Lisa Howard. I'm the executive director of The Alliance for Pioneer Square are organizational mission is to help preserve. What makes Pioneer Square the most authentic engaging and dynamic neighborhood in Seattle. We represent over 800 businesses in a cross represent a representation of stakeholders in the district. They Lions has represented the Pioneer Square district for almost 10 years and all things transportation from the impacts of the Alaskan Way Viaduct Seawall First Hill streetcar Colman dock 1st Avenue utility work and all other public and private projects that impact our streets and sidewalks on a daily basis. We strive to be a voice for the neighborhood a share of information a flagger of issues and a partner with integrity and this process we have had to submit our comments and car insurance from the outside as we were excluded from the SAG. We have indicated this and are scoping letter to CEO. Transit I'm here today to ask for a seat at this table from this point forward and up the Pioneer Square neighborhood not be forgotten or excluded regarding your decision that you will be making soon the level three Alternatives being considered by your committee today or absent of any meaningful input from Pioneer Square, and we are aligned with our Chinatown International District neighbors. We ask that you carry all of the level 3 alternatives for word in the draft Eis, and it worked to identify the preferred alternative after more information has been developed and presented to the draft Eis. Thank you. Mister glanton, you'll be followed by Jordan Warrior than Amy Reardon and Ty Aurelius Good morning. My name is Barry Blanton and I apologize for the cryptic writings. I get that alot. I'm the chair of the Chinatown International District Bia. I'm also the coach are the alliance for Pioneer Square. So I'm wearing a couple of different hats today. And I'm also on the Ballard Alliance. So it's all of those things really consider all of her options relative location in the approach to the new St. St3 station located in Chinatown International District and carry them forward into the Eis process is important to Chinatown International District Pioneer Square, the stadium district and the Waterfront which means the future Ferry Terminal and includes the new cruise ship terminal in so it's going to serve all of these neighborhood stakeholders of the next 100 years. And would be in a roll very integral part of the most important Transportation Hub in the region for those reasons. It's important that we get this right and I understand it by asking to take this into the yes it take more time and resources, but I honestly think it's worth the time the resources that we get this right, so I appreciate everybody's attention and everybody's thought to this. Thank you. Thank you, very Jordan thank you. My name is Jordan Royer and I with the Pacific Merchant shipping Association. We represent container Shipping Lines and Marine Terminal operators the Cubs that serve the West Coast. I'm here to like everyone else or just throw a study of all the Alternatives. We have some really a big concerns obviously about the North Spokane alternative because of the construction impact another what we think unmitigated Bowl issues with that alignment, of course, you know, your study will show was going to show but I would just urge you to consider that given at the Port is investing in Terminal 5 as is SSA and other invest private investors the competition for this cargo on the west coast is very Fierce right now. Canada is expanding their capacity and they're trying to take the discretionary cargo from us and they've been very successful in doing that in recent years the Northwest Seaport Alliance was for Specifically to compete better with Canada and with California ports also the widening of the Panama Canal has added more to the competition because the larger ships that are building now I can get through that Panama Canal now, so I told you to take all that into account because we don't want to lose our Competitive Edge because it would hurt all of the exporters in Washington state and was obviously we don't want to lose those good paying family wage jobs. Thank you followed by a by Ty Aurelius and the Nega Murphy's the last person sign. Good morning, everyone and thank you for the opportunity to comment. My name is Amy Reardon. I'm a mother of two former journalist. And now it Communications manager long-time resident West Seattle prior to live in West Seattle Beacon Hill. In fact, we purchased our first home specifically because of its proximity to light rail. We were happy to vote for Trent Sound Transit extension to West Seattle and looked forward to the day when we or are grown children could take the train downtown on a weekend or to work we were devastated when we realized in February after following the design process. We thought carefully but suddenly there was a new line virtually out of nowhere that would have been obliterate the Eastern flank of the junction neighborhood and take the heart of West Seattle with it. We spent the past couple of months organizing and coming together as neighbors both in the junction and Beyond to form the East Alaska Junction Coalition. We've been in touch with many of you and we're appreciated some of the responses we've received We're heartened by the stakeholder advisory groups recommendation to take the orange line off the table as part of the Eis process while we are advocating for a tunnel and elevated line should only be considered on an existing right away now and in future extensions, this is a permanent infrastructure. This is permanent infrastructure that will impact our neighborhood and really the Greater Community and greater Seattle Tri-County area for decades to come. It's a generational decision and I would ask you to please keep the orange line off the table at the junction and do not put cost and calendar over Community. Thank you very much. Hello, my name is Ty Aurelius. I'm also resident of West Seattle and I've been working with Amy as part of the East Alexa Alaska Junction Coalition. I wanted to start by saying thank you very much for the stakeholder Advisory Group that sound transit staff and the elected leadership group and the staff members of those numbers. So first of all, I wanted to say that were very much in support of the stakeholder advisory groups recommendation to take the orange elevated West Seattle line off the table, but I had some personal comments outside of our Coalition that this was the right time to bring those up on I also do not support anything that reduces the port's competitiveness, but I believe that the entire Spokane Corridor is integrated in such a way that the Eis should study all options through that area and to be mindful of the ports competitiveness, but there may be things to do along that Corridor. That would not be considered as only a soft Crossing or studied. I'm also I want to be in solidarity with our Youngstown neighbors some financially responsible option needs to be studied in the is the save that neighborhood including possibly the ANSI tunnel. Also the revisions to the purple line might find cost savings if they're considered properly and then I also had concerns about the advancing the schedule and West Seattle when the connections to downtown will not be fully completely. Thank you very much. I appreciate the planning that is taking place for energy that is green energy of carbon zero is the goal and I'm really glad that this is being discussed and family wage jobs are being taken into consideration for people at the ports and neighborhoods are being conscientious of the flow if it's underground or above-ground. I also hope people who are not in family wage jobs such as people at bird bar with resolution 31856 if that's past they will also be impacted or their kids are their grandkids since cities are interconnected and I'm density is increasing and also the members of share wheel who I believe should be permanently funded will also be using this People of various income levels who prefer not to be in really stressful roads that are densely packed with cars when they could be listening to music planning their work week. I'm talking on the phone instead of being stuck in a car. So I just I know there's different planning timeframes if it goes just halfway down or like way down, but it sounds like people are saying the orange line if it goes down it will have less noise, sir. I'm not sure. I'll have to follow along the meeting. I'm just really glad. This is a good conversation. Thanks. That's all we have signed up today for public comment to thank you everyone who came out today to provide the feedback and thanks for all of your ongoing engagement throughout this process. And as we mentioned before we are at a point in the process that will go on for a long time. So your continued to gauges can be really important. We are going to jump into a I would like to say a brief presentation, but it's dozens and dozens of slides, but we will move to a rather swiftly. It's a lot of pieces you've seen to date with some updates of the latest recommendations from The cycler Advisory Group at the end of the presentation. We will come back and walk through the alignment starting from the north end and Ballard through West Seattle and go I'm car segment by segments and have a robust discussion amongst ourselves on recommendations. We propose to make towards the Sound Transit board if you haven't 10 questions during this presentation though. You feel free to chime in if my colleague counseling McDermott will allow it. Thank you. Leave a shame that sound transit if you wanted to go through the agenda first, or I can Dive Right In sure I think council member O'Brien. Thank you for generally review on the agenda. Welcome everyone. It's nice to see you. Again. We're looking forward to our work today. We're scheduled to go until 11:30 and as chairman O'Brien said, we'll have some presentation material most of this information you've seen before but some of it will be new in terms of lead his presentation on what we've heard during the scoping process and the racial Equity toolkit process Cahill Ridge will walk us through Canada technical elements of the alignment that you seen before and then we'll get into our discussion around level three recommendations that you may feel comfortable putting forward to this to the Sound Transit board. I think you all right engagement equity and inclusion. Also, here's our communication and collaboration process chart. We've come a long way over the last year through level 1 and level 2 screening and now level 3. We've engage the public in a myriad of ways and their feedback is important stakeholder Advisory Group and the elected leadership group as you have made your recommendations. Just to give us a snapshot of the engagement over the last year. I know that in the opening remarks. We talked a lot about this engagement, but just to give you a little bit more color for that and also to sort of say a big thank you to all those that have engaged with us in this process over the last year. We've had 17 open houses forums and workshops that engaged over 2,100 people online open houses for those that can engage in person 189 Community briefings, 26 fairs and festivals engaging more than 5,700 people. So it's been it's been very useful to this process that useful for us to be able to share with you and it's also an opportunity just to say thank you to all those that have participated with us all along the way. The most recent engagement I was through the scoping. What is he is coping it's part of the Federal and State Environmental review process. It was a 45-day public comment period that began February 15th and April 2nd. We ask for public feedback on the scope of the Eis to the range of alternatives to be studied the purpose and needs statement topics to study which informs recommendations that have been made to date where I can buy Nations today as well as the board identification of what to study in that he is going forward. Overview of our scoping. So we notified folks in a lot of different ways postcards advertisements a project website social media. We engaged community members and organizations that we have worked with through the last year to try and push the word out through their networks as well. We had three public meetings in February and March and online open house and one agency meeting and provided other ways for folks to come in as well. Some highlights we had at 475 people attend. The three public meetings are online open house had 11700 + unique visitors six agencies participated in that agency scoping meeting and we got I believe close to actually 2800 total comments received and meetings and other methods and all of that those comments were capturing the scoping some report that has been shared with you is online now as well as all the comments were shared with you in advance that this meeting The types of input that we got we got General comments of build it faster plan for a hundred year investment as examples. We got feedback regarding the alignment and station locations. He is topics for evaluation things like construction environmental justice neighborhood and Community impacts Tod housing concerns her concerns regarding property impacts and also comments about fun. And now I want to transition our conversation about equity and inclusion and I'm pleased to have Jennifer Chao hear from the Department of neighborhoods with me. So as you have heard from us before we are proud to be building our partnership with the city of Seattle by applying the racial Equity tool kit to the West Salem Ballard link extensions project. It's allowed us through this collaboration to elevate issues and considerations to better inform the alternate Spellman process and provide information that the data alone cannot provide. We're committed going forward to reporting back to the community on the process and outcomes as well as continuing to engage in the Eis process and through our environmental justice now, Thank U Lita. Hello, everyone. The racial Equity toolkit process is supported by our marriage commitment to the race and social justice initiative, which is a vision to achieve racial Equity the community and a mission to end institutional and structural racism in city government promoting inclusion and full participation of all residents and partnering with Community to achieve racial Equity across Seattle. The racial Equity Tolkien is Guided by Seattle office of civil rights vision of a city of liberated people were communities historically impacted by racism oppression and colonisation hold power and Thrive as you'll see in the racial Equity choking Memo by doing the racial Equity took it process. It has changed the way engagement has been done traditionally and Center communities of color. Thank you, Jennifer. So what will share with you later is all building upon our level 1 and level 2 evaluation at and you've heard this before but in level one, we looked at the demographics across the corridor and identified her Focus areas of the Chinatown International District station and Delridge station determined shared outcomes red outcomes and updated our screening criteria, which inform the technical analysis in level 2, we documented and shared measured connections potential impacts and opportunities gathered and shared Community input and shared all of that with you as well as a stakeholder advisor group for recommendations were made and then today will be sharing the findings of level 3 data analysis and Community engagement all to understand how these alternatives for form in terms of the shared outcomes of the handsome ability in Access opportunities for Equitable development and avoiding disproportionate impact on communities of color and low-income populations as well as meaningful involving communities of color and low-income populations in the project. Didn't Jennifer I just want to say thank you for your work. This is a this project will have significant impact on communities and it's a culmination of this of this phase of the process to hear some folks from some of those communities that are going to be most impacted come forward and speak. So highly of Engagement process. When there Still Remains a lot of work to be done in a lot of uncertainty. I think it's really taking a model for how government can interact with communities near the feedback. Again, we have a lot of work to do to really look at those comments and addressing the concerns that are being raised. But I've just want to applaud you and your teams for the work you've done today. Thank you for the leadership. I'm going to review the alternative screen process the alternatives on the results. This is all information that we spent quite a bit of time with you already discussing and previous EOG meeting. So I'll try and move through these flies quite quickly, but I did want to get just briefly put these points in your mind again as we think about your recommendations moving forward. I just explained approach were being going through over the last year. This is the candy store information we talked about before the topographic is our prior approach during DST to process where we identified a preferred alternative during the environmental process are gold over the last year to help expedite project of elements has to try and bring forward lot of those conversations. We start with the representative project last year Robidoux identify when we go to the board next month of the Fertile turn it to carry through the environment of process with the idea that we can then Advanced some of the subsequent activities and overall meet the time frames identified in the st3 plan. Just explain what a preferred alternative is. It sassy panty pattern. It makes clear to the public where we think the project is headed. It's a preference. However among alternatives to be considered as not a final decision is as Peter noted at the board still have a number of alternatives to consider as it goes to the D is prop D is process and of course the Federal Transit Administration will weigh in with their perspective and they will issue a requisition. Temps of next steps going through the screen process as you know, we've been doing level 1 level 2 level 3 analysis over there this year and Uncle next month when we go to the board is at 10 to 5. So it'll turn live and other Eis Alternatives so we can start the environmental review process which will continue for subsequent years. Level three recommendations as we've been going through this process and as we discussed with a stakeholder Advisory Group last week there has been interest in additional scope items. You've heard mention of tunnels in West Seattle and Ballard and various other parts of car door on an alternative course would require third-party funding. So when we afraid this conversation to the stakeholder Vice review of last week, we asked them to identify to Preferred Alternatives one if third-party funny words be secured and a second for adult friend of his funding were not secured. The stick on the visor group and you have at your disposal at detecting evaluation results that we talked about frequently all of the public feedback. And of course the input on the racial Equity toolkit to inform your recommendations and turn up the level three Alternatives while we looked at we had basically three and two and Alternatives that we put out to the public during the scoping. The first as you've seen from the start as represented project which includes elevator line into West Seattle at tunnel through downtown Seattle and then transition to another day to structure. I was through Interbay and Ballard. A second alternative which we sometimes referred to as a brown alternative reflects a lot of refinements modifications and enhancements if you will from the feedback that we received over the last year so it differs from the representative project in all the different ways to write a stranger on this graphic which include refinements the station orientations are station locations at Great bus with a gray to the busway different shallow and Deep Mind options on 5th and the Chinatown ID area and so on as they go out to the car door. We also have a turtle turned it which again reflects other feedback that we received and includes tunnel options and West Seattle and Ballard. It looks at 4th Avenue options again in the Chinatown ID shallow and deep option at South Lake Union Station on Harrison. This is all feedback that we've heard over the course of the Year and refinements that we made these alternatives to reflect that feedback. In terms of the level 3 results again. This is information that you received before. We went into the scope. And. And then we talked a lot about what the public over the last few months as we being out there doing our briefings edwene as you've seen play me a person need his guided our work as we've gone through this year and we've had the same criteria that we've used in level 1 level 2 and level 3 to evaluate all of the different Alternatives and we waited all different Alternatives by 50 + measures given the ratings of Laura performing media performing on hard for him to try and identify differentiation between the Alternatives have also developed by the best mixer points along the way as I've noted before these sorts of help inform the comparison of Alternatives. They do not reflect the final project budget, which we would not establish until we get into the final design phase. Is it a straight down this graphic right now we're over on the left. I live in comparative estimates and we will start at the final project budget when we get into final design and probably around the year 2024 or so. This is a snapshot of all of the key differentiation differentiators between the various Alternatives that we looked at in level 3 again. You've seen the graphic and we talked in detail about these different ratings green is is good and red is not so good and that you can see here. I'm not going to go through this in detail that there is a distinction between the Alternatives as you go through this process. We've also as we frame this conversation to the public noted that level three alternatives are to find us they are for purposes of the analysis, but it is possible to mix-and-match different elements of those Alternatives. In fact, that's exactly the sort of feedback that we hope to do to try and make these Alternatives better than they are currently to find I would notice here on this graphic different areas along the car door where you could potentially mix and match opportunities and so a have received a lot of feedback on how we might do that just two steps without in a little more detail. For example in the west Seattle area. We have elevated and tunnel options blue and orange and red and you seen the stable before there are distinctions between these different alternatives are not going to go through this and table and each other again, you've seen it before but if you look at the car on the left are there are differentiators in terms of the location of Alaska Junction Station for potential property effects to residences both of these to ask Junction area and Eldridge area Central probably affects the businesses. There's differences in terms of the house. Alternates you a pic and how they affect the guideway hai-tu-long Genesee and in the Delridge neighborhood and then in the hospital there you can see the comparison of the estimates between the various different Alternatives, depending on what you do moving into duwamish Crossing area. We have options on both the North and South sides of the existing West Seattle Bridge again that you see the key differentiators printers Alternatives. There are differentiated terms of engineering constraints and pack some parks fish and wildlife Central property effects effects of freight movement isn't too, specs and again comparative estimates. Michigan to Solon Chinatown ID area again. We have a number of Alternatives primarily a cradle on D3 busway or elevated laundry 3 bus way or fourth or fifth avenue options in the Chinatown ID. Again. The key differentiators are highlighted on this table. There is distinctions between the Alternatives in terms of ease of station access and transfers in the Chinatown ID area construction defects in the Chinatown potential property effects and both Soto and Chinatown ID differences in terms of the overall effects on the construction schedule effects on light rail Transit operations, and again comparative estimate of India salt alternatives. As I go through the downtown area we've several options at Blue option with generally go along 5th Avenue and then along Harrison Street area to Seattle Center. And then we also have an option along 6th Avenue and Mercer as well as the representative project again, and the key differentiator between these alternative. Sorry the straight on this graphic ready. It comes down two differences between the station locations Midtown Station location there different options there South Lake Union Seattle Center and also differences in terms of the north tunnel Port location and also as note on the last row there different estimates for those alternatives. Begin to Smith Cove area. We got options at Prospect Street for the station and also a gator Street which would be a bit further north closer to the Magnolia Bridge. Taughannock there differentiation between these Alternatives in terms of the station location in terms of engineering constraints in terms of effects on Parks fish and wildlife property effects, and again in terms of comparative us treaties alternatives. Funny as we get into San Jose and Ballard station location, as you know, we're looking at tunnel options. We have a movable bridge and we also looking at the high fixed bridge option in that area and different options for the station location that either 14th or 15th. Again, all the alternatives are devastated on this graphic. The key differentiators are in terms of the station location and Ballard effects of Water Resources business and commerce effects potential property effects, and again differences in terms with a comparative estimates of these alternatives. So again, this is the feedback we've been seeking from the public about how we could mix and match these opportunities these different alternatives to create Alternatives that we would carry forward into the draft Eis process. I just turned over to leaving now to go through the scope and feedback. Xscape Howell This information is Cisco through segment by segment. We've got a different colors of boxes the gray reflects General comments interest theme that we heard in that segment and the orange has to do with alignment and station locations of feedback. We got from the public. These are common themes and we'll go through them segment. I said meant so starting in West Seattle duwamish, we heard concerned about potential residential placement and neighborhood impact in the north Delridge neighborhood. We heard concerns about potential residential displacement a neighborhood impact in the junction with the elevated alignment station as well in the junction. We generally hurt support for a tunnel some interest in consolidating Avalon Alaska Junction stations General support for Junction Station in the 41st and 42nd this entity. We also heard take out of the junction. If you are going to be elevated in terms of The duwamish Crossings jumping up there. We heard mixed opinions on the crossing location north of the West Seattle Bridge or south of the way. Seattle Bridge, and then there are a few other ideas at new ideas that we heard comments on. So interest in the pigeon Ridge Tunnel purple alignment actually from Level 2 and level 1 interest in alternative along the NC and Andover Corridor to minimize neighborhood impact and mixed opinions about usage of the West Seattle Golf course, I'm concerned about impacts of the golf course and some interested in utilizing a potentially for an alignment. Going to Soto again starting with gray and then going to Orange there was interest in seamless transfers of the Soto station, especially with it being the West Seattle interim Terminus concern regarding impacts of SoDo busway & mesrob base facilities concern about future traffic in development and affecting industrial businesses General fatigue with construction destruction through the Chinatown International District am Pioneer Square and request to evaluate parking, living construction impact and environmental justice issues, in terms of the station locations alignment trans bottom General support for Soto station closer to Lander for improved access. That's so sick of that blue line more support for overpasses Atlanta and Holgate to reduce traffic pedestrian and bicycle complex. But some concerns from adjacent Property Owners about the overpasses. There was more support for service alignments and soda for easy transfers between the lines. And some support for a new idea of a new elevated Soto station and elevating the existing station. Moving to the Chinatown International District again starting with gray there was concern regarding construction impacts on the CID Community with Fifth Avenue Alternatives interest in creating a good transfer environment activating Union Station and improving the public realm concerns regarding streetcar impacts during construction interest in aligning the new Station construction with other major projects concern regarding traffic diversions and parking and packs with 4th Avenue construction. And then interest in Chinatown International District is station name in terms of a lime and station locations really did hear a mixed a feedback. I mix it opinion. So some support Fifth Avenue to for easier access from residences and businesses in the Chinatown International District and those that support 4th Avenue sport to improve connections between Transit modes and between the CID & Tyner square and to limit the tensile construction impact in the CIT neighborhood. more support General support for shallow stations for easier transfers for either fourth or fifth avenue locations In downtown we heard concerned about potential residential property impacts of midtown station on 5th. Also related to the Midtown Station improved access to First Hill interest inefficient transfers at the Westlake station, which will be a big transfer point at the Denny station concern about impacts on the Seattle streetcar during construction and in the South Lake Union Dairy concerned about impacts on medical research facilities in Seattle Center area concerned about impacts on sale Center organizations and facilities, and then interesting good connections to Uptown neighborhood in Seattle Center regardless of the station location we did. However, you're more support for sale Center Station location at Republican General support for the South Lake Union Station on Harrison and associated with the blue line General support for the Disney station on West Lakes south of Denny Way Again associated with the blue line and finally General support for Midtown Station on 5th Avenue. I'm finally in Interbay and Ballard starting with the gray again General concerned about traffic and Freight impact along Elliot and 15th within the bin Mick concerned about Maritime business Freight and visual effects of an elevated Crossing and station little support for the movable Bridge due to concerns about service reliability and greater potential Maritime business spray tan in water impact in terms the alignment station location starting in Smith Cove. There was support for continuing to study both station locations. There's interest in Access and serving potential future uses around Smith Cove their support for station at 17th and Thorndike for enterbay an interest in Good access from dravus. There's more support for tunnel crossing of Salmon Bay and station. Some concerns were expressed about Tunnel cost. There was more support for the fixed bridge than the movable bridge and in terms of station location in Ballard, there is a mix of opinions paint. 18th and 15th support for a station at 15th to less than potential property impacts on traffic Freight impact on 15th and then support for station at 15th to be closer to the center of the Urban Village. There was also a new idea introduced your scoping interest in a station further west and Ballard. Questions. If not, I will go ahead and move on to the next piece here equity and inclusion soap building upon the work in level 1 and 2 we heard feedback and interest in the technical results are supported this to focus our scope in the Chinatown Arch, not for the Chinatown International District station on limiting harmful impacts maximizing connections for all users and hundred-year vision for the station and for the Delridge station bus real integration and Equitable transit-oriented development serving the community as being key issues in terms of serving communities of color and low-income populations. With this scope in mind. We also expanded our engagement tools doing listening sessions door-to-door Outreach and language with Community Liaisons. We had Community workshops and both of these locations. And of course we went through a lot of this in-depth with you on March 29th. We also had social services provider and Community organization interviews throughout the time that help inform our engagement and give us ideas for how to do more effectively in terms of the findings based on the of course, we do the technical evaluation as well as listen to community feedback for the Chinatown International District station. It's unclear which alternative would pose the greatest net benefit for the communities of color and loan companies in the surrounding South downtown neighborhoods. And for the Delridge station the st3 representer project offers the fewest net benefits for camisa color in low-income communities in terms of postural integration opportunist. It's a particle of transitory involvement. And also it's being further north its proximity to the services and amenities that are further south. questions on that if not we are. I need a review at the SAG to say. Saul review the side recommendations which they made last week. We plan it this to the side last week. It's a summary of the level 3 alternative. So you see we have the three level three Alternatives in each of the three columns that are colored on this graphic an alarm to left. There are the different segments of on the car door and the alternative is he described any segment. We also included the feedback on Alternatives that we received your disgusting. And that's reflected in the wide column on the right side of this Graphics. So as noted there that they're having you ideas that were not study previous. They are perhaps worse or they previously but re-emerged again during the scoping feedback. In terms of the socks recommendations that discussion was broken into two parts. The first discussion war was ended were to rise at our party funding Words Be secured. What would be the recommendations and it's I recommended in the west Seattle Junction area to pursue the blue 41st and 42nd tunnel option West in Delray Beach area that blue North Genesee station option and the pigeon tunnel alternative to south crossing alternative to do Amish downtown the blue 5th and Harrison alternative in Smith Cove the Prospect Street location and then an inch Bay Ballard the tunnel would a 15-ton station option and a tunnel by the 20 20th tunnel station option. There was no consensus in DeSoto CID area or rather consensus to continue studying all of the options in that area just explained all these Alternatives in a bit more detail. This is the West Seattle second of all the car door and you can see their they considered looking at 41st and 42nd tunnel. Options the North End of Genesee station option in Delray Beach on the south crossing of do Amish. That's what I was looking at the purple pigeon Ridge Tunnel alternative that was looked at previously in level 1 and level 2 in DeSoto and CID area as mentioned. It was pissing majority interest in continuing to study all of the options moving forward into the is as you went through downtown there was interest in the 5th and Harrison alternative. That was a recommendation. And then in the entryway. Area a Prospect Street location and blue and then continue to look at a tunnel with 15 station option and Ballard and a tunnel 20th station option as well. It was also a number of discussion elements that we went through the through the meeting and Interbay Ballard area that was generous support for a tunnel crossing of salmon day and having the power tunnel station serving about Urban Village. It was some interest engaging and understanding the trade-offs for communities east of 15. That would be farther from the idea of a 20th station location in DeSoto and CID area. It was interesting continue study all the options in the Chinatown ID interest in a thorough study of traffic impacts in DIA is process associated with the Fourth Avenue Chinatown ID station alternatives to a concerns about the impacts to the III busway and Ryerson base and also was not at the importance of seamless transfers into Chinatown ID and DeSoto station. West Seattle General that was sport Express for Deadwood station locations that are farther south. The second discussion was framed in the context of third-party funny were not secured. Again. We presented the same table and went through the same process to SAC recommendations are noted here in the west Seattle Junction area. They identify the red elevated station, but they also noted refinements that could be made to the rec center project in that location. And they also suggest the idea of 41st or 42nd tunnel station will consolidating the Outlast guy and Avalon stations to and hopefully she cost savings again in Delridge. They identified the blue north of Genesee station location to do Amish Crossing area that can identify the orange south crossing has been deferred in SoDo Seattle area. Again, they expressed an interest in continuing study all the options in the IRS process in the downtown area de gheyn identified the blue 5th and Harrison alignment is being heard and then in Smith Cove didn't fight both the green and the blue Prospect Street locations. They did not identify it. Alternative NH Bay Ballard area that would be that would not require additional funding they did however Express that they had did not support a move old bridge at that location just the other straight those recommendations this again is looking in the west Seattle area at 41st or 42nd tunnel station would have been solid it a Tasca and Avalanna option showing a blue and also an elevated alignment they speak the same as the representative project. But look at potential our finest the representative project in Alaska Junction area, that would have the station either north-south on Fauntleroy are in the Jefferson Square area. And the dollar Jerry they can identify the north of Genesee blue station location and the orange south crossing of the duwamish as a noted in a Chinatown and Soto areas. They recommend a continue to look at all of the options. Again, the 5th and Harrison option to downtown at the Prospect Street locations blue and green and Interbay, and they expressed that they did not support and we will break option for the Salmon Bay Crossing. Types of discussion and this again within the context a third-party funny. We're not secured in West Seattle a s and Note and interest and grab send a project and then Oscar Junction area oriented north-south stain east of the junction 8 on Fauntleroy on the city of Jackson Square with a blue. Red station location. They did not support the orange Alaska Junction Station location. They did have interest in studying the blue alternative will consolidate Alaska Junction Avalon stations and express concerns about the height of the guide way through town Ridge. DeSoto ncid area that mimics a lot of the comments that were made in the other content of discussion concerns about impacts again to the III busway and Ryerson base and the majority of sports. Keep all the options on the table to be responsive to Community Support to input to the Trenton and his voice has not traditional being listened to and respect him strict the infrastructure projects and they felt that the car is at this point. We're very preliminary and should not limit the alternative should be studied in the Chinatown ID. The word concerns are expressed about the additional cost associated with 4th Avenue alternatives on the walls interest and discussion about the Fifth Avenue States Shadow station option a third-party funny were not secured. And then say about area there were concerns about the potential traffic effects on 80th 15th of the green Smith Cove station location, and it was interested in providing good access to that station. It will not support for removal Bridge across seven day and they were mixed opinions. It would interest in studying the fixed bridge Brown and a tunnel blue in that thing turn in. Crossing location. Bethany and it was also General feedback at Seven Seas calories was some concern about the extent of third-party funding and what are there are other needs for that funding such as proven mobility in the city. There was some concerns about identified a preferred alternative at this stage to allow for comprehensive study in the is that was ticking in the context of the Chinatown ID station options were there was interest in continuing to look at Alternatives there and their comments about adding you all turned us into the process that have not yet being studied are vetted through the public engagement process to date. Thank you, Lita and Kayla that exhaustive in substantiv presentation. Let me just pause and see if there are any questions from members of the elected leadership group to clarify before we before council member Bryan leads us into our discussion. All right, let's people being really shy right now, which is not usual for this group. I'm going to assume there no questions as we jump and I want to build on something Peter said just to frame up again what we're doing here. I'm remind folks that we are in scoping phase next month the Sound Transit board of directors will perform recommendations for what will be studied in the environmental impact statement. A narwhal is elected leadership group is to make recommendations to the board for what would be studied. Our recommendation should be informed by the 17 months of process in community input including the stakeholder Advisory Group recommendations and my goal here and we have about 45 minutes and our discussion is to identify places where we have Clarity where this group feels really strong consensus about alignments are station locations that we want Study because they Rise to a level of meeting kind of broad Community consensus. It's really I think important that the board hears were those those areas of clarity exist. There may be areas where there's a difference of opinions here too. And I think we just want to get clear on what those differences are so we can articulate those to the board. There may be opportunities to resolve some of those differences the next 45 minutes and there may be places where there's just some differences that remain and we rely on sortation to help us clarify in the notes to the board what's happening and acknowledge that there are five board members will be in that meeting next month that are sitting here too. So I'm I'm calling on our board members to carry to make sure that the Nuance that we're discussing here gets carried forward to the board in the context there. So we're going to start working from north to south. I believe the same question posed for me, which is does the LG have a recommendation to the Sound Transit board for what to continue studying? Do you have a preference Lita and David over here will be capturing the note. So as you are dialoguing around this will be able to capture what's being said. Okay Hills going to continue to stay at here to answer technical questions as they come up. So let's start and Interbay Ballard. And again, this is a similar exercise that what as to what the stakeholder Advisory Group went through last week. So starting at RB Ballard as you look at the the table up there does the LG have a recommendation for what to carry forward to the Sound Transit board? Thank you very much Cahill, amazing amount of detail that you have in your brain. So I appreciate you and Lita Carey for all of the good work that you've done on this. So with Interbay Ballard, this has been an area of particular interest to me and I would say to council member O'Brien as well. This 20th Street option is fairly new. I know it was a number of years ago. It came up and then it was dismissed the fact that Mike Stewart and others are saying let's take a look at it again. I would say let's do that. I don't have a strong sense. But I hope the Community Voices are clear, but I'll tell you over and over again. I just feel very strongly that the movable Bridge is a non-starter. I would even say the fixed bridge is a non-starter. I'd like to see a Time ending on one of those two places. And what did that is something that we need more money for or if the Delta becomes smaller as you do the environmental impact statement, but I just Emphasize that everything I hear from the community is it's got to be a tunnel and whether it's goes to the 20th or 2:15. That is something that we're going to have to study further. I'd also just like to thank you very much for the blue line, which is moving just to the west of 15th. I think we've we've heard from Freight and from everyone else that that particular alignment is going to preserve 15th, which is the only north-south freight Corridor along that edge. And then the last thing I want to say here is that the Gaylor studied at Smith, is something that the court feels fairly strongly about and I would just urge that we keep the Prospect and the Gaylord stations both both on the list. Alvin Dave nearest support counselor and bagshaw's proposal that we should not continue to consider the movable bridge and Ballard. I do think that well, it seems to me critical that we arrive at downtown Ballard how everyone's going to Define it in this and downtown west Seattle and downtown CID below grade and then in a way that serves rather than harm to communities. We probably need to continue to consider at least for this purpose was the environmental study that the high level Bridge alternative just as we I think we're going to be asked to consider an elevated alternative in West Seattle that I don't think is an appropriate thing for us to be building in the end. I also think we've made a lot of progress in refining possibilities for Ballard Inn in this process, and I think that this reintroduction A different way to get to 20th and Market is intriguing. I do not know it's about its viability. I don't have any independent way to know how much a difference from the alternative that was considered an and put aside previously, but I do think that it's it is a good idea for us to pursue that if it's in fact potentially viable. Thank you. If you just wanted agree with the idea of removing, the removable Bridge as an option that seems to be a consensus. I also think we have to keep the Highbridge is an option. We when we come out of this, I think it's essential that sound transit board have an alternative that Is closing cost to the representative alignment we started with and I very much like the structure that the SAG put together with a two recommendations one third party funding in one with no third part funding and Ice actually hoping we would just start with their recommendations as you know, the template cuz I think I think they're excellent need to text won't work, but I just wanted a second those comments about the High Bridge. I'll jump in here then thank you. I wanted to offer my comments as well with the second of Constantine and councilmember bagshawe that certainly the movable bridge. I think we all agree needs to be off the table in the port supports that I would say that given my gree with dowel that if there's going to be an elevated consideration in West Seattle most likely I'm we're not there yet, but I could support the an elevated structure being studied and Ballard but we do support a tunnel option moving forward that set on the 20th again 20th option just literally came forward are you know, I got information on it on Monday and so it's difficult to know whether that's why I ball I will say I've asked our staff to look into it. I think there is some considerable concerns with crossing the BNSF track. So I would imagine that they're going to be raining heavily if that were to move forward. So just to be realistic about if it's going to have some more study. I'm not really sure how viable it is, but I understand that but it's important to the Ballard business community. I'm all the way in I concur with others who would like to discontinue study of the movable bridge. I don't have not heard any support in the community for the Middle Ridge and I heard strong support for a tunnel option as others have said here. I do think it's responsible for us to also be studying alternative to the tunnel. And I think the the high fixed bridge is the alternative it should be studied. But the clear that is not a reference to be built, but it's appropriate to be studied this point as far as locations of the tunnel been a lot of energy in work put into looking at I'm going to run together the the Fourteenth and Fifteenth station location and assume that sound transit would be studying those two kind of in in conjunction with each other to understand which which options work best from a design engineering ridership a land availability perspective does a couple When is bus real integration is going to be really important? And so as you're looking at design refinements how the Bus and Rail integrated make those transfers as seamless as possible cuz they're $1 BC transfers coming from North East and West are also access to the urban center. I think it's critically important. And so how about we heard in public, today. Someone time is it it's 2 and 1/2 minutes to cross Market Street from the east from the west side to the east side of 15th. So station location that that allows for station portal underground or even above ground I guess without having to do an accurate crossing of the street is the type of thing that I hope that the agency can study as we go into the is there is a lot that intrigues me about the idea of locating a station at 20th. It's much closer to the kind of urban core there as it isn't said it's a little hard at this point. The game to have much new information to see why I should bring it back. I think there are some challenges is Port commissioner mentioned. I'll add that. Citing a station is a major construction project as we noted in the Chinatown International District. And will I imagine a lot of businesses would love a portal that pops out next to their business? I don't know that we've fully educated folks on what a construction project would be to locate an underground station in the heart of Ballard and the disruption that may happen with that the Kaioken. Do you have any anymore? I don't know technical expertise on on what that station would entail where where that idea and let you know that we have looked as a station location in that area as part of the level 1 analysis and let you know that one of the reasons why that all turned it did not move forward. We're concerned about the construction effects of station instruction. And what is a very built-up area and Ballard and that would be the case with this alternative to and they're so tall that I could pay with an existing street right away, but we're not aware that I could do that that would likely be proper potential property effects with that alternative. More concern to us is that although the idea is intriguing as it's defined right now it it doesn't look to be technically feasible to actually have that configuration that's described. It would like to have impacts to the marina Fazoli's along the south side of that Salmon Bay Area would potentially extend into the navigation Channel. I'm are we have to move the portal for the South when which case is going to be a long tunnel in which means we end up with much the same concerns that we had in their level 1 analysis. I'd like to just try to summarize where you what I'm hearing from you for the Interbay Ballard area, which is strong support for continued evaluation of the blue option tunnel. 1415 tunnel station knowing that that that needs to be refined a little bit and then I have also heard interest in continuing to study 20th as well as the fixed bridge option if you know as a as a cost comprable to the representative project and having the LG recommend that the movable Bridge be removed from further consideration. Maybe I would further distinguish between the elevated in 20th. I think an acceptance. I believe that an elevated should be studied and that makes sense. My sense on the 20th tunnel is to see see what any more technical conversations happen and let the board decide if that should be studied or not. I again I am intrigued by all sorts of title ideas. I'm also hesitant to put too many options on the table with this late in the game and a process has been designed to refine them. And so I would say that if the board in its wisdom decides if that's a a really viable Alternatives that they want to study then I would obviously support that based on what Cahill said, I have some serious concerns about that. But let's see what see what happens between now and your maid meeting Okay, okay with that. Okay, are we not making recommendations on a more resources option na? No more resources option. It doesn't sound like we are based on the structure of this conversation. American I think that that is maybe a separate conversation we've done a lot of work talking to other board members in the like but there's nothing at this stage of the game that requires us to be studying what requires more funny no more funding and requiring what the alternative is. In fact, I think what we've learned from staff is we don't have enough technical information at this point to really know the cost available for anything. So I think we'll talk about it later. But I will be urging strongly here and also at the board that we not designate something as a preferred alternative at all. Just an alternate being studied and that the question of funding is something that is coming down the road the city of Seattle understands. Obviously that if there are additional funding required for an alignment that we're going to have to be a very active partner in finding that third-party funding and some of it will be in kind might be land and might be services but that we don't know enough yet at this juncture to be making those distinctions to 100%. What's the concept of not identifying a preferred alternative right now? I think my questions a little bit different which is How the SAG has made their recommendations has been they also didn't pick her alternative but they did identify segments that when taken together would not acquire additional funding and segments when taken together would require additional funding and so that's how I've been thinking about the question that we are going to answer today putting the question of preferred alternative aside. And so I just I'm just asking the question if if if we're doing that and that it is that going to be the form that the recommendation is to the board or are we going to do something differently? I think my expectation is example. We have two things that I think we've reached agreement to study one of the tunnel at 14th and 50th and one is a high fix Bridget and it's a moral alignment and I think as we walk through this Time we get to the end. We'll have a little more clarity on how we may want to characterize those. But but I think of those two options as one that leads to the current funded the current engineering looks like one is more expensive than the other and so because I know how that lies out and we'll talk maybe that's how we want to characterize the variety of things were studying with you in if that's okay. I think it's absolutely essential that we carry forward to sort sets represent different sag recommended and one of the reasons for that is the Sound Transit board going to be asked to identify what's going to be studied in the new payee is in a part of a neap assessment is looking at the feasibility of a project and feasibility includes any of the financial ability to construct it also requires looking at direct and indirect effects. The alternatives on other things and as we talked about many times here Seattle West Seattle and Ballard are part of a broader system and a high cost of alternate. It doesn't have funding but would require of sound transit to construct It Anyway would affect other parts of the system. And so I think we've got to get a minimum I would like to see is have one preferred alternative. I would have preferred that was the result of this process. It doesn't seem to be but a structure that carries for two Alternatives one. That's within the the financial plan of Sound Transit 3 package that was passed by the voters in one that has add-ons that would require third-party funding is really essential. So at least an inner bay Ballard you've accomplished. I think by identifying the the tunnel option but there's the blue and then the high fixed bridge to continue studying. So to the extent that were integrating those those cost concerns and considerations into the dialect today. I think that's going to be really helpful helpful indication to the board. So if I may move us from Interbay Ballard if we're okay with that discussion where you landed on that into Smith Cove council member bagshot suggested in her comment earlier that both the Gaylord Street Station and the Prospect Street Station stay on for further consideration by the board other thoughts the SAG recommendation about why they would have Prospect in there. I didn't quite understand that it's really because it has a higher cost structure than Gaylor. In terms of strong opinions the was in the context of the Prospect Street station is mainly about allowing for access in that location and there wasn't really much discussion about the gator speed option. And that's one of the since I've gotten quite frankly amongst the LG to seems to be the orphans segment that nobody's paid much attention to its at 4. I think two entities the Port of Seattle and Expedia and so from the Port of Seattle is perspective with all due respect. It asked you all to consider the Gaylor option one is a hundred million dollars less and I think we are looking for cost savings. It does accomplish helping Expedia, but it also helps our cruise ship passengers at Terminal 91 and I would add to that as there's further development throughout the inner bay area in particular the Armory site, which is I believe coming up in the next couple of years. There's a group looking at that right now headed by a governor lock the Gaylord station actually helps more in the future than the prospect station. So I asked the team to consider that moving forward. I think of hearing believe consensus of recommending to continue to study both a Gala in a prospect alignment do know some a comment on this. I'm happy to move on to make a time and I think noting commissioner Bowman's comments on the preference for Gaylord from the parts perspective. So moving both four-wheel and costs and cost and it took her bolts point, you know at some point we're going to have to have maybe not this group. It sounds like but somebody's going to have the conversation at the board about how to fund this and so I for me it's important to have segments go along that are somewhat within a budget. So that's another strong reason for Gaylor. Thank you. Thank you. Okay moving into downtown. Does the LG have a recommendation to the board? Come supposed to Hero. Okay, sorry about that. I was multitasking. So that seemed to resonate throughout of this where I'm coming. I'm speaking one of thanks six or seven members of the city here is to basically Advanced all four of the preferred Alternatives when you look at Apple Fifth Avenue deep or shallow and 4th Avenue at Deep or shallow. What I'm hearing the stakeholder groups would have said we remove it with eager to get to Chinatown International District, but that the passageway the right through downtown at 5th and Republican 6th and Mercer 5th and Harrison, I think is internal cleansing where we want to go to the web and they stopped me. Why does your pee go ahead I take back what I said. I just stopped you in the past and I think the conversations that I've heard and it had along are consistent with what we thought of the stakeholder Advisory Group is so I'll just put this on the table and Alignment essentially the blue Alignment, which has stopped on Republican your Key Arena with understanding that there's still some design refinements to do there as we understand what that looks like when we get into South Lake Union at Harrison alignment being with wants to be studied as we get to the Westlake again on the blue alignment and then the interaction with the Westlake station along 5th Avenue, but understanding the the what we've heard from the state board Advisory Group to a seamless an interaction between the two lines there would be important. I haven't heard it seems 1/5 is less expensive and so in the spirit of finding cost savings that is something that we support but I imagine the agency will study some varieties around there to continue to see what makes sense. And so effectively I think the Blue Line meets the needs of folks I've heard here. Is anyone want to add anything to that? Thank you very much councilmember Brian about this interesting Lee the blue line and going through downtown has had the least attention of anything that we've worked on. I have I represent this area and this is extremely important that it works seamlessly. I was like, but it seems to have created the least amount of conflict. So I would just say that the Key Arena station, you know big thumbs up with all the work that we're doing around Seattle Center The Interchange the seamless interchange at Westlake is important and I think it is something that I'm hearing. Let's just support blue line and I would recommend we move forward with that. And you're looking at me like I was just going to ask if you could put the microphone a little bit closer when you speak so hearing you correctly. You're advocating 5th and Harrison as well the blue line. If I if I wasn't clear it's because there seems to be a support for this in the downtown area and I have not heard anybody raising a Ruckus that it needs to be something else American. Weather cancel my big shot with maybe one refinement in that once it swings into downtown at Westlake studying that segment of both 5th and 6th Avenue to make sure we see what that alignment is with the current capacity and the Madison Street brt. Thank you manager can certainly it so. I'm seeing majority consensus at least four 5th and Harrison being Advanced fine mints to maximize. The benefit of those conversation is is framed by the fact we were just presented with the side recommendations as well in U-verse customer bags. I want to underscore the value and an essential qualities of that transport Westlake. Great. Council member Harrow, may I invite you to commence with our discussion and repeat what I said earlier, but I think you know I should let the cat out the bag that unfortunately we could narrow down either from 4th to fit. It. Sounds like Community couldn't and I think our elected leaders heard a struggle with this as well. And whether it's a shallow or deep deeper station. It was just sort of difficult giving where we are at this stage. And so I think what we are suggesting is to advance all fours for options based Glenn 4th and 5th Shadow and deepest is preferred Alternatives. I must say that in a perfect world because we know that the options on 4th Avenue du require third-party funding that we we could a very likely made a strong stance now whether the city of Seattle as an example of that third-party Said we are willing to try to put some skin in the game at this point at this stage in the in the discussion, but we thought that premature as well to either say to detective Somers Point to try to narrow down a little bit that we still weren't comfortable doing that at this stage. And so I think the least my preference would be to Advanced till all four or alternatives. I'd like to highlight what we heard and some of the public testimony today and that is a great desire to move all four options forward and great compliments for the worth it the community the Chinatown International District in Pioneer Square communities have been able to do with the agency and with our staff the collaboration to work to this point on recognizing that given this neighborhood and historic issues of infrastructure and being imposed in the neighborhood and the particular Logistics of fourth and fifth that we haven't come to a conclusion and so yes, but very much support studying all four options going forward. We've also heard and I would be supportive of efforts on whether it's directly related to the alignment or other efforts by the agency to activate Union Station further. And as we study the four options, would you think it's important to be mindful of its impact on on bus service particularly our partner Metro Transit and the Ryerson base to not do so would impact our ability to provide Transit throughout the region and we need to make sure the ranch rating and moving people throughout the region not just on one single system. So I think being mindful of that yet studying and moving forward all four options has great value. Moving forward on this is just a technical question and I've asked it a number of times and I'd also want to say thank you to my co and others that were here today to talk about their vision for how do how do we reduce the impact on cidb? Here's my question operationally. I look at these deep tunnels and I don't understand how they're simply going to work at the UW is an example. That's a pretty deep, you know number of escalators to get down and my understanding is that the tunnel as proposed is twice as deep is that so that means that we are going to be relying on escalators and elevators primarily to get people up to the surface and down. So is it I guess but my technical question is is that reasonable beat from an operational standpoint. Maybe it's has less impact on it from a construction standpoint on the neighborhood, but Going forward for the next hundred years or massive elevators and that deep going to really promote the benefit of the community. Yeah, I know analysis sweet we did identify that particular concern. So that's something that we have to do, you know Rudy evaluated move forward and do the IRS process if this alternative is to be looked at further, but we would have the similar concerns about access associate with deep stations. I'm not. I'm not clear on when we say we're going to put it in the Eis and you say you're going to study it further have we really given you the tools that you need to say you were going to study it and then you come back to the board. But if there's something that just seems like he that's just not going to work. Should we be advancing something that from a standpoint of I've just the long-term operations you guys know, this is a ninja as a non engineer. I can't tell you. I'm just talking about practically speaking. It strikes me as something that's going to be very difficult for user and so I'm not being particularly are and I think where I am on this is the carryall for forward and I'll check you later. Why I'm I think each of the four options here pose some significant challenges and I think you've identified a couple challenges with Deep ones unlike in other areas where when we've eliminated the ones that the big challenge is there was there was some good options left. It feels like at the moment until we understand some of the trade-offs that they all have particularly hard challenges for that community. And so I think that the challenges you've identified about transferring in a deep station are important and I think that they've been noted as part of the ice and we expect to see, you know, maybe there's a way to address that I'm there's nothing that's popped up at the moment. There are other challenges with the shallow stations. We talked about 2. And again, the hope is that those will be addressed in a meaningful way to communities every further refine on the study them. Thank you. Sure. Just a footnote. I'm not sure that most people realize and correct me if I'm wrong stuff, but I've asked this before the Beacon Hill Tunnel is 160 feed and this one would be 200 feet. Is that correct? That's cracked. So I would just say that I know there's been a Surgeon General concerned about a really deep station, but we have one at Beacon Hill and so the difference my understanding is that what this serves the volume of people and so that's an operational issue. But in terms of the tunnel death, we've it's happened in Beacon Hill. So if you haven't had a chance to go to that station, I'd encourage you to there's no escalators. It's only elevator. So I would be in favor moving it Forward just for that reason that ate the staff is done a good job of working it out in Beacon Hill not to say that it's a preference just for that reason in terms of everybody wanting him to move forward or something though. I'm thinking he'll is not a transfer station and what we haven't really discussed as much in this context is Eastlink will first entered the spine at the station at International District Chinatown. So it is in fact if you're coming from the East side and heading to the airport you've since the Eastlink trains will continue to go north. You want me to transfer to then go south. So it is going to be a major note to mr. O'Brien's Point many of challenges with all four options, but that is certainly one. Paper Mario jerking and then I'm going to move us in DeSoto. I want to concur with everyone who supported moving all forests board, but I want to call out another issue. We got a presentation from Jennifer. Thank you for that on equity and I think we have to send this discussion on that. We cannot look at Chinatown International District without recognizing the irony that we are sitting in a train station where those train systems were built by Chinese labor for that Chinese laborers been excluded from our country by discriminatory laws where they carved out a toehold here in Seattle where the Japanese Community landed and then we took them and then turn them and this community has been a vibrant part of our city for a long time and that Community deserves to have more input more understanding as we move forward and I think that for us to study these for Alternatives, we know that this whole system will probably have a greater impact on this community than anywhere else in the system. It is the place where everything joints and so for us to Movies for things forward is the right thing to do. I also think it's the smart thing to do because it will not slow us down the worst thing that can happen to us as if we end up going through a knee is and then have to do a supplemental he is because we haven't considered things or there's too much resistance or thing. So I think that moving these for forward gives us the opportunity to work with Community an ongoing basis. So is the technical parts are being studied we can also deeply understand how this will impact the community. So for those reasons as well. I I am very much in favor of moving all four alternatives for word powerful words. Thank you very much. I think we are violent agreement. Thank you. Thank you so much. Okay, let's move into Soto. Does the LG have a recommendation as we pass through Soto? Her folks, this is not when we talked a lot about but just the Highlight the the options were considering hear the colonel. I'm in the courses at the existing light rail system. Is that grade? And the representative alignment would be an elevated through there an option that has emerged would be too instead have the st3 connection West Seattle be also a grade which to me makes a lot of sense the traffic impacts would the to the car rail interaction would be addressed in the case of of two lines at grade with a vehicle overpass at both Holgate in Lander we so that would be one option another option 1 option of course would be to keep one elevated in one eighth grade. Another option that is been mentioned to the SAG was to elevate both alignments in and said have the cars pass under them and the rail be the overpass. I think it's some challenges with that, but I don't know if I want to come in and what they've heard from community members. I'd like to just ask you a few questions and have make sure we all have a common understanding of what do all of it. He would do I think some of the interest would particularly be to preserve the III best way for Metro Bus use but practically I think we need to know understanding of how operationally that would be implemented in operate in the system. And also whether we have an idea whether that working with a new track can be done with st3 funding. I'm yes well as counselor Ryan describes the current assumption is it with reps and a project that you'll be elevated through that area with the new line of you constructed and decided it would be proposing to you. Also Elevate the existing line which is at grade and to do so, of course that was not an assumption in the st3 plans. So to your Cost question that would be additional funding if you want to also Elevate the existing line in that area. And obviously if you're doing that you will be disrupting service on the existing line when you do that elevator construction at a point in time in the future when they would be quite substantial ridership and and service on that line. So the indications are both in terms of cost and in terms of construction impacts of operation in packs Councilmember O'Brien, could we get back where you articulating preference or recommendation to move forward with III upgrade the blue option. Did you did you get what you needed rest? That's what I need for the Moment by understanding is that my senses that having them both at grade makes a lot of sense for ease of transfer and ease of making a to separate vehicle traffic as opposed to having the intersection. So we have today the concerns as I understand them from some adjacent Property Owners is when you build that overpass it's it's it's above grade where it is today and it may impact access their properties and I think those are fair concerns to be addressed and my recommendation would be to focus on the task grade A juul at grade with vehicle overpasses with notes to recommend it as we do the further study to make sure that we address adjacent Property Owners impacts of that construction. Just to add on to it councilman McDermott was saying we do still need to and a lot of this unresolved work to examine the impacts not just to bus transit that is currently using the III busway, and it's a lot of buses. But also to the Ryerson base in particular is everyone is painfully aware by space capacity is in very short supply and the demand continues to grow so they're some of these plans have significant impacts to their Ryerson base. My folks generally comfortable with with the recommendation. I proposed of and acknowledging that they obviously bus from operations is critically important. Okay, thank you. So noted III upgrade with consideration of the the comments that were made earlier around bus impacts and Ryerson base moving to the duwamish Crossing. Then again, we're moving into across the duwamish crossing and then we'll get into a discussion around by Seattle. But does the LG have a recommendation crossing the duwamish? Pressure Bowman was surprisingly all start. Two things obviously the it was I appreciate that the SAG spent so much time looking at this and the Sound Transit staff has come out in for the LG members that have come out to our marine terminals to see the impact. I appreciate that those of you that we're not able to come out in the last couple of months. I encourage you again to come out and are Longshore labor would be happy to host you as well on April 2nd the Northwest Seaport Alliance, which is Port of Seattle in Port of Tacoma voted to invest in Terminal 5 for $340. That's also tied to a private investment of about 120 million dollars. So just shy of five hundred million dollars total just for the first phase of Terminal 5. The terminal operator is SSA, which is already operating in our Harbor and one of their private sector Partners is going to be MSC in a joint venture. This is securing Marine International Marine cargo at the Port of Seattle for the next 30 Years. It is a major investment. I know I've spoken about this before but in addition to that major public-private investment, this south crossing is 300 million dollars cost savings for this project. I would say that this is something that I would be shocked if we move forward on another Crossing quite frankly. I am would like some clarification however with the staff because the only reason that I've heard that we might move forward or advance in north crossing is because of a potential for FSU and so I apologize I had this right up a minute ago in your recommendations and for me, it's on page 40. It says it may require for a faux voidance not must have a 4-f avoidance alternative. So could somebody clarify that and if you can't right now that's fine. I will say I have our Port attorneys who are well-versed in 4f because of all the construction, we do particular round the airport providing a legal opinion, which I be happy. Share with the LG in The Sound Transit board. But if this is not an absolute requirement, I would ask that we just Advanced the south crossing but the south crossing at the far end of Harbor Island and the one that's being brought forward by the SAG. I'm yes. Well as as I think something noted in one of the previous slides we do still need to coordinate with FTA as well as the board and we do expect I'll course. This is for them to stay that they would expect us to look at the North Crossings Wild for the 4f resources concern. So that's something to be confirmed. But that's our expectation at this point that we would also as part of that. He is look at the north crossing location. What I would ask that yields you to consider is recommending a south crossing with the caveat that if the FDA comes back and says you need to have an alternative Crossing that we certainly the board would have the opportunity to move that but at this point with a 300 million dollar cost savings, it just seems like the proper thing to do. Councilmember Bakeshop. Thank you in one of the council members that went over and looked at this with commissioner Bowman and hearing what we are hearing from the maritime industry. I don't know if there's something that we can do that really emphasizes what maybe you're saying is that the south crossing is so much preferred that you have to do in north crossing was sort of a wink-and-a-nod. I understand that study, but coming out of this meeting I would very much like to have clarity about the south is going to be something that we really prefer and then we also saw just recently and I want to say thank you to our West Seattle friends about another alternative on that's a slight diagonal on the crossing but it's still south of the bridge. So I would like to say love to hear more about that, but I don't think that it makes a ton of sense for us to spend a lot of time energy and money. We have to do that for your FTA purposes on north crossing. Okay, I'm hearing strong support for further consideration of the south crossing and I want to keep moving us along if we need to with the caveat that if the the north crossing needs to be settled that you're going to get foot for the clarification from Sound Transit on that. Thank you. I'm just following up on a counselor Bagshaw statement about an alternative Crossing coming to us from the community. It is a even more south crossing but it is I think I've really necessary component to consider it continued consideration of the pigeon Ridge Tunnel station or the the pigeon Ridge State the Delridge station the pigeon tunnel and it you know, one of the things that staff asked us to consider in putting forward recommendations is of the alignments. What do we like about the alignment? And I think for the purple line what folks like most about the purple line was not the Crossing. Does the the station and the tunnel and the how that functioned in the community and how it minimized impact until committee members have brought forward a new Crossing that would hopefully address many of the concerns that staff had about the previous very south crossing. I'm going to pass out a handout many of us already have that resist the urge to look at the whole thing. I'm really just wanting to share it with folks so that they can see how the crossing itself is is visualized and I'm sorry, I don't have enough for everybody. So Will you have a copy? So so well that's going around. I just want to time check with you guys at 11:30 permission to continue meeting. This is important work. Thank you. So again, this deals with some of the issues that we have heard the it crosses the duwamish Waterway via a new high-level bridge in the southern end of Harbor Island, and it allows for a transition into a tunnel beneath pigeon Ridge and then emerges back onto an elevated structure paralleling Southwest Genesee Street. This allows for limited impact on commercial and residential properties and be elevated roots. Of course, cause significant disruption harm to the existing neighborhood fabric a tunnel under pigeon. Wood-Ridge would greatly minimized these impacts in addition. I think a really important point. Is that there Some concerns and travel concerns about the proposal of the original Delridge duwamish Crossing with the purple line and as it relates specifically to fishing rights and their desire for a duwamish Crossing is close to the West Seattle Bridge is possible. I think this address is that earlier concern with the proposed Purple Line crossing. KK Hill, did you do you have any? Comment on that at this point. I think we are where this idea that has emerged lately. It does address some of the challenges as you noted with the previous definition of that all turned that was screened out because it was appraisal turn ahead the widest Crossing location a new Crossing location that had the audacity many environmental permitting concerns and avoided the active Auto Yard issue and so on this alternative is address of some of those concerns. It still has engineering challenges. Obviously, it does require poorly into the steep slope of the Pigeon Point area. You still have those green belt issues. It still doesn't solve the second tunnel. So the some of those cost concerns that we previously identified with the previous alternative would still be a concern here and it would still have some neighbor to fact at the Port locations. So it's Improvements doesn't go all the way to addressing all the concerns that were identified previously. So let me just try to summarize and get us across the duwamish Waterway their strong interest in the southern Crossing with the caveat around the must must the north crossing be studied. But then also for the notes that an encouragement that sound transit can continue to set of that study. Even further Southern option. Okay? Yes. I just got a question for Southwest between now and the may sound transit board meeting will we be able to get further analysis of this and we did look at the purple line before and it was over billion dollars additional costs and had the engineering problems that you mention Kayla but how much more information will we have in May hesitant to advance something with this late date that you never were just so uncertain about and previous information was it was leaded to be eliminated we can try and get your information, form your thinking at this point. But as I said it it clearly they does have some of the same challenges that wait until 5 before so that we can get you more information. Thank you, moving onto land in the Dell Ridge station council member of Gonzales. I don't know if you need to excuse yourself. You want to stay? I need I am going to go ahead and excuse myself as I have an ongoing conflict of interest until the West Seattle Junction issues are dealt with and I also have a Committee hearing at noon. So I have multiple reasons why unfortunately have to say goodbye to all of you, but I have enjoyed being part of this group and look forward to next steps. Thank you. Can I just say I think we had a quorum of elected officials from West Seattle that has been noted more than one time. They are jerking. Thank you. Thank you for your commitment. Okay moving into while will. moving into the Delridge neighborhood does the LG have a recommendation in this area? I think interest as the segment forward the blue line. I think there's an interest in recognizing that recommendation with also doing more refinement to move the station further south and to the weather that is swimming the turn wider by being on the other side of Delridge or moving the station only to the block to the one block rather than to have less impact on the Youngstown neighborhood is consistently her concern. But I think Blue Line without refinement clearly identified as an interest. Thank you and others. I've asked for the number of these. Decision points in West Seattle for the Sound Transit staff to look at possible design refinements and that includes in Delridge and Avalon. I looking for yes cost savings but also reduction of community impacts the delivery of high-quality Transit including the transfer transfer environments and obviously Tod potential. I think that what form of government is described by trying to keep some of those benefits with the current Blue Line alignment is important thing for us to move forward. I also think that we visiting the Yancey Andover alignment but without necessarily the Assumption about where that station would be located which was I think at the time of Consolidated station of Avalon Delridge rather having one that is in a better position to serve Delridge is important thing for us to get to Give for the thought too and I've asked the staff to continue looking at whether we could have a Youngstown station essentially that both reduces comedian packs and provides excellent transit services people in Youngstown and throughout the entire Delridge corridor. Hearing support for blue with the refinements that have been identified by executive Constantine and councilmember McDermott ensuring that we're continuing The Sound Transit continues to evaluate cost savings opportunities bus integration and transfers and reducing Community impact perhaps by adjusting at station location to to address residential packs could continue. So since we're over I simply must leave a guy somewhere. I need an appointment to go to bed. I want to just entrust to be several dozen other West seattleites in his panel the opportunity carryforward some of the better ideas. I don't think we should continue studying the orange elevated line. I do think that we should keep an Avalon station in our study and not eliminated as was suggested by the stakeholder and some of the stakeholder advisory committee. I do think that we need ultimately to arrive at the junction and not very remote from The Junction that we need to arrive at 8. Underground alignment rather than above ground and that there are a lot of refinements still to be made but again, the principles of cost savings reducing impacts having excellent Transit environment and TOD potential are continue to be critical in in each of these segments to the issue was raised before Madam mayor of a single preferred preferred alignment or whether we have an alignment that is our current cost assumption one that we assume is going to cost more. I don't think we're at a design the design right now we can figure out what is going to cost more. I will cite the example the Roosevelt Station. Where were you able to move it in land put in a tunnel tunnel all the way to Northgate because we fought harder about it and figured out how to do it. And I think we're in that position here. There are dozens really there hundreds of decisions to be made all along this line and load. Turn them all into a single, you know blue line. For example insane. That's our preference is may be necessary and in certain ways for the constraints we have under under the law to to study for for environmental study was not realistically how in the end of citizens are going to get me they're going to get that meat station by station in street by Street all the way along the line and we need to leave ourselves the latitude to do that as we learn more through studying engineering. Thank you. I got to go. Diane I also want to be be clear. I also heard executive Constantine speak to a Yancy Avalon alignment with a Youngstown station. Yes noted. Thank you. Sag recommendations essentially recommendation for advancing the blue with the refinements in including the comments made by executive Constantine. No further study of the orange option keep the Avalon station and I heard him say also tunnel to the junction. So I think that if that sits well with the LG in terms of advancing the blue with the noted refinements and then I want to talk about the the read-option councilmember herbo. Thank you. So consistent with my earlier recommendation that we study the southern The More Southern Harbor Island Crossing in order to facilitate continued study of the the pigeon Ridge Tunnel and the most southern Delridge station. I would like to ensure that we continue Study consistent with the SAG recommendations number of groups and businesses and labor have written to us and support of continuing this the American waterways operators Harbor Island Machine Works a longshoreman local 19 East Alaska just Junction neighborhood Coalition West Seattle Transportation coalition to West Seattle train chamber in Northwest Port Alliance. I appreciate the concern around cost. I I do so to bristle at the at the one 1.1 billion dollar number because I think it's really important to consider that that actually includes the 700 million dollar Junction tunnel. So it's a it's in my mind. It's a 500 million dollar cost and it is a 500 billion dollar cost at I think really addresses one of the primary issues that we up for identified through our Rhett process. And that is that the the most southern version of us. Patient will most serve communities of color in low-income communities South in in Delray Beach in this allows us to to to do that bass tonight believe it's a good investment. other thoughts mayor durkan just moving to back to the little bit that I just want to thank the people who came from West Seattle to talk about what this impacts look like in a community and you know, I struck by the irony of here. We are a generation later tearing down the viaduct and yet we are now considering tunnels versus elevating the like and I just heard this all through all these things to not just look at Cost but what are the ongoing impacts to the fabric of communities? Thank you. IQ And council member harbold. I want to make sure you know what we've captured that in the notes and appreciate your input on that. Thank you very much. Councilmember Big Shots one quick final tonight. I want to acknowledge the neighbors and Delridge in particular. They invited all of us out to look at what the impact would be and consistent with what our marriage is described to have the high elevated going right over there right over their homes just strikes me as being something that is it's almost breathtaking to consider in as the sooner we can get rid of that particular option the better. Just. Thank the staff for great work and it's a gee and all the members of the public here. And as I said before and I really would like to see Seattle West Seattle Ballard have the absolute best system. They can I understand the in Paxton neighborhoods. I continue to be concerned that we need to start to identify as mechanisms for generating the additional Revenue that would be necessary for some of the options and I would guess I did encourage the city in the port and perhaps the county and others to convene some discussions on mad because those of us in the rest of the system The Sound Transit 3 package have our own parts of the system also that are all tied together in this one Financial package. And so we have an interest in at night night encouraging and helping any way to help to find those refine those mechanisms that might be available for some of these and you know, I get home I'd like a tunnel myself, but we just need to really get real about how we find those and restart refine that and it goes back to my comment about in Depot looking at the feasibility of a project like you would we still have a before you totally wrap up. We need to talk a little bit about the red line alignment. And so maybe let's do that. That's okay with that. Yeah, I think as the you know, the cost comprable alternative to the representative project and councilmember bagshot noting your interest in violation until I can come off a noted that are there other thoughts on on the red line. And can you as an LG recommend that that go forward as a cost comparative alternative? But maybe I can start with Framing and then we can get so stiff exam similar to what we did and Ballard. I've heard that everyone would much prefer to see a tunnel through the junction. Everyone would do that everywhere, but we know there is a likely to be a cost Delta between a tunnel and the represent of alignment and so in the interest of I assume the board will certainly want to study an alternative to a tunnel and is this group have a preference on what the hell turned it would look like what I've heard is people saying the orange elevated line to the junction is not a preference and would prefer that not to be studied and I believe some version of the representative read alignment with some may be changes. Maybe if we may want to make a recommendation not that that is preferred by any means but if we're going to study two options, which way should this would be at if you want to speak to what that a mix of of turns and twists that that would take that make sense. Your theme and red line to the junction approaching 41st 42nd that we staying right away to the best of best of our ability throughout that process and impart motivated by making sure that we're addressing a Mobility concerns making sure people can get from the station to the junction on California and Mobility not be hampered by those who have impairments by being too far away and particularly down hill. To the SAG and recommended that the red line turn South on Fauntleroy, which is a number of blocks away from kind of the heart of the junction. And so that they actually just at the point of clarification aside mate two steps in that area, but also looking an option that would essentially get closer to 40 first or the second square area and I want to be clear that I'm fine with both. I think there's value in life. Like we did and Ballard have a conversation about Fourteenth and Fifteenth and refine men's I think 41st free second and Fall Out Boy, I'm Ariel all have value to be studied in go forward. Call Jimmy at 1. Separate but related I concur with counseling McDermott on his his points, but I did want to flag my interest in at least exploring some of the benefits of Consolidated stations particularly as it relates to the cost and impact on ridership. I think it's it's worth taking more of a of a look at I'm not saying I want to study really getting rid of the Avalon station, but I would like to know more about the impacts on cost reductions in and and ridership impacts. Okay, we have that. Can we also make sure we talk about bus integration? Absolutely. So you've had a good discussion here and I don't think there's a clear answer in the west Seattle area and and Cahill's going to summarize that for us, but I think there are some options more on the table. One thing. I did hear pretty clearly as with orange should come off unless there's further discussion at this point. I'll just make this brief, but I wanted to go back to the doctor Somers Point about the funding issue and really kind of talk about the white elephant in the room and I realized that at this stage of most projects. We don't normally have to think about third-party funding options, but I actually think it's imperative that we start to think about that and I will offer up that the port will be happy to convene the city and the county to sit down and have some conversations about what those options might look like. I think it's unrealistic to Continue to move forward. We haven't taken much off the table today. In fact, you've added things on and so we can continue down this path, but the sound transit board is then going to be making the tough decisions about what's going to be moving forward and if we were all okay with the representative alignment and the cost structure around that we wouldn't be having this conversation. But we want the best alignment that we can have within the city of Seattle and it's likely to cost more and obviously I'm just stating the obvious but for some reason we've been avoiding that conversation so given the fact that the Port of Seattle is impacted at three major sections along the alignment. We have a lot that we could contribute whether it is Lands whether it is money potentially in it. Please make everybody make sure that you understand me. I'm not saying the port is contributing money. I'm one of five but I understand that I want to see the best alignment move forward that works for the maritime community in the community at large. So I'd be willing to have the port convene if the city and the county want to sit down at the table over there. Next few months to make recommendations to the board so we can have a gun a realistic conversation about how this goes as moving into the is process. Welcome your comments or support. I want to thank commissioner Bowman for the offer of the port realizing it be able to contribute to some of these third-party funding. I will say again and I'll tell put take my put on both my mayor in my sound transit board member had I think it is absolutely premature to talk about where funding is coming from until we know how much it's going to cost and what those various contributions may look like for example much further south in the system. We are going to be considering what the option should be for the maintenance facility. There's one option that would rely on Seattle City property that maybe could being kind it in some way. So we understand in the city of Seattle that if alignments are more than what a representative element would be we have to come up with a very strong funding package to do that and you have my word as mayor to There with the pork with the county. We've already begun those discussions, but I think it is premature to say here's where the money's coming from until we know what the money is. It is never been done in the history of this project. Some of that funding will come by way of additional staff services. So maybe come my rights-of-way somebody become a bland so may become a cash and maybe the federal government the state government the port & and the tribes as well. So I think that we really have to know what we're pricing before we say where the money's coming from, but you have my commitment commissioner bomanite everyone understands that there is a price to choices and as we further refine what this alignment looks like we are going to have to make those choices in the city of Seattle will stand and understand that if we want some alignment that is more expensive than a realistic and real price for the representative alignment. Then we're going to have to make some choices and we could have saving another junctures, you know, we may be Doing some parts of this alignment cheaper believe it or not that can happen. And if we do that then we want to have the benefit of those cost savings to use them in other places. So I completely Kirk here but I think that is premature and has never been done in a capital project of this size ever. The people are saying you got to tell me how you're going to pay for it before we even study it and just to be clear. I'm not saying that we should figure out all of the answers I'm saying that we should convene a working group to start thinking about it and with all due respect the port perhaps sometimes thinks of things differently because we frequently we use our public dollars, but we go to the private sector as well as we put together products. We need return on investment for a project. So we tend to look at things a little bit differently than a regular public agency that doesn't consider a return on investment. So again, we're just here to offering our help. We'd like to start earlier rather than later. Trying to make us as we go forward in the Depo process. We have to have a range of Alternatives that cover the bases. So we don't paint ourselves into a corner and that's it. But I've been very nervous about is if we only have high cost options in at the end of the day, that's what we've studied in the money doesn't come forward or they eat savings don't come forward then we're kind of stuck and so I don't want to cut off our options and I will continue to promote that we have a range of cost options. So that is the end of the day. We have an alternative we can adopt. Thanks. Thank you. I'd like to turn it over in these last few minutes that we have together. Turn it over to Cahill this kind of summarize what we've heard today for for you and what's going to go forward in terms of next steps. Yeah, I just picture your cap and the order discussion and need to pay area. We heard support for the tunnel on Fourteenth and Fifteenth support for the high fixed bridge and not support for the middle bridge and then write recommendation to let the board consider further whether or not to move forward with 20th tunnel idea Smith Cove looking at those gate around Prospect location to Blue underground downtown the 5th and Harrison alternative recognizing there's some work around the Westlake areas. Look at transfers in the CID area continue in that area moving forward in DeSoto area support for moving for the III a great option recognizing the need to look at E3 busway effects from Mars and bass in the Jason property owner effects in the duwamish area support for continuing to look at the south crossing recognizing that there may be a need to continue to look at the north crossing also. I'm a consideration of a for the board to consider whether or not to look at this modified this new idea. They can write it down. So that appear as similar to their conversation about it about the 20th power. I'm in Delray Beach support for the Pooh alternate but look in the refinements in that area to try and reduce neighbor to fax and Asher good quality plus red integration in that area and also some reason update Yancey Andover discussion with a potential Youngstown station again focused on the eight principles of trying to reduce communities facts and poop has red integration and then identify cost reductions and finally West Seattle continue to look at the blue tunnel and red modified. I sent you the sack recommendations in that area not support for the Orange Alternative enough support for advancing the Avalon station location and just continue to look at opportunities for cost reductions again in that area as well then bus registration. I'm pick up the next steps. I'll be very brief. As you know, these recommendations will go to the Sound Transit board to press pause the system expansion committee on May 9th. And as for the board on May 23rd after that as you all know, we'll be moving into environmental review process from 2019 to 2022 and from there to find sign a construction. I briefly just to give you a very quick sense of the environmental review schedule. We obviously go to the boredom and then we kicked off the is process will be sent you doing the construction engineering work through next year will be developing the drafty. I guess we'll also being X-Men gauging on station fun activities in our expectation at this point is to publish draft Eis and have another public comment. And late next year at which time to board with again be I asked to confirm or modify the fertile turned. Engagement during the alternate Spellman face has been really important and very useful to the team into the process as we go forward will continue to want to engage communities through the D is process the types of things that will be engaging with a community on our first reporting back on the alternate strautman process. And what made it through what the IRS process is and what to expect issues environmental justice station planning potential property in packs. Also when we have the DEA is evaluation results working through those with the community. And will continue to engage in a variety of forms. We've learned a lot over the last year, and it's really helped build a foundation for engagement through the Eis process. So everything's in meetings listening sessions the door to door Outreach the community Workshop pug meetings fairs and festivals online will continue to do those things to engage the community. Thank you. I was just confused. I know you all want to get out of here. I just to thank you for all of your hard work over the last year and for all the tea packet received today, and of course will be continue to engage actively with all of you moving forward. Two colleagues and staff and number of the public. Thank you all so much for this engagement. I want to just take one second here to frame up where I think we are there were some new ideas for today. I do think that we've done an amazing job collectively with a lot of community input to really narrow the refinements and I think we walk out of this with I hope the board hears Clarity of frankly a single alignment, they would achieve all of our goals but maybe with some Financial concerns and we've supported two Alternatives of one in the Ballard Inn West Seattle, that would hopefully be lower-cost depending on where that goes. Obviously there's a number of design refinements throughout that path. We've asked folks to look at and I think you have Clarity on some of the things that this group cares about but I'm really proud of what was accomplished and I really appreciate Sound Transit taking the voters sentiment seriously about how can we speed things up and move this long until this has been a new process and I appreciate that. Do you like the leadership group will cease to formally exist after this moment as will the stakeholder Advisory Group, I believe but I do think they've served at I will purpose and I think as we go to the IRS, I would ask that the parties involved consider considering a formal role for ongoing engagement from both community and elected leaders so that we don't feel like there's a two or three-year silent. Will the IRS is going on continue the discussions. I also want to just acknowledge what came up at the end of this discussion about third-party funding and I think there's a tension between some folks saying how can we even talked about funding until we know what the actual Bills going to be in others saying it's it's a we know there's going to be something that needs to be done. So let's start talking sooner. I think that it's appropriate. I think there's a weighted to achieve those goals and I would suggest what I think others have is is it high level we start convening some time to stations about at least the range of options and I fear being that if we get to the end of the process into the price tag, And then we have to start at multi-year funding conversation. We're talking about delay again. And so some way to carry on those conversations and parallel think will be important really appreciate a chance to coach her this so thanks for that opportunity with my colleague. Thank you cast member O'Brien and made a reference earlier about the highway is tweeting divides in our communities in the factory right now with the city finds herself staring down the viaduct. I think the work we have invested in here actually build communities together. We were recognized him sensitive points and don't have a single alternative. It wasn't an expectation that we have a single alternative today. And we've also identified some key work that needs to be done for particularly this neighborhood the Chinatown International District to make sure we are you needing and supporting this community? I think we've all done this work this body of work really well in my pleasure to coach her with council member Bryan. I want to think the public I want to thank the Stakeholder Advisory Group. I want to thank Sound Transit staff and my colleagues on the elected leaders group for working this process with us and for doing great work for our communities. Thank you. And with that we will be adjourned.", "end_time": 8900.7}]}