{"format": "raw", "annotations": [], "confidence": 0.9198990735140714, "data": [{"start_time": 0, "text": "distance to work last lifetime I can't hear me either. Thank you for being here the August 12th, 2019 city council meeting of the full city council will come to order its 2 p.m. Actually is 2:06 p.m. I brew Co present accounts with the clerk. Please call the roll O'Brien here eight presents to the council rules are silent on providing council members an option for dissipate and vote by electronic means for regular meetings for the city council a council member Gonzalez. OUC is is not here had previous commit commitments and is not able to be present physically here and has requested however an opportunity to participate in both until I'm after consideration of agenda item one or I should say for gin item number one on the reconsideration Constable 119551, which was vetoed by mayor durkan so after Federation of Virginia item one accounts my Gonzalez was excused absence will be a reinstated. So at this point I would like to make a motion to allow councilman Ricans Allah's to participate and vote and I will move a motion for council members to consider. That is my most heard of Representatives. all those in favor of the motion bow tie opposed the motion carries and counseling Gonzales will be participating in both until the conclusion of agenda item one. Now that I said all of that gobbledygook. Let's see if it's actually working customer and Gonzales. Are you able to hear us? and we are Okay, and the Beautiful audience could hear you as well. Thank you for participating at this point. If there is no objection the introduction and referral calendar will be adopted. You know Jackson today's introduction referral calendar is adopted and similarly if there's no objection stays agenda will be adopted. Turn objects in today's agenda is adopted. There no minutes for approval today. Have a ton of paperwork or just one moment presentations. I do not believe we have any presentations today. So this time will take public comment on items that appear on today's agenda the introduction or throw calendar or work program and tell the common is accepted for 20 minutes. We may and may be appropriate to extend it. What we're going to do. I think we have over 60 people to sign up to speak. I don't think we'll get you off 60, but we're going to take it down to 1 minutes over here as many people as possible. So get your notes ready to sleep for 1 minute and I do believe as is our practice. We do have a commissioner here is commissioner felleman here at this point he is and so we're going to start with commissioner Fred Feldman on an agenda item would love to hear from you and then we will go down at water with which people that signed up. So commissioner felon in the floor is yours, sir. All right. Well, we see if you could shoot for a minute. I think that we are aware of your written position and position is good. All right. Well, thank you, president and members of the council. I'm Port of Seattle commissioner Fred Feldman here on behalf of the Port of Seattle and pork Mission. I want to thank council members O'Brien and was scared of her personally for your action on at the planning land use and zoning committee last week to ensure that our docking Amendment before you today did not include the potential zoning Jane. Jizan industrial Lambs. I'm also here to lend her strong support for the amendment cancel. My bro. Brian has put forward the calls for the mayor to convene a bit panel charged with conducting a comprehensive review of the industrial lands across the city. There's so many competing demands of the city Imports mini Twitter Jason to working waterfronts these properties provide diverse economic opportunities for a growing city the value of which cannot be viewed in a piecemeal fashion. Also provide opportunities for like 45 Tent City at soboda and Duffy sort of land deals need to be conducted in a comprehensive fashion. We appreciate the resolution being put forward by counselor O'Brien today setting aggressive goals to combat climate change to an equity lens upon election to the charge of the energy and sustainability committee. And we also appreciate the support of the effort to the port to of the council to address this to an equity lens and the most disproportionately impact on communities. In fact, I invite you to attend tomorrow's introduction of a book te quisiera our new Equity diversity and inclusion a staff member at the port and I'm sorry. I took this long but if your attention I really do appreciate the leadership you've all shown Thank you. Thank you commissioner Feldman. And Christian Feldman did demonstrate to all of us how tough it is to try to get into a minute that I have faith we could do this. I have faith. So I have faith in Carlisle Alex balls. You are first and Mark Hannon you are second again commission filament. Thank you for those words. Afternoon, I'm here in support of the green new deal as expressed by acacio Cortez at Marquee as I believe. It represents the best science we have available just report 1.5 degrees warning this morning council member must get it. I believe you referred to and move to make put Seattle City Light under the energy imbalance Market as part of the green New Deal. It is not on June 20th 2017 spot prices for electricity in California Rose to over $300 per megawatt-hour that's Ten Years After and run Seattle City Light management cannot be alleviated by ratepayers for the green New Deal to serve more people more jobs. We can't let the horse out of the barn. We need a condition to track carbon and greenhouse gas prices before we enter the energy imbalance Market. Thank you. Thank you, sir. Following Mark. I'll call three three members. I just just one moment Mark a Kathy Dawson and Johnny fitcrew Mark Kathy and Johnny and we could use this my mic over here. I Kathy. I'm markkanen author of the status quo is death four years ago. I advocated here for sending Seattle's elephants the sanctuary. Well, I was right now one of those elephants is dead the other one suffers in a cruel Oklahoma cage. I'm here today for the trees and the green New Deal. Please don't compromise Our Lives global warming threatens and more Corporation pollution will do mice like the elephants you can be as green as we want because corporations will come here anyway, because the rest of the country is flooding or drying up don't compromise our lives in 20 years ago. We were one of the few places in United States able to grow food. We must stop all the pollution because reducing it is really adding more poison. We need the green new deal because without it the ones to suffer and die young won't only be Seattle's elephants. It'll be you me and everybody in this room and all our children. Don't compromise Our Lives don't compromise Our Lives don't compromise Our Lives. Oops there honorable council members on Kathy Dawson a program assistant at Earth Ministry a Statewide faith-based movement for earthcare face values motivate our support of the Seattle Green New Deal resolution before you today values that include the inherent worth of every person love as the basis of justice and care of the Earth as a primary duty of all people. We aren't you to pass the resolution resolution and take the next necessary logical moral step towards Seattle showing cities around the world how to reduce the how to reverse the 70% of climate change that cities like ours cause thank you. Thank you. Johnny for you, begin to start clock head after Johnny B, Robin Schwartz Johnny Mal and Margaret Mitchell be robbing Johnny and Margaret. Hey council member is my name is Johnny sticker when I'm an organizer with got green Seattle for a green New Deal campaign. Point Blank. I'm here to say that we support the green new deal because it's the right thing to do. We know what we're up against we know it's scary. And so we need to take these situations when he does like take drastic action for a better world a better world is possible and we know that all this community is like care and importance and so we're here to support the green New Deal. I think so. My name is Robin Schwartz. Thanks for giving me this opportunity. Is it conquered qualify for free and reduced lunch and South Park and especially Georgetown have few grocery options that are not well served by public transportation. I'm sure you saw the news today about the public charge rule. I anticipate that having a negative effect on immigrant and Refugee kids in South Park. This is a big concern for us as well coming from a community with a high proportion of people of color and people living on low incomes. We are worried about environmental degradation and the effects of climate change. I strongly support the green New Deal and the food Justice component is crucial this resolution could be life-altering for my community. I already deposit and to ensure that it is community-led. Thank you, brother. Hello Margaret Mitchell and I'm a member of the Washington physicians for social responsibility and the climate in health task force. We agree with the World Health Association that climate change is our greatest Health Challenge and we've been joined with 73 other health associations in a call to action on our climate emergency. We need to take bold steps because what we've done so far is not nearly enough in our missions keep Rising. We have a report available online fracked gas infrastructure, which has background details in the city of Berkeley has a new ordinance require all new buildings get heat and power from electricity gas has climate effects, including indoor air pollution with nitrogen oxide carbon monoxide, but we need to build with all electric and renewable resources and the technology for Electricity has greatly improved and it will greatly improve our health. Thank you. Greetings and good afternoon. My name is Johnny. I'm an organizer with. Green staring to me the color in the grey movements. I live in Lake City. And so today I want to speak and supports the green New Deal resolution and I want to speak to you they can I like benefits of the green New Deal. The city has actually done already done his research office environments reports on the topic. And so the green New Deal the green economy is 500 billion dollar industry and with intentional policy starting here. We can drink cost Savings in the trillions of dollars and and so that end and start only is the green New Deal. ER Energy Propane, it's a good idea to save our planet and everyone living in its but it's also a good idea for the city of Seattle and that comes greater efficiency and market efficiency comes with more bang for the buck. And so that means we can establish ourselves as a global leader in climate change Solutions. How does that sound? Thank you very much where the hell would go towards equity. And that is opportunity to put our money where your mouth is. If we try by the investing in environments, then we should care about the people living in it. Thanks for coming. The next three speakers are Ann Marie Dooley if you take them any Mike and Pauly G would be next and then Emma Nixon. Anne-Marie Pieology and Emma I'm Emory Dooley and I'm here again with Washington physicians for social responsibility of the first weekend of August. I spend 80 hours covering the hospital and 1/2 a.m. Phone call. I got was a man his lungs were filled with fluid know that I can fix. What I can't fix is the person who comes in his lungs are filled with Wildfire smoke or the fifty-year-old. His lungs are damaged from chronic indoor and outdoor air pollution, but you can you can set policy that benefits all of Seattle and not just those people with money for too long private money has dominated public policy with arguments that somehow I kind of policy costs too much but the cost we're looking at our climate fuel Public Health crisis that will affect everyone in this room. But here's the good news. We invent things in Seattle. We invented medic one, which is a publicly funded emergency response system, which I trained as a medic one dock. We need a publicly-funded green New Deal that cleans our air of fossil fuels and set Seattle up as a leader again. In a climate policy that actually saves lives like Medic One. Thank you. Call spaology is Pagliacci here. If not to move to Emma Nixon. These are my kids. This is Rowland and Wallace. Therefore and 1 years old. I'm speaking for myself, but I'm also speaking for a group of more than two hundred families in the Seattle area. We call ourselves green families cuz we're trying to do anything. We can is individuals to live Greener and save the planet but it's completely obvious that there's nothing that we can do as individuals to save our kids lives. We are terrified that they will die and honestly an early and terrible tragic death because of the impact that we as humans have on our environment and the destruction of our environment we need to do something drastic need to do something now you guys have in your power to do something drastic you guys have in your power to do something now, and I please help that you will for the sake of all of our children. Thank you so much. Alina Perez flow and then Arista Chen Elena flow and Arista Elena hair and after a wrist is Randy Gustafson. Hello, my name is Elena Perez representing Puget Sound sage and support for Seattle Green New Deal. And also the green janitor pilot program on climate justice has not yet reached those most impacted by climate change residence of South Park in Georgetown have an expected life span that is 8 years shorter than the average Seattle resident and 58% of the people living within a mile of the lower duwamish Superfund boundary are people of color bypassing Seattle Green New Deal. Our city can be a model for how we transition our economy of Industries walk in French. And we can do it in a way that lifts up the rights of workers to fair safe and healthy workplaces through voice on the job in a real pass to join and organizing Union. We can ensure a just transition for workers who are currently in the fossil fuel industry and dedicate resources to the green. Janitor pilot program is also an important step in this direction. Just ask that you please support both. Thank you. My name is Florence some also go by Flo. I work at Rainier Valley Corps on the green Pathways fellowship program manager. Y'all have already done some good work in terms of endorsing the green pass a resolution and giving funding for entry-level living wage job and here is just to really endorse the green New Deal and just to continue to invest in the economy of workers, right? We need living wage drops continue to do the good work that we are doing here and how that could also have a Rippling effects to our community. If they have the resources they can to make right decisions and to contribute to a green economy right until I'm fully endorsed at and continue to do that could work. Mr. Chen, Randy Gustafson and Tamika Thompson. Highest city council. My name is Arista check organizing director of this organization led by youth of color in South Seattle and South King County New Deal and to advocate for keeping the sweetened beverage tax money in the SBC fines as community members and food Justice Advocates. We've been part of the community process and listening sessions for the sweetened beverage tax advocating for the systemic food Justice changes. We want this money to be used for in our communities. One of the main reasons. Our community has voted to pass this tax money would go back into our communities taken that excess money and putting into General funding completely undercuts the purpose and the Integrity of this tax and our communities are not having to fight for the money that is rightfully ours. In fact in the community process meeting we were asked to narrow and cut our priorities for this money drastically based on the idea that there wouldn't be enough money to fund all the systemic Solutions. We need is extra money should be put towards funding other changes. We wanted and were forced to cut for my list of priorities has argued that she and other social social services like Meals on Wheels that are supported by the general science, but this strategy trying to pit long-term social service providers against food access workers who received money from the sweetened beverage tax is not going to work and Social Services doing important work to be funded and that doesn't get to come from SVT many. You need to find the money to keep finding her general fund Services. It was in the last year away from a community work because you're showing a bad example of an effective. You said Shore Community not going to have you removed and I got to speak over you. Scanner for Mac. Okay. and I would ask you should be a spiritual please. I got to be consistent on the rules. Thank you. Please proceed. Randy I don't think I have to actually agree with everything. She said, however it just making it up Sean the content. I'm trying to keep order. We have 65 people and their everyone does that we're going to cut it down to 20. Your point has been made. I think she actually doesn't mind leaving so she's if he I understand your request you can make a formal motion if you want. I have zero desire to have you leave. You just spoke not be removed from chambers actually is exempt from the motion. I misspoke is actually within my purview. I'm not trying to embarrass you, but I would ask you let me speak. Please. Feel free to stay. Okay, feel free to stay but I will I will say I will say to someone is. Been in the City of Poughkeepsie. This is I'm fairly collegial and kind when I try to share these meetings, but we've had bad people say bad things and I tried as if good Peter Singer think I just try to stay consistent in the rules. And so I hope you at least respect that it has nothing to do with the person or the content, but I would actually respect the rules and so with that I'm asking everyone to comply with the 1 minutes. Thank you very much and quite frankly Commissioners felleman. That's why I started off with trying to make sure that that was in order to I love the grandstand to be everyone's hero and let it won't stay too, but that's just not going to happen. Please proceed. Hello, my name is Randy got some sand and I'm not undaunted by the all of that kind of scared though. I did bring a prop. I was a worked for the Seattle Metro on the streetcar for 11 years just retired and I want to talk about the one of the worst decisions for its crust. It was passing back in 1968. But General Motors didn't want Rail and Bellevue developer did not want all the real going over to Seattle. So they mounted a program and it lost but we are still paying for basically, actually, I should mention that when this Seattle Center connector. Whatever was first brought forth. I was against it. I came here and spoke against it. But now that I understand more about it. I know I bet it's an urban circulator and that it is up on the surface street instead of below Street. I think it's much better than I originally thought I I chose. I changed my mind and I think you guys can too. Good afternoon. My name is Tameka Thompson. And then I am the food access organizer. I got green. I am here in support of your vote to override the mayor's retail to create a separate fun for SPD Revenue. This tax was implemented to prevent childhood obesity and diabetes and impacts low-income communities of color the most organizations volunteer door not to form Seattle residents that this tax is not regressive due to the fact that the revenue would be redirected to them by way of healthy food and early learning programs. When a portion of the revenue was put into General funds last year. Not only did it challenge our accountability but it also limited the ability to feel the need of healthy food for so many families in Seattle. The fresh box program is amazing and it's helping so many families yet. There is still a waiting list of over 3,500 individuals. The waitlist has to be closed. Down after 1 week, and I'm going to stop there. Waller or wallow Lenoir Waller just as well and John-John. Are you here? And it's John makes his way Zoe Sherman Zoe Sherman could use the next Mike and then Isabel Sherry so you got John Zoe and Isabella. Hello, my name is John Waller on the secretary of the CSO Cuba friendship committee and speaking in support of council member of skaters resolution en Cuba a similar resolution against the US embargo on Cuba has been passing at 12 cities in the US and it's going to come to a number of the city's major city has 3/7 this resolution benefits Cuban people. That's the main reason for the benefit of u.s. People. It wasn't able to freely travel to Cuba allowed to trade agriculture sales Cuba. But also enable you to purchase some of the advanced medicine treatment of taking so long to answer against diabetes that cures developed. I'm finally this policy has been condemned buy and relation countries in the UN General Assembly mission is it's a place of Total Insanity. I noticed that wind engage Cuba a US Democratic candidates for the president was I supported normalization of relations 25 as a 26 patient relations. Thank you. Hi, my name is Zoe Sherman, and we need you to support the Seattle Green New Deal My Generation. We future generations to the Future No, we need to see zero emissions by 2030. I know that we need to be able to exercise our rights to breathe clean air and drink some water. I am going to need clean land to grow my food on. I want my children to be able to experience the joys of life. I want them to be able to see the stars and be able to go outside without a mask. I don't want them to have to give up their childhood to fight the climate crisis. Do you want that for your children? I know I won't get all of this. But you have some of the power to decide how much I'm doing this for my children for my family for the city. I want to live in with them. Will you help us? Will you fully fund and Implement effective climate policy at a Seattle Green New Deal? I believe that we should take responsibility for our actions. I made a mistake on Friday and intend to make it right. Can you implement effective climate policy and help us make this right? Hello honorable councilman and councilwoman. Thank you for your service. My name is Isabella in Seattle. I'm 16 years old filled with anxiety terrified with regards to how we will all survive on this planet to make immediate Jurassic climb action. I'll be trying to bring children into this world will be irreversible. 20/30 as any official around this world largest genocide in history has to do their part in Saving this Earth our only home. So if you do as a fellow human Make the city green. Don't just pass but find an Implement serious climate action. Now we're out of time. We deserve a future is time to work together hand-in-hand and support Seattle's green new deal. Thank you. John 10 minutes pass or a lot of time for public comment. We listen to 18 speakers. There's no objection all extended for another. I did a sure the audience. I don't feel get to 60, but if there's no objection will continue and listen to some more speakers. CB injection, so we'll start with number 19 B Elliott. and then following the Elliot is Beck's lips. Erika Linder the next six people on the list after me were part of a group called The People's Echo and we decided to combine our time here to share something special with all of you beatbox, Erica Alex Brody and Eric those that folks. Got you. Thank you very much. Seattle astrology housing for all can you be my friend? Remny, is it Rim knee reaping to raging grannies? Am I saying it right? The first time I said, I got the ant to raging grannies. Is it from Romney? Yeah, so we're kind of on the other side of the life cycle hear from an Aldis. We want to say we're on the right side of history and we know about history. Okay, I'm on Fox with this with wind and solar will pay the way the green New Deal will make the day corporate polluters will have to pay to see you in another way. So Dre say and Ali vekic Dre say and Ali vekic. please hello council members. I'm here. I'd like to speak my house. Seattle needs a green New Deal based on my specific experience because over 200 youth Alders and workers in the International District. We need a green New Deal and not just gradual legislation based on my conversation research. The major issues in the International District include pollution from I-5 and I-90 hundreds of thousands of cars everyday pollution from major polluters and Soto including the biggest one in Seattle lack of Green Space, the biggest Green Space 1.7 acres and biggest of all, I think whenever I speak to me is gentrification and displacement a lot of Elders in commas around 7 or $50 a month from the government and they cannot afford it supposed to be low income apartments being built in International District. That's why we need big systemic changes. We need air Cooling and filtering centers. We need low income housing weenie. Free public transit and we need education and green jobs. Thank you. My name is Ali Beckett representing ILWU Local 19. I'm a dock worker in the part of Seattle. Thank U members of the council for allowing time for comment on the comprehensive plan. Getting legislation. I speak in support of resolution 31896 which would allow for a study of our City's Maritime and Industrial lands for pursuing any removal of land Parcels from the manufacturing industrial center overlay? I would like to thank Michael Brian and Teresa Mascota in particular for their work in putting together this resolution these lands support 1/6 of the jobs in our city which pay 20% more than the median wage of Seattle. 70% of these jobs. Do not require a college degree jobs in the maritime industry support the missing middle incomes, which enable people to be able to afford to live in the city in which they work. Our Union is committed to these discussions so that way we may keep good union jobs in our city while recognizing the land use demands of a growing city. Thank you. A council member Larry Gossett King County council member Larry Gossett, I believe you were here and I believe Cindy Domingo was here as well to testify on an issue with walking me up at this point that I presume the back. Now just so you know before we get started, I'm Public Enemy Number One because I'm trying to keep it down to a minute, but I've been pretty flexible on that one minute. So do what you can and Lissa and we love to hear from you. Thank you very much. Thank you very much. Share Harrell. I appreciate having the opportunity appreciate being called up early. I understand the time limit the main thing that I like to say. I need to stay up front. I'm hopeful that the Sea Isle City Council passes this new Seattle Green new deal, but I'm here to tell you what the County Council returned from its recess in a week or two. I'm putting together legislation. They have a Martin Luther King jr. County Green, New Deal. And I couldn't before the members of the King County Council. I just want to respectfully say I hope the city council do consideration their if y'all pass it. It'll be a great foundation for me to pick it up and spread it throughout the entire thing, Cancel. King County bass moratorium on fossil fuel infrastructure travel and development, but this is much broader. This is much bigger. They took into consideration of impact on workers keeping wages hot involving people of color. So I'm definitely on board for this whole issue. Thank you very much. I'm texting. First I want to thank councilmember Teresa Mosqueda for sponsoring the resolution to lift the blockade against Cuba that the United States has had in place for 60 years. And as well as her father and mother Larry and Patty mosquito who traveled with me on my last delegation and brought this idea to the council member. I'm sorry that they couldn't be here to testify on behalf of this resolution since 1999. And as a person who cares about people with me to Cuba what has driven me to buy commitment to bring people to Cuba was the commitment of the Cuban government and the Cuban women to push for that women's rights agenda which has an able to achieve higher status in their society and just 60 years women's rights are embedded in the Cuban Constitution Article 44 quote the steak and cheese women the same opportunities and pause. ability says women as men in order to achieve women's full participation in the development of its country and as a result of that Cuban women in 2017 represented 66.8% of the professional and intermediate level technical jobs, 68% of the University students 81% of the students were women in Cuba, right sir Place worldwide for the highest percentage of women members in Parliament with 48.6% us ranks 80 Last Light today you are hoping to wrap up Cindy, but but but rapidly has been at the Forefront of the battle against climate change. I hope you will pass this resolution. We have much to learn from Cuba and exchanging visits from both of our countries. Imogene Williams Genie cover cover letter check and Matt remley Imaging Genie and Matt. My grandson and his family live downstairs little girl is sick. She can read really well. The little boy is 1 and 1/2. I gave me a name because me mammal. They got me a button. It has a picture of Ruth Bader Ginsburg and it says his scent. We love our kids, but our love is tested by the realities of climate change. city council District 3 Sharma sawant has been saying that the green New Deal is imperative. And it is because we have to be fossil fuel free by 2030. fossil fuel free My name is Jenny falchuk and the communications director for the alliance for Pioneer Square. We manage the business Improvement area and represent over 850 businesses. I'm here today to ask you to report to Center City Connector with an ever-changing City landscape. There are changing Transportation needs Pioneer Square in the surrounding. Neighborhoods need an efficient reliable environmentally friendly mass transit option connecting existing streetcar lines will give us a zero Mission downtown circulator that completes this network and allows thousands of people to get around our city efficiently, please support this project. Thank you to Before you begin any called Terry. Flynn and Claire Richards I'm talking puppy chantay Western. That you was at the law. Why can't I want to talk to match your pillow? That's okay Sheila wakan-tanka Leon Chima call. My name is Matt remley Lakota a resident of Beacon Hill, and I would like to first thank councilmember O'Brien and his staff for the work on the green New Deal and bringing together all folks over the past couple months to really bring some powerful things into this resolution expressing my support for it and encouraging the council to take bold actions to be fossil-fuel-free by 2030 and a following up on that bull of those bold statement with board action in ensuring that Seattle becomes a leader in addressing climate change. Thank you for your time. Thank you email President are all members of the Council on Cherry fin. I'm board member of the Washington Washington Federation for maritime services, and I am here to support the recommendations of the planning land use and zoning committee to withdraw the withdraw the proposed amendment to impose a stadium District in the comp plan. And also to remove three other Parcels from the manufacturing and Industrial designation. I want to thank directly council members O'Brien and musk Twitter for helping to pass that from committee and we really hope that the full Council will support a call upon the mayor to I have a comprehensive review and study of industrial lands as part of the overall comp plan review process. We need much more detail about the benefits. Industrial area is function and the different Industries involved. Thank you very much. Thank you. Miss Claire Richards, and I was here on Friday and I choked up crying and this time I'm A Little Bit Stronger. And this is him. I thought you know, I'd share his picture with you because he's not here right now. I am a Scientist. I'm an earth scientist and I might have heard about climate change since I've heard about climate change my whole life, but I did not realize it was going to come so soon and it is happening right now faster than scientist ever predicted the fires and smoke events will only increase in their frequency in their duration and affect the way our children's lungs develop the course of their lifetime. We have a narrow window in which we can change. This is a picture of my son picking tomatoes. And if we do not change climate change is affecting our the bees that they are going extinct and if we do not have these we will not be able to live because we need bees in order to grow tomatoes or any other kind of food source, and we need plants in order to slow climate change down Thank you Claire. Alex cotton-rich We'll get our vows and Jolie Simone Barca Alex. Rich and chole. Good afternoon city council. If you remember on June 25th at you all signed on to the Seattle for a green New Deal Community endorsement letter and recognizing that anything I could see and my minutes is going to be nothing compared to what we've heard from many people. I already today and I'm certainly not going to sing. I'm just going to read the names of many of the other community leaders that have endorsed at Seattle for a green new deal and include an organization's Cochran El Centro De La Raza the tenants Union of Washington win Wing Luke Museum of the Asian Pacific American Museum and modules cat talks family of color Seattle the League of Women Voters Seattle King County chapter Washington physicians for social responsibility the Washington Healthcare Alliance the Rainier Valley carbs real change Nicholasville talks to Delridge neighborhood Development Association women's rights legal voice disability rights Brooke Eden writes the West Seattle helpline major labor unions like seiu775 SEIU 6 UFCW 21, UAW 4121. Aw, 1981 who collectively represent Tens of thousands of workers made your voice Coalition xerath Ministry V Action Network. I'm only about a tenth of my way through this list, but I've seen my time is already. Thank you. The parable of the Good Samaritan was told an answer to a lawyer's question who is my neighbor? It destroys our way of drawing lines and seeing everyone inside. The line is my neighbor, but those outside I don't have to be concerned about I can't say because I live in Wallingford. I'm not concerned about people living in South Park and Georgetown whose life expectancy is 8 years old that's in part due to climate pollution. The Good Samaritan didn't calculate how much money is active. It's helping would cost him. He paid The Innkeeper and said if it were more expenses you would pay them all so there's going to be a lot of pushback from people who don't want to pay to address a problem. They helped to create make them pay in an equitable way. Tell all your answers its own question, you knows what's right knowing is not enough. Jesus said to him go and do you know a small solution won't fix a big problem ending Seattle climate pollution by 2030 is a solution that is big enough to match the scale of the problem go and do Hello, my name is Joey Simone barga, and I am 14 years old. I'm a weekly climate Striker with Friday's for future Seattle and a city Washington youth climate strike. I support the Seattle Green New Deal needs help for my future because of the capacitor Green New Deal would be a step in the right direction with many clean. Green livable wage jobs and everyone having the access to clean water clean air and healthy environment. This is what my generation and everyone in the city needs. I hope you all support the Seattle Green New Deal resolution. Thank you. Thank you. David Mendoza is next. David's going to be followed by Matt Haney and then Gunnison. Afternoon. My name is David Mendoza and legislative government Affairs director at front and centered. We are Statewide Coalition of 60 communities of organizations and groups rooted in economic and racial Justice that have a picture Statewide Revival Justice policies. I am here representing friend centered and strong support of the green New Deal for Seattle. City of Seattle can be a leader in adopting a green New Deal and helped push her County like it already seems to be doing state and federal governments to join us in this effer addressing climate change requires ambition broadscope encompasses every major source of Admissions and knead bread that patient while providing solutions to these problems that improve health and well-being of those most vulnerable to climate change and pollution this resolution by covering building Transportation food water job creation, quality is the needed comprehensive roach. This crisis needs this resolution is a vital for steps. I want to thank you for listening in Pocket communities in putting this resolution Ford Edge all your support and we look forward to working with our member organizations and you and we making this rally. Thank you. Good morning. Council members Matt Haney SEIU 6 Property Services Northwest. I'm here to testify in support of the green Jenner's education program budget amendment janitors want to be a part of the solution addressing global warming janitors are in 95% of Seattle's large commercial office building. These are the same buildings targeted in the Seattle climate action plan with goals of reducing greenhouse gases landfill waste and water usage of our commercial Office Buildings are janitors are in a unique position to identify an address a lot of the low-hanging fruit Pacific each building help us reach our climate climate goals and property managers labor environmental and Community organizations, and hopefully our local government are all collaborating on the green Banner education program and we are optimistic brain similar success 6% My name is Lazaro Pizza on Metropolitan building service for more than 15 years. I support program for taking care of the environment as well as my building. We went to work. We want to do work that next The Heirs of the year for a great green energy goals Pastor, please support program that will benefit everyone. Thank you. Vandana Whitney Ingrid Elliott and Harry cutts. Bandana Ingrid and Harry So, my name is Fontana Whitney. I'm a member of Seattle 350 and this year I Club ideally the green New Deal would be a federal program federally funded implemented at the state and local level. And it's not completely out of the question that we might get that kind of leadership at the national level in the next election cycle, or maybe the one following. At this point we obviously can't hold for significant Federal funding. So it is a tremendous challenge to find a green New Deal at the local level as we are asking the council to do but my point is this every time a city like Seattle makes a commitment to the green New Deal. It has a catalyzing effect on other cities, which will also create momentum that we need to push this political activity at the national level. Our goal is to do the best we can at the local level, but never lose sight that we are just part of a much larger Vision. Thank you. Is Ingrid here? Thank you. My name is Ingrid Elliott, and I'm a Seattle mom. I'm here because I want grandchildren. We know that we have until 2030 to change the trajectory of climate change 2030 is when my oldest son Avi would be 30 years old. He says this is when he would think about having children, but if climate change isn't under control by then he shares the anxiety of the kids we've heard today and he says he won't have kids if he doesn't feel that he will be bringing them into a safe future. I'm grateful that this the Seattle City council has endorsed the green New Deal and I would urge you to adopt a green New Deal resolution and make that beautiful endorsement letter from June official. I would also urge you in the coming months to make effective and significant action towards making the green New Deal not just a beautiful idea. But reality the first step should be to do no new harm. We must stop are growing Admissions and I would urge you to follow the example of King County which is band all new fossil fuel infrastructure projects. And I claim the city of Berkeley which has band fossil fuel in new buildings in Seattle can do the same. Thank you. Harry Katz Stacy Zane and Mark Baskin that will conclude our fourth page Harry Stacy and Mark Baskin 41 42 and 43 Hello, hello councilmembers. Thank you for your time. My name is Harry Katz, and I'm representing Sunrise movement Seattle a group that organizes young people to take action for the green new deal. I'm here today because I don't want fossil fuel air pollution to shorten my life or anyone else's life, and I Know It shortens many people's lives every year young people want a livable future for all and that's why we support Seattle's Green New Deal. We are so inspired by the Seattle Green New Deal campaign, and we hope Seattle will inspire other places around the world to listen to the leadership of Frontline communities prioritize racial and economic Justice and eliminate pollution as soon as possible. Thank you. Thank you. Where was Martha Baskin before you and you can proceed but is it I think it's Steve Steve Steve Steve than Martha. My name is Steve Zemke. I'm chair friends of Seattle's Urban Forest. We want to say that we strongly support the green New Deal. We have a climate crisis. It's not a climate change issue anymore. You want to thank the console for moving forward on this legislation as well as their commitment to moving forward and updating the Seattle tree protection ordinance. This is long overdue by 10 years. We can't make the problem worse by letting trees be removed and not be replaced the same time or trying to do the green New Deal. They have to go together. These are complementary issues. So we support the urban forestry commission draft. We urge you to refer to an actress at the soon as possible that you can the whole idea with 3 replacement required when developers move trees for instances that they can be planted in other places in the city that now have health problems like in South Park like the duwamish valley etcetera. This is a racial and race and social Jack with a social justice issue and bypassing the tree ordinance you can assist in this green New Deal effort. Thank you. My voice to this effort to save our trees. I'm here to support the green New Deal and encourage city council members and all those work so hard for you to also include strong language to protect Urban treez their importance in a changing climate at a public health and well-being should be self-evident but increasing development is seen a rapid loss of Grease green canopy on residential lot especially housing in trees should not be incompatible. But often they are the sacrificial lamb as a member of the recently-formed haircut Seattle, I urge the council to not only past yells new green deal green new deal. But in that a draft pre ordinance protection now of the draft was presented to the council and the mayor back in June, but we understand that it is stalled and that is tragic. I respectively request the council to take action on behalf of trees those silent living creatures. Which any successful Green New Deal depends on thank you so much. List about 45 public comments we do here but come in a testimony it committee as well. So unless your subjects I'm going to go to the gym about a lot of work to do on the agenda. And we want to thank everyone for your test. When are good. We can't get through all the names that we try to do as best we could so having said that please read the title of the payment of bills section so we can move on with our agenda. Cancel 1 19605 Aberdeen Lane to pay Sergeant claims for the week of July 29th, 2018 through August 2nd, 2018 and ordering the payment thereof 19605 removed and second of the bill pass or any comments. Please call the roll on the passage of the bill. herbal, Juarez Mascota O'Brien president Please read agenda item number one creating a fun for sweetened beverage tax revenues out of a new section 5.53 point zero 55 in Seattle municipal code in providing additional guidelines for expending proceeds pants by the city council on July 22nd, 2018 and video by the Maron August 2nd 2018. Thank you parent with me for one moment he rhyme. I'm calling up the motion to reconsider the passage of council Bill one 19551 as amended. It doesn't require a motion, but we will no doubt have some discussion. The reconsideration is Bill as amended is now pending before the council and I will call for comments just too worried about the procedurally sort of what we're doing as many of you know. The council passed some legislation relative the sweetened beverage tax. It has been vetoed by the mayor which then requires that between 5 and then at least 30 days. We reconsider the boat and we are we can legally change our Vote or we can restate. We can vote as we did on the record for the first proceeding and Seed are reasons that the factual basis for not required to but you may want to make sure you have a record. So at this point, I think we all understand what's before us. This will require just so the public knows a two-thirds vote to pass and other words six votes the law remains in effect and council members are free to Porsche boat Chevrolet. They would like so who would like to speak on the The possible Vito Vito in the reconsideration and now we could take the timer. Okay, but anyone like to start off Teresa message counselor mosquito, would you like to start to chime in first and I'm sure that will have other people who will comment similarly. I am extremely disappointed that we are here today. I'm extremely disappointed that again we have to have this conversation about how we will not engage in an austerity budget or those who are house versus unhouse talking about the very core Services of government has core Services of government should be coming from the general fund pass this test. After initially when the council courageously step forward and put forward a tax on sugary sweetened beverages. They did so in an intentional and thoughtful way including communities of color including those most harm by the targeting of soda companies including a conscious analysis of how to make sure that we kept workers hole and that as the tax was implemented those dollars went back into the very communities that were being taxed this effort to try to put one of us against another one of us in the community is part of why we are standing strong to stand up against this veto today. Mr. President. I'm going to be supporting the council in its original language that it brought forward to make sure that we are not replacing general fund dollars with soda tax dollars the soda tax Public Health intervention. It was always a bill to be a public health harm reduction strategy not to foot the bill for General government. So today mr. President. In solidarity with a public health Advocates who recognized that we need to reduce consumption of sugary sweet and beverage with the voters who knew that we were having a regressive tax but doing so in a way to be intentional to get money back into the very communities that were being harmed by high sugar sweetened Beverages and to also recognized that yes consumption has not decline because we don't have those dollars in hand and have not directed them to the educational program to the Early Learning programs to the programs that ensure that there's more than just high so high carb high fat food in our communities and we need access to fruits and vegetables and healthy foods. And then we need Community Gardens and we need Community Education Program these others were intended to do in addition to making sure that we supported Early Learning programs home visiting programs food assistance programs. I do believe that we should do both we can do The sugary sweet and tax beverage was sorry. The tax was never intended to pad in the pockets of our budget overall and instead needs to go back into the very communities that supported us to be going with so as a public health Advocate as a champion to make sure that we're investing in our earliest Learners as someone who wants to see our communities become healthier and Greener and we need to be true to what we promised to the voters. And that was that this money would be walled-off and intentionally directed to those who are hard consuming sugar-sweetened beverages that highest rates and we would do is consumption overall to create healthier communities across the board is our president. I'll be supporting our initial bill. Councilmember Gonzales. I'm speaking directly to you at this point. I could not see if you raise your hand when I asked if anyone wanted to speak but I will say that a few member be members of the council like to speak but maybe it'd be appropriate for you to say a few words initially and then I could recognize people here physically or would you like to wait in and for me to recognize others first? I don't have any more of those reasons and I look forward to having an opportunity. So when and if we called roll on the stove after you hear few opinions, I'll just come back to you again just in the rear end just in case you want to say something. I'll try to give you another option and thank you catch Frank Gonzalez for that and who would like to speak next. Book I see when you're looking at me. I'm sorry. I didn't say I don't want to speak but I would like to hear from them first before I go. Well, I understand if possible but every member duly elected mayor speak as they would and I'll just recognize you as I see Hands cast from Bradley this year and next. I believe I can also be briefed that spoke to this numerous times and I think counselor miss keita. You said it very eloquently and I fully support everything you said and will be voting on the support of the legislation to override The veto Thank you. I'm going to typically in historically practice and I think I'm quitting the Robinhood Churchill's go first, but last time everyone spoke my daughter was there and she said don't say anything bad so I didn't get a chance to say anything. I just want to say something very quickly and then I will see you once you close to bake. I'm certainly overriding The veto and Ferb for these reasons. It was very simple that when we as a council created this Revenue stream, white and quite honestly, I was against this tax. It was very regressive tax. I thought that black and brown communities with suffer the most and I'd be convinced as to why this made why this makes sense from an investment strategy and send me the same faces that I'm looking at now convinced me that this Revenue stream for the long-term health of our community that this Revenue stream was to make sure that we understand the importance of health and then we had to from a Grassroots standpoint go against the strong marketing efforts this sometimes. Poor neighborhoods and it makes sense to me. And by the way, I don't know remember that but I was one of the few people that we're getting it from all angles, but we did it and we got through it and we didn't say it was going to be capped. We didn't say and by the way, if we generate more we're going to do this we said this is going back into our community. So for me in such as very simple boat, it just is consistent with our values. And so certainly I will vote to override The veto and I look forward to that felt. So thank you very much. so I can keep going if you want but I don't I won't count Traverse. Why would you like to say a few words? Thank you for snow. Every are doing the budget it is shocking to see how the general funds that could be spent on anything are used by the mayor of the majority of the council this year. For example, the mayor spend four hundred million dollars on policing 10 million dollars on inhumane and ineffective sweeps of homeless encampments had $1000000 studying putting regressive tolls on city streets and not one discretionary Dollar on building affordable housing. This bill is about whether the funds raised by the sweetened beverage tax go into the general fund or whether they are in a special fun to be only used for things like access to healthy foods. This bill is not about whether or not to have the sweetened beverage tax. We are not real litigating that discussion. I voted against the implementation of attacks because it is so aggressive putting the overwhelming majority of the burden on for and working-class people. But today the vote is about whether the funds from the stacks are reserved to support healthy food options for the very people who are going to be paying the majority of the time. This measure to be able to use the funds for the community itself mitigates that aggressive nature of the tax taking some of the revenues back into the hands of the communities and because of that, of course, there's no doubt. I intend to vote Yes. This ordinance is not about cutting 6 / 6.3 million dollars from other various important programs as mayor dark and has falsely claimed this bill cats. Nothing. However, the mayor's lie while absurd on the face. I need to be taken seriously because she has the power to propose a different kind of budget and she says that programs will because she's effectively threatening to cut the funding to the program's if the social service operators do not fall into line. Even being reported. The mayor has had department heads calling social service providers and threatening to cut their funding. Indian this is what the bill is about. This is not about one politician versus another or some sort of Palace Intrigue in City Hall. This bill goes to the heart of the matter that we face in our city, which is the lack of political courage in City Hall to tax big business so that all the programs that we need can be fully funded so that all our needs a society can be funded that is not happening which is why do you have situations like this where we are struggling to find a measure of social justice and even that is being called into question by wedding programs against programs by using the Peter robbing Peter to pay Paul strategy as our movement is growing. Absolutely. We want to win this bout today and override the mayor's egregiously, but that will not be enough. We will need to continue fighting for full funding of all our problems and that full funding will not come on the basis of the most regressive tax system in the entire nation, which is what we have. In our city today, we will need to generate the political courage to tax big business and the wealthy are all the needs of our communities, especially the most marginalised are funded and I thought I'd let you know is not going to start from which politicians is going to start in the grass roots in all workplaces in our communities. So, I look forward to working with you in September and October in our people's budget movement. Thank you. From the other counselors like to speak on this issue council member Herbalife, you look so few words, he wants comments about what the intent of this legislation is and is not when we heard that the mayor and some of her Department directors were raising this concern in the community that by sequestering these funds for the intended programs at that might be fewer funds for other programs that we all cared about. We worked to actually amend the legislation to include a recital that clarifies with the council's intent is and what our expectation is for the mare and so included in this piece of legislation is an amendment that clarifies that the ledges Jason is not intended to reduce funding for any impact of programs, and I think the six parts really important that the executive is expected to identify other sources to main. Ending for these additional programs that we all care about. So, that's what we're all hoping to see in the budget process this year coming up in September. Thank you. Best running backs all we have gone through this. Now how many times four or five times in these Chambers and I as budget chair had raised an amendment on one occasion and support a councilmember Pacheco on another to say we went through this last year during the budget cycle and we had agreed that we would have an endorsed budget. The budget for this year and endorsed budget next year. I will tell you that I am probably the least comfortable up here around this brouhaha. We're now having because I do feel it's it's pitting one Community against another many of us up here against the other and the second floor against the seventh floor, which I think is absolutely unnecessary going forward, but I do want to recognize that whereas I fully support the sweetened beverage tax Investments. I also support the Appropriations that we made last year for a number of things that were really critical and those were Public Health caring for our communities and other ways for a parent. Dial tone program our child care assistance program and our nurse Family Partnership program. All these things are important to all of us. So coming up in October when I'm asking my colleagues to do is we really need to prioritize the revenues for these other programs that we hold dear. Now. Of course, we're going to hold our food banks whole we need the this money for our fresh box. We know how important that is the operational cost for permanent Supportive Housing all of these things that we invested in through the sweetened beverage tax last year. Now. We must resolve the conflicting funding priorities as we go forward and are balanced budget. So I'm asking you I'm also asking her Council Central staff and the mayor's office as well to help us look for an ad at the entire system of expenditures primarily for Human Services. I believe that those are that this Council has said over and over again Human Services in finding housing for unsheltered our top priority. We also know that some of our investment simply aren't working and we aren't getting the bed. It's we expect so my goal here as budget share. Unfortunately. I have to take a courageous position and say we have to have a balanced budget. There is not a single thing that we have done in the last year that suggests that were very good at cutting things. So I'm really committed as I know the mayor is to find the money in our general fund to support what we're doing. I know where the wind is blowing up here as my friend Richard Connelly just to say you don't need a weatherman to know how which way the wind is blowing and how this boat is coming, but I want to make really sure that we understand that as we're moving forward with these things. We Altima layer going to have to make some decisions one is going to be we need some additional revenues to to cover this. So I'm asking my colleagues let you know over the next month before budget budget really begins in October. I want to hear from you about are there one time Fun's things that you are going to be willing to cut if we are needing additional revenues. We've got to work with the executive to make sure I am not going to be voting. Today to override a veto. I believe that she had some real good reasons for doing that. But I do want my colleagues to know that I am committed to making sure that all the Investments that we have identified in the 2018 budget for this year and next year are held completely whole and not touched. Okay, KO. So prior to my appointment I had the opportunity to knock on the door. So about two thousand people in my district and one of the things that I would hear consistently at the door was you seem like a nice guy. If you get to the council don't get caught on the fights between the council and the mayor and in my district specifically, I think it's what led to the rise of the call for accountability. So this is hard. This is hard for a variety of reasons reasons that an outline that were deeply personal to me because I grew up on Mini the programs that were talking about funding and not only do I know the first-hand the importance of these programs the question becomes how do we find them these programs and the underlying issue in the issues that I've inherited with regards to the decisions that led to the situation are such that we still have yet to address the underlying part which is how do we find them as attentions? I have escalated in this entire debate between the council and the mayor it has really been disheartening for me and and quite frankly heartbreaking because I'm here trying to focus on Solutions. I really want to work with all of my colleagues. I know my colleagues are all dedicated public servants and I'm wanting to work with everyone to figure out how we best do this. This is not about us versus them. This is really about all of us trying to drive the solution for In the end there are 10 people responsible for the leadership of the C9 council members won mayor. And so I was a sole vote against this ordinance. I will support council member Bagshaw and hurt the mayor's veto and I will say this right now, it is my priority and don't interpret this vote as not wanting to put the money back. It's a vote to say how do we figure out the solutions that are necessary? Because the underlying issue Still Remains, we have not identified the funding sources and I'm willing to work with anyone to identify this funding sources to put the money back and make up and not pick organizations against each other because that has been probably the most disappointing and disheartening part of this entire process. We're better than this. So I'm going to vote to uphold The veto. Thank you Katherine Pacheco. Okay, we're almost ready to vote. Did anyone else want to say any other words council member scared of you to know that I believe was council member so want or herbel to mention that this is not about the political fight between council members is not a political fight between the second floor in the 7th Floor. This is about a commitment that we have made to the community. And if anything it is intended, I believe mr. President that the leadership forward today. This is intended today to be a vote that signals our commitment to fully funding these programs not just the programs that are funded by the but the very programs that were funded through the sugar sweetened beverage tax last year want to make sure that all of these programs get funding you heard that from us last time. You heard a commitment to Sure that the home visiting programs in early learning programs and soothing programs are funded just like we made a commitment to the voters who supported the sugar-sweetened beverage fact that those programs will get enhanced funding. It was always intended to be enhanced funding. So as we move forward, I do hope that the message of unity around these programs at lard are held held up and appreciate the good share of budgets comments that you made the last time around as well that we all are going to be looking for ways to keep all of these programs whole but we will hopefully we'll be able to avoid going forward after falling victim to Manufactured crisis not having ourselves be pitted against each other and creating unnecessary stress in the kaveri communities that we have asked to trust us and support this attacks. I am hoping that this type of drama that has been stirred up will be behind us in the rearview mirror so that this Council can fully focus on a robot. Budget that invested are most vulnerable in our communities that have the historical events not included in budgets in past decades and this is a council that will unite around those issues. So regardless of what the vote is today. I am hoping that we will not befall for the manufactured crisis in October and November because I don't want this to be a signal of what's to come. Let's unite around finding all of these programs and again calling for that additional Revenue to make sure we're not in the steriti budget going forward. Thank you very much. Mr. President. Give me about to call for the vote. I don't want to make sure I sure changed in one customer Gonzales. Are you good to vote? I didn't see a bunch of hands going up here in on the dice. Okay, so is that let me throw set the ground rules here at the city council will vote to reconsider passage of council one 19551 as amended. So during our role call council members were either vote. I to override the mayor's veto or no to stay in the vote. In other words. If the vote on the motion is tied or less than two-thirds. The bill fails in The veto is sustained. Reading it sounded confusing disabled and that okay. Alright, so Please say that again. I was reading a script let me put it in. Plain English is 6 volts if there are six votes The veto is failed. Fix iPhone 6 iPhone 6 votes if they are six boats DeVito's fails. Okay? Okay that clear, okay. So remember I is a is to override okay? We'll talk. Please call the roll. Bagshaw Gonzalez herbal, Juarez mascara O'Brien Pacheco president Harrell Sleep at 6 and Faber 3A post. Motion carries the veto is overridden and the chair was signed the build certifying passage of kampsville 119551. Please call the next agenda item. Oh. Councilmember Gonzalez go to bed. It's late there. Okay, thank you very much will now properly excuse can spend with his knowledge from this proceeding. Now let's read the next agenda item into the record. Agenda into resolution 31897 calling for an end to the US government's economic commercial and financial embargo against Cuba. Cast member mosquito to end the Embargo against Cuba. I know some folks didn't get a chance to raise your hand. If you've had a chance to go with Cindy Domingo if you've had a chance to visit Cuba on a delegation to learn from the culture and the community and technology and Medicine there. Will you please raise your hand for the able to go to think that you will agree with with the council and the majority of the general public that the Embargo is not only creating a hardship for the individuals who live in Cuba the kiddos the workers the elders but it's also creating a hardship because we in the United States from the technology have spell approaches that they have the incredible ways in which they've renovated their education system has some of the highest literacy literacy. Appreciate over the last decade with the people of Cuba and to learn from the individuals and organizations to create this cross National learning opportunity to the United States has imposed in various degrees in various strengths against the country of Cuba and under this Federal Administration. We see an increased intensification of this embargo the people of the United States agree with what the city council is considering today the majority of people in the United States, and that's why I 11 other cities in this country have already passed similar resolution Richmond, Berkeley, Oakland Sacramento all in, California. Ford Connecticut, Helena, Montana Minneapolis Pittsburgh Saint Paul and Detroit those last two just passed a resolution to this year and there's five more cities for currently considering similar resolution to call for our Congressional members to put the pressure on an end embargo against Cuba today and repeatedly the overwhelming majority have voted in favor of ending the Embargo against Cuba 191 member organizations more recently 180 to two countries of staining. This is the vast majority of the world calling for an end to this embargo against Cuba people for Cuba mounted over 4 trillion dollars and still keep has achieved some remarkable remarkable accomplishments, including the highest literacy rate in the world. 99% of the population has achieved High literacy rates guaranteed access to Early Learning care, which has resulted in over 79 years individuals and Cuba are living longer than individuals here in the United States guardless of well because actually when you have poor health outcomes the entire population suffers, so we have a lot to learn from our friends and Cuba infant mortality rates are as low as 0.4% that's 0.4% of including me and many individuals who want to survive giving birth to one of their kiddos to survive and specially in that first year of life. We have a lot to benefit from ending the Embargo and continuing to look at the medical technology and advances the the teachers and the community in Cuba some of the specific. Today some of these advances in technology include diabetes drugs vaccine for meningitis and hepatitis B two bodies for kidney transplants as well as other therapeutic vaccines that can help us Advance our cause to end lung cancer one of the most devastating cancers that they have helped to create an antibody against that so this is incredible technology that we have the benefit of learning from and I think it is past time that we end this punitive policy and make sure that we continue to extend our commitment or message of solidarity across this country with the people of Cuba. I'm proud this resolution will make us now a dozen cities across the country that will be calling for an end to the Embargo and I want to specifically say thank you to Cindy Cindy Domingo. You're still here a long time civil rights leader and labor leader who has A huge amount appreciation for all of the work that you've done. My parents did have the chance to travel with you as well as a number of other people in the audience who have over the years have the chance to benefit from going on such delegations. So to all of the folks were listening do know that we here in this corner of this country will continue to stand up against oppression, and that includes the punitive measures in the Embargo that has been incorrectly placed upon the people of Cuba for these past few decades, and we will send this message of solidarity to the people of Cuba because I know you sent it to our friends across the country and across the water as well and we'll send it to our Congressional members as well. There is legislation that continues to be to introduce recently reintroduce again to call for an end to the Cuban blockade and just sending a message of solidarity Cecil. Mesquite accounts members to want Trump claims that is Donald Trump claims that there is some sort of humanitarian justification for the Embargo on Cuba and that is absolutely ludicrous Trump Administration is blocking supplies needed to rebuild from hurricanes. Wild sending deadly weapons to the Saudi royal family. The reality is the Trump Administration in the big business interests. They represent push this embargo because they're totally opposed to essential Services being part of the public sector and they do not want the successful example of Cuba to be learned by millions of Americans who would want the same thing if they saw how successful it was as I was mentioned about Cuba's Public Health Care has meant that people live longer have far better health outcomes while living and infant mortality rates are Be able to best public education has meant higher literacy rate in training and more doctors exported throughout the world than any industrialized Nation public investment in housing has meant that they do not have and have not had the homeless crisis that we see in extremely wealthy cities like Seattle and this island nation strangled by an embargo by the most powerful economy of the world and recovering from a level 5 hurricane. As a socialist myself. My view of socialism is a society where the economy is run democratically by workers and their communities to benefit the vast majority of humanity and to maintain the planet Qubo shows an important glimpse into what is possible with socialism. And what we need to do is go well beyond what's a cheat or to being a chief to the Cuban Revolution certainly the climate crisis which we are discussing appropriately discussing today calls for a fundamental shift away from capitalism. That would mean the biggest corporations in our economy. Our run democratically taken into public ownership not for the profits and wealth of a few shareholders when you compare Cuba to Haiti two countries with similar size in a mini similar historical Point climate and natural resources, you can see the day and night difference with the advantages of a public sector compared to the exploited of nature. of capitalism, so I'm happy to support this resolution and let's fight for and when Medicare for all Thank you customers want with any other colleagues like Seymour word for we vote on the resolution? Thank you, Cindy. Call your work. Okay, let's do this those in favor. Adopting the resolution is eloquently stated by council members to watch and Moscato, please. Please read agenda item number 3 stating an intent to adopt legislation imposing a local sales tax and use tax of the maximum rate authorized to find investment and affordable and Supportive Housing. The committee has the resolution be adopted. I'm really excited to bring forward this legislation today. I know it sounds like it's policy wonk with a lot of monkey sauce on it, but it's really exciting. This is a legislation that the state legislature initially pass this last session House Bill 1406 which allows for municipalities to be able to access tax dollars that are already been collected and actually invest them into affordable housing. So you have items three and four. I'm going to just speak to item three right now and then I won't speak again to item number for mr. President. But this is a really important opportunity for us to both pass a resolution and then subsequent ordinance in the same day to allow for us to act on this brand new Revenue opportunity to build housing on this legislation to allow for these jurisdictions to get a portion of the existing sales tax and two are intergovernmental relations team and the lobbying team for their support of this. It is critical. We get dollars in hand to build affordable housing now and we're in coordination with our County Partners on the timing of implementing these dollars but what's really important is that we have dollars in hand to build housing council member harvold is a co-sponsor of this legislation and through the last few months. I think we've been engaged in conversations about how do we not just access the dollars that are going to be available to the city around 4.5 million dollars a year. But how do we actually expand those multiply those dollars and bond against those dollars So Cal Somerville, this is an effort. You've been leading on in past years and I think this gives us one more tool to allow for Esteban and get Capital dollars in hand at a minimum. We are talking about bonding to be able to get 50 million dollars to invest in the housing and this is a really important opportunity for us to get those dollars in hand in at the same time. We recognized that this does not meet the scale of the crisis that we have in terms of the need for new Revenue. So just as a reminder we have Other needs around 156000 units of affordable housing that we need to meet the need for today that doesn't even include the individuals who may come here as immigrants and refugees or people who were coming here as economic refugees looking for a good living wage job or to start their own their own business or the folks are coming here as climate refugees seeking a more stable climate given the crisis that many of our colleagues and Friends face across the country with wildfires and increase flooding and intense the temperatures and unstable situations more people are going to come to this region. So we must build a housing to make sure that everybody who is in our region has a place to call home and that people are getting pushed into the street or pushed out of our city limits. So in order for us to be able to act upon the legislation that was passed and the state legislature. We need to begin collecting a fun by October 1st. In order for us to meet that deadline today council is considering legislation that allows for us biceps. Refers to authorize executive to give a 30-day notice to the Department of Revenue excited that passage of the Revolution and the ordinance today. We will begin to be able to create that spending plan that we heavy emphasis on Capital also recognizing that we do need to make sure that are permanent Supportive Housing that does get developed has the funds for case manager is an additional ongoing support through operations. And so there will be a little bit of a balance but a heavy emphasis on the actual Capital Construction. Thank you. Mr. President. I think that summarizes the comments here, but I would be remiss to say that as discreet housing the emphasis with these dollars will be on the lowest income workers folks were making less than 30% of the area median income because that is the population right now that the market is not going to be building for and we must build affordable housing. Again. Thanks. The entire team for making this possible including on Tracy Radcliffe friends Central staff Emily Alvarado from the office of housing Leslie brings in from the mayor's office and Erin Howe. From my own office for their intense work to make sure that we got this path on time to build housing and to our legislative Partners who made this possible. Thank you. Thank you. I appreciate the opportunity to work with customers Moscato on this bill and have the opportunity to co-sponsor it thank you as well come from Moscato for recognizing the work that this Council has done in the past and ensuring that we use our bonding capacity in order to build affordable housing in 2017. This Council had a conversation about doing just that we use our bonding capacity for almost everything that the city builds whether or not it's buying new parking meters or fixing the seawall whole bunch of different capital projects in between but we were not using our bonding capacity to build housing and given that we had prior to 2017. Couple years prior declared a state of emergency thought it was really important to use the cities ability to issue debt to build housing. That should be a priority for the city just like again we use this Dad for other things that the city needs the catch though in using our bond Authority for affordable housing or using Arbonne to Port Authority for anything. That catches is worth sharing. And we have to have sufficient funds to to pay off the debt. Sometimes it is for 20 years. Sometimes it's for 30 years this legislation before us today allows Seattle to access existing Revenue that would otherwise be used by the state so that we can increase the affordable housing that we can build under this year's funding availability to nonprofits, but it's only it's it's only an allocation of state sales tax. That we could use over the next 20 to 30 years depending on what the term is that we decide to issue the Dead 4 for what we build additionally this year. So high priority for me that Seattle double our housing investments for each of the next four remaining years of the housing Levy so that we can act on the recommendations of the 2018 McKenzie report that says our region needs to invest between 360 to 410 million dollars a year to build a fordable housing. So just in Seattle alone, we need to be doubling our annual investments in affordable housing this legislation before us today helps for this year because again, it gives a revenue source that will allow us to double our investments in affordable housing this year. But if we want to continue to use our bond Authority in order to double our annual investment in affordable housing for each of the Next four remaining years of the housing Levi and if we want to do so in a way that doesn't rely on our existing regressive taxes to do so, we will need another new Progressive Revenue Source next year and the years following if we can't find another new Progressive Revenue Source, then we only have our existing regressive taxes that are continuing Reliance on them whether or not it's to build affordable housing or to do the other things that are really important to the city will hurt renters mom-and-pop landlords low-income and middle-income home homeowners seniors and small businesses alike. So I'm just putting this out there because if we really want to be able to do what we're doing this year for subsequent years. We need to find an ongoing Revenue Source in order to pay off the debt that we would issue to build more affordable housing. Are you okay? That's what? I will be. Bill and the next one which will both be bills to make a tiny increase in the funding for affordable housing. It is funded through sales taxes with a new sales tax that is simply the state giving the city back of small proportion of the sales taxes. They already colored so that the city can support it without creating additional burdens on house regular people have already paid way too many taxes in Seattle where big business gets off work release Godfrey. She said it would raise 15 million dollars which makes it appear that it is replacing the Amazon tax that was repealed by the mayor of the majority of this Council. However, in the fine friend, we have to be careful to see the fine print that it is only raising a few million each year in the city. We could make 50 million dollars of those funds one time if it paid off that $15 over the next 20 years. I said board every possible affordable home for our Working Families. And will of course be supporting this bill. As I said when we need to be clear as consumer harbolt correctly outline. This is a tiny drop in the bucket. If you look at the amount of funds that has been read to research we know that we need to address in order to I need to raise another address the scale of the problem. So this is relying on Tuesday access is going to be completely in insufficient not to mention. I'm completely unjust If we are to have a city hall that actually addresses the housing and homelessness crisis, then we cannot doctor question of taxing big business to build affordable housing in the thousands every year. They're not in the dozens and we will also need rent control most importantly at this moment. It is my duty to point out to what incredible lengths the political establishment will go in order to use sales taxes as a cover to avoid acting big business the city David the state legislature to pass a special law giving the city the ability to spend this tiny fraction of regressive tax on affordable housing Olympia who have a majority in all house has agreed to Champion did they pass the law sending out press releases bragging about what they accomplished than Seattle's mayor brought this bill along with press releases bragging about what she accomplished mean while tens of thousands are homeless hundreds of thousands are in danger of being displaced and Washington State continues to have the most regressive tax. Stem in the Incarnation. The question we should be asking in our movements should be asking where was the lobbying efforts on this from City officials to repeal the ban on rent control? Where was the bill in Olympia. Amazon or capital gains or anything else that would tax the richest people rather than the poor and working-class people yet again. Where is the billion-dollar social housing project? The city could have advocated for an estate could have passed in this budget paid for by taxes on the super-rich. None of that was on the political establishment agenda. That is why we cannot rely and our movement cannot lend and be while we strongly support every affordable home possible including to the bill today. We as affordable housing Advocates must hold a political establishment accountable for all that. They are not doing thank you. Thank you. A resolution resolution. All right on this legislation. It is also her birthday today. So happy birthday Aaron house for appreciate you and then we applied the future efforts to get additional Revenue in hands and all that you've been doing to make sure that we focus on zero to 30% Happy birthday passed this resolution for your birthday adopting the resolution, please vote I buy those opposed vote. No the motion carries. The resolution is adopting sure will sign it. Please read the corresponding bill into the record for accountable 119593 relating to Taxation and posing a local sales and use tax to fund investments in affordable and Supportive Housing at a new section to Five Points 60.0 twenty-five. 10.0 twenty-seven to the Seattle Municipal Code amending section 5.60 / 0:30 of the Salem zip code and ratifying confirm research Empire Axe. The committee recommends that the bill pass you should have described that and would you like to see if you were worried about the bill or just want to proceed with the boat? You sure all right. Please call the roll on the passage of the bill herbal Juarez. Mascara Jayco president Harold. Please read the next agenda item. Please read the short title connector project authorizing the loan of funds in the amount of 9 million dollars for design of the streetcar the committee recommends the bill pass. Thank you. Cuz this piece of legislation would authorize an inter-fund loan to fund up to 9 million dollars towards streetcar on Ewing Street car out engineering design work as a folks are probably aware. The the streetcar program has been on hold and decision to purchase some additional street cars for the Center City Connector is on hold. Well on the mayor and the department do some more analysis they've done and would like to proceed with further analysis which will include which will cost up to 9 million dollars analysis includes for the study of the size of the cars changes that might need to be made to the bases or platforms and probably most importantly the structural components in May due to be reinforced to the Fourth Avenue street by which is essentially the intersection of 4th Avenue and Jackson in my understanding is the intent is to move forward the project but the mare cannot fully commit to that until this is urine work is done in the understand that Ramifications of that the intent is that the inner fun loan will be repaid by proceeds. That would be reimbursing gas tax money from the sale of the Mercer mega block properties that discussion was started my committee this Friday and I'm hoping would be complete before budget that transaction would likely be completed in 2020. Think you can spell Brian any other questions or comments customer her Bolt. Thank you. I want to start off by thanking the mayor and the S. Director Samson Bob way for the transparency that they brought to this project. It's a real improvement over the previous leadership. I don't support moving forward with project none the less it was the cost is most recently estimated at 286 million dollars more than twice the hundred thirty-five million dollar estimate included in the 2015 small starts Grant application to the Federal Transit Administration. And this is twice the cost estimated in 2015 before we've even Broken Ground on the project a couple of the other reasons that I have strong concerns in 2017, when the estimated cost was 158 million to the council adopted an amendment that I proposed requiring that s. Report to the council to identify contingency strategies and potential funding sources to address. The risk that future Federal Transit Agency funds are not included in the federal budget to reimburse the Capital Construction cost of the project. It stated that the report should identify contingency strategies and potential funding sources to address the risk of under collecting future operating Revenue in the case that ridership projections do not need to the estimates. If further this is a further this is an amendment that the full Council voted to support but never less we have not received an answer for how to pay for the extra cost of the project for both construction operations nor have we received the proposal to fully fund it the most likely option to be proposed that will probably here in the future to pay for these extra costs is by not funding other Transportation priorities. And as we all know we have a lot of Transportation priorities for construction funding Thanks to the first quarter enhance Capital project reports for the 2019 watch list that the council adopted early earlier this year. We learned that the 50 million dollars from FTA the Federal Transit Administration will expire in September 2020. If a small starts Grant agreement is not yet executed in this is a quote from report. We do not expect to have an executed small starts Grant agreement by September 2020 under the revised draft schedule. So what that means is not only is the 20 additional 25 million that we are hoping to get from Ft. A knot in hand, but it is very unlikely that we should expect an appropriation of the original 50 million dollars. So if the FTA funding for the project is more uncertain than ever which it appears to be this will result in a possible. 140 million-dollar funding Gap nearly half of the cost of the project even if those dollars were to come in the 75 billion would only cover about 26% of construction costs. Again, the original estimate that SS. Included in its Grant application was that those dollars would cover more than half the construction costs. So it short I really don't think it's good public stewardship of of limited public resources that have a really important demand namely are finite Transportation dollars. It's like I don't believe it's good stewardship of those resources to vote before even having a funding proposal for the project. Secondly, the original purposes of the two existing lines are already being served by transit the South Lake Union line was developed to connect. South Lake Union to light rail the first Hill line was built in lieu of a light rail station to connect the Capitol Hill in Chinatown ID stations academic research shows as Danny westneat and others have noted that streetcar projects serve primarily for economic development and it's difficult to claim that you can on the development is needed in the heart of downtown. And in any case the transportation funds I believe should be used for other Transportation projects primarily to address our needs of our Transit System downtown is well covered by buses and we have a light rail line where the center city streetcar would go. I'm really skeptical about the ridership projections. The original projections for the South Lake Union line was over 900,000 writers in 2018, but the actual number Is a little bit over $500,000. It's 500,000 writers. It's 44% below the projections. And so what that means is when we don't have the ridership that we expect. We're not collecting the fair Revenue that we expect and that creates a nut a need for another operating subsidy. And again having fun finite transportation resources that operating subsidy might well come from the operating subsidy we could otherwise be providing to to serve to serve Metro and address the needs associated with Metro Transit. It's really important for all of Seattle to have good Transit connections from Seattle to South Lake Union employment center in 2016. When the C line route from West Seattle shifted to run to South Lake Union rather than ending in downtown write a ship went up 20% That's the that is what happens. When you invest invest in bus transit the use of bus transit increases dramatically where one of the only cities in the in the nation where Transit ridership has increased in that is in no small part because of our investment in prop 1 to fund bus transit. The I think another another really important note of caution is that I 976 has qualified for the Statewide November ballot if it passes and I hope it doesn't in 2020 the Seattle Transportation benefit District would lose 25 million dollars and see if vehicle licensing fees that voters approved in 2014 for ditional bus service beyond what is funded by King County Metro. This could affect our ability to maintain current funding levels for service in 2020 on the C line. For example over over one-third of the service on the C line is funded by prop 1. I want to also thank budget committee chair badshah for the Proviso that she offered on spending for this project included in the 2019 budget. I think we will need a similar restriction in next year's budget, and I also want to Make note of concerns. I've heard from West Seattle. Bike commuters about safety with streetcar tracks. They would need to cross if this is built to reach their jobs in downtown and South Lake Union. They're very worried about their safety is of this moves forward bicycle safety must be addressed in all portions of the line and enclosing although Transportation projects are known not to be Transportation projects, but rather Economic Development projects, these are the kinds of Economic Development projects that benefit the types of businesses that can weather the the construction impacts of a of a project Like A Streetcar project. We received an email from a small business owner on 1st Avenue business owner writes that they are on a very tight budget and trying to Showcase local Arts the residence of our city and visitors from all over the world. There are Gallery owner too difficult. Business but much-needed or much-needed cultural asset. We work really hard to keep our doors open are coming up on our 2-year anniversary. It's never easy and someone's we struggle more than others, but we understand the important role that our place in our city and it's worth every bit of hard work that we put into the gallery Daly street car gets approved. It is unlikely that they and several other small but important businesses on 1st Avenue Will Survive just the idea of potentially tearing up our Lifeline 1st Avenue for any amount of time brings on tremendous stress. And anxiety. We rely on 1st Avenue being opened a thousands that walked by you say if the street guard gets improved construction will deter hundreds of people for walking on 1st Avenue. Let alone coming into our gallery to buy art. What is the reason for building the streetcar in the first place? First out as busy Lively street with traffic problems already affixed rail street car will only add to the traffic messed making downtown less accessible for those who live in the city and give them yet another reason. Boys shopping along 1st Avenue and who wins big businesses that can afford to wait it out while construction of this ridiculous streetcar tears out First Avenue and drives out all of the local business. And so again, I think that there are a lot of problems with this project primarily. My main concern is that we are using Precious Precious Transportation dollars for what is essentially on any conomic development strategy that will not benefit all all businesses and will result in the city needing to continue to subsidize both the construction of the streetcar as well as its ongoing operations, and at that will overtime negatively impact our ability to continue to fund in transportation systems that work mainly heart very successful bus line. Thank you. We have a bill in front of us. I want to make sure Councilmember herbal, thank you very much for much of what you said there, you know you and I have been talking about this a green with some things and not another's but I do want to acknowledge. The number of people are standing at the back door like me from DSA Leslie Smith from Farley with Pioneer Square Alliance and Jenny who was here I had occasion to meet with a half a dozen most recently and perhaps 18 members of the community about 3 months ago and what I heard from across the board whether it was business as large and small whether it was our service providers, whether it was people along 1st Avenue having the connection between the two existing lines of our street car made a lot more sense than just having them as independent worms that don't go anywhere. So I want to acknowledge though. What council member herbold has said it's a major concern of mine as well as what the extra cost for construction weather really the juice is worth the squeeze. I believe this 9 million dollars is worth going forward. Let's let's continue their construction the evaluation but we are going to have to figure out the operations cost. What counts as member. Her old said I believe is absolutely true particularly if that's going to shift to the city of Seattle's general fund, but I do see the value of having a unified connected system. I'm glad to support this next phase but I do want to hammer again. What I said this morning, we need to have a Freight mobility strategic plan to make sure that we know what times and how we can promote staff rate getting around the city particularly around downtown because it's more and more packages are being delivered. We need spacers for trucks. We need time whether it is a temporal change and how it when trucks deliver the packages or how we're going to work that through so we're not done yet. We're certainly not out of the woods, but if s. Will work with us on the Freight mobility strategy really fixing left turns on 1st Avenue so that we can have Dedicated land for Light Rail and frankly, I think and as a bicycle Rider I can say this I think bikes need to be moved off of where we have light rail. Let's provide dedicated to save separated bicycle Lanes good safe pedestrian connections, but don't try to make some because it just doesn't work. So I just want to acknowledge again DSA. Thank you Dawn for being here for all our Pioneer Square Alliance friends and the nonprofit's including Compass housing and Chief Seattle Club. Those Advocates were really persuasive to me that they wanted this connection and also time graph and others from Belltown and our Public Health leaders that came and said this is important to be able to get the services to people who need it. So I'm going to be supporting this 9 million dollar investment and four others next year. You're going to have to make up your mind after you see what what comes back and how much it costs are. bank accounts number Xbox okay, if we're ready to close rate as you need to say any closing remarks, I can't remember and re-read it about please. Call the roll on the passage of the bill. Big Sean herbal Juarez mascara O'Brien Pacheco president Harold and favor one opposed Please read the next item into the record for Seattle establishing goals identifying actions necessary to meet these goals affirming the federal Green New Deal resolution and calling for the federal government to enact policies to advance a green New Deal the committee recommends the resolution be adopted. Thank you ready to talk about the green, New Deal. It's been waiting for a couple hours for this or something people have at least I'm calling them really excited to have a chance to vote on this resolution. I'm really really excited for community members that have been coming together for years and in particular on this effort in the last few months to really highlight the changes that we need to make this resolution has a lot in it as my colleagues and no doubt seen it touches on a lot of aspects. I will say that the the my interpretation of the federal Green New Deal than what I hope to accomplish here in Reef without touching on all the points and resolution is it we have to address the climate crisis that's barely down towards us and we have to do it in a way where we simultaneously address the economic crisis. The face is too many of our community members and the solution to that is got to be centered around lifting of the voices who have both Been adversely impacted by pollution and the climate crisis in their communities and have not had access to the opportunities in an economy that too often overlooked certain communities and my lifting up those voices those communities that have been most impacted who have seen firsthand how damaging both are environmental and economic policies can be they also know the solutions to solving both if we simply solve the climate crisis, but double down in an exit on economics. It's in the leaves in behind will be back here fighting a new crisis again, and we can't simply saw the economic crisis without addressing the climate crisis and these communities get that better than anyone else. I know when you read this resolution know that you were reading the voices of so many community members who put a lot of time into making this right and recognize of course, the resolution alone is not going to solve it. We have a lot of work to do going forward be honest. We already have an ordinance in committee to be back for us. Soon I will working out and transportation items will be here on Friday. And this will long last much longer than my current 10-year on the city council. And so we need some mike always are here in future council members to pick up the work and keep going forward. I will just highlight the best resolution explicitly says that Seattle will be carbon pollution. Sorry climate pollution free by the year 2030. When I first started on the city council or shortly after I started 2011, I believe we passed a resolution committing Seattle to be a carbon-neutral city by the year 2050. We have done some great work in the last decade. We have made some progress and bending the curve the moments. We have reduced our carbon pollution at moments. We've increased our carbon pollution but consistently have been reducing it per capita. So I'm trying to be optimistic that's positive. But all the spin on what we have done does not address the reality that science is telling us we must do at this point and so will we may have thought we have 30 more years to figure it out. We now have only 10 years to figure out something that's even more serious than we thought and there's going to be a lot of work to figure out how we eliminate fossil fuels from our city and our economy. We have a lot of Solutions in front of us that we can work on but it's critically important that as we do that work. Did we do it in a way that recognizes that many people rely on fossil fuels today and people relying it to get to work cuz it's the only way they can make it work or to get to school or to take their kids to school and he will rely on it to heat their homes many people rely on the fossil fuel industry for a job that supports their family and is the science tells us we going to have to get rid of fossil fuels and we can't we were on that. Do we need to include those folks who rely on fossil fuels weather is for work Transportation or heating your other needs to be centered at this to help us figure out how they can successfully make that transition to a fossil for you free world, and that's what we're going to that's the work before I send the next decade. Thank you can spell with Brian. So, there may be a question. We do have an amendment. However, let me let me be clear cast member O'Brien has incorporated many amendments introversion 3B. I think it is. Full version 2 F cast members may want to speak to their version or they might be a new amendment that I'm not sure of but let's start a walk through either comments or amendments and probably about 10 or so amendments that were brought up and incorporate that into a substitute version, which I guess I'll go ahead and move and ask for a second and we can discuss that then we go. So I'm guessing you say that I'm moving to substitute version 3 be to replace version to ask you all should have a copy in front of it and there's a series of Redline sections are not numbered but you can look through it and see the various amendments that are incorporated into the substitute version. I would invite colleagues who spoke to that too spoke to that during committee or otherwise. Speak to those and at the end I will I will make some comments on the addition of language around trees and Eco gentrification, which is a term that we haven't used a lot around here and I want to just clarify that the limit pause for second let others speak. Okay. So we have many amendments are already Incorporated of council members would like to speak on the Amendments that are Incorporated in 3B is removed and second. If you can speak now customer back shop at decating for our tree canopy. We did add some language here encouraging preservation and planting of trees Citywide to increase the city's tree canopy cover prioritizing historically low canopy and low-income neighborhoods. But working closely with communities to protect against Eco gentrification. So council member Brian you said you were going to explain Eco gentrification. I've heard multiple different. Definitions of that but just so our urban forestry friends understand that clearly. We are needing to move towards a million Tri-City and I think that this is something that just getting it clearly in our Green New Deal is a is a very wise move fairly simple in words. And then of course in action, it becomes a little more complex, but the concept that is as we invest in communities including investments in green spaces. We need to be certain they were doing it away. If it doesn't contribute to the displacement of existing community members by pushing up housing costs. There's a great article and a cross cut a couple weeks ago that talks about this Challenge and I encourage folks to take a look at that. I believe it's July 30th or so about how people and communities such as South Park in Georgetown that do have a very low tree canopy. Are absolutely not opposed to trees they want trees and they also fear that converting their neighborhood to a beautiful eat read landscape may also drive up property values and attract other people who've avoided those neighborhoods for a long time. Like when we talk about anything when it comes to gentrification and displacement the solution cannot be to continue under-investing + communities every communities Drive access to a green tree canopy to good schools to save streaks, but it is also the reality is too often in our cities in this country been that with that has comes displacement and Soul by centering the voices of those communities that are most impacted by the low tree canopy and their neighborhood and allowing them to design how to bring the tree canopy and what other structures and safeties they need a place. I believe we can achieve both and I think this particular line also speaks to the real underlying philosophy of the entire green New Deal. Whose voices are going to lead on that work. the cast from Brian councilmember sawant I don't want to speak separately. I just want to speak make my general point also, so whenever you say after the Amendments passed but not the base legislation Casper mosquito and then I'll get my turn in the final resolution. But the amendment that we have a chance to work on with support from the lead sponsor. O'Brien is on page eight, which is Section 1 Section 6. I'm sorry. I don't know alphabet soup. The plan is that we have really are a great opportunity to work with our folks, especially in the building and construction trades as we think about transitioning current work to really cry folleti Union work, me and one of the exciting things that we've I heard from our building construction trade Partners is that this really strong desire to make sure that we're supporting a mechanical insulation which provides long-term Energy Efficiency emissions reduction cost saving and safety benefits. And so that exact language was put into the legislation with the support of the lead sponsor. Again, thank you councilmember O'Brien and thanks to the council member iherb old and your team in our team for working closely and quickly to who that language. I'm just briefly. I think that Like this is really important as we especially think about the overall ordinance moving forward and there's a saying that many of us always know nothing about us without us and as we think about the way in which on this legislation came together was really about the communities you were most affected by climate change and having the least responsibility for contributing to it needing to be the folks were driving the conversation. So thanks again to the folks from got green from 350 Seattle from the nearly 200 Community organizations and for all of your work to include the community voice Community leaders labor at the table as we think about what a green New Deal looks like we talked often about what adjust transition to a green economy looks like and that means making sure that folks who are in these on fossil field Industries who I'm whose life is also at risk from pollutants and toxins have the ability to have good union jobs in the green economy, and I think the language that you seen In the draft resolution signals that interest in making sure that there's Frontline workers and fence line communities for at the Forefront of this legislation because it was drafted by you also. Thank you for drafting legislation and thank you for the ongoing work to help make sure that were thinking about the just transition element and including access to good living wage jobs Union opportunities and thanks again councilmember O'Brien for your leadership on this over the years. I do look forward to working with you this Council and those two hundred organizations. That's what this forward to prioritise strong labor protections and ensure economic and racial Justice is at the center of our efforts of the city and as it has been people continue to look at us for the for the high-water bar, and we want to set that standard brother cities when it comes to labor Sanders and our commitment to addressing a green new economy. Thank you so much. Amended version via amendments in the United States as well as our labor stakeholders for helping to identify the amendment that I co-sponsored with counselor Moscato specifically requested by Building Trades to support mechanical insulation, which provides long-term Energy Efficiency emissions reduction cost savings and safety benefits. The reason why this is so important it is because energy conservation starts with ensuring that we don't waste the energy that were presently using. I also want to thank whoever is great idea was I have a feeling was probably councilmember O'Brien to include language in the amended version regarding reducing the prevalence of single-use plastic plastic that some of the work that we begun doing. Thank you doing some of that work in my my committee and would welcome your continued. Advocacy on on this topic. We are I wasn't obviously in committee last week. So I'm really happy to see that. This is included really important work took him to make sure that were continuing to drive this issue forward. I also want to speak to the language the new language included in the legislation related to congestion pricing and I just want to again make a note that we talked about congestion pricing and the need for it to be equitably implemented. I want to highlight when we talked about Equity times were talking about impacts on low-income people and people of color and I really support congestion pricing approach that considers those impacts particularly considering that sometimes people are working on off they're not working on ships that allow them to commute using Transit. So they're either working a night shift or swing shift. And so I think it's really important to consider that but also there's a geographic Equity specifically in West Seattle are more likely to use the SR 99 tunnel rather than than I-5 and thus will have to pay the tunnel tool or will look for ways to avoid paying the tunnel to And will in order to do so will have no option other than going through downtown to avoid the charge. And so there's this this potential for both. There's there's a potential obviously for the for the downtown tunnel. But then in order to avoid it which computers all over the city will likely be trying to do there will be no way for commuters and on in West Seattle to to avoid either the toll or the congestion pricing. So again, I think some Geographic equity on an impact. This is really important as well in looking at how to implement congestion pricing which again as we know we'll have to go to the voters in order to put into place. And then finally I want to make a note of My position as it relates to the language on page twelves new language and it's it's item 11. It says work with other Statewide organizations to advocate for changes to state law regarding rent control. I absolutely support the repeal of the state law that prohibits cities and counties from passing any laws regulating rent. I have been a consistent supporter of repealing that law. I am concerned and I want to stay for the record. I'm concerned about using the language rent control. I think it's really important that we change the frame of this conversation if we're going to be successful in Olympia, right control means a particular thing in many people's minds and what's important to me is not to implement any particular version of rent control, but what's really important to me is to remove the Statewide prohibition that already exist in state law prohibiting any City or any County from regulating rent in any way and I'm concerned that with we talk about rent control that we will never be successful in removing this prohibition and this is why Every year since I only research back to 2016 the city passes a State Legislative agenda and we identify and our State Legislative agenda what the top priorities are of the council in Olympia. And since I've been a council member starting in 2016 with passage of resolution 31634 then in 2017 with passage of resolution 31723 in 2018 with passage of 31787 and a 2019 with passage of resolution 31852. We have been as I say very careful about the language that we use talkin about our desire and our interest to repeal this part of the law and we've done so in conjunction working with our state legislators legislatures because they are the one Who are down there working on removing this onuris and harmful language into the language that we've used is we support the repeal or modification of RCW 3521 8:30 to allow local government to protect tenants from rent increases without causing a negative impact on the quality or quantity of housing Supply. So this isn't language it says we support rent control. This is language. It says we were we support the repeal of the state law that prohibits us from regulating rent. And again, it's really important to bring this forward in order to reset the frame if we're going to be successful in repealing. This onuris owner is legislation that hurts not just to see if Seattle what cities and counties throughout the state if you want to put that into an amendment here. I will check on it. If there'll be some procedural issues would do it and if we are to entertain that and which would require suspending the rules at some point, but cast member check or did you want to make some comments on either that issue or another shoe? Just let me ask you a question. Is this a potential amendment to change the language around the rent control section specifically? Okay. So this is a Should have I'll call it an on-the-fly amendment since I don't think it's been printed or passed out and we can do that as I understand the rules l. Ask you where that word chameleon on the procedural issue before I make the formal amendment. I think the sponsor them. It was council member on the rent control section was you well, I don't want to do this. Is there anyone like to write insurance if it's friendly or not and coming from my perspective? I appreciated your comments who would likely support it, but I want to know the original tractors their reaction to the statements made by customer herb customers watch like to speak. How to add the language was introduced in Committee Member O'Brien supported it and I guess formally it is being sponsored by both our offices. Present Harold just as a matter. No, no, no problem. Just waiting to get your attention as if this is a matter of procedure. I do want to make some point in response to what counts when were horrible said but I do want the right to speak once a formal amendment is made and I also would be curious to know if the amendment has passed to review department just being sprung on a so here's the procedural. Piece of this is I can move to suspend the rules and if it's the motion is accepted we can wordsmyth the document the risk we run is of course, it's not approved by law as we do have all of our legislative language go through but I think we are a student have to know if it's one minor word. Its. We could run that risk cuz I think between now and within 30 days we can always change it again. So if it's not earth-shattering, so that's a risk. I'm willing run up. The language is straightforward enough and it seems make sense. So we can suspend the rules and entertain new language of Desire the the diocese and I'm hearing some appetite for that. So before we do that, would you like to speak now comes from? Amendment of other as those of you who were at comedy at the other day in the sustainability and transportation committee. I had advocated that if we're going to have I mean just dropping back a little bit. This is what what will be passed today will be a resolution stating a very clear and Detail in the end of the city council to act on various policies as a comprehensive program to win the green New Deal or what we think of as what's necessary to do Seattle Spartan fight the climate crisis. So just as a reminder to everyone what we pass today is just an intent we would not be would have won or direction for the city council, but there's that by itself is no guarantee that we will win the actual component that will get get carbon Zero by 2030. So just to be very clear about what we're actually running today, so to that to that And I contact what the resolution says does matter because that we don't I don't want to be as a council member. I don't want to be party to language that end goes in that ends up giving a future account number. Well regardless of who they are, you know cover to save all this is what the pass countersigned in the resolution and I'm not doing anything, you know, what country do that. So what goes in the resolution doesn't matter and it should be good things things that will actually provide housing and climate Justice to our communities. So here's my opening night. I completely sympathize with the concern she has raised and and she and I are you know, of course have a you know, we we go back in fighting together for renters rights and fair housing Justice. I don't believe in any way whatsoever. However, that winning rent control is a matter of framing yes strategies important Framing and talking points and slogans are absolutely critical ending. We would not have won all the victories with run starting to $15 an hour. If we did not take strategy and tactics very seriously. However, it would be a grave mistake on our part to think that somehow we're going to make any progress towards housing Justice by trying to cleverly Fitness language such that it started. Real estate log into thinking this is not actually rent control. If you want to win what contributes affordable rents then what do you call it? When control rent stabilization, whatever you call it. It's you're not going to you know, you're not going to fool the real estate log into thinking that somehow they don't have to a fight tooth-and-nail against it is going to be up. It's going to be pitch battle between renters and housing Justice activist on the one end and the real estate Lobby in the politicians that support them on the other. There's no way to duck that fight. We're not going to sleep this under the radar at instead. If we don't say rent control what the fuck is going to have is ordinary. People who would be willing to come to the front lines and fight but not actually understand what we're talking about and they will they probably know they'll be disengaged already politics disengages and dissensions ordinary people with most of it is not for them. They see politician selling them out all the time and I don't feel like it's worth their time and they have to you know, I have two jobs do I put food on the table as I see it as an elected representatives. Do you know do everything in my power to engage ordinary people ever since we launched a rent-control campaign through my office Tenants Union, you know Benjamin activists have been here today in Violet. I think it's still here by the address to the are we launch a rent-control camping in April and at this point we have nearly 12,000 seattleites web sign our rent control petition does not a small thing because they're signing on to rent control. It has not been a barrier in any way whatsoever. It is what energizing people and people are calling my office every day asking so what's the next step in our fight the other point that needs to be Recognize is that a historic victory was recently won by movement in New York state. In fact the movement in New York City joined with movement and other cities like Rochester and their Farms something really inspiring which was the upstate downstate housing Justice movement work together. They run rent control victories and renters rights victories did not try to use another time because it's very clear to working people going to talk about rent control to talk about something in their interest. It has been a Lifeline for a lot of people let's go out and fight for it and they wanted through peaceful Disobedience Civil Disobedience tactics and fighting tactics. In my view the language should not be watered down. So I just wanted to stake my general points if there's an amendment that I will speak to that. Thank you cast from SWAT. Okay, so I'm sad that I can't remember. Her bald me some points about the language in Casper and Pacheco. Did you want to propose some possible language for the diocese to consider or did council member will want to do that? Well, I think maybe my language could be considered a friendly just based if I can read it out loud. Yes, just if you don't mind to indulge me one then let me grab the So we're looking on page 12 of the hard. copy Aunt page L section L. What's the number of Section 8 now Trump age 12 Okay, so 6L Dawkins going everywhere that okay. Thank you very much and councilmember Pacheco. You're the sorcerer. Sure. So the friendly Amendment or the amendment proposal and its states work with other cities counties and state what organizations to advocate for changes to state law to provide more tools for local control to stabilize rents capture your argument councilmember herb old is this acceptable to you? Okay, so there's no motion yet. I live in the moment. So this is a language does everyone have I have two hard copies. Does anyone need a hard copy of the council member? Same document. Can you read that one more time cast member chicken, please for the page 12 section 10 subsection L work with other cities counties and Statewide organizations to advocate for changes to state law to provide more tools for local control to stabilize rents completely strike the existing Ellyn substituted for your new proposed language, correct? Crack, okay. Let's put it that Sephora motion. Let me back up. I'm going to move to suspend the rules to entertain a motion of potentially changing the language. Is there a second all those in favor of suspending the rules to entertain a motion to to make an amendment, please say I I opposed you want to hand count on that one. that can you say I and raise your hand please I Post okay, so will demote the rules are suspended and I'll go ahead and entertain a formal motion. I move to amend page 12 section 10 subsection the owl to read work with other cities counties and Statewide organizations to advocate for changes to state law to provide more tools for local control to stabilize rents OKC and moved and seconded by council member Bagshaw. Okay and wicked keep the debate alive. With someone like you speak. No. I just think you know to cancel over hurdles Point language matters, and I think we can we can discuss the merits of rent control or the rent stabilization, but rather than get into the weeds of of what were four against. I think this is a wake Great Compromise for us to move forward that calls on our cities in a cow noises. We heard from council member Larry Gossett and spoke your I do think this isn't the county needs to do more as well as other cities and counties to do more not just in terms of the green new deal, but also for with regard to the conversation what we can do more to protect renters, so thank you for the the amendment council members. O'Brien or swamp. Would you like to come in at all cast member Bryant? Yeah, cuz I appreciate the discussion on this and I apologize to colleagues who only saw the Amendments just a couple hours before the meeting started. One of the things I probably could have done a better job is a circulating and making sure to bring this everyone's attention cuz I imagine you're probably going to spend a little time resolving. This is not how this discussion from my perspective a couple things I'll just say I don't think the distinction is really significant. Well, I want to recognize to my colleagues do I respect that have different opinions on that cleans our ballot? I'm not sure that I'm page 12 of this resolution one piece language is going to get significant difference one way or the other and I want to just flag one of the challenges that I think in the principal the green New Deal work facing at the moment, which is in an effort to uplift Community Voices. I've worked really hard and mouth sores really hard to continue to to discuss the language including. Wordsmithing of each of these amendments not with full conversation we've had here and trying to really make sure that they have the power and control of what's being said and the reality is we will be at moments like this where we have to make some decisions. We only have ten years to solve climate change and that's going to require a certain amount of urgency to enter navigating. It's just going to be attention and I don't like I don't have a recommendation to my colleagues on which way to go on this because I think there's justification for either. I'm going to air and then vote against this just because I have not had a chance to check in with some of the committee members whose voices are lifting up and I again apologize cuz I imagine if I had had these conversations last week probably could have resolved something and have Clarity and I don't think regardless of which way we go. I don't think it's going to make a huge difference for the law for Community for State legislation. Thank you Brian you want Thank you present how will the existing language says work with other Statewide organizations to advocate for changes to state law regarding rent control which I supported my original language that I was proposing was limiting how much landlord raise rent from year to year because I think it says very clearly what we need to do as the as it's being proposed the amended language work with other cities counties and Statewide organizations who advocate for changes to state law to provide more tools for local control stabilizer that is essentially the same substance as what we have what we have here in clausell existing. So I don't consider this language as a major step back. However, I will be voting no on this knowing that the amendment would probably pass just making sure our movement understands that you know, as you as you all have said in public. we're going to need drastic dramatic change in in how the city is run and winning rent control is going to be one of those components by itself and not solve it but it is going to have to we are going to have to fight to win Universal Mind control for your corporate loopholes because the experience of cities throughout the Nation shows that it has been a Lifeline especially for communities of color to follow councilmember O'Brien's lead well words matter but it's not the earth-shattering on this full sub sense of Powers Resolution. But okay, we're almost off to off the dime. Well, I'm supporting the amendment the language. I think it's very closely linked to our legislative agenda that we're pounding away. And I think we're all trying to do the same thing basically and so I want to waste a lot of airtime on it, but get ready to vote on the council member salon and comes number of Ryan have emphasized. There's not a substantial difference between the language in and deference to the sponsor and the conversations that he's been having with the Community Partners. I too am not going to support the amendment but I do think that had it had a comment that said including rent control or something like that. That would have been a little bit more clear of the intent of the body. I do think that when we say for a local control to stabilize read that is inclusive. So I appreciate that. I think it's coming over Pacheco that you brought this forward. I appreciate that that is one tool in the tool kit that we need to look at stabilizing rent. So it is clear to us. I believe that rent control is one of those tools and as we've done every year with the legislative agenda with echoing are strong desire to the state legislature to Cast from this type of preemption. I'm I'm I think it's an alignment. What was what we have done before but an effort to be deferential to the conversation with Community. I'll also be a no on this but appreciate there is that window there within the language of drafted for rent control to be a part of that tool kit. So thank you for your careful wording on that. We have an amendment that has been moved and seconded. And I'm going to ask you should reach an all those in favor of the amendment as stated by councilmember. Checo, please say hi and raise your hand. I All those opposed say no and raise your hand. So it passes the amendment passes and so we are still in the habit of the practice. I should say of describing any amendments that are embedded in council member O'Brien's version. Was it 3D? Free be so are there any other comments of the embedded amendments that any council member wanted to bring attention to customers Pacheco? I'll be brief and uses hopefully as a catalyst for both our other cities in the county and across the state to be able to utilize this as a as a platform to begin to implement more of a green New Deal cross our state. So thank you Kessel Run Pacheco. Okay. So now we're just going to vote on the Amendments a global a minute package of queso. It has been moved and seconded to subject version 3 B 4 version to F all those in favor of that amendments, please vote. Aye aye opposed the eyes have it. So we have a substitute version that contains all the Amendments and I'll turn into any council members for any closing remarks on the base. legislation in Green New Deal Thank you. Being advocating for the components that it is advocating for and it is an incredibly gratifying to see that the green New Deal movement spans across Generations all the way from the youngest people go to some of our oldest Elders. There's a lot that we could all say about the devastating impacts of climate change and I think public comment people were right is it not a climate change anymore its climate crisis and climate climate catastrophe that we're facing the dangers from natural disasters, like hurricanes and floods does deserts famine and rioting seawater cuz everybody else chords is watching the news the devastating summer. That's so many regions throughout the world and having with unprecedented heat waves including many deaths in Japan. I just want you to quickly Focus my remarks on what is not the climate crisis itself. But what is needed to be fight to what will be needed to fight back against this Global Calamity and the kind of drastic and dramatic change that we need that you all talked about. It is not an accident that we here in Seattle and activists across the country are talking about a green new deal with organisers and many organizations including the Democratic socialists of America have organized a campaign 2 hours and entrench representative and the Democratic party's political establishment in Washington, DC and to get Alexandria Ocasio Cortez elected in his place ocasio-cortez done did the right thing and alongside the sunrise movement led by many young people and other climate Justice organizations and activities sponsored the green New Year resolution in the house, but most importantly used that to help jump-start a renewed climate Justice movement throughout the country. This is not business as usual for US Congress as we know this is regular people getting their own Representatives elected and then forcing the political establishment out of its cozy board meetings with Fausto. Executives and into the light of day under capitalism regular people do not decide to not get to decide how our power is generated. We do not get to decide whether there will be housing we can afford we do not get to decide whether public transit will be available and efficient. We do not get to decide how our food is farm and transported big business and the richest people make all the decisions based on whatever will make them the biggest profit and wealth and riches and appropriately dramatic path for carbon-free Seattle by 2030, but the winning all of that will mean fighting for it. I mean going up against the power of fossil fuel companies and the Chamber of Commerce and the investors on Wall Street. There is no other way to achieve this the barriers to achieving a green New Deal and a shift away from climate change are not intellectual or knowledge base the vast majority of human beings on the planet. Now know the crisis we face. In fact the communities that are the most marginalized and are most disadvantaged are the clearest about the dangers that faces. The barriers are where the power lies where the balance of power lies. We need to replace natural gas-burning electricity generation of private for-profit company Puget Sound Energy for Puget Sound Energy will not voluntarily stop burning natural gas not because they don't understand the science of climate change, but because their profits depend on continuing to burn natural gas and so on and so on same Arguments for affordable housing why we will need to go out. The real estate Lobby and why we will need to tax big business to fully fund public transit and make it 3 and I appreciate that being included in as an amendment in the resolution. So for us to win all of this will require building a fighting movement and that will require also having the labor movement on the front lines and making a just transition to an infrastructure that protects the climate cannot be an afterthought in appreciate the janitorial workers and SEIU Local 6 being here as well to testify that's very important to work for fossil fuel companies are not the cause of climate change. They are just like us making a living to feed their families building the electric trains wind turbines and everything else that will be required for a green New Deal including energy retrofit clean energy retrofitting of residential and commercial buildings. All of this has the potential to create millions of Public sector unionized living wage jobs every worker in the fossil fuel industry should be guaranteed a good unionize job with the green New Deal on the green infrastructure and the real videos the workers in the fossil fuel industry are in an incredibly strong position to fight for a green new deal because without their work without their labor fossil-fuel billionaires don't get to make a penny of profit Sade, you know by using their the Striking of your labor stand to be on the Forefront of fighting for the green new deal. I'm really excited to vote Yes on this resolution thank councilmember Brian and his staff for a working on this with the community and with my office on many of the amendment, especially appreciate strengthening in collaboration with my office painting the language of solidarity with workers and unions and in the fossil fuel selector. I think that's incredibly important to appreciate that we have stated in the resolution now. Public transit should be free not as affordable, but free, I think this is very important. We now have language on social housing progressive taxation and all of that. So I think this is a very strong resolution on which to base our future fight on last but not least. I wanted to congratulate among the many organizations including the indigenous communities that have been on the front lines and I showed incredible leadership. I want to specifically today congratulate Fridays to the Future II campaign led by public school students and especially declare my office is solidarity. I want to do especially declare a solidarity but Zoe Sherman who has being a courageous activist on many issues including against climate change. Who was this past Friday egregiously arrested by the Seattle police depart Department. I think this was a shameful incident that happened and I think Zoe and her fellow students showed incredible. That is very hard. These are 13 year old students. I think it's very important that we publicly declare our solidarity with the public message to the King County prosecutor. I really hope we are not going to see any charges pressed on Zoe or any other student. They are fighting against climate change any message the King County prosecutor's office should be about fighting climate change not about jailing young people. Let's let's fight for the green New Deal and happy to vote Yes on this. Any other comments before council member Bryan closes out with a few brief remarks? Pretty good, cuz I want you close out a few remarks. Thank you so much. I'm really excited to be here today and to have broad support on this Council away. But I hope will be bought support of the council when we vote in the moment and in my nearly 10 years on the council. I've been so proud to work with a group of folks who have always tried to do the best to Center the climate catastrophe in the work. We do a man lift up Community Voices and I think this Builds on that Legacy that this is going to be hard work and the only way we're going to do this successfully is we have have the power that each of us individually hold working together to fight this specifically I I see people here and testify or they represent Frontline communities that are bearing the impacts of climate change and other environmental Injustice and their communities on a daily basis, and I also see people who've been working too. Like the climate catastrophe for decades, and I think it's it's important that we continue to have the conversation about what that means. We lift up Frontline communities. That doesn't mean the rest of us going to go away. We all need to show up and bring our power and strength to do this work, and because he's a new relationships. It'll probably takes a while to figure out our respective roles at different points in time. I've been really pleased and working through this process to see a lot of work done on building relationships, but I want to be clear that whether you're new to this whether you've been suffering from the disasters whether you have been an advocate for your whole life, which may stand multiple decades. We need all of you fully engaged on this work to be successful, and there's a role for everyone of us to play regardless of what neighborhood you live in regardless of your income level your skin color immigration status religion. Everyone has a role to play and we all need to be United against the few interests that are making billions of dollars off is catastrophe. Thank you for Leadership. Thank you cast from Bratz. Okay, here you go those in favor of adopting the resolution as amended, please vote. Aye aye those opposed vote. No motion carries. The resolution is. The insurer will sign it. Thank you. And before the ink is for the ink is dry. We're going to rush this to the county cuz you hurt her Catherine gossip says, so please call the next agenda item 7 appointment 1389 appointment of Samuel Ferrara as member Levy to move Seattle oversight committee for charity December 31st, 2022. The committee recommends the appointment be confirmed cast member Bryan pick up the pace a bit here Sanford hours for range of project management areas including Communications subcontractor Staples the Public Funding project efficiencies in managing project finances as a new addition to the levy move Seattle oversight committee his expertise professional and otherwise, we'll be greatly welcomed. Look forward to appointing him. Any questions or comments on this appointment? All those in favor of the confirming the appointment, please vote. I I suppose both know the motion carries an appointment is confirmed. Please read the next agenda item planning land use and zoning committee agenda item eight resolution 31896 identifying proposed comprehensive plan amendments to be considered for possible adoption in 2020 and requesting that the office of planning and Community Development and the state County Commission review and make recommendations about the proposed amendments. The committee recommends a resolution be adopted as amended. Okay, so I'm now in the unprecedented situation where the chair just got up, right? Okay. I said the unprecedented situation agenda item number HG. Sorry I misspoke. We are not on the right H and you have the floor on the comp plan Amendment. Sure. So this is the annual comprehensive plan amendments doctor setting resolution which Q's up the dock of amendments for additional analysis and recommendations for the council to consider next march the docket includes two new applications for amendments 1 to extend the boundary of the north gate urban center to add two properties and another to extend the boundary of the West Seattle Junction Hub. Urban Village to include the Providence Mount Saint Vincent property. The doctor also includes items at the council has previously requested the executive to study including identified a new name for single families owns potential amendments to the Delridge neighborhood plan and more the plants can be passed a few minutes to the doctor as well counselor O'Brien proposed request and Analysis of amendment to clarify our intent to protect public health and meet climate goals. We also pass an amendment to remove the state industry proposal and other specific industrial and amendments from the docket number O'Brien has an amendment in line with what with disgust and committee and which I support that would replace Industrial. Which language left and the resolution so I will throw it over to him. Thank you, Katherine Pacheco. Kuzma Brian. Thank you, So you should all have a copy in front of you. It's this we have lots of copies of things in front of us. If I staple document that looks like this and it has red line version in so I wouldn't move to amend resolution in 31896 by substituting version for bo4 version 3K. This is just for the Amendments. Did you need to say anymore about that version? Cuz my Brian I will speak to briefly if that's okay. Yes, please. I'm not going to read the whole thing for second time and want to just highlight what we striking the language that was in section 2 and replacing with this new one calls on the the city to do detail plant work plan for industrial and review including key meetings milestones and deliverables and report back to us by December Thirty-One. It also generally says that we cannot move forward with I'm making individual land use policy decisions in industrial and until we have an updated lamp industrial and policy and ask the mayor to convene a group wenis list the number of stakeholders that should be included in that trying to keep it at a high enough level to be to leave some room for the for the mayor to decide how to do that work and then they come up with some puzzling to the council before we will consider are the types of land use decisions that were proposed to be doctor. Did we believe that the mayor is actually ready to announce some of that this week and hopefully we can move swiftly and build on the prior work in the previous years to resolve some of the ongoing issues around industrial and use that have really kind of stated what we want to do for dinner at almost certainly be to a future Council that I will not be part of to make those decisions. But but but I think it's important to do that work very good. This is just on the amendment any comments on the Amendments cancel my herbold. Thank you. I just want to State for the record that I'm supportive of this pendant. And I also want to emphasize the need to work from previous recommendation. So the stakeholder it group is not rehash. She knows previous recommendation that I do recognize that some some physical conditions related to Nashville and have changed. But again, I think it's been very difficult for a lot of the stakeholders to have to continually spend time and effort in reviewing the need for a new industrial and policy get so far get a new mayor and start from from square one. So I appreciate the request for a work plan and stakeholder group so that we can emphasize the desire to move forward on this. I want to State for the record that I had crafted amendment that an amendment that was not her. On Wednesday because I was concerned that the votes might not be there for councilmember O'Brien's Amendment. So I'm glad that wasn't the case. I did have a compromise proposal that would have docketed the stadium district North of Royal Brougham way and east of Occidental Ave. That would have also limited residential used the north of Charles Street in the purpose of that moment was to try to move forward where there was previous agreement from stakeholders from the 2013-2014 process. All of that said I wholeheartedly support the direction that were at that we're moving in now, and finally I just want to make note that as I mentioned earlier this morning as it relates to the WASP property. I found out that my office has done in National an initial reach out to wash. To understand their timeline for the sale of that property because of concerns that I've heard from stakeholders. In the in the area about the sale of that property moving quickly prior to the council being able to act on recommendation. So there are just an initial reach out. I think will be necessary follow-up and I think some communication from the council and the mayor to wash. Would be would be helpful in the future. Do this only amendment only so many other comments on the amendment. Okay, all those in favor of substituting version for beforward version 3 please say I was opposed the eyes have it and any other comments on the resolution councilmember Bagshaw. Cancel a check of thank you for picking this up. I know you're stepping in in April and building on years worth of of work that had already been done. So I appreciate that. So I want to focus on a couple of things. First of all his timing. I would really encourage the mayor's office to fast-track this as council member herbold just mentioned. This is not the first time we've looked at industrial and we've been spending much of our time over the last 12 years. I think this is will be the third large study on the use of industrial and I'd love to build on it not starting over and give ourselves a date. I think it March 31st was the date that we're asking to have information come back for compline purposes. And so with that a couple of things that I would really like to see in this next bit of work one is about in the stadium District itself the potential of having Makerspace. There's a warehouse their love to see that continue to be industrial manufacturing light manufacturing but allow affordable house. On top of that. It's far enough away from the port facilities that I believe that affordable housing would be very useful there for individuals that are making and doing the work and providing services to the port. So I think that's something that we should look at could look at and actually make a difference and I've heard from some of my labor union friends that are saying yes, they would like and would support that also with potential for the waska property something that came up a decade ago now is to convert that the zoning to allow hotels in that area with the port starting on pier 48 for new cruise ship terminal and with the stadium the ballpark right there. It could really do a lot for Pioneer Square, which is just just north of that area, but also provide the green space in open space and perhaps even some park space for people that are coming and going in that. Also, I just want to underscore preserving industrial Land South of Holgate is something that I've heard over and over again, but allowing some some used for either affordable housing, or as I mentioned. The hotel's is something that I've heard could be a good compromise and then fast forwarding to the north part of our manufacturing industrial area again, I'd like us to really, but I do a special look at Makerspace with a potential affordable housing on top in the north area as well. Primarily Port property at this point. So those are the things that I would like to add and ask for them to take a special look at and see what we can get back by March 31st of next year. Think you can spare Bagshaw any other comments before we vote on this resolution cast member bascetta Ryan for your work or the last 4 days on the language that you all crafted. I know that we've received notes of appreciation from ILWU members other Maritime unions and Port Commissioners. So thank you for following through on the desire to have the timeline set and to be really inclusive who's at the table so that we can have assurances that we're going to move forward with this analysis, but also recognized that the mouse is needs to be comprehensive in across the city. So I appreciate your quick work on that and just want to say thank you. Play don't step in any other comments by, take out one part that particular where the change a single-family zoning the changing of the name. I think so as we all acknowledge language matters, and so being intentional and mindful of that conversation as it moves forward in our city potentially for the next council is something that I you know what I think it's it's good and for my colleagues will be here. I hope you can continue to support that conversation in terms of a way that's more inclusive so that we don't pit one against another on the issues that come before I City with regards to land use. Thank you. I'm also take a moment to highlight section. What's been remember to section 5 and ask that they the department provide recommendations for potential environmental and used for utilities elements to clarify the season 10 to protect the public health and meet its climate goals by limiting fossil fuel production and storage. We really heard council member King County council member Gossett speak to his co-sponsoring of moratorium that the county placed on new fossil fuel infrastructure the county we're taking a slightly different strategy at the moment. They're trying to get to the same in game, which is also consistent with some of the things that folks working on the green New Deal of Asus to do thank you for the shout out to some of the recommendations are the inclusions in the comp plan amendments docketing resolution that relates specifically to the Delridge neighborhood plan and requesting. Commendations from opcd in the Seattle Planning Commission. The Top Line issues are how to increase usage the parks Trails cultural recreational facilities by engaging historically underrepresented communities in the planning process of coordinating with community members and supporting the Delridge Community Center the Southwest teen Life Center in Youngstown to provide culturally support a programming reduce pollution and stormwater impact to Longfellow Creek with Drainage Systems in the public right-of-way increase sidewalk cement The Pedestrian master plan and engaged in Sound Transit 3 station planning focused on transit-oriented development efforts and finally and very importantly increase opportunities to access healthy affordable food and support Urban farming and education. Thank you. Okay. Thank you cash my Pacheco for bringing this forward. Okay, we have an amended resolution all those in favor of adopting the resolution as amended please vote. Aye aye those opposed vote. No the motion carries two resolutions adopt them show us sign it please read the next agenda item number 91119 590 for relating to interpretations Corrections and revisions of the Salem Expo code creating the position of code reviser, the committee recommends that they'll pass. Thank you, cuz I stated to you during a brief again as as disgusted our Council and our committee meeting. This is the cementon basically gives authority to a place called the code reviser position for the city of Seattle in this position. If I will be housed in a lot of partment, it will be an attorney qualified and designated to call Define revise city laws are without substance change or alteration of purpose or intent the City attorney in our Central staff is found this position to be needed given the complexities of code changes. And sometimes it is a single change May reflect itself in many ordinances. And as many of you know as legislators just often gets a complex and its designated Position will truly have a subject matter expert house and a lot of partment Ed use for us when we consider legislation and currently there are two paralegals who are serving. Legislation legislation editors, but we think this newly-created position makes sense. swan Big Sean herbal eye Juarez mascara O'Brien Jayco president Harold on a post 7 + favor and unopposed 7 in favor and a lot of partment is relieved. Okay, please read the next agenda item locations and Technology projects in 2018 allowing that any unspent funds from an individual project maybe apply to another project that meets the goals of the digital Equity initiative. The committee recommends simple past largely cleared from Community activist. We have a few loyal. Patrons here. This is actually I think some of the most important work that the the city does. This is our technology matching fun programming it authorized this particular legislation authorizing the dispersion of $320,000 from Seattle Information Technology, sat from their digital engagement budget summary level in in short. This is money's that will go to 11 community-based organizations that will allocate 300 mm Community matching resources to do some very meaningful and effective work in terms of addressing the digital divide. I'll just start a very quickly describe some of these projects on the South Park Information Resource Center are empowering South Park's non-english-speaking residence increase digital literacy skills to help them gain employment and access resources on the Atlantic Street Center. I'll tell you I'll just write a name the names of the organizations and many of you are very familiar with So they reside in your District. I'll just go to name. The the recipients the Atlantic Street Center can on Healthcare Center multimedia resources and Training Institute. The Seattle neighborhood group the Jack straw Foundation The Dress for Success Seattle. I think that's sort of a cold they help low-income women, especially women of color to get in succeed in web design and computer coding jobs in pairing them to break the cycle of poverty for themselves and their families and last a real change homeless empowerment project. So we as a city are making these Investments because we think that digital access and literature going to be absolutely critical toward everyone success and they certainly are on I want to thank all the people that sell information technology that Community College advisor group The Volunteers the folks that evaluated these proposals we can find everybody we certainly find us some supercharger on thank them for their very impactful work. Looking at these Awards any questions or comments? Okay, I'm going to give cancer man back. So I'll chance to vote on this exciting legislation. Please call the roll on the passage of the bill. Mascara O'Brien president. 7 + favorite on a post in sight and Tower the committee recommends the bill pass FAS finance and administrative services to execute a 15 year lease with Cascade public media governing our continued use of the transmission site and Tower for radio equipment and Associated an antenna and we've had an arrangement for some of that cage with the Cascade public media is it was just formerly known as kcts television with their Arrangement at the transmission site and the 410 foot tall tower and this continues our relationship. We've had since basically 1992 part of what we're doing our housing what was passed in 2015, which was a ballot measure. Authorizing an upgraded Regional Public Safety emergency radio network, otherwise known as peace earn. And again, this would be necessary this legislation be necessary to make sure that we are accommodating the technology technological needs of the peashooter and infrastructure any questions on the passage of the bill. Swan by Sean O'Brien i7 and favor not opposed. before I It's getting late in the day. And I just want to make sure that for these next few items. We have at least seven members here that are necessary to pass the several of these budget items that are forthcoming. So just a forewarning can please read the next agenda item. The finance neighborhoods committee agenda and 12 Capital One 19572 many organs 1254923 which amended the 2018 budget the committee recommends the bill pass and cancel person. I want to give you an opportunity to weigh in here. I can move through this fairly quickly. We've had two committee meetings where we went through. What did I do that? I like that. Anyway, the point is we've had multiple committee meetings on this. We do have some amendments that came forward we suspended rule to bring him forward today. If you would like I can just go through a very high-level explaining what these ordinances are what they do with the dollar amounts each and we can vote on them fairly quickly. If you all would really like to stretch this out of got enough information to keep it there till 6:30. So what is she what is your pleasure? You're welcome is that we're not going to read each one into the record at first, but why don't you take us through each one? And then, consumers can comment on that particular Bill and then we get to the Reading part will just go through a series of votes if that instead of introduce talked about so why don't you just walk us through the different bills and then we will come back and read them into the record for the vote piece of it is down there that people are saying thank you very much and let's move this. Okay. So I am 12 is What's called the exceptions ordinance and this will a mandar adopted 2018 budget which scares me to death since we're only 6 weeks from our next budget process and that covers unanticipated costs that will realize late in 2018 and it resulted in spending exceeding Appropriations. The Department's did have the money the bill increases the final 2018 budget by 13619000 and $32 of which slightly lower than Thousands for direct general fund expenses the largest increases or technical in nature due to changes from the new budget and the finance system questica item 13 is the grand acceptance ordinance down as I spoke many times about this we have to have been offered grants. We have to accept them before we can spend the money some of the grounds come toward and before the police department summer for Park summer for other departments, but that's results in about 3.7 million of funding to us item 14 is our supplemental budget ordinances Council Bill one 19575 the net appropriation increase proposed in the second quarter supplemental Bill including some Grant back appropriation is approximately 72 million of which 6.9 million is the general fund in committee on Friday. We adopted our attitude is Appropriations by The Cutting funding for approximately six hundred Thousand Fists were some of the items that council member Miss keita and I spoke to earlier today and that included a downtown Emergency Services Center nurse lead at law enforcement assisted diversion a database all of which I think are very important for the progress that we're looking forward to around our Human Services docking on the AIDS Memorial pathway the amp phase 2 we had two provisos that were funded for Human Services contract adjustment Highland Park intersection improvements thank-you councilmember her both for being that forward University Heights accessibility Improvement for a new elevator there 85,000 for food bank support the green janitor education program for $35,000 and at Daybreak star native cultural organization organization support approximately $100,000 for some one-time Capital Improvement. Item 15 is our Capital Improvement program abandonment ordinance. And what this is argon going Capital project. Some of them have been around for a decade. The projects are finished that we had some some additional monies that were left over amazingly enough coming in under budget and that money will be if it's unused will be re-appropriated for a 2019 adopted budget and then we had some carry-forward Appropriations. And these are used to re-appropriate funds that were previously provided but not yet expended for various purposes in the 2018 budget for the items. Do not increase the level of authorized expenditures in 2019, but it was adopted on the assumption that most of those expenditures would have taken place and therefore there's no additional impact in our 2018 budget going forward. I'm sorry 2019 budget and That's it. So I'm happy to entertain any questions. Otherwise, I'll I will ask everybody to chime in here and we can build on them individually and so but I would prefer to do is vote for 12 and 13 and then relinquish for two customers mascara for fourteen if that's okay with customers. K212. Okay, absolutely out of number 12. Please call the roll on the pastor the bill president Hero 7 and favor not opposed. Please read the short title of Legend item number 1319 acceptance of funding from non City sources, the committee recommends the bill passes amended. Please call the roll on the passage of the bill. O'Brien O'Brien Pacheco president Harold Constable 119 575m anywhere near 2574 which adopted the 2019 budget the committee recommends a bill passes amended council member of mosquito. Would you like to I'm sorry, perhaps even someone can describe them as well. So would you like to see more worried about the base legislation on a Janome 14 customer and Becca, I would like to speak to two of the items day is memorial pathway and the Highland Park roundabout and I'll be very brief. Mostly just want to thank Terry Bradshaw for doing my work for me in committee on Friday when I was unable to be there. I had two amendments that I was sponsoring but she carried them forward for me and I'm very appreciative one amendment was to fund the AIDS Memorial pathway. This is following up on a lunch and learn that many of us attended and the funding will assist the project in continuing to gather itself determine personal narratives regarding HIV AIDS and allowed to move into phase two of the project which will in addition to Gathering new narratives will broaden inclusivity and apply learn narrative Gathering behaviors and increase opportunities for diverse communities to share those narratives as part of this project moving forward and then in addition the other amendment that we that we had was to Correct an error in the budget process last year for the capital Improvement project last year. We created a CIP project for the Highland Park roundabout to earmark some already dedicated funds by the Department of Transportation. And the the earmarked funds did not actually accurately represent with the commitment was from the executive so far. So the commitment from the executive is actually now properly reflected in in the amendment in the CIP. But in addition, we also have adjusted the total cost of the project to more accurately reflect. What's up with the project will cost. So we're going from a $200,000 commitment to a $500,000 commitment to accurately reflect with extra has put forward to the project. Do cancer and her bows customer mosquito the number of items and if I'm I'm mr. President. I like to talk about a few of those items and then I'm happy to when you say go and talk about this light Amendment included in this budget with the council's full support a continuation of our efforts to make sure that there's an inflationary adjustment for Human Service contractors for being able to bring forward a small amount from last year's budget that was under spent makes it clear that we're reaffirming counseled intent to support those workers who provide the basic social safety net and the backbone services that are City really relies on for our elders our kiddos women people who are victims of domestic violence individuals who need assistance with housing in those who are trying to get out of homelessness in this is a really important way for us to stabilizes organization. So thanks for your work on that. Number of bags show this morning as well mention the testimony that we heard from you in a few Heights last week you Heights district has been calling for the need for there to be an elevator because the list that they have with their stairs. And again, they're old beautiful old building does not have an elevator in it was proud to sponsor along with council member Pacheco the need for us to include funding from the city level to be coupled with State funding and other Community Partners to create accessibility throughout the building by creating an elevator. That's really exciting our friends from SEIU 6 are here and wanted to say thank you to Our Community Partners who have been working with us from Seattle are 20 20 30 Seattle and SEIU 6 hours at the city Office of Environmental sustainability as well or really excited about the opportunity to create a green gender education program to train between 30 and 50 janitors. To clean our lead building Sprout Seattle a 30-hour curriculum on green cleaning is not only good for the workers, but it's good for meeting devary environmental standards as strategies. We talked about earlier today and hopefully reducing energy consumption and water consumption, which is what they saw in the city of Los Angeles as well. So this is a huge opportunity to try to meet those goals and citrine Atmore janitors in a real growing sector to make sure that our buildings across Seattle not only are built leed-certified but that we have the staff will train to make sure that they can clean those buildings if using healthy healthy materials and keeping our buildings are workers Generations healthy as well. So thank you guys for continuing to be here and for your work on that as well and Mister Mister president, if you'd like I can either move the amendment now on item 14, or I can hold back if you wish. Also comes very scary sweet to your Amendment, please in partnership with councilmember, whereas to help to leave the effort to ensure that there was a community space for our native community at Daybreak Center. We have heard over the years that the very entities who are serving some of our most vulnerable communities in providing them with cultural space and the ability to have access to services that buildings are in need of repair. It's been really exciting to work with her that organization and the individuals out of United Indians of all tribes and to recognize that this amendment doesn't specifically to them but helps us make sure that there's opportunities to support our native cultural organizations with providing access to utilities and upgrading bathrooms and kitchens. A really great way for us to use some potential Surplus dollars that have been found and use one time infusion into capital projects. So I think the chair as well for her support with helping to direct us to those one-time infusions that will really make a meaningful and Lasting Improvement in two structural structure or structures that serve our community, especially our native community and I would love to turn over to council member War as if possible as she has been a huge supporter and leader in this effort. Thank you. I've been dying to talk all afternoon. I just want to say thank you counselor back Shawn kasserman skated for being such big supporters of United Indians in Daybreak Star. As you know, that facility has been in need of repair for at least two decades. We tried to build the people's Lodge under the direction before we lost Bernie Whitebear and we were met with many legal challenges. So hopefully someday we can revisit that and realize the dreams not only Bernie Whitebear, but the whole native community in building the people's Lodge and I'm hoping in the future we can focus on La batea, which is the group home of United Indians as well. So, thank you very much. Custom Awards. One thing on that I want to acknowledge that the one-time funding is going to go into capital projects like you mentioned Withers restroom or just fixing up some of the facilities downstairs and we use this facility a lot for our Parks efforts for various community meeting. So I think it's such a Community Asset that needs said upgrading it was a good call and thanks for bringing it forward. Customer Moscato is really a change to the reference in the budget control level. This is on page 3 modifying modify item 1.24 to instead of referencing leadership and administration division, which is 00100. OHS h5000 it would instead reference supporting affordability and livability which is section 00100 bohs 10000 second one. All those in favor of amendment Amendment 1 please say I I opposed guys have a minute one has passed now to consider councilmember O'Brien's proposed amendment. I'm going to have to suspend the rules. I'll do that by motion all those in favor of suspending the rules to consider custom O'Brien's amendments. I will move for that to do that. Okay, so moved and seconded to suspend the rules to allow a discussion cast member Brian's Amendment all those in favor. Say aye aye opposed the eyes have it. So the rules are suspended customer Brian. Will you walk us through your proposal language? Thank you. I got some feedback over the weekend and so added a line to that but it's all we know. It was not circulated in time. So thank you for suspending the rules. I would like to move to amend cancel that one 19575 is presented an amendment to be what this does is it builds on what it my previous Amendment says which was allocated and just $100,000 to addressing homelessness PCL and add a Proviso to it. It says of the appropriation in the 2019 budget for the addressing homeless budget summary level of 100000. What is appropriated solely to provide assistance to people experiencing homelessness who occupied vehicles in the event that a Prohibition is placed on allowing a person to occupy a vehicle in exchange for rent or other considerations descendants. These funds should be spent to provide support to do to the probation to be as his last sentence, which says no portion of the amount. So appropriate she'll be used for indirect administrative costs and then it remembers following sections. Very good. So that is the proposed language. I do have an extra hard copy if it's been passed around I catch my herbo. We heard your points duly noted at the briefing session this morning, you're walking or pizza and feel like At 5:42. So O'Brien describe the amendment you have the language dessert first was their second and second has any further discussion on the amendment only. All those in favor of the amendment, please. Say I opposed the eyes have it? Okay. So now we have amended legislation for agenda item number 14 a council member Bagshaw. Did you want to see any other closing words on Amendment on engine item number 14 it arose last Friday after we had our art discussion about the RV legislation and I want to underscore that. I'm delighted to be putting this money in the budget and I am asking the mayor's office and members of her team to make sure if the RV legislation goes forward that we are supporting the people who are getting removed from those RVs and that we have some 24/7 place to put them so I think that's the intention as we originally discussed his but we don't want to limit it just two people that are being removed because of potential new RV legislation I support Remember Brian and I am delighted to recommend item 14 as amended of the bill as amended passes in Cherry silent. Please read the next agenda item the short title, please. All right, I'm 15 Capital One 19576. How many organs 1257 24 which adopted the 2018 budget the committee recommends the bill passed? Okay any other comments on a gen item number 15? Okay, no questions or comments. Please call the roll on the passage of the Bill O'Brien Pacheco president Harold 7 and fast in the chair will sign it. Please read the short title for a gin item number 16 past tense verb extra security for It Forward ordinance that I mentioned previously. I don't think I have anything to add to Enlighten the crowd. Sing then. Please call the roll on the passage of the bill president Harrell 7 and favor not opposed bill passes in it. I believe that concludes our agenda items for the day. Is there any further business to come for the council council member Bagshaw? Thank you for your help in putting all this together with your son, and this is a precursor of what we're going to have in 6 weeks. Thank you. Council member would love to hear from you, I believe so. Yes it is. Correct. I just want to have a lunch and learn that day between Council and Counsel on the gig economy would love for us to be able to come and hear more about sort of what we're hearing from Community Partners around everything from drivers to changing work in in traditional Industries and cropping new industry. So I'll look for that announcement to come from us later this week as well will be on recess for 2 weeks are next full council meeting will be September 3rd and everyone have a great rest of the afternoon the great recess with that we stand adjourned. Thank you for three weeks worth it.", "end_time": 13258.4}]}