{"format": "raw", "annotations": [], "confidence": 0.9375255538357629, "data": [{"start_time": 0, "text": "And everybody thank you for being here. This is the Finance in neighborhood committee for April 10th 2019 and it is somewhat after 2 p.m. I want to welcome you we only have one item on today's agenda and that's Council will one 19490 regarding at supplemental appropriation for a waterfront local improvement district. So before we get into that, I'm going to ask for public comment. I see we've got one person who is now becoming one of our frequent visitors David Haynes. Thank you and you have 2 minutes. It would be great. If the director of The Waterfront Improvement and the council could pay attention to the details. They're supposed to alleviate the oppressive accommodation to the modern wheel and I'm specifically talking about the metal clanging and banging man cover manhole covers that are like latches latch doors. They have them specifically right in the middle of a Highway Lane of traffic that's in the Waterfront street now and whatever set of tires are if it's a concrete truck, there's three separate like oppressive PTSD into noise polluted banging and clanging and they have to do something about improving the Waterfront District bike not allowing any more of these latched manhole covers in the middle of the road means like there was a family this morning when I'm riding a bike ride and their kids got startled because the cars are just hitting this metal latch repeatedly. What's the address? Marriott and the Marriott is going off that he's got to do something about that the whole time you develop. It don't allow any more of these metal cleaning. There's other places in this city that have these problems and people walking along the side of the road just too much of them to deal with you're expecting a waterfront is peace and quiet and like twenty-first-century. Let's keep like that on all the details. You don't have any oppressive reminders of the twentieth Century's failures to like alleviating Point appreciate that. Okay anybody else? Want to speak? Okay, seeing them and let's move on to our first item Allison if you'd be so kind as to read that in. Thank you, Brian and Absolute at the team at Marshall. We got Dory item number one Council Bell, 11949 0 and Ordnance relating to the central Waterfront Improvement program authorized in the director of The Office of the Waterfront and said that projects to execute an agreement with the Washington State Ferries for the construction zone facilities to support electrification in fairy festivals at Coleman Ferry Terminal will done. Thank you Marshal. Do you want to start with introductions Marshall Foster director of the city's office of Waterfront Inn Civic projects finance manager of the office of the Waterfront Caleb Wagner City budget office Eric son to cancel Central staff here for Eric McCarty. Venable City budget director Welcome, all of you. Take it off Marsha Laura Story doing them. See I got the scope. So this legislation revises the 2019 adopted budget and the 2019 to 2024 CIP for the Waterfront program. The revisions include changes to the cash flow for the Waterfront program that are related to the LI deformation ordinance that Council passed in January of 2019. It also make some other changes to the budget that were brought came up after the budget was submitted to counsel last year. Updates as I said the funding plan to be consistent with the LED authorizes our office to enter into an agreement with Washington State ferries to allow us to construct electrical improvements to support hybrid fairies. It also add some external funding. The next slide is actually one that we showed to counsel during the LI deformation. This is the the funding changes that were made as part of that formation to cover the revised l i d amount. We made a 5 million dollar cost reduction in removing three Promenade kiosks. We had additional philanthropy. We added some Waterfront MPD funds converting operating to capital for the Waterfront Park and we added some additional CPT bonds and some read and this budget actually revision changes the CIP to reflect those those decisions that were made. Thank you for bringing that up and thank you for adding the slide and I just want to remind folks that the 8 million dollars that comes from our Metropolitan Park District was it's not money taken from any other Park had been a line item for operating cost for the park in the Waterfront. But since things were delayed for a number of reasons, including birth and a few others is that that operating money was recaptured in use for Capital. So again, no other Park in the city is being as losing any funds for them. Yes, that's correct. Thank you. The next line so the additional budget changes beyond the LED budget changes is are we are adding $2000000 to the Alaskan Way. I Am just sharing connections pie in this pie chart writing $2000000 from wash. Reimburse us for design costs. So that's new money from wash. We're also adding 10 million dollars of from the Washington State Convention Center for Public benefits for their street vacation that Council approved last year. They've already given us the first check this legislation allows us to authorize is us to accept the funds and to be able to spend the money and I just once again went to underscore this money is going to the pike-pine corridor east of Pike Place Market. This is not water from money, but it does help us with the connection. That it increases our total project cost to 724 million for the entire Waterfront program. We also will moving to the next side will also allow us to accept funds from Washington State ferry to build the electrical service to Colman dock Marshall mentioned that this this is a pretty remarkable design change. We decided to reuse an existing sewer line to allow us to run the electrical cable without impacting the the ballast Island fill that has some tribal and Native American significance a and thank you for that. And also I just want to acknowledge to all the people who are living and working in turnout in and around the Waterfront that is not going to be dug up again. Thank you, and thank you for that creativity and also for protecting the native land I'll just mention wanted one additional thought on this and it is a very exciting first step that's taken place here with you. We had a long-standing partnership with the state and with Washington State Ferries where they are moving to essentially hybrid vehicles over time, which will reduce their carbon footprint in the region. The diesel fairies are significant source of carbon emissions, and this was a late addition to the program that I was not originally scoped and our space for Conduits for all former utilities on the waterfront is very limited and we were just we're very pleased to be able to make this happen and are able to to do so as Dory said by using a cinch he would have been a I left over sewer main so not an actress or maybe the leftovers to remain repurposing that together provide the conduit without impacting any of the other resources in the area. And really that was the last slide and sorry and so if you have any questions, you have legislation glad to answer them Caleb. Do you have anything you want to add Eric? I do want to acknowledge that I had a pre-briefing on this. So I appreciate that. You've already answered the questions that I had and I also want to acknowledge the tremendous amount of work that all of you have done and then over the last fourteen years have also done. But thank you for that. Thank you for bringing us to this point council president heroic. You have any other questions or thoughts? I know that that this that you are well familiar with all of this to but if you go further discussions, okay. Well then I would like to move approval of council Bill 11949 0 as presented supposed to nobody abstaining. So this will go forward next Monday 4 for their approval by the full Council. Very good. Thank you. Thank you. I believe that. This is the only item. We had on today's agenda. So I appreciate your coming. Thank you that in the meeting is adjourned.", "end_time": 651.9}]}