{"format": "raw", "annotations": [], "confidence": 0.9567371510407504, "data": [{"start_time": 0, "text": "Good morning. Thank you for being here for our regularly scheduled May 20th. 2019 Council briefing. If council members who want her bold Pacheco Moscato and Gonzalez with us this morning. And if there's no objection the minutes of the May 6th, 2019 meeting will be approved, you know ejection. The minutes are being proved of this morning. We made our copies of the minutes of last week's briefing and I announced it would we are required now to start the process by which we will approve the minutes. I will for the first the next couple of weeks make hard copies of these minutes. Although they're sort of bare bones to some extent. This is a beginning format. It's likely to change. There may be some additional information provided and some information deleted, but we will make sure we comply with the rules. And again, this is the I think the second one that we've approved and so bear with me while we get a good product that meets all of our needs and again, we will continue with that process. So thank you very much for the city clerk and I would ask the city clerk's office to chat with me after this meeting so I can give you a little feedback on this particular one and we'll try to prove it. So thank you for that. I let's go around the room a little bit. Preview of today's full Council actions. We will do that after we have our federal legislative update. I will dispense of the presents report until we do the pre preview of today's city council actions and I cuz I have a proclamation some other things just as simply describe to you, but why don't we defer that until we go around the the table and go through a full city council actions and why don't we hear from our federal legislative team first, and thanks for being here and Leslie so come on forward. Oh, I'm sorry. Yes. Yes. Why don't we just come back to the present report? We are always going to be the Leslie about day before we get our full Council actions. And so So why don't you start off with introductions just jump in. Good morning, everybody MCR how it brown director of federal Affairs for office of intergovernmental relations, and we have our federal lobbyist Leslie pool near here in Seattle. She's been doing some periodic Skype briefings with you all but hoping to get here here quarterly, maybe twice a year in person so we can do something person visits with departments and I'm some of you all as well, but Leslie's going to go through current update on what's happening at the federal level legislation and operations. If you have any questions just jump in but we'll walk through some of the probably more pressing issues that are irrelevant right now in DC and I'm going to stay high level cuz I know that you have a very full agenda today, but happy to take any questions, so It's good news category. The house is moving forward with Appropriations actually pretty quickly, and they're trying to get all of the measures all 12 measures onto the floor by June which is ambitious, but they are moving them through committee and they are. They did not read reach a congressional bipartisan budget deal. The house is has set its own top-line spending measures that are barely high and actually a considerable bump up from fy19, which is really good news. They've already approved the labor Health and Human Services and education bill. And they are working this week on energy and water and interior one item to note that we worked on very hard and energy and why it should be in the interior bill is a new Workforce program that we worked with spu on and that's our water Workforce program and that was received their preparations of a million dollars. That would be Workforce training specifically targeted to the utilities sector because as we know over 50% of that Workforce is expected to retire over the next five years this week. We will also have the transportation Housing and Urban Development Bill marked up in the subcommittee and we'll be watching that but that's expected to have a 7% increase obviously contains a number of programs that are really important to us. So we're going to keep monitoring that the Senate of course is moving much further behind and we expect that the Senate is going to have lower numbers in the house is working off of all of this of course will then be negotiated? I'm in conference. But again in an effort to avoid any kind of government shutdown. It's a good sign that the house is moving forward and also that the house is going to be starting off from a very strong negotiating position by pushing their numbers up. So the next 56 we're going to hear about this week is infrastructure as you may recall about 3 weeks ago house leadership Senate leadership met with the president and supposedly agreed on a 2 trillion dollar spending deal. There is possibly a follow-up meeting that's going to be happening tentatively scheduled for this Wednesday. I think already you're beginning to see that deal falling apart. Not a great surprise to anybody. The president is saying that he will not agree to rethink the gas tax. I think in another bad sign last week the president announced that he would be pulling nearly a billion dollars in funding from High-Speed Rail in California, which is of course of that's important to speaker Pelosi. Doesn't really set the stage for a very promising negotiations around infrastructure nevertheless house Energy and Commerce Committee chairman. Pelon has introduced in infrastructure package spell that would do significant funding around Clean Energy Smart communities water brownfields Broadband. So I think what you're seeing is people beginning to lay out the foundation for a longer-term strategy. So it may not happen this Congress, but I think what you're seeing is the groundwork being laid for something in the future. Also, I think you're saying the groundwork being laid around Transportation reauthorization as many of you know, the transportation bill will expire next September 2020. And so I think what you're beginning to see is some of the framework in the pieces coming together around a transportation reauthorization package that may be able to get done obviously smaller than a huge massive infrastructure bill, but nevertheless really important. The other piece of a relatively good news is around housing and homelessness. Which unit for the first time I think really in a decade at least you're seeing I'm Congress take the issue of Housing and homelessness seriously and particularly with Maxine Waters as the chair of financial services. She is now held three hearings on on homelessness on affordable housing on oversight of Hyde. She has introduced comprehensive homelessness legislation. There is also recently been bipartisan bicameral legislation introduced by Senator Feinstein and Senator murkowski addressing homelessness that would provide funding for both Capital costs and for services right now, these are ambitious programs, but the fact that they're actually talking about him and I think he would ask somebody last session. What are your top 10 items? I'm not sure that housing affordable housing would have even been on the list. So I think this is very Promising is something that we're paying up quite a bit of attention to one other item to flag this week house Judiciary Committee is going to mark up the dream at a more comprehensive bill was introduced by congresswoman roybal-allard and nydia Velazquez, which was the dream and promise act that bill ran into a little bit of problems with some of the moderates around how certain criminal convictions would be handled along with citizenship. They have negotiated a compromise and said that Bell is going to be marked up this week in judiciary. We expected to pass they're hoping to put it on the floor in June as well. I will stocks. I know you have the report in front of you. I'm happy to take any questions that you may have, but it's got to be here with you. I'm just keep rolling through this is good. And I'll just continue to remind you all if there are any federal issues that you do want some special attention on us to track any sort of action. It should reach out to oirn Leslie's in DC for us. So she's able to come set up meetings for you all if you are in there, we do expect a lot of kind of churn and different issues bubbling up during the 2020 election. So we will continue to track all of those things that come up and I've always just let us know if you have any special see you both in DC and then in a number of other cities visiting other pod local municipalities and their Partners just want to say thanks for all your work really exciting things that I had the chance to do with you while we were in DC was to meet with congresswoman jayapal and talk about the domestic workers Bill of Rights that they are planning to mirror after our domestic workers Bill of Rights here in city of Seattle. And I think it was Senator Harris Kamala Harris as well in the Senate who's considering moving that forward. I'm still very interested in how we can continue to be subject matter expert witness on our end over here and just wanted to see if there's any news on the timing of the advancement of the domestic workers Bill of Rights at the national level. I'm happy to follow up on that my understanding is as but they are hoping to do something this summer, but I can get a more exact time when for you and for our callings background. It was really exciting to meet with the National Domestic workers Alliance and others who when we were in DC who basically reiterated that they're taking our version of the city ordinance and they're dropping it into federal law extent they can and building on it. So we're doing exactly what we had helped which is to create a tidal wave of positive policy change for domestic worker. So thank you for working on that. Very good. Excellent. Okay. Thank you very much. I just to reiterate it's a little crazy. Of course on their Federal. I think we all can agree on that and what's going on. So what's very important? We have the resources they are. So if there's a get any questions you need to contact information. Just let us know and we'll make sure we get any questions or initials are working on clarified and will assist you. So, thank you again. Okay, so very quickly. I'm passing around a proclamation here. There's an event occurring this Saturday at First AME Church, which is put on by the National Association for black veterans. Now that's my dad was a black veteran in it's a commemoration of our celebration of the veterans in the event and there's a proclamation to to honor actually veteran from the Hispanic community in this is a triple joint event. And again, there's I think one remaining Buffalo Soldier I think many of you know the story about the Buffalo Soldier in that I last one in the Northwest area here will be honored as well. So here's a proclamation and all of you are invited to the event. So I'm passing out the flyer to it want to make sure that you know, you're invited and there it is. From the governance equity and Technology CUNY, nothing up for this afternoon. We do have a meeting tomorrow morning at 9:30. And one of the agenda items is is I think an issue that all of your falling dealing with our surveillance technology and we will have a discussion on a proposed Bill to approve the shell apartment of a transportations use of closed-circuit Television CCTV traffic cameras in automated license-plate readers, otherwise known as a l p r a l p r to hear that acronym tossed around a little bit as well as approve. The surveillance impact SI are for use of these Technologies all these acronyms or shorted pursuant to our surveillance bill that mean if you put a lot of work into will have it the table Side by Cher Jim Lauder Ginger and breasts are from the it will have a Sam's Ababwa Jason cameras from s. And the community service surveillance working group many of those key members and the Sea tab coming in technology. You're bored. This be a briefing in discussion only since this is actually the first siir ordinance. We have the ordinance in place. We're going to have a discussion many issues could be raised their trying to get our sea legs. So to speak on that process so we won't vote it out. We just have an open discussion now because of the protections of privacy that so many of us are passionate about I will ask that if you are heavily invested into this issue to try to come to the meeting tomorrow at 9:30 to voice your concerns, but I don't want to do is a lot of Technology we have ready to use. I don't want to create an unnecessary delay if we can avoid it. So I'm slowing it down to have a robust discussion tomorrow and then a few weeks. We'll bring it back or maybe even longer than that. I depending on where the discussion leads again. I want to thank all of you for Washington concerns and the community survey this working group and see tab. They're doing some great work to make sure privacy needs are met. So that'll happen tomorrow morning at 9:30. And then we also have ice. We had a council rules amendment that we discussed. I thought we're going to bring that stuff or count. So I misspoken is going to come to the committee tomorrow. Just Council rules amendment to improve the sort of the corpsman city hall and that'll be at the discussion. That will be a vote voted item tomorrow morning at 9:30. After any questions or any of that stuff, so we have a after this meeting a Civic Arenas discussion cast member War as cannot make it this morning. So I'll chair that meeting and I do want to see a few things at the briefing on her behalf pursuant to her request. And the first thing I wanted announces at the Civic development public assets and Native Community. The next meeting is June 5th. And this Thursday comes from where is will be attending her first official soundtrack that meeting as a board member and she's really excited about that and a few District 5 updates just so just a couple of them. She wanted to take time to knowledge to public service from D5 who has worked tirelessly to make sure the city is a safe and welcoming place and I'll be Chris leverson from building Lake City together and Janine Blalock from Lake City green waste and both of them to repair sidewalk. For both the east and west side of lcw from 123rd to 125th, and we are looking forward to a repair in the repairs 20-20-20. So thank you very much Christian Dean and the other civic-minded Heroes who are committed to building safer communities, and so Catherine Wars. We hope you Probably watching if you if you are able to and I hope I did your shoutouts Justice. I think you for preparing that. one last thing is This morning just when I approve the meeting minutes. I made a motion to approve the May 6th meeting. That's was what was presented to me. By the way that my Ron Burgundy cut in I just read what I was put in front of me as you have to know a certain movie when it when I say Ron Burgundy if you don't know what you don't get the joke. I should ask how many of you know Ron who Ron Burgundy is if you let me do that again, 2019 meeting will be approved to May 13th. To May 6th. Ain't no Jackson the minutes you're approved. So thank you very much. That's almost once you have it. Is putting everyone there are no items on today's city council agenda from the Human Services Equitable development and renters rights committee. This week has the next regularly scheduled meeting of the select committee on homelessness on Friday, May 24th at 9:30 a m where we will discuss the impacts of Seattle's tiny house Villages and continue the discussion on the issues around Regional governments for full Council today. We have the Ship Canal water quality project during the budget process included a budget Proviso on the tunnel portion of this project and required that the executive come back to us at 100% design and report on its at Two sets to stay on budget and on on schedule. The project itself is part of a larger effort for both the county and the city to limit the number of overflows in order to reduce contaminated water from reaching Puget Sound. It is required under a federal and state consent decree. It is a joint project with the county and again during the 2018 budget process that Council included us spending Proviso SVU has updated their confidence rating as part of reporting back to the create a committee and it had it the confidence has increased from 65% to 75% to 70% and what that means is that the project is 70% likely to cost 570 million or less. The city's share of that project is about 393 million. This is actually five major construction projects in the storage tunnel. Is the largest portion of the project estimated at 218 million that is the portion that the the Proviso is on so voting in favor of this bill today at full Council will allow a Seattle Public Utilities to move forward with the selection of the contractor and move into the next phase of the project. In addition. We had intended to move forward the legislation that moved out of committee last week. They hate crimes legislation. I did receive a request from director Lockhart last week asking that the vote on the ordinance be postponed to allow for racial Equity toolkit analysis, and she writes that minimum we would hope that the boat could be delayed until at least June 3rd, and we have heard from other folks in the community about their concerns on this legislation. I am intending to delay it you may recall that we received a letter. From the mayor last week urging us to move quickly given the fact that we've heard so many concerns from folks in the community. I think it's better. I think it's good public policy that we have proposed. I think it's better to bring folks together and make sure that everybody is on the same page just as a bit of background on the bill itself. We also heard last week the city Auditor's report where we they reported on the number of things including the FBI 2017 report that show that Nationwide a hate crimes that increased 17% in Washington state that increased 32% in in Seattle. They have increased 198% over the last from 2010 until now the increase is actually here in Seattle, then 400% 2.8% of nationally reported hate crimes were in Seattle and Seattle only has 2/10 of the u.s. Population of the city auditor noted that hire reporting totals can reflect increased police attention. We have seen that SPD has hired by his crimes detective in 2015 and actually has an outward facing dashboard on bias and hate crimes. But again, I think I really important element of this audit report was an interesting Geographic analysis of the location of hate crimes by Professor Tim Thomas of the University of Washington also included as part of the audit itself and it notes that crimes are concentrated in the densely populated areas that Seattle has targeted for growth along major arterioles and Transit routes and In less dense areas hate crimes tend to occur in minority mixed neighborhoods along the border of mostly white neighborhoods percent Professor Thomas knows that a majority of these crimes can be explained by the racial threat hypothesis. I eat a perceived encroachment of people of color in white dominated areas actually would result in no additional prosecution. It would simply add up with called a special allegation of of hate crime motivation to cases that the City attorney was already Prosecuting misdemeanor cases, like assault and property crime and it also did not contemplate additional penalties the City attorney intended to pursue sanctions such as a restorative justice type programs as well as a way to actually Address the harm not only that hate crimes due to the victims, but also the harm that hate crimes do to the fenders themselves the some of the additional changes made in this bill. Make the bill itself consistent with State new state law passed in the state legislature proposed by Representatives Valdez Gregerson, Nicole. Macri Santos and a number of other people organizations that supported this bill included the gender justice league the Latino Civic Alliance the Council on american-islamic relations, the Jewish Federation and other organizations who have actually weighed in on our bill. They actually came out in support of the state bill that increased penalties from 10000 to $100,000 adds gender expression or identity where it did not previously exist in their state law many guinesses are state laws. It relates to felony law prosecution's another the concern that we're hearing from the community relates to the disproportionality and the offender Papi. Haitian 100% of the victims of hate crimes are members of protected classes. It is true that there is some dispute portionality in the offender population. Some of that disproportionality is actually in white offenders 77% of those prosecuted under hate crime laws in the county or white. The proportion of our white population is 66% So although I do believe this is this is good public policy. I am also supportive of pausing and taking the time to bring the communities together. Other items on my reports today relate specifically to my upcoming meeting on Thursday and we have a lunch and learn meeting. Jointly with the gender Equity safe communities new Americans and education Community Committee. Thank you to come for joining me on this. I hope some of you can join us at this event cast member Gonzalez and I have benefited from a number of presentations from the people who pulled together this report. It is a report that has been commissioned by the directors of the business Improvement areas in the city and it is the presentation discussion of the system's failure to report the prolific offenders in Seattle Criminal Justice System. It's going to be led by the the discussion will be led by The Neighborhood business groups and they will have representatives from each the Soto Bia. The Ballard Alliance in the Pioneer Square Alliance. Lastly just want to make note that today. We will be signing and presenting a proclamation honoring the life of Sharon Jones Sharon was a real change vendor frequent Advocate at City Hall for folks experiencing homelessness. She pass this month from Lou Gehrig's Disease and we will be taking a moment to honor Sharon and her gifts this afternoon procedural question. So I know this passed out of committee that hate crimes bill you said it will come to full Council in June is that the goal at least it was on will have to amend the agenda today and I'm committed to not voting today. I haven't yet landed on what the best date to delay it to director Lockhart asked for at least I think June 8th. I do want to just check with With her office to see whether or not that is sufficient time as you figure it out no plans on bringing back to committee at this point, but you're Nimble it sounds and we may be hearing back from the final bill in June for the for consoles for when I'm here. Okay. Thank you very much. I hate bill is really fascinating data and I watch the the committee meeting and again, there's just so much I guess. I was just thinking say about it. And I think we're I'm glad that the state is has recognized a state needs to look at it. When you look at Seattle going up 198% you know, the whys the Y and becomes critical not just the numbers themselves what's behind those things show? Thank you, president Stanley Transportation committee doesn't have anything on this afternoon's agenda or there was one agenda item that I'll be speaking to as it came out of the planning land-use and zoning committee for the 1 meeting that I shared prior to being joined by or steam colleague. Here is Rheem and from King County Superior Court on a contract rezone petition that the council approved in the fall of 2018 is related to a parcel on about 70th and Greenwood in the city Ridge Neighborhood. The short version is the King County Superior Court remanded and asked us to provide some more requirements around transition between the multifamily Zone in single-family Zone on the site and specifically between M1 single-family parts sold at the at the project owns, but has a Family home on it and give us a couple options as to how to address that concern the committee chose one of those options and there's a r e x excluded Puda that we will be going to talk to his part of that assuming that the council supports that moving forward as president. If you want me to speak in the petitioners, I believe it asked for an opportunity to speak to the full Council again today, we at committee and again this is a causes you to show matter because it's a contract rezone that committee. We allowed. I believe 5 minutes for both for the the balance and the applicants to address the reman and the record and I believe they're going to release have an opportunity to speak today. Yeah. I wrote a letter back to them. Did you see the copy of the letter that I wrote them? So I wasn't planning on modifying the speaking time, but if it Necessary, we will accommodate but the my position least was having reviewed the the Committee hearing that ample time was given but we don't want to shortchange you known at this stage show. I haven't heard back from them and turns a request for additional time, but certainly during the public comments section will sort of segregated and make sure that people have a chance to speak. So we may hear up to two minutes from during their public comment window. Although each side will only have 2 minutes regardless of how many people they bring and all the quasi-judicial rules will apply to that as far as what they're allowed to testify on his the record or not. And if I get her a question now and today at 2 for a few extra minutes, I'll talk to you offline about it. But at this point I haven't had any requests for additional time other than the 2-minute lot me. So that's the one item this afternoon's agenda folks have any questions about that. Please let me know. This is an ability Transportation committee meets tomorrow afternoon. We have a bunch of it items on the agenda. So I'll just run through the really quickly. We approval to the sweetened beverage Advisory board approval by appointment an appointment to the Seattle Transit Advisory Board. There is a grant acceptance easement by Grant acceptance ordinance for a series of grants that s that is accepted or would like to accept we will hear an application for a street vacation on a project behind University Village adjacent to the burke-gilman trail. This is the conceptual phase will they will walk through what they're proposing and we will have an opportunity to prove that a committee or ask more questions. So that's the front end of this week vacation process before project gets permitted. Discord we will also cure a separate ordinance related on the back end of the street vacation process in regards to one of the Amazon blocks Block 19 in the Denny Triangle area. This is the block the parcel where the the Spheres are. We granted conceptual approval to three different block Ali vacations a number of years ago. And this is the point where they come back and they actually get the street vacation now that they have developed the site according to our standards in the conditional approval. So we will have a walkthrough of what we approve conditional-use reminder and then explanation of did they meet those terms of that? And and so it's that or it'll be before I will also be asked to renew a pedestrian skybridge renewal permit also in South Lake Union. It's Sky bridge over an hour. On the Block sport on the Block bordered by westlake-terry Thomas and Harrison. And then finally we have five different deed acceptance ordinances. Each of those ordinances has I believe 20 separate Parcels for which were accepting deed. So over a hundred Parcels are affected in those five ordinances is a reminder. This is something that we do as part of our city rules that these acceptances come to us. These are typically relatively small, you know, a couple square feet often when a new development project happens often times part of that approval as they need to give it a few inches here there for the sidewalk or those types of things are access to utility and instead of each one of those coming to city council. We allow the Department's to accumulate those and once they accumulate about 20 of them send it over the package and the last few years because we've had such a accelerated amount. Development are city, they're coming kind of fast and furious. So we're getting again five of these ordinances you typically fairly straightforward. But again, it's about a hundred Parcels of land with usually modest acceptance is again, this is private property owners that are giving the city right to their property often for a sidewalk or Transportation access. Sometimes it's for utility access. So we'll have a busy committee meeting tomorrow afternoon. Love to see y'all at. Good morning. There are 22 + related items on the full Council agenda today 19th appointments Andre appointments to the design review board and the three appointments and requirements to the Seattle Planning Commission. And again, the next plus meeting will be on Wednesday June 5th. And that's all that I have for dinner today. Excellent. Thank you can spend by mosquito and I'm good morning colleagues. There are six items on full Council agenda today. There's the Council reappointment of Ali Abdul to do to the Labour standards advisory commission. Aaliyah is the owner of Quick Service restaurant where she oversees a team of about 137 employees and resides in District 1 the appointment of Jillian of Commerce in District 3 to Capitol Hill housing Improvement program PDA. She currently is the c o o and designate a broker for hunters Capital where she is responsible for property Acquisitions marketing leasing public relations and overall business operations. Appointment of Kelly Larsen and the appointments of an Malone and 4 to the housing Levy oversight committee Kelly resides and Bainbridge Island and is the CTO for Plymouth Housing e Services provided to Plymouth residents and leave policy program development a strategic planning initiatives and resides in District. And this will be her second term serving on the committee and is a business development and is a business development officer for affordable housing investments and US Bank robbed. She is responsible for originating low income housing tax credit incentives in the Northwest and Rocky Mountain States and perdita is also a Merrill appointment. She resides in in District 2 in this will be her second term on the Commission Executive Director of interim Community Development Association where she led the work on Housing Community Development leadership and development services. So those are the six appointments or reappointments to the There is questions also want to just take a quick second to thank councilmember her beloved. Thank you so much for your feedback and responsiveness to the community that were emailing and calling into the ER director. I really appreciate your approach to this. I think that it is a good a good idea to incorporate additional feedback and help make sure that we're getting to the right place on this and I absolutely agree with the intent to make sure that we're dressing hate crimes. I also want to make sure that when we do so we're not accidentally or unintentionally compounding disproportionality one big issue that I think stands out for me. Is that while the black community in Seattle, is it about 7% and Seattle population in the native population is about .5% But we see from the 2016 and 2017 data is that black defendants were charged between four and six times their proportionate share of Seattle's population and that Native American defendants were charged between three and five times their proportionate share of the population. While I agree that there is a really great advances that were made at the state level heading the biggest difference between what we're potentially considering here. And at the state is at the state of place of felonies vs. Applying to misdemeanors and making I hate crimes a special allegation that can be added to any misdemeanor may or may not have a disproportionate impact. I really look forward to the future conversations that you have and we'll be following closely. Just want to say thank you to you and to your office for working with our office as we thought through racial impact assessments on components that could be potentially added thanks to your team and to you put specifically. I know you're working late on Friday and to Aretha Basu from her office who was doing a lot of research on this later this week. We will have the housing help at the a special committee meeting to address Fort Lawton on Tuesday May 21st. That's tomorrow at 5:30. This will be the fourth time that the housing health. Korean workers rights committee has had this issue in front of our committee. This year went to remind folks that this is also the 15th year that we have been working on for a lot want to really encourage folks to come participate in the public dialogue. There will be a public hearing at 5:30 p.m. Here in council chambers and childcare will be provided parents are Guardians attending the public hearing who wish to use this complimentary childcare RSVP with Ashley. Harrison at seattle.gov. And also for those who are not using public transit and or other multi-modal Transportation options, if you do need to drive we have paid for your parking at seapark garage located between Cherry and James Street on 5th and 6th Avenues at a discounted rate of $5 that begins at 4:30 and just a reminder that parking garage closes at 10 p.m. But I am making a commitment we will be out of here before 10 or anybody who's interested in joining us. We do hope for a robust discussion at that public hearing and our next meeting will be on Six at 9:30 a m there will be the notice of intent to sell legislation briefing and discussion Fort Lawton plan and land-use possible vote and a continuation of the conversation. We had last week on the housing Levi financial plan and housing funding policies or just the a&f bill. I wish I had something fun to call that bill this prison. I'll keep working on it. And then lastly I will be bringing back the rent getting legislation as you remember last year. This is one of the first housing policies that we passed to prevent the online platforms from scaling up the cost of rent in the city and I'm really providing a disproportionate advantage that those who have internet have high-speed internet or have a computer and the the unfair practice of sort of an eBay for rental units. It was put on hold and the judge decided with us over going to ask for another extension of a year as we work on additional policy. Considerations. This week. I will be speaking at the Plymouth women's luncheon and also at the Within Reach Health Equity in education event on Thursday. I'll also be in District 5 shout out to DJ d v. I know she's watching and visiting a house Young mobile homes where we heard from any of the residents earlier this year and also meeting with Seattle Green as well as I that you're in the neighborhood. Excellent. Thank you very much. Come running nothing on this afternoon's from the afternoon full Council agenda from the gender Equity of community America's education committee. We do have a regularly-scheduled committee meeting this Wednesday, May 22nd that will start at 9:30 a m per usual here in council chambers. There are four items on our committee agenda first, we will start off with a briefing discussion of possible though of bees law and ordinance intended to amend our City's existing Paid Family Care leave program to include city employees who experienced the death of of a child immediately or shortly after its birth these parents Rachel and Aaron's older who many of us had an opportunity here from a couple weeks ago will be joining us at the table a second item on the agenda is a presentation from the Seattle municipal court and the mayor's office of domestic violence and sexual assault regarding their joint work on a very exciting project. I called the domestic violence intervention project third wheel be getting an update from the Seattle municipal court regarding the core. Resource Center in 2016 during the budget. We allocated some funding and directed The skews me know we did not allocate funding but we did ask the city auditor's office to engage in a audit of the Court Resource Center at that audit resulted in a suite of recommendations that would assist the court resource center and providing a better data-driven service model to those individuals were coming into contact with the court resource center and will hear an update from SMC in terms of their implementation of those various City auditor recommendations last we will be joined by the Seattle office of immigrant Refugee Affairs students and teachers of the ready to work program where they will walk us through an update of the ready to work program and the effect of Bergen has on And I English language Learners who are looking at to gain employment and job Readiness skills in order to move towards economic self-sufficiency. So we'll have a full on an informative productive Committee hearing hope that all of you that are available will join us a few updates on other areas and my committee wanted to give folks a quick little update on the work that we're doing as it relates to the criminal justice realignment work that came out of a slider and budget last year really happy to report that we have hired a new Central staff member to continue the council's efforts are on Criminal Justice Reform and realignment of that system Carlos Lugo has extensive experience building coalitions and working with stakeholders at the local state and National levels. Travis was appointed as the state's first Ombudsman after serving as a principal analyst on Hispanic Affairs of the State Department of Corrections. He's also directed voter Outreach immobilization at What does a senior staff member for political campaigns in Washington and Kansas and work for former Congressman Howard Berman and we are excited to welcome Carlos and I think his first day is today. So if you see him that he is the go-to person who will be helping us continue to work on a Criminal Justice Reform from the city council perspective. Okay, and then in terms of the topic that repeat offenders as many of you know, the the executive Constantine did assemble a high barrier individuals work group my office sits on that particular to work group. This week will be the third meeting of the high barrier individual support group that again was convened by marriage organ and anxiety of Constantine. The roof is working toward a viable and sustainable solution to serving those members of our community that are clearly suffering from a variety of unmet needs individuals in this group are disproportionately homeless struggling with mental health challenges and fighting substance abuse disorders course, we know there isn't a one-size-fits-all approach and we are working cooperatively with the executive and with the county to identify some harm reduction approaches that will Definitely meet the needs of Public Safety for both those who are experiencing homelessness bit. Of course for those who who are just moving around or city and working in the city. So excited that that work continues to move forward and looking forward to outcomes as a result of that work group in that the very near future next a quick little update last Tuesday. I along with his number horrible than they are gherkin and other city leaders attended the neighborhood business district safety for him at the Nordic Museum in Valor, and I know they cover protect his office was represented and was also represented we heard from a lot of business owners and representatives around the city about their local safety and live with the living concerns and the impacts of property crime and other quality-of-life issues affecting their businesses. We had a conversation. I believe it was helpful for those to understand what the city's approach currently is to address these issues and marriage Orkin customer to Lanai as well as representatives of the police. Apartment fire department City attorney's office and the King County prosecutor's office has been a lot of time sharing facts and data and underscoring the challenges facing the city and addressing the scale of the needs of affix experiencing homelessness in the impacts that sometimes bleed into the public safety Arena. We of course spent a lot of time reinforcing the city's approach to frequent low-level offenders. We know that they have at needs that cannot be met through incarceration and tried our best to share as much of that information with the audience to at thread that needle into that really have that Nuance conversation in that particular space. I really look forward to the conversations ongoing conversations with these business district leaders and with other neighborhood members on a public safety concerns, and as many of you have heard and already tells number tripled and I are going to be co-hosting a lunch and learn later this week on Wednesday at 12:30. I really want to encourage as many of you all to join us as soon as possible. And I think it's a really important for us to listen and learn and be there with open minds and and really work together to try to frame the conversation in a way that will be productive and that will advance ultimately Public Safety for all across the city. So I really encourage you all to to join us additionally wanted to provide an update on some of the ongoing work happening out of my office regarding the recent surge in gun violence in the central districts in which there have been multiple victims and in which there in which we have seen a very huge attack in fear and frustration in the neighborhood. My office was present at the African American Community advisory council meeting on Thursday night last week session on this topic that comes number. Brass want hosted in her committee last week. Our offices have been collaborating on a subsequent meeting in my committee and the coming weeks that will involve include City departments at the table. It's my understanding based on Communications from the mayor's office that multiple City departments including the sales department of transportation and Seattle City Light will be meeting with residents of the Central District and specifically those who live along 21st Avenue weather has been at several drive-bys and and where we are continuing to see significant issues as it relates to gun violence and the fear as a result of that. So it's my hope and expectation of the department staff will walk the neighborhood with residents and develop a plan to begin the process of identifying and in creating a plan to actually Implement some crime prevention through environment design improvements in the very near future. I've agreed to allow them an opportunity to do that Outreach before they come and present to us at Council what? Solutions are going to be and we can then that during a committee meeting in my committee sometime in June discuss their plans for implementing safety measures to disrupt and reduce gun violence in the Central District also related to that had an opportunity to also talk with the youth and empowerment folks over at the Human Services Department in in terms of their request for proposal that is out and then I can counsel present Harrell mentioned last week that process is going extremely well. Also, there's a significant there's money in Investments at the city will be making in order to reduce violence in communities. That is a very focused on harm reduction as well. We will be getting a briefing from them in September or August but likely in September with an update on how that request for proposal process. Just turned out and who the city can expect to see those Investments going to in terms of community-based organizations. So really proud and happy that we can convene these really important conversations in Chambers and really want to thank kills my response office and and her for her at their collaboration on continuing to work on bringing this conversation in hopefully identifying some real Concrete Solutions that we can Implement with a sense of urgency. Yeah, I just want to say thank you and your staff for absolutely and then the last thing I'll just close by hitting my my education policy area, which is education wanted to make sure that folks were aware that the parent of Education Early Learning has announced the 2020-2021 K through 12 school based Investments funding process. It is now open applications are due by June 28th. 2019 folks add specifically principals who are interested in applying for those dollars and there's a hundred fifteen million dollars available over the next for the funding cycle. So folks who are interested in applying for those dollars should go to education. Seattle. Govt offices happy to share some additional information with you for those of you who do weekly newsletters or are interested in putting it on your social media networks. We would I really welcome and I think deal would really welcome in opportunity to have you amplify that opportunity quickly will start at 10:40 or Civic Arena Select Committee just sort of a a teaser on the agenda for those that have not had a chance to see it. Would you have won voting item? I wish we the fourth item on the agenda dealing with the tension to permanent tension tie backs around Thomas Street will have a briefing in discussion and a vote on that item. But in addition to the earlier in the genital have a construction schedule update a server update on our financial due diligence and the Seattle Storm lease modification and if you haven't been briefed on at this be very informal informational and will vote on the last item School start at 10:40 and hopefully everyone will be there right on time. I have a question. It really good. Okay, we'll stand here and I'll see you at 10:40.", "end_time": 3149.5}]}