{"format": "raw", "annotations": [], "confidence": 0.9251225548730769, "data": [{"start_time": 0, "text": "Thank you for being here in City Hall as I continued speaking most with my voice starts to amplify in any given second here there. It goes the June 3rd 2019 city council meeting of the full city council not going to order 2:00 p.m. On Bruce Harrell present accounts with the clerk. Please call the roll. O'Brien Pacheco SWAT Gonzales herbold Juarez president Harold calendar will be adopted. You're not Jackson today's introduction for a calendar is adopting if there's no objection today's agenda will be adopted. You're not Jackson today's agenda is adopted the minutes of the May 20th, 2019 special city council meeting has been reviewed and there's no objection to minutes from now be assigned. Can objects in the minister being signed? Shrek full cast member in Pacheco is join us. Presentations were very pleased to have council members Gonzalez Gonzalez is leadership on a proclamation relating to gun violence awareness day and councilman Gonzalez. You have the floor. Thank you. Mr. President for the opportunity to present this Proclamation recognizing June 7th, 2018 as gun violence awareness day as I mentioned during Council briefing this morning. It was my hope to be able to present the proclamation during full Council today. I wanted to just take an opportunity to in light and of and in the aftermath of both on some gun violence here in our own Community across the city, but also an increase in mass shootings across the country wanted to take an opportunity to read directly from the proclamation. I'm still with your Indulgence. I'd like to be able to do that Americans are killed by gun violence and more than 200 sustained on fatal fire. Injuries and whereas across King County more people are killed each year by gun violence than car crashes. Whereas the city of Seattle and specifically the Seattle Police Department Works to protect Public Safety in the communities, they serve and whereas despite concerted efforts by the city of Seattle in 2018. There were 312 shootings 13 of which were fatal and whereas recent gun violence is for the raise the sense of urgency around the need for a sensible gun control measures and redoubled efforts to ensure Community safety wear as a King County young adults. Whereas in King County young adults between the ages of 18 to 29 comprise about half of those firearm homicide victims and suspects and disproportionately affect young adults of African American black American Native Indian and Latin descent and whereas the Seattle City council unanimously passed Ordinance one 24833 in August, 2015 imposing in ammunition and Firearms sales tax the proceeds of which are used for the continued fight against gun violence in our communities and the study of data-driven gun. Prevention programs. Where is the July 7th 2018 on July 7th, 2018 the city passed ordinance 11926 6 in a locked container and whereas this ordinance was also accompanied by Ordnance 125621 which expanded the penalties for failing to report a stolen weapon and instances where in an in and instances where a none reported stolen weapon is used to commit a crime where has a November 2018 Washington State voters are overwhelmingly adopted initiative 1639 which made a number of changes to Washington's Firearms laws including raising the minimum wage to purchase a gun to 21 adding background checks increasing waiting periods and enacting storage requirements. And where is by wearing orange on June 7th Americans will come together to raise awareness about gun violence in our the lives and lost him if it's henschel of Americans stolen by gun violence. And where are the city of Seattle renews its commitment to reduce gun violence. And pledged to do all we can to keep Firearms out of the wrong hands and encourage responsible gun ownership to help keep our children and our community safe. Now there for the Seattle City council and mayor of Seattle do hereby Proclaim, June 7th, 2019 to be gun violence awareness day. So I'm at this point. I'd like to present if I could ask the council will be suspended to allow me an opportunity to present this proclamation to Kristen ellingboe and Dylan O'Connor represent the alliance for gun responsibility and to allow them to the city council if they wish before we suspend the rules. Would any of the council members want to see any remarks on counselor Gonzalez's Proclamation will make sure it has knocked. Anyway, I just wanted her back to your place for the Washington Alliance for gun responsibility that organizations got started about two days after Sandy Hook. In 2012. I want to acknowledge the good work you've done. Thank you for your leadership for all those who have participated and I'm really glad that you brought this Proclamation. So I'll see you on Friday in Orange. Thank you. And if there's no objection to the rules will be suspended laukant Springs Alles resent the proclamation. Thank you Catherine Gonzalez. I need a picture of all of you together. I told you that to your side. You're all right. Thank you cancer Gonzalez and thank you for your community work there this meaningful work. This time we'll take public comment on items that appear on today's agenda or our introduction afro calendar or are 2019 work program in the commonly accepted for 20 minutes. I'll call you out in the order that your son. I have two speakers for the signed up. Are four speakers of Senate. I'm sorry. We have first Marguerite Richard followed by David Haynes. Number one and number two. Yes, good day, everyone. Very interesting. We had the judge here. Joe Brown had to educate me on free speech and I don't know with that being in mind. I think I'm going to keep on speaking just like I told you and then if you got a problem with me, you can contact Judge Brown Rizza Islam. Dr. Umar Johnson, and anybody else that was in the room in the Bertha Landes room, we had conversation with the streets. Hey, I think that's in line with your programming stuff since you was talking about gun violence. I don't know because you come down here you chop up people speech make them have to write up different things in their brain. Is that old? Did I get that? Right? Cuz these people like to trespass you when they don't like something in the something is something that may be judged. You didn't like what Judge Brown said and he's the judge of that big me. You're going to George everybody know that I am the judge you're going to judge. So that's that's what I'm talkin about. This is 2019. We're still dealing with issues surrounding all kind of types of violence and stuff like that gang Bangerz. You name it? But some of the stuff that I see that you have the power to do they enforce the law you don't do it yourself, but you worry about a gang banger you worried about somebody with a gun and the way you treat us is worse than a gun the kind of poison that you throw out is worse than the most deadly poison on the face of this Earth get it cuz we couldn't we couldn't violate I owe 5 * not being prison locked up somewhere. Do they do something with the song If we violated the oath that you violate every time when I come in and out of here, the next big is David Haynes. A city council gone overboard with historic preservation of dilapidated buildings ensuring 21st century. Seattle will always be stuck in the past. Just remember we needed mha pre-2008 economy yet. We're still waiting for what is concerningly going to be watered down with cheap fees to line the pockets of politically collect connected nonprofits unqualified unqualified to build a proper home. Please incorporate The Pedestrian priority at 1st and Pike Street Market to dial down the toxic combustion about loud traffic driving over the cobblestones making so much noise. It's annoying to go to that magazine rack. In fact the nine the traffic will be great cuz it gets on the food of the skin of like the freaking fruit over at the market. I hope city council isn't further forsaking the homeless by focusing on historic preservation cuz it's an easier political support to Garner. We still need a mass firing at the government and non-government social welfare agencies. And I daresay still you need to vote to appoint Jason Johnson the permanent director with the authority to fire the corrupt race employees. Jason Jason Johnson is qualified and highly confident. In order for the historic preservation to work, you have to dial down the amount of 21st century driving and speeding through first and Pike significantly to celebrate a more peaceful quieter time without the truck speeding over that outdated Cobblestone creating a PTSD abusive children's eardrums. Okay, our next speaker will be Jacob Hollow by Troy s. Please forgive me. I have social anxiety. So I'm reading something that. Help me get through this. My name is Jacob Affair. I'm here today as a volunteer for you unified Seattle and I'm making the statement today after myself and fellow volunteers spend some time yesterday cleaning up around and an encampment in DeSoto area or group dispose of countless dirty needles and Scattered trash lie next to large piles of overflowing trash bags left on the street. we witness the undeniable can control addiction has over the encampments residents who relaxing water but not drugs. This is not just a homeless crisis. This is a drug prices low barriers Shaq and cat mix like the Lake Union encampment in South Lake Union. Now allow drug use are only pushing its residents deeper into addiction and deeper into chronic homelessness without any form of treatment or resources to transition into permanent housing those suffering will only continue to be enslaved to their addictions with no. Hope of getting off the streets Seattle needs to focus on addressing the root causes of homelessness for some that means treatment for drug use other mental illness for others Financial mentorship without the help. Homeless individuals need there will be no way out for them and no way out for our city. We need Solutions not Shacks. Thank you, Jacob. Our last speaker sign up is Troy s? Hello, my name is this one. So I was also at the cleanup at this homeless Camp yesterday. We did pick up tons of garbage and needles. and along the camp and all there is the chance and everything and It's like you guys were able to put a dumpster around that place or something. You know, I know these people would be more than willing to clean up the garbage around there the mess around there. You know, it's just it's how they live. I live like that once myself, but the communities around there that you know, if you're driving a Benz or something you pull up instead of being scared of these people. You need to get eye level with us with them and just let him know. Hey, I'm here to help you. I can help you, you know the show that you care instead of people judge people and they say the things that they say and it's just nonsense, you know, we're all the same right and we have our addictions and we do what we do, but we need to come together and they just need to learn how to love share give all that. A lot of us aren't fortunate as others and it's hard to get get into a new life getting changed our lives. You know, some people are broke some people aren't but the more help that the community and everybody around us gives and you know, That's what we need. That's how that's how we're going to stay in this world up or this the city's whatever just stop enabling us and just help us out so that you care and I'll reach out a hand something like that. That's how we ask for. Italian clean up the street picture. Thank you for your testimony that will conclude our public testimony section and will move to the payment of the bills portion of the agenda. Please read the title to pay certain claims and order in the payments are us. Blues past Kempsville, 119536 removed and second of the bill pass for any comments. Please. Call the roll on the pastor the bill. O'Brien Pacheco Gonzalez herbold in favour not opposed. Please read the report of the gender Equity safe communities new Americans and education committee and I don't want to cancel both 1195 13 million to the city Seattle Spade Family Care relief program. How many sections 4.29 point zero 10.00 30 and the committee recommends to bypass as amended Gonzalez. Thank you Aaron Alder and members of the public it is with both a heavy heart and immense joy that I Advance Council Bill one 19513 as amended in committee, otherwise known as these law for a vote by the full Council today if approved this bill, correct egg. An oversight in our existing Paid Family Care Program applicable to Municipal Employees and their families like the elders it will do so by doing the following first. It defines qualifying death to include the death of a child or the death of a domestic partner or spouse who died from childbirth or from complications related to childbirth second. If there is a qualifying then it will allow a parent or surviving domestic partner or spouse the ability to access Paid Family Care leave benefit of up to four weeks without drawing down vacation or sick leave within 12 months of that qualifying event. The city budget office has estimated that this policy change does not have a significant physical impact and can be implemented without additional budget appropriation by the city council as I mentioned during Council briefing. This is not a legislative fix to a hypothetical scenario. We've had multiple occasions to discuss the specific circumstances of Rachel and Erin's loss of their daughter Beatrice a short 36f 36 hours after her arrival into this world. We have seen the pictures of B. We've heard the heartwarming stories of the profound love that he gave her mom's in that short window of life. We are now bearing witness to a legacy that will leave an indelible mark on our City's family-friendly work policies. I am honored to play a very small role in advancing that Legacy today Rachel and Aaron had many choices in the aftermath of the loss of B and learning that our family policies for an adequate for the needs of their family. They chose to effectuate change to effectuate change by contacting their Union Protech and sharing their grief as an example and Catalyst for change for positive change for themselves and for future families as a result today. We take a final vote on this legislation that more fully recognized as the realities of the sudden loss of a child are city employees should be able to focus on healing with her with their families in these moments and bees law will provide qualifying employees with for paid weeks to do so, we know that the healing of losing someone especially a young child will take a lot longer than 4 weeks. 4 paid weeks is certainly more than the 3 days that you all had to come together and to mourn and to be prepared for what the future would bring. I want to thank councillor mosqueta for her partnership on advancing this law and a sejal Parikh in her office for her tremendous and tireless commitment to finding a solution for the Alders and all of our city workers. And of course one last thank you publicly to Rachel and Aaron for your courage and commitment to sharing your moment of personal grief to effectuate change in the name. With that said committee recommends that the full Council adopt Council Bill one 19513 otherwise known forever more as bees law, any comments or questions comes from Oscoda Mi for city employees for the loss of a child and the emotional and physical recovery for family is going through the loss of their child or the loss of a birthing partner and this is just the beginning. I want to thank you again for being here yet again to see this policy now put into statute without you sharing your story time and time again over the last year-and-a-half without your persistence to make sure that the family has to go through what you did we would not be here and many other families would be suffering the same loss in the same heartbreak, but this policy now makes the changes that you've been asking for for a very long time it provides time off. If you lose your child for the emotional and physical recovery that you and your family have gone through we want to make sure that that unimaginable pain is not felt by another family making me a possible decision of having to go back to work so that you can earn a living when you're trying to grieve and recover. We want to make sure as an employer that we make sure that those who work for the city are able to come back to work when they are ready and the time that they have is paid time off so that they can grieve and recover. This is the right thing to do. I want to thank councilmember Gonzalez for her leadership on this for her office and thank you for recognizing as well as sejal Parikh. Our chief of staff has been engaged in this with this with you on this issue. I'm very excited to see this move forward customer Gonzalez outlines of a comprehensive components in this law, but I think I just want to underscore three of the critical policies that you all helped to make sure that we changed in the policy is it came down one is you are no longer required to draw down your existing sick time or vacation time. I hate the concept that people would have to drive down leave that we have fought so hard for leave that's important for 6. I believe it's important for rest and recovery for vacation. We have these vacation and leave time policies for sick leave for important reasons and the loss of a child is no vacation. You should not have to use that time at this critical moment, and we've changed it so that there's no drawdown policy. We've also made sure that you don't have to use this leave concurrently with family medical leave in the event of a qualifying death. This is really incredibly important to keep that policy separate and to create his own bucket. And then lastly as you've heard we have really made sure that the qualifying death is a definition that includes the death of a child as spouse or domestic partner as a result of a childbirth and I want to thank you for your willingness to include that component in here as well as we think about how families May grieve during this moment, especially around the birth of a child and to make sure that bereavement leave is kind of more conceptually applied to who that might apply to and critically that we've used terms like birthing partner so that were inclusive of all families. So thank you for your leadership on this. Thank you for your openness that some of these changes that we were suggesting and thank you for helping us to really underscore that our existing bereavement policy is unacceptable as you had She is not a significant amount of leave. So we will continue to work here at the city to make sure that are bereavement policies of the whole better reflect families actually need it as that as I said earlier. We believe this is just the beginning of having the opportunity to address our bereavement leave policies of the whole so incredibly proud to work with you with council member Gonzalez and with the mayor's office on to change our family medical leave policies to address this critical Gap as it applies to families that are needing time off to be with our child to be with their Partners or to grieve the loss of their child. I just want to say thank you again for helping to illuminate the short but incredibly impactful life that BS had to sparking this policy change to ensuring no other family has to suffer the same experience and then making sure that we lifted up the voice of not only me and you as their parents but to making sure that there's lasting change so much more to do and things to Aaron and raised. These Brave parents for helping to set this past or passed for comprehensive policy change. Happy bees day again. Okay, any last comments are we ready to vote? Thank you very much. For those fine presentation someone please call the roll on the passage of the bill. Mascara O'Brien 9 in favour not opposed it. Thank you. What are the committee on Citywide mandatory housing affordability 12579212 correct? Math errors contained them up a 423.58 b plan 0-50 Mapei 423.58 sequential 50 and attention 2025 7.3 recommence. It'll pass for president during Council briefing this Council Bill represents a set of technical changes to the Citywide minatori housing affordability ordinance that this full Council adopted in May of 2019. All of you attended last Monday and heard from Allie penuche of council Central stat, the particulars of the technical changes included in this version of the bills. I won't belabor the point today, but those changes as a reminder are strictly limited to ensuring The maps and code language reflect the appropriate payment levels for development capacity is determined by the city council in previous policy conversations as well as making sure that all of the code language accurately reflects the many policy choices made by the city council in its deliberations of the originally passed Citywide mandatory housing affordability ordinance. Otherwise there no substance of policy shifts or modifications to does legislative policy decisions made by this city council in May of 2019 with that being said the select committee on Citywide. Mha recommends that the full Council adopt Council Bill one 19500 Very good. Any questions or comments. You're not please call the roll on the passage of the Bill O'Brien. Where is President Harold night in favor and opposed to go passenger side of it. Please report of the financing neighbor is coming to please read the shirt tie Longmont United. Remember 382913501195 28 relating to Historic preservation poison control's upon the Seattle Tower the committee recommends the bill pass. It was formerly known as the northern life tower at 12:12 30th 3rd Avenue. The building was originally nominated about 40 years ago in 1974, but due to ongoing negotiations in various changes in ownership. We're only just now making the designation official how many of you will remember this building is very interesting Lee designed. Tall tower was one of the tallest in the in the Seattle area after Smith Tower but it starts to darker brick on the bottom and gets lighter and two of they have almost white brick on top and it's supposed to be reflective of Mount Rainier and specifically what will be landmarked will be the exterior of the structure and the lobby recognized for various protections and the committee moves adoption of 119528 questions or comments. That please call the roll on the passage of the Bill O'Brien Pacheco president Harrell on the Mount Baker Community Club clubhouse. Can we recommend simple pass? This second ordinance will impose controls on the Mount Baker Community Club clubhouse located at 2811 Mount Rainier Drive South and it was built in 1914, and I want to say thanks to the community members who came to my committee now 10 days ago. This landmarking will ensure the preservation of the site and the building's exterior, and it's believed to be Associated a very significant way with the economic Heritage of the community and Mount Baker. So, thank you. That and we move adoption of 119529. Make sure they make comments that please call the roll on the passage of the Bill O'Brien her both worlds. President Harold 9 in favor and unopposed boo passenger assignment, please read agenda item number 5 the short title Washington parrington Hall committee recommends the bill passed which is located at 4105 Memorial Drive Northeast on the UW campus many of us have actually had classes there or taught there and it was built in 1902 parenting Hall. It's now at home to the Evans School of Public Policy. The designation will preserve the exterior of the building and the interior room volumes and skylights on the third floor east and west and you may notice in some of the original photographs that it was white and at the original it was painted white to be part of the 1906 fair so it is now been restored to its original brick exterior and it meets the following standards for designation significant aspect of cultural political and economic curettage on the UW campus. So we move adoption of counseling 119530 certain elements of the building will be reserved movie preserved. I am very happy and ecstatic to learn to see the project before dinner and that the oven School get any building because it was long overdue having been a couple years in that basement. Very good question, Okay. So if not, thanks Katherine Pacheco. Please call the roll on the passage of the bill Brian Pacheco. I so want her bold as president Harold 9 + 6 + 7 + 7 appointment 1315 1351 reappointment of Thais marvelous and Christopher maykut as members Community involvement commission for Toronto May 31st, 2021 the gummy vitamin C supplements be confirmed. Thank you and I'll speak to both of them that reappointment of Thais marbles as a member of the community involvement commission. This is her first term. She was raised on Beacon Hill. She's a Cleveland High School graduate. She works at the department of social health services where she is Cisco customers meeting able-bodied adults without dependents work requirements through various activities that lead to their self sustainability. She's been involved in our community is an executive board member of the Coalition of black trade unionists as she's a charter member of the labor. What's up for Latin American advancement and a member of the n-double-acp we welcome her to the committee. And secondly, we have a reappointment of Christopher maykut to the community involvement commission. He served a term already. He was born on Capitol Hill raised in Phinney Ridge and he's created and managed the canyon organic cafes and currently works as a business membership coordinator for the skinny neighborhood association. We welcome the reappointment of mr. Makeup and the new appointment for Thais marbles as a member of the community involvement Commission. Any questions or comments? I just want to say I'm very pleased that they are being reappointed which means that they found their engagement meaningful in the communities better for trauma really pleased when I see these kinds of reappointment to this community involvement very much, and I do want to stand corrected the ties. This is a reappointment for her the questions those in favor of confirming the appointment, please vote I buy those opposed the motion carries appointments are confirmed for the business to come before the council. Okay, it's not we stand adjourned. They would have a great rest of the day.", "end_time": 1963.0}]}