{"format": "raw", "annotations": [], "confidence": 0.9408274311145753, "data": [{"start_time": 0, "text": "This is a special meeting of our Civic development public assets and Native communities committee. It's Wednesday. It is not June 5th. It is Wednesday. Whatever day it is today the 20th 19th. And the time is 2 p.m. I think you can smoke break is all this for joining me. I'm councilmember Sally Bagshaw. I'm usually vice-chair of this committee but acting chair for today. I'm joined by a council member Gonzalez, and I don't know if we're going to have someone else but we might so thank you all for being here. If there is no objection. The agenda will be reordered to consider agenda item to before item one. No, Dairy, no objection. The agenda is amended and if there is no objection the agenda will be adopted as amended. Hearing no objection. The agenda is adopted as amended. I'm very grateful that we're going to hear two wonderful reports today. This is our rsji erase and social justice initiative reports from Parks and from Seattle Center two of my favorite Apartments. So we're going to ask Jesus Aguirre if you would like to join us at the table and any of your team members, we also do not have anybody signed up for public comment. Is there anybody in the back that has any public comments? Okay, then we're going to move right into the presentations and since Parks is been asked to go first or just going when she gets settled in. We're going to move forward Jesus and all of you who are here at the table. Everybody like moving down truly I showered this morning. We're scared if you always yeah, I know it looks kind of scary. Great. What Jesus would you would you like to start? And all right. She's going to read something in the record for me. Thanks. So everybody knows the game from Debora Juarez is office. So welcome to 2018 race and social justice initiative report for Seattle Department of Parks and Recreation. Very good. Thank you Jesus. Would you like to just start the introductions and just go around the table and identify yourself what part of the parks department that you're working in and just have second second sentence about what you're doing for parts advisor overseeing the advancement of the racing social justice initiative. Well done. Thank u v i Am Belinda Chen I go but she her pronouns and I am the urban food systems program coordinator. Excellent. And would you say, it's Belinda Belinda? Okay, very good. So as we go, What's the dead like to know more about the work you're doing and before you leave today? Please talk to me because we have an idea for another Urban Food Forest in Belltown and just got the approval to go ahead with the mayor today. So you may be busy. Okay, don't get scared. I'm also one of the leads where are change team along with Jason and Belinda. Excellent. Thank you. Did you have something else you wanted to add right now? Okay, Jesus all yours an hour 2018 RCI initiative NN so I'm going to do some of it will sort of tag team here. We've got folks from her or change team here as well as in the audience and then and then B will will talk to you some of her her work as well. But just to kind of get us started on the presentation and I think just by way of context of operations in a large agency. We have a significant portfolio in terms of Amenities in the program that we provide on behalf of the residents of the city of Seattle things helping people be healthy and sharing their environment is healthy and then building strong communities throughout the city in and is as a large agency in terms of our own Workforce as well as as a programming in in the way of facilities to distribute is really critical Frost. I want to dig into talking about our staff. So this just gives you a very broad look at our gender breakdown by these are employees roughly 1,500 employees work to have a complicated agency because we've got some full-time staff. We've got intermittent temporary staff with that part time staff. So during the year was sort of we sort of Evansville in terms of death of the staff that are working on behalf of the residents of this this chart reflects essentially are permanent folks which is about fifteen hundred folks again permanent full-time books permanent and Intermittent static coming up that that are full time. He went past the first slide really quickly if we could just go back there. This is where I wanted off my hat to all of you and Parks and Recreation men think about this 6400 Acres of parks and green space that you all care for and tend for the benefit of the rest of us in the city and the fact that there's 485 parks and natural areas. That is a lot for a city any City that I'm with her are size are larger, but there's also 26 I think 27 community centers if you count the one in Lake City and certainly councilmember whereas would want us to make sure that they're five is positively represented here. But it's huge It's a Wonderful Department. You do really good work and I look forward to your talking about all of what you've done this year. We have a great team that does a lot of work. They do it each and every day committed to make sure we're serving everyone and we certainly appreciate everybody's efforts and I was correct. The other day, I like to put my staff and I kept saying we have 27 we have 27 there. Like we actually have 26 because even if you count League City as you know, we closed out of town, so we only have 26 closed our closes down at the end of the year. Closed for those of us who live near Belltown we can say thank you for setting it up. And we're looking forward to the next one, which I know is coming to take you back to our staff. We've got roughly 60 almost 61% of our staff identify this mail and 39.2 or female olicity by race hearing and we have the majority of our staff actually identified as people of color 24% black or African-American 16.4 Asian 6.1 Matt next and then our American Indian Native Alaskan natives 2% native Hawaiian or other Pacific Islanders, 1.6% and then folks who identify with two or more races 1.9% And then the balance of that just under 50% 48.1 is. Identify as white when you look at a little deeper into the data. This is a lot going on this chart. But I think it's at it. It did Elsa sort of ground where some of our work needs to go in terms of our staff the bar on the far left here just gives us a represents in bar form at what the pie chart showed you the beginning that roughly fifty one point or 52% of our staff identifies as people of color and then as you move to the right that the supervisor so these are the top 25% of our supervisors season folks HR does an analysis in terms of the number of people that that that individual supervised until the top 25% This is sort of the span of control of the agency people of color are represented are represented as thirty-five 35.6% of that group are people of color the bar on the right looks at our wage-earning and of the top 25% wage earners 39.9% identify as people of color. So a couple other points on the line sort of the gray dotted line their shows where the population of Seattle is in. Signs of a breakdown and then the darker line of top shows you that the King County breakdown so it shows we have a diverse agency, but we've got some work to do particular about an hour or supervise employees in and ensuring that we continued to diversify that team as well as the the folks were making the most at the highest wages at the agency that bar the darker Blue Bar represents people who identify as white. It doesn't come across on our chart. You can't read it here. So just so that the next time that you want to print this you might just recognized that that's the issue of matically during 2018 and MN as usual call. I was not here in 2018. So I'm going to rely on our folks sure. If I if I say anything I shouldn't say you will correct me. And if you have any question that I can Answer they will certainly answer them form on our behalf. But because our our work is is so vast. We try to focus in on those three areas healthy people help the environment from community. So the reporting will do today is in those areas of the first one is around healthy people in and yell because we're talking about race and social justice. We know that lower-income folks and people of color experience incidence of feel things like food insecurity obesity chronic illness and things. I got a higher rates. So part of our work is to make sure that we can combat that the two programs at all highlight hear the first one's called back in the streets and this is an issue and initiative that we used central air bring Recreation into communities that I hadn't participated in some of these these dishes and this is specific to Healthy Living for these are physical fitness activities. So we selected a Cadre of parks in southeast Seattle Parks in lower-income communities. Again, that that that don't have as many of these activities in and when we did if we went out and partied with other organizations took advantage of other cultural events are happening in just brought Recreation. To them really exciting program and then through this program in 2018. We reached I think 1400 individuals are coming and Rec community centers in suspending service program. So what's an example of us trying to rethink the way we do some of this and I could bring a recreation to into our communities invite people to come into close streets. Are you said that you went into your own parks in the Parks weather's closing streets are bringing these activities into some of the housing projects, We don't necessarily have a Parks and Recreation amenities. We want to start bringing them had a street program where people could close their streets and then after 3rd at the after even 3:30 in the afternoon for a. Of time that encourage the neighborhoods of clothes. So the kids could be out there and play kick-the-can whatever they're doing. I don't know whether that is continuing or not. But I really would like to put a plug in for coordinated effort between you and ask. I think there's great opportunities that the neighborhoods I've had. I've talked to some folks in Portland some folks in Vancouver BC that did that and then have their own whatever it's not necessarily an organized effort. But whether it's a skateboard or whatever they're doing just to have fun in the streets, but it's brings the Streets back for people in their neighborhoods. I think it's right. I love that idea. You think it's a larger scale there places like Bogota Colombia where they do ciclovia where they close major shoot every Sunday for the full day to just bring the community out and be active bands at bicycle that like your name and it's just this whole culture of let's get outdoors and some level we should be doing things like that II Our destination summer camps as part of a gap analysis that we did and in our registration numbers across the city, we found a discrepancy in South Southeast Seattle. We looked at basically the percentage of the population in that area that was actually registered for programs. When we looked at across the city we found it in southeast Seattle. We had roughly 2% of that population registered versus I think if we had up to 31% in Northeast Seattle than 20% in both south east and north and south west. So there was a discrepancy as we dug into it that the cost was part of the issue. So we piloted a program in Garfield Community Center where we we we did a couple things so so we created that these programs where we changed our scholarship program Sony one who qualified for 80% We went and gave him 100% So we we met that 20% Gap we did significant Outreach into the community to throw bring folks in we targeted the folks who I'm waiting. Really were able to have more than doubled the registrations in that program. And as a pilot, we're really excited about how it turned out. In fact, we're going to grow that in 2019. We're planning on doing it continue to do it, but just recently received a grant from Amazon actually that collaboration with the Alliance For Education to grow this program. We got a $250,000 Grant to continue to do more that's a work session to do that. We still have the program that encourages women who have preferred that they they call themselves women of cover cover to have as X where they can swim in the pool and it's close to man so that they have the freedom that they want in the Privacy that they expect. Is that still going on. I believe it is. Yes. It is that it was something that people wanted to have more of I just didn't know whether we were proceeding without or not as anything. That is good. Sometimes there is protest in his opposition working through some of that that they won't make sure we can do that but there are other other other issues there but we'll keep working on it moving on to the to the environmental side of things. And again Super Target in your folks that have been disproportionately exposed to some of these environmental conditions that harm their health until we try to to to to combat that and and in our work week at least in the examples ever bring up that we are youth of the two examples here. We have this really exciting youth employment in Trails program. That is both a program that helps our our trails and make sure that we're making them accessible the folks but it's also teaches skills, and then we're building in a job development programs. Wine for ourselves with a small Court in 2018 of 10 young people 18 to 24 year olds that are involved in learning how to maintain the trails and then we were able to actually convert 5 of those two full-time employees of Parks and Recreation. So what were looking to find ways to continue to grow that and again if it is really is a great way to continue to build a pipeline into diversifier are Staffing also wanted to extend my thanks to all of you that we're working on the the Tri-State Green Street area. I'm a number of years ago. I know the neighborhood came together and we're really promoting that and then the kids have gotten older which is wonderful and they still have ownership of that. That's their Trail and the connections between Beacon Hill and down to the Light Rail station that has improved but also the young people have gotten and they've learned a lot better if I want to acknowledge the work that you've done and just another neighborhood go thank U II program will highlight hair is is one of one of Belinda's Bergen from the urban food systems program. CNN this was a great initiative that we worked on at Southpark to create the garden Squad program until the other users summer youth employment folks both in the winter in the summer who who were able to to grow produce and Mara Farms. They they learned how to appropriate dieting and Enbrel Hands-On skills there in terms of diet nutrition and and how to prepare meals and and they actually were able to cater some of the food at the community center. So great program for Youth and tell us more about that that I will highlight. I think you're both familiar with our Seattle Conservation Corps, which is which is part of what we do in terms of helping homeless homeless homeless individuals develop skills. I get the set of casework support that they need and then become employed and so in 2018, we had 46 of our participants actually. Graduate from the core and ingame full-time employment and we all said 41 of those who who also were able to secure stable housing. So it's sort of shows both sides of that that program and the other piece of dead that's really important weeks now converted the Civil Conservation Corps into a sort of unofficial apprenticeship program so that right now these folks tend to come and work with us, but now we're trying to ask spread that out. So they can participate in other agencies. The first the rec for all program is one that that is is you you might recall was was established during the 2014 during the park district. And this was an idea again of trying to bring recreational opportunities to communities if we weren't necessarily reaching or what coming to us. This program is a grant program that allows us to give funding to community-based organizations who then create programs sort of on our behalf and it has a great impact in terms of the people that we serve but also helps us learn how to do some of this programming and some of the key learnings we've already Can is is some of that some of the engagement was hired ambassadors of go out and help us engage with the communities based on some of the work that we've seen some of these organizations doing that. I'll highlight this program. There's a lot, you know on the under the picture here. It's a program that that granted through the lens of coexistence tonight and it's such a powerful program. So we had used interviewing the elders about their experiences and and and the documenting that this relates to the create this not just culture about intergenerational a project in through the back for a program. We granted $250,000 to about 25. Can you based organizations are very specific in terms of dealing with communities that that that we don't necessarily is that a video project completed. Is it online and you know with these Ethiopian elders So somebody would maybe just look into that and get back to me. I'd love to see if it's actually posted some of that some of the other nitty-gritty part of what we do in terms of equity when we almost met our purchasing goal with a 20% actual versus a 21% stated goal R data analysis shows in 2018 are total wimpy purchasing dollar amount spent was 2.8 million. And this was an increase from 2017 which yielded 2.7 million which leads to a percentage increase from 17 to 20% 2018. Also yielded. The highest wind be purchasing data for the Department in comparison to previous years. Do you have to have a breakdown on what the What they were doing one of my real objectives over the years has been to make sure that these whatever the business is our that they're actually get engaged in something they're using their skills gaining skills and so on do you have maybe just give me an example or two of what you know about their engagement with us in regards to purchasing. We're still looking into the data. We're still doing an analysis to speak to that specific data that you're requesting and working with FAS to identify that data. We need to do a more robust data analysis to get to the details to be able to give the documentation and just at the point I'm making is that when the mwbe program started and we're talkin like 1984 5 there was an awful lot of flow through so the MW bees might be buying from when they float. Through their business and then distribute, but they weren't really using their skills. And we wanted to make sure that these businesses were we're getting in that capacity building. We always talk about their also standing standing on their own feet. So they are don't feel like they're just a pastor the rap. They're really engaged and deeply involved and I just like to be sure that in Parks when we're both were doing this that the individuals are deeply engaged and that the employees are also part of something that's real best. And so as we move forward with Consulting we exceeded our a Consulting go a 48% actual vs. 21% stated goal during 2018. There was an increase in women-owned business Consulting contract specifically and planning and development and although the two largest contracts totaling approximately 1.5 million hour one time project. We recognize the importance of how spr is Wendy efforts work to leverage the city's purchasing power to include and build capacity of women and minority-owned businesses. We do find it important to note that as I stated will continue to analyze and work through data collection and Reporting methods do migrating to the new Financial system and through this continue monitoring and collaboration with fa fa sr1b data may see an increase in totals for 20. 18 as we begin to look for 2019 and Beyond we have the same utilization goals as last year both set at 21% We will continue our knowledge and resource building efforts for staff and decision-makers Implement an employee engagement wimpy Advocate series continue to participate and Citywide I reach events to include spr hosted events build Upon Our interdepartmental Partnerships and work internally to explore our systems and processes. So that informative data analysis is used to send future utilization goals. And it's moving on in terms of how how so our surveys and instead of our own thinking internally about how we continued it to remove this word for word. We're working to try to build our own internal capacity and I'll highlight a couple of these one of which is actually hiring be with y'all talk about just a second in terms of her bowl and she can't really talk about that as well. But expected this at that was done last year was an agency-wide Retreat. We're a little too close out our facilities down and brought everyone in and into the the hangar at Magnuson to have these deeper conversations about race and social justice and literally just create a foundation that to continue those discussions to further this work. We were able to get 84% of our employees actually attend and then in all of them were in the largest session done and then we had several workshops on an implicit bias that they were also able to attend so really a great start for this ongoing conversation. We're already well into the planning for a second version. That's what we're going to do this year at 9 to send it on September 19th. It's really would invite both of you to attend if you're interested. But again, it's it's it's one of the work of continuing to to work at to provide both our staff with a tool to have these conversations are so that as we started continue make decisions that we're really doing it through this this raises interest us has commenced to continue that as I mentioned part of what has the reaction been when you get 84% of your employees attending did you do any follow-up? What are people saying about it? And what are you seeing defining a success coming into this is is there certainly has been an elevated level at in terms of the conversation that the agency even when I was there prior to this so that there is there is the the the yearning for more of these conversations until part of what we're trying to do with the next session is make sure that we build on that end in D. Our conversations and we want to both give folks a bit you want to we wanted list of these conversations. We also want to get Folks at tools and the resources to have them and continue to work but I don't know be your others if you want to talk a bit more about what you've seen. Since transitioning into the position in February and working closely with division leadership and also Frontline staff and working at all levels of wood staff in his apartment. There's a momentum there's a desire to learn and to grow and develop and to truly not only just talked about it but to walk the talk. I'm very excited and it's been a great experience thus far and seen the level of Engagement. We have from employees and also from the community because it's not only internal this is external Outreach and engagement that we are doing also and so it's very exciting to see employees really, you know, reaching out and saying we're ready to grow and we're barely developed and we're really ready to advance race and social justice justice. Thank you, but I feel very optimistic just by your energy. I would just like to add regarding your question about the follow-up there were follow-up sessions to capture the employees who were not available for the initial training and there were at least two follow-ups with mid and higher level management to increase the depth of accountability and understanding about what that accountability accountability looks like. Nice. Thank you, though. It will send you the information on the September 9th purchase paid if you're available on this building so so excited by bees energy and and working this until she's come on as the first-ever rsdi. Strategic advisor for the agency in and she reports directly through my office of really is the one that that is leading the strategy on this and helping advise us on all this both a dreams of our directions that apartment and how we make decisions. But also how we work internally with our Employee Engagement and then how we work extremely with our customer engagement. So a lot of work to come on that. Another part of that part of building the capacity in in 2018 planning process and that's just launched but we did some pretty work in 2018 to get ready for the engagement that has just launched in 2019. And in part of that was supposed getting more information. We did some surveys in multiple languages. We looked at the data that's available in the city in terms of of displacement and other racing social justice data help inform the the planning for the plan. I guess I'll say and continue to use his communication ambassadors that will go out and do some some on the ground engagement and letting folks know about the events that we have and then another thing that could be another's help us do is as we did some RCI training book for a park board and our Park District oversight committee, and these are the folks I can make the recommendations to us on some of the funding for that. Well that they will come out of the strategic planning. So it's important for them. What does ensure that they had that information that training? And then one another final piece here in terms of our own technology has had a registration system. That is very old. Probably 15 years old very cumbersome not very effective and one of the challenges we had with that book from a policy standpoint as well as it's a technical standpoint. We weren't able to collect demographic data on the folks that are participating in our programs and we saw there is a gap just in terms of our ability to make decisions about how to offer this program. So we've launched this after pretty pretty significant technical exercise, but I have already seen some immediate benefit here just to show you some of the other 73% MCS me of the folks who are new and in the system. We had 73% of these folks like she opted to provide the demographic information. So we get there. They're opting in one tiny bit of initial data just shows a set of those registrants the the the diversity essentially matches kind of what the city of Seattle. Yeah, that the same proportion of people we look at where they are. And then how we can use this data to better serve our residents. I'm supposed to interrupt this for a public service announcement for 1 minute. Apparently since it's now 2, I'm supposed to tell you that the special meeting portion of this meeting has concluded and we're now continuing into the regularly scheduled Civic development public assets and Native communities committee meeting for June 19th end of the public service announcement. Thank you very much really there now and I'm really proud of our agency and I'm proud of the folks who not only they do they're they're in very important day today job. They do they put so much effort into this works. I want to thank them publicly in the folks over here as well. how to change team for all the work that you do and for keeping us accountable in helping us through this work, so I'll turn it over to you guys and I will click if you want or just nod and thank you Jesus. I want to acknowledge and thank the Parks and Recreation change team for their support and a few of our members is Jesus just recognized are here like to say thank you for being here everybody waves. Yes, and we're proud that our change teams representing nearly every Division and Staffing level in the department a quick shout-out to our recently retired so good when former change team Kool-Aid, so unfortunately, she can be here with us today regarding change team accomplishments and challenges 2018 offered opportunities to increase the change teams engagement at strategic levels. So for instance, Jesus mention, the all-staff foundations of change are are all Department recent social justice training nearly all of the change team members participated in that. Facilitators of of the curriculum that day and then I also participated in follow-up sessions related to the department strategic plan the the racial Equity toolkit and specifically changed him reviewed and offered a framework of guiding questions and recommendations to take the thinking of that tool kit to a deeper level of consideration in this era of climate change, the change team recognizes that we cannot have environmental sustainability without equity. And so we have begun putting together and environmental justice curriculum that will be used for staff training in future. That's great. I just want to underscore how important that isn't how much I appreciate the work you're doing. I hope you'll share it with the council because this is something And that we would be very interested in as well would be more than happy to do. So, thank you regarding the opportunity to hire the Department's first-ever rsj Equity strategic advisor for the change team contributed key characteristics and qualifications along with the feedback a front-line staff to the job description and we're very pleased with the results and my colleague Jason will speak to additional accomplishments as well as challenges. Thank you. Thank you Belinda. So the the change team worked hard to facilitate the process of normalizing conversations about race throughout Seattle Parks and Recreation. We ask for feedback from the expanded executive team about their perceived barriers fears and concerns related to holding rsj conversations. We use this feedback to create a document. What could be reference by staff to Aid in their efforts to have these conversations? We also advocated to include Frontline staff and executive level trainings and workshops. So their voices and opinions could be heard directly this inclusion took place on several occasions and still continuing into 2019. Next line, please. Now we'd like to address some of our challenges. Race and social justice is a hard conversation to have it's a long time struggle within the department. Where do we start? How do we inject this difficult work into staff? Well, it starts with me and it starts to everybody in this room. It must be a part of our core work. So how do we normalize conversations about race? We must embed rsj into all levels and engage everyone in the conversation. We need to be consistent and follow up. Are the foundations of change event that was mentioned earlier. I hope their Department get an idea of where our staff think that we fit on the RCA Continuum that came in just a little bit above the Midway point. So making active efforts to become an anti-racist organization, which is the highest level and I can. Continuum is going to be a difficult and ongoing struggle for us, but that being said Seattle Parks and Recreation has proven their dedication to continuing this work increasing access to rsj trainings and events and is also an ongoing struggle due to capacity and staffing issues within our division in 2019, as pure leadership is working directly to change team in Whitby to try to find possible solutions and increase access for all staff. Accountability for spr leadership and then executive executive level and mid-level management is a challenging element of our work in 2018 change team asked division directors to create personal action plans to outline what they are going to do to move us towards becoming an anti-racist organization and moving forward or superintendent's office in HR are considering more productive ways to hold managers accountable for their commitment start SJ. And the last thing we wanted to say was that a streamlining the distribution of information across a body of Staff of really widely arranging working conditions has been a challenge and we are continuing to explore different options to bring them that rsj information and resources to all staff and inequitable way a little bit deeper into that issue for you said that you would ask the directors to and supervisors to have a personal work plan and dedication towards rsj and and and tell us what kind of conversations emerge turn that Too and we're out of coffee is a summary of the different things that each director. I'd love to see a John personally. I only work in one division. So I would prefer that over to be to give us more information on what did you think this was this was deemed to be a good first start that there was like three or four bullet points. Then each had agreed that they would do know. This was an exercise. It was part of our star change team and executive fellow staff Retreat and it was meant to kind of get the wheels turning in to get them thinking about it was more of a tool for them to use and it was an official document to send out to staff but it was a good place to start and then we followed that up with we had everybody right down there different concerns of things that they perceived as barriers to having these conversations and we created a document that they could reference to kind of help them get along. They got stuck they can look at things that other people had suggested or on different ways to start the conversation. And did you and this those of you with the group and those of you in the audience, do you have a sense that over the last year-and-a-half that progress is being made. Do you see stumbling areas? Do you and maybe the question is are you giving each other's room for Grace you make a mistake and pick it up and start again. Can you just talk a little bit about that? Yeah. Definitely. One of the things that changed him likes to say is that you'd there's no perfect answer. You don't have to be an expert to start these conversations. And if you do something that is out of line ask for feedback, you know, look for different ways to address that and and learn I'd say at least in our division my division license am finding a development. We've I've definitely seen change and I've seen a lot of efforts that I hadn't seen before. Pick ourselves up and either ask for forgiveness or Clarity and move forward and you're feeling that that there is that change and Parks. I feel it started offering Grace to miss State and also to recognize that mistakes will happen and this work is not always comfortable and it will be uncomfortable and he's lean into that discomfort, but they're still the space of Grace while you're in that discuss discomfort to learn to grow to do self assessment and to do the work to get to the place that you need to be. I feel we We use that is a key message and it's permeating throughout the department and Aslan mentioned, you know, the conversation started and the division leadership work with me to deepen the conversation and deepen their self Assessments in their work to be leaders and to lead us through this organizational change with Equity at the Forefront of equity molding throughout rsj presentations from multiple departments. Not just this one is that often times. It's a presentation that is really squarely focused on inward-looking right sort of how are we doing as an organization are we treating each other is colleagues. How are the structures of institutional racism bleeding into programmatic work? policy work that we're doing and service it bothers when I don't see a lot of is the realities of how race impacts the work of employees in public facing agencies like Seattle Parks and Recreation and I've heard some stories about some really disgusting experiences of encountering a bald faced racism in by Parks and Rec employees and interaction with the general public and would just like to get an understanding of how the change team and Jesus you and others are just thinking about how to address some of those really hostile tough experiences are employees who are interacting with the general public i e not other city employees in sort of their work day today work and when they have the Kind of experiences you however we are. We supporting our employees in our workers to to deal with those really traumatizing experiences for many people of color. Then I turned it off. Speaking of the behavior that that that our employees are or subjected to buy by members of the public about, you know, microaggressions aggressions in the workplace are coming from your supervisor, whatever the case might be but in organizations and agencies, like Seattle Parks and Rec where people are literally at the vision of your job function is to interact with the general public. How are we are we addressing and some touring those experiences as part and parcel of the races social justice race and social justice work. I know here at the city council. We've been undercover as good as leadership really trying to take a harder. Look at the types of interactions. Our own legislative Department employees are having in the course of interacting with the general public. Because it it can be very harsh and really impactful and I just was wondering if you could address that particular Point pacifically I could point to initiatives in and then Folks at the table might be able to I think we do a lot of work with our employees and helping them both in terms of how they make how we make sure that they're safe. So giving us feedback in terms of the situation that we put them in whether it's a folks on the front line staff in our parks in the environment division that are that are that are that are helping us for example with width in camping movable things like that or the folks in the community center's who were who were interacting with the public and other things. So so part of it is just an employee safety piece, but but but I think we need to dig more deeply into it to this specific types of issues in terms of what the bottom for his deal with attic part of part of the conversations were having a cross the agency with regard to race and social justice is it Is empowering them with that information with the ability to have those conversations? I think we had need to add more structured for that. I think that's a great question one that I hadn't thought that much about in terms of this issue. But if I could add so in the 2018 we didn't put this in our accomplishments because we didn't move much beyond that conversation stage, but we did speak with Christopher Williams has been Acting Superintendent about maybe creating something like a listening Circle or healing Circle and that kind of thing to acknowledge that it was done and that's with external written and internal at to try to give them more resources than just a few days off if something traumatic happens much beyond that but it is definitely something that we want to pursue and come up with solutions to try to help there and beat and support our staff. I think that would be I mean, I think particularly for agencies that have Frontline staff that interact frequently with with people in the public. It's really important to have that additional layer of work be part of of this, you know, it's like employees will will in some cases feel that it's part of their job to take that abuse in that behavior and you know, they believe that because they're good public servants one for foremost butt too because there may not have yet been a culture established that allows those employees in those workers to feel like they are empowered to say to the general public. You can't treat me that way right and so it is really important for us to have leaders and supporters within agencies particularly those who interacts a lot. Public who are really committed to cultivating that that type of culture for the for the overall health of our Workforce and we might reach out to some of our companion organizations. I'm thinking specifically Alaska Airlines. I know has individuals who are trained to do this and to help their employees who have to deal with irate customers this so if you'd like me to give you the name of an individual or follow-up, I'd love to I just I think it's a really good point. You know, I think often times we just eat it. You know, we get we take all of the incoming Flack and we just think we have to we don't have to so well done and I think we are working with their friends at Seattle Center in the libraries and turtle just helping our employee sort of understand. How do we consistently it doesn't choose but I think turning that around in the way you're saying, I think it's a really powerful. What is it will work. Anything else you would like like to add besides you're really enjoying listening to all my questions. Just very very quickly. Just looking Dead 2 2019. I mention our strategic plan. That's that's probably the most important issues were going to do here in the next couple years because it will determine the position instead of Parks and Recreation the next 12 years part of that is is the the park district but just generally is everything else. So we're really working hard in terms of the engagement and and and really making sure that is anchored in equities ever done a lot of those conversations about more to come in 2019. Where were contending with our initiative Pathways Deck Woody, which is our recommitment RCI, and that's something that the bee is leading in leading our agency through and we can have her talk a little more about that. And then finally you've already mentioned this a couple times but But continuing the conversation agency-wide in terms of foundations of change training 2.0 and I will keep working through that. Did you hurt we going to have something to eat? I was just going to add a little more about Pathway to equity and so is Jesus mention. It's fpr's commitment to the advancement of the race and social justice initiative in the pathway to equity framework will utilize the following pillars to move spr along the pathway to an Institutional and structural racism and Achieve racial equity in Seattle, and those pillars are organizing an advocacy and for structure building tools and training application and accountability and ultimately to recognize the vision. Nice well done. Two looking forward to another great year pass here. I'm really impressed. You know, what's happened over my almost 10 years here on Council is the way we were approaching this strikes me as being real. It's genuine. It isn't just data and statistics. It's how is this impacting each one of us and I think you've brought a very refreshing tone to this. And also I just like what you said leaving space for Grace many of us will trip on something unintentionally, but being able to have the opportunity to come back and and make it right with an individual. I am very respectful. So thanks to all of you and just one more pitch Belinda and I are going to be talking to girlfriend here. I am excited about what we're going to be able to offer Belltown people forget Belltown, you know, they've somehow think that it's a very wealthy area that is all this stuff happened in Belltown is is a neighborhood that real He wants to grow its at this intersection now between the arena and downtown but it is one of the fastest growing neighborhoods with very low income families and individuals. So as we're looking at making Parks, you know, I'm sorry that our Belltown Community Center close, but you know, it was at least we understood there was no promise. It was going to be there forever, but I want to be working with you in parks to help this idea about the Belltown Bop love the Bop It stands for Belltown Orchard and Pea Patch and making this real for people encouraging the neighbors to be able to pick up and design it. They already have the designs. They just want the support to be able to go forward and as I mentioned earlier than they are today said the child support me in this effort. So there's so much good that can come from that nice. Well go Parks and Recreation. Thank you. Thank you. Ok, and next. Do I have anything else to read them? Would you like to read something in the game? And I'm going to invite our friends from Seattle Center to join us 1 2018 race and social justice initiative report for Seattle Center. Hey good. Mr. Alan's and crew very good to have your hair cut. the temperature for Friday Fisher-Price stuff we had one person Robert sign-in. Do you have anything you would like to add please? Go ahead. We have one person who signed in but since we had sort of a squirrelly start at we're going to go ahead Catherine and provide you said again take whichever one of those microphones appeals to you again will sign you up for 2 minutes. They're okay. And please introduce yourself. We've got you signed in and present rate. Thank you for the opportunity to testify today. I am a volunteer with 350 Seattle. Which is better a climate Justice organization, Grassroots organization. And yesterday with Scott green in partnership with Scott green. We presented the Seattle Green New Deal which is a a race and Equity issue as well. We presented a letter to Mayor Jenny durkan and to the council and I really just wanted to take this opportunity to ask you all to read the letter or look for the letter. It was endorsed by over 100 businesses and organizations. This campaign has just started and we're really excited about it. We are ready for big change in the city to reduce our kind of pollution by 2030. I appreciate so much that I was able to listen to this. Hearing we know that climate. Just climate issues are race and Equity issues, and we know that cities need to be the face of making these changes. So I really appreciate being here. I appreciate everything that everyone is doing and please look out for the Seattle Green New Deal. Thank you very much you thank you for coming down. Okay. Mr. Nelms. Do you want to start introductions and we'll hear from your colleagues? I am Robert downtown the director of Seattle Center. My name is Christian song. I'll come. Your son recently was appointed as a Khalid happy to be here today graduations. Jessica Smith, I work in the Redevelopment Division and their procurement coordinator and I am also the rsji Kool-Aid as of this year. Thank you both. Thank you Jessica with me the other newly-appointed co-chairs of our change team and I promised them they wouldn't have to say anything great. so I'm going to go through I'm going to start with the 2018 accomplishments and I walk through this. First off. We have a little over 16,000 events at Seattle Center and over 500 public programs that convinced that we produced. We have that start by making sure that at all of our events we acknowledge the fact that we are on indigenous land and the traditional territories of the Coast Salish people and we're trying to get that so that everyone actually does that and it's just you know, those of us our first link the first step in and moving moving on but that's why we start all of our events in app and hopefully leading by example and modeling the way for others to it hard to acknowledge the place that we reside. So that's just a small thing on one hand but a big thing in terms of on another I'm not that was in our Equity area of arts and culture inequity area of health. Will you produce * V health clinic and the arena so that was in 2018. We were blessed to be able to do that. We actually moved it up to September so that we could get it done before the arena was turned over the OBG for the construction of a new Arena and we're really happy and pleased to announce and weave weave weave made it clear to the number people but that we are going to do our next clinics in February of 2020 at Seattle Center jobs and economic development. Peace. We spent because of the the closing of curing that we spent a lot of time and energy and effort working on making sure that that are full and part-time staff at at the Key Arena would be able to Transition from those jobs. Once the arena was closed to maintain maintain gainful employment going forward and we were we were very happy to report that all 31 members of the full and part-time team. There are were able to either gained other City employment or the choose to retire at the pond are at their discretion and we we we have filled our replace all hundred percent people who wanted to have jobs and so forth in a couple in other departments are number in ours, but we're very happy about that. The closing of the Arena was was a huge cultural and emotional issue for our organization and if we're going to highlight different things that was done throughout as part of our SJ work internally. Honda Service Equity there's a a podcast that I would like to steer you through and it sits up there will see it will send it the there's a link in the presentation but it's a podcast called. Yes, and and it and what is done as we were using The Narrative of a number of people people of color in our community to expand the best all program. And so there is a right now it says that there are there for podcast but that was when this was produced there now 7 cuz there's one done each month. The first four were about our origin story. Second one was to choose the life. We live we live the creative hustle in Seattle. Third. One was where are Latin X in Seattle. The fourth one was on homelessness and it talked. Brother and sister homeless and on homelessness one talk to people about how do you how the circumstances in your life may change that would create a situation where that could happen and so it it it it is something that that we're very proud of and the the young lady who's working and and bring all those people together just as just fantastic. In fact, just give it on another thing our next lunch and learned that ours are co-chairs are putting together will be on homelessness and the panel that they're putting together will be members from that podcast. So it's it's something that we do they do a fantastic job son lunch-and-learns. We invite not just our own staff but staff from all of the resin organizations on the campus and we share different types of information with them for instance. 11th at 11:30 Armory left for thank you. You're welcome to join us. Thank you, July 11th, 11:30, and then another Equity has the economic Justice. And so one of the things that in terms of what your help has the city council, we negotiated with o b g as in to make sure that as as the arena closed and then when it reopens that the people who worked in the old arena what happened opportunity to come back and work in the new Arena number of those people are people of color and sold making sure that they have they were established as qualified workers that they have the ability to Come Back Inn is very important to them going forward and that was that something that we're proud of. Before you turn the page and can I again I just want to say thank you personally Robert to you and your team for the work you did through the OBG negotiations. It was certainly in my tenure one of the biggest things we've ever done and you were so front and center on that and making sure your employees were cared for and that we had Workforce training going forward that the whole Community was included in this and of course, we're continuing to do that on and I think a bi-monthly basis but I just want to acknowledge. What a huge I think a victory that was in all forms. People are cared for the community is acknowledged and included and then as you're saying about the intent indigenous land acknowledgement one more Superstar point, I talked with Debra Smith, who is the head of our Seattle City Light last week and told her what you're trying to do around the indigenous art, and she stepped. Jordan said she is willing and interested in talking with you about the the Thomas Street substation and putting some Eros and art acknowledging indigenous lands and people here's the best news. She has money she wants to spend. So if you've not talked with her I asked her to reach out to you and vice versa. So imma just continuing the theme to thank you so much councilmember back child when we met I I've told you that it would be great for you to just get that ball rolling. So I will definitely take it and run with it. So that's great. So good moving on to a little bit more on the highlights. so Seattle Center Arena development of the week. We talked a lot about that in terms of the public benefits that that come from that in terms of retaining jobs and so forth. That's something that we're proud of I hesitated because I didn't want to go and beat that drum too much. So I'll just say that we're proud of the fact that that that the filters that were used to retain jobs or something that was important not only to us but to our partners ovg another thing that the Seattle City council helped us to was to transfer some land that we had on 2nd and Mercer that to the office of housing that will become affordable will be developed into de for affordable housing. And so something taking what was a pocket park that was very rarely used and now going forward will be through a park. House housing authority should say I'll be converted into affordable housing is something that we're all very proud of reaching out and including the community for some very low income and see some Supportive Housing and also an emphasis of Art and music in that building it is it is a crash win and I'm just you know, once again excited for what you've done what we've done to you had a lot to do with that too. Thank you. Then on another thing that you know, when the arena closed what that meant was that there were going to be a lot of uncertainty with the resident organizations on the campus with staff that worked in those. Those are resin organizations. Including ours are with the public-at-large about okay is Seattle Center closing or is it was our should we still go or what have you in and we took the delete and then I really wanted tip my hat to R&R Market. Communications Folks by Mark Jones a Dever Dallas who created marketing creative incredible attracting access campaign. I hope you've seen some of our placards all over the buses. We have buses. We have Billboards we have we're on social media emails. We are on the radio. We're doing also all sorts of things in and our first phase of the program was from February to June was basically to talk about accessed and making sure people understood that you can easily get to Seattle Center steel and we are identified all the bus routes and all the other things that would allow that to happen and then now starting next month. We will put it to an attraction. I focus so that all of the events and the summer fall and winter will be highlighted and make sure that people know that once you get there they'll be something for you to do and see and so we're really Proud of that. And again, that's another partnership with ovg their dollars helped us with that program and we're not just doing things for Seattle Center and the resident organizations at Seattle Center. We're also highlighting the businesses in uptown to make sure that they're part of that Outreach and that marketing campaign also. Just extend that little bit of a pebble in the pond Uptown I think is feeling the love on Belltown is anxious to be part of that as in South Lake Union and you don't lower Queen Anne Queen Anne as well. So it just it brightens my heart so much just to see the community coming together and you know what, I mean is like everything else, you know, you kind of feel a little fisticuff sometimes but there is a place for dialogue and an understanding so well done when she puts her mind to it can put some put together some things is just incredible and I just want to share with you she put together for us a five-year progress report on our is check rsji accomplishments. So I'm going to leave this with you and just say that I like to thank Deborah for doing a wonderful job. Just making sure the people understood what we've done over time. Moving to some of the challenges and Lessons Learned one of the challenges that we are we have identified and and we're starting to work on is how do we become more ada-compliant? Not just in a physical way but in a in a programming an event way also in the physical where you know these making sure that the things are at the right height or people have have the the mobility are accessibility until 4 to get to Point from point A to point B, those are things that we all understand intuitively and can figure out in in in and deal with the issue about making sure that the programs are accessible and at the you know, something like a website can be used by someone who I may not be cited or are or something and you know how might you do things a little differently. So we're starting to turn over those rocks to make sure that as we go forward the work that we're doing. Is it going to be in as inclusive as possible and that we will be able to be far more compliant with the Ada Community as we move forward. When I come out and maybe it's already something you're working on but getting to the Armory for someone who has walking difficulties is a major challenge. What do you come is closest to Space Needle or at the end of Harrison. Do you have any mobile assist to me? Like the little golf carts around that can pick people up for any of that we do not have that yet. We are we are definitely starting to have that conversation and some of our resident organizations have started fad program. I believe the rep does that as a little shuttle to their theater are there plate their event in the evening? And we're looking at the possibility of maybe I'll Piggyback in your and are creating something on our own the key to that is when to do that and how often and you don't want to set up an expectation that you can't meet and So before I make this leap into something, I want to make sure that it's something that will work make a call in advance in advance save could I meet you at this corner at you know, 7 pick up to go to the Armory. There are would have you been for staff who may have some some issues I either Mobility or even a safety issue are emergency services staff. You can call them and they will escort you to your to your bus stop or what your motive Transportation mode to to come to or from we have not transition that are in our our increased at service for the general public cuz we're we have been a little fearful but that we might be a little overwhelmed. This is a conversation we often have but I think part of the social justice expands to those with disabilities and all ages. So thank you for putting it in and get on your your next Five-Year Plan because I work in customer service. So we often getting calls about concern how to get here. Where's the closest place? We would your rectum and to certain hours when the gates opened because when there is lots of pedestrian while so concerned by The Pedestrian safety, so with direct them to the right place, they can load and a mentor to the building right away. We also have wheelchair and customer service. Sometimes we will bring out a wheelchair to meet them at the gate we talked about as a group employee Ambassador service saying can we have a talk to Chaz what people around there some safety and liability issue? We haven't worked out yet. It sounds like to me the city has some skin cancer. When you use a sitting vehicle to transport people that might be a liability issue issues are resolved and we can talk with Metro Transit as an example. They have no I mean one thing is that's why we have insurance, but the other is that there are ways to make it safer for individuals and I just would ask I would I would really respectfully ask don't let liability issues alone. Stop us from doing something that will make it accessible for everyone happy to hear challenges and Lessons Learned on how to get to a position where we could actually do a clinic in 20 February 2020. We have to figure out where to put it because without the nerina witch hat has all the amenities that we needed. So, you know where you work at work kind of cobbling together a number things and thanks for the partnership Cornish. This is offering their Lobby. Hollis is operating there's an X all will be part of that in the Fisher Pavilion will also be part of that others, you know, the Opera snooze face said if there's anything you need, I will do that so much. I just want to say that as far as those types of things. Everyone was kind of all in and then the funders who who are helping do that are all kind of lining back up in the Partnerships until 4. So we're really excited about Tabitha. The original lesson was we didn't know where to put it. We tried to look at going off site to another place, but that didn't work out in the morning and we were challenged ourselves internally one of our staff members said we got to come back to Seattle Center figure out if we can do this and we did and so I'm just really proud of folks didn't refuse to give up and and that was the other thing I'd I'd mention it as is I mention these two are fantastic and our change team is in terms of lunch and learn series. I mean, we've tackled all sorts of things. And they they they are willing to put in front of our staff the most difficult issues of abuse Workforce Equity races. Whatever it is out there, they will put it together and we'll have a conversation about it. And like I said, we invite the whole campus to join us and we try to develop some growth and opportunities from that. It's not just that we have a conversation. We try to give people some Pathways to say that that for instance. If you are looking for a way to advance your career hear some steps you need to take if you're looking for getting some help in the end the how you might navigate this as a person of color and then you don't believe that there are pathways are avenues for you. Here are some people to talk to about already done that and so it's it's a really I couldn't be happier with the work that they're doing and I they come to me like on the homeless and homelessness lunch and learn this coming up next month. They asked me if they could do that and I could sure get on fact let's let's go. Let's go. Let's go for this, you know it is because people don't want to tackle difficult issues these these these guys do so, I just want to say thank you for that. After talking about a lot of highlights and in what we're doing this is more of a low light. So I just want to be clear about that. We spent most of last year with their eye on the prize of dealing with our staff and our employees and I take full responsibility for the fact that we didn't do as well as in our purchasing and Consulting as I would have liked because our I wasn't on this Fri I would and so you can look at the numbers. We always break them down by different ethnic groups in somewhere. So people can see what's actually happening and as we got these numbers earlier this year we said, okay this this is not this is not who we are and so we are been working internally to make sure that we are training our staff and and understanding how to use it our system where the things are Had a Farm. Find the purchasing contractors or their Consultants Etc. And we're walking people step by step by step through the process to make sure that they understand that I'm not I'm not going to sit here and try to defend one thing one way or the other eye guy could have grouped all these things together and then tried to say that we're not doing that bad. But that's not how we do it. We want to show you exactly where we are and what we're doing and as a collective our executive team and our leadership team are disappointed in each other in and where we are at what happened in 2018, and we will make sure that we do far better going forward and so I'm not going to try to suggest that there's something here that does not here and I'm not going to suggest that we did better than we did. fair enough The another thing that that I've been asked this is to do the prompt payment of performance. This is something that I can say we're doing well at and I'll just leave it at that. This is a couple years ago. We were not doing as well. We've got some internal processes in place and now we're doing fine doing fine and able to pay an average of 8 days after receiving an invoice that is extraordinary. I mean it used to be that if you could get it within 30 days that was considered the norm, but now that you've moved it down to eight that's really excellent and your percentage of late payment. Of course, I know you and you wouldn't like that 6% but now it's less than other departments by a great deal. And I know you'll continue to work on that as we will in and just to be clear the person who's responsible for turning that around sitting right there. But mistress or I'll know if Jessica. Now I'm going to ask you a question. What is your day job when you're not working on this? Admin staff analyst and Redevelopment. So I'm sure you know Julia of course, so I support the project managers. So how did you do this? What did you personally individually do to change the system so that you were able to pay vendors in this kind of a timeline comes from our immediate work group. So we're just constantly on each other. Like did you get that invoice? Did you get it signed? Okay was taken to accounting and never sits on anyone's desk for the job. That is the key the key before when we were struggling is being set on people's deaths. Now, Jessica doesn't allow things to sit on anyone's just asked for more than a day. Is this very clear. Well, that's great. And I'll just wanted to give you a couple of examples of our use of the tool kit and we're trying to embed the toolkit and more and more and more and more into what we do. So everything that that comes up that we we kind of has it been have we run it through the tulips a process. So so just tell Dad that X that muscles exercise over and over one of the things that we recognize is that we get a lot of incident report and data for four people that were there are security staff deal with and we don't have any real information about them in one way or another is just that the numbers are here are the numbers that are if there's a bike no one knows what what why or what's going on. So we will use the the toolkit it's hard to say. Let's collect some more data just to make sure that one we we know who were Dealing with two we know we're not dealing with a certain population more than we're dealing with others and three that there is an equity or prostitute dealing with all of them going forward. So we started this here collecting data on the some of the demographics around who we're dealing with to make sure that everyone at Seattle Center feels like that. They are welcomed honored and treated fairly and so that's something that we're looking forward to be able to share information information with going forward, but it's something that we're starting at this time. The other thing that we use the tool kit on West of Staff transition plan that I've talked about before and that was to make sure that as we transition people from the Key Arena that day that they had a a clear pathway to ongoing gainful employment with the city as well as we went forward and I would like to say that Very proud of the work we did for the full and part-time folks, but there is a gap that we couldn't deal with in that is just like Jesus in Parks. We have a large number of intermittent stat. We have hundreds of people all of those staff at work in our vent base without the key providing the events. There's no work for them. So what we're doing now to make sure that the ad that we maintain connection with them is where we're training and doing things on a quarterly basis to make sure that we keep in contact with them back will have our our next quarterly meetings are next Monday Tuesday. And that is a Q&A with me and some training and so we're making sure that the staff while they're going through this transition from a public run Arena to a privately-run Arena. They do not lose contact with the organization that they've been supporting for years. It's all this is more information on the Emergency Services located in the u stand it that thing that I talked about they were pilot probably taking his farm and we will have information and this is the transition plan for a Key Arena and it took it was used to identify specific Workforce Equity Equity concerned and I would like to say that the work from this tool kit in the workforce Equity concerns that were raised actually led to US changing our strategic plan. So going forward or looking at us is in workforce planning. Is that as we start to cuz cuz our staff is aging as we start to replace people who retire excetera. We're looking at it through this lens of how do we make sure that our staff reflects the makeup of our community and how do we make sure that those opportunities are spread throughout and that was not something At the executive me or my team or anybody that was something that the staff in HR said this is what we should do. And now they're leading that effort to make sure it happens. Just an HR HR Human Resources tip my hat to Sasha and her team for saying this is what we're going to do. All right. Well, I really again say thank you and Robert you have been leading the charge on this I think other departments in the city have been watching your work. Thank you. Both Jessica and Chris for joining us. It's good to meet you and appreciate all that you've done and very exciting things that are going on at Seattle Center. Would you two like to add anything? So I drink the parks presentation you asked about. If any of the Wimpy vendors, like we're being pushed and like being able to do the work in like improve their skill and so off the top of my head. I have to Wendy vendors for either purchasing or Consulting that did an excellent job with us last year. One of them was a construction firm and it was a blanket contract for services to help build out. What is now the home of Northwest Northwest Folklife inside the Armory, so So that was one of them and then the other one was we had an architect who was wimpy firm who designed the build-out for turning the next 54 the into Center Park Center Park maintenance facility. so both Folklife and park place where housed in Bressi garage and blue spruce which were part of the Arena Redevelopment. So I just wanted to add great. Thank you. Thank you. That's good feedback. And I want to say something like that changed him for many years and we are actively pushing rsdi initiative. But we also got a message from the Department especially Auto director of like business as well for the whole Seattle Center. It should be angry and I'll culture and it is happening. I can feel that the culture is Shifting. This is the most exciting time to be eating this work and I'm just a fact it's out that two of us people Calif email relatively inexperienced. So proud and feeling that the department is really holding up this out of Shea, I promise and what their walk the top. Thank you very much for that. Well kudos once again to all of you. Thank you for coming. That's the last thing we have on our agenda. So our meeting is adjourned. Thank you.", "end_time": 5142.3}]}