{"format": "raw", "annotations": [], "confidence": 0.927952087467367, "data": [{"start_time": 0, "text": "Over there. Good afternoon. Good afternoon. I can barely hear her. I don't have a good afternoon. Yeah, but it's not. Good afternoon, everyone clap once if you can hear me. All right, that works. To all of you who are here today at the standing-room-only audience and I'm going to turn down the microphone a tiny bits. Can you all hear me now better? Okay, let's just go for it. We're going for it to come to my restaurant and councilmember bagshot. Thank you so much for being here. Today is a special committee meeting of the housing Health Energy and workers rights committee. This committee will come to order. It is 1:35. I'm very excited for you all to be here and we have a full one hour plus packed with three panelists today. We'll be discussing Seattle's human service provider contracts will get a chance to hear from the actual experts on the field on the ground. This room is full of those individuals. You are the experts you are the leaders in providing Human Services will hear from you about what it means to provide services to our most vulnerable populations will hear from individuals who've been directly impacted from the Human Service. And Frontline Human Service workers. This is a time in our city with homelessness and income disparities have led to a homelessness crisis a lack of affordable housing and an increased need for human services without you without the Frontline Human Service Providers. We cannot provide the critical services to our most vulnerable in the community without adequate funding organization face tremendous burden many of you have been involved in this conversation with the city for over 10 years. In fact until last year not all human service provider contracts even received an inflationary wage adjustment. Well, this has been an issue that many of you have been interested in addressing. We have made some progress last year really appreciate our Council colleagues who helped us get a 2% increase in inflation. For Human Service Providers and I want to emphasize all Human Service Providers at a time. When were seeing increased need for homeless Services health services and Housing Services at the same time. We heard from any of you that qualifying individuals for housing for food for assistance workers who are on the front line are eligible for many of those Services due to low wages and increase pressure on the organization in terms of cost not just cost for labor. But also the cost of property and Rental payments and so much more This is Our obligation in our challenge as a city to make sure that we are fully funding our human service provider contracts. I want to be really clear about something. It is a partnership that we have with you and it's an obligation that we have this isil RN. There's a good reasons why Seattle contracts out services to the humans? Supervised Human Service contract most trusted members in the community many times are providing bicultural and bilingual services and then cases you have trusted relationships already an individual's will come to you. You are the experts in the field and because of your focus on serving these individuals, you are often more cost effective and efficient than the city would be in terms of us provide direct contract, but be cost-effective doesn't mean that we as a contractor should contract away our responsibilities. We've made a commitment to support you to support the workers and the organization to support the unions and the individual workers on the ground level for a leading the way with providing is critical services and we can't sell these commitments. It is Our obligation and it is our responsibility to make sure that those who are ensuring that they are our services for the most vulnerable have the services that you need and the resources that you need. Of the Building Services. These are services for our elders at senior centers their services for the Youth who are seeking housing and employment. These are our community health clinics. These are folks who are providing services to those of experience domestic violence and sexual assault and providing prevention and response you're providing access to food through food banks and meal programs and you're providing home by housing folks and helping to get them into shelter. So we want to be really blunt and we want to be honest today. We feel that we falling down on these obligations. We know we have fallen down on these obligations and the larger issue around historic and Legacy underfunded something that my colleagues especially customer O'Brien who's not here today has tried to take on in the past years. And now we have an obligation. Now, we have an opportunity to build on what we were able to do in last year's budget thinks the council member that shot for trying to budget last year. We have an opportunity to continue around that been. So we're at the turning point last year what we did in the budget around the 2% and play Shannara adjustment with a step in the right direction, but we need to ensure that these contracts receive inflationary increases across the board this year and every year this is not just a budget exercise the budget should be a reflection of our value and we value your work we value your organizations and we value the services you provide to the most vulnerable with that. I want to invite up our first panel and before we do that. Furniture Council colleagues for some public comment and opportunity to hear from everyone at the table come from Irvine. Please go ahead and have a seat and we will get you set up here as we turn it over to our Council colleagues. I want to note for folks. We're going to three panels today. So there's a chance to hear from a number of folks and then we're going to do a public comment at the end councilmember us. Thank you. That's what a mosquito die for safale. Wanted to welcome everybody here and also let everybody hear know that unfortunately because we are also fighting on other struggles related to displacement identification in Central District and all the work that's involved in it. I'm unable to stay for this meeting, but I just wanted to say a few things before I left and I appreciate being given the opportunity to do that because I know we have three panels and the discussion is a very full one I want to do thank every What who's your and also who's not here hundreds of people who have been on the front lines of addressing the acute crisis of the shortage of affordable housing and the homelessness and the overall social crises that has erupted in our city and in our region and we know that it didn't come overnight. This is something that has now shaped up and become bigger and bigger over so many years and over the last five years that I've been in 3 hours many of you and I have talked with one another in our exchange of ideas how we can address this including the people at Youth Care and many other service providers. And also I wanted to recognize SEIU 1199 Northwest and represents. A lot of the workers were on the ground and seeing the crisis first time, but also ironically being part. The people who affect what are affected by the crisis and I think this is really the worst possible Nexus where we have a whole population that needs service and the people who are starving. Population are also now being so impacted by the skyrocketing rent the lack of affordable housing the lack of healthcare. And so it clearly is is is a call to action. This is a call to action for all of us. So I really appreciate all the work you are doing and also the work you're doing advocating for increased funding you're after you're doing the budget cycle. You have told all the politicians here in City Hall in not not just on the city council brought to the mayor's office about how these services are being nickel-and-dimed. I agree 2% inflation adjustment was absolutely critical, but let's face it is just a drop in the ocean of what we need. We need, you know, if we're going to turn a lot of this. Turn into actual into action. Then we are going to need board policy Solutions. We're going to need to expand the tiny house Villages which are now showing a really terrific track record of foundation to affordable housing. We need to fully fund all the services you all provide and we need a major expansion of publicly owned affordable housing, but none of this is possible. If we don't also don't unleash our Collective forces to fight for Progressive revenues by taxing big business and not accept defeat because of Any setback last year. Let's keep moving forward and fighting for it. I also hope that you will join the city of Seattle renters commission the tenants Union B Seattle and many other community organizations have joined my office and other community groups to fight for rent control in Seattle because it is high time and I hope you all know that right now there's a real struggle going on in New York City to maintain and expand their rent control because they have seen to their personal experience that having rent control without key. Lupo's actually provides a Lifeline against the affordable housing crisis. So I hope you will all join the petition. I hope you will all continue fighting a nighttime the committee for providing this opportunity. Appreciate it. Thank you, O'Brien or back to thank you for being here and thank you much. I think accounts member of Ryan for Brian has been working on the historical of the Human Service. And this is the most important if you could read into the record of the item and from Neighborhood House Corporation for Supportive Housing and Jim from sound Generations. Agenda item one stabilizing human service contracts for everything discussion. Wonderful. Thank you. I'm as you guys are joining us. I just want to say if you could thank you to all the folks who made today possible and a lot of you are in the room, and there's so many more. I want to see the folks at the Seattle King County Coalition Hillary Coleman who's been working with us to help pull this all together from the Coalition on ending homelessness. In addition to the tremendous amount of folks from the Coalition who worked on policy change to get this conversation started. Just Alyssa few Allison dies injure from the Seattle King County Coalition on homelessness Julius travosky from the Human Services Coalition Lawrence a from PES coins from Plymouth Housing Aaron Moore from West Seattle helpline flow from Catholic community services. Rizwan from Muslim housing Alex and Andrew from seiu775 84 from Central staff at both of them now working on this issue and Dan has Stephanie and Joseph from our Communications Temple day off and it is a packed room. So let's give him a round of applause. So we are going to turn it over to you all. Thank you for being our first panel and we do have 20 minutes for each panel on please go ahead and introduce yourself and thank you again for being here with us today to talk about the need to stabilize our human service provider contracts. Good morning. Thank you. Counselor Road Moscato seven members of the committee and good afternoon. Thank you for the opportunity to testify. My name is Mark okazaki. I'm the executive director for Neighbor House. One of many nonprofit social service organizations serving vulnerable populations here in the city of Seattle is a multi-service Community Action Agency. Our programs extend across a wide range of needs including Early Learning Youth Development employment housing and aging and disability services. We imply about / 280 staff is speak 40 different languages and dialects and how often are multi multi lingual this afternoon. I've been asked to speak on behalf of all nonprofit organizations under contract with the city of Seattle Human Services Department in support of an automatic inflation adjustment Hallelujah. I cannot express enough how important this is in this point in time for all of my colleagues. All of us are facing tremendous Financial stress in the midst of a booming economy and full employment labor market that is driving wages up and making housing less affordable. The Seattle minimum wage has created real compression issues for Neighbor House of my colleagues across the city while we support livable wages for all employees are also forced to with the real challenges of balancing budgets that are already stressed. We provide all of us provide both vital services and our success is your success when it comes to dancing important public policy priorities that I can contribute towards a healthy vibrant and inclusive City like the city our cost go up every year rent Healthcare utilities insurance, but most of our cost RN salaries in my case. It's 75% of my budget. And every year when we build our agency budgets, we have to find ways to absorb these costs even with an inflation adjustment. We are forced to make hard decisions about where to cut and the last place we want to cut in our services by way of example, I run a state-funded preschool serving 160 low-income children living in the four largest public housing communities here in Seattle this year. We have to subsidize the state funding to the tune of $80,000 in this life estate approve a 6% increase in preschool funding and even with that I am still looking at an $80,000 shortfall in next year's budget the best my child development director could tell me was that are but our deficit wouldn't get worse even with a 6% adjustment like all of my nonprofit colleagues. I'm doing active and aggressive fundraising to make up for the shortfall and despite our best efforts. I'm not able to pay competitive wages are Average preschool teacher salary is $37,000 by comparison a kindergarten teacher in the Seattle Public Schools earned on average $74,000. You can see that we are hard-pressed to recruit and retain high-quality teachers at support staff like my other nonprofit colleagues. We do this work out of commitment to social justice. We do this work because we want to make a positive impact on those who are struggling we do this work because we believe that shared Prosperity is the only way we create a thriving City for all and inflation adjustment once off all of our funding dilemmas, at least it would stabilize the foundation of our funding from the city. I heard your support for an automatic inflation adjustment. Thank you very much. Thank U council members for this opportunity. My name is Debbie seal. I work for National nonprofit organization called The Corporation for Supportive Housing or CSH and we provide loans and technical assistance to nonprofits and communities to develop Supportive Housing because it is the solution to Chronic homelessness. So I oversee our work in the Western United States and I live here in Seattle. But a lot of my work is in Los Angeles where we have our largest program office and Los Angeles is currently going through a very significant expansion of its homeless response system in that literally billions of dollars are going into the system right now too and chronic homelessness over a 10-year. And so I've been asked to talk a little bit about what we're doing in Los Angeles to support nonprofits through the significant expansion. When we started the work of implementation lead we first had to acknowledge the significant underfunding of our nonprofit Community for years nonprofits had lagged and salaries and not been able to compete with the government industry. They hadn't had any funding for their infrastructure. And so we first went to the nonprofits and said what do you need? What do you need to build your capacity to take on the large responsibility of deploying these billions of dollars and resources and they essentially came back to us with three buckets of work in terms of addressing their capacity. We looked at Financial liquidity organizational infrastructure and Recruitment and hiring in terms of liquidity. This is a top concern for nonprofits in Los Angeles because there's a three-month lag between when they incur expenses and when they receive the reimbursement from the county so the Los Angeles homeless Services Authority and an organization called the nonprofit find It's fine. It's looking to create cash advance program of 3-month cash advances with few strings and the ability for nonprofits essentially use that cash to pay for that leg instead of having to potentially have large amounts of unrestricted cash on hand, but you can be incredibly difficult summer taking out loans and having to actually paid debt to manage their services while they waited for those reimbursements and it was definitely prohibiting on profits from growing and increasing their staff because of that concern about liquidity as well as the largest number of developers in Los Angeles will be nonprofit organization. So we see a sage works with the city of Los Angeles to create a 60 million dollar Loan Fund that would pay for a position and pre-development class. So that nonprofits would be able to secure sites and pay for those initial cost before the permanent financing from Publix Hunters came in the Second Challenge around hiring I was Interesting when it money came into Los Angeles there were a thousand jobs created in the homeless housing and services sector. So needless to say the county recognize their role in addressing this with a nonprofits in hiring and recruiting staff and they created a website that's called paycheck with a purpose where they encourage non-profit solicit their jobs on the website. They actually actively manage and advertise that website themselves. And then finally even some of the most sophisticated nonprofits are often operating in a deficit in terms of their own internal organizational capacity around Information Technology Human Resources, financial management and fundraising because no one wants to pay for those services that are actually foundational to helping a non-profit operate. So we're part of a group in La that's called the funders collaborative which is a group of public-private and philanthropic funders and we looked at the situation and said, what can we do to support these nonprofits? Can we put together a fund of $150,000 per agency that's working on housing or Services right now for anyone experiencing homelessness and paid for professional technical assistance to get an assessment of what their organizational needs are and then to pay for that technical assistance and their General operating cost to build and expand our services. So I wanted to just mention also as I looked through the West Coast Portland is another Community to consider because they have recently made a commitment with the county of Multnomah to create 2,000 units of Supportive Housing and chronic homelessness there and there's a little bit of a head start in terms of nonprofit capacity because they're already putting annual increases in their contracts of three to 4% for their nonprofits. So I hope that's helpful to get a sense of what's happening in some other communities and appreciate your dedication to this issue. And we'll do questions at the end here. Thank you very much for the opportunity to share with you my thoughts on having automatic angle adjustment of inflation for the Human Services contracts. My name is mcfaul Miley does sound generations and generations? We provide services aging adults and adults with disabilities and four pillars food security Transportation health and wellness and assistance services, and we operate six senior centers and eating sound Generations. I've seen that the rising cost of doing business from our ability to keep staff trained having the appropriate equipment to do our jobs in the cost increasing just to do our operations and from a programmatic perspective examples with our Meals on Wheels program right now. We are experiencing a 12-12 week waiting list because we don't have additional funds to be able to actually provide food security to hundreds of individuals here in the Seattle area in addition prior to working for saturations. I had the opportunity to work with a major Aerospace company here in the Seattle area for more than a 31 years are retiring as the vice president responsible for all of our facilities in our commercial airplanes areas in Puget Sound and also in the Charleston South Carolina and with my experience, I've learned that given the opportunity he would make a prudent Business Edition for us to solidify the ability to have funding available to maintain support to our Human Services departments sustaining the services that support Seattle residents. So let's make Seattle a great place to grow up and grow old. We do have a few questions councilmember bagshawe Debbie good to see you again. And thank you so much for your wisdom coming from Los Angeles and Portland. We collectively have had good contacts with LA and Portland and just the last couple of weeks and talking with people about what's working for them and those cities obviously with Los Angeles with the initiatives that were done. Like what were they Triple H countywide and H in the city, they raise billions of dollars, which of I think of course, it's something we need to go back and look at the big the big Progressive funding to be able to help people with housing as well as just to make sure that our providers are supported. Would you talk to me a little bit about Portland when you talked about the various contacts there? Who are you talkin about if we wanted to reach out and talk with them? Sure in Portland's hour working with both the city and the county of melanoma, and then there's an entity called Metro that oversees that broader Metropolitan response, and they're all working together to work toward this plan that they've established and adopted other councils. Jointly adopted a plan to create 2,000 units of Supportive Housing through their Regional governance their new Regional Governor's program the TriMet Portland and Multnomah their Regional governance to join office on homeless Services is responsible for implementation. So can we talk afterwards? I just would like to get names and phone numbers and be able to reconnect with you. Thank you. Thank you come from Brian. Thanks for all the work you do and thanks for being here today. And your advocacy. I've been on the council counselor Big Shot for nearly 10 years. And unfortunately, it's only a few rare instances where I recall in the last 10 years where it actually made inflationary adjustments are contracts curious in the absence of those what are the decisions your organizations have had to make an what's the results were saying on the street? I said earlier at a press conference for neighbor's house and again for all of our nonprofit brothers and sisters that we have to make sure we are always searching for efficiencies where we can find cost Savings in our ministrative activities. And the last thing the last thing we want to see cutter services to that point where I think we are at a critical we may be going to the city and saying we need to serve more but with this much money, those are the real hard choices that we are confronting coming from that question. And another example is you know, we're a force not to be able to even provide cost-of-living adjustments to our staffs. And now they are unemployment rate is so low with in the area that we have people leaving to take other positions because then get paid more and it's just because we have to make the tough decisions to try to be able to deliver services and the challenge Thank you all for bringing that up a mark in particular when you're talking about neighborhood house. When you having to lay people off at a time when we know that we need so much more services across the board as councilmember O'Brien's talked about for years. We are working so hard to get additional units of housing for people can get inside. We know that the housing first is the model and it's all of you said Jim you as well that if within your organization's you're having to lay people off at a time when we need more and more of this. I just would like to challenge us that made us were all talking today. One of my frustrations frankly is one of our local newspapers who will always say you need to do more with less. You just need to be more efficient always tell us that not only do you need to do more with less. You just need to be more efficient. What would you say to them? It is so frustrating. I'm frankly because we're looking at Regional Solutions and we need everybody in that the city. We know Place apart the county the state I've given up on our federal government frankly, but locally knowing that we're going to have to also reach out to businesses and to labor and to philanthropy to say we're all in the soup together and it's not an either-or. It's an and but I have gotten to the point where I just can't don't even say to me do more with less. We got to do a lot more with a lot more. He had a question coming earlier and that we are not doing our duty. We haven't fulfilled Our obligation to ensure that we give you more and so that you can do more. I want to be super blunt as well. And I hope the Seattle Times is watching a because last year they had her eyes are efforts jointly on Council and in an effort to try to stabilize contracts here as somehow trying to take money away from humans services in homeless Services by investing in front-line workers and organizations, and it is quite literally the opposite. So I hope that our community who tracks for our local media and otherwise sees this incredibly full audience standing room only and so many more people who for years have been calling for stabilizing the contracts and here's our Doing an unanimous call from Council that we want you to not only be able to fulfill your contracts which we've asked you to do but that we're giving you the funding so that you can do more with more. And with that. I think they're coming in your comments from calling many. Thanks for coming for all your hard work. Really appreciate it. Let's give this panel one more round of fr set up to the podium care or I guess the table we are making policy with the local Frontline experts at the table. Literally if we could please invite up Tristan Spirits from youthcare to net Market from Catholic community services and Susan from family. Welcome. So thank you so much. And if there's anybody else who is supposed to be on this panel that I didn't call Susan Antonette and Tristan, please feel free to make your way up here. How are you? I'm go ahead and have a seat. We have a little lamb time for you there to sauna and we have internet and tricks and these are our real experts. You all have had the experience of working with human service provider organizations and the professionals as well. If that's correct. Please feel free to introduce yourself and talk a little bit about the services that you all have received and why you're out here advocating for stabilizing human service provider wages and contracts. Good afternoon. Counselor money is tris's fears. It's real close to your microphone is already. Alright, I'm here today because I want to share my experiences that working with the longtime UCare member Joellen boss who actually now works for the city before I met Joe. I was homeless. I was relying on anything to survive anything you could imagine just to find them you a snack a few bucks to get to where I was going. It was ugly. I was depressed sad desperate felt abandoned black support. I was eager to make something of myself, but I didn't know how to do it. Fortunately, I had a friend that was a part of Youth Care. She referred me to a woman working for Youth Care eventually. I got in touch with Joe Joe was adamant about trying to meet me in person. Who was the first person who actually would send me the information packets and then took the time to sit down and explain them to me instead of just saying hey call this person. He would reach out to them first and put me in touch. He always took the initiative. I worked a job for 3 years. If I need a food clothing anything, I could always call and reach out to Joe if I needed help most the time Joe hadn't and if you didn't he knew the direction to put me into work so I can find it. He would always randomly send me an email or call to check in those small bits of communication asking me how I was doing how my job searches were coming along. So me that he was willing to go above and beyond and they truly cared. In the beginning there were times. I missed a few of my meeting with Joe. I thought he'd give up on me. Honestly. I thought I'd just have to go back to my ways. But Joe was always there consistently no matter what. And without the time to build the trust, they would never been a possibility of a relationship to get me to where I am today. For me personally, it's been hard to trust white males because of my history with them and I have faith in someone like that is rare this random guy was there for me more than family. I work in sales the best way I can describe it. As I was just commissioned. He wasn't going to give up to the deal was closed. If it weren't for job, I probably be another statistic the people I grew up with the dealing drugs the killing themselves to support their addictions to the PPC outside. They don't have a job. Where would I do without you scan? Probably with them. I recently watched an episode of ice in the said that people have a history in the criminal justice system have a 95% chance of staying out of prison if they last 3 years without reoffending 3 years is how long that's been with Joe. People I know that grew up in these systems have it hard. That's a tremendous accomplishment for me. Someone like me that grew up the way I did to make it out to only be a 5% person of going back into the criminal justice system. I got a tremendous accomplishment. The first time I was putting the tension I was only in the fourth grade. I was raised in the criminal justice system been in the foster care system given up on the people. I know that were part of the criminal justice system and the foster care system today, they're dead. Have an amazing credit score. I got three daughters that are my everything have an apartment downtown. I would have great paying job. That's what three years of a consistent staff member can do for someone. Honestly, the fact that we have to tell people that this is what kids need is ridiculous because if we know where those kids might end up and we know that there's a way to stop it why we're not putting our resources there toward our children our future. I think I chose there for me and I hope you will support this cos and these human resource agencies. So all you can have someone like Joe. Thank you for your time. I wish you and thanks for sharing this as well and counseling committee committee committee members when I heard about the opportunity to speak with you. I jumped at the chance to share my story. I would like to start by thanking you for your continued support of a number of programs at Catholic community services and our sister human service agencies that serve Seattle's for homeless vulnerable and marginalized people. My name is Tony Burke at. The bar kids are longtime seattle-based badly and we love our city. There was a time not so long ago that I was lost and stressed and living in homelessness with no boundaries and no self-confidence. I wanted to find purpose in my life again, but I was wasn't able to move forward with my life without living in homelessness Catholic community services assisted me in finding housing and I was finally able to find stability and turn things around after getting settled into my home. I was accepted and graduated from Catholic community services as fine Social Service employee training asset program. I learned about trauma-informed care structural racism implicit bias professional boundaries and more asset prepare CTS clients who want to return to work by giving back to their community. One of the many asset Klein graduates like me have been hired at ccs. Once I graduated I applied for employment at ccs and was hired and I have been working for nearly a year now. I receive a promotion last week. I tell you this because I want you to understand that I would not be here today have a catering for Human Services if him the services hadn't been there for me people who ever lived under traumatic circumstances and are in need of services. It takes time to blossom into rebuild their lives and regain confidence. We want to be healthy and safe. We want to be a part of the goodness that make strong families and communities social and human service agencies helps thousands of people who have walked in the same homeless shoes that I have to repair and Lead productive lives. I love my job, and I'm proud to be working full-time paying rent feeding my family maintaining a car and insurance even with good benefits at CCS. I'm living real close to paycheck to paycheck. I appreciate your leadership in the passion you have for our city. Thank you for taking time to read today to reflect on the important work and human service agencies provide. Thank you for thinking about us who are dedicated to skillfully providing services with compassion are Human Service. Agency budgets are like me we need stability to do that. Please consider the inflation adjustment to help provide that stability. Thank you all for the work and Leadership. Thank you so much. My grandma's name is Tony as well. So I'm really excited to be here. Okay. Hi everyone, and my name is Sue Saint Estrella. And I'm a caregiver for my son Michael. She's 19 years old. And he has a disability and I just stay my second left. My first language is Spanish. I'm just trying to say in English and I hope you everybody understanding what I'm saying. Nothing. When I I'm here, you know because a lot of parents they need that support special needs. The parents with special-needs kids. They need a lot of help. I'm here. Just I I want to be there boys kiss the first alarm in one of the problems is because they have language or they speak they speak no English and they don't know what pronouns day they can have and it's really really hard to have a kid with a special needs is a stressful. It's car. Nobody understand until you how I start a kid with disabilities. and I'm here because okay, excuse me to say I want I want to say my son. He just get a lot of I mean Services because I I made Mina she works and Neighborhood House and she's very nice. She's very helpful for and she's like my angel because I I have nobody to take care of my son and he just get a DDA. Thanks Mina and thanks Neighborhood House for neighbor house key get and I and I have our guardianship it was hard for me because the language and signed the papers. It's a lot of a really is a lot of process and it's not easy. It's not easy. Especially we don't speak the language language is difficult very difficult. So I'm glad I have help. And what are you going to say? They have they have it's a lot of support group supports. So it's how I feel comfortable. They have many services. But what I feel comfortable is when I come to the support groups and it's it's nice to have another parent. I feel like I wish even if they speak English we speak the same language because we have a special needs son after of kids. I mean in And I'm a little nervous because I never talk on public like now, but I'm just trying. Thank you very much. Thank you all so very much for sharing your stories. That's meant to your family before you go. Let's see if there's any questions for our Council colleagues. How far back so what's next for you for each of you Tristan and Tony and Susana. What's what do you see next in your life? For me myself. I just want to continue advocating for my community to try to restore balance into it because it's this is Seattle. I grew up here and I noticed a tremendous lack of Seattle. So, you know that balance has to be restored. For me with the impatient budget if you want to forget it. I want to stay in Social Services. It's my heart's desire to help those that are less fortunate. I want to see everyone's be successful. Enough for me. I'm happy to getting those services for my son and I'm would like to share with another people because there is a places they can help you like neighborhood. They can help you and if it's so nice to have a help especially for us. I just want to say Seattle isn't dying. It's getting woken up. I do. Hope, or that. What are the things we hear a lot about is because of the unstable contracts and the low amount that each kind of human service provider contract has been given there's turnover in case management and one of the things that I'm interested in and we talked a little bit about this at the last election Committee hearing on homelessness was the need to actually have indicators that are friends in the human service provider organizations can actually meet and one of those issues that I'd love to see us attract more of his are we paying enough to maintain the same case managers? Have you all had a situation where you've experienced case manager is having to change over or it have a colleagues and Friends who've seen case managers change and does that mean you talked a lot about Joe you talked about Nina. You know, what what what does it mean to have the same case manager in place so that we can really contextualize that comment is that we need to get higher pay raises wages. Case managers case managers are Advocates yummy. They can't be around that everybody needs to live and it's hard to live with with low wages. So you have to if I were you losing them most of them are either they're falling into homelessness themselves, or you are finding a job that can pay them or just changing their whole career but the need for having Social Services. It's it's really need we have a big homeless homelessness percentage that's really huge. And then unless something changes and wages go up and Social Services we can lose lots and lots of people Affirm is specifically the having somebody there that I could stop and build a relationship with made all the difference. If I didn't have somebody that I could sit there and tell my deepest intermittent problems with and share those with them. They would not be able to really put me out of those because I would have been holding back from some of that didn't trust as much she knows what that openness it made all the difference. If I didn't have somebody that I got said three years made my difference to be the young man. You got to see today. What are you would like to say is for me? It is good to have a people helping you. I got they understand how you feel. What you what you need. What do Sons need and especially because sometimes we we got depressed and sometimes we we do not even want to answer the phone. So for me, she's helping because she was calling and like, I don't know if she feel she filled out. She understood understand how I feel she was calling me or text me. In this is only what I mean. What I'm trying to say is is she did a lot. Yes, she did a lot for me and I just want to try to say I want to say she understood me how I was feeling so she's pretty nice. I don't know. What is Nina here. Yeah, she's here. I really am grateful for the three of you sharing your amazing Stories. It's clear you're doing amazing work in our community. And I know that there are thousands of others including mini in the room today and Minnie out there on the timeline today and as a city and a community we can do better to support your amazing work and will start that today. I just think that the title of this day Auto Body Seattle isn't dying. It's getting woken up. Thank you for that. Cousin and I are saying somebody call, what's a tweet. Let's give it a credible individuals. We really really appreciate you sharing your expertise with us. So in whatever order you all prefer, if you'd like to start down here sir, and we'll go to Terracita at the end and then we will go ahead and have you introduce yourself and talk a little bit about why this issue so important you very much for having us. Really is exciting to be for the city council in Seattle. I'm Horace about him a program manager with Plymouth Housing group Plymouth provides permanent Supportive Housing for over a thousand people in Seattle and we are offering probably the most cost-effective inhumane intervention for some of the most vulnerable people in Seattle. I personally supervise 6 case managers at two different buildings in downtown and between those six people they provide housing Case Management Services for about a hundred and sixty two different people the majority of those people the tenants in our buildings are they were chronically homeless made him suffer from physical ailments mental health issues substance use issues. They're good people and Most of them need some kind of assistance. I was a case manager about a year-and-a-half ago. I put in about 40 hours a week. I lived with three other people on Beacon Hill and the only way that I could afford to do that was to the generosity of the person that owned the house key believes in social activism to the personal financial loss to make sure that we had decent housing and it was a struggle even after we pass the 15 now resolution to maintain that I made food a personal priority because I'd wanted to let other things slide like saving for retirement funds, you know, a lot of the people that I work with my peers. They don't have that kind of a luxury that got families have chronic health issues. Most of the people that I work with we do this because we believe that everybody should have a home. It's like it's a personal belief that keeps us doing the stuff but a lot of us are afraid of losing our own we could easily join the ranks of the people who don't have homes. I've moved into management and I'm making more money and after taxes, it's still a struggle to afford a one-bedroom apartment in the city. Just as our cost of living continues to rise the cost of doing this work is continuing to go up from the maintenance into the repairs of our building City Utilities supplies for the people that are in it Healthcare Transportation. I have a team of 6, once again 6 case managers, they serve 162 people. Amazon improve wages for staff retention my team occasionally falls down to five people or four people and it creates a lot of challenges for the fields that we try to serve and for the staff Who Remain at Plymouth with the vast number of people without homes. We need service providers to assist them, and in order to recruit and retain our Workforce. We need our government Partners to adequately support this crucial part of our cities, and thank you. Thank you, and thank you. Thank you for highlighting the various issues where we seen inflation in cost. I think as labor Advocates we constantly think about wages on the first the front line because we know the impact that it has on retention and turn over. However the cost of going up across the boards. I want folks to think about that. That's why we're calling it an inflationary adjustment not just a wage adjustment cuz there's so much that you all have to do in order to provide the holistic service one more huge round of applause. Thank you for your leading office. Hello everyone. My name is Evelyn Korea and I have handouts. Alright, can you guys hear me? Great. Good afternoon council members. My name is Evelyn perea, and I'm the Human Resources officer at Youth Care and I feel really fortunate that I have that job that you care because I know that a lot of our providers can't afford a human resources department. We serve young people ages 12 to 24 across Kane County. As of today we have about 300 staff. We also have over 30 open positions. So thank you for the opportunity to speak about the importance of an annual inflation adjustment for Human Services agencies. I'd like to share with you several charts that capture youthcare's annual increase cause of business which anyone doing business in the city can relate to the city hasn't become more affordable for individuals or small businesses. We subsidize these increases each year get our contracts remain relatively flat. Due to time I'm not going to review each chart, but I do want to bring your attention to some of the largest increases to work. We're talking about increased costs of doing business. And if you look at the first chart that shows the cost of utilities things like water sewer service at cetera. You can see over a three-year period that we have gone from a cost of about $40,000 a year two and three years $79,000 a year and that's one of the more substantive charges it charges. It's the same thing when you look at utilities, you know, same sort of scenario. So when the Spurs chart UCR utility breakdowns, I mention $41,000 a year for water sewer services in 2018 as I mentioned that almost doubled. A bye 2018 in the second chart you can see that our facilities cause were around $67,000 in 2015 and that number more than tripled by 2018 to almost $350,000. You'll find similar Trends in the last two charts regarding our rental and insurance costs. Now some of these cost some of these increases rather are because youthcare has grown in the last 4 years that's because of the need the growing need but even if we removed the additions the increases are still dramatic we stretch our budgets to make sure we can keep the doors open and the lights on as a result. We have less money to spend on recruiting and retaining staff to provide high-quality care. Last year, I shared that you care had an annual turnover rate of 38% I remember at the time that though the rate was high. We were still one of those lower providers sadly this year. I have to report that our turnover rate is now at 44% many of the young people that we work with a youth care are in crisis our staff to an incredible job building relationships and supporting them. But this is hard work and to do it. Well, we need experienced staff who are responsive who can make referrals who can make quick decisions who know when and when not to call the police. It is nearly impossible to deliver high-quality services with constant turnover in vacant positions. And this is had a direct impact on our staff. And our young people here are several quotes from our staff. I'm chronically worried that I'm going to be single staff. Our Workers are staff gets sick they burn out I worry about what happens if there's a crisis and I don't know how to respond Another employee said I've been here for a year and a half and I am now the most senior member on my team the implications of that are terrifying. So what I'm saying is when it's work is done. Well people live when it's not people die. Also recognize the impact of these conditions on young people as you heard from Tristan having a trusted consistent staff member is key to finding stability. That staff member is a Lifeline when that Lifeline is cut short we do damage. It's a misconception that young people are homeless because they prefer to be outside, but we need to be honest about what we're inviting them into because it is legitimate for young person to wonder. What should I come inside for? If I can't have stability. Why should I rely on someone if I know they're going to leave? Young people living outside aren't there because they want to sleep under a bridge they're there because they crave they need Community providers must be able to replicate that inside. Otherwise, we are failing our youth The last thing I want to do is end on Equity 12 years ago 80% of the staff at youth care worker white. We have worked hard to live out our values of diversity equity and inclusion and I am proud to say that we are now 54% people of color and immigrants including at leadership positions. But I shudder at the fact that our staff qualify for the very services that we provide for young people. My life's work has been about access and opportunity for black brown and lgbtq identified people. That's why I work in Human Resources my Consciousness hurts to invite them to this reality that's against my own integrity and I have to think about that and that's why I'm here asking you to support an annual inflation adjustment for Human Services contracts. It's a first step and it's the very least that we can do. Thank you for your time. near me My name is contained vanaman clinical support specialist for downtown emergency service center. I work at Kernan Scott house with a special program cuz we offer 45 residency and I women shelter 25 women Knightley. Thank you for the opportunity to share my perspective on retention and turnover. Stop turn over can have a profound effect on clean engagement of stabilisation. Imagine if teachers on average stayed at 12 months student learning do the turnover would be destructive and less effective. These are the consequences we experience with staff turnover client's mental emotional stability is dependent on stable relationships with their care providers. We serve the most vulnerable population. We serve the most vulnerable population or community community those that depend on Supportive Services for adequate to adequately function between 2018 and 1980 SC housing units were heavily dependent on on-call workers and routinely understaffed. A safe ratio for Swedish Chef should be three staff 270 plus residence swing shift is a busy assisting today with the least amount of support. We are engaging residents serving dinner and distributing medication often. The shift is under staff with two or even one staff member because of Staff turnover clinical support specialist, which is what I am have to be perform. The duty of a residential counselor, which is the front desk support performing dual responsibilities mean we fell we fall behind on case management one-on-one time with our residents in Crisis Intervention, both residents and staff suffer when building when buildings when housing teams are overstretched. We need salaries that reflect the education experience. We ran into social Human Services. We need to stabilize our work for us to ensure these vital Services remain strong in our city. We need our city council representatives to make homelessness and Supportive Services a priority and funded out of Ali. Thank you. Thank you. Thank you so much for having us here. And thank you so much for considering the issue of automatic inflationary adjustments for City contracts. My name is Tara seat of Osceola. I'm the CEO of International Community Health Services. We are Community Health Center with 10 sites in King County seven of which are in Seattle provide Dental Behavioral Health pharmaceutical health education health literacy and other health services to low-income people and about 50% of our patients are at 100% of federal poverty level and another 25% of 200% of federal poverty level. Most of our patients are immigrants and refugees. We provide services in over 50 languages a year from Asia Pacific Islands East Africa Eastern Europe, and of course, Spanish speaking. Backgrounds we serve 31 close to 2:30. Mm. Actually last year those were served with over a hundred thirty-five thousand health services. So Chelsea one of two things their health conditions are not good. So they have to come in for multiple visits and two whenever we can't we try very hard to provide whole person care. In other words, if there a medical patient would encourage them to be a dental patient. We encourage them to be part of our community kitchen program so that you know, I learned better how to have healthy foods health programs. As a community health center are the services we provide are not just within our walls. We work very hard with many of the organizations represented here out in the community with Partnerships are some formal some informal because we have to address social determinants of Health. We have to make sure they're in safe neighborhoods. They have access to jobs. They have access to Great education access to Transportation. So when someone in a city that is enjoying unprecedented economic continue to have too many people fall through the cracks and too many people that we can't find and we can't serve supported care and I think it's an irony that only a few years ago. I had to visit several of you to convince you that the Affordable Care Act did not cover everyone that he'll continue to be a prior. Today I'm saying to you are uninsured care is going up again. This is because of a number of things is that the federal government has done too many things to Poison the Well, whether it's in terms of formal actions attacks against Affordable Care Act individual coverage or it's an attacking me and try to constricted so that people are no longer able to qualify against immigrants and refugees. And what does this is it prevents people from coming to see us until they're very ill and so these are drivers of costs, you know, poor health leads to higher cause we have an aging population that leads to higher health care costs. We have a Workforce that we have your face. Competition for major hospitals and private providers earning some of our folks because we are considered to be the training ground and our staffs are considered to be cream of the cream it when you're talking about people who know how to provide care in a culturally and linguistically competent way to our staff because it is so important to have that trusted relationship between the people providing the service and the people receiving the service. So it is really really very important to us that you do provide us with that inflationary adjustment. We have a lot of costs that do not cancel out plants when we talk about fee-for-service while we talk about Medicaid reimbursement. The costs are to support a whole person care a whole persons live. Our case we know don't just think of the individuals we think about the families and we think about their communities. So thank you for considering this issue. Incredible panel. Thank you for all your information for the data that you provided in the stories and questions and comments from our colleagues. And I really appreciate this taracido and especially the work you and have done with us in the last decade just in the last week. We have learned that two maybe three facilities for seniors are closing and has something to do with Medicaid. We've heard about Vashon Island. We've heard about one on Capitol Hill in another close. Can you Enlighten us on what's going on with that? And what do you see that needs to happen in the fear of putting multiple hundreds of seniors vulnerable seniors out on the street without places for them to go is about a frightening matter as anything I've heard. So can you address that? So one phrase Medicaid reimbursement sucks. There's just no two ways about it. It doesn't pay for the real cause it's so happens at one of those nursing home said it's not a senior serve Sunrise nursing home is Carol, which is in our community and we're trying very hard to work with them to find the solution because we're talking about over a hundred seniors who are going to have to find something somewhere and nursing homes across the country are closing. So it's not a unique Trend in our community. So what we need to do is to try and figure out community-based programs. We have our elders able to age in place. Starting March of this year. I say just took over assisted living adult day and congregate meal program from skip to Seattle Chinatown International District preservation development Authority. But secondly, they realize I was just not affordable to them add to a house that are like us because we are able to grow and stretch and wear a Medicaid player as lousy as your payment rate is that were able to serve them a little differently, but on top of that we started a program of all-inclusive care for the elderly, which is a Medicaid Medicare program. So it's for low-income seniors who are nursing home eligible nursing home or do not want to live there. They can stay in your home stay in the community and we provide them with the wraparound service. Not just the medical Suite of services, but also socialization transportation is important if Home Care is needed. We will provide that too and it is all based on an individual care plan, but it's needed. It's our mission. So an inflationary adjustment just really really helps us try and fill that very narrow Gap that we have in terms of what we get in terms of reimbursements. One of the things that I think is a misunderstanding is that people believe that then folks who we see living outside are coming to Seattle and we know that around 80% of the people who become homeless have lived in King County before besides that even if they are homeless and they comes home with someone else we're welcoming city. So we want to provide those services that are proud of the services that are human service provider contracts offer. I've regardless of where people come but can you talk a little bit about some of the situations in which you've seen folks who've been in this area in King County in Seattle and the consequences that have led them there. Can you talk a little bit about any of the anecdotes at you here in terms of the cost of housing that has really created some of the situations that many of your clients have seen Okay, so I guess I've been looking for about 10 years at this point and I've left work in a number of the different properties that they have until I've talked to lots of different people do all the different economic strata except for obviously like the 1 percentile that you could possibly meet. And so I've I've talked to people who are living in one of our senior living facilities who traveled all across the entire world suddenly like develop the brain tumor found that I'm spending all of like their money and like the money they change up for retirement put them onto the streets and with this chronic illness. They were never able to get their feet again until they were able to connect with somebody's got them into Plymouth Housing and it's a lot of stories that function in that particular way. We're like people go from having like a nice like middle class and lower middle-class life to get sick and then suddenly there on the streets. Thank you. I can speak to that as well. And so I mentioned that we have about 300 employees and one of my responsibilities is employee relations, which is where a lot of the coaching and in those kinds of conversations happen and I know from talking to staff and it's usually very confidential conversations, of course that they will share with me that they are in Peril because perhaps when they came to us and got the job they've been unemployed for let's say eight or nine months that put them in the hole as we say, right and so now you've got a job, but you are way behind the 8-ball in terms of what you owe your landlord in terms of perhaps what you owe other lenders Oro family members and so you're working from a race that essentially got started the whistle was blown long before you got to the front of that line. And so I hear the stories all the time we talked about what kind of internal support we might be able to to provide but we recognize that we don't Have the funds to pay the wages that we want let alone to try to figure out how to close some of those gaps when stop themselves are vulnerable, but we recognize it as a huge problem. Also like to weigh a force of all I want to say that our city contracts are for City residents. So we have to provide zip codes and and we're very careful about that to make sure of that but I also will say that yes the cost of housing the cost of living in the city has really affected notches are patients clients, but also our staff. However, we do you see patients who are traveling or choosing to travel be stuck in traffic or take public transportation to come see us and a lot of that is because of the kind of care and Staffing that we have the culture and language is very very important. They trust us they feel safe with us. It's so apparent that you all do this work because you're passionate about it. I haven't heard anyone say I got into this business because I'm really looking to make a provide Financial stability for myself and we laugh about that. You're all in positions where you're you're mentoring you're managing your supervising your recruiting people to this field. And this is the most important work that we need to get done as a society right now. And the only way that I see it happening is for the generosity and kindness of individuals like yourselves in the folks recruiting and the sacrifices people have to make to be in this business or economics in our community or just upside-down. We need to be saying that we need some of the best people in the world to be coming in working in this field and we're going to treat you fairly inappropriately. So you don't have to make the personal sacrifices and we failed to do that today. I'm grateful that despite that you all have stuck around so long I can only imagine the pain when you have you have people up underneath you who you may even be advising that they should take a different job because that's the best for them. You know that that means the organization in the work will suffer but it's what you have to do is a human being and we as a society and was a city have to do a better job. So that that's not a dilemme after face and make your job a little bit easier. I would like to add that we have staffs who choose to stay with us, but work part-time and then part-time in the hospital so they can get the better pay the better benefits. They're making that sacrifice because they are committed to the community to committed to the patients and Families. Multiple jobs, for such a pretty please. Just want to say thank you to her for all the work. She did this together. Sing No More comments. I just want to say thank you to this panel to the other two panels that have come before. This is the continuation not the beginning cuz it's work has been going on for a while. Thank you to both of you and come to my Brian for unveiling and continuing to bring up the issue around historic underfunding. This is though the beginning of our efforts in 2019 to make sure that we'll be able to move forward a commitment to addressing them play sherry increases that you all need this year and going forward. We will have legislation for folks to take a look at starting next week. We do you also have public comment that we want to get to you. And before that how would y'all feel about a big picture if we came out there and you all stood up and we took a picture from over here for the Santa one more time. Just in case you didn't hear. Let's give it up for this panel one more time. Thank you. 3 and hold it. and one more Alright, thank God. Text help us out with trying to keep the volume down so that we can hear the folks who came to publicly testify to do is hear from kcj work. Casey you're a tall guy. You said when there and then then you will stand up straight. . You are as one of our first president. Count the numbers. Thank you so much for your work on this. My name is Casey J work I M A. I work with formerly houseless people at dese. I help them stay housed in private Apartments. These are my colleagues. I'm here to ask you to support. I'm here to ask you to support the built-in adjustment for inflation. This just seems invitation to being the just and fair thing to do for our clients and for us. It's also seems like responsible governance and financially responsible. When you under investing they cost more in the long run when you pay the price tag up front, then you don't have to pay more later on. So please support this. Thank you. on metal color by Heather Fitzpatrick Hi, John. Get real close to the tall microphone maintenance coordinator for downtown Seattle area call Les. Paul. Rosenthal said we've got thousands of tenants. We got nine maintenance text at best on a good day between thousand two tenants multiple things going wrong. We have janitorial support inside of buildings, but when we're getting multiple work or tens dozens hundreds, you know by the week put in things are going wrong and then sometimes people getting pulled off of things. It creates a great work for people that are trying to provide for the people that were trying not to fall into the same situation as you know, we're not unlike the people that were trying to service lot of us are just a paycheck away from being in that same situation, you know, whether it's a flood or fire things going wrong, then we have to pull people off and now works till stacking up. Everybody has needs you know, so I definitely support this adjustment. I would I'm pleading for it. You know what I mean? I'm in Seattle trying to get housing, you know from my myself. I can't even afford to live in the neighborhood that I grew up in because things are how they are. I get pushed out stuff and then further back just cuz the house You know, we need this not just for ourselves. But so that we can support the people that we're here to help. You know, some people are working double job. Some people are commuting just to park and ride so they can catch public transportation to get into work until we work 40 hours a week and then we still get home and we have to prepare to come back in for the next day. So this is the type of thing where if we want to have service with a smile and we want to provide people so that they're happy. We need to be happy and we need to be comfortable in and of ourselves and do that work before going to need adjustment. Menards I thank you for your time today. And for your concern about Seattle's Seattle's Human Service organizations in the inflation adjustment family services are agencies working to prevent and end family homelessness. You did a great job of recapping a lot of the challenges just in your in your introduction and I'd like to reinforce three points that you and many of my colleagues on the panels already made first. The demand for our services is growing and so are operating expenses. We are losing second knowledgeable experience compassionate staff because we must choose between compensation benefits and service capacity of our staff are close to homelessness and shelves. Finally that turnover has an impact on our ability to help families. You heard the story of Justin and Joey's care and impacts at trust and relationship have on services that the trust-building it takes time. Inconsistency handing off clients destroys trust delays services and causes additional trauma which in turn requires additional Services shortchanging compensation, and that's most of our budget as it is for most Human Service organizations is Penny wise, but pound foolish. Please give us better choices. Thank you. Thank you. Monopoly by government Mama's Alliance ourselves by serving refugees and immigrants from appraisal to Golden Age. We have about 250 in 10 different areas of the county or facing the same issues. The rest of my colleagues there representing today and talking about that. We are I wanted you to consider that people were working as Human Service organizations also professionals with reason lives that they need to support and we're not able to continue to to to retain them because they also need to leave people come and work for organizations because of their passion because of the really sold on the mission and they want to work the communities. At their supporting for the communities that they are supporting, but I see the trend that they're also leaving the industry because they cannot afford to stay on and we are seeing a lot of our wonderful staff leaving not because they don't want to do the work, but because they have to because I have to live so I I want to thank you for supporting this inflation adjustment, and I would like to urge you to continue to do so, thank you. Thank you so much. Hi, I'm Leah with the Housing Development Consortium many of our members are service providers with dedicated compassionate Frontline staff who work day in and day out by the care and support needed for people to reach their full potential and be seen with their fall dignity Frontline staff are working with people transitioning out of homelessness, Adelina overcome drug and alcohol addiction people living so far in the margins that without the hard work of Human Services. They be off the grid entirely yet in the city blue me with economic growth and opportunity. We don't adjust the wages of these vital workers to match inflation. Their wages are stagnant as rents rise in the cost of living. Is it for city council is committed to creating systemic empathy where all people are valued and provided the tools to forge their own opportunities. We need to Value are human services staff who are the foot soldiers doing is hard work. If we are committed to the goal of the Seattle that works for everyone then we need to support the workers that make up the backbone of Seattle's commitment to compassion. I asked you to commit yourself to creating a lasting solution to this yearly problem and to Value the workers who sustained the communities in programs. We all invested in all benefit from thank you for your leadership. And thank you everyone in the room. Who does this work? DeGraff followed by Patricia and Scott Teresa so, sorry. Hi welcome. My name is Natalie Dreyfuss much like clintonia on the third panel. I'm a clinical support specialist at dscc Corners house. I've had the amazing Good Fortune to have been able to work at the same project in various positions for the past two and a half years and I've been able to develop really strong rapport with many of our clients which means that I can serve them better because they trust me. I've also seen our project at times when we had almost no full-time staff and relied almost entirely on on calls to are amazing and necessary but not stable. So this destabilization of The destabilization of our staff really impacts our clients. They don't have consistent rule enforcement. They don't have consistent access to the resources. We need to provide them and they deserve better than that. They deserve stability and I've heard many of them expressed to me that when is staff member that they've developed a rapport with who they trust leaves. It. It really throws every throws a wrench into everything for them because, you know, they've been through a lot and they're amazing resilient people, but they really need and deserve stability, and that means we need to be paying a rick a sustainable wage. That means that we can keep staff on for long enough to form those relationships. Thank you. Patricia Okay, let's all go to Ileana. Sorry about the messy handwriting. Eliana's got thrown in the neighborhood Action Coalition and the chair the ozello village community advisory committee here today, of course to support an annual inflation rate adjustment for Human Service contractors, but it was obvious from the powerful testimony today. And that's only a very small First Step as we heard and I've seen on the front lines the quality of services provided depends on this front line staff. And right now we is a city or failing to support these key providers and the agency's they're working for with living wages decent training and reasonable caseloads. It's a shocking moral failure that as the crisis keeps hitting swerfs and as the stresses we ever have your unease agencies that we're expecting them every year to do more with less. We need to be investing at the scale of the crisis to some Daniel Allison has been saying for years and that starts with getting basic sensible process. He's running here. We shouldn't be coming back here arguing about how people need to be getting a living wage. And we need to increase again this year. It shouldn't be every budget season having to make the same flea and I've been organizing for most of my life. I've learned most from being the mother of seven children how you have to be reasonable and how you expand your resources and your energy and your time and that starts with setting up good process. If you don't have to put all the energy into making the same decisions over and over again, this is just basic common sense, but once we do that, we need to be getting sustainable for aggressive Newton come in here so that we can actually solve the problems. Thank you. Jason Austin followed by Katie Wilson then David Headley Fargo followed by Margaret Richard. Hi there Jason. Okay, I'm sorry. I see your name. That's that's enough. I see you we will get you on Jason Austin. Go ahead. My name is Jason. I'm a housing case manager with Catholic community services over for a state-funded program. I want to repeat the refrain that the gentleman earlier said about three years. I've been in my current position with ccs for three years and with the exception of my program supervisor. I'm the most senior person who works for my program. You know my phone to call workers left for a number of reasons. I went back to school to pursue careers in education or Healthcare some of them took jobs in the private sector, but what they told me as to why they left was the exact same thing. I can picture myself doing this for the rest of my career. that's a shame that is a shame that is a failure of our community Seattle is globally recognized as a mecca for people with skills and Technology because people can build lives and careers doing that work here and if we want to live in a community where everyone is care for and housed appropriately and healthily we need to make these jobs careers that people can build there are at least two I seen at least two former clients of the program that I work for here today standing shoulder-to-shoulder with me as my co-workers at CCS. I've been privileged to be a part of their process and I want to see them build lives in this community doing this work. They bring their lived experience and their passion to this and if they had to leave and find other work cuz they couldn't afford to continue to do this that would break my heart. So please think about this being a city that is for all of us. Thank you. Thank you. Katie Wilson welcome High Council Members, my name is Katie Wilson, and I'm here representing the transit Riders Union. I just wanted to express our strong support for this initiative super important the folks who work Human Service Providers in Seattle do some of the hardest work. That's my most important work in our city and we need to start paying them like it deserves not just a living wages and inflation adjustments but adjustments the way to get sharp Transit passes just like people who work for the city of Seattle King County. And so we hope he'll work with us to make that happen as well. That's something that. If it's not only workers, but it benefits all of us because it incentivizes public transit make sure that were meeting our climate goals and getting people out of cars. Thank you. Next sorry, I could not read your handwriting followed by David and then Marguerite. Yes, I'm on but Michael fullest like yours. I've been fighting for a homeless is for some years not right Sally Bradshaw many years has 219 August 25th, 2019 in 400 years. When is the war on America? That's a conflict South Bradshaw that is a conflict for people of color travel on the breathing tube. And when Bill Clinton was in office, but now I am in Italian. and then Paradise PD 330 February 2015 You wasn't talkin about my day in the United States in 92 George HW Bush. Thank you your honor ball. We got to keep moving. There's two more people signed up to testify. The next person is David followed by a Marguerite. Sir, 1789-1797. That's good. Thank you so much. So you David has David welcome updated and followed by Marguerite. I just want to protest the fact that I got put second to the back. I know I saw that way before that and you know, I would like to know how many people on the speaking list are fixing to get paid off the Levi the city council going to prove status quo in front of all this money while never holding them accountable for egregious subhuman Bankers hours efforts. It's appalling a multitude of panelist and most of the speakers and everyone just recently in the chamber's wants raises for all the social service providers. This is more proof. We need an investigation on the six-figure salaries hiring unqualified being overseen by do nothing government force and taxpayers to pay twice once to the government and at whose Contracting with politically-connected nonprofits feeding data during Baker's hours while acting like a political extension for re-election of politicians overseeing their contracts on a side note to California chronic homeless. Is Gallatin Medicaid and I like to say criminals getting intimate and paid helping the most vulnerable is more proof liberal policies implode city council is going to have to be better with the allocation of funds for housing and petitioning Noble first-world 21st century Advanced housing developer who's qualified to build a proper homes, a lot of the government oversight on non-profit to continue to cheat the taxpayers and the homeless innocent sober drug free. I've been given a pass on their races discriminations you seem wraparound service in Seattle is dying video get lots of money to skin while they continue to lie about their half-ass effort, excuse my French but Seattle Times should investigate the six-figure salaries hiring operatives to do the bidding of counsel for re-election at the expense of integrity and forthright diligent honest efforts to solve the oppression. Youth Care Executives used to work at King County community and hold us this same executive change the name to all home. Com watch realized was a bogus entity. He jumped behind youthcare criminals unqualified. The next person that we have is Margaret Richard and David. I understand why it looks like you signed up earlier. We did have two sheets who are at the top of that second cheap. Thanks so much for being here. And if there's anybody else that would like to testify please go ahead and line up. Thanks for being here. Yes, I'm good day everyone. I brought my little sis get out. And this is what I was told to do by Tenille stefanescu. The last time I was trespassed from here, so I'm delivering this to him. He can get out, you know for telling me what to do and that's that's very important. Cuz these people here today they were exercising their free speech. And so when you speak on homelessness, I think it's a crying shame that all these people come up in here saying that they're doing things to eradicate it but yet and still is increasing. So I don't know if it's the elephant in the room the giraffe the Is it a black leopard a tiger a monkey? What is it? What is the problem and I'm concerned about that because there's a lot of people saying that they're advocating for this adjustment so that we won't have to go through what we are going through and we won't have to see all the trash in the litter and stuff on the streets anymore. So I've written you you didn't write back. You didn't you eat. What is this? These people call them self representing us and they don't even communicate with us unless I don't know if you like Jay-Z that just tipped over the Richter Scale being a billionaire and I see you looking at me. Because a lot of these people they don't have the kind of finances if they did maybe they wouldn't be homeless and then sometimes when you throw him out on the street for no reason at all, and they have to go get a lawyer that they cannot afford. So this is just beyond my comprehension right now with this because like he was saying about the 10-year plan a we live through that too and we still didn't see a change. I will come to the Allison. Thank you very much calcium of a musket. I thought I would ask everybody who still here who has been part of this adjust for inflation campaign to come up and join me because this really is a wonderful opportunity. I think you council members must get in bad shape for staying and for hosting and making it possible for us to talk with you about Why we do the work why this work matters and why in partnership with all of us the city needs to step up and make the investment in the infrastructure of Human Services. We hear a lot about roads and bridges about seawalls about bike lanes and the people who filled this room and the buildings most of them crumbling that they work in every day and every night are the infrastructure of what supports folks in all parts of Seattle. I myself started out as a children's advocate for kids experiencing homelessness in New York City. And so for 30 years, I've had the experience of people saying, oh, thank you so much for what you do and essentially implying that you know, this is something that people do out of the goodness of their hearts. These people are workers. These people are doing the most vital work there is and the infrastructure Investments that the city has made historically are the infrastructure Investments that we're asking you to protect by creating a long-standing solution to the need to just adjust for inflation as you both know very well and as we all will attest to that's only the first step in correcting really Decades of disinvestment in this infrastructure. We don't want it to crumble we want our community to thrive and we've seen and heard today some of the most extraordinary example of how individual people thrive and how that than bolsters our whole community. So I think you both and your colleagues on the council members are Brian and want to hear here earlier. I hope all the council members listen to and watch this entire afternoon because it inspired me and I hope that it inspires you to take this modest Next Step. We can all get on to some of the bigger work as you said councilmember Bagshaw you need to do more with more. Thank you much more. Thank you so much. Seeing no one else signed up to testify I want to just thank our Council colleagues for being here for everybody who testified for the incredible panel for the turnout today standing room. Only are we do have two more opportunities to talk about this on Thursday, July 3rd, June 13th. That's next week at 9:30. We'll have some legislation for y'all to consider that's really exciting and then bring it back at the following meeting which will be July 11th. Given the holiday break for us to potentially consider moving forward with an inflationary adjustment that we can put into a statue to conquer ties our commitment to this again. Thanks to everybody councilmember. I I want to ask in the suit comes back to my role as the cranky Finance chair. Do we have the 10-year look-back on how much money we've spent and how much money going forward this will take not to throw cold water on any of this. We know we need it. But I also want to acknowledge that that from what I'm hearing. We're not going to have that bow wave that's going forward. So I want to make sure that we are all being I want to say realistic because that's nasty but what it's going to take for us to do what people are requesting here. That's right. I think there's two item that we've been discussing the historic on deficit that I think we've heard has affected so many of our human service provider organization and the need for an inflationary adjustment going forward. So what the legislation will consider was an Indulgence is just the ladder the inflationary adjustment going forward recognizing we got a lot of work to do to make up for her the historic under fun, but that should help address the bow wave issue as the chair of Finance. I know that's a big deal for you and getting that first step in place was a 2% across-the-board. This will be a more accurate reflection of the actual cost of living go up. Forward on which we think will at least help stabilize for now as we work on parody and equity in the future. So I'm with that. Please look for the legislation to be online as of this Friday and I'll give folks a full week to take a look at it and feel free to come back and testify on Thursday next week and one more adjust note of appreciation for all you do and for everyone being here a little bit extra today, and we know that's what you do every day provide a little extra with less. So let's do more with a lot more. Okay. Great. Thanks, everyone.", "end_time": 6454.0}]}