{"format": "raw", "annotations": [], "confidence": 0.9491770267486572, "data": [{"start_time": 0, "text": "Good afternoon, everyone and welcome to the Mets first edition of the Civic development public assets and Native communities committee. The time is 2 p.m. Thank you very much. Councilmember Gonzalez for joining us. I'm councilmember Sally Bagshaw vice-chair this committee and I want to extend my condolences to council member War has who is home ill today? Let her know that I'm pinch-hitting for her and that we will do our best to move forward with this committee meeting as she had planned. So thanks to all of you for being here today. There are only two items on the agenda. But both are important ones. The first is to consider the appointment of Jesus Aguirre as the superintendent of the Department of Parks and Recreation, and we also have an ordinance regarding the South Park Playfield agreement. So first on our agenda is public comment and we have three people signed up Marguerite Richard is first Cesar Roman and William Lowe. Each of you will have two minutes and it since we only have two items on the agenda. As I said superintendent to be Jesus of Gary and the South Park Campus play field area. If you will confine your comments to those two agenda items, we would appreciate that. So two minutes, please and Margaret Richard frequent person here and we going to talk Logistics today because I'm very much concerned about my human rights in my civil rights. I don't know who else to dress if it's going on in this building and it's happening to me. Then I have a right up under the law to address you. So today you don't Christmas Gonzales is there and the community police commission is one of her babies. I was insulted by not assaulted but insulted by these guards that work here and Rita can confirm it that I was never in the meeting today if I wasn't. I don't know. What I wanted. I was what I want you to do is to please stay on the agenda Miss Richard. We have two security officers here if you'd if you'd I think you owe. Wait a moment. May I please ask her to be escorted? We do not accept threats here. Miss Richard you're done. Would you please would you please cut off the I'm sure you will be that's fine, please Discord her. I've asked I've asked you please to stay with the agenda. If you better believe I will and Cesar Roman you have police escort her out. Thank you. I clarify for the record that I support your decision and requesting and declaring that has Richard was not following their Council rules and needed to be removed from chambers. I also want to acknowledge that I agree with your assessment that the public has a guy who just spoke actually was not exercising her freedom of speech but instead subjecting us as members of this committee to threats of violence and we have just recently experienced that three weeks ago from her a friend. Mr. Zimmerman, and I just want to acknowledge that it is behavior that we should not accept and tolerate is threats. There's a difference between threats and there's a difference between threats and and freedom of speech we respect freedom of speech but we cannot tolerate is public elected officials or as a community or as residents of this great country are threats. Set unfortunately we see a public official subjected to threats many times. And unfortunately, we see people following through on those threats and we have to send a clear message instead of standard of expectations that we will not tolerate verbal threats that could incite violence or or turn into violence. I just want to thank you as the presiding chair today for for your actions. I appreciate that very much and thank you for standing up and being consistent. Okay, you are up and then William low and I'm very sorry that members of the public had to sit through that. Hai-hai city council. Thank you for allowing me to speak today in regards to the development of the south parking me Center. I also want to thank SAS for contributing for million-dollar donation to bring improvements to the neighborhood. Maybe they can consider donating to South Shore Plaza as well get big donations or this week. As a resident of South Park for the last four years. I've gotten to know many of my neighbors and families that live in the area and it holds a really special place in my heart. However with all that time I spent in the neighborhood. I have to quit I often question who is meant to benefit from all the improvements coming to the neighborhood. Now these decisions being made with genetically in mind just a little project that are happy neighborhood outside Citywide Thomas Waterway Park Homes owns Coverdale on 8th Street improvements Dothan Al Grove South Park, South Park Plaza station and Park Elementary School Concord International along with 17 other Seattle Public Schools will be receiving budget cuts to their oil departments next year, which will significantly lower body basic education the city and private education institutions are able to allocate millions of dollars towards Park improvements. As I know they were only take $2000000 to maintain audio out positions throughout the whole city for next year. Why are these improvements are great? I want the city council to really think about the message. We are sending to Youth and families from South Park. It feels a little unsettling that we have to watch her private school coming to our neighborhood and take over the field old public school and neighborhood resources are receiving Cuts or I tremendously underfunded. Thank you. Look forward to seeing you then. Thank you for coming and I really appreciate your sticking with the agenda and being so clear about your opinion mister. Love. Welcome to City Hall. Good afternoon. Good afternoon. My name is William Lowe. I am a Parks commissioner in this city who happens to be the chair at the present time. I come to speak on behalf of Jesus Gary and it is a wonderful re addition to having a superintendent did not leave this city. I go back home and support family found that there was a avoid when time permitted and reapply for the job and did not ask for any special treatment, but will let his record as we have seen stand in his stead. We're excited. We're excited because here is someone who set the bar high is not afraid to come back and we're going to set the bar even higher. I realize that only have a minute and about five seconds left to speak but I have probably a full day as a law. Times citizen of the shed this great City to speak about him not only has he demonstrated competent leadership. I love his enthusiasm and as I was leaving my building today and let the other residents know that I was going to come here and speak on his behalf. They wanted to the council to know they wanted the city to know they were very pleased with the way our parts. Look they're excited about the future and they asked me to do two things one was if the opportunity availed itself look for a few more dollars, but I'll save that for another time, but certainly give and he plenty of Praise on the direction that we are taking individually. I'm extremely excited because of the position that I sit in it is always wonderful to have someone who is not afraid to lead by example I come here and I speak on his behalf, and I thank you for the opportunity to to do that. Good afternoon. I really appreciate all the good work that you're doing and extend my thanks to your neighbors as well. Okay? Well, we will move on to the next item of our agenda. Thank you very much for being here. Would you like to read this in the game? And also I want to recognize the game from council member. Where is his office and Lena Tebow from my office? Thank you both for being here. Thank you cast member back show first item on the agenda apartment apartment appointment 01306 appointment of Jesus as accurate as superintendent Department of Parks and Recreation for a term to April 1st 2023 Power Team. And welcome to both of you, and I also want to acknowledge all the people who are here from Parks. Thank you for your great service Christopher Williams having the pleasure of working with you in one capacity or another for the last 10 years. So thank you for being here as well and for holding down the fort. Okay, so we really don't need to have introductions to those of us at the table, but for the record mystery Gary Deputy Mayor mostly if you just please introduce yourselves shirt, give me or would you like to thank you cancel number. Show in Gonzales happy to be here today to reintroduce person who really needs no introduction to this Council of Jesus and Mary before I do that though. I can't smile without you. I wanted to take a moment to personal privilege to thank you for Lending your staff person made it to go to hours. Chris's as we consider our next appointment or nomination to go forward as we were interviewing people yesterday and the day before the department of human resources and appreciated her support and input into that process. Thank you. I'm glad I'm sure it was a great opportunity for her personally, but also for you to have her on the committee. Exactly exactly. It was four months ago that Jesus has contacted me and indicated that while he was enjoying his work with his family business that he was missing the work of public service and missing work of parks department and he indicated that while he's been on this I'm going to call it a sabbatical on this sabbatical. He had maintained the number of relationships with the national parks organization since I've continued his passion for public service. Public parks and recreation and asked if they would be any interest and the mayor's office staff are in the mirror. If he were to reapply as we were starting the process of of the applications and we had a wonderful conversation. I asked him getting in a while. If you want to come back at some of the I'm sure some of the questions you're going to be asked him today and I'll let him speak for himself but towards the end we did reopen the the the process and he did apply. We had over a hundred people that applied for the position. We selected five people to interview and then we actually only interview 3 because a couple pulled out tour at the very end, but Jesus came up from the search committee as the one that was really he and another person were recommended to be interviewed by the mayor the mayor interviewed both people. Is nominating for your consideration today? He's agreed to be the superintendent of Seattle Parks and Recreation. Thank you very much appreciate that and appreciate the fact that you did a formal process and that you are allowing us to be involved along the way. Thank you. I've got some outside like to read and then I'd be happy to answer any questions you might have as I begin. I have to want to thank William Lowe it for his service on the Park Board in the rest of the Parks born oversight committee and all the committee members who on a daily basis give us lots and lots of feedback and support on the work that we do it to the park and recreation. How's the one I recognized the folks in the back that the majority of the leadership team for Seattle Parks and Recreation is behind me. And I want to thank them and their teams for all of the work that they do each and every day and it finally special note of gratitude to Christopher Williams who who really has been steadfast in his leadership of this department for many years and it's an honor. Be able to be considered to join him again and be a part of the team and I will say that that a big part of whatever negotiation I may have had with the Marin others about coming back with making sure the Christopher Williams was going to stick around cuz that's important part of the work that I want to do. So as I said, I got some comments and then and then I'm happy to answer any questions but it is an honor to be here today against senior support for my nomination to again be the superintendent Seattle Parks and Recreation and it's especially honored to have the second time. So as you consider my my appointment like to just briefly address some of these issues that may come into mind including the logical questions of why I left the position and NY I'd like to return as well as thoughts on how I will approach the work instead of Parks and Recreation to ensure that we continue to support all of our communities all of our leaders including all of you at it as well as all the residents as we work to make Seattle like great City for all surprised. Prior to my arrival here in in Seattle in 2015 the book of my my work with an education. I have the opportunity to serve an education to teacher a school principal of school district administrator as well as a serving of the state superintendent of education for the District of Columbia when I transition from education in the Park and Recreation, I had the privilege of serving as the Director of the District of Columbia Department of Parks and Recreation as well as I do believe that I've got the background and experiences to again leave Jenna Parks and Recreation as you know, I served in this role from June of 2015 to January of 2018 and I'm really proud of the great work that that I am the rest of the team together did during my tenure as to the reason for my departure to pretty simple after about 20 years of Publix at 28 years of Public Service said, I made a private decision personal decision to take a break from public service and join my family's steel manufacturing and construction business. I decided to join my five siblings to support their effort in honoring the Legacy. My parents established when they when they founded the business about 40 years ago. This business is one that I literally grew up in working after school on weekends and during the summer since I was in elementary school and one of my siblings are very ably led to great success. I quickly found I simply missed the work of Public Service. I miss being part of the work that being part of the work to make the city that I live in a great City for all of its residents. So I sit here before you today asking to return to service on behalf of the residents of Seattle in the city of Seattle. We did a lot of work to continue to improve on the great work of of an organization like set of Parks and Recreation and those Rapid City to establish ways to get to just become engaged and ongoing discourse with our communities to make sure that we're actually serving them and meeting their needs we worked at to open our minds and and committed. The new ideas learning from experts and stakeholders including all the that they're very knowledgeable internal stakeholders the great employees instead of Parks and Recreation as we stopped Implement best practices and strategies to work to add responsibly manages the resources that we were infested with and operate with an understanding that we had to do a better job of serving or under historically underserved presidents still working side-by-side with these are the accomplishments that we have the time but still we've got much work to do our city continues to grow and change and I read of residents are experiencing many consequences of that growth. So if given the opportunity to serve again as a superintendent at this agency, my focus is going to continue to be to ensuring that we serve every resident through our work and working to its continued collaboration with all of our Community Partners in our sister agencies one key aspect of this workout is an initiative. Are we launching now in the coming weeks to determine the Strategic direction of the department over the next 10 to 12 years to process is ultimately going to lead yields. He's me a plan for how we invest Oliver. All residents who are programs in and ultimately to the facilities and Open Spaces that we provide. So this strategic plan will reflect much of the great planning that has already been done including all of the work behind a 2014 legacy plan which led to the park district creation as well as our parks and Open Spaces plan. And in the many other studies and plans that we do that we've done in recent years for a specific program some silly things like our community center strategic plan our office areas might as well. So there's a lot of money that's already happened. However, this plane is also going to be driven by the fact that she has been done and continues to change dramatically. So the girl that are cities experienced is created great opportunity, but also great challenges and to the planning process will help us determine how we support our residents as our city addresses issues of affordability accessibility livability as well as a very real issue of climate change. It says we do this we're going to work to ensure that this process and the resulting plan reflect reflect our values and what's important our community specifically as we work through this process. I want to make sure that we have shared values framework that was some of the following the first and foremost we want to recognize that our work is fundamentally about people we create and Implement programs and ultimately then acquire build and maintain great spaces and Facilities that will serve the needs of our next War apps that committed to equity to our plan must be focused on raising social justice as we plan in the way we create programs in and how we build and make her open spaces and Facilities accessible to everyone be open to it to new way of doing things the challenges that are sitting in a resident's face or noon. So we have to be open to the idea that the strategies that we use to help meet. Those needs also need to be different and it can't be the one that would necessarily use the past a plaintiff have to be sustainable and flexible to the city that we are but also open to the to the fact that we're becoming a different city to will honor the history of our city, but we also must look towards Future at Seattle grows, when was play a role in ensuring that we do so in a way that is inclusive an affordable Innovative inaccessible. So we know that these issues such as demographic shifts increasing affordability Gap as well as issues such as homelessness will continue to challenge us and we must work to be a part of the concept of a comprehensive Citywide solution and finally are planning is going to be driven by the idea that that poor people's not a one-time thing. So as we move forward, we must engage in an ongoing discourse with our communities in ways that successful and meaningful to them to ensure that we can continue to be responsive to the constant change it with this going to continue their practice. All of course such a process in the plane can't be successful without the voices of our residents as well. Then put from the dozens of great Community Partners that support our work my gagement Clannad plan and then put the local Regional National Partnerships as well as through an analysis of best practices and Trends within our industry another key aspect of this plan in our success. Racing team are strategic plan will include input from our team ensure that we continued growth of Parks and Recreation can only be successful. If our employees are successful during the further. We launched efforts around inclusive decision-making to ensure that the expertise and experience of the individual actually implemented work with included and decisions at all levels. This commitment will continue and I will work to ensure they're all managers are held accountable for supporting and tracking the growth and development of all of our team members as I post a possibility of engaging in this work a second time. I'm thrilled by the potential that our team in our city possesses as we work together to confront the challenges and opportunities facing this great city of the best parks and recreation sis systems in the country and that was no accident Taylor Parks and Recreations enjoyed generations of support and commitment from our elected leaders are residents are chameleons. Highly dedicated employees discontinue support will ensure our continued success. So I want to thank you again for the opportunity and I look forward to working with you and answering any questions you might have. I'm about to list of questions from both my office but also a couple of other offices it was going to be too to ask why you wanted to come back and you talked a little bit about that and I appreciate you sharing with us that your interest really in return from as a w mirror set of your sabbatical away from us is cuz you want to return to public service and get a better understanding of what that means to you and answered a few know what it what are the motivating factors that are that are contributing to your desire to return the public service. I think it really just boils down to two what motivates me and gets me excited to get up in the morning. I mean, I think working even though it's with my family and I very much care about their success in the for-profit world just just wasn't what gets me excited in the morning. You know, I I I feel more than fine without me. I just feel like I've been really lucky charms of the experiences and the supports that I've had in and much of it is really do FAFSA due to the great work by family, but also to the to the public entities that have supported me whether it's you know, the schooling that I received and and and and also sort of that that the Parks and Recreation type of activity that really support a lot of our young people in our cities that that they're outside of school and I think that's such an important thing and I frankly just really enjoy being engaged in in the work of City government, I think I think the city's really are the solution to me the challenges that we have and I want to be a part of that. I think you left in January of 2018. And since then I think it's fair to say that at the city we end this is true across the country is we have seen a great amount of of organizing and mobilization by Municipal Employees and other employees a large part fueled by the me-too movement and other types of movements that really are demanding that we as employers take their concerns around a hostile work environment and harassment whether it's based on race or sex or another protected category that we that we exemplify the best standards in the industry particularly as public agencies. And I'm and I feel like that insurgents is really happens in the. Of time since you have been away and I we have seen the work of the silence Breakers here at the city the change team at the human services department. There are just I think there's a lot of interest amongst rank-and-file employees at the city of Seattle to really challenge us as elected leaders and as Leaders of agencies to take those concerns and seriously and approach it with less of a liability litigation HR perspective and more of like, how do we really transform a culture to ensure that employees feel like they're working in a safe non-toxic environment? And how are we going to hold ourselves accountable when when we fall short of the expectations in the standards we set so maybe you can talk a little bit about how you would approach that work in that evolving. Back within our own Workforce of which Parks and Recreation is not exempt. Do you know how would you coming back into the public sector structure your management style and your interaction with all levels of employees at parks and rec to make sure that they feel that they've been heard in that their issues are addressed. I think that the the the main approaches been that I am in the middle of it now, is it just working really hard to get to listen to create opportunities to take care of him employees their work in particular about the controller might have and I think it's oh so that's sort of generally the approach and then making sure that that in response to those things and response of the things that I had that I've been hearing that I may continue to cure. I think there's several sort of ways to take to create the kind of culture that you're talking about in terms of making sure that everybody feels absolute respected in and it feels like we are we are Sing to him responding and working actually actively working to make sure that they were they they are part of an effort that that allow them to do their work in support of that is is awareness and understanding by Folks at all levels of the organization about what these issues are. I think what has happened in in recent years is very powerful than a lot of it is people are learning and and look learning to to name things learning to to sort of vocabulary. There just hasn't been in the public. Not that it hasn't been happening but understanding what the issues are understanding that that everything we say or do has an impact good batter or something. So a lot of awareness and training and understanding of what what where what are actions mean I think then then also some some very specific training and accountability measures placed on the part of our managers in our leaders to make sure that that were on one and not not certainly not doing anything that that's abusive or or hurtful. Or or a creating an environment support people are uncomfortable. But just as importantly making sure that folks feel like they're part of the work that we're doing. So not telling someone you have to do is cuz I say so but understand this the mission visions of War trying to do how do we make sure that people feel included and then and then I guess the last piece is making sure that we have structures both to receive and act on any concerns that are that are made to any of us at any level of organization and and then then also making sure that we have structures in place to hold people accountable. So, you know when I meet with my my direct reports having those conversations about what they're doing both on the the building they're wearing us both for themselves and for the managers, but also what they're doing in terms of responding to any specific issues that come up and in the cases were employees don't feel comfortable going directly to their managers are the managers managers. They could certainly always come to me to Christopher is the Deputy as well as folks in our HR team and I know that the team Over the last year has done a lot of great work around all of those issues that I just mentioned and cream the structures to make sure people feel like they have a place to go to to accommodate these these evolving dynamics that I would agree with you are extremely powerful and really important for us to do again hold ourselves to a higher set of standards in terms of how we what spaces were creating for our employees to do some of the hard part is work around public service is becoming harder and harder these days and more and more subject to public scrutiny and it's become incredibly toxic for a lot of folks and and we obviously want to keep the best of the best at the city of I think that requires us to to really work diligently every single day to ensure that that we are addressing. Toxic environment is over their environments whether they're like being created by others within the same agency or where it's coming from an external sources such an important thing for us to keep an eye on the other thing that we need to do is look at the data. I think sometimes we assume things are great for me as soon so I can point to look at our example or hrd Tardis plenty of day to see if there's any kind of disappeared. We're up. So I think making sure that we have those structures in place of his systems in place are important as I'm sure you heard one of the public pacifiers SSI who's still here. I'm talk about South Park in particular and that you and I had an opportunity to meet earlier today where you spend some time talking about equity and how that how that applies to the work that you want Parks and Recreation to do as it relates to Open Spaces generally brings up a really important question. I've heard this from other residents. R Us when we're building Open Spaces in a city where there are certain neighborhoods and communities who are experiencing the pressures of gentrification and displacement in a negative way and I have heard many members ask, who are we building these parks for? Who are we building is community centers for? Who are we building main streets for and who are we building infrastructure for whether it's schools are roads, and I think that's an important question for all of our departments the struggle with and would like to give you an opportunity to share with us and was at that who still here I'm your perspective as the next superintendent of parks on that particular issue. Broad response to that is that that it isn't just to Parks and Recreation issue because we are going to continue to try to build that the the program the best spaces around and energy said that that just creates pressure is on the committee members are one of the ways that that that I am very excited about figure out how to respond to this is participating in the in a broader Citywide approach to be around what's happening. What's happening in South Park as we as Government are investing in a way that we should be it creates these pressures are there. So are we at the table with with her with our partners in planning and and utilities and transportation and and neighborhoods Etc. How do we create Citywide solutions to try to do that? And then I'm not a planner. So so my expertise is very limited but things like making sure that where were were thinking about that the impact that are improvements are having around. The need for additional housing the types of how things is going to be there. So what are they looking to acquire additional spaces to to bank them and and and look for Waste great additional housing things that that that again, I'm not a planet but I think we need to be thinking about as a city in terms of our specific work in Parks and Recreation. I think a couple of key pieces there in addition to staying engaged there is is whenever we we plan or we we have the resources to do something in the community making sure that we engage with them and how we plan it and how we we design it. But then I also how we activate it because I think the folks in that community and really help us make sure that we're providing spaces at that are responsive to their individual needs and hopefully they'll look into Billy's in that area and I'll make sure to follow up with you about connecting you with folks with in South Park in the duwamish area generally around potential opportunities for us to Support that place making it feels like it really is coming from Community as opposed to happening to community. And then I have one last question that I have made the commitment to ask on behalf of witches that that she wanted to get cheese and porch light can be heard with us today, but wanted to get a better understanding from you as to how how and what you would do to make sure the public dollars are used to support union labor for Parks projects and operations. Try I think I'm very pro-union pro-labor. Obviously, we sincerely believe that none of the work that we do Parks and Recreation can be done without our employees. We enjoy I think really positive relationships, but I think of the 17 or so individual units within Parks and Recreation and that and that number seems high as I say, but I think it's pretty high and so it is it is just a matter of continuing to to do before without commitment. I think the challenges and it might speak to a specific dates are some of the concerns that they will come up as as we approach that the work that we do. They're they're going to be times when when we are being looked at through look to through other organizations to help do Partnerships a Tetra. We just have to make sure that that we prioritize part of our values as this is something something some Port. So whenever we negotiate agreements making sure that those are tenants of those agreements Encourage you as a follow-up that that it's really important for us to not only maintain sort of the existing labor relationships that we have and some of the the very good job that we have with in Parks and Recreation, but it's also important for us to look at Future opportunities particularly in the context of public-private Partnerships at how we can leverage those public-private Partnerships in a way that will also create Pathways to good union living wage jobs. And I think we have some of those opportunities are going to present themselves down the road here in the near future. So I would love to hear from you a little bit more of your philosophy around how to grow what you would do to Kent to Reno promote the opportunity with some of these public-private partnership opportunities to bring in and prioritize some of those union labor jobs. I guess I'll say that that I want to have more of a discussion on this and I think in terms of specific Partnerships, I think it's a matter of what what it is. They were trying to accomplish and just make sure that that's what I would pretend negotiation or any initiative or any Planet were doing with making sure that we have a clear set of values and and cabinets on the front end. Here's what we to go shooting around and that would that need to be at the the front end of whatever we're doing somewhat of a partnership comes has to include those issues are fairly quick moving on with regard to just a follow-up on the race and social justice initiative. This was something that council member Ward specifically wanted me to raise and you've answered part of it already. But what about promotional opportunities, we know that part of the respect and inclusion in any department is to identify individuals. That want to be promoted that want to be involved in something new. Can you talk a little bit about how you will do that? And what kind of opportunities you will make for somebody that might not really be thinking about moving into a different section or division or living up in the management ranks. I think there's a couple ways since I've been incredibly impressed by the Department's commitment to providing out of class opportunities for folks and this is just sort of short timeline opportunities for four people to try a different type of work in different division of tetra. Think those are really powerful professional development opportunities to continue to encourage those but but making sure that would create a consistent and fair system for who gets those opportunities, right? So I need someone today, but if you need someone to make sure the waiver process. Applebee's apply for those I think I should have bet the other side is is just for everyone having having a professional and an impression development and training opportunities for everyone that there is individual. I saw some folks that you said maybe don't necessarily want to have a different job. They just want to get better at what they're doing and so providing those types of opportunities but also other opportunities where you know, if someone wants to be that the next superintendent of Parks and Recreation, how can we support them in and then continue to give him the the guidance and the the the training at to do that the other piece that I'm really proud of the tale of Parks and Recreation dozen and I've been doing it for a long time is is a mentorship program where we really encourage our our leaders to take on minty's and help guide them through that kind of a process again. What a outline whatever goes in might have himself professionally and help them. So done navigate that provide resources in a formal process in place. So let's just say that I wanted to move or am I wanted Have a mentor to have a process in place where I can ask for one and you could match me with somebody we do we do a good job managing the process and and you know, these folks by menal all the managers in the agency to report some really hard to take on mentors. I had a mentor very briefly right before I left and I feel badly some time to be engaged. I'm going to bring somebody else with it. There's a very very clear process on the expectations. We provide lots of guidance to the mentors on on side of what they should all this conversation should happen in the types of things. They should be engaging in. Thank you. I'm in following up on council member Gonzalez's question about Labor. Can you describe a little bit about Labor Harmony and some of the contracts that you may have? We're always looking for opportunities for people in the community particularly communities who are having a new skill set to having an opportunity to work on a contract may be Someone an organization with no more Contracting and it gives them a new opportunity to be part of the community and make Union wage jobs or at least living wage job. So can you talk a little bit about how we're specifically targeting our own Community for these kind of contracts signed the contracts that we are putting in place or a service that the contract and its construction related that is outside of the work that our own employees are doing but we're keenly aware that within our community there people that don't have two chances to learn those skills. And so we're looking to make sure we're including them. So is that something that is in your Lexicon right now that you are looking outside and I'm not talking about Contracting out as just as we are hiring is that so Thing that you're involved in I'm not sure if I'll have to get back to you then. I'm not I'm not exactly sure what specifically were were. But at any specific contract that were looking at in that regard, so I'll have to take take on the burden of having a stand inarticulate question. So we'll come back to that. I am definitely not talking about Contracting out but as we are reaching out into the community, we're just paying attention for make sure the people are included in these contracts are most like this might add that in 2018. And again in 2019 working with the Department's We Lay. Very specific goals for women minority owned business to achieve in our Contracting and I'm not remember exactly what the goal was in the achievement was for parts, but my recollection is it was pretty high. So that's a part of our overall effort of which Parks is very much a part of our desire to ensure that we meet certain goals in terms of the work that we do contract at that they To be a strong representation of women and nerdy on businesses. Thank you for that. And I'm just one under square what you said earlier as that. I really I am very grateful for your intentional efforts to respect your employees and to include them in the opportunities to gain new skills and to move into other positions. We just know that that's something that frankly that Parks has been really good at that many people start off as a you know, it's 16 being a summer lifeguard and then can continue to grow would you just lastly talk about community centers as you were describing that for your next 10 year plan that there is much that you're going to be doing items. I'm particularly interested in our community centers. I know you and I and Christopher and I have talked over the years that the people in this town love their community centers, but we got 27 of them. They're expensive what you see for the next 10 years. He's going to be a part of our thinking and I are planning around the Strategic plan that we were engaged in a lot of the work that we did around the the Strategic plan specific to Community Center is sort of showed us a lot in terms of like you said people are very Beloved Community Center that they're there their it all the services and the things that commuters provide really are helpful to the meeting the needs of our communities, but I think as we move forward we did it we need to sort of asked a couple questions. So so one question is going to be around, you know, it is 27 the right number and and and another questions. What what condition should they be in there some that the we haven't invested in in quite some time that are in the queue now, but we've got to make some Investments, but I just want to be very careful that if we make those Investments two things one again, they were making Investments. In a way that's driven by the people that are going to be taking advantage of those services. So I guess is that that we also need to make investments that are are flexible and multi-use because we we know the City Kansas change committees go to dinner change, you know, if there's a comedian now that that is enjoying a Resurgence of of young kids at some point does getting I get older and become teenagers and Etc. So we have to make sure that these huge investment that we make need to be flexible in terms of observing that for me as I stated the beginning everything that we do a Parks and Recreation needs to be focused on people and their needs and so everything that we build and acquire and develop and activate and program needs to be driven by the needs of the residents. So so as we engage in this planning process in our communities begin to too sure what their needs might be in line with these values that I outlined I think music Part of that. It's hard to say sort of what they're going to look like cuz I don't want to you know preempt the planning process died. And I do believe there going to be any way that we've been looking at opportunities at a community center. If we're going to be redoing them. Is there an opportunity for some affordable housing sure on top that and I know that there's there's not something that I expect out of you today, but I just want to put that back out there that it's you know, if we have 27 of them public property is it it's precious and if we can do it so that we can get some more housing units for someone that will be a step in the right direction to need for us to approach these these challenges in a new ways and and because that their new challenges we have to be creative. Can just tell me what I want to say. Thank you. Both of you for being here by his just for your willingness to come back. And also I want to acknowledge again Christopher Williams Impala half you've been so helpful cream and thank you for the work that you're doing to you know City Hall Park as you all know means a great deal to me over the years the work that you were doing in Belltown now trying to make sure that we can green up an area that doesn't have a lot of Green Space Smith Cove goodness knows over the last 10 years you've listened to me on that and all of the work we're doing now in Fort Lawton and with the public schools. I think we're moving in a really good direction that is focused on people's needs as we're becoming a dancer City. So thank you for that question. So you'd like to bring up. Yeah, but this question is for the W Maritime. I give Cindy superintendent. I gave it a little bit of a break. She was a little bit more about what the mirrors process was in the search for the superintendent. You briefly mentioned that you invited his to reapply for this position. I just wanted to get a better sense of what the mayor's office process was for identifying potential candidates in just to give us in the public General contacts in texture of what that look like certainly reached out to a cross-section of stakeholder groups that have an involvement with the Parks and Recreation Department, including the board and Seattle that the porch foundation and people that have been active in the Parks community centers in other places of Engagement in one case of former director, and so folks that have been engaged in Park and Recreation in our community for a number of years to form a search committee and Serving a search committee, and the coach years were Julie phares & Thatcher Bailey and we had I think seven or eight different folks that were a part of that. We looked at reviewed over a dozen resumes. As I mentioned. They were over a hundred people that had applied. We narrow that down through our human resources department to I think about 15 or so folks and from that we selected a subset of five people that we wanted to interview. We invited those people to interview you and me. It's up to you. We ended up interviewing three people entire search committee and the search committee recommended to people to move forward in the process after that those two people then interviewed with the E team at parks with the representatives from the mayor's office other department directors there and engage in this as well as employees at the Park and Recreation Department. And that feedback then was presented to the mayor before She interviewed both of Jesus and the other finalists. It was a long process of Engagement and we're very very fortunate to have an engage community and Parks and Recreation in this community and folks were willing to give up their time and effort to to the process and to provide us with their input. We didn't ask them to rate this one two or three that's really the mayor's job to do that. But the kind of review and then give their feedback a kind of pluses and minuses and talk to the faith. They thought we don't have the benefit of having the council member Juarez here a bit and I don't want to put in a gene on the spot, but it's also just get it from you in terms of your perspective in terms of how far is and her office played a role in that search process. Would love to understand. A little bit more as well. One of the people on the search committee was a member of council member Wars the staff and she was very helpful. She didn't end up being in the interview process cuz she was actually out of town. You're in doing that. But yes the counselor Juarez and her staff were very engaged in the process great. Wonderful. And I don't know if you wanted to add something again on behalf of your council member but my question yes, I still have all of the stacks of papers and blankets that were provided to us. It was an interesting process to go through very extensive. Can't imagine what it would be like to be an applicant let alone the interview were but we unfortunately I was out of town towards the end. So we had a different member but for the actual interviewer, but we had over 65 applications and I would say probably over a month of of the entire process and the series would always start with what is the purpose of this meeting where we at in the stage of looking for folks and who are we looking for? And so that was very much directed by the department free Wars actually was on set on the interview process when we interviewed the people that were there so that he was involved in kind of the selection of who got interviewed but councilman Warriors actually a part of the interview team. That's great. I really appreciate you sharing those additional details in the chair for letting me answer those questions. I just think I just really wanted egg express my gratitude and appreciation to both at the mayor's office and to all the members of the search committee and two Where is in her office and her staff for 4 for me to making sure that they continue to work collaboratively and in and strong coordination with the executive to ensure that not only is the search process one that has a high level of Integrity on to it and that that you know, we as a council feel like we have a high level of confidence in each process, but also that I will definitely ended up with an excellent candidate who even though his been in the seat before it's important to make sure that those processes are in place and that their coordinated and cooperative and I just really want to express my gratitude to both the office account number where is an to the mayor's office for working together collaboratively and in such a coordinated fashion to ensure a really successful outcome. Appreciate that. Okay, we ready for vote. Heck. Yeah, so I am very pleased that you are back and I'm going to move. Recommend that you become the director of parks again. So in that capacity in a move that the committee pass the appointment number 01306 second all those in favor. Say aye aye aye Nana post. I think things are going to go well for you on Monday. Thank you, and thank you so much. And again, I appreciate your willingness to do this. Thank you for coming back. Thank you for the excellent process and my friends and farts really appreciate your support of swell. Okay. I love it when you have a fan club, that's great. Okay with the next item of business. Are you going to read this one in for us? Thank you. Cancel the other one one. Pennsylvania 11949 6in ordinance authorizing the department of Parks and Recreation to enter into an agreement with Seattle Academy of Arts and Sciences to renovate the South Park Community Center site and develop an ongoing relationship. And the South Park Community consistent with the terms of the agreement and attachment one. Excellent. Thank you. So we'll get everybody settled in and We've got those thank you. I got it. Well. Thank you. I was will work through that. Start with introductions with you miss Tracy Tracy Rob Phillips head of school Seattle Academy, Seattle Parks and Recreation. Thank you. Welcome. Love you Rob. Okay, so crazy. Are you going to be saying any of this or would you like somebody else to have a proposal very good and I'm going to go through it but but certainly both Paula and creamer of the experts and have been sort of shepherding this through and of course Rob can talk about the specifics around the school, but we're here today requesting your support and legislation that will allow us to enter to partnership with the Seattle Academy to develop the attic field Jason to the Seattle to the South Park Community Center. This legislation will allow them to begin fundraising and and contribute up to a four million-dollar donation into this project. We've heard loudly and clearly from them along the way about the need for continued to improve our parks and Open Spaces in that community and and documents been very very active folks. Like says, I don't know that others working both with us in the foundation and others to look for ways to continue to provide these types of amenities for the community that this particular project is part of a broader project it to renovate the entire built the entire field there that the outdoor open space as well. As you know, we've got some work also inside the community center. So with all of this is done, it's good. It's part of a broader planning efforts. So the stabilization project for the commuter is currently and design and we'll coordinate with with the field to make sure that we don't take things out of commission at the same time and then also other few other projects in that Community including the duwamish Waterway Park that we're working on two to continue to provide these amenities for the community. Also that the this plan is is very much aligned with our overall approach to parks and open space across the city and and in addition to the typical of Waterway Park Vale 7 Landing site that were working on in that area on the map is for the play area of how close is the current site layout to the the water. Oh, I don't think we included a in area map. Yeah. Half a mile or so. Walking distance for those who are walking the Academy of been working for her for quite some time to put this together. And what does project we'll do is we'll provide a synthetic field Turf in that at the site of the South Park Community Center campus and I will note that Dad disable use the Cork and Phil. I know there's a lot of talk about the crumb Rubber infill and we piloted court and one of our other facilities and then continue to see good results or so. We're going to use that here as well. As I said the Academy's going to donate after $4000000 for the field and four lights and establishes the recreation space for the residents, of course Academy will receive some some benefits as well in terms of their investment. They will get prioritize prioritize time at the field, but that the time that they're receiving represents about seven and a half percent of the total Field Time. Available through this to this donation in addition one of the things that we hear from the community and actually communities across the city is when we build and this fixed it to question earlier when we build these these beautiful new amenities often that the community is itself doesn't get to utilize them until want to come in and said we're making here is to make sure that after we make these Investments that this field will not be included in our overall permitting process for up to five years so that it fits really create some exclusive use for that Community for a while so they can begin to program a great activity. So I think that's a really important aspect of this deal that will help us really provide us access to the community. I understand that seven and a half percent of the hours are being reserved for the academy. And then if you said that you're not putting it into the pool for the next 5 years, what is it? Does that mean for IQ soccer or so. It's you got a little bit of time that's reserved for the academy. And the rest is for people who are living down in the area. That's right. It is very informal play The Academy is committed to an end. Obviously the commuter staff is very excited and committed to the idea of being able to create programs and activities for that community. So so not having to go through the permitting system to see if this field available if we were actually doing so now they'll be up the program and then take advantage of that. So this Council bill in the summer in Frisco not represent the entirety of the agreement in this partnership. What you have attached to the ordinances the the key terms that will be will be on which the formal agreement is actually drafted attachment 1 to the fiscal note correct is the essence of the terms of the agreement. So then this will eventually if approved and the committee recommends a full Council approve this then eventually this will turn into what multiple page agreement. Okay, and then what happens to that multiple page agreement do we have an opportunity as a committee or Council to review the agreement to ensure that it complies and comports with the terms of agreement an attachment one that is not anticipated, but I'm supposing that you don't have any promises. Presupposing that are you suggesting to a future council meeting or we typically have the benefit of reviewing the partnership agreements and in many instances actually proving that the full contents of the partnership agreement as opposed to a outline or chart of anticipated turns to the agreement. I just sort of see this as out of practice with the way legislation has come to us historically so I can think of some of the spaces that we rent it out right for over in time at Golden Gardens. For example, like there is Jefferson Park on some of the mortgage issues like there is there are many experiences at least since I've been on this committee where I feel like we have actually seen the full terms of partnership agreement or at least draft terms of the partnership. As opposed to just a chart of what the roles and responsibilities are going to be. The reason of flagging this is cuz I think that the issues around around the prioritization of the public space going to Seattle Academy seven and a half percent of the time while seven and a half percent of the time may not in terms of hours be numerically a lot. There are concerns in my mind about which hours in which days and which periods of time we're actually talking about when we're talking about that prioritization of time cuz not all times are created equal. So that's actually in the agreement. I don't see that have Priority Access during SAS falling Springs Four Season from 3 p.m. To 5:30 p.m. Monday through Friday. so fall and spring and fall starting when When is fall season start for the last week of August to the first week of November then essentially the first week of March through give or take the middle of May? I can see that my Council colleagues would like to see this in writing and I'm quite sure the council member was will say the same. So let's continue going through this and then suggest that you come back to us with a final contract. Yeah, I absolutely would be happy to bring that back at you. And I think part of what we want to do now. Also his is have some level of agreement to the school cuz I have to do fundraising 2 to bring in the formula. And I just want to be really clear especially For You Folks at the table that I'm not in disagreement with the overall concept around the private public partnership in this space, but you know Southpark is a home-away-from-home for me in a lot of ways and I lived right across the street from this community center for several years before moving to the junction, but I spent a lot of time in South Park. I am really invested in this community and then I see myself in my own family in this community and I have heard time and time again from Residence Inn Southpark about the need and the desire to want to Have these improvements at the South Park Community Center specifically because they need more access to athletic fields to time to play on the field excetera excetera. And so I want to be supportive of this and I am in concept but I also want to make sure that I have a full understanding of any potential unintended consequences that will exacerbate some of the equity and access issues that I continue to hear from members of the South Park Community. So if I can just get a little bit more clarity around that that would make me feel a lot more comfortable. Are you comfortable with the idea that it would come back without your need to approve the final draft? You just want to see it before they actually sign the agreement or do you want the council to keep going through this? So can you talk about the partnership conditions? I think that's good. Maybe I'll answer some of your questions and then the timing and then we can talk about what's going to happen after we Country of your presentation in terms of the conditions of the partnership because he's going to donate up to four million dollars for lights and the field They will receive Priority Access to 24 falling spring Sports Seasons at during the hours of 3 to 5:30 Monday through Friday. And then we talked about leaving this this preserving essentially this field for the community outside of these hours and then in addition to that the economy is committed to providing some ongoing programming support at the community as a minimum of 25 hours annually to build on the work. They're already doing in terms of volunteer coaching at cetera and end it up for us. Obviously is it because it is we're seeking this partnership is it is going to be critical for us to be able to put together this this these Investments the site improvements in a very quickly will say that that this does align with some of our existing policies and plans. I either way we've got a couple of other places where we're doing this this type of partnership with Fields SP use our partner in an energy field that has a similar agreement that city of Seattle Pacific University supports some of the other plans and needing to provide additional open space. Obviously the community's telling us this is well. It aligns with some of our other projects and priorities in check in on the previous slide on the next to the last bullet. Maybe this is something I can't remember good sauces exploring that the academy is committed to provide at least 25 hours annually of programming in the South Park Community. So that's 25 hours is know if you think about the number of weeks that we have. Twin your summer or spring it and your fall operating times. What does that look like for the community? Is that one hour a week? Is it a bit? How do you how do you see that actually becoming a reality? Sure. I I don't like we've gotten into the to the specific that that would be anchored Inn instead of working closely with the community center staff and in the community there to figure out what are some of the things that they need and what we can do but not for us to make assumptions about what would be meaningful her out for things. We have student volunteers and tutors in public schools throughout the city. Now, we've helped support the growth of the youth soccer program at Southpark previously through the partnership of Samara. We would we've already been in conversations with Concord Elementary about potential stem programs, or you know, the Central France to help Supply arts program and given scarcity of resources and funding for that in Seattle Public Schools right now. So we're open to what the community wants and needs and that includes the community center Concord Elementary and other stakeholders new community, but we really want that to be community-driven and I would say 25 hours is certainly a floor not a ceiling. A floor you said that's a minimum. That's not that's not a goal. That's how did you all decide on the 25 hours being the the floor? Intuition. I think they've been very clear about the things. I've already done there at that. They are vested in the community and we were just trying to Again, leave it open so that the community could really say what they want. You know, if they don't want more than say maybe in a running some free soccer camps or clinics are coaching. That's fine. If they want much more than that. Then I think you know Robin the school are willing to do that as well. I think we're just trying to make sure that again we're listening to what the community wants and responding to any Gap, but they may have where they could be helpful. And they're going to need to be to do an annual public benefits to the department that the department has to agree to and then they have to do the reporting back which is something that we actually instituted a number of years ago with hearts to try to hold these little bit more accountable for the public benefits they provide so there would be that opportunity the suspect over here to see what what can be provided and hopefully I understand there's going to be more than 25 hours the list of public benefits that have been discussed. It in terms of of as part of the agreement to the the programming as well as the the poor million-dollar donation are for what. Of time Rob? I think it comes in over the. Of time the construction. I mean, it really isn't understanding. It's it's facilitating the cost of building the field as a center point of the project and they're also committed to an agreement to contributing to the to the ongoing renewal of these filthy still have about it. I've spend so after 10 years old contribute to read be doing the field the carpet is sent to me and do we have these types of in terms of this partnership for the character of this partnership. Do we does Parks and Recreation have examples of similar types of relationships in other contacts? Sure. I mean, we've got to leave that lots of different version specific to athletic fields. We have groups small and large they contribute to the ongoing maintenance of specific fields in exchange for this sort of prior to that prayer. My scheduling that the one sort of key one very similar to this is one with Seattle Pacific University that invested in building the the field at Interbay and also is investing in renewing in after that the lifespan of the field. So it's it's very similar to that. I think I think the terms are anchored in that and that's been a successful partnership as well. That one we did actually incorporate immediately into the permitting system and actually has resulted in lots of peeled juice for for for teens across the city and I'm pretty sure that it for the school district. I was asking the questions. I just wanted to see how the public benefits is proposing this partnership agreement compared to public benefits that we have agreed to and other tomorrow partnership agreements and I know that has been very clear on her expectation that the public benefits are real in exchange for these types of partnership agreements and it's hard for me to evaluate based on the information. I have weather out how this compares to other similar for partnership agreements in those cases, but the Seattle Pacific University in this one doesn't have the funding for this field and I think this system provides this opportunity for for community that that doesn't have you seen the field if not in great shape. So we were really interested in and taking advantage of this. Put this field on our except Improvement plan, but this is an opportunity to do it now and provide that access a lot of sense to me, but I think part of that also includes making sure that we have an opportunity to work. Well with Partners to ensure that as they come into a community and take over some of the management operation issues or you know of a certain aspects of we're not displacing the ability of existing communities to get Primetime usage as well. And while I recognize that part of the exchanger is for prioritization of field activity that is of interest to the academy. I also am very conscientious of what that means to a community group that doesn't necessarily understand the terms of the partnership agreement and will perceive the Back of access during the fall and spring which may be Key sports activities times as as as inequitable on its face since I just want to be really really intentional in our thinking about how we structure that prioritization in a way that works both for the community that is currently there who has very high expectations and reasonable expectations around ongoing usage of the athletic field. Once it's spruced up and made beautiful and gorgeous that is not going to be relegated or feel like they're being relegated to a private interest. Absolutely. Well said do you want to continue with the next line? Sure the other word for looking to try that to support this comedian providing continue to access open space just a very quick overview of serve our funding this project. The total cost is about 2 million dollars. But but I hesitate to say that because everything that we've been out ends up costing more than than what we hope it would but so generally just gives you the ratios, you know, we've got obviously they're the contribution from the academy as well as other funding to but there's some states county Grand some read money's for district money in some other major challenge. This is also one of the projects that was funded through the major challenge. Project major challenge project bond fund Grant sorry Park District, that is supporting us as well. I think I think it's certainly that the idea of making sure that that this is something that the community support. This is very important to us and we had lots of opportunities to engage with community members and ask them what they would want an overall sort of concept of the the site as well as a community center. We had several several meetings. I think we got over 17 events that either we posted or attended and I think we've logged over 700 people that we've talked to over the last eighteen months to get input onto this concept design. They were going to show you here in a second and and can I go to that actually was was really targeting some of the users and so for example going to the to the late teen late night teen program is also the summer King summer day camp participants go into the playground & wading pool in understanding some of the uses there and then again special events, not just at the center, but throughout the neighborhood. And so that the overall design in addition to the to the to the stabilization work that we're doing inside the community center. This also is responsive to a lot of The dimple we've gotten that is from the community but there was a study for example that that really highlighted some concerns about the location of the playground after removing that clearly to the other side, which I think is really important part of that this one moving. So that was probably a very inadequate spray park with moving it over to near where the playground is in the end. Then really creating this this full-size multi-sport feel that that will be lost to the more there going to be another Fitness Zone some some LED lighting. I think whenever we put lights in these communities, I think there's a lot of concerns there. I will say just broadly the technology of these Lighting systems is is it's actually really impressive in terms of how you control with the lights going to be so it doesn't pollute. Windows and of course, it's going to provide Ada accessibility and Morgan renovate the parking lot. So there's a lot of work that this is going to be a part of sight and it's why we don't have a map at near this is what the current site looks like. It can be Center top center of the design on the left. We have sort of where where the the spread the courts and the open lawn area are in once all this is said and done the concept that we're engaged with the community around and that the school signed up to do is is that mention removing the playground on the the the spray park over to the East part of that the site and then we do have is part of his part of our work around the off-leash area plan. We committed to considering off the Sherry has any time does the Redevelopment 415 projects and then this is one that's there is potentially a Sharia apart. But again what we we want to make sure that that this is something that the community would support in a net. This point this is something that that has come up with something that would support. So that's what the plan will look like. Ultimately relocate the playground is really important for us to Spur for health reasons as well. We've had a lot of great actually feedback from the community about this and then does Need for for these are some quotes from that we heard from some of the communities in sort of the how do we get it filled? It's open year-round you're having time an assistant to get these programs up and running and Central so you can see those quotes there and I think that generally and excitement chat to make this to make this happen if somebody owes I didn't respond. Will lice come out here and I'm actually proud that we're going to get that. I would like to see you around here likes play soccer and so like the community to get together. It does Gathering space with that but the neighborhood that's going to be really anchored and what they want so many other questions final contract. That is written and includes all the terms. I would I would also like to have an additional conversation run the prayer to the ocean of time. However, I also want to respect that the chair of the committee is not present today and have an I have not had personally have not had an opportunity to speak to customer. Where is directly about about this particular issue and would like to have the opportunity to speak to her about about that. Can you get a contract drafted between now and May 15th, which is the next committee meeting? Depends on what you mean by draft cuz we have also the lawyers that have to look at these things. I'd be shocked if we could do something that quickly. Clearly we don't want to delay this I hear what you're saying about fundraising and moving forward but there's enough questions that have been raised here today that I think that we're going to have to ask what this for word for at least one meeting. If you can get a dinner the bulk of the contract drafted to be approved. Is there a time pressure here be answered yet, but I think that the time pressure is be They need to really set off on a fundraising campaign and we really need that for a million dollars to do the project. So they thought was it they could get some sort of a green light from the council that they were on board with this then they could go out and do that with confidence so that they don't spend all the time raising money. And then at the end of the day, there is no agreement. I'm not hearing that there is a disagreement about the terms. I think that if what you're looking for is a green light that we like the idea. Definitely the answer is yes. I think that for the sake of having something that three lawyers want to look at that. You're probably better off to come back with a at least a draft contract has been around like Council. So I'm going to recommend that you can tell you're bored. We appreciate all the work that's done. I have no doubt that we will ultimately get to the point where we're supporting that but I do feel that right now. There are enough details shouldn't still need. Resolve that we would be better off putting it off at least for the next meeting. So my understanding is that there was a hope that this would give out it out of committee today and that there would be an opportunity for the full Council to vote on this on Monday. That was the original plan. Correct? I think these prioritization issues and questions that I have can likely be addressed over the next several days and don't want to hold up the consideration in advancement of the of the bill while I get that additional information. I also think that there is an easy fix to the bill in terms of a report back on the term of a drafter final version of the partnership agreement to allow the city council to review those terms. And so I think there's an opportunity to sort of address the two concerns I have without holding up the bill in requiring another Committee hearing on this so I would be comfortable with voting the council bill out of committee today with a caveat that I'd like to have an opportunity to resolve some of that outstanding questions that I just rose that I just, you know, launched on staff. What would you like to see because I'm having issues and the second is with regard to review of The partnership agreement. So I think Tracy is taking notes anything she understands exactly where I'm coming from and that those are the two limited issues and I believe that we can work through those over the next several days without creating undue delay consideration of the bill. And I think if we can get the TV on the record, we don't need to let me there's two ways to go and then having them bring back a draft agreement after you approve the ordinance, but the terms just getting them to a gentleman around the table and living around the table to Grease come back to the council with that draft agreement. Once it is draft up absolutely bring back a draft agreement with these terms before signing. I think we can take them at their word and that would resolve some tweaking to the language. I think that might be before Monday. Yet once again, I will repeat myself. I'm happy to address those two particular concerns with all of you over the next several days between now and before it is up for vote at 2 p.m. At full counsel this Monday. Okay. Alright be alright that then we are going to move that the committee pass cancel Bill one 19496 those in favor. Say aye most no abstentions. So I think that this is a bit sounds like it's clear, and we will move forward with that then on Monday is assuming that the questions are answered. Thank you very much Rob. Thank you. You just went through sausage-making. Appreciate you're all here at thank you very much everybody for coming today and anything else for the good of the order. Thank you.", "end_time": 5213.9}]}