{"format": "raw", "annotations": [], "confidence": 0.928116229913568, "data": [{"start_time": 0, "text": "I called it in and we are ready to begin on April 8th 2019. Thank you for being here for a regularly-scheduled council briefing before bring up our State Legislative team. I just want to give a brief description on the excite exciting application process for the vacant council member position and I have it. Going to hand out which is just a preliminary list of applicants. And so let me see to give us a summary for to you and in the publican's sort of hot off the press cuz I haven't even went to this document yet. So the application deadline was Friday April 5th, the city clerk's received 15 applications and preliminary We Believe 13 or eligible and particularly eligibility based on the residence requirement in in the district for District 4. The city clerk will distribute a binder of the qualified applications to council members no later than tomorrow for the application be posted online tomorrow as well. Early if it's possible, but the deadline is is tomorrow Tuesday, a news release will go out later today to describe the eligible candidates and let me see just how to walk to the chronology again if everything goes as planned. First he'll be a public forum on April 12th, which is Friday at 5:30 the burthen Knight Landes room in the the purpose of the public former to involve a community organizations activist residence businesses who ever feel as though they are vested in the district court to participate in a public forum for them for them to give input in and receiving feedback from the candidates. We've received a few interested organizations. I think the n-double-acp are interested in participating as well as the think the transit Riders Union then they had some questions. So I'm assuming base on my questions or interest in participating. So the deadline for organizations sort of the thought was an organization going to drive this for but we didn't seem to have a lot of interest and so we're going to show some flexibility of some committee or if they still want us to drive it, but it's going to be held In the birthday night Landis room April 12th. We've asked Brian Callahan right now instead of a default personal. I don't want to call the default but he is the host of sale Channel and he'll sort of moderate it but the thought is will have tables with organizations will have all of the candidates there and truly have a rich conversation between community members and the Kennedys. That's Friday. I will have a special city council meeting on Wednesday April 17th here. And that's where these applicants will have a Public Presentation. They'll have time to talk to us. We can ask them questions and leave the public discussion. If you will on us reviewing these fine individuals who would who have applied and then on April 22nd in council chambers will have a public vote and we'll see each other where that leads and I think all of you know, if we cannot reach a majority vote on a candidate we keep falling until we get one. So so hopefully it will start that process may be in it on April 22nd Monday. The format for the public forum is still short of being worked out. But at this point we're looking at of course the general format introduction by the applicants many questions are giving them ample time to respond to usual kind of Q&A, but certainly further to give them an opportunity to explain their positions why they're interested in applying to all again. The process has been publicly posted a deserter wanted to describe that it's triggered today with and let me pass out while I described that this is just a preliminary list just take one and pass them on down of the of all of the people even those that we think preliminary are not eligible. Okay. I'm going to yes, please. organizations apply to organize the Friday forum not necessarily to organize but you participate and so what we're trying to do is Gage the interest level on what participation means and so the two I mentioned the n-double-acp and in that the transit Riders Union, they they just asked questions and if I'm reading between the lines between their questions, perhaps they want to play a strong role. So we'll flush that out later today that is a new process to hold public forum processes. It's a new ordinance. And so the last time we had a great turnout of community organization, so it's so no has a short answer not applying. That's why we said we're going to have a default plan. So we're and we did a lot of made into a lot of organizations think / 34 organizations. I'm trying to see who would be interested but so folks were notified of the opportunity to apply to organize. And you said you we reached out to 34 organizations believe I don't want to miss State the process their I know that the clerk in our staff complied with the ordinance. And so I'm assuming they did but the bottom line is at the word is not out as strong as it should be will continue to get it out because quite candidly that's what we're trying to have that process community-driven. Do you have organizations? You know that one or Justin Theroux. There was an example that question were the changes made last week know the subject of the public 4matic a teacher to post it online Monday morning on March 25th. Will there be a public forum? Yes. There will be one on April 12th 2019. No one's really applied for two straight in the development of form, but the n-double-acp did mail us on Friday. April 5th as me part of the form, so if there's any interest we will Quite candidly, we'd rather have the Community Drive thats but in the absence of that will make sure we have it rich Forum. So and ID and Katie's following this discussion if she wants to play up the role in helping organize his her even getting the word out. I mean, this is in my opinion we have time to organize at Forman doesn't to be perfect. We just have to have as much participation as possible and we can even change the format around the day before to make sure that we get meaningful participation from the candidates and the organization so Okay, any other any other questions are really good on that? Okay, let me repeat the whole process in the air for a customer Bryan so I can do the preview of today's forecast elections at 3 bring up the team. So if there's nothing else on that process one of the team come forward and whatever legislative legislative session updates. running Willie Wilson codega the office of intergovernmental relations State relations director Christina postlewait State lobbyist and we have less than a month left in the regularly scheduled legislative session things are moving very quickly. Not that anyone is counting on this side of the table and at this point but that both Chambers are in the process of reconciling their operating capital and transportation budget. So things will continue to move quickly and you're also quickly approaching the fiscal committee cutoff deadline tomorrow, so we should see some some additional movement tonight and then tomorrow, but I'm going to actually turn it over to Karen who's going to do some budget highlights before we dive into individual portfolios today. Good morning. We are less than three weeks out from Sonny died last week. We saw a lot of action on the budget side, And I think was our first indication that and rumors started circulating that there might be special sessions. So we're continuing to monitor those conversations. We send out some relatively details out Lyons about what was included in all the different budgets that were considered on there for their initial proposals. And I know that several of your office if it followed up about some specific projects that you had been working on. So if you do have any questions about specific allegations or whatnot, please reach out and I'm happy to confirm whether or not something has made it through this stage on the operating side. As I said, they are in the negotiations phase each see each chamber has passed out their version of the Budget Inn are going after negotiations same with the transportation budget and a capital budget is the only one that hasn't moved off of the senate floor at this stage that were anticipating that potentially today or early this week and then they'll continue with the negotiation. Not on the revenue side. There's a lot of lot of conversation talking about that. I'm sure you saw that both of the budgets would rely on a tiered real estate excise tax. So that would be changing from the flat real estate excise tax of the read that we have now in the polls are slightly different the Senate has a lower threshold set for I think it's $50,000 or lower reading on a kind of tears up to higher higher priced homes in the house. I think the higher tiers there's a higher rate for homes that sell / 1.5 million and then a higher one for 1.7. So those are anticipated to bring in at some of the run to the third would potentially be considering to balance the budget capital gains. The house budget does rely on a capital gains tax. The Senate is considering a capital gains, but it's the budget is not reliant on it. So what that means is that if they were able to pass a capital gains at their proposal that they would use that money to it would to offset taxes for low income families in the middle class families, so Again, all of that will be negotiated through the negotiation process and I wouldn't say that there is a clear path for those proposals at this stage. So lots being considered right now and we will keep you guys updated as all those things continue to move to that process. Any questions about the budget for friendly want advocation? I'm so on page 3 at hospital 2158. That's the workforce education legislation that was put forward by representative Hansen in this kind of followed along. This is another one of the house revenue bills as well. And it's wood. This would eliminate the state need Grant and replace it State the whole thing with I think they're calling it The Washington college grant program and what that means that they're going to make it an entitlement. So right now the statement Grande is fine. Just it's the state gives a chunk of money, then it's kind of just spent down and there are still students that are needing these Services above what to say to be able to allocate. So the house is proposing to put forward a piano surcharge on a variety of different places that would bring in Revenue that would make make this a dedicated funding source for higher education. So really interesting a little bit different than the way that the Senate put it forward and it has a higher threshold. I think that the house proposal was would be for families at the 70% of the An income and it was 50. So there is an additional mean on that side, but the bill was scheduled for executive session last week and it was not moved out. So we're continuing to monitor that but it also included this large higher education proposal included hour that the Washington State opportunity scholarship match and that was something that we had been working on that would help local governments that were interested in participating in the higher education space if they could receive a state match to help stretch those dollars even further. On page for Senate bill 50313. This is regarding the the school district levy lid. I know I bring this up every single time. But I do know McCleary they had changed the way that the school district for able to collect their local Eddie's in specific to Seattle and this created some pretty significant budget hardships on our school district. They're anticipating a $49 budget shortfall in the coming year. So a lot of the conversations in Olympia have been about how they would expand that if they're going to lift that led to allow the school district to collect more. On timing on that. What's the expectation? Is that going to pass this year? So it to allow the school district to do that. I think we'll see something. But again, that's all speculation part of what I wanted to talk to you about today was that in the Senate Ways and Means Committee last week following the the executive session of their operating budget. There was a little bit of a blow up with the bill on this is about 1:30 in the morning and there were two amendments that were hung on the proposal one that would allow us some of the education dollars to go towards charter schools, which is a pretty contentious issues and Olympia and additionally it would put some pretty significant restrictions on collective bargaining for teacher salaries. And that that those two amendments were needed in order to move the bill out of committee. And again the house is not have this in their proposal. There's this it's it's similar in love with the local Levy lid lift would be accomplishing but they're not the center proposal does have this these pieces that are going it's it's sick. It's a significant Challenge and it will create some additional challenges for the budget negotiations. Wa has been all the Britain has been lobbying very hard to have a lot of those pieces removed, but they were on the same page that are on different pages and with us just being such a contentious issue because of the timeline that school districts are looking at that's one of the things that we think would potentially be putting us in the the realm of meeting a special session. Thank U. Today's agenda little tight because we have a 11 meeting at ten-thirty schedule so I can surmise want that one of the significant amendments that was needed was around charter schools and it was the Democrat that put it for but it would allow some of the State dollars to go towards charter schools in some of the Democrats word. Sorry, but I don't remember who put which forward. I'm happy to. I think it was at 1:30 so important to not watch it, but I did read a couple Recaps. I should have watched it. But I think that there was just an acknowledgement that a lot of people unhappy with it and had felt that that this was what was needed in order to move it out of committee and acknowledging that this is such a significant budget problem from the school districts that they were willing to have us negotiations later. But happy to provide a link of wild one then what time it was up that might be helpful. We ought to environment and I'll try to get it up. Sorry guys start on page 61512 that's on page seven on this is our Mississippi lights top priority Bowl this year in the super Palau them to have some Authority and the electrification room that we were happy to see that that was pulled from the rules committee last week. So now it's on the second reading calendar and we are awaiting senate floor action. I'm on page nine Senate bill 5993, which is the model toxics Control Act Bill. We haven't talked about that much this year, quite a bit in the last few years, but this is the big proposal that's been put forward that would make adjustments the hazardous substance tax, as you are all very much aware that the model Talks Of Control account has had a lot of issues with fluctuating gas prices and some of the money has been kind of removed and they count over the years of French consulate general fund. So there's been some conversation about helping to refill the account by making his adjustments and so they're proposing Considering a hazardous substance act on her barrel and this would raise some significance additional revenue for the projects that are eligible for maca dollars is a particularly important for the city of Seattle because we had have two very large projects that are coming online and that's the East water weigh in the lower duwamish and they have they would be eligible for me to action Gran the department of ecology up to about almost like 5 million dollars in this next button cycle and those monies do not exist without this Revenue. So really important that we're going to keep talking about how important it is for us, and that was put forward by senator frocked. In general government. Imma go quickly this one on page 10 W Haskell 1403. This is the piano apportionment formula adjustments is simplification of it. I might mention that they have been really involved with Department of Revenue and Association Washington businesses to kind of help simplify the person that formula everyone there is consensus language that was put forward and curly in the rules committee at wrongful death at Sanibel 5163 on page 12. It has moved out of its committees and the house it hasn't officially been referred to rules yet, but I'm anticipating that today. I'm auditioning on page twelve and it Bill 5376 South Dakota Senator Carlyle consumer data and privacy Bill. And that was one about how consumers information is shared in their rights on being able to control how it's used. I'm at the schedule for executive action today in the House Appropriations Committee. It's on page 11 and it's the second item down. Does this allow deferral and they just have to be paid by the end of the 10th here, correct? How's the house what's happening in the Senate to know yet, but there were we're monitoring it. Good morning. I'm going to touch on a few health care bills for you one. I wanted to share right off the bat. It's on page 13, it's House Bill 1039. This would mandate that high schools and districts greater than 2,000 students and allow for others under that threshold to obtain and store opioid overdose medications to assistant opioid-related overdose part of this also requires that ospi developed guidelines for use and training for the public schools and school district. Unfortunately, this is something that really is needed right now. I'm wearing courage that it's me. It's continuous Move Along. There was a public Hearing in Senate Ways and Means on the 3rd. So we'll keep you apprised of any changes there a question, right? So this is overdose. Yeah. There's anybody looked at the possibility of bringing in buprenorphine. I'm not sure the specific medication has been identified. I know there are kind of at least a few Are out there. So I think that would be part of the ospi training and program overview process. We've seen is Matt in the medically assisted treatment how important this is. So if we're doing one thing in the ice cools, I'd love to see if we can expand. So can you keep me posted? Yeah, I'll look into that. Thank you. moving on to page AZ to page top of 15 1870 This is the this is the Affordable Care Act protections. So this would put key patient protection such as Banning pre-existing conditions exclusions from the Affordable Care Act in the state law. So this bill has passed both Chambers and is now headed to the governor's desk for Signature. We're really excited to see the progress that was made on that this year a Big Bill and also I want to talk briefly about 1523 which is on page 16. That's the governor's requested public auction Bells. This includes establishing a public option called Cascade care and what establish standard plan design for health insurance plans sold on the healthcare exchange. I know you have quite a few years invested in this one counselor mosquito and looking into other options to control costs such as cost-sharing reductions. So the Senate version is being exact today or this being a Second Ascent at the house version today also and Ways and Means Spell simultaneous votes going on today. We're eager to see the outcomes. My other questions trying to roll through this quickly for you. Alright housing and homelessness. So that starts on page 17 1406 our favorite Bill the local-option Bonville continuous move along. Well, there was a public Hearing in committee last week and Emily Alvarado from the office of housing came down and spoke. She did a really great job. Her comments were really appreciated there. Now, we're just kind of kitchen into town and ways and means to see where we think. We think we need to really work on the mayor has been making phone calls advocating for the spell as well or just continue to work with stakeholders and how we can be of assistance or maybe where we need to back off sometimes but this this is a big priority for a lot of members. So our only concern is it moves her ways and means as they might lower the rate, it's just they did that last year. I I I do think we've done a lot of coalition-building and education going into this the session around the spill. So they're less wary of it coming their way. They've known it for a Long time but we are just keeping a very close eye out for for them to kind of fiddle with it a little bit and that would really heals a lot less money that would be able to use in our communities. man Sorry to pages of notes here. So the top of page 18 the prevailing prevailing wage Bill. I know a lot of you probably heard what happened last year or so under the 2018 law. It ended up under itself provides. The prevailing wages for residential construction are established by wage-and-hour surveys. I'm so what happened was there ended up being a different rate for residential vs. Commercial construction. This was a big problem. So there are quite a few meetings between the speaker and key legislators who work on Labor issues. So this this would actually fix that problem which we knew was going to be a big one and it did it did pass. I went through the concurrence vote this past week 93 93 days is 0 days and five excused. So we'd say that's a win. I also wanted to touch on page. Sorry, I'm usually a little more organized it on this one page 18 the homeless student support. This was a bill that was Prince Monster by Senator Frost and requires each K through 12 public school to establish a point of contact within their own school. I'm in the building to identify and support homeless and unaccompanied. I'm going to unaccompanied homeless youth. We know the number of homeless youth in our schools is growing and growing. This would allow them to have a designated person to go to for assistance on a wide variety of issues. The bill also includes changes to a to Grant programs that are currently support students on experiencing homelessness, and it was hard before House Appropriations on April 5th. We expected vote shortly me ask a question, please. How does the legislation Define? I I don't know what the top of my head. I apologize. I can get that to you. I I I don't know if they already have a current definition with an OSP. I imagine one probably exists, but I can let you know. So I think in this particular area so through our families and education Levy here at the city. This is a new area of investment for us as a city in in in the Levee package in the implementation evaluation plan that's being considerate in my committee. We are proposing of focus on students within the K through 12 system that are experiencing homelessness Speedy defined as housing unstable. So about 64% of the students in in the Seattle public school system that are currently experiencing homelessness are not actually homeless. They are experiencing housing instability in most cases. That means that they are doubled up so they are There are sleeping on couches that there are a double up families there still experiencing housing instability, but they're not actually experiencing homelessness. And that is again about 64% of that Seattle public school population that if falls into that category, so we and implementation evaluation plan for those Investments at the city of Seattle are proposing focusing on that particular portion of the population because that is the largest population. That's the most common way that students experience homelessness in within the public school system. So I would really encourage us lifting those facts up for legislators in Olympia to make sure that they understand that that defining homelessness the way that the mckinney-vento ACT defines it as go. How to leave a lot of kids Behind the mckinney-vento ACT unfortunately requires you to be actually experiencing homelessness in order for you to access particular benefits as a result of that program. So I want to make sure that we're not aligning the definition a tightly to what the federal law does because that will not meet the full needs of most students who are currently experiencing homelessness since I worked down there is that you know, we can pump a lot of money into schools and into improving our your teacher salary and you know building safer schools for a students but a student can't learn unless they know where they're going to sleep that night and where they're going to get their food that night. It's just it's not a sustainable situation so I can tell you those conversations are ongoing and I'll be sure to bring that up. Thank you for that. And my office has a lot of research around this particular point and V Nguyen in my office has the lead on this issue. So if if it would be helpful to have those data points, please reach out to my office were happy to provide that I'll be bugging her shortly. And then I wanted to also talk about a bill that we it's a little about that could it kept getting knocked down and keeps coming back and we're very proud of it. It's 59-46. It's that stupid exemption for City sanctioned encampments in shelters. It came out of the Senate with a couple problematic amendments mostly not permitting the use of alcohol. I'm sorry 5946. So it's on the it's the last bill on page 19 for house for Public Safety apologies. And it's at came out of the Senate with problematic amendments such as a provision on alcohol and drugs typically used in these I would have really prevent. Us from doing our own Contracting with her own service providers proximity to schools. The the schools definition is so broad as to include Early Learning Centers then daycares than we did a lot of great work with representative Fitzgibbon and Senator when before it went through Fitzgibbons committee and all of those nasty amendments came out. So we're very excited about that and it still chugging along so now it's in rules. I'm really really proud of this one. I think it's one of those great deals. They can have an immediate impact on our community and then lastly while I'm in Housing Council of her her, but I would love to I know we keep talking about doing this but I would I'd love to call your office and schedule some time to talk to your tenant protections probably early this week just to make sure I have all the information that you were trying to get across the update. It sounds like on the Reform Bill is positive. Thank you before we can I check I didn't see notice or mentioned in the Housing section. I quickly looked through some of the others. I think may have been somewhere else. None of the property tax exemption bills before word for seniors and we have one that's not super seniors and for Veterans as well and it said allowing local jurisdictions, too. Tired to County median income 5160. So it would modify the qualifying in income thresholds for it to low-income seniors into visual disabilities and Veterans with taxes to be levied on 2022 Armada. Just a disability rating qualification for the veterans property tax exemption to 80% and its and rolls right now. And I would just like in addition to that that the way that the house in the Senate are looking at them. That's the big the big point of conversation is the date that it becomes active because if it goes in after it like before 2022 that there is some rap. They have to fill on the safe side because of the way that the McCleary property tax text went through. And if there aren't any final questions in the housing portfolio, hope you have a question, blonde. I do want to note that the folks probably received this magazine regularly governing Magazine on they did a feature on a piece that Washington state is considering including 1923 and underscored what this Council has been talking about over the last few weeks how important it is to have those State Partners as we lift the floor for creating housing options and density throughout our state's and City's truly are relying on the estate Partners. I thought it was just a great opportunity to mention it because it came out this morning and they also talked about our I do legislation as well which shape and has been a really great effort to focus on a policy discussion in a policy goal and its really brought a lot of people together. And I'm moving on to the public safety section. I'm going to start on the bottom of page Eighteen with some of the council's significant priorities that are continuing to advance including rape in the 3rd degree how to spell 1000 to sponsored by representative or wall. This would eliminate the requirement that a victim clearly expressed lack of consent in order to prove rape in the 3rd degree that passed the house unanimously unanimously and it also made it out of Senate Law & Justice and has already moved to Senate rules on sexual assault kit notice House Bill 1016. Also on the bottom of page 19 answer by representative called the air would connect survivors providers and penalties in place after hospitals that don't comply with the referral requirements. Excuse me, that is actually an update. There were some concerns from the hospital Association around some of those penalties. The $2,000 penalty has since been removed in this version of the legislation. I know that's probably just a Morning to several the council members who mentioned the importance of accountability and this Bell but I do think that The Advocates feel strongly that continuing to move it forward without a major stakeholder proposing will be important in understanding that changes will likely continue to be pursued in future sessions and it sounds like also at the local level. I'm sexual assault House Bill 1166 on the bottom of page 20 another representative or wha proposal would address the backlog of untested sexual assault kids in Washington state. That's a remarkable Bill. I'm just Givin the physical implications and the level of support that it's received at this point passing the house unanimously on March 6th. It was also exact out of Law & Justice and has moved to Senate Ways and Means and then on the top of page 21, I'll move to domestic violence law enforcement. This is a representative Jenkins proposal that would require Law Enforcement Officers secure Firearms when responding to domestic violence calls that passed the house 6238 on March 5th passed out of Senate Law & Justice on the second and has also been referred to rules. So a lot of movement there and then a bill that council member Juarez in particular has been very active in advancing in the middle of page 22 house. 1713 sponsored by representative mossbacher Woodcreek training and liaison positions to improve best practices relating to missing and murdered indigenous women. We've also I'm followed up with representative mosbrucker around council member Gonzalez's suggestion run at coordinating with a County Medical examiner's it will follow up as soon as we hear back from her and then a death penalty elimination, very exciting policy. I had a chance to touch base with a council member badge on the elevator this morning towards the top of page 24 that Senate Bill 5339 sponsored by sonder Carlisle that would eliminate the death penalty and statue falling the Supreme Court ruling that found the death penalty to be arbitrarily applied and racially biased that bill passed the Senate 2018-19 on February 15th with exact out of house Public Safety on the 1st and has been referred to house rules and the governor has announced publicly that he will sign it. So some exciting movement there and then just briefly I'll try to move to Is quickly recognizing the time constraints today under safety net and civil rights on the top of page 25 representative Hanson's New Hope act or certificates of discharge a house bill 1041 abbotswood address barriers to employment housing and other obstacles by expanding eligibility to vacate certain non violent criminal records. We've done a lot of work with council president Carillon looking at how to address some of those issues systemically. So this is a great step in the right direction that passed the house 90520 on March 1st and the Senate unanimously on April 3rd. So very exciting unanimous support their agency employees harassment House Bill 1692 in the middle of page 26 disclosure Protections in place for employees reporting sexual harassment that bill also passed the house 90820 was exact out of Senate government in tribal Affairs on the 22nd and referred two ways and means and then finally wage Find salary information also towards the bottom of page 26 House Bill 1696 sponsored by representative Dolan expand on the last sessions equal pay Victory by prohibiting employers from asking about a former pay history in that past the house 56240 passed out of the Senate labor committee and has also been referred to rules lastly. I will just highlight the lgbtq commission on the top of page 27 that would establish the commission within the governor's office that bill is still moving having passed the Sun at 34214 on March 6th. Probably having a lot to do with the letter that comes over Weis offered and got some great responses around as well. I just want to thank you for all your hard work. We did have some wonderful conversations with Senator Wilson and we sent a letter as well and it was really really nice talking to her and learning a lot more about the impetus behind this and how we're moving forward and how we're going to get funding for this, So thank you. Absolutely. And without I'll turn it over to Karen to touch on some of our transportation priorities. Atso scooters 1772 that moves out of Senate Transportation last week. There were some amendments that were put on the bill and these were brought forward by the insurance industry these the main focus of it was about the disclosure information about for some of the drivers and then insurance requirements about that. I don't think this is everything that they had wanted to see what amendment why so understanding is that in our conversations will continue the bill will will likely continue. I'm currently in the rules committee. I don't see any big challenge standing in front of it right now, but the issue will likely come up again over the interim. So we'll engage in those conversations when the time comes and this isn't in the in the transportation section, but I do want to talk automated enforcement. I know there's been a lot going on with that one. The bill itself technically is not alive in the house it failed to people to the floor from the House when before the house of Fortune cut off we attempted to revive it in the Senate by doing a budget Proviso in the Senate Transportation budget Senators win and saldania were very gracious and put the amendment forward. We were hoping that it was going to pass through but unfortunately failed to hang and was not adopted into the budget. So we are now looking at Alternatives and we are potentially looking at making our bill in the house and necessary to implement the budget one of the budget Proviso Concepts that we were working on putting a revenue-sharing concept in there so that some of the revenue that would be generated by these this enforcement would go towards pedestrian safety programs at the state. I'm so we're moving that concept back into attempting to meet up back onto the house side in effort to make it necessary to implement the budget. So it's officially pop up as being alive again because it would have to be pulled from the rules committee again, and then it would be amended. So that way you won't officially see it see action until that happens which is still quite a significant lift that we know several the council members have been very involved in helping us with some of the stakeholder concerns and fingers crossed on this one. I also just wanted to publicly acknowledged the work site council member O'Brien Gonzales and mosquito have done to keep this moving as multiple different formats and the disability rights Washington Coalition and rooted in rights folks have been amazing. They are incredible Partners in this work and I really appreciate that you still use willingness to engage with us as this moves forward understanding those Mobility concerns and balancing out with a lot of privacy concerns. So we appreciate the council's letter on the correspondence from the mayor's office as well. We are very hopeful that we can continue to move this forward the session understanding some of the issues with the. Of Maximum constraint and then need for that Mobility. Right now I'm so we'll continue to let you know about opportunities to engage with various legislators and will likely need your help. Very good customer scared of your grabbing your mic. Thank you. Mr. President. Thanks for the summary again. Good luck in the last 20 days. I hope it is 20 days and that you don't end up in special session died in the Senate rules committee that I think is unfortunate and I think does relate to Transit though. I think the previous I really did it to labor standards is Senate Bill 54 57. This is the bill that would help to make sure that as bids are going out for contracts. We don't allow for the start of underbidding of contracts. We have a lot of Union Partners who I wanted to create the roads in the bridges in the bike Lanes right in our community and we want to make sure that when these good beds go out for contract that we're not creating a disincentive to hire a high-quality laborers by creating the ability to underbid and that's exactly what's happening right now. So the bill Would have made it impossible to Ashley under-bed these contracts and I understand that wash. Was supposed to the bill given that this may come back next session. I'd love to talk with them in the interim and see if a spot is being a good partner as well and how we can maybe get to a place where under bidding doesn't occur because we wouldn't want that for any of the RFP is that we send out we wouldn't want people to devalue what were valuing as as a public officials with the public dollar and wanting to make sure that we're paying good living wage jobs and investing in your work. So this would have been our cw39 30060 which is explicitly allowing for this type of underbidding to happen. And if it is to be resurrected in next year's session would love to work with you on that. It's a big priority for the Ironworkers as well. Thank you. Very good. And you got my email on going out? Okay. Thank you very much. Go get them. Just very briefly. We do have an executive session after we go around the table and do a preview of today's full Council actions that I did get a confirmation that we did send an email after 35 organizations probably could have went out. I think Tuesday the 2nd and could have gotten out a little earlier our house, but we're still trying to not do hard Cuts or trying to stimulate some interest from Community organizations. Okay. So we have a short agenda this afternoon. I think just a four or five items primarily appointments. So this shouldn't take too long. But we got started and go down there the table here, but it'll take long watch. all of you Thank you for the hell. Good morning. Everyone. There are no items on today's full Council agenda from the Human Services Equitable development and renters rights committee. The next meeting of the committee is scheduled for its regular time, which is tomorrow Tuesday, April 9th at 2 p.m. At that meeting. We will hear from the human services department will be reporting on the results of the are homeless and measurements for the last year. Thank you answer where I should get a newspaper then everything I said, she will try to the Civic development public assets. And navy. Can you use committee met last week you had to re appointments to the board of Park Commissioners that are voted out of committee, that would be mr. Huntley in this McCaffrey. The next meeting of our committee will be Wednesday, April 17th at 2 and we have planned for shorter agenda to accommodate for our libraries meeting to follow at 2:30 that same day today after Council briefing. Go on to our next meeting for the select committee in the library Levy and that's what you should identification Sasha at Central Council will be walking us through the brief memo. She sent to everyone last week. This meeting will be the next meeting will be this Thursday, April 11th at 5:30 will will hold a public Hearing in council chambers last Thursday evening the Salem Police Department host of the Town Hall in response to the Lake City shooting in the tragedy in our community, which as you all know what happened two weeks ago. I normally don't do this, but I want to do this today because we are still healing this whole city. Not just the North End. I want to just quickly against a the names of those that we lost in those that were heroic. We have Eric start who was injured are Local Hero the driver the Metro bus route. He's 75 years old and despite as well as he drove a field bus away to safety and focus on his passengers. None of the twelve passengers were injured. Stark has been with Metro since 2012. We also had Deborah Judd who is injured and I'm sure many of you read in the news. She is from Laurelhurst Elementary. She's a La Rose Elementary School teacher. I'm sorry. She was actually I'm shot three times in the arm to shoulder in the lung but she took the time to communicate to her students that she would be fine. She's been teaching for over 30 years. She loves her students and knows how traumatizing it can be for 7 and 8 year olds to process violence. So her focus on them demonstrated nothing short of generosity bravery in love. And of course we lost. Dr. Bob has so I was had the opportunity to meet. I was honored to meet some of his family members last Thursday night. Dr. Robert was Hassan was a retired physician and an Air Force Colonel. He traveled the world has two brothers and he died of a gunshot wound to the head while driving his car. He leaves a wife a child and grandchildren and last we have mr. Lee, which is unfortunate. He was 75 years old and he was also killed when the sesar crashed into his his vehicle. And so with that we've been working very closely with the North Precinct. We've been working closely with our new captain captain Sano. And of course we have been meet having meetings at the community center with our chaplain as well. Thank you for worse or no items from the Civil Rights utility economics development Arts committee agenda today at the full council meeting but we do have a committee meeting tomorrow at are 9 30am create a meeting tomorrow. We have our fourth meeting on the public accommodations Council bill regarding closed captioning. This will be all those 4th meeting on the topic. It's the third since the council bill was introduced. We will also be having the first discussion on the appointment of Merico Lockhart as director for the Seattle office for civil rights. I'll be happy to share with each of you the responses to the questions that were prepared by myself Central staff some councilmembers contributed to questions. And I also met with each of the four commissions to solicit their questions as well be receiving a briefing on the only in Seattle neighborhood business districts program from the office of Economic Development, and also be getting a work plan refund from the Seattle Art commission. They finally also from the Seattle Arts commission will be hearing an update on that departments Arts and Cultural districts update today. We will at 4, so we will be awarding the Sexual Assault Awareness Month proclamation to women's commission members and talking a little bit about the denim day event. Organized by the women's commission coming up later this month and I will circulate that the proclamation for Signature. Thank you. And finally, I just want to mention a couple of vents one that happened over the weekend that I had pleasure participating in it is the 27th annual spring cleanup of the Fairmont Ravine and we worked for several hours focusing on removing garbage and debris from an area where there has been in a homeless encampment for years under the bridge as well as removing Ivy from trees in the Ravine and cleaning the sidewalks. John Lane has been organizing this for twenty some-odd years Matthau. Jerry has taken over and it just I think a really good example of a of a community coming together. We also had some assistance from the Seattle Police Department's CPT. As well for the Southwest District and then one other quick mention just a plug for tomorrow morning's event with the West Seattle senior center. I mean the junction very good the next housing Health Energy starting with the Fort Lawton plan overview. This is going to be one in a series of meetings that will be coming to our committee and we will as well as we've done with other pieces of large legislation provides for the full Council a little binder so that you can have a sense of what's coming up in our committee. If you'd like to engage in the four-line discussion at will be forthcoming and encourage you to join us. If you're able to on the 18th will also have an overview of the office of housing annual report. We will have a chance to consider the respectful work. Play some resolution which we circulated two weeks ago. Ask for folks to get us feedback by today. We've gotten a number of individuals who have sent us feedback. So I really appreciate that. If you did have other items that you were thinking of would like to add those please do I think we sent a updated draft around some people had a chance to see that most recent version. We seem from the national level to the state to the local level. It's critical that is elected stewards of representing the public that we act in a way that represents our constituent and it's free from harassment intimidation. I'm at the very core of our being we should make sure that we are respectful and respecting his offices and the power and privilege that we have the second thing is that it has expectations of our staff who are also in very important position of privilege of representing Us in the community as well. So we have similar expectations of our team members and everybody in the legislative branch, but it's also actually Flying to expectations of the public and how we engage as well. We want to make sure that we're protecting those very team members our staff and our offices from the sort of vitriol and rhetoric that's out there that at the tenor Across the Nation that has prompted violence in many situations and we want to make sure that the conversations that are had with our team members are also respectful. I'm in Jackson on my commute in this morning as I was listening to the news on the bus on Democracy Now there was a pretty shocking overview of the level of I hate that has come into for example Congress member it'll on Omar's office where an individual called and had an expletive ranting against the staff members cussing at them and invoked the his hate of her religion and identity and I think that that type of hate and betrayal at the national level is something that we here at the local level is well and no matter what level of office we all participate in we expect respect. To go both ways. So this is a really important I think tone-setting piece of legislation and really appreciate all your engagement on this that will be sent around the updated version will be sent around by the end of the day. So you have a chance to look at that and talk to again participate in the April 18th meeting and I'm considering a piece of legislation that we discussed at our last committee things to board members after the wolf and members of iuoe for coming in and having a conversation with us about the need to ensure that there is Harmony in terms of enforcement of four are sick and safe leave policies for all workers in the city including our folks who * blanche's and clean her yard that the school grounds. We had a chance on Friday to visit district for since its month for were in District for this month and we had a chance to see last Friday the Northeast District Council neighborhood Farmers Market, the Ravenna Bryant Community Association and visit at the Seattle Conservation Corps, which was very interesting. Haven't been out there to see it training folks. You are currently homeless and previously homeless in job skills and placing them in housing and future employment opportunities. I'm very impressed by the individuals that we met there and looking forward to stealing that up and read her connections to the strong union jobs at this Friday will continue our efforts and District 4 and be meeting with the folks that Solid Ground University Heights and we're going to be at the family works on Friday looking forward to that. Thank you again so much for this and what resolution if you haven't had a chance to win enter chat with me happy to do so. Thank you catch mice kidding. Cuz when I get jealous, thank you. Good morning, April 10th, 2019 will be canceled. We will instead have a special meeting of my committee on Thursday April 18th 2019 at 2 p.m. Here in council chambers that special meeting at will be call to consider a couple of matters. The first one it is we will consider amendments to the families education preschool promise Levy implementation and evaluation plan. These will be presented as a consensus package and council members that attend a committee met a pool amendments for individual discussion from that consensus package if they so wish it's my hope that we will build implementation and evaluation plan out of committee on Thursday, April 18th, and You so I will ask for the rules to be suspended in order to allow the full Council to consider the amended version of imitation an evaluation plan at full Council on April 22nd 2019 second. We will consider a 9 appointment sandor reappointments to the community police commission. This is been a long time coming. My office will have a 5 of those at nine nominations and I'm really excited about the Slate of nominees that we have for the community police commission commissioner roll. And then lastly I will just say happy youngster day to today is a take your youngsters to work day was really excited to join them in the Bertha Knight Landes room early this morning to give them a welcome and I know that they have walked through the hall on the second floor already this morning and I think You will see them floating around city hall for most of the day. So really strongly encourage you all to try to open your doors and welcome them in and help them collect all of the stamps that they need in their passports in their City Hall passports. They will be in the birth of Knight Landes room most of the afternoon and throughout the day. So please feel free to go down and say hello, they'd love to see their council members. And I know that their parents who are city employees would love to see you as well. So thank you all for allowing me to carry on in the tradition of now former council member Rob Johnson in making sure that we can tell you to have a city hall that is kid friendly and family-friendly some really excited about being able to take over this event and host all of these families here. So thank you all for participating. I have a lot of folks out there for a library Levy meeting to start at 10:30, but we still have an executive session we have to go to which will be hopefully short room but having executive session so concerned back show. Committee today but Finance neighborhood committee this week. We have an important meeting on Wednesday afternoon at 2 and all of you received a memo from Eric mcconaghy last week. I think Allison in my office sent it out. We will be considering legislation that will authorize a memorandum of agreement with the Washington State Ferries for the Waterfront. We will be accepting non city funding from the Washington State Ferries as well as a state Convention Center. If you got any questions, let me know also this coming Friday at 9:30. We will have a scheduled meeting on our select committee to consider the confirmation for Jason Johnson. I have met with many groups that have asked for that questions additional questions have gone out, I will reach out to you and see if there any additional questions that you like to have an answer for that day. And the last thing I want to say is that tomorrow Tuesday. My office has been working with us. They have a public. Life study in Pioneer Square and we've done things around the city in the in the past isn't the first time we will be focusing on yesler Crescent City Hall Park the next block Prefontaine and then Fortson Square, so people are interested in participating in that tomorrow, 2:30 and the Bertha Knight Landes room. Obviously, this is open to the public and two people who are interested in working to help us collect some data for public life tomorrow or tonight Landis 232 appointments to Tyree appointments to the levy to move Seattle oversight committee, and we do not have a committee meeting this week. Thanks very much got that one thing. I'm sorry. I'm going to make it really fast. I just wanted to let folks know that my office last week was briefed and Give me an update on the status of implementation of the Community Service Officer program over the Seattle Police Department. I know that this is something that many of you have an interest in and cover by Charles remark reminded me that I have I had forgotten to give people a heads-up that the response that sell Police Department's response to our statement of legislative intent asking for information around implementation evaluation. We will have a bunch of Proviso attached to that to make sure that we have a level a high level of confidence in those the renewal in the new structure of the community service officers that response is going to come to us probably by the end of the week and I have asked the Seattle Police Department to make sure that they reach out to council members who have expressed strong interest in the subject to do one-on-one breathe after the report has been a really so I just wanted to make sure that you all were keeping an eye out for it in your inboxes cuz I know that several of us. Extremely interested in this program in seeing it progressed. I had an opportunity to sit down with assistant chief Diaz and I think that the program is is is is going to be one that many of you are going to be pleased with so we will also be having a hearing on the proposed plan around community service officers in my Committee in early May and so we will make sure to send that data round or we may talk with the council president office about the opportunity of having that presentation be made in Council briefing which might be an appropriate use of our time here in the morning no positive test and exciting developments. Oh, thank you very much. So this exact session should be relatively short, but but very important. So let me move into executive session. As presiding officer. I will now sit at the Shell City Council now convenient executive session and the purpose of this executive session Scouts pending potential or actual litigation in the opportunity to discuss confidential legal matters with our city attorney's is authorized by law and the legal monitor is always present to make sure we reserve questions of policy for our public open sessions. This session should last approximately 15 minutes. So that would be 10:50 a.m. That we should be able to move back in a public session. And if we go beyond the 15 minutes will announce that an open session and it's expected duration to that. We're moving executive session.", "end_time": 3730.6}]}