{"format": "raw", "annotations": [], "confidence": 0.9366649896791666, "data": [{"start_time": 0, "text": "Good morning. Good morning. This is a July 17th, 2019 meeting of the Seattle pleasant mean, I will now come to order it's now 9:38 a.m. I'm able to take a chair the committee and I'm joined by Harold. We have three items in the agenda today a briefing from o p c d o e d s. And the mayor's office on the workplan for industrial lands a briefing and public hearing it on the comprehensive plan Amendment Docket in process and a briefing from seci on the permit backlog. The next regularly-scheduled plus meeting is on Wednesday, August 7th starting at 9:30 a.m. Here in council chambers before begin. Is there no objection to Jay's agenda today agenda will be adopted at this time. We will take public comment on the top 10 minutes a for public comment. If you wish if you wish to speak to agenda item to the comprehensive plan document process. Please reserve your comments for the public hearing on that item speakers are limited to 2 minutes apart. , never speak of comic season 2 minutes and Microsoft microphone will be turned off speakers are asked to begin their comments by identifying themselves and the agenda item that they wish to address as a reminder public comment is limited to the items that are on the agenda or within the purview of the committee. It's my understanding that there are folks who might have signed up on the wrong list. And so if that is the case and you are here for the public hearing just let me know and I'll make sure that you added to the public hearing. So first on our list is Stuart mcfeely. Annex is Charlene Boyd. Yes, I'm I'm here to talk about the backlog of Permitting at the Seattle building department. I've been a licensed architect in Seattle for 27 years. I file about 10 permits a year with the city and I want to compliment all of the staff in the city building department. But the system is totally broken. The ability to get a permit is degraded over the last five years and they've blamed a lot of it on the new operating system implemented about two years ago, but it goes back before that and some part of it is that we keep adopting new coats like the new AG you and. Do codes are great. And the new far is questionable, but You don't we don't go back and then correct what's wrong in the building code or the land use code there is in the land use code. You can't build a front porch in your front yard because that code goes back before any of us were probably born. So I would say the other thing is it's very I'm a licensed professional people almost have to hire me to get a permit for a Dodge you or an AG you and it's very difficult for the average homeowner to come in and have the ability to get a permit to do an accessory dwelling unit. And part of it is the attitude of the building department. And this is really true of S. 2 They're looking for ways. To not allow you to get a permit as opposed to saying. Hey, that's a great idea. Let's figure out how we'll get you the permit. They always look for some part of the building code or land use code that will prevent you from getting the permit that day. They need to expedite permitting for applicants if they're going to adopt new. Do an Adu regulations expedite the permit process for people. Thank you. Charlene Boyd No, that's Matt Maher Maher. This is Charlene Boyd. Yeah, I said I signed up on the wrong this time speaking to a different name. Charlene Boyd Boyd Boyd, sorry Good morning morning on my name is Charlene Boyd. I'm the administrator Providence Mount Saint Vincent Seattle, Washington for the last 20 years Providence Mount Saint Vincent frequently known as the amount is owned and operated by the Providence st. Joseph health system on my want to describe a little bit about the site. The side is comprised of 9 Acres built in 1924 to serve older adults and religious community the sisters of Providence. The building has been altered overtime with LED last major interior renovation in the 1990s. But yet the basic footprint has not changed today this vibrant not-for-profit organization includes skilled nursing Transitional Care of short stay Assisted Living of PACE Center independent living and a sisters of Providence retirement community including a Wellness Clinic Health Care Providers, and an internationally-recognized intergenerational Child Care Program. Are public spaces for the community includes a library at Chapel thrift shop at gift shop conference spaces Outpatient Therapy Services Home Health hospice and other community programs summer concerts are also very popular with our neighborhood community during the month of August with over 500 people each Friday night. So daily, we serve over four hundred residents patients in and clients and enrollment of 125 children with over 500 employees and 125 children + 200 cute community volunteers in Arch over 900 people annually to return to the West Seattle Community. We partner with our universities and other schools to help train future nurses nursing assistants social workers and other Healthcare Providers are funding sources include Medicaid Medicare and private pay with our philanthropy organizations providing assistance for those in financial need. We are definitely an integral part of the West Seattle. Last 95 Years, thank you. Again. If you are here for the comprehensive plan public hearing. We I have your the sign up sheet. And so we will I will allow time for those speakers to speak then so on and so I would like to just put the speakers for that public hearing when we get to the action item and we open a public hearing for the comp plan document process. That's okay. I believe next on my list. That's for the item is Steve or Stella. Speaking globally on zoning you continue to keep people out of the process. So I'm sorry that Mike isn't here today. Cuz I'm I was surprised couple meetings go after which Mike spoke to me for the first time in the last two or three years, you know, cuz we disagree on land use. So therefore I am a nonperson one of the reasons why I attend these meetings and I think it's an assault on Democracy, you know, quite frankly you have been acting very similar to our dear leader is to Trump if people disagree with you, then you are out of the process. I see very little of what's going on here until the very last minute you get a minute or two to comment and many people in the city or not really happy. Now you look at design review and part of the big problem. You're taking people out of the system in design review. We used to be able to look at the building to see if it really fit if it was on the edge of the Zone. We would not necessarily go to the same bar as if you were in the middle of its own and what we're seeing is a continual movement to move people out of the process when I was young we celebrated the differences in our neighborhoods. Now, we are destroying them because look at all the new buildings. It doesn't matter where it goes. It looks pretty much the same in Ballard Greenwood Seward Park Delridge. It doesn't really make much difference and neither do the people who live there, you know, you talked about your care for people of color your care for diverging incomes. Look at your mha and what you passed your suppressor. all of these things Thank you. So just to be clear that I'm going to move these names to the public hearing John per sax. Sorry Jeremy Paul, John persak, Sarah Cameron and Erickson. Is there anyone that's would like to speak to the other gender items one and three complan? Okay. Well, we'll get to the projection to pelicana. We'll be sorry now that there's no one that spoke. Agenda item 1 Industrial lands workplan update. What function the table please introduce themselves? She's kitchen from the mayor's office. But avoiding Sam Suffern office of planning and Community Development Jeff wentland office of planning and Community Development. And I would you take it off today. We are very proud to be here to discuss the mayor's vision for the city's efforts. I like to give the industrial Maritime and Manufacturing sectors the best opportunity to succeed and diverse family way jobs is a key component of those sectors. I'll be joined by my colleagues have to sit here from o e d a b c d & S before they jump into their detail components of the work. I thought it might make sense for us to find a quick overview of what we're interested in doing and why were interested in doing it. The mayor is proud that our success at the city is deeply tied to our to the industries that process Industrial Maritime sectors are important contributor to the city's identity supporting family wage jobs in promoting economic diversity in the city's industrial area is undergoing some positive under economic developments illustrated by growth rates in industrial rinse that were the highest in the world between 2016 and 2017 there also illustrated by the significant Investments that the Port of Seattle is making them and their facilities, however, continue to support average rental rates for commercial space that are about three times higher than those for industrial rinse, which creates a significant pressure to reuse industrial lands for other uses the last few years. We've seen several other analysts for further change into creating additional printer pressure. This includes the the Port of Seattle has plans to modernize terminal 46 to include a cruise. Skippers on the Northern third of the terminal which will be capable of holding the world's largest cruise ships. We got a proposal for creating the stadium district with a mix of uses in the area including housing and hotels at Sound Transit is working on processing the development for New Light Rail stations in Ballard enterbay and Soto at the state's plans for using the Armory site and Interbay and all of this is occurring while impacts of climate change continue to accelerate and our cities industrial areas face acute risk from rising sea levels increase floods in extreme heat. So the mayor is is completed to to building a strong and diverse economy by improving our position is a gateway for global trade for increasing family way jobs in the maritime and Manufacturing sectors, and she thinks it's important for us to address all of these individual decisions. Part of a comprehensive and deliberate process that gives us the best opportunity to plan for the future by the city's existing policies established a strong protections for areas of the city that currently housed industrial uses. It's been over a decade since we've updated those policies on a significant level and we think there's an opportunity to build a comprehensive strategy to strengthen and grow Seattle's industrial areas for the future and I think the biggest and most important component of our approach is the desire to grow the inclusive family wage jobs that are part of these sectors, which I know Bobby is very eager to to talk to us about everything. I was going to say, so Yep, that's exactly right the letter indicates and we all work to help draft. The mayor's letter. So a lot of is included I'll keep my comments short and to-the-point. The ultimate question around industrial lands from a public policy standpoint is ultimately who benefits who benefits from the industrial Lands End position that OED stands along with the mayor and other colleagues here on the table is that it should be a platform for inclusive the economy to ensure that we have underserved population have a gateway to the middle wage jobs. The medium of the industrial lands really should be about that is it is an economic development tool for underserved population to gain middleweight jobs in The Last 5 Years. The manufacturing sector has declined by 4% in the longitudinal study is pretty clear that Seattle is a knowledge-based economy. But the cost of having such a dominant economy, the knowledge-based economy is that we have not paid a whole lot of tension on the middle wage job to Blue Collar the industrial related manufacturing jobs. Answer the public policy question for the city is is that important value? And if so, then it should be reflected on our industrial. I'm in the interest of our complan. I'll leave my comments there and then if there's specific questions, I'm happy to dive in. Thank you. Sault Saint Marie Sapphire again from obesity in this phase of the work the primary focus is a very close relationship and working relationship with OED in a way that economic analysis that looks at what the future of industrial lands are and I are going to be in terms of job-creating uses. And how do we tie the land use regulations to actually supports that the slight difference from if you recall the last efforts here is the mayor has emphasized that we need to focus on and middle wage jobs in in that the analysis that we do as well as the regulations incentives that we create through land use policies. That is the North Star that we looked at. The number of issues at the last time that we in the last scope. This one is very much focused in that area. So the primary work from the land use perspective that my office Would be coordinating with all your DMs. Would be one a very quick initial economic analysis that really tells us what the future is going to be like the previous analysis. We put up a baseline data of what we have today that was you know, a couple of years ago when we did the economic analysis on OLED conducted so we are we're going to updates that we don't understand. Why are the new feature in the Stream job grading types of users are and then in bed very strongly racial Equity glance as part of that conversation that we make sure that we promote such as Bobby said inclusive industrial economy in inclusive jobs. So what that means is we need to really have a robot focus on the analysis of the data and information that we get then we use that to help inform the lawn use decisions zoning or incentives that we A major component of that work would also be the environmental impact statements and some of analysis from the economic study then will help us shape a wide range of options so that you do decision-makers could have choices and you are informed by those range of uses throughout throughout that he is our environmental impact statement study and then concurrent with that in working Not only was asked. Bed with OLED and other as sister departments. We want to explore what it means to be resilient in an industrial land area from an environmental perspective. Why would also addressing the number of the other job-related uses against of the major focus of that will be strengthening to our land use code zoning and incentives to understand how we support Seattle's industrial Maritime sectors of the future not just only today and then As I mentioned promos any inclusive industrial economy, and then major component of from a laundress perspective would also be to inform industrial lands on the line is decisions that you will be making as part of the comprehensive plan amendments and other decisions and primarily, you know, some of the proposed Stadium overlay District which you'll hear from the performance at the Armory side and Interbay is a major play. So we need to have again comprehensive strategy to decide how we address those issues Deportes transition on Terminal 46 into a cruise ship berth. That would have a Major Impact along the edge of the Waterfront. We went to have we want to look at that and and through. Comprehensive strategy. And then as Chase my shin at the station area, so I'll be created within the industrial areas part of sd3 bills will have a major impact the simple Act of actually creating station Area Industrial Area without any zoning changes in and out by itself is a major transformation into will impact the area. So we need to get ahead of it in to understand. What do we need to put in place as guard rails as well as taking advantage of that infrastructure. So that's kind of a high-level overview of the work that will be coordinating. And of course as God would be part of that Diane will just briefly to tell her some of that work transportation is going to be very specially, you know, and Freight movements and other activities with an industrial area. Thanks Sam. Again. I'm Diane Weider with us. I'm in policy and planning and on the project manager for us. On this project. And of course anytime we're talking about growing jobs and changing land-use. We need to be thinking about transportation is an integral part of it. We will be looking at our previous planning efforts like the fight master plan as well as current planning efforts and the places where growth is happening. There's recently been at Magnolia Bridge study a Ballard Bridge study is in process State Legislature dedicated $700,000 for us to do Ballard and Interbay regional transportation system study and that will be part of this as well. We will be looking at not just the movement of goods and frayed and delivery, but we will also be looking at access to jobs taking into consideration as T3 station access and how people will be moving in a whole new way. Once the light rail system has been built out. Have you identify this? Like the specific stakeholders are going to be involved in the process the timeline for this and when you anticipate to come up with a policy recommendations working on finalizing the the details to that but I will say that one of the things that were very interested in doing is making sure that we're we're drawing forward or drilling out some Community ideas on this on this issue with the previous efforts. I think there were just one large city wide panel of stakeholders that helped inform the city's decision. We are interested in having a Citywide state quarter panel, but I think we're also very interested in informing some community-led stakeholders, right? So we'll have some folks take a look at it and specific issues around stadium in Soto and Interbay down in Georgetown South Park as well. And then Ballard was kind of thinking that the moment so Sew-in in the the timeline and when you think is that still kind of it. I think it's still kind of up in the air is going to take a significant amount of time. Right so I could see us finalizing some of this work early next year or into the to the early summer next year. And how do you envision collaborating with the council or future, we would love to have you guys apart of this especially as the spirit was performing lady Knight formulating ideas and doing our stakeholder Outreach and stuff. I think we would we would love your your participation in that process. Deborah Harbour Thank you. So this is really helpful. I appreciate folks all coming together letting us know what your plan is moving forward. It just a touch a little bit on the history of this effort. I think everybody knows that in 2016 the council passed play on docketing resolution that requested a group of stakeholders come together and make some recommendations likewise in 2017. The council repeated that request we actually got some draft recommendations and I think 2016 so I'm really interested to know are we starting from a place where we had come to before or are we to starting from square one? And I don't say so I just want to get a sense of where we're at. I'm not trying to rush the process. I really understand. The care with which you're engaging in these conversations almost a fifth of Seattle jobs are manufacturing jobs, and there's average as the mayor said in her letter average wage of $100,000 and this is an industry that we want to show great care for because of its place in our City's history and the importance that it has given to our City's economic resiliency, but nevertheless there is a long history of the council and and and stakeholders wanting to get a sense of where we're where we're going with these issues and recognition that there are a lot of a lot of needs for this particular industry. And and how what we can do using our land use code to strengthen it. Thank you. Cancel a great question, right? You know, I think we are taking a look at this in a way that we want to use those previous previous efforts to to inform what we're doing and to build on them. I think from our perspective a lot of things have happened since those last three Champions, right? I'm in touch with you about a few of them right terminal 46 the stadium District 2 Armory, right? So so those previous efforts are certainly going to inform and will be engaging people who are in those previous processes, right? So that's that's going to inform their there. They're thinking today. I think we just want to make sure that we're doing this in a in a comprehensive manner that reflects. today's world and not 2016 and when you mentioned earlier in response to a question about the composition of the group, I understand that you're going to be doing some broader stakeholder engagement in addition to You know what? We usually consider the stakeholder to this discussion. Will that will those stakeholders be integrated into this larger workgroup or is that going to be a separate a separate engagement effort? And in what? Can you tell us about like is there actually going to be a workgroup pulled together? How many people are going to sit on the work group? Who who are they going to be when you share that with us in advance of of the convening? I think we should we should certainly work together on that right there an impact your community and we should we should make sure we partner on those things. I think I would say it are at this point in time or our perspective. Our goal here is to make sure we've got both know the traditional industrial stakeholders non-industrial stakeholders and some community members involved in this process, right? And I think we should we should make sure we're working together though. Purchase to add to that one of our initial start in this process is being really to ask and learn from what worked and what didn't from the last process and we've already learned some lessons from that and I think it was a little too set of a single Community Advisory Group or Committee in one of the things that we learned that we really need to think about. The diversification of the stakeholder groups are Community groups in part because in a Ballard is different from interphase different from the duwamish. It's different from the Soto. So how do we think about in a strategically in terms of how we see those drug traffic areas in their industrial and then industrial lands and then relevance to that who are the rights appropriate way of engaging communities in those areas and then the second I think major difference is the mayor has said that have a very clear North Star in terms of what the primary objective of this ought to be. What we discussed earlier so those two will shape our engagement process. This is not going to be 2016 draft recommendations. Do they do these still work? It sounds like we are really going to be doing a full new set of reviews of an analysis of economic policies and and land-use analyses and racial Equity analysis. We're not going back to the group saying hey, this is where we left off. Do you still agree with these draft recommendations? Could I dress that a little bit? I think I think the important thing is that we will build on those previous recommendation. So there were some great ideas that came out of the last round of work around neck Salve uses and in a potential around stationary has kind of been a sub portion of Soto those those ideas will be one of a range of possible future scenarios. That would be studying. So decision-makers will have a wider range and really understand the implications on economic development jobs and resiliency of that concept alongside and other policy directions you could take Are there any further points? Well, thank you all for joining us for the discussion. We look forward to seeing more about this work learning more about this work and future discussions. Our next item is a briefing discussion and public hearing on the annual comp plan Amendment docket and setting resolution know would you please read this item into the record? Adam22 comprehensive plan Amendment docket setting I just have to be clear for everyone watching the conversation. We are kicking out today is about which amendments we would be talking for consideration. Next year. We are not making any changes to the actual comprehensive plan. We're just queuing up the settings for the next Council for people here to testify we're going to begin as usual with briefing and discussion on the proposed amendments and then open the public hearing falling that discussion. What folks around the table please introduce themselves? Michael Michael hubner long range planning manager Office of planning and Community Development will be CD. List what's in capsule Central staff of the sale Planning Commission? Good Morning America McConaughy on the council Central staff So we're here today to brief you on the proposals that Council received on to amend the comprehensive plan as far as their 2019-2020 docketing process. As a reminder, we have a. Between April and May when we accept proposals from members of the public to consider changes to the conference a plan. That's a reviewed by the Seattle Planning Commission and the office of planning and Community Development at Central staff and recommend you have recommendations attached to our staff Memo from SPC from the Planning Commission and from opcd. Then we're in the dock of setting phase where the council decides which of the proposed amendment should go forward for further analysis. Council's action council member Pacheco mentioned is not to say yes. This is something that we want to adopt but rather this is something that is worth studying more based on criteria that have been set through a resolution. Once the resolution is adopted the office of playing can you eat development will analyze the document proposals undertake environmental review and I make a recommendation by the end of the year and then first quarter of 2020 the plan commission and Council will review the opcd recommendations. There are seven criteria that we use to analyze whether or not a proposal should be docketed first day of school. Is it legal? Is it appropriate for the conference plan or is it better for for example of code Amendment or some other or rezone? Is it practical to consider it is it both is their capacity to analyze the proposal. Is it something that is such a fundamental policy change this better taken up as part of a more holistic. Look at the conference of plant has Heart by Major updates to the plan. If it's been proposed before have circumstances changed has a proponent shown that there is a reason to take up the question before again, if it's a change to Neighborhood plan has there been work done with with the local community. Is the proposal actually going to result in some sort of changed if it's not then maybe it's not worth spending stuff time to look at it and finally if it's a proposal to change maps in the plan rather than policies. Is it at a scale that marriage circumference of Planet Amendment or is it something where the proponent can just pursue a site-specific resume? Council has adopted a number of resolutions councilmember herbold mentioned a couple of them related to Industrial lands from our perspective those remain open without a final recommendation from the executive earlier this year the council adopted. Resolution relay to the mandatory housing affordability program and there were three amendments that as far as the resolution of follow-up items. The council asked opcd to look at changing the name of single-family areas in the comp plan looking at whether South Park really meets our criteria for Urban Village designation and looking at a new Urban Village at 130th and I-5 near the Light Rail station. And then alongside the Delridge action plan the Delridge Community identified a number of changes to their neighborhood plan that came out of that Community Driven process. And so looking at those changes to the Dollar General plan and the executive has some responses to those things and Michael. I don't know if you want to talk about that now or 2 ^ resolutions I'd be happy to yes. So first first and most important to highlight the erect the prayer was resolved request to with regard to the Delridge action plan and amendments for a recommended amendments to the Delridge neighborhood plan, which is in the comprehensive plan. So this was a long process and involving a very robust Community involvement and engagement that action plan did address and number of issues including a proposed recommendations to the neighborhood plants reflect that work and so it meets the criteria for a consideration of changes to the neighbourhood plan. It is something that is worth analyzing and bringing back a final proposal on based on those recommendations to you as part of this docketing Cycles. We are recommending moving forward up with that one. With respect to the the resolution covering industrial lands, I truly that several prior resolutions that allude to a number of different issues at first any changes to the policy language and the comprehensive plan relating to any clarifications of the criteria or process whereby changes to a manufacturing industrial center industrial and use would be considered and then in addition to that specific amendments to the Future land use map including a potentially saving District, which again is a code in one of the 14 proposal submitted this year. But also some prior proposals related to specific properties and Interbay and also in but the greater duwamish am I see and lastly the Armory sites all of these room play previously described to you in the in the prior. Items, we do have a process that is kicking off to consider in a much more holistic way or industrial lands policies. And we feel at this time that docketing those within this cycle does not align well with what is anticipated with that work both in terms of where that would be considered in what process that those would be considered within both any policy changes or any future land use changes, but also in terms of timing as staff indicated, we don't anticipate recommendations coming out of that process until it is at least into the early part of next year. If not mid a 2020 which way would be beyond the time frame that you would be considering these docketed Amendment this year and then finally the mha related and amendments they renaming of the single-family zoning or single-family land used in the in the comprehensive plan. We feel that bad is a that's a big Question and the name in and of itself absent considering what that might mean for land use policies to relate to written out color single-family a different name in the future. But that is a question would be much better addressed in the context of a more holistic look at our growth strategy and at the at the comprehensive plan, so that wouldn't be an appropriate question earlier or considered Amendment within the annual memory process which typically would have more isolated more smaller scale questions with regard to something as fundamental as what we would call that distinction between the annual review process and that speaks to the this idea that in the annual compliment. That's where we are supposed to be looking at smaller more distinct changes as opposed to a larger policy-based changes that affect multiple areas. What's up, policy procedure rather the criteria there were adopted adopted by the council itself off the top of my head that Lisha probably remember the number that relates to the criteria, but you've indicated that if there was another process other than the annual member process that a proposal will be better suited to be addressed within for that would be a criteria for recommending not to docket proposal want one of the way we think about that with respect to the difference between the annual Amendment and the and the and the major update of the comprehensive plan is the respect to which a proposal is relates to other policies and other aspects of the plan that are not part of the proposal itself. So this will be one of those where it relates to other policies in the plan that are not part of the proposal and thus will be much better suited to be addressed in a more integrated way as part of the comprehensive Plan update. The criteria that use a used to use that the council adopted. Thank you. I am sanna Derek. So there are a couple of other aspects to the m h a m m as one of them as well is looking at South Park and the other considerations regarding South Park and its alignment with the criteria for urban villages in in the plan as part of the major major update again, we anticipate looking at the growth strategy in a more holistic way including looking at data related to all of our Urban Villages and centers and this would be a question in terms of which set of villages and sent her she move on into the future which we better addressed in that process in a more holistic way with respect and finally to the 130th Light Rail station. We have Community planning process of stationary planning process underway right now that is looking at a range of alternatives for that station area, and we do anticipate that the prospect of new Urban Village being decimated around A Street station is it would be want one of those ideas that would be evaluated through that process, but it's just not timely at this point to put it on the docket for this cycle. Again, we don't anticipate that that work will have concluded in time for consideration in the early part of 2020. It's horrible as it relates to the the requested docketing for South Park and whether or not it should be classified as an Urban Village Under current Urban Urban Village criteria. What you're saying is that we should not ask and try to answer the question whether or not Southpark is properly designated as an Urban Village Under the current Urban Village criteria because we are going to be in the future re-evaluating re-evaluating whether or not the existing Urban Village criteria are the right ones for all Urban villages. No, I I will I wasn't necessarily saying that we would be within the scope of the major update considering changes to the criteria themselves, but rather the criteria related to both quantitative and qualitative considerations when the original designations were made for each of the the urban villages in urban centers and that and Analysis of any individual Urban Village at this time is that is much better addressed with respect to how other Villages are also relate to those criteria that are currently in the plan. Now the major update May indeed address updating a revising those criteria, but even if his crate criteria didn't change is much more of a of an across-the-board evaluation of how our centers are performing and whether any changes might be within the scope of the Plan update rather than just looking at Have a question of whether or not they're properly classified as a religious. I haven't heard that this is a problem in South Park. I've not heard that about mother. We haven't done the analysis of the work right now and it's and looking at one. Urban Village in isolation is not what we think is the appropriate way to address that question rather. It is with regard to the urban Villages as a whole. I'm going to continue to ask some questions about this as we move forward. Thank you. So the council received 14 proposals to amend the Comforts of plan from members of the public and we split them into map amendments and policy amendments to serve help Focus discussion. There are five proposed map amendments to new policy ideas and A7 policy amendments that have been previously proposed those proposals the applicant didn't demonstrate a change of circumstance. So they do not meet the criteria and I'm we're not going to focus on them. The five map amendments Eric's got talked about. I just walk us through the slide to see them bring a1267 and 12 is refer to the numbers that were assigned to the events as they were submitted and the dress up two different tables of one attached to the memo and also the clerk file. So that's just to clarify that if folks were to jump into the video record here and wonder what are novel numbering system is just refers to the numbers used as names of these amendments. So there's five total the map on the phone and then the other four one just adjacent to downtown. That's the stadium area and the other is kind of more in West Seattle. I'm at one of this would just ask for change of The Flume from low-rise one to low rise 3 as you can see for 5:01 to 4509 Southwest Admiral Way. The first two would ask to extend the Northgate urban center to uncouple these Parcels pumping out a little bit to single-family to this is a single-family to multi-family change. I'm in the number six asks demanded the future land use map from single-family to multi-family for this property address on Alki Avenue Southwest. The number 7 would establish a stadium District of these new boundaries as shown in the dashed blue lines on the right hand side that's submitted with the proposal and also would make some policy changes of call number one to establish the district into to allow residential and lodging throughout the District 3 President Ford Sport the continued success of industrial operations in the duwamish manufacturing industrial center spends called the mick. And I finally the 5th Amendment that deals with the future land use map is afford to Providence Mount Saint Vincent Vincent a property. This would have been the boundaries of the West Seattle Junction Urban Village. Can you speak to learn more history and contacts to this specific this particular moment recently with the changes the the boundary of the Suburban Village came right up against to this property but does not Encompass it and so the blue that you see is the the boundary their Village in this change wood would a compass that property and I haven't property in Urban Village it would make it possible to do different things in the property. So there are two policy amendments. The first would be to amend the transportation element related to TNT's and delivery trucks to provide significantly more detail regarding those modes of transportation. And the second is to amend policies in the transportation environment and parks and open space elements related to trees. and the definition of the urban Forest our staff recommendation is to dock at the change the Northgate urban center boundary and the Providence Mount Saint Vincent change to the West Seattle Junction boundary to dock at the stadium District in the context of the ongoing industrial lands work. There has been a previous Stadium District proposed The Proposal that was proposed this year would more Bradley allowed residential uses throughout the stadium District or recommendation would be that the team this working on Industrial lands considered both of those proposals in the context of broader industrial lands policies. And not to dock at the remaining Amendment says they're the policy changes are more detailed than we would normally see in the conference to plan and I are probably addressed better by specific changes to for example are Street. Use policies are on freight master plan and through changes to regulations relating to trees rather than the comp plan Amendment. Thank you. I'm fairly certain that we were aiming for this annual review to include docketing the project list associate. The recommended project list associated with moving forward a proposal for impact fees Transportation impact fees. And I know that our project was was challenged and it was supposed to be heard the hearing examiner's just wondering where that is and whether or not we can expect to consider that in this in this docketing process. I seem to recall that the Planning Commission was at indicated earlier that it was supportive. The hearing examiner carrying happened earlier this month. So we're waiting for the results. We are exploring whether those amendments could be taken up alongside the budget the growth management act allows for Capital Improvement program, which is related to the which is technically part of the Comforts of plan to occur during the budgeting process. So it's possible that those would come up this fall during the budgeting process. Otherwise They would probably be considered next year. Are you saying that because we're not expecting? get an answer from the hearing examiner in time for our Time frame for considering this particular resolution that will need to act on by mid-august generally the once-a-year that happened this past bring alongside them into Troy Housing affordability. So it's it's possible that the impact be related and then that's what happened this fall. Otherwise, they could happen next year. Could we cover our bases back if we're not able to move forward in the budget process, which of course I would support, but I think there's a little bit that we don't know yet. Sure. Thank you. So in the past I know open CD has recommended for balcony in the stadium district, and I know that I appreciate that the Bears perspective in terms of wanting to hold off until you know, we can do that industrial lands work. I guess it seems to me anymore. General contact said it would make sense for OBC for us to dock at this proposal to create a say in District. Now while simultaneously doing the industrial lands work. I mean, I'd I'm just I know spcd the Planning Commission has recommended the document as well. And so I'm just kind of curious how I guess where I am. I making a disconnect here. Where's the disconnect? I think it's both one of where their work resides and also in terms of timing and I think I alluded to this singing and covering more generally anything any of the proposals related to Industrial lands. So this does we do as an as well as described to you earlier. There is this process which is more holistic more than a different track the annual mammoths that is kicking off. The timeline for that work is quite likely to extend beyond what we could feasibly than complete and then Ford recommendations for a new legislation and environmental review. That would be necessary to fit in with the dock at this year's or really it's a question of of of a timing with respect to that other process that is that is for the primary hard bottom line here. Now that doesn't mean that an annual Mehmet process in a future years such as the docketing process that begins next year might be kind well to have any recommendations coming on the industrial lands work would feed into but it really just is not timely and right we feel at this time to put on the docket for this year. Emerald thank you all for being here today. Appreciate it. I will not open the public hearing on the comprehensive plan Amendment docket setting speakers are limited to two minutes of public, Neva speakers, Nick season 2 minutes. The microphone will be turned off. and we will start with i Jeremy Wang So for now, thank you. Annexin Arliss is Sarah Cameron. John's first and Sarah. Sorry just giving you clean it up. Good morning. My name is John persak, and I'm speaking on behalf of ILWU Local 19. Just wanted to comment on amendment number seven of the comp plan. We are in opposition to that being docketing. I was able to participate in the last round of discussions run industrial lands. It was a very data-driven discussion. I think part of the reason why a lot of the work wasn't complete was because there was just a lot of data that really needed to be retrieved and understood before we can have a real conversation about what needed to happen. And unfortunately, we just ran out of time one thing that did come out of that process and that's then this is memorialized on the LEDs website is that housing in the industrial lands areas is a non-starter the stadium District proposes to put housing in the industrial and so I think that's the major contradiction that Used to be looked at so I appreciate your time and look forward to for the conversations and willing to provide input wherever it's helpful. Thank you. Thank you, Sarah, Cameron. I'm Sarah Cameron. I'm a chief strategy for Providence Home and Community Care which includes Providence Mount Saint Vincent also known as the amount the mission of Providence calls us to serve as a as expressions of God's healing love to all we serve especially those who are poor and vulnerable as Charlene mentioned previously. The mount is a really special place for residents patients Providence caregivers Community Partners children the sisters of Providence and really the whole Community everyone is welcome at the mount in the spring of 2019. We start exploring options for upgrading the nearly 100 year old campus to expand existing services and assess how to honor the legacy of our Founders for another 100 years. It was during this time that we became aware of the comprehensive Plan update in the company land use changes and are here today to request them out the included within the West Seattle Junction Hub, Urban Village based on our interpretation of section 7 of resolution 31 807 We believe we meet the criteria to have this comprehensive plan Amendment considered her motivation is to create flexibility in our development planning to honor the 163 your legacy of the sisters of Providence and ensure we meet or exceed the mandatory affordable housing requirements associated with our property. I'm also West Seattle resident and parent of two young boys who attend the mounts intergenerational Learning Center. I'm sensitive to the to the challenges associated with parking traffic and density Management in West Seattle and can assure you that parking and traffic will be assessed and included as part of our Master site planning are the parent one of many things. I also love about the mount is how integrated the kids are in the campus and in the broader Community just last week my preschooler walked to a husky Deli. They're going to dim sung by bus later this week or next week and they take the bus to Alki and across the city really on a regular basis. So again, I appreciate your time and I hope you'll consider the amount as part of the Seattle Hub Junction Erickson Good morning. My name is Barrett Erickson of the Workforce Development director for the sailors Union of the Pacific and I'm also a member of the Seattle King County Workforce Development Council. And I wanted to speak in behalf of the mayor's position on Industrial lands use and also against docketing amendment 7 particular wanted to speak about the Workforce Development plans and strategies that are being developed around the Seattle King County Maritime sector in the importance that the industrial lands play to being able to create the Workforce Development and education system that's necessary to provide the training for the young people that can work in this area. So that's pretty much Essential. I have to say it's being worked on. Public and private Gatherings all throughout the city and the county it is a very it's there's also some federal things going on that I've been working with our advisory committee at the federal level having to do with the developing more Port infrastructure, etc. Etc. That will create more Workforce opportunities and for that you need industrial lands. We can't lose it. Thank you. Next on the list is Charlie Royer. Thank you. Mr. Chairman. I'm Troyer. I'm a board member and a half share of the public facilities District, which is the owner of T-Mobile. Now, I'm here to support the recommendations of council Central staff in the city's Planning Commission to docket now the comprehensive plan Amendment 4 review during this cycle as council member herbold suggested there been several stakeholder committees to study the industrial lands issues and they've all made right they both have made recommendations what you're now part of our proposal but two former mayors twice deferred action on those proposals deferred action in the face of Rapid change another Sports facility recommended or disgust or the stadium for the stadium District major shifts and governance and operations of the port of Tacoma, NC. And lots of talk about the need to address transportation and Freight mobility, which is now underway. Now that things might be selling a bit. I'd like to just post two questions for two suggestions for your consideration one. Get our proposal and help us find a better path for achieving the marriage priorities and the needs of the port the mayor has recommended against docketing are proposals to 1/3 stakeholder committee Goodwin 18-24 months Citywide study Industrial in Maritime Zion study. The study will likely find what other Studies have found that there is no industrial land uses in the stadium District effort docketing will not affect the mayor's plan to do a Citywide study. Secondly, the mirrors along timeline is going to produce an opportunity to shape is going to preclude the opportunity to shape a large piece of land which is very soon going to be surprised by the state. The waska property is property could be snatched up by Developers for other uses. So I'm just saying to that today that that read our doctor's proposal. It talks about housing help us find a better path for achieving the marriage priorities in the needs of the poor Workforce housing industrial and a maritime jobs a mixed neighborhood safe and clean that will take charge of change in the future and not be frozen by it. Thank you very much. Next is Fred Mendoza. Good morning, and thank you for this opportunity to present. My name is Fred Mendoza on chair of the Washington state public Stadium Authority the owners of CenturyLink Field. I'm here to support an indoor recommendation to docket the stadium district for the current complan cycle further delays are really unnecessary as council member her bold point this this Stadium Authority has we started this a years ago and we have talked and talked and talked about it. It got all the way up to the council a couple years ago and I submit to you that nothing new will be learned by the city's proposed four-year delay in making an Ultimate decision. You can't take and her Bae and you can't take Georgetown and plug them into a common study group with the stadium District. I have to make a confession that 8 years ago when we started this process internally. We just started calling at the stadium in the stadium District. That is an unfortunate moniker. Now as we look back because it conjures up ideas of Las Vegas in bright light. This is not really a stadium District. This is a this is a district that is composed of many constituent neighborhoods. And it begs to be stitched together in a comprehensive manner of by the council through its land use tools many changes are happening even as we speak and since the economic study was completed a couple years ago more changes are being made the poor just planning to do something our neighbor to the west. The viaduct is down. I look from the stadium the other day and saw that you can actually see the water now so all of these changes big immediate attention by the council in an intelligent way to design The future of this area we agree with everything that the staff has said today about the need for Workhorse Workforce housing and housing and more vibrant infrastructure, but it needs an intelligent design for that infrastructure and it has not been made by the overlay, which is run. Its course. It did what it was supposed to do. So, thank you very much. Look forward to the opportunity to continue this discussion again, please. Get this Next on our list is sorry. I can't from herbal inquiries about the past work that has been done as directed by past councils and implemented by past mayors was not to suggest that there was nothing more that could be learned by further engagement. It was more just to get a sense of where we were going to be starting this new process whether or not it was going to be from the last set of recommendations or with whether or not we were going to be starting from from square one and also really interested to know of those old recommendations. There's anything that there's strong enough consensus around that that we could use this talking process to talk about. Thank you. Next on our list is Tia part of it. Petrovich. Thank you council members. I'm here today in support of amendment 7 the stadium District. I am the board president of the Pioneer Square residents Council summer residents who could be here today in mini obviously working. I bring the residential voice and we have a letter to read in to record and support on behalf of the board of the Punnett Square residents Council. We support the plan to create a stadium District as an independent land use classification includes 3,000 people who called Square their home. We are a very diverse group of property owners and renters who keeps Seattle historic vibrant safe and thriving the stadium District would allow more housing and Greater Community in South downtown The Proposal would create the opportunity for future developments in areas adjacent, Pioneer Square. ISpy create a strong sense of place in a Viber mix of housing open space retail New Concept industry and pedestrian-friendly streetscapes for residents sports fans and tourists. We are particularly interested in the future development of Housing and green space on the waska property is properties previously recommended by the stadium District Staples committee, which I sat on convened by the city several years ago. We understand that wash. May sell the waska side as early as 2021. If the area could be rezoned from industrial to Independent then housing including Workforce housing and green space meaning a park. This could be realized introducing a mixed-use plan will improve the safety and well-being of all who live work and play and Transit through the area and increase residential base help Revitalize Pioneer Square just a few years ago and other Stadium mixed-use neighborhoods have enjoyed similar success. So the ask send the stadium District plan to the full Council for consideration. We want the conversation. This planned a strategy deserve serious consideration because it can strengthen the physical social structural and economic conditions of South Seattle where we live working play. Thank you. Thank you. Next is Eric Fitch. and neck Says Megan Cruz Thank you trip check o cast member her Bowl tie-ins Eric fish here today on behalf of the Port of Seattle in Northwest Seaport Alliance has a special purpose government charged with operating the States international trade gateways Fisherman's Terminal turn on 91 and the critical Supply chains associate with these facilities and me to express that concern the port in the seaport alliance with the proposed Stadium District, plan Amendment we respectfully or do to delay consideration of his proposal until is the mayor has suggested the city can convene comprehensive cty processed update our industrial lands planning framework at the Port we have long advocated the need to undertake such a holistic review. And we appreciate the mayor's recent letter to Counsel on this topic just heard from her staff on their plan to convene a deliberative process that were view a range of issues important to the manufacturing Maritime and Industrial sector, then we partner we agree we support this approach. We were glad to participate in the industrial lands panel that was convened by the previous administration. Unfortunately the good work that was done by that group was left on We look forward to a fresh start at the port in the seaport Alliance. We feel strongly that the completion of the study must proceed consideration of this amendment was or any proposal that reduces the Region's industrial lands base affordability issues in the city are matter of daily discussion. As you know, part of that discussion must include focus on living wage jobs, like those jobs that are supported by our City's industrial and bass believe the preservation of Marathon manufacturing industrial lands is critical supporting living wage jobs and the vital and diverse economic sectors on which the city was built. Jobs in the working Waterfront in the Norwegians manufacturing businesses pay a wave that can support a family and often don't require a college diploma. We work with the city on Workforce training initiatives to ensure that our constituents can gain the skills to work in these sectors with a specific focus on engage in communities of color and low-income communities. We encourage the council to take this opportunity to work with the mayor's office and consider ways that we can all collaborate across levels of government to support the working Waterfront. We look forward to the opportunity to revisit the industrial lands conversation with the city. We thank you for your consideration. Thank you. Nexus main cruise and after Megan is Steve of Stella to add tncs and delivery to the multimodal planning of the comp plan. Although it wasn't recommended for docketing two of the three reviewing bodies of the Seattle Planning Commission and opcd did recommended be considered for the major update to comprehensive plan and scoping for that will begin shortly and I'd like this committee to please recommend that it moved forward to scoping both to the mayor and to the full console. If we don't measure the impacts of these two disruptors will never solve congestion or plan for adequate infrastructure the numbers that can telling we know that in 98104 the district at this building is in we have 10,000 TNC trips a day average of the streets and 101. 17000 for every mile a solo driver in a car puts on the road at EMC puts 2.8 miles on the road. So chances are growing 30% Annually. It's it's a problem that if we don't get our hand out, we will never solve numbers for the delivery trucks are all so compelling the city's on Research says delivery trucks will double by 2023 and yet we're building new towers that'll hold a thousand residents without single loading burst and with 50 to 60% or 80% of the units having parking spaces. So by the bottom line is the only way to address density and transportation problems is to include all the factors. We need to add 10 C's and delivery trucks to the multimodal master plan. That way we can create data-driven transportation and infrastructure policy. Thanks for your consideration. Numbers 2 and 7. I'm more familiar with the 12 but I think the same problem goes through. This is we don't have enough citizen involvement. Everything is pulled way for the mighty mighty stakeholders part of government's job is to take a look at some of these whiz-bang proposals and say how does it fit into the city? Does it really work now? Some of you might remember that just recently they were some changes for the North Precinct and how well the neighbors around their felt. They were treated by the city. I would suggest around Northgate you may get even a bigger bang and so I would suggest before you start seriously changing zoning around Northgate expanding zones creating more Super zones where you'll have even less control over the long run. But you start taking a look at the citizens who live around there not. Mighty mighty stakeholders or people who have some other interest Seattle citizens do feel like we've been ignored. And you want to take a look at Stadium District industrial land is probably the most vulnerable and we have in the city cuz when you make it multi-use what generally happens is guess what the more? Intense the one that yields the most money takes over and so before you start removing industrial land. I think you need to do the long-term look because Seattle is not going to replace it. And what kind of a city do you want or is that your relevant is? It's all zoning is to be done when somebody comes to the Wiz bang plan in a few dollars. Thank you next Mako Winkler chin. Good morning council members in Seattle Chinatown International District preservation and Development Authority supports docketing the comprehensive plan Amendment proposal at 7. I don't need to tell you that that kind of changing quickly and in 2013 the city convened and we participated in the stadium District Advisory Group to discuss potential changes for the area on the group specifically discuss the Foraker huasca site and you know in 2013 that idea getting through Highway 99 rebuild in the viaduct coming down seems so far off in the future, but we're there now and now that that's done the Wasco site could easily be transferred in 2021 and then also seems a little bit far off but it's really really not so we believe and we are requesting that the city not lose this opportunity. But yet docket the amendment as part of the comp plan and docketing it through the comprehensive plan Amendment. Cycle does not preclude it from being discussed in the industrial zone or the industrial lands conversation as well. But don't lose the opportunity on the waska site. We asked you to Duncan the proposal and thank you. Next on our list is Dave jaring. Yeah, my name is Dave Garing. I'm the executive director of the manufacturing Industrial Council Seattle. Very nice to meet you in New council member. I have been through every industrial land use effort and stakeholder process since the growth management. Act was adopted that goes back to that 1998. I wish we had different scheduling issues because I'm Express great support for the letter and all those years. I have never seen a better letter that's better informed by elected leader on this issue. I really mean that this group that just met her. I think it's tragic they left before they had a chance to hear this input terrific job for you and my what I am and I'm sorry for Charlie in the stadium District I think taking place but we're picking and and taking little tiny bit. Of industrial or just the Classic thing you're not supposed to do. So, we're going to find a way to took. Dr. Charlie, maybe there's some things that we could speed up there because we know what research has already been done. I agree with all of my friends from labor. There was tremendous work done in the last cycle all still sitting there the consultant who did it has his business in the city of Seattle would take almost nothing to get that all together again in a week still have a way different idea of how feasible and what the schedule when we free search Rasta someday do a Freedom of Information Act on that that sale of the property of the state cuz you learn more about industrial and easy shoes than you will in almost any other process and kind of underground artworks. I'm just going to totally agree with what everybody said about Workforce Development. This is what we have never figured out in the city of a hundred and 60,000 industrial jobs within the city limits of attrition and the American industrial economy is about 3 to 6% a year. That means turn over a hundred thousand jobs. Housing job openings every year we're doing almost nothing to connect our communities that we're all worried about with those opportunities. My office is at the Georgetown campus the best Apprenticeship Training Center from here to La here to Chicago. It's empty almost all day long. You could be training people there to get these jobs for whatever reason that hasn't happened yet. If you work for us, we're going to help you figure out how to do that. Thank you, but it really is sheer and kudos to the man this new stuff cuz I think they just did an excellent job. Thank you. But is there anyone else here at live like to speak for public comment? Seen it there. No additional speakers. You can be sure to sign in to apologize for not signing in as a percent. LW workers in the porch from Bellingham to Olympia, completely against amendment number seven this issue. We seeing all the ports up throughout the state industrial and pressure to develop those lands. This is a bold Vision this plan, but it's an industrial and grab we we need to preserve these lands. We've been working on this for years words matter in this in this. So I've heard Stadium District mentioned multiple times. The majority of the project is going to be done in what is called the stadium the transition overlay District. Okay, that's a buffer zone that was intentionally put there in the early 2000 to separate the stadiums from the industrial area. It's worked. Well for 20 years almost 20 years. We need to preserve that so I'm against the amendment 7. Thank you for your time. Thank you seen as we have no additional speakers. I will not close the public hearing on the grounds of plan Amendment Docket in setting I think everyone who had some of the applications and he joined us here today in the coming weeks. I will be introducing the docking resolution and will be working at the next plus committee meeting on August 7th, and there's no more discussion for now. We will now move on to the next item action item item of business. Today is a brief discussion with scci on their permit backlog Works know what you please read this item into the record agenda item three Seattle Department of construction and inspections permit backlog update. Sorry, I was rude to see for Noah. I apologize. Would you please introduce yourselves and kick us off? Hi Nathan Wilson director of the Seattle Department of construction and inspections, sdci. Andy Higgins Engineering Services director, sdci So I think you can't remember Pacheco for asking us to come today to talk about the things that we're doing a test ECI to address their permit backlog at our department. We're obviously extremely busy and continue to have high levels of permits that we are doing several things to address that issue. Thanks Andy just a reminder of our purpose and values and to continue. So we have a budget of 85 million dollars and just a reminder to our TV audience that 91% of that budget is funded by permit fees. We issued over 51,000 permits and 2018 but not only are we busy issuing land uses construction permits. But we also have a very active role in Code Enforcement. We have a very robust a rental registration inspection ordinance program that counts member herbold was very instrumental in helping adopt and get through Council and we do a lot of work with our landlord and tenant community and we have a lot of new tenant regulations that we help enforce and educate the public about I just looking at construction permit intake volumes. We have been at record levels since 2015 and our Peak was a 2016-2017 where down just a little bit but admittedly does intake volumes have been difficult for our department to manage. So we're not just taking informants. We are issuing permits and there's a huge emphasis in the city right now to keep up with a job growth that we've experienced. And so that people who want to live in Seattle can live in Seattle and can live close to those jobs. We have issued over 69000 gross number of units in the last 7 years housing permits and just comparing that to San Francisco. Maybe not the best example, but a city with a much higher population than Seattle and we're issuing over double the number of housing units that they are in that City. So getting to the main focus of the presentation, I think everyone knows and April of 2018. We launched our new permitting system, excela pics of a platform and that was in parallel with some major Seattle it consolidation efforts in the city in the city. Obviously that rollout was bumpy and I apologize and take responsibility for that. A lot of people said why couldn't you have just fixed or improved Hansen which was our previous system. The fact of the matter was that that pretty previous system was the date on supported and was actually failing de lezo is very important that we migrate to a new system Excel allows for a Citywide platform. So we can integrate Services across several City departments and other departments are starting to add onto that platform at the end of the day, it will provide seamless process for applicants who are coming into the city and touching Multiple departments as they get their permits. It will allow for better automation as I mentioned more efficiencies and will increase at coordination with other departments. So the rollout negatively impacted our customers and also had an impact on people who aren't necessarily our permit applicants by people who are tracking permits. I'm in one understand what's happening in their in their neighborhoods. We immediately responded to that. We created a short-term customer support team to respond to the immediate issues that we're coming in we gathered customer suggestions for improvements. We created short videos on selected topics to help applicants do the system. We added staff to our help center and we have met with a variety of folks a stakeholder groups. I like the Master Builders the downtown Seattle Association, but we have also met with resident groups. We recently met with some folks who live downtown and have been trying to track all the Development that's happening and help them guide their process to excela. Thank you. I just want to flag a glitch or 2 glitches that my staff have identified in their efforts to deliver constituent Services one is that every record shows as is expired for the permit records permit expiration. They all show as expired as of 1-31-18. So I get every permit shows as expired and that makes it really difficult to track permitting issues. And then secondly the do the due dates in the review section are often incorrect when we when we check the staff at Andor labeled as TVD. So again, these these glitches make it really hard for customers and neighbors to determine what to do in and where and when in so I'm just highlighting those I'm sure you've heard about them as well and an inflamed already been cracked. I apologize for raising them here, but if not, I would love to get a sense of when that when those Corrections might be made understood actually a great transition Eddie Higgins. Who's that had to have our Engineering Services Division is going to talk about our recent $3000000 investment. To help continuous improvements to Excel and he can help address those issues so find very specific issues and what's causing them so that we know what the root causes are and can identify how to fix Ezra causes. So at the expiration date thing is a new thing to me. I don't know that so maybe we can follow up later on the details about that. The project due date issue is an already identified issue in our old system. We used to have a internal due date mechanism or we could assign internal Target dates for review staff versus having a external cycle Target for all reviews to be completed by cycle. And that was the information that the public could see. Unfortunately when we went live it it that went away that distinction went away and the internal information is what it was now presented to the public. So we're actually in the process of trying to upgrade that and it's one of the issues that we've identified two. So yeah, what Nathan talked about was after we rolled out our new system, you know that had compounded after years of back-to-back-to-back record volumes as well as about a five-year project to implement this new system during that five-year project. We had a technology for you. So we weren't able to make any improvements to the Hanson system other than emergency issues or legislative to address legislative issues. So we really weren't able to continue along our path of continuous Improvement as we had since we did the perk real effort back in the 90s and all of the process improvements we've done since the early 2000s so that put kind of a delay in what we were able to do but we had planned ahead for a project right after go-live that we called our prep 3 project that was intended to go through the end of 2018 for six month. To continue to roll out improvements to the system knowing that we weren't going to implement a perfect system and net worth are going to be some flaws what we've done with this $3000000 an additional investment is extended. Project through to the end of 2019 with the hope of being able to support on going into continuous improvements through Seattle i t i having enough resources to be able to support us in that effort along the way we've we've had a lot of conversations with constituents at all levels individuals applying for permits for their backyard Cottage or their detached garage vs. Master Builders are coming in as repeat applicants AIA Downtown Association, the others really great feedback some general some specific the specific feedback were able to address and we have a list and prioritize issues that we're trying to address through this project. But some of the some examples are working to bring back the shaping Seattle mapping application and expanding the functionality of that allowing applicants to add contacts and then delegate Authority within the records so that if you have an architect and sub Consultants working on a project they'll be able to Stop project and respond to their various components Auto assignment of Records. So that staff can respond more quickly and directly to those responses reassigning are reviews and I depart reviews during intake to specific individuals. And what happens here is that now our system the one benefit of this automated system is that we are actually really able to reduce bottlenecks that existed before where we used to have to touch applications after we screened it in after an applicant would pay to then bring the project in manually the system now automate some of those processes so as soon as an applicant pays if she fires right into the system and all the previous information that was set up Kicks right into our process and eliminates those bottom exit. We have control over some of the other things like Mason Dr. Daughter the interactions with other Departments of streamlining both process work clothes and system work clothes. So that applicants can have a single contact record in the system similar to your Amazon account or other accounts that you use online. And be able to report our apply to different departments for various permits through one portal rather than having to apply at each department individually. It'll allow us to have better reporting and performance metrics which are helping us identify further bottlenecks in the system and then proactively identify the subsequent bottleneck that'll be created by resolving the initial bottleneck and then also allow us to more proactive address and and I respond to legislative driven enhancements like vacant buildings in demolitions EV Readiness Sarah. I just want to put it in a quick plug for that shaping Seattle website, which people loved and instead of going through our permit tracking database. You could go to a map and just click on it. Send. It was very easy for the public to navigate. So we haven't been able to update that with excela, but we are working really hard on that. We just had a presentation on that yesterday and it's a new shaping Co All the even better cuz it will not just be design review projects, but it'll be all land use and construction permits. And also wanted to talk about the land use information Bolton. We know that's an important resource for the development community and for the public that's our twice-weekly notice of all permit applications and land-use decisions that have a discretionary component where the public can engage. When XLR went live a year ago that system had some real challenges we immediately fix that and it's better than it was before in that the public can actually do a search query where they can do like Within These two months of the land use application notices and decisions. So it allows a lot more query ability for the public to look at those applications at decisions and the shaping Seattle Apple then go even further and be able to allow you to do within a certain area or within a certain zone or district and everything is well settled to provide enhanced functionality herbal. Okay, so some of the current state and and what we're seeing is Trends in the Outlook going forward. Obviously, we would be in a week and Courier that timelines for intake station to remain high. There's a number of factors associated with that the the change in the 2015 International codes adopted January 1st, 2017 created this into amazing vesting rush in the last quarter of 2016 that really took about eighteen months to get through not only the initial plan a recycle. But all the correction Cycles to get a lot of those permits out the door. So with that the energy code changed significantly along with that which is I think why people tried to get in the door with complete applications ahead of that adoption date, but it really it doubled the backlog at that time. So really those recent past experiences people have had with our department have been somewhat a result of that and I also in combination with the result of increased turn over and retirements and backfilling and other things that go along with that as well as our Police last year of excela but the Outlook I think looks good going forward. We've added 13 limited turn limited contingent budget Authority positions mostly in the zoning review location, which has been our primary bottleneck in recent memory. We've adjusted the fees in 2019 to fill some funding gaps and also to shore up and add to our Core Staffing Reserve so that during the next downturn able to keep stuff on board so we can get ahead of the economic recovery and not be the the bottleneck there. Thank the mayor and Council for their support on the fiend funding changes in the last budget cycle that will be huge when we have the next down. Turn it up Tick. Can internet services specifically were also underway and hiring processes for building plans examiner's starts with plans examiners and our permit Specialist Group that do are pro processing and we talked about the course. So this is some of the data that is just reflective of the last year you can see this is talking about simple and medium projects in the blue and and then the orange or red they more complex projects that you can see the trend had been increasing timelines to complete 95% of all initial plan reviews until April of this year and you can see the trend now going downward. I think there's a couple of things going along with that a lot of the improvements we've made to excela over the past year are now starting to kick into effect and we're actually seeing some enhanced functionality and tools part of that has to do with much much better reporting that has been implemented since April and I were able to give to our supervisor so that the way they attack the workload is more effective. And getting through those permit reviews faster, we find that there's a huge correlation between intake to issuance timelines. There's two pieces that really have a huge correlation of that one is our ability to get to initial plan review quickly after intake and complete all initial Plan reviews. So we may have a number of initial Plan reviews needed on any given permit application from Gordon structural energy drainage geotechnical zoning and the list goes on so I cycle is when all of those reviews are completed and any one of those being a bottle that can impact of sorry can impact this number directly. So knowing that we are addressing our bottleneck location and Zoning as well as giving better assignment tools and reporting tool performance reporting tools to our supervisors that has had a dramatic impact since April when we had a big release an improvement on our reporting performance reporting given to her supervisor. So we're hoping that Trend continues in and work out. Cuz I'm horrible. So the number in parentheses for the key 2 weeks into months. That's the goal for all the goal. Historically has been 80% of simple medium projects completed within two weeks. And then the goal for the complex has been 80% completed within two months that was made in 2018. That was before lunch is right after lunch. And this is for 95% complete which we think is a more realistic Target to be shooting for because missing one and five is way less effective than missing one in 20. So this data is based on what our future goals are as to shoot for a 95% complete rate. Not an 80% complete right so that they're a little bit apples to oranges the two weeks into months. But our goal is to make that 95% complete number come dramatically back down big more realistic numbers are probably 4 weeks in 12 weeks, but that we're still working out. What time does this is her construction permits. This is not for masteries permits. to see how close we were to meeting our goal prior to launch and then secondly, I'm a little confused as to why despite I mean it from the chart. It looks like we're making progress as compared to when the peak problem was but as compared to launch, we're pretty much where we were at the beginning of launch and you know, I'd I just, you know good work here you're making progress, but I'm I think it really depends on what your comparison point is to be able to see that progress. And so I'm just it would it for me to be able to have some perspective on the complaints that we're hearing. It would be really helpful to look at what we were doing prior to me May 18th to just to get a get a handle on whether or not our our goal is really reach goal. And we've not really been meet. We weren't meeting it before the launch of Acela or you know, whether or not our performance really has a lot further to go in order to be meeting the standards that were surprised us even if not goal at not meeting goal practice and said what the expectation was of the public prior prior to launch so that that would be really helpful to me. My follow-up question relates to the expectations established just recently after passage of the idea legislation in the mayor's executive order. I believe there's a request for expedited permitting for adus is part of that executive order and just curious as to how you know what that go looks like and how we can expect to meet it. For sure, I think part of the issue here is just trying to meld our old data in the Hansa system with the new data in Excel at pulling the data from two systems and getting it to be a consistent. Good luck is hard to do still we're working on that though and I will say that since about 2015 that was about the last point. We were really able to meet the performance targets and we can show that in the future but I think ya since then with that bump in 2016. We have not been able to meet at my hope is that this trend is showing where we want to go and that we don't necessarily said our future targets based on our past performance. But like you said be more realistic to meeting expectations of the public and the people who are trying to obtain the permits from us. Where is something that's really important to the mayor we're working closely with opcd on having a pre-approved designs that will still have to be approved by our department but Applicants who choose to go that route and will have a much more efficient permitting process. We know how many applicants aren't are going to want to design their own tattoos, and we're also working on a more efficient process for them as well. So in terms of creating success for applicants are some of the things that we've been doing is trying to encourage increased quality of what were able to take in and then also be able to reduce the number of cycles that an application will go through so having to write Corrections and having complete responses resubmitted being able to court do better coordination for that. So some of the things that we've encouraged their applicant voting application materials when they are complete so that they can get in the door earlier on our website. Now, there's a news article put up on kind of on the front page about the intake express lane which has existed for a long time, but I'll often what will hear is that it takes a significantly long time to get an intake appointment. But what isn't clear to folks has that if they actually upload all of their and takes the middle requirements that they get on a list for an automated list for cancellations. So we're often able to actually take in submitted fully complete and submit applications within a two to three weeks. Not a 14 to 16 week. Which is Predictable scheduled intake appointment calendar has after folks that have that option. It's often that they have plans and things to produce after they purchase the property and so they like the predictability of having a calendar and scheduled appointment time, but others just need that expediency. And so we have another way for people to get in that often isn't well-publicized. I guess we're clear enough. We try to publish dark as well as we can but it's now we're in that article it sits up on the front page of our home site and hopefully that word gets out there a little bit more just to rephrase that a little bit a lot of applicants are putting in an appointment time months and months in advance and they're not even close to having a complete application ready. They want to reserve that time. And once they do have their complete application they can move up much quicker. exactly We're also encouraging applicants to utilize our free coaching Services often. We hear from small business owners that they didn't know that certain code requirements were going to get triggered like having to make accessibility improvements or not knowing that's the use and occupancy of the spaces maybe not allowed in the zone that they signed a lease for purchase the property in or whether or not maybe the the change of use my triggers sent alterations. So really trying to encourage folks to to come talk to us early and often I were here to partner with you and to help you understand what the existed permitted legal use in occupancy is the space before you sign that lease so that you know that you can put that that new intended space in there and I have to trigger a lot changed their also paid professional conferences so that if you do get into very Project Specific requirements, we have services available for folks to be able to kind of figure out exactly what they need to submit to us at intake to help increase the quality that And then also I reducing the time to obtain the permit with you know, that more complete application material submitted. This is an indication of this slide is mitigation of how long a cat from a calendar perspective permits. We'll go through the permit process from intake to issuance based on the number of cycles that it goes through the majority of permits and applications that we see are in the two to three review cycle range, but we do have a number of projects that go through multiple cycles. And sometimes that's the complexity of complying with the code other times. It's lack of clarity in our Corrections other times. It's lack of responsiveness from an applicant. So there's a whole variety of reasons that occurs. But one thing that we can do to partner together is to help get that Clarity and that complete response combined and try to reduce the number of Corrections Cycles so that we're able to actually issued permits in less cycle ended up in a shorter timeframe. So Sam ideas for processor for Minn Kota simplification. We do have an increasingly complex Landis building and energy codes and you know the land use code is 867 pages long. So it does take very careful review by staff to make sure that there are adhering to the codes the recently adopted mandatory housing affordability measures and verifications. They are obviously very important. It's a key policy initiative of the city, but that does require very careful and time-consuming calculations by sdci staff. So I'm just recognizing that Seattle has a very complex regulatory environment as far as ideas to help land. Use code simplification is an option that's time consuming and complicated but that is something that we can look at another issue that I know some electives have talked about is raising the sea. The thresholds right now Seattle Super thresholds are well below the state levels those changes would require Council review and approval and we are preparing to Pilot some new review and collaboration Tools Blue beam review is one example, and that's where an applicant and a staff review member can look at the plan and make real-time Corrections online. I want other wanted to add that we have presented to the mayor's small business advisory Council and also to the middle-income affordable housing advisory Council about the permitting process and that we anticipate that they're going to have a lot of recommendations to all of us about how we can improve the permitting process not only for applicants but also for the public I know it's just a loss of institutional knowledge by some staff members has as hurt seci. So we did receive contingent budget Authority we have in the past and we got additional contingent budget Authority from the mayor and from the central budget office to hire additional staff. Those aren't permanent staff. That's usually a two-year time. But what we have found is through that natural sort of attrition of Staff staff move on to other jobs. They retire those people who are contingent budget Authority staff are very well positioned and are well trained to take those permanent positions. So that's one way that were addressing staff retiring are moving on. I'll just say this is a constant challenge in every Department in the city with an aging Workforce some and bringing a new employees. So we're all ears are other ideas. And I think he'll recognize the fact that if you're able to hire in at the lower levels knowing that when the four levels. Retired there will be old kind of waterfall effect all the way through. So you're proactively backfilling for the eventuality that you're going to have that sort of natural attrition. And then those lower levels depending on the cycle. We we may slow down hiring if we do see a significant in a downgrade in the economy or he has slowed down in permit intakes. Okay. Well, thank you for the presentation. Looking forward to your hard work to dresses back on. So this concludes our July 17th meeting of the planning land-use and zoning committee. We will have as a reminder. We will have a next regular committee meeting here in council chambers on August 7th, Saturday at 9:30 a.m. Thank you again for attending we are adjourned. Thank you.", "end_time": 6711.0}]}