{"format": "raw", "annotations": [], "confidence": 0.9400535326773726, "data": [{"start_time": 0, "text": "Greetings and welcome to the Civil Rights utilities Economic Development Arts committee. It is March 26th, and it is now 9:33 a.m. And calling the meeting to order and at least I heard what I'm the chair of the committee and council member representing West Seattle and South Park District 1 and Joint by council member Jonathan want today's agenda. We will cover public comment and then the items of business for the day will cover two appointments one appointment to the Seattle lgbtq commission another to the museum Development Authority governing Council and then we will have a discussion a probably our third meeting today discussing proposed ordinance relating to public accommodations specifically focused on requiring businesses that are considered places of public accommodation to activate their closed captioning on their television. And then that will be followed by a briefing on the council's work to identify potential solutions to address eviction harms identified in a previous rub resolution of the council passed and we will wrap things up with a briefing on the ship canal water quality project. So that will move right into public comment. Thank you know. Will is our timekeeper keep an eye on him and the clock behind him. You have two minutes to speak and we have a public comment getting with Alec Zimmerman followed by Jason Morris. Is it called a Mite dirty shooter? I'm not to pick until she might. Criminal Tenkiller reminder for 20 years. You don't know it's not surprised me. So you for example in solvent or last five years never stopping Amazon. You never want her to go to make a year in talking about stuff in Amazon eviction harmless weather like for poor people. So why you don't doing this for 5 year, I never hear from you. You are go for re-election stopping Amazon Amazon want to fight another 10,000 people right now. Pepper ten thousand people doing something real. You done doing this very strange. I don't know what that you doing here. $440,000. You ever never talking about right now is this chamber you very quiet about Gonzalez copulate constitutional open public meeting at five times guys. It's very unique situation. You never mentioned. You don't ask her to move our you ask more a move out with memory, but not ovulate low five times quieter. Can you explain to me why I don't talk to people when you go off for election again, we cool with your fascist mentality. She's real late constitutional or five times Court recognizes and you very quiet about this. What car was it's possible stand up Seattle stand up America. We need cleansing story champ Francis croaking criminals. Public speaker is Jason Morris. Good afternoon Council and I appreciate this chance to speak a little bit. I'm a first-person self advocate of people with developmental disabilities, and I am advocating for the clothes cap to Chin ordinance for businesses to turn on the closed captions and being a person that died has what's called dysgraphia reading and writing a disorder where Having learned a language through seeing closed captions and hearing it on the TV really helps. So that's my plug. Thank you. That's all we have signed up for public comment. And if there are no other speakers, we will move on to the first item of business. Chennai time one is appointment of Wayne Adrian Rocque as member Seattle lgbtq commission for a term to April 30 2020. Good morning morning morning cast members sitting on either be here sitting with you. Thank you. We just start with a quick Round Table. Just go right down and do some quick introductions. Could you please just pick us off with a quick description of the commission and it's functions the council and City Department on issues concerning the lgbtq community and they're like I mentioned last week. They're excited to prevent our work plan on the end of April, and I'm so that's what they're busy doing right now that you did a retreat in December and so they were really looking forward to presenting to counsel. Great. Thank you. So Wayne is an appointment that has been brought To Us by the commission itself. There are three appointing authorities. The mayor is appointing authority of the council is an appoint an authority in the commission itself isn't my correct in that this is a commission appointment on this Wednesday Council of this is a council appointment. I'm so sorry fantastic. So talk a little bit about yourself and why you're interested in serving of the commission my my primary expertise and work lies and serving the API community and because of its intersectionality. It's important to it was very important to me from a very young age to recognize that and to be able to serve my community and understanding more lgbtq issues. There are generational trauma is that usually inform the way we approach many of our sexual minorities in our community and for me that was something recognize at a very young age. It's part of what I do at the agency. I work at is building the intersection of race and orientation because it's also a class issue and all these things kind of go together also recognizing that lgbtq issues are not specifically just lgbtq issues their class and Reproductive Rights issues and many other things and so because so many of these things kind of delve into the work I do is It was only natural that I gravitate toward serving on a commission so I can build that land bridge between the city and the city process and on-the-ground Grassroots agencies that are working with communities of color that are queer specifically that bridge with sure so I work for a serious. I also work in partnership with a pace Andrea of those are some really pivotal organizations. I work for Elsa work under the Asian Pacific Islander Coalition of Washington state and a commission of Asian Americans Asian Pacific American Affairs in in Olympia agencies, I work at and something that I've noticed that is lacking with many of these agencies is an understanding of where lgbtq API is lie. And that enough formula. My primary work is Civic engagement and even in those fear as you can see a general lack of understanding because my work life and Outreach and in that Outreach, I've noticed that the community is still not very familiar and it's not up to the community. It's us it's up to us to meet the community where they're at. And that's part of the bridge that I want to build is there there is still that that link missing between understanding the intersectionality of sexuality and gender identity in racial politics here in Seattle. Well, thank you for expressing a desire to serve on this commission as you I'm sure know the lgbtq commission is one of the commission actually that is showing a lot of leadership and what what a city of Seattle commission should be doing and you know in terms of not not simply respecting themselves to what Cancel our mayor's office politicians want them to do but really doing what's right. And so that that's been very exciting. And and I and I think I'll talk about her bold has really, you know, I had somebody has done a lot to really encouraged that approach just one thing I would say and you probably know this person already but there is a I believe he's a medical student of the University of Washington delip nagarkar who is an if you don't already miles will give you his contact information. He I only mention him because he's doing a lot of excellent work trying to have more of an understanding of lgbtq issues within the South Asian Community, which I'm a part of and the end of Salvation communities part of the API community. So I was just thinking that it would be a good connection for for you both and for the commission as a whole And we are welcome by council member Brian good to see you this morning. And so sometimes I know that folks were interested in starting the on the commission will attend a few meetings in advance. Have you ever done that yet? You got your your feet wet and I have no further questions. I really appreciate your willingness to serve in coming forward and using the expertise that you've you've built through your work and your relationships with the community to assist the commission and fulfilling its goals and objectives and we will be having the commission here in a meeting after next to talk about their work plan is Erica mentioned in hopefully, we'll see you again. If there's no further questions, I would like to move the given back to the number appointment is 01275 all those in favor vote. I meant to post none of staining. This will move on to full Council on Monday or not required to go, but you're welcome to attend. Thanks again. It's a dime to his appointment 1267 appointment of Stephanie ellis-smith as member Museum Development Authority governing Council for a term to July 11th. 2021. Good morning. Welcome and thank you everyone for joining us. We could just kick us off with it. Just a quick Roundup instructions. Stephanie ellis-smith a graph Andy Bolton see if I watched him back to present to you for Stephanie ellis-smith for an appointment to the museum Development Authority filling out the remainder of an unexpired term. She is one of the three appointees that are actually appointed by the museum Development Authority governing Council the others are by the mayor and also the Seattle Art Museum how she brings an extensive Rich history of working in the Arts field in the philanthropic area and is highly recommended and we recommend her appointment. Stephanie you want to talk a little bit about your interest in serving on the commission? Sure. Thank you. And thank you for having me Development Authority as with introduced. I have worked in the arts and culture of fear up here and Seattle and across the state for the past 20 plus years. I'm a scientist by training but I ended up moving and working with Jacob Lawrence and his wife Gwen Lawrence in the catalogue raisonne project. I found it and ran the Central District Forum arts and ideas on African-American face to Humanities and cultural programming organization. That is still going and it's 20th year. I've searched on this state Arts Commission on it by Governor Gary Locke the Seattle Arts commission appointed by Mayor at the time of course, I'm blanking out and I'm just been around has been on the board and 4 chair of artist trust supporting an individual artists across the state and a number of other organizations and Counseling and Advising roles and capacities. Thank you. You definitely have a wealth of experience and I'm actually surprised it's taken you this long to get to this particular potty because of that. That experience chair raft. You want to talk a little bit about all of the obvious reasons why you have put forward Stephanie as a nominee? Is an excellent lemonade she replaces somebody who had served since about the authority was founded and it took us a year to find somebody with her excellent background that we eat in a week. Have very little to do in less than museum is building a building or reassuring Bond issues. But we need people who understand economics and public support and real estate. So she's has a kind of background and we're very pleased to have her it took us a year to find her. I'm glad I'm glad that That has occurred and that you found found each other Stephanie. I just have so much admiration for the work that you do and again the depth and breadth of your engagement the community around heart issues. So like bugs have any questions or concerns? It's clear that you have been committed for years. And I also thank you for your willingness to serve it very grateful. Anything further to add? Okay with that if there are no further questions, I will move appointment 01267 all those in favour, but I not opposed to none of stating congratulations as well move on to full Council on Monday. I tried rm3 is countable 1194879 ordinance relating to public accommodations requiring person zoning or managing a place of public accommodation to activate closed captioning on television receivers and adding a new chapter 14.05 to the Seattle municipal code. Thank you know. greetings and welcome Appreciate your joining us. instructions, please Yes, my name is Eric schrier and I am the co-chair of the committee with people commission with people for Disabilities Council Central staff. Perfect. Central staff thank you. I should you care to kick us off lately. So we've discussed the premise for accountability 19294877 previous committee meetings back in January Eric provided a lot of background about other cities that have mandated closed captioning on televisions and the reasons for that and who that benefits and then a few weeks ago. We discussed a draft version of the bill the bill that is in front of you today is primarily substantively this the same bill with some very small minor changes, but essentially with the bills as is requires that any television receiver in a place in a public area of a place of public accommodations must have is closed captioning turned on by the owner in the or the manager of that place during regular hours. And so all those terms place of public accommodation public area and regular hours are defined in the bill and the only exception Is it there's no television in that public area or the television itself is technically incapable of showing closed captions. Enforcement before I get to enforcement the bill also includes technical standards for the closed captions, which are black background color specific text Mom a text size of 24 and a white text color. And just a little bit of background for the viewing public who this issue might be new to some folks is that in 2002 the FCC that actually adopted requirements for Digital television receivers that they have to include the ability to turn on closed captioning. And then in 2010, there was a similar requirement added for spank Spanish language programming. So before they Seattle commission for people with disabilities brought this issue to me. I was unaware that all modern televisions had this capability. And so I think that's a really important foundational part of this. This bill is this is just simply requiring folks who are in places of the Public Public accommodation tutor. Turn something on that that already exists. I also want to recognize that the commission adopted a resolution and November 2018 supporting the development of this ordinance and as council members who want mentioned earlier, we really rely in the commission's to identify priority issues and bring them to the council to work on. Thank you for allowing me to be enforcing this law intention. Is that 480 days after passage of the bill to allow time for Education technical assistance and Outreach two persons to whom this ordinance would apply the enforcement bottle is essentially one that would allow s-ser to provide an advisory letter to somebody to notify them that they A violation and to allow them to comply with the law within 30 days essentially that person would submit a response that would either explain how they've ameliorated the violation or discuss why the accident disputed the defense of the violation at all at that point and the process can move forward if the person wants to appeal they may do so at the hearing examiner. The penalties are up to $125 for the first time. There's a violation and up to $300 for subsequent violations. I have at the hearing examiner stage. They may consider a variety of factors about what that so what the Civil penalty should be. In terms of ssris ability to enforce this this ordinance. There may be a need for further staff depending on how compliance goes over this first year if there's further need for intense technical assistance or translation for those businesses that require it as well as just general sort of compliance for the general business Community because some of this was based on how the all gender restroom bill went there other turned out to be a need for staff time to do a lot of technical assistance with that on the same may be true here. And then the other piece is this may cost about 25 to $50,000 for outreach and education and it's not clear that ocr's budget can currently support that and so that maybe an additional need for SSR to be able to effectively enforce the right now and just to underscore this ordinances drafted in such a way that enforcement itself does not begin for a hundred eighty days after passage again that is intended to give socr the ability to engage with the business Community about the expectation with the desired results of not having to do a lot of enforcement much like we have seen with the rollout and implementation of the all gender restroom ordinance. I just know that a lot of the time it's enforcement the message of the Outreach. So so there is a sum that unit within the 180 days before enforcement that staff. Maybe the ones that have to do that. So this bill maybe we could turn it over to Eric a little bit. This bill is modeled on some other organ citizen in research that Eric has done. There is a similar law in Portland another in Ann Arbor, Michigan and yet another in Pawtucket. I think that's Massachusetts Rhode Island, and I think Eric did a lot of research on this issue and as has been mentioned this is not just designed to help folks who have hearing loss, but it can help other people as well. But as it relates to get to hearing loss one in five Americans have some type of hearing loss that affects their ability to communicate and receive information or Eric. You want to share with us a little bit of What led you to make recommendations in this bill that might differ a little from some of the other bills that you looked at. Will this bill is probably the best design model that I have without the loopholes. The main prop problem I researched as far as the community goes is that many businesses turn up. The captions are extremely small or it's very it's very it's very hard to read the actual captions and sometimes they disappear they blend in with the clothing. So it's a lot of technical issues in that people complain about and you know, what businesses say some people ask to change the background. So it's more visible. It's important to have those captions on and so I'd like to add captions the the technical model for the specific specs the background color the size of the font and the kind of bond as well in addition to that the text color white matches with any kind of visual kind of problem has the contrast there's a little technical details that I would like to accommodate so that all people with disabilities not just limited to people who are hard of hearing but it applies to people with cognitive disabilities in addition to that people moving here from other countries learning English as a second language in the first place that can help them as well. And you all hearing people sometimes even have a hard time hearing the TV and those Captain can help you don't hear people as well to filter out different accents whether it be between characters are reporters on the news. It can help with understanding God better Clarity with name pronunciation the brand names there's a huge spectrum of different things and how I can help and soul with everything. And so that's something I want to add to this bill and that's based on my own personal experience communicating with the general public as a whole and approaching those issues with the city and state of Maryland. So I think one of the again the principles of this bill that should be recognized is that there is an obligation under the Ada in place of public accommodation to make a Scott a reasonable accommodation. But much of that much of the implementation of that law is relying on an individual to make a request and that puts a note the onus on the person with disability to make that request and what this bill attempts to do is recognized that making that request can sometimes be difficult or embarrassing and that the owners should really be on us addressed instead of the structural issues inherent in places of public accommodation that create those barriers in our work to Remove them so I mentioned that as part of the context for what I hope we can just do a little bit of a discussion around some of the feedback that we have received from members of the business community that week that I've reached out to to ask for their their input. There are number of requests that have been made four changes to the bill and I think some of those things Merit consideration, although some I think might run counter to the goals of the bill and others might just be a necessary because of my understanding of the technology so If we could perhaps go through some of what we've heard just have a little bit of a conversation about them the first issue that I heard is that some programming. It's not the issue of the television not having the ability to turn on the captions. But some programming does not have closed captioning as as part of the basically that the software the is at is it software? I am not really sure of the technical but it's just not embedded so I can't be turned on. Gather the elect at so many as well in addition to that the Ada Law requires captions of all televisions that have the capability and that's specific language is the ship it has a specific kind of chip any TV that has the installed and that's been going on since 1990. And so any television with us within 30 in or wider have the chip and the capability to turn on closed captioning the issue that I'm raising right now. So it's not related to the television is related to the programming. So some programs don't have the closed caption embedded into the programming itself. I just know that specifically in this bill. There's a provision at the end that says that this still doesn't supersede any sort of state or federal law. So to the extent that there are programs that don't have closed caption because they're not required to cuz they're subject to some sort of exemption. This bill would not penalize somebody for you know, having closed captions turned on the TV, but it's closed captions literally don't show up on the program to be held liable for that. So the issue isn't don't turn on the closed captions. It's just simply an issue that the captions are on but it's some instances nothing will be showing because the program doesn't allow for it. Right? So it's so if that were to be reported to the office for civil rights for a compliance, like that would be the discussion that happens when the person words to send back a written response is essentially said, this is the program we were watching. It didn't have any closed captions. We have the TV turned on and there were closed captions on the programs on both. That's a bad. So I'm it would be just a matter of figuring out for OCR what that compliance look like. Tell recently Seattle channel is an example of it didn't provide closed captioning with its programming. So that would be I don't know enough about the laws that would programs are required to or not. But it's great that we're benefiting from closed captioning happy now Seattle channel, so that was a great step. But I imagine there other programs like that that still exists and so that wouldn't be on the the TV owner and more programming does Cary closed captioning just regular programming of entertainment programming, but then occasionally you will run into for example, if a movie was made in the sixties or seventies that occasionally he won't be provided funny funny thing. I was just watching the 36th chamber of Shaolin. And I didn't have closed captioning. I really wanted to have but it but it didn't but it was I only mention it because it is the rare occurrence and most programming a thing is capable of having so really the Queen of turning it on. It's so funny. I was on some personal experience growing up watching. I Love Lucy. I Love Lucy and the captions in the 60s. There are no captions back than in the sixties and seventies with I Love Lucy watching that and so finally wants to add a captions. So don't my God. She said those words. I didn't realize that the acting match the word so I understand I understand much better. I'm one of the other issues that have been has been raised is the issue of Sports Programming and the concern that the captions for Sports Programming will interfere with the all-important sticker that show the score and also display other information about the game. That's that's playing at the time and we know how Avid sports fans don't like to rely on the the replays but they are there for instances where you might miss something and in the live-action, but this is something that I've again. I've learned a lot about how closed captioning interacts with other text that's on the screen. Are can you tell sold about that? Yes with the new technology that's available in the current day and age. It allows the captions to actually move around and adjust on the screen. So they don't actually interfere with the ticker specifically. There's several features that make the TV itself. move the captions around and sometimes I can be lower. It depends. It depends on the manufacturer of the TV when they set out those captions and so it is improving overtime. And so we don't see that as so much of an issue with also captains and restaurants and bars that brings in more business to you know, there's so many people that rely on captions that can't go out because they don't have access to that at a restaurant or bar environment. And so they feel there's no access to equal information. And so they stay at home and watch the baseball game or football game and they have you know cabins at home, but it really increases patronage when there are captions available in those bars and restaurants and it helps the business itself the business case to be made for creating an atmosphere that increases a customer base. So what I'm hearing you say is that Not all televisions have the captions the caption capability to move around if it is that but but some do is that correct? to all different television companies Have the foundation of captions in the program and so as far as Sports Go of some of the companies have the capability to move those captions around to avoid blocking the kicker itself. My favorite tea TV channel is CNN and sometimes do you know during the headline news? There's a breaking news and it will move up so it doesn't block that. And so that function has a possibility itself. And so it's all has to do with the programming of the work. Usher anything to add there, I don't think you covered it. Other requests from business stakeholders that we've been asked to consider. Is to allow for a fixed percentage of Television specifically in a television show room to have the captions turned off. The showroom meaning like you going to the video store, right? They still have video spinners. Best Buy, there you go. Can you can you speak to that notion and Why that might run contrary to the goals of this bill. Personal lot of my personal experience related to that situation. I have many other people that have entered best by and looked at the new HD TVs the 4K browsing around and they don't have captions and so lots of the staff actually don't even know how to turn them on once requested to and they have to get a manager and it's whole Fiasco and the reason why the caption you can see which captions work for that specific kind of person which brand names are more accessible to the deaf community. So it's very helpful to find the Correct one and have been having it. Sometimes the loop itself, you know, all the TVs in Best Buy have the same kind of screen at the same time maybe having 20 minutes to take the time to look at how captions match the person and then just leave that and then make your decision. So people actually make purchasing decisions based on the display of captioning on. Different televisions and to the Quality as well as well of the captions. So to dump some TVs would interfere with a person's ability to choose a television based on the quality of captioning provided. Yes in the last item that has been raised. The question is often TVs again off the often in sports bars already have the television on mute. So nobody has the benefit of hearing what's on the television hearing the audio? So the question is is in those instances where the practice of a business is to have the television on mute and nobody gets the benefit of the audio. Would that be an acceptable instance to not have the closed captioning requirement? It's all just to be a little sarcastic, you know with the TV when the TV is on mute. Why can't you just like turn it off then? I think this has been identified as a way to address the earlier concern that if nobody's listening to the to the television, but everybody's watching it. There's a desire to make sure that the captions are interfering with what you can see on the screen and if nobody is nobody's listening, then it's not putting one group of people at a disadvantage with another group of people. I just want to be clear that many different people go to restaurants for example during the Rams during the Rams rest restaurant and there's a different displays on the wall. I think there's 15 TVs and I can hear with my hearing aid. I can hear some of the the background noise. But all the other customers can hear the TVs in the other room and so listening to the sound of the other TV. can be too loud and overwhelming because there's an echo and an overlapping of sound and someone TV that feeds are all the restaurant watching the same channel, perhaps To have equal access to information. So having mute or mute or not mute I'm not sure. I'm understanding the answer as it relates to my question if the policy of a business is to have all of the TVs on mute. The question is nobody in the restaurant can hear the audio because all of the TVs are on mute. Is it acceptable in those instances to not have of the closed caption option turned on and if not, can you explain why you feel that way? I feel that all people have a right to closed captioning weather there sound on or off, you know, as a deaf customer that isn't going to know that their sound or not in the first place because they are deaf or hard-of-hearing still bringing up recording machine to try to record the sound then ask my hearing friend. Can you hear that like, you know getting them into trouble perhaps, you know how some people just can't hear that so and this is why we have you at the table to help us think through these instances that you know as a hearing person. They're not my experience is so I really appreciate your engagement and sharing those experiences to help us build this policy. Thank you. And I would like to thank you all so much for your time and encouraging the passing of this bill. I feel so honored to be working with everyone here. In a sports bar scenario off and there will be no multiple different shows showing on TVs at once there maybe audio from one of them, but all the other body from multiple different shows at once in the bar and I'll tell you that I appreciate having the closed caption in a sports program. You can get lots of information from Whitaker's in the scores, but the closed caption just adds to the interest there. And so I understand the concern about how those tools may interfere with each other but this is an area where has Seattle joins other cities in making the requirement bars will become more aware of the different Technologies and purchased TVs that work manufacturers will respond to that demand. If you walk into a showroom and closed captioning is on all the TVs and some of it do it really well. Somebody or poorly whether you are hearing or not. Those manufacturers will likely see more TV sold it to it. And so I think this is a reinforcing mechanism that it sounds like the technology already exists and I would imagine it will see it being adopted pretty rapidly as of this trend continues. So I'm pretty comfortable with the the requirement as is I appreciate the concerns and I appreciate Eric's expertise on thinking through this myself. I just had as a thank you. I'm sorry. I'm sorry. I just added if the policy outcome is for people with disabilities not to have the burden of asking for closed captions every time and they also have to be monitoring if something comes off me for 3 seconds, and I need closed captioning makes it easier for businesses as a rule that you always have to have them on instead of having to turn one on every time you turn on the default. And there's commercials and intervening these stories where you know, the sport sticker stuff goes away or emergency, you know, if there's if there's some sort of a portent of you having access to that information through those closed captioning closed captions, amber alerts for kidnappings in addition to those are broadcast right away and we can hear that but if people don't have access to that, they can't access have access to those. It's essential that access to those emergency situations and the time is of the essence especially in those kinds of situations. Thank you. Everybody. I want to thank the business stakeholders have weighed in on this. I want to thank your continued engagement. We are still waiting to hear back from the small business advisory Council them are us back. I also shared this bill with and so for that reason, I'm not prepared to vote today, but intend to bring this back at our next committee meeting two weeks from today. Is it April 1st? When is April 9th? I think it's the night right? I have a question for the as the full Council going to vote on the 9th full committee committee committee about is the fact yes, and then full counsel after that and thank you so much everyone. Appreciate it. next item on the agenda item for the update on potential solutions to address eviction harms identified in resolution 31861 Hello again. Cancel. So background on this we this is sort of a body work that we've been plugging Along on we started with a review of the losing home report by the Seattle women's commission last year subsequent to that discussion and review of that report. We identified the the problems that needed addressing that were called out in that report and we passed a resolution 31861 that resolution again identify the problems not the solutions, but the problems that were creating harm through through The eviction process this was a resolution that counts number O'Brien and I sponsored and I did identified which of those items were being worked on in different contexts. So some of those items are being worked on within the context of implementing the budget at the council passed in November for 2019-2020. Some of those items are being worked on within the context of the State Legislative agenda that the city council and mayor adopts giving directions to our lobbyists in Olympia to work on issues of high priority in a number of those items are related to eviction reform and then it identified some issues that were high priorities for the council. And so I'll show you have a memo that you're going to walk us through you're going to give us some information on I think there's seven items which of those items might be right for Council consideration of action and what some options might be but also which of those items are being in a substantial way I dressed as as we speak through the legislative session and Olympia. I thought you mentioned since the adoption of the resolution multiple bills were introduced in the legislative session a couple of them made it through the point at which they had to pass out of the house of origin in order to stay relevant. I'm so they're two of those that address some of the issues that were brought up and the resolution is angry substitute. Engrossed substitute House Bill 1453 and engrossed substitute Senate Bill 5600 and so are similar, but I'll go through those as they come up as relevant to the issue that we identified. So at the first issue that we identified in resolution 31861 was the financial hardship for tenants that are experiencing domestic violence or held liable for damages caused by a perpetrator of domestic violence. This this isn't an issue that's being considered at the moment at the state legislative session. So I provided several options. I just know that as I go through these options are not a total comprehensive list of the options that Council can move forward on nor are they necessarily mutually exclusive to each other? I'm so to implement some solutions to persons that are dealing with this problem identified three basic options. The first would be option A which would be to prohibit a landlord from holding a tenant that is experiencing domestic violence liable for damage to the landlord's property that is caused by the perpetrator of domestic violence. And that would be in the situation where the tenant protection order in place against the person that's causing damage option b would similarly prohibit the landlord from holding that tenant liable but in this situation if the tenant were to file a report with a qualified third-party someone like a law enforcement officer Court employee a mental health professional about the incident in which the domestic violence occurred and the property damage occurred and then provided that report to the landlord. They would not be held liable. option C regardless of who is liable for the damaged whether it's the landlord or the tenant council could legislate access to and provide some Appropriations for a mitigation funds that would cover the damages that are caused by a perpetrator what the documentation would be around providing to the Arbiters of that who caused the damage is something though that we can discuss further, but the essence of the bill would be that neither the landlord or the tenant will have to absorb the financial hit and that the mitigation fun with I just know that that there is some draft legislation that is combines options A&B and it's models are generally off of the RCW provision that allows survivors of domestic violence to terminate their lease agreement if they provide specific information to a landlord, so it's not a Loosely off of that just in that the the evidence to provide a landlord in order to remove liability would be something like that the protection order or a report with a qualified third-party. and US1 thank you so much questions. One is so both a option A and B. Bring some shape or form require the person that the tenant who is experiencing domestic violence to have taken some action having reported it to some appropriate parties are even like wine option is I gave him one step further having sought and obtained and a protection order against a person who is committing violence. So I'm just I'm just bring this up because we note to disagree speaking that domestic violence survivors are still out of that situation are faced many barriers to report that it's happening because they also face retaliation from you know, so there's a there's a reluctance understandable reluctance to reporters. I'm just wondering what thinking we've done in terms of unders understanding of their options bad. We don't have either of those two things done and is and I'm also In the case of small and large and it's possible that small landlords who owned one or two units rental rentals or maybe just one rental that they you know that they are responsible for and they may know because they have personal relations just for friendly relations with the tenant. They may know that this tenant is facing domestic violence, but that person is not able to or willing to reported in that case can the city offer mitigation. I'm just I know I know these are hard because it's much better to have actual documentation, but I'm just raising the question and then the other question I would raises in terms of mitigation in point sea-witch is not mutually exclusive with pointy or being can can we can the council come up with some idea of small landlord versus big letters on this is a general question that has occurred to me over and over again in terms of how how we should be formulating legislation related to renters rights. Getting can we have some sort of delineation or is it possible to think through that so that the city. Public monies are responsible for medication only in the case of Angela speaking a smaller and not a big landlord who we can make a strong case that they can afford to mitigate then. I also be interested to know item item. See I think was actually offered as an option for our consideration by the Washington multi-family Housing Association. And one of the reasons why they put that forward is because of their advocacy for a similar requirement as part of the state source of income discrimination bill. They have they the state has created a fund for damages associated with a felonies 10c and I'm just would love to know a little bit. It's only I think it's only been a year that it's been in force. But if we have any experience that we could share from from the stage on how that funds being utilized and also whether or not that fun. Makes a distinction between large and small landlords and It a curse me as well. And in this might also fall into the large small landlord rubric, but I would like to learn more about instances when somebody would need to hold a victim of domestic violence liable because it seems to me that somebody's insurance would cover a lot of the costs associated with damage to a unit regardless of the circumstances and Landlords typically have that type of insurance so that they're not having to pay out-of-pocket everytime damage is done. But again, I don't know as much as I would like to know about about that insurance in and whether or not it covers these instances and whether or not this is insurance that is sort of universally held because of financing requirements or if it's the kind of insurance that maybe again some small landlords who maybe I've already paid off their note may not be careful carrying. Some of the sauce to get back to you on but starting with the peace around a person experiencing domestic violence providing proof of what has happened that you're absolutely right in the back and be extremely difficult. And I think one of the things that is a benefit of the second option, which is having a tent file pro with a qualified third party is at that can be with a domestic violence advocate or mental health professional. It doesn't have to be with law enforcement and that the reason for providing documentation at all is to provide abuse or protect from abusive this kind of legal provision. So that not everybody is saying, you know, I'm a victim so I have to pay for things but I think you're right in calibrating what that kind of proof should look like and this this draft has not gone out to stakeholders at this point. So I think once People have a chance to weigh in on what the provisions for proof are on whether they should be necessary and what those look like. I think we'll have a little bit better idea of what would work best for people that have survived domestic violence. The second thing you brought up out the the distinction between small and large landlords in terms of Eligibility. I'm not sure if the state makes that distinction. I don't believe that they do but I do see the the advantage and exploring what that kind of Eligibility looks like it may be a challenge and figuring out what the line should be with the delineation is but it's definitely something to further explore if the medication fund is the way that Council wants to proceed. In terms of insurance. I think the there is a distinction between the score between what is a renter's insurance or a landlord's insurance will cover in terms of property damage one example that I think she was up in the losing home report that the women's commission has brought up at is the experience of a person that her relative was beaten pretty badly by the perpetrator domestic violence bodily fluid all over the floor of the tenant to tenant was charged for that and my my instinct is that there's a normal cleaning fee that takes place but then it something like that would require the tenants pay a little bit more to to get that cleaned up and said that may not be something is covered by insurance and it may be a sum of money that the person experiencing down at 4. So it may end up contributing to the disease that add up in terms of addiction. I will have to do for the research into what the insurance piece looks like around that. But that's just one example. I can imagine where Insurance wouldn't even come into play. It would just be something that needed to be out of pocket from a tenant that they couldn't cover. I think I appreciate the kind of range of options here. And I think I look forward to having some time to go through this and think through what my work interview questions today to I think it's clear to me is when someone's a victim of domestic violence, you know, that is Can you shoot burden on that individual and the compound that by charging them to clean up bodily fluids from being the victim of assault is just seems turd how we how we fix it and it's critically important islands for sure. And I think one of the steps we can take in the short-term has to figure out how to not compound the challenges of Stokes that are victims of domestic violence are facing. If you took the second issue is the lack of flexibility tenants have around avoiding eviction on their face with emergencies. Also temporary unemployment has a death in the family this also it hasn't been addressed at the state level. So the options provided here are our age required landlord to offer the tenant a payment plan before they file an eviction notice. The first time the tenant is unable to pay time the rent in a 12-month. I'll regardless of the reason again, the pieces around. Is is up for discussion option b would be Tulsa to require a payment plan before filing the eviction notice but specifically in the case of an emergency. So depending on whether it's the first time or not may not feed the trigger that activates it and then depending on how comes wants to move what that document. Emergency looks like it's necessary at all would be up for discussion. And then the last piece options would be that providing a defense to just cause eviction in that if a person is experiencing an emergency, they can use that defense once in a 12-month period and again the 12-month period is is a variable certification in sewing Pointe a it says the option is to require a landlord to offer tenant payment plan the first and the dining table to pay regardless of the reason meaning of the reasons you stated in the preceding paragraph form because of temporary unemployment insurance and then point B, you say option b say prevent that didn't suppose an emergency. So when you say emergency, do you does it mean they medical emergencies or do you would you in another option? Would you also count Loading a job unexpectedly as an emergency. I think it would depend on is something as a cute as a medical emergency that put something in the hospital or it is something like they've lost their job and it's going to take him a month to find a new one. Both options. BNC would require us to have a policy discussion around what for purposes of this ordinance is Be defined as an emergency an emergency may not may be the wrong term. It may be just like an adverse event something like that. But the decision to be around what that actually entails. And and maybe we've already done this and I can't recall but look at other states and see how they defined them or do you think maybe as a guideline for absolutely another guideline might be the oft-quoted Federal Trade Commission report that demonstrates that 40% of people in the United States do not have $400 to pay for an emergency. So for first purposes of that survey, which I think is also sort of a foundational principle of the report about how these destabilizing events can result an eviction. It might be worth looking at That definition of emergency because again it just it links back to the resource issue that we're trying to deal with right here. Absolutely. I'm really appreciate you bringing that up. It's a very powerful sadistic and it should be used as a foundational guideline for legislation of this time is one-dimensional so that it connected to all of that is also the research that we see coming from the University of Washington on using Statewide data in a combining various data sources, including ACS and then your senses and all that but they show that elections are in the in Washington state. And again, this is not a surprise to any of us are not affecting every income group there specifically affecting low-income groups and that tied in with the statistic imagine. I mean a thing is definitely sure Financial emergencies of any kind should be considered emergencies. I think when we when we formulated definition that means I should be taken into account of loss of job is a financial Immediately would not be able to pay rent if you don't get one paycheck. Absolutely. Is another example that the women's commission report highlighted, you know, in this case you have an individual example of losing a job, you know what their data shows is if with an eviction and it's extremely likely this person will become homeless person compounds the challenges of getting back on your feet and the expense to the individual on the expense to society goes up dramatically. And so this is one of those examples were like, hey these things happen in people's life is you both highlighted that they know a lot of people on our society don't have a safety net. And how do we come together and fight a Citation X if we can keep that person stabilize much more likely to find a new job and get back on their feet without having this massive disruption to the individual and to the product community. And then I think there's a question in these options kind of gets a little bit. There's a landlord that's on a building for a number of years likely that probably cash flowing pretty positive way now because rents be gone up so much and they probably purchase the property. I think it's reasonable to say hey show a little flexibility small landlord who just bought the property yesterday and today is real estate market is probably negative cash flow for a while because of the reality of the housing and I would be sympathetic to you know, when was saying hey I and I scraped everything together make this work and now I can absolutely critical that if we don't do something a relatively normal life disruption leads to homelessness in today's market is something that we just can't tolerate. So how we never get that from your work and I think Getting for the viewing public more than half of the people evicted raised in the eviction. Study more than half of them were evicted for I believe one month or less Mowing and of those folks who were surveyed 85% of them became homeless. So I appreciate you cast member Bryan raising the greater Sydel costs associated with the outcomes of these evictions both to people's lives as well as to our ability as a city to address the needs of that are created through more and more people becoming homeless through the eviction process. Is the high default rate for evictions? So just the tennis don't understand the eviction process the effect of mutual termination agreement sore are generally unaware of the free legal resources are available. This issue is addressed by state legislation. So House Bill 1453 required would require that any of the action notice that gets issued has to be accompanied by a form that tells the tenant and the Washington State Department of Commerce systemically has information about how to find a lawyer and Advocate low or no-cost about available resources to help pay rent and it can it also directed tenant to call 211 for that information and then Section 3 Add language that requires the front of Commerce to keep translated versions of the notice in the top 10 languages spoken in Washington state requires that notice be available in printed form and it is really easily readable font size and also that in addition to being on the form DS you should provide on its website where tenants and can access legal advocacy resources that can help tenants to understand assistance in their primary language. the Senate Bill 5600 essentially has parallel Provisions to that except that it puts the Washington State Attorney General's office instead of the Department of Commerce in charge of the notice and providing information on this website issue for charges such as late fees court costs and attorney's fees can add a stencil burden to the tenants hardships and paying rent Adams also up for discussion at the state legislative session House Bill 1453 requires first off that any payment made by a tenant before rent before applying it to late payments are damages, like legal costs are fees and that includes attorneys fees, so That way I rather than applying it to the other payments and still leaving rent unpaid which could lead to eviction that those funds have to go towards rent to which would potentially avoiding eviction will also requires that tenants right to possession is not conditioned on payment of anything except paying for your rent a landlord can still pursue other legal remedies to collect bees, but the only thing that actual Tennessee can be based on is the payment of rent. I it defines rent which hasn't been done at the state level before and it defines it as recurring in periodic charges for use and occupancy of the premises. It can include charges for utilities, but it does not include charges for costs incurred due to late payments damages deposits legal costs or attorneys fees. Adam five just just that the that house bill states that if in a lawful detainer action after default happens and payment of rent, the court is allowed to award statuary costume reasonable attorneys fees for the landlord. But only after a finding that the tenant didn't act in good faith willfully Pro perform to accredited act or willfully refrain from performing a required act. So as it stands current law allows the court to award tax write-offs original attorneys fees no matter what so this would limit that ability by the court. It would limit the ability into to those instances where the action was willful is that was at the term used if they will fully performed a prohibited to act or willfully refrain from performing the required act. So I'm assuming something in the lease that they were supposed to do that. They didn't answer that relates specifically to Two attorneys fees late fees are also capped in the Senate bill. So it's so in the late fees. They deal with the next section of the Judy was in the Senate bill, but in the house bill, they it basically says that if you're going to be retarded restored to 10 and see you have to pay any rent to court costs, but late fees only if they are due under the lease for no more than $75 total multi-family Housing Association. They've been really understanding Willing to meet the bill sponsors on this issue in particular and I know this is really important both as it relates to making sure that people are not being evicted for late fees because rent is being applied to two late fees and they're still showing up is owing rent. But also in recognizing that there are abuses that result in excessive late fees and attorneys cost. So I really appreciate their work on this the Senate bill is is Ozark good question. Maybe you can add it to your what you're trying to say. But how how does the how is it decided what was willful especially in the case of not doing something that required. How do you all you can say is it wasn't like, how do you prove? I'm not sure what prompted. Standard of willful but I my instinct is that there's case law that serve defines what willful an intention all those terms are as opposed to just not probing an act. I think I don't typically in the context of landlord tenant law, but I know that there's case law generally that sort of defines what that means. And so I in interpreting that my guess is that the the legislature either could Define further with willful is or defer to to what the courts of said about what Will Follow means but I can do some further research into what that term actually means an illegal context. I just also note that the Senate bill has some similar Provisions. It also would limit late fees to no more than $75 but it also includes a provision that a tenant should pay an additional $50 for each time. The Senate is reinstated to Tennessee within the previous 12 months. And the last piece of that is in terms of attorneys fees. If after a judgement is entered on the total amount of rent is either equal or less than two months of a contract with less than $1,200. The court is prohibited from awarding attorneys fees. So it's it's limited in the way that currently is not the case. I'm sorry. I forgot to mention that is if a tenant does zika stay of the writ of restitution. I'll talk about that entire process in a couple issues. But if that does happen and 10th for Bealls in the attorney's fees can be awarded. But if the landlord prevails the court cannot award attorneys fees against the tenant. Vin Diesel with the roommate to afford rent but some ways can prohibit that or limit. The number of Roommates landlords can reject roommates regardless of whether that rejection is reasonable and also impose extra fees and strict stream strict screening criteria. So this isn't something that is being addressed as a legislative session. So the options here are a stroke wires the rental agreement provide the tenant a right to live with both our immediate family members and up to one additional occupant subject to any occupancy limits. The second is that if it said it would like to add a roommate to the rental agreement landlord can't subject that roommate to any stricter screening criteria than what the landlord to bring the original tenant for and can't impose any other additional fees for adding someone to the rental agreement accept what it cost to do the screening. And then the last option would be to prohibit the landlord from unreasonably rejecting request for a roommate. So some of that would be figuring out what a reasonable rejection is. And what is unreasonable. But that again is further policy discussion. If that is the Thruway Council has to move and my recollection is that there was a bill in the state legislature. They had their own there's a Statewide just cause bill that was proposed that actually did address this issue, but that that bill is not moving. Although certainly the bills that are moving could be amended to to address this issue and make unnecessary are need to to address it but the women's commission report again identifies particularly in a city like Seattle where the cost of housing is high. That there is a real need of folks to have roommates and often those roommates are immediate family members and in both instances. I think there should be some sort of accommodation. It's my recollection that option A is intended to deal not just with the right to have a family member but to deal with those instances where the primary tenant Passes away and there is a family member who has been living with that primary tenant, but is not on the lease and we want to make sure that that person is not subject to eviction simply because the primary tenant has passed away recently draft legislation can be very specific to what the actual right is. If the primary tenant passes away or decides to leave the the rights that that additional person has on the lease. And so I think this issue in addressing it it's both important to deal with the types of barriers that prohibit people from being able to enter housing as well as the things that might result in people losing their housing. And so I think it would be important to address both What the what the landlord can screen for in require on the front end and the punitive action that could be taken on the on the back end as well. Is she 6 deals with fees for terminating the lease before the end of the term? They can often be very high and accumulate even though the market and you get three renting the unit is not that hard and the landlord is required to even skin, even though landlord is required to make a reasonable effort to re-rent the unit. This is not being addressed at the state level. So the options are below are a to have all rentals require all rental agreements to have an early termination fee limit that feed to one month's rent or the actual damages. Whichever is lower be would be would not require all rental agreements to have an early termination fee for those that did have them to cap the fee at one month's rent or actual damages. Whichever is lower. And again how much that one month rent or actual? I'm sorry how much the one? What are the appropriate trigger and lastly Define what a landlord's obligation to make a reasonable effort to rerun. The unit actually is. I just know that the underlying RCW if there isn't an early termination fee, there is a requirement to pay either the actual damage the actual amount or the difference between fair housing value and what the the landlord's losses and so In option A if all rental agreements have an early termination fee that underlying RCW wouldn't be an issue if it were option b then for as long as it didn't have early termination fees that are still you would come into effect. an option C as it relates to a landlord's obligation to make a reasonable effort to re-rent the unit. That is the current obligation in state law. The problem is is what is a reasonable effort is not is not defined. And so option C. Would I think in some ways be building off of what is already required? And would be served addressing a definitional gap in in state law. Issue 7 the last issue it's even if it's in a good cause to be late on the payment of rent courts don't have the judicial discretion to prevent infections. So basically the job description to stay a writ of restitution. This is being dealt with at the state level both the house bill and the Senate Bill address this issue there a lot of Provisions in Sanibel. I'm so go quickly the rest of the house bill which is basically it that it's a judgment is for the landlord on non-payment of rent before I can stay or vacate the writ of restitution at the show cause hearing or if the 10th makes a subsequent motion upon good cause and unfair and just terms real with parties the bill defines what the court should consider other six factors to send the payment history evidence that the payment was caused by circumstances beyond the tenants control and that are unlikely to occur evidence or lack of evidence the tell tenants wilful or intentional failure to pay rent and Sensibility the time we pay the judgement the relative burden. The party's resulting from reinstatement or the refusal to reinstate the tenancy and then conduct related to any other notices that are served at the same time the notice to pay or vacate. That is the basis of this red. It keeps that the burden is on the tenant of proof is on the tenant to prove that it's for a good cause and unfair and just terms and there's some limitations on what the court can they can't stay there it for more than three months from the date of judgment. They can order repayment within that time. I can't stay for a month longer than that. The tenant has to give the landlord or deposit with the court one month's worth of rent within 5 days of the order and if the court does finds conditioned on the court finding repayment of the balance the court will issue the writ of restitution, but it won't be served by the sheriff unless there's a default in which case the court will then tell the sheriff issue. Santos similar it also provides the ability for the channel to make a motion for good cause to stay the Writ the factors considered are the same as those in the house fellow but adds two more it adds that the tenant has to be otherwise and substantial compliance with the rental agreement and the court has to consider whether the landlord can obtain disbursements in the landlord mitigation program about the landlord mitigation program in the Senate Bill talks about it. It essentially widens the number of things that the program covers to include. Cases in which there on pay judgements. So if the landlord does get reimbursed from the Senate has three months to repay Department of Commerce, which holds the landlord medication program and Hazard wants to deposit those funds to the court. the other piece of the Senate bill is that the limitations around with the Writ is how long did it run is issued for which is similarly three months. The tenant again has to deposit the payment with the court one month's rent within 5 days of the order in which case of default the sheriff conserve the rent but not execute it until the five days are expired if the tenant defaults the sheriff can serve the red or the landlords and serving notice. I'm telling them as much as the other piece in the Senate Bill isn't in the house bill is that if the tenant is depending on emergency rental assistance from the government or a non-profit does writ of restitution can be staying with documentation. The basically says they can pay the balance of that order. And then the last piece is the tenant can't ask for a relief by judicial discretion if they've been served with three or more notices to pay or vacate for failure to pay rent within 12 months prior to that notice. That's that's that's an additional limitation for the tenant that isn't in the hospital. Either one of these at past are going to be real I think game changers for tenants and this day and I really appreciate our our legislators who been working on this as well as all of the stakeholders who been involved. I'm really encouraged by the action that's being taken as far as our next steps go. I think we're going to sit tight and see what comes from the from the state legislative session some of the items that we have identified as not being addressed by the state legislative session might might come up and so I think we need to Wait and see what happens there before we decide for sure which items we want to push forward on looking towards towards you or Brian. Does it make sure that you agree with that course of action when I really appreciate this kind of brought over to give us a sense of the mix of things that are potentially being the grass recognize that those can all shift in a moment's notice that help kind of get her head around some of the challenges that the report raised that we really want to find a way to address my senses at this point until the legislature finishes their work. There's a lot of fun hypothetical scenarios, and I could be much easier to just to just let that play of course over the next five weeks and then we can evaluate what position does bills. I'll probably take a little more weeks to navigate when was actually done at the end and then we'll have some clarity on I hopefully will be a great body work. It will affect people throughout the state which would be outstanding and then if they're still issues they remain and I imagine there will be we can kind of reconvening talk about listening. I really appreciate it. Agenda item 5 is ship canal water quality project update. Greetings and Q introductions. Goodnight Council Central staff. I'm who would like to kick us off a starter house? Thank you. Cancel member her Bowl to end to cancel my bro Brian before Keith starts his update. I'd like to just touch on the purpose of the ship canal water quality project. The project is part of Seattle's combined sewer overflow control program to meet state and federal requirements that are intended to reduce the size and number of sewer overflows. Its Seattle Public Utilities developed a plan which contains several projects to support its consent decree to reduce combined sewer overflows. And the Ship Canal project is the largest of the projects contained in the Plan, it keeps it will keep on average 75 million gallons of polluted storm water and sewage out of Lake Union Ave Lake Union 7th Ave and washing the Lake Washington ship canal per year nearly 70% of the city's cso's associated with the plan occur from the base inside feed into those water bodies. And since we left last brief, do we have some good news about the project? I leave Keith at the uptick you to tell you about it, and lastly you'll recall that Council approved a budget provisor requiring as pu to get legislative approval before proceeding with development of the tunnel after achieving 100% design completion. And so I'm pleased to tell you that the mayor expects to transmit a request in the next 2 weeks to you. Send Anna leave it to keys to tell you about the project. Thank you for the opportunity project today. Today, I'd like to provide a project overview and then focus on the project schedule and cost uncertainties and risks and I'll close with Communications next steps. So the Ship Canal water quality project is a storage tunnel to reduce combined sewage overflows into our waterways. The project will improve water quality by keeping an average of 75 million gallons of glue to storm water and sewage out of Salmon Bay Lake Union and the Ship Canal each year in 2013. The city signed a consent decree with the US Department of Justice the EPA in the Washington department of ecology about combined sewage overflows into these waterways and the performance requirement which is shown here is that we must have less than one overflow / outfall. Per year on a 20 year moving average. So that's all in the in the future. This applies to all of us pu is 85. I'll follow caitians. This is a shared project with King County. The Ship Canal project will address five of Seattle's out Falls and two of the counties and this map shows the king County's basins that floated they're out there to out Falls and green and the city's basins that float are out Falls in pink King County also has a consent decree for their to out falls in the ship canal and both consent decrees require that we complete construction on the project by the end of 2025 and I'll be referencing this a couple times. So visually it looks like the King County basins cover a lot more area geographically, but yet the The Joint project agreement has the Split between Seattle and King County at 6535. So what that says to me is that the the number of acres is not an indication of the volume about clothes that were trying to address. Is that more or less? Correct? Yes or no Seattle has more volume than the county but the way that that cost share was developed about 45 years ago was actually if each agency went on their own and created their own projects to solve their problems and you told her to haul up their cost would have been about 35% and ours would have been about 65% So it's actually volume wise Seattle has about 60% of the volume and they have about 40% of the volume total volume, but it's actually based on the cost. What would have been the cost had each agency gone separate in this is all in this joint price. agreement that was ratified back in 2015 2016 and so is that just a function of construction costs being lower outside of the city specific to to these areas. So for example, they would have both agencies would had to build four to five underground storage tanks and when you do so so here for example, let's say that the total was 500 million there construction cost an estimated was about 35% of that total says of all those tanks put together to this is really weak agencies did kind of two scenarios if we all went on her own how much would it cost and it would actually cost about the same but it would have been a lot more Community impacts and kind of nation needed and that's why we came together to do this shared storage tunnel. And that's largely related to the number of out Falls since we have five and they have to and we would have needed to you no construct some kind of storage get up at the end of each of the outfit. That's why are proportionate share of cost would be higher. Thank you. Turn on the consent decree in the requirement of 1/4 average 1/4 / average over 20 years. I assume that we used some sort of hydrographic modeling or something. And so we can an assembly for an agreement with both ecology and EPA and so we can see what we're doing. And this is what's happening. So we expected we will only have one outflow overflow perv, you know out slow for you or whatever. So but didn't the world is changing rapidly in ways. We don't totally understand is this like we get to a technical agreement and were kind of in compliance because we were in this kind of Safe Harbor where the model set it or if we start having a Hundred Year events kind of every 5 years and says well or models were wrong and you guys had for overflows in the last 10 years. You guys need to go back and build some more storage or do something else or do we not know that you had one question and this is this question is being asked around the country and a lot of cities are now reopening their consent decrees are asking to reopen their consent decrees because they're saying so much more intensity and frequency of rainfall and you know Sarah current agreements. Do you know just don't allow them to meet you know, whatever standard has been said in an affordable way is so you know that that is a great question unresolved. Is that how that works music center created like at the end of 20 rear as we will see if you made it or not or is it like as long as our models that you mean it that's fine. It's really a perpetuity. So John is a lot of work to look incorporating expected climate change into our volume that we need. And that's one of the reasons why a year ago, we talked about moving the tunnel from a 14 foot diameter to an 18-foot 10 was based on more recent rainfall data. We really go back 30 years and we look at past date and then we try to predict the future but the last eight or nine years have been a lot more significantly different events. So that factored in and then I would say also our line of business within utilities doing some really really good work. Actually I talk about confidence on cost estimating they're doing looking at confidence on sizing based on where they think climate change with Joe. So this is one of the few programs that has incorporated climate modeling and it recently into its program. I'm scientists working on climate issues for I don't know over over a decade maybe decades and so totally in the Science World experts here locally thinking about how that works utility is is is working aggressively to incorporate climate science into all of its work, but you know, it's a process and so for this for drainage and Wastewater modeling, it's actually fairly recent and you know, we only started doing that about 2 years ago. So the Ship Canal project is sp is more most important CSO project because of the CSO volume and frequency of overflows is pie chart shows the city of Seattle's total 2018 combined sewage overflow volume, which was 52.6 million gallons from r85040 locations. The gray wedge shows that 80 of our out Falls overflowed 8.1 million gallons in 2018 in this is about 16% of the total volume. The yellow shows the Overflow volumes from R5 City out Falls that are part of the ship canal project the total volume of 44.5 million in 2018. These 5 / out Falls were 84% of all the cities combined sewage overflow volume and a ship canal project is an important part of protecting a regions water quality. This is a plan view of the project. Product includes a 2.7 mile on 18 foot 10 inch diameter storage tunnel that will go from Ballard to Wallingford. The alignment of this tunnel is shown in dark. Honest purple constructionism five neighborhood in the five neighborhood shown including 5 drop shafts to take flows from existing pipes down into the tunnel. There also will be the pump station in Ballard and an 8-foot diameter conveyance tunnel under the Ship Canal between Fremont and Queen Anne. Our design and construction schedule is critical to project success. This shows our design and construction schedule for are five major construction packages on the top left. These packages are in various stages of design, which is in the light blue and Construction in the dark blue and the Orange Line shows where we're at today. The red line shows are construction complete regulatory deadline when the entire system must be operational by the end of 2025. Overall, our schedule shows were on track the red star shows at the pump station will finish construction and be operationally complete in advance of the construction completion deadline our first major construction package the Ballard early Works package shown by the first row is in construction. This year our largest construction package Row 2, which is the storage tunnel package begins pre-construction near the end of this year and include both tunnels the drop shafts and work in all five neighborhoods. Remaining packages will connect basins existing basement to the tunnel complete the pump station bring the system online and move into design or currently getting the storage tunnel package and I'll talk a little bit more about that cost uncertainty decreases as these projects move from left to right and we'll talk about this more on future science about the Ballard really work that's happening now, perfect. I go to the mail go to the next line and our Ballard early work project. The focus of this project is to prepare that the Ballard site for the start of future tunneling operations. This is later this year. This is very common and tunneling project. This project is on schedule and slightly under budget. Our bid price was about $650,000 less than our rent Engineers estimate. We're about halfway through construction. And then if you should look here in the upper right corner right side is construction of our new concrete pier that will be used to dispose of soils from the tunneling that will allow us to reduce about 17,000 truck trips across the city area specifically in that area after construction. This pier will again be open to the public. Shown on the left is installation of a new water line using trenchless methods. This line will bring water to the site for tunneling operations side. So we will actually be bringing a conveyor belt from the the beginning of the towing operations nearby over to that and low the soils onto barges and then take those two disposal site. Since we last brief deal, we have increased our confidence on our 570 million dollar budget from 65 to 70% That was the good news that Mommy was alluding to yes. We're also on schedule. I think that's pretty good news, too. But this is always a big one. We always focus on this is of course. So a 70% confidence means that there is a 70% chance that cost will be at or below the estimated cost and a 30% cause it is Chance. The estimated cost will be exceeded spu's share on the 570 million dollars is about 390 million, and I also want to Put in that the 65/35 is on cost that the two agencies share their are two of our projects are paid for only by spu based on our original agreement and they are significant amount of work to get the water to the storage tunnel. So we enter those cost. So we prevent presented a project cost update to this Committee in May of 2018. I'm going to walk through our January 2019 cost estimate relative to our May cost us for January 2019 desk and talk about the cost categories that build up this estimate our current estimate, and it's confidence reflect cost and scope reductions that we've been working on since April of 2018. So in the first row are base cost and these are our normal construction cost in today's dollars things like concrete rebar skilled labor engineering our base cost includes are hard soft and also property acquisition. These are at 438 million dollars currently and you can see that this is decreased by about 9 million dollars primarily since our King County and S Seattle city of Seattle project team work together to find savings last summer and better value by eliminating our social pipe package. This was a 1500 foot long pipe 48 inch diameter. That would have gone under the future Burke Gilman Trail along social pipe. We were able to team did some great work to fix figure out that we can actually use it an existing nearby sewer pipe in order to not build that project element. In the second row is escalation. This is what it will cost to complete the project in the future. It's currently estimated at 64 million this increase reflects updated information and changes in the project schedule. And of course delays can and always do increase cost in this isn't her that. We're really focusing on his keeping things on schedule in order to manage escalation. In the third row is is we include uncertainty because we can't know everything about the design or bid prices and also risk because construction projects have risks we plan for and manage and certainty in risk with tools like our risk registers and in a grave risk reserves into our project cost estimates. Our current cost estimate shows a $4000000 increase our cost reserves for uncertainty and risk cost and schedule risks because of the changes mainly the pipe that remove remove all that social pipe project that I talked about we were able to increase our cost reserves. So we put those savings into the cost reserves that increases increase cost reserves increase reserves increase our confidence our budget cost estimate confidence. We're now at 70% most other agencies budget between 50 and 80% So I like where we're at right now. And can talk a little bit about the schedule risk impact escalation. Sure. Is it is it advisable to be budgeting for that and we are not or is there some reason why we don't need to thank you for pointing that out. So we did in the third row. We do have some cost reserves for some schedule impacts. When we did our evaluation last year. There was a kind of a really worst case scenario. If everything really pushed out in time and based on discussion with are several different Consultants. We both agencies decide to not budget for that. That would not be normal to budget for that. But that helps just give I give us a magnitude of how important is to manage the Project based on schedule. But yes, that is indeed good news and thank you for delivering it. As part of our cost work in early 2018, we work with the executive and Council to identify possible scope and cost reductions. These were included in our cost estimates at the time in our 570 million dollar budget since then we've continued work boot continue to work to realize these cost reductions as well as others. I want to update you on this effort. We've been able to partially or fully realize for scope adjustments which are shown in the left box including plans for a refurbished tunnel boring machine value engineering recommendations construction State staging savings and also Street use permit credits. We were not able to realize three of the scope adjustments the Wallingford in Ballard convenience projects could not be constructed earlier due to construction constraints of multiple contractors being in the same place. Also to put potential reductions the tunnel bit alternative and Odor Control won't realize because we made other bigger changes by removing the social pipe from the project. We are the we no longer which created a net Savings of 10.7 million dollars. We could no longer realize these specific adjustments and it's primarily because by utilizing existing pipe as opposed to the larger diameter pipe, which is a 48 to 42, but it's a different slope. We're going to need to drain the tunnel at a slower rate and because of that we're going to hold a combined sewage for a longer. So we want to have Odor Control and we no longer wanted to entertain a possible smaller bit alternative. We want to utilize all that all this. You know, what all this was validated based on modeling to make sure that we're still okay in the long run. So we were not able to realize the car savings, but they were part of a greater cost-savings innocence. You mentioned in the timeline showed that the the storage tunnel is out for bid instructions to start by the end of this year and I can't tell how big a piece of it. But I imagine that's a large chunk of the project when we get those big back big back will that reduce further reduce risk, or is that that opening in work on that is a big big big milestone and I'll talk more about that actually. So once we get those bids in that uncertainty goes away and I'll talk about that a couple minutes on the bed. That's well. At least know what it is. Good beds from the right people. So we're continuing our work on on scope and cost reductions as part of our strong project management practices were we're never stopping this. So we're constantly managing our uncertainty. Some risks has designs become more developed and bids are received or uncertainty and cost estimates decreases. For example in the past 9 months we've received bids on the ballot early Works project in as I talked about that came in under our bid amount estimate. The storage tunnel is also moved from 90 to 100% design with this information or uncertainty on these cost estimates decreases. We proactively manage risks that could impact the project cost and or schedule each month we look at our top risks, which is shown here and kind of what we call a tornado diagram. And we assess their likelihood an impact. We determine what management strategies can best reduce our risks. We also update our uncertainty and risk confidence model every four months in the next three slides. I'll discuss three key risks and uncertainties on the project right now. The risk event that were managing relates to our consent decree Milestones or trending. Well, as I said earlier, we're training well to me our construction complete Milestone at the end of 2025 with a one-year stabilization. 2024 and 2025. Are there risk events can cause design and construction delays that impact this Milestone were mitigating these risks by in implementing independent constructability reviews on all of our designs getting the best contractors. We can and having experts monitor the work of our contractors. We also place a great deal of team and management focus on keeping each project on track and looking for ways to accelerate our designs in order to mitigate this risk. And uncertainty were managing is the storage Tunnel construction package. It is our largest construction package by far. So it holds significant cost uncertainty for this Pride for the overall project for managing this uncertainty and risk in many ways including drove it up over a year. We've been reaching out to potential bidders including minority and women business enterprises throughout the area. This is included in Industry review of our designs and specifications in the summer of 2018 where we received over 200 comments from tunnel tunneling & specialty contractors. We also had a bidding meeting last week. We had over 60 attendees II of these meetings is happening as we speak out in Ballard and we are continuing efforts like this throughout bidding. Over the last year, we've been finishing up the tunnel design. As I said, this means that we're reducing uncertainty in our cost estimate amount last met our estimated range on the storage tunnel s bid was plus 30% - 10 and now our range has decreased 2 + 20 - 5 our current cost estimate shown here is 220 million dollars. In order to manage our risks. We're also evaluating the bids that we receive based on experience and also the safety record of those firms. So you're my focus is to make sure that we good good quality and good quantity of beds. So we have a major milestone for this uncertainty approaching. We're currently advertised in the construction package for bids were received bids in the summer. And at that time we'll have more certainty on about 80% of our total construction cost across all of our projects explain a little bit more about how what you just described as preparation for the bid process helps manage uncertainty. The more the more contractors know about the project it's so it's knowledge about the project comfort with the owner themselves and their ability to work with the owner. And then also I would say risk and risk transfer. So we've done a lot of Outreach events. I personally have been too many telling conferences Talking Too Many Emily tunneling manufacturing but tunneling contractors to also second tier Subs people who make pumps reinforcing so that they know about this project. We've been pushing out notices to people the entire industry was able to review for 90% plans last summer. So they've been thinking about this project and thinking about ways to do it better and how and giving and informing us And then lastly risk transfer is a big thing. We have 2 as an owner we have to think about how what is the who is the right person to hold the risk? So we have for example, we have pushed of course some of the risk andeles to them we have if they have to hit certain dates, they need to hit a date to be off of art Ballard site so we can start our Pump Station if they don't hit that date, they start entering liquidated damages. That's a risk that they clearly own are the risks and I we've taken on so that they that they understand that risk transfer the this is I'm sorry 17184 tunnel somewhere 18 foot 10 inch diameter hole in the types of people that bid on light rail construction companies would save you have this is similar enough would do that or it's like, oh, no, he's are completely different worlds. What kind of bread and butter I mean eyed 18 foot 10. Is that as you pointed out a standard Transit tunnel? So I'm not to knock Bertha Bertha was 55 foot diameter work totally in the conventional around so really in the nice thing is there's a lot of actually nice refurbished tunnel boring machines in the 18 foot 10 inch diameter that with contractors will likely be able to utilize so we expect the contractors were talking about do these type of tunnels. This is by far as the biggest is the most prevalent diameter tunnel the soil conditions, you know, there's been a lot of unfortunately in Seattle. So we have a lot of good data on that are micro * 8 foot diameter tunnel that goes underneath the Ship Canal when emphasized we accept to town tote tunnels the county actually just put in an 8-foot diameter tunnel about a football field away. So we have a nice kind of test tunnel for that tunnel as well and we and we supplied all that information to the bitters. So it sounds like it's likely they will see bids from companies that do other time lights project as opposed to a water versus a Transit project for the for the construction world. There's just there's a lot of similarities exactly and I would say the similarities are not only us but deep shafts. That's a really important part of this project tunneling firms don't usually the deep shaft so they will partner in a joint venture with someone else and then there is some standard piping projects in underground structures. So we work to keep construction impacts and issues to a minimum but large construction projects always have more risks for this project construction impact slightly likely include 7 years of construction noise. We have noise mitigation approaches like sound walls and adjusted work hours, but we still have we will still this will still always be an issue that we always be working on also course increased traffic will be using barges as I said to take away. So I'll from the tunnel to reduce about 17,000 truck trips. We're also working to make tiling operations an underground construction very successful. We've hired a consultant for tunneling and deep Pump Station construction expertise to be part of our team. They're looking at our design and specifications to answer bespaq practices also be part of our construction oversight team and to monitor construction processes and our contractors. We're also developing response and communication plans. So that stakeholders and the public will have good information this includes and building upon a significant Outreach we've done in these five neighborhoods the past four years of the project us far. I'd like to emphasize The Importance of Being prepared can eliminate all risks and uncertainties, but we can prepare for them. So we're spending a lot of time and effort on that. Lastly will continue to communicate with you on a regular basis about this important project through our semi annual reports. Plus we have upcoming other upcoming Milestones as Mommy discussed in April or May will return to this committee to request authorization for our budget Proviso to proceed with the physical construction of the storage tunnel package. The summer will know the bid price of the storage Tunnel construction, track package, but I will also have an updated uncertainty risk model and an updated overall project budget and confidence and we plan to come back to you with this new information and these items later this summer. so Waterbeds in the summer. What is the typical amount of time it takes on what you have those bids to make a decision and then executed contract. The first thing we do is we analyze the bids to make sure they're they fit the requirements. We actually will probably be know whether the the bids are good with in about a week to two weeks part of other work. They're going to be doing with Mommy her executive team and also with our partners in the County's is to think before we open bids if the bid amounts are at the certain level at right where we target them. What would we do if there's a higher what will you do and if they're lower what we do so that we can we want to you know, really every day counts want to move directly into a warding the contracts to the bit that you the right bitters. So again, just ballpark. I know it did probably take from when we actually receive the goods actually a warning me about two weeks to award the bid after we open bids. We expect a nap time. Amount of time that it typically takes actually negotiate the contract the contract is all laid out of sorts that needs to go reaffirm their bonding and bringing their bonding and insurance. We won't probably execute the contract with them until about 4 to 8 weeks after we award. It will cost you want to aim towards the four-week. Though. And then the Milestone timeline that you provided showed construction happening in mid 2019, but we have a groundbreaking on 2010. What's what's the the contractor would mobilize to the Ballard site really putting up fencing occupy an office space those kind of things late in 2019 actual the first thing that they'll do from an active construction will be starting that hundred and twenty foot deep shaft on the Ballard site to start tiling operations. So we're targeting the groundbreaking to be more towards around that event hopefully in early first quarter of 2020. And so the time the timeline that shows construction starting in mid 2019 mid late 2019, that's more pre-construction direct design to construction. So there be a lot of submittals ordering The Time Tunnel Boring Machine such. By the way, sometime next month or in May. April or May we're submitting it in 2 weeks and then I know that we're working with Council staff to find the right time to come in. But well, thank you for coming and preparing us for that that next step that we need to take together with you and really appreciate the work that you're doing and Congratulations again on this next reaching this particular Milestone, and I look forward to talking to you more and learn more appreciate counseled stewardship over this project. Thank you. All right with that it's 11:36 a.m. And I will adjourn the meeting.", "end_time": 7408.4}]}