{"format": "raw", "annotations": [], "confidence": 0.9540792010400606, "data": [{"start_time": 0, "text": "Good morning. Thank you for being here for a regularly scheduled briefing on August 12th will go around the room and just sort of give a preview of today's full Council actions. I'll go first and say that customers Bagshaw. Whereas a mosquito are here and there's no objection the minutes of the August 5th. 2019 meeting will be approved. An objection those manager approved for. For the full Council today at the first item of business. I think all of you are aware of will be to a reconsideration of the mayoral vote on sweetened beverage tax. And so that'll be presented first on the agenda and look forward to everyone's comments and I will probably at the beginning talk a little bit about the veto process love you don't understand that when it applies what its purpose isn't so I just spent about a little less than a minute on describing the process with every first on the agenda. And then from the governess equity and Technology, we have three items. I wanted the creation of the code reviser position in the city attorney's office in and talk about that at a briefing which we think so great position looking at some of the inconsistencies and how are legislations proposed and sometimes you have to do one. Is it good to say a do-over because of all the complications it presents and so this is a means to create a more. Efficient and effective way to go about the legislative process in the city attorney's office gets the support that we need. The second one is a technology matching fund legislation $320,000 of city funding to many organizations out there in the community that are doing some great work to address the digital divide and we have 11 new projects in 2019 that will prescribe. The last one is a approval operating FAS to enter into a 15 year lease agreement Cascade public media witches formerly known as kcts television where she'll Information Technology continues to operate a radio and antenna on the Capitol Hill Tower. So those are three things and with that counts my back's turned over to you. Thank you. Hello colleagues. Thank you so much. I cancel my room is gay to thank you for being with me last Friday to helping us get through the budget items. I know council member was you're going to talk about live in D5 and how and how all that that worked out on Saturday and results of the rain. I would just want to let everyone know that we've got five items on the agenda this afternoon in the finance in neighborhoods committee. These are all related to budget and we had a special committee meeting last Friday. We suspended the rules so that what passed out last Friday Could be voted on today and prior to that meeting. We had a previous meeting where we actually went through almost line item by light on. We have any exceptions ordinance a carry forward or which means items that were in 2018 that weren't completed but we had budgeted for we have the supplemental budget ordinance that was important because there are a number of things that all of us were interested in funding and again cast member misguided. Thank you for all of your work and help on that and I want to highlight a couple of things one is the green Janet calling at the green janitors ordinance, but what it is around Queen Building for training for in the private sector on using alternative to some of the caustic cleaning materials that are often are used and this is something that has come forward and other cities have been doing this. It's making a big difference both in terms of work. Health but also just how the buildings are being kept. So that was kind of a small But Mighty $35,000 add and then we also offer adding an ordinance that will put an elevator in the University Heights at their Community Center. I will talk more about that this afternoon, but what just broke my heart was a description of a young girl who is in a wheelchair at a summer camp this summer who had to literally crawl up the stairs to get to the point where she was able to join in with her companions at the summer camp so bad and of the fact that many people just can't get up to the third floor to see the good work that's been done by many of these nonprofits. So that was a unanimous pass and recommendation that we pay for that the supplemental budget. So we will be moving forward Wheels have a CIP Bannerman ordinance and a grande acceptance ordinance. The abandonment just means that their projects are completed. There may be some addition. Finding leftover that goes back into the appropriate fund and the grant acceptance. We need to accept that so that we can spend the money that have already been identified. So that'll do that is those are the last five items on a budget today. I know there's a lot of other conversations that are going on. So just asked everybody holding on your patience because I'll try to get through them as quickly as possible that they are really important to get voted on today. And then we will have a financier neighborhood committee this Wednesday. We will have another discussion about the RV legislation. I think that there was a pretty good discussion at the table last week council member runs gate it again and thank you and councilmember O'Brien were here raising concerns are the kinds of concerns boil down to the individuals who are in these RVs. These are the ones that are so dilapidated. They're considered to be unhealthy. We need to find places for them to go and I one of the additional amendments that will I think Mike's going to bring forward today. Is that will put $100,000 into an account that will help us find places for those individuals to go. It's really important to all of us that we achieve. The the multi things that the mayor is trying to do is to clean up these very horrible looking RVs that are on the street, but at the same time not through the people back out on the street and cardboard boxes intense. So I think we can get there and I've I appreciated the mayor's crowd coming down and talking to us on Friday will have another conversation this Wednesday. We also are going to have seven items for from Seattle City Light that have been moved over from council member mosquitoes committee because she's focused on the hotel workers this next meeting. So we'll take those over move them out to our committee and then we've got some Human Resources pay Zone and position list ordinance that we will be voting on as well. So that's Wednesday, and I know you're excited. Thank you very much. Mr. President and hello counselor number of bags. Thank you for having me in your committee last Friday. I really appreciate all the work that you're doing to lettuce and have a discussion in your committee on some of the more money policy issues does relates to for example, the transfer of the Yakima and properties? Thank you for that, and I appreciated all of your work on the budget and for our work together. Thank you on green janitors on the you Heights on making sure that the HST inflation adjustment was included for next year and the capital Investments that are still needed for the growth and potential kitchen facilities at some of our partners who work in the native community. So really excited to be working with you on those items that came through your committee for full Council today and that the housing Health Energy and workers rights committee. We do have two items on the full Council agenda for this afternoon, its resolution 31893 and Council Bell 11925. 90 these are both pieces of legislation that relate to the legislative action that was taken earlier this year from the state legislature on House Bill 1406 that would authorize Seattle to act on the brand new Revenue opportunity to build affordable housing that was passed by the legislature. So we are going to be working in Partnership to make sure that Seattle in King County are moving forward to take the every opportunity we can to not only access the dollars at the state legislature has offered and again just want to remind folks. These are not new tax dollars. This is allowing Seattle and King County's access those tax dollars directly so that we can build affordable housing a part of what council member herbel than I have been talking about as she is co-sponsored legislation as well as a bond against some of these dollars to make those dollars who even further so at the very least we got about 50 million dollars in hand. The mayor is going to be enthusiastic. About this later today and we're really excited that we built this city council and acted so quickly to take this opportunity and run with it. So thanks for the executive and thanks to the office of housing for helping us move forward so quickly on this meeting on August 15th. That's this Thursday and just by way of reminder. We do plan to start at 9 a.m. Because our agenda is still taxed that the first part of the agenda for the belt the first hour, we will have discussion on two pieces of legislation that come to us from Seattle City Light and these are in line with some of the goals that we were talking about related to the green New Deal first is a solar program that we are going to rule out to establish the ability for larger commercial buildings to include solar panels on their roofs of we want to make this not just something that it is of applicable for smaller buildings, but especially for midsize and some Larger buildings so larger than a hundred thousand kilowatts. I believe is how I built on the Seattle City Light Western Energy imbalance author Authority ordinance, really just making it possible for Seattle City Light to enter into the Western Energy imbalance markets that when we have Surplus energy we can sell it on the market are energy is cleaner than most others are given that it doesn't rely on any fossil fuels and we want to make that energy available to others so that people are having to extract less Wiseau fuels and use our cleaner energy. I'm at times where we have a surplus. So it's it's exciting and then at about 10:15, we'll start on the hotel worker legislation. I just by way of reminder again, this will be meeting that will be slated to end at noon at our goal is to get through the discussion related to Hotel worker safety the various States. Provisions that we need to put into place when nobody's Frances harassment intimidation assault on the workplace and then the other component is access to healthcare wanting to strive or high quality affordable health care for all of the workers. I'm in a hotel building and that will be part of the discussion on Thursday. So briefing and possible vote on those two components and then just as a reminder no final vote is being taken on Thursday. We're going to hold the entire package which has four pieces of legislation to September 5th, and we'll have a chance again to see the full package all together consider any cleanup amendments amendments that might have come forward at that point and that'll give us another two and a half weeks or so to really think through that the package has a complete package and then potentially vote on September 9th. Thank you again. When we have a really exciting resolution that I have copies for you all here. I'm excited that today. We are going to be bringing forward a resolution that mirrors with 11 other cities have done so far. This is a resolution in support of the call to end the blockade with Cuba many of our other City colleagues across the country have taken the opportunity to follow with some of our Congressional members are calling for which is really the end the blockade with Cuba recognizing that a multiple times. The United Nations has had an overwhelming vote to support ending the blockade 189 votes 189 volts is the majority of you and delegates -2 and really just asking for us to be on record to say not only is it a lose-lose situation because the individuals in Cuba are not benefiting from the interaction the National dialogue the cross National learning opportunities in Cuba, but we to in the United States are not benefiting from some of the groundbreaking medical advances that Cuba is making some of the Innovative strategies that they've been able to deploy especially related to a maternal and child support preventing infant and Morty infant mortality rates extending the life of individuals there through life-saving medications. They have a better they have a better life expectancy than the United States does on average. And so this is in line with what many of the organizations across the country are asking many of their City colleagues for and if I met mr. President, there is 11 cities across the country that have adopted similar resolution, Richmond, California, Berkeley, California, Oakland, California, Massachusetts, Hartford, Connecticut, Sacramento, California, Helena, Montana, Minneapolis and a Pittsburgh Saint Paul Detroit, and then there's five other cities that are currently considering a similar resolution. So I would love for your support on this and if I might be able to bring the sense full Council today, I think it's going to make a huge impact and just want to give one more. Thank you to Cindy Domingo which many of you know, she's a labor and civil rights leader. And she also currently works for council member Larry Gossett and she has been leading the effort over years with a u.s. Women in a 10 cubic collaboration bringing delegations down to Cuba to ensure that there was greater cross-national interactions and opportunities to learn from each other and she has been working with me on this and will be here today with a handful of the folks who have had the benefit of participating in her program. I'm so if there is any questions, I'm happy to entertain those but I'm really excited that we will be there in 12 to making it a dozen cities across the country that are calling for Action. So quick question are there's one whereas in here that Should draw some attention and it says whereas 189 countries voted in the United Nations General Assembly in November 2018 in favor of lifting the US embargo against Cuba with only two countries the United States and Israel opposing the resolution. And anyway, I thought that was contact for what we're trying to do just so I understand it is this the first time this has been presented to us or is this strictly 3 mail last week? I might have missed in history introduce and vote on it this afternoon. But sometimes we have to use available tools to us, but I would sort of discourage. Publicly handing me a document and ask me cuz I haven't read it yet. And so I'll just not a preferred practice because we treat yes Thursday and Thursday afternoon. We approve the agenda. And then usually there's something somebody's working on Friday that me know and I can get an email out such that again complying with the opium made by the way, we try to get it but you know when I'm presenting something Monday morning for a Monday afternoon vote. I like I just say she's not a preferred my partner if you work on this and if it pleases the council, I would love to bring It Forward. Okay, so let's go back this way to cast member herrboldt. right development and arts committee meeting tomorrow on August 13th going to have the first discussion on to tenant protection items. One of those is protections for survivors of domestic violence from being held liable for damages caused by their abuser. That's Constable 1195 98th. And the second proposal is a bill that protects the rights of Roommates in family members that are living as Co occupants from categorical denial or evictions as counsel Bill 11 9606 modeled on a tenant protection law in New York City. We will be having the second discussion and potential vote on our eviction harmonization bill. That's Council Bill 1195 84. This is the legislation that harmonizes our City's just cause eviction ordinance with recent reforms passed in the state legislature this last Obsession and the three main components that this bill will make sure that are just cause eviction ordinance is consistent with the new state law is first extending the 3-day pay or vacate notice for non-payment of rent to a 14 day pay or vacate notice. We will be making sure that rent is defined as recurring and periodic table charges identified in a rental agreement and and clarifying that when there is a non-payment that rent is applied first before other class, like late payments damages legal costs are other fees so that the tenant has the ability to make sure that payments that they make go towards the late payment of rent to ameliorate the likelihood of being evicted for nonpayment of rent. I'm in and finally the the bill extends the minimum notice. 260 days in advance for all rent increases instead of 30 days for most rent increases in 60 days for large rent increases, which is the current law in Seattle and and under the new state law that all rent increases regardless of the size will require 60 days advance notice. So those are the tenants protection items on the Civil Rights utility economics development Arts committee agenda for tomorrow. We also have a couple of other items one is social impact study of the Arts that will hear from Martin and then we'll also hear the 2018 rent waste prevention and recycling report from Seattle Public Utilities letting us know where we're at in waste reduction and increased Recycling and then finally we are going to be having a presentation from Other jurisdictions regarding their success with every other week garbage collection Linda night who's the solid waste coordinator for the City of Renton? We'll talk about renton's processing what they've learned in the last eleven years since they've had every other week garbage pickup and will also be having a 350 Seattle joining us at the table to talk about what they know about the successes of other jurisdictions other items coming up for me this week. There will be a regional committee meeting that I have to attend for the Flood Control District on Thursday. I have office hours on Friday at the South Park Community Center before between 2 and 7 p.m. And then lastly I have no idom's from the Civil Rights utilities account development committee on today's full Council agenda. A good morning everybody. So I'm excited. I'm a little bit not too much but besides we get to a happen in life and if I became light in D2 but most exciting is out of the Civic development public Assets in a vacuum use committee, as you know, we've been working on legislation and resolution on June 6th of this year our committee hosted a presentation by the urban Indian Health Institute as well the Seattle Indian Health Board on the missing murdered indigenous women and girls the epidemic face across this nation in Canada. And as you all know Seattle is ranked number one with the highest rate of missing murdered indigenous women and girls in the country. We now know that poor data racial his classification and the lack of government-to-government Partnerships or a few major factors that have directly contributed to such a crisis obviously in our country and First Nations in in Canada. I want to thank a solicitor and Abigail alcohol Who have been working? We've been working closely with and showed up at our committee to give public comment and a presentation so over a year ago in Spring of 2018 as chair of native communities committee. I submitted a resolution calling for the city to assess its methods for collecting data on American Indian Alaska native trinities in women. These communities faced is disproportionately high rates of homelessness poverty and income inequality. So it's important that the same provide services to communicate to communities who need it. I've been working closely. We have been working closely with the urban Indian Health Institute to draft legislation that would address and I W G. I have a resolution listed for this afternoon's introduction of referral calendar which kicks off what will be a series of legislative efforts to reform build reform and build a stronger City system that responds to missing murdered indigenous women and girls case work accurately and robustly. I'm excited to work with my colleagues on these anticipated legislation as well as Mister Pete Holmes who we've been in contact with our Attorney Dan satterberg at King County prosecutor. And of course Chief Carmen best I should add that on King County put together a subcommittee on missing murdered indigenous women. So we're looking forward to working with their subcommittee as well. So it's my mission as chair of the sipna and as a Seattle city councilwoman to work closely with the Seattle Indian Health Board and other experts to stop this ongoing crisis. The resolution is slated for a briefing in our next committee meeting. Our next committee meeting is Wednesday, September 4th at 2. So update on Parks. We have two events going on that I want to share that we've been working with parks on number one is the teen summer musical it but Benaroya Hall Seattle Parks and Rec Atlantic Street Center in Langston Hughes Performing Arts Institute will present the annual teen Summer Festival Uncle Willie's Chocolate Factory. This is the culmination of a 9-week summer program that showcases the talents of dozens of teens of color providing them with an introduction to the world of theater tickets are on sale at the Seattle Symphony. Benaroya Hall website the second event is the big day of play that Saturday August 17th at 11 to 5 at Rainier Playfield at the community center in Mount Baker rowing and Sailing Center. The big day of play is a date to play your way as we celebrate our City's diversity build relationships and get active together. So we're hoping you attend bring your family and friends and neighbors for a full day of healthy activities Outdoor Sports water activities. And as they say here tons of fun event is free. But okay, I'll be there. This is this event is free presented by the Seattle Parks and Recreation. Let's get moving initiative and it was right out of episode of Parks and Rec. This is a great story about what community really means because not only do we get rained out and we were at the park at seven or eight we couldn't set up any of the Stage B. Is Parks and everyone said you electrocute everybody? So with that being said I want a really shout out to brindle and Shayna and Dean and Tyler in the community members that showed up we had to act quickly on the phone to contact more than 30 vendors 3 Bands A petting zoo literally said don't load the animals and drive up here Outdoors for all and any more vendors. We also had a food truck coming down from the Tulalip tribe, which is already on his way. And so anyway live and defy became live in D2. So we all loaded up everything and we headed down to the Rainier Beach Community Center. So we attended the Rainier Beach action action coalition's back-to-school bash where every year they give away backpacks and school supplies to kids and it actually worked out great. We just got on the phone with everybody. We said everybody show up at 11:45 at the Rainier Beach Community Center Rd 5 and a ton of our community members got in their cars. We brought down all the food we handed out. And shared our food with over 500 kids and family. So are salmon or fry bread or rice or smoked burgers are homemade jet Berry, Jam everything cupcakes that were made from Hillary's coffee klatch had the defy pretzels, which she tried to make him look like D2, but that did not work out. Everything was just wonderful we word it was packed the Tulalip tribe and Tribal member Ryan gobin who owns Ryan's res recipes get a phenomenal job. He was on his way to another wedding. He had to turn around and go south. It was great. The pretzels came from coffee Clash on Lake City Way our friend Anita other Goods came from Hillary cakes. She's a new Local woman start up business, and we wanted to help her out and we gave away everything for free and it was wonderful. I am particularly enjoyed watching people try to make Indian tacos and lot of people just gave up and said I just want the big piece of bread thing. I really want to compliment staff. Especially Michael Stevens at Seattle Center. Larry Henderson. Just save the day Martha Winters from sale Parks and Rec for helping us with his unexpected change of plans. I want a thing when he should Herald equal rights Washington being a wonderful Stewart and making sure we got our tables and everything set up. It just was just a good feeling for one sometimes for all of us to remember why we have these jobs and even though we're in districts that it's just We're just in District, but we still represent the city of Seattle and it was really fun. Just redirecting everything South and having everybody come up to me and just be so kind and so nice and enjoying the food and so our bands were a little disappointed, but they did not want to be electrocuted. So they understood so we will be rescheduling live in D5 and said probably the first week in September so definitely was an episode of Parks and Rec and we got it done. Oh, yeah. Oh, yeah. Oh, yeah because he has a present I have to do at 2. Do you still thank you. Thank you. Count the resident. I'm going to read a few remarks from council member take a tattoo who's not here today to finding land use and sustainability planning land-use and zoning committee has one item in this afternoon's agenda. It's the comprehensive plan Amendment docketing resolution circulated on Friday in his language too. So, I'll be bringing that amendment was just add some more language to the document specifically around industrial and calling on the city to start an industrial and process and come back with a proposal twice in time opening time for the actual comp plan amendments in 2020. The planning land use zoning committee does not have another meeting until after the recess. The next scheduled meeting is Wednesday, September 4th. In addition in September. There will be two special meetings. One is a September 9th 5:30 p.m. Meeting for to do a public hearing on updates to the city's state of my rental protection policies and then on Wednesday, September 11th at noon. They'll be another special meeting of the fuzz committee. Now on to the same ability and transportation committee, we have four or five items on the agenda State dependent. I want to count the veto override. I believe that already on the agenda. Describe some procedural issues and then we'll dive right into it. We have the ordinance out of committee that would approve the 9 million dollars funding for the streetcar. This is the the funding that will get through the rest of the kind of engineering and design work on the mayor has asked for this and has indicated her support for moving forward contingent upon hearing the news that will learn as we do for their engineering work. My understanding is it's probably about it close to a Year's worth of work at the 9 million dollars through Amber Pacheco is not here this morning. He think he's coming in this afternoon. And so what were you saying about the land use piece? I'm sorry. We the big lake on plan docketing resolution is on the agenda this afternoon. And so and then I have an amendment to that. So in committee, we made a few amendments related to Industrial and with the understanding that there was some more language you want to work out and that was circulated on Friday believing and so I'll be bringing that Amendment to the council is circulate on Friday. By the way, I I read the resolution and thank you again for look forward to supporting it out of the one point. I want it and we did get some note from some constituents and commissioner Feldman at the Domain at the Port about some concerns about some of the language in the resolution. He will be here this afternoon to testify. Historical practice with likely to have him first to to testify and so I just I think he might have emailed everyone as well. So I just wanted to forewarn people question on that. So I met with the report folks last week as well as your resolution the second one that you're proposing is that going to address their concerns about wanting to have the entire industrial lands review both North and South before we take final action and docket it. Is that what your resolution is doing? Yeah, and I've I've been sharing this with with a Port Commission Fred Feldman be the point person that we've been dealing with and I believe this is what they support but I don't want to speak for them. Especially if they're going to be there the the Amendments that we made counselor Miss Kate and I made in committee and this Council today essentially strip out removed from the docketing any of the industrial and so there was a proposal in the original legislation to docket the stadium area study in addition to three specific parcels and Industrial lands and waist ripped all those out of the underlined docketing resolution and the amendment that they're going to bring you today as language that says the city should start an industrial and processor restarted this it says we should build on what's been learned before it lists about a dozen stakeholders that should be included in that process. And so that's labor and business important parent time and stadium in neighborhoods. And then it also says it would be I can't forget the exact language I use but it would be premature to act on Industrial and chain. Such as and I talked about the stadium plan waska those three sites are in there until we have Oso from the mayor on an industrial and policy if it has been approved by the council and what about that can be completed in advance of the comp plan updates next year. I'll just leave the timing of that has not been set it traditionally March, but that'll be a future Council will decide that received indication from someone in the mayor's office that they were planning to have it by then. I'm not sure frankly how realistic is the end of the people that are conveying that are Recognize a time later on so I don't want to I believe they think they can do it and I think they're probably needs to be a few more conversations before we are confirmed. It just really a process convening of some stakeholders reviewing a policy can happen. If in fact that timeline is going to be March but it again next year's Council will decide when that's going to happen. I've had spoken to your office and we agreed that we would not put any specifics into this amendment, but I would just like to indicate for those of you who will be here next year that a couple areas. I'm very interested in as 1 is to creating the Makers Space which is south south of the the Mariners Stadium now if there's a couple of block areas there's a warehouse there and I would love to have explored the idea that that that is retained is a makers place which essentially means that you're you're creating something there whether it's furniture or weather. It's clothing or even a brewery there, but to explore the possibility of allowing residential on top of that. So they're the industrial Atlanta preserved but having affordable housing the people who work down there can afford to live in so that was one and the other is since the port is moving into Pier 48. I believe that is going to be a passenger passenger ships. Now, I would love that to explore the possibility in the WASP inside of allowing hotels. They're not permanent housing because I've heard enough from the poured in from the folks that work down there. And if you have affordable housing and impacts the 24/7 nature of the port property, but if you are weird to explore and allow hotels to be built on the waska property that supports the Seahawks stadium would have will become the XFL Stadium as well and the Mariners Stadium and Support with a passenger ships. So it just won't would like to put on the record that I hope we can explore that don't know the answer, but I just hope somebody will pay attention to those possibilities. I could entertain an amendment to my amendment in addition to Port Maritime Labour business Stadium. We could have former council members could be included on that commissioner like that. Former council members going to be out of town for earlier, but I appreciate you bringing the number of Ryan's work on this a language that was amended on Thursday Friday last week around Friday commissioner Bowman and had a chance to talk to commissioner Calkins as well who Express their appreciation for that amendments are just wanted to pass that on not sure if I'll be here this afternoon, but also we have heard a lot of support from the maritime unions as well with the desire to recognize that the city is changing that does mean at some point our footprint changes as well. But how do we do this in a way that's really thoughtful looks across the city and doesn't piecemeal the properties up for discussion and allows us to think about industrial lands the future of work and then also a couple that with the needs for Public assets like housing in parks and things like that. So I'm I'm excited about the potential next year when we see that plan come forward, but I think at this juncture, I'm everybody if I've heard from his very supportive of the approach that was taken in our committee last week. I think they were some folks may be the stadium Folks at the center of it that would prefer to move more swiftly on the waska site because that will likely be up for sale from for being Surplus from watch. Sometime in the next couple years and whatever is zoning that's under the time and surplus will obviously tell and how I guess we developed and some of the other sites adjacent to the stadium I believe they recognize that making any substance of changes to Industrial and prior to a policy being adopted is probably unrealistic with his Council and I think there's a lot of frustration from folks on all sides of this fit an industrial and policy update has not been concluded that I really appreciate the mayor. I believe we'll hear more this week. But I believe the mayor is committing to doing that process and I mean, I'm not sure how that's going to end up obviously, but I think there's a lot of folks it would prefer something other than the status quo and whether they can reach him kind of doesn't matter. We'll see but the amendment has pretty broad support with the exception of probably Stadium folks and their allies. It would like to see us pull a couple Parcels out and move earlier, but I don't think that's really not with my and then it would do very good. Communicate with wash. I'm about the future of the waska site to provide some assurances to the proponents of the stadium District. It won't knock it won't be sold before we have a policy discussion around the land use designations of a bet site. I just sensed that even others is perception that they're on a fast timeline to dispose of that property that we as a council and together with the mayor might have some influence on their timeline if if we were to initiate that request and conversation clearly conversations. I think I don't know enough about the wash. And the State Surplus property disposal rules, and if there's any sort a timeline, my my sense would be that if there's potential and use changes to a property that might change the value that watch that might get Going to be some alignment about kind of coordinating efforts and so be open to working with you on maybe sending a letter to watch. And asking them to let us know about their timing and what their objectives are and start a conversation probably want to bring in someone from the office of planning Community Development into that too. Kind of maybe That's one of 20 things of me to talk about hair. So there go ahead. I just want to mention the streetcar in New Orleans today. That would have proved $99 in funding to American proceed to the streetcar is on this afternoon's agenda. Say about the street. I'm inviting things to be said about that. I'm dollars. I do want to say that there are two areas that I have asked as to not to follow up on now for the better part of five years and one is the frame abilities stroll strategic plan for downtown because if we are removing much of the freight delivery on 1st Avenue and removing the parking so that we have dedicated lanes and I am a fan of dedicated Lanes if we're going to do this, we've got to make sure that block by block we have places for Freight to pull in because package delivery downtown is increasing as we all know, so I've asked them first with kubly and now with Sam Zimbabwe to pay attention to that we got started the UW was helping us. It's not like it's new news, but we haven't gone block-by-block to figure out how the freight is going to move in if we're going to require things like temperature. Deliveries like between 9 p.m. And 5 a.m. Or however we're going to do this but that strategically we look at that whole area and the second is on 1st Avenue to please look at north of the stadium left turn signals on 1st Avenue because what happens is cars get blocked up behind both going north and going south and they try to turn left and they are there darting the signal at the last minute because there's no there's no middle turn lane. There's no way for them to get across and so I've asked him to look at this point for the freeway streets University spring Marion James just to take a look about what can work and now going towards the Waterfront. I'm also on Madison, I believe we need to have a dedicated left-turn light. So as we're going forward with this, I'm just again expressing my concern that we don't have the system, right? Again, I'm going to support the 9 million dollars, but I'm going to ask the mayor's office and ask. Too seriously take a look at those two issues permissive. Turn Lanes vs. Protected. Turn Lanes. I think that's the engineering term where you can go if it's a versus know you have a light in you go in otherwise, you don't and when you're when you have a protected turn Lanes, then The Pedestrian environment is also controlled so that there's not the conflicts that statue with on right turns and on on left turns and I'm interested in something in advance of the budget or maybe during by Chad. Maybe it's a Sly to taskus talk to to Really come back with a comprehensive plan on maybe downtown or Citywide about the permissive vs. Protected. It's a safety issue is consistent with vision zero. They're they're obviously doing a lot of stuff on protect. It turns downtown with the transit to keep that that moving a lot of those lights have changed over the last year, but I would love to get a comprehensive look at that. So maybe that's something we can work on import course. This is about pedestrians. The cars can stop thinking slow, but it's one pedestrian start and then left turning a right turn in cars going to get frustrated because they've been sitting there through multiple Cycles by the end it and especially First Avenue is becoming a very cool pedestrian quarter between Pike Place Market in Pioneer Square and the stadium in the arena lots and lots of people walking and lots of visitors that aren't that they just don't know what the traffic flow is on that street. So thank you for the premise of is definitely dangerous to pedestrians cyclists to because you'll find a find a driver that is anxiously waiting there. Probably holding someone out. There might be someone hanging behind them. They see an arrow into the they want to speed through, but they've been focusing on the cars and I'll put us there is a lot to pay attention to and so it may be time that we would take it away from a lot of those. So, thanks. We will have the green New Deal resolution before the council this afternoon at committee last Tuesday. We passed out of committee but also discuss the series of amendments counselor Bagshaw had suggested some men to know you weren't there, but it's submitted those to meet advance. So we talked about a tree Amendment council member. So I want had about half a dozen amendments that she brought up at the table and counselor Pacheco had an amendment or two also Incorporated language for all of those into a single substitute that I'll be bringing you should have received that also on Friday with all the language sale but moving to substitute that and then adopt hopefully. The green New Deal resolution just following up on that. There's an ordinance that we had considered voting out of committee on Friday, but we're going to hold that until after the recessed that green New Deal ordinance would establish a green New Deal oversight board and then put the Board in to the office and billing environment and so just have some more work to do both with community that apartment the mayor's office to figure out the composition of that board with their specific tasks will be things like that. So we'll keep working on that. That won't be there today. We see her in a second. I have amendments to the what do we call those budget supplemental budget? But please speak further and thank you for bringing this forward. Absolutely. So we had a discussion on draft ordinance. It hasn't been introduced yet for the Mary-Kate regarding vehicle living productive policy conversation. I wasn't clear from just looking at the ordinance. So some work to do that. One of the questions that it came up was I believe that the ordinance discusses some sort of setup where the the Vehicular vehicle landlords that are leasing out their vehicles if they were in violation by not maintaining them in a proper way would be subject to fines. And then the tenant could recoup those fines. It's not clear to me what the mechanism would be is for the compensation to help them transition out of that housing. We discuss the committee like if we really want to support the the residence of these vehicles who are living in poor conditions because their landlords not keeping up the vehicle appropriately telling them to get your money from the landlord didn't feel like a appropriate a timely way to address. I'll be a crisis there in and suggested instead. We should do what we do and how those people and say the city will we'll have a fun and we'll pay you and we will go collect from the landlord after that conversation Central staff older than me because of some changes in the budget of the supplemental budget there. There was a little bit of money available and so worked up this this amendment they would put $100,000. From the supplemental budget into funding for individuals that are transitioning out of RVs. My intent of this is this money could become available immediately. It would not be subject to us passing or continuing to work on the mayor's vehicle vehicle residence ordinance. It would need to wait for anything in the future. What I heard the table. I think there was consensus around is there is some people living in some pretty awful conditions in RVs and whether those are a RV landlord that's not meeting the quality for the qualifications that we may choose a setup or not. If they're in bad conditions and some resources could help transition them into more permanent housing. Let's make those resources available. There's nothing preventing us from making those Investments and getting those people out of those situations right now. They show some pictures of some RVs that look completely uninhabitable as we know some of those exist in our concerns about the ordinance about how it might be used but no concern on my part. On spending some money on individuals that are living in awful conditions to get them in a better condition. So council member consalus emailed over the weekend. She will not be on the call for this amendment but ask me the question is this money intended to be used for direct support to residence or is it intended to be used for administrative cost for the city or both and my intent is it for this for direct support for residence, the language here says is appropriated solely to provide assistance to people experiencing homelessness who occupy Vehicles. So I think that's pretty clear. But I'm just going to double check with Central stop to make sure that that's explicit enough or not. But you know, we have been working on a number of options including are they have a new name for it? But it's the landlord liaison program. That's now operational. I am a real fan of supporting that program and making some of these units available to the folks. Add for trying to help find a better place to live that isn't the only way I really believe that there are tiny homes, even though it help people argue about whether it's a good place for for folk. It is better than living in an uninhabitable RV in my humble opinion and I asked the mayor's folks last Friday are there spaces available right now? Could we could we identify places for people to go that are 24/7 if we were to say you can't live in this RV because you know, it's just absolutely unacceptably on an uninhabitable. I don't get a yes answer. What I've heard is well we've got shelter. Well putting people in overnight shelter does not stabilized them. So I really want us to push during this budget and I'm supportive of this amendment. I want to push to make sure that we're increasing the supply and the places for people to go and again, we're going to come back. What are we going to do on a budget? But we've got to have places for people to go and you know, whether it's every to own our toolbox with landlord liaison or the modular housing or the tiny homes understanding it's just part of the pipeline, but I don't want to be taking people out of what we know is maybe their last-ditch place and just take away the RV in and destroy it and say good luck your back out on the sidewalk in your cardboard box not acceptable. So I believe that we're going to get there with the mayor's office. But thank you for that. And thank you to Alison MacLean who coughed up the good idea. I heard what had a comment. Thank you. I appreciate that. The approach that you are pursuing come from a Brian is very similar to what we do. When a b c d determines I'm sorry, sdci Department of construction inspections determines that a tenant is living in a place subject closure because of an emergency order. The landlord is liable for the relocation costs, but the city does not wait until the landlord pays the tenant in order to basically front the front the relocation cost to the 10. So I think that's a really fair approach moving forward. If the desire is to really assess the resident of the RV to get into another place. My question is though that you mentioned earlier that this the budget action that you're proposing is not dependent. Pond the legislation proposed by the mayor of the RV Rancher legislation in passing. So if that is the case, what is the mechanism for residents of RVs accessing these dollars because I think as I as I understood it that if it was if it was connected to the RV ranching legislation for lack of a better term, what would happen is that the city would be in a position of Taking or impounding the RV and in exchange granting the resident of the RV relocation assistance. If this budget action were to pass absent that regulatory Authority. How do we envision getting the resident of the RV the relocation dollars? This will be dependent on the executive taking some initiative here, but my intent would be there with the Myriad of Outreach work. We're already doing whether that's the navigation team or other Outreach efforts to people living in RVs. There were needed near we need to set up some sort of program that this says hey, you know, if you find a person in these conditions, you never hear some more money, they can help. You know, if it's if it's a person that would be a good candidate for a landlord liaison. Let's plan that if this is funding that would just help transition them into a tiny village or something else. That might be a better move. There's not a specific program that I'm aware of that funds things exclusively for folks living in vehicles, but I don't think it would be terribly difficult to set up North with a need to come back to council to create that program. This is something that I believe they could do. You know, we have allocated funding for a RV safe lot that is not is not been sighted. There's other things we've done about vehicles at the money sitting there. So my hope is that what I heard at the table on last week was executive staff department staff saying do you know do you agree that the conditions of these people are living in his deplorable and we need to do something and I agree with that don't necessarily agree with approach to Lisa's drafted in the legislation. Maybe there's a place to get agreement. But if we agree that there and had situations I want to give those folks the funding so they can go out, you know next week and start getting the people that The worst conditions into something better and but I don't have a specific for me. They could use this money probably to augment, you know, the landlord liaison whenever the current name of that is or or a host of other things, you know, they could use them for vouchers people that are going to be at Kohl's to come in hotels citizen is intended to be flexibility if it's working for the population, but but how they would use that is left up to them and my hope is it that they follow through on the their urgency around this and do something immediately because that would be outstanding support this but I do I want to voice concerns I have about the equity of providing basically relocation assistance for people in RVs that we don't provide for people living outside in equally deplorable conditions. I'm so just from a policy perspective. I'm trying to wrap my brain around why A people living in deplorable conditions in RVs are more important to fund the relocation cost then people who are living unsheltered 100% of sheltered outside with you there and I would certainly be open to thinking about different language now or maybe it's work we could do in the coming weeks for whatever reason we do tend to divide our money up into buckets and says money this dedicated RVs and money divided 210 accountants. And I agree that I'm in an ideal world would just say would find the folks that are in most need and go to them first regardless of what type of structure their living in we do know that when folks are trying to clean out a certain area because it's dangerous are problematic or whatever. They'll forgive people in a certain area Priority Access the shelters and I struggle with Adam. And so I think the question you raises is really fair, of course, it's because you know this work really well and tell if you have any suggestions I'm certainly open to that cuz I agree with what you thinking about. Where you should have a few more correct? Customer very, okay. What kind of popular Russian are you reaching for the scourging at? I want to thank councilmember bagshot for helping to facilitate that conversation last Friday that wasn't an easy discussion and I did have to leave right as director goings was doing this analogy about how we wouldn't allow for dogs to sleep outside in these conditions. Why would we allow people and I just want to comment because I didn't have a chance to comment in the moment. I am hoping that going forward. We all refrain from using any of that type of analogy. I think his intent was to say we need to treat folks. Humanely. I think that was his intent Do you think that the way in which the analogy was presented was not helpful with creating a constructive dialogue about what are the options that we have in front of us just to be very clear. We want to make sure that individuals who are in poor living conditions have access to healthy living conditions access to showers access to lockers access to case manager is absolutely dark Council has been on the record was wanting to provide additional Supportive Services both for shelter housing and case management and Health Services that you've been leading on so, there's no doubt that we want to make sure people have a healthy and safe place to live. I think the real question in front of us is why this approach and as we move forward, I appreciate council member O'Brien's attempt to make sure that we are creating an alternative for people who are living in their vehicles. But as council member bags I said, we also know that they're doing this as a last-ditch effort as a last resort to stay with family member. Send pets in to keep their belongings. This isn't an option people choose as their first option. This is really the last option to keep families together. So my my questions my skepticism about this approach really do all I know is what council member herbel just asked why so much attention specifically on this population when we know over the entire spectrum of folks were living outside living in tents and living in RVs. We've got to help folks get inside but the questions that council member O'Brien a steering committee have yet to be answered in terms of how many of these slumlords on Wheels do we currently have? Is it to people as a five people you asked in the answers weren't they presented? So I think from our perspective, you know, I want I want us to be super clear with the public. Absolutely. We want to help folks get into safe places to live so that they can be with loved ones and get on a pack of stabilisation. The question is not do we value that as was proposed at the table but more How much of this legislation is actually going to help that concern and and legislation matters write the words matter and the language is it currently is drafted. It is very difficult to tell that this was intended to go after those sort of Slum Lords on Wheels. And if that is our intent we need to know what the with the scope of the problem is. So I'll be supporting this amendment today as well, But I do think that the bigger questions that are out there is how much of a problem is the marketing of these vehicles and if it is a problem, how do we direct legislation to those individuals who are taking advantage of and being predatory in their nature for those folks? Who do you need a last place to live? So those are the questions that I have but I am happy to support this amendment today. Very good customer and I'll be quick on this last one. This is a transportation committee does have a meeting this week. It's a special committee meeting on Friday morning. I believe at 10 a.m. And so the agenda items on that we will take up legislation for discussion on oil heat ordinance that the mayor's proposed which I'm supporting and sponsoring here just a quick overview that would phase out oil furnaces in the city of Seattle over the next decade and it would impose a tax on oil used for heating oil per ball to the utilities packs of Cokes pay on electricity or natural gas also and the revenue from that would be dedicated into transitioning low-income households off of oil heat on to electric heat. So this is Variety of reasons but is consistent with our efforts. Certainly help with the resolution to pass today to eliminate all fossil fuels In the City by the year 2030. This is a 10-year plan to do that for oil heat. There's about 18,000 homes. They estimate that are still on oil heat. We've been transitioning off through through a program similar to this without the tax for a number of years quite successfully but the idea is what's accelerate that program with this additional funding from attacks and finish this job over the next decade. We also have a piece of legislation that would authorize the mayor to sell the Mercer Mega Bloks does the blocks on the northeast and Northwest side of the Dexter and Mercer intersections. So, when's a little more Mega than the other one that they're too big blocks and so vote on. This. These pieces will come back to committee for a vote in September but a discussion of all the terms of that the old and they are made an announcement last week. So take a lot of folks have discussed that so folks have questions or want to learn more about that. This would be a good opportunity to ask him those questions customer base. I really appreciate the wonderful opportunities in South Lake Union and I believe 30000 square feet. It was going to be dead at dedicated to a community center Algood. Can you as you're going through this find out if there's going to be childcare attached to that? We know that like in West Seattle one of the larger community centers has childcare within that is very effectively integrated into the community center. So I've heard when I raised that before people say, oh it's too hard. I don't believe it's too hard and we know there's a giant need for more child care. So if you could just ask about that and see if we could push it forward. Thank you. Thank you, Relax. I know this is an area where we continue to have joint interest and when I've talked to you the folks at the city about the potential sale I said we really need to have childcare here as they look at the community center space. It shouldn't be one or the other you can absolutely have childcare that abuts to the community space that maybe families use for events with the kiddos. I'm even have a playground outside that is maybe open to the public when Child Care is not occurring. So we've asked them to be very thoughtful and would love to work with the parks chair as well because I understand that Parks will be directed to implement the use of I think it's about thirty thousand square feet. And I think that for us to be explicit explicit about the desire to have a child care center embedded in this facility is going to be really important for the council to get behind and you know, yes, we know people need access to things like amenities like Jim's but if you do a quick Google search, I think there's like over a dozen gyms in Scary if you do a Google search for childcare, I think I found four in that region. So the need for childcare not just for the folks are working their let's say in the tech sector of the people who are coming into the city for working in Industries around that is critically important to the people aren't stressed about getting home with their commuting in from out of the city or from fire areas of our city so that they can be right next to their kiddos. So thank you for raising that and I'd love to work with you all as we think about emphasizing that importance in any legislation before it's moved out keeping your eye on the ball on this project over many many many years you and former council member Licata a number of years ago sponsored legislation envisioning this area to be terrific campus. Style development with a number of different public purposes served with the public property. The underlying idea behind the vision was that this is an area of high access to opportunity that the city was investing a lot of money in and that a variety of people of different incomes different demographics. I'm should have the opportunity to benefit from the city's Investments. So I'm really excited about the affordable housing in the area. They the community center the childcare wondering are there other open space some of the other public benefits that we had talked about a number of years ago in volved. Also, I'm Workforce Development and having a physical location for that kind of interaction between people who I need to develop your skills and the primary Employers in the area. Is that something that is still being considered as part of the mixed with this development that I still think is a great idea have had trouble getting the type of traction with either employers or you know ngos that would want to do that and set that up specifically, It's not part of this transaction as far as providing space for that. I still believe their continued to be opportunities Amino the employers hiring and have huge list of jobs. They can't fill in or searching the whole planet to find people and would benefit from people right here in our own Community don't need to be relocated getting the skills to do that. And if for some reason it, you know, it may be that these organizations are doing their own and Workforce Development in on Partnerships was not with the city. But I have not been able to crack him, but I think they're still opportunities there. Thanks for bringing that up this week in review on kuow last week featured a conversation around the Mercer mega block cannabis Olson at David and Erica C Barnett and I was really impressed with the dialogue in sort of some of the features that they highlighted of this parcel. I know that over the years has been relatively controversial but it might be worth taking a listen to that piece from last Friday again, I was impressed by some of the pieces of the highlighted as a benefit back to the city and I think you know as this legislation moves forward with you, you're all leadership. There's a few pieces that we can add into it, but it was a relatively how refreshing conversation be here and appreciate their in-depth analysis of the proposal as well. How to register a drain work through this I believe the city did a really great job then when I say the city and 1.2 a Steven Shane who visit a city near the mayor's office or where he lives right now, but having someone with that level of real estate expertise who understands the comprehensive interests of leaders of the city and negotiating on our behalf in a very few know kind of secretive, you know, real estate negotiation away is a balancing act for sure, but I'm impressed with what we have. Of course, you know, if it doesn't have everything but I do think when you add up the value that we're getting for the various things we discuss today plus the you know, a hundred plus million dollars will get cash for this that we can dedicate the things the cost per square foot for the land. The resulting selling is a premium compared to what other pieces sell for in probably one of the Hottest real estate markets in the country right now. And so I'm really impressed with that and I think it speaks to having really quality expertise at the city needs to really good results and I'm grateful that Steven's on our team. We will also a few more items on this Friday's agenda. We're hoping to take up legislation around Transportation impact fees. The the discussion is dependent on these passing legislation is dependent on a hearing examiner ruling relative to our ability to update the comprehensive plan with a transportation project list for transportation impact we expect to get a ruling sometime this week if we get the ruling and it's favorable we will proceed if we get the ruling and it's not favorable will probably scratch that and have to figure out what the new timeline is base with the hearing examiner says if for some reason that the ruling is delayed I propose we would still go ahead with the discussion with the understanding that it may be moved to 10 a.m. Over here in the future. No action on that but just a discussion about a proposal around Transportation impact fees with some dollars attached to it. We had a number of high-level three things before starting to get specific on Friday. We discussed legislation about bike safety. I'm specifically about complete streets. I have of legislation that we passed out of committee that we discussed in committee that I hope to pass out this Friday that would essentially say that repaving projects worth more than a million dollars if that Corridor is identified in the bike master plan for protected bike lane that that protected my clan needs to be dealt. It does leave some wiggle room. I mean, I've clearly there's there's ongoing room for Community input on how to design that protected bike lane where it goes. It does leave some room for the Department of than they are to come back and say we think the conditions have changed and it's no longer makes sense to do a protected Atlantis Corridor, but it's at the process that they need to go through as opposed to just a decision point Decision on 35th Avenue Northeast it felt like that was just a decision without a lot of counseling but at least so the idea would be to prevent that from happening again. There's also a resolution about implementing the back bike master plan. The mayor's office came to us in March and it was a revision in June and this resolution would call for essentially L fund the supporting the idea items they lay down there but additionally saying the current implementation plan for the bike master plan means that at the end of the movie Seattle Levi in five years, there will still not be a fully connected corridor from Southeast Seattle to downtown. There's two or three projects that are in the pre-planning phase for the next five years, but not even the planning or funding and we really calling them to find a funding source to complete at least one of those corridors before the end of the move Seattle Evie. The last thing I'll mention is that counselor Pacheco has a resolution and Kim. That we discussed on Friday calling on us. To increase the number of a call on street bike parking Corrals and that would support a whole host of things including keeping bikes off the sidewalks so that we have the sidewalks available for for all sidewalk users. But especially our most vulnerable users. This would help support some work around the Bike Share programs of free-floating Bike Share programs in any other free floating share program. That might come forward in the near future counselor Miss Kate. I don't know what that would be but and we may have some more language about enforcement in there. But that will hopefully will vote on in the committee on Friday and throws it all come before council at the recess council president. I am done if you want to call in other people, but I'm done. No, I think we're good. We're good. Look forward to a lively discussion. 7in counselor more scared of you just can't help yourself. I got to take go ahead and close this close this out. Earlier conversation and I don't want to break the rules. So I just wanted to emphasize I did learn from our team that the resolution to go out on Thursday afternoon as a link to the agenda. So we included it in an email you all had to call it out, but it wasn't there. So thank you for the reminder from going forward so that I will do that and thank you again ever left that it did often and it's been over the years that we've just tried to give this is an important piece of legislation. I had now the opportunity to read it and you have and I think there's some really good stuff in here, but it just doesn't give us the public dialogue that we want any pushback on any of the language we have to now do it behind closed doors and then presented that afternoon that's not consistent the spread of the Opium. That's really what that's about as actually nothing to do with the great work you put in here and I just think again, that's why she's not a preferred process. We want to make sure the public that's why I've committed meetings. How were wordsmithing these documents but she has some very rich stuff in it. Sure. Look forward to supporting it. So well that will see everyone at 2 will have cash wherever she is to join us at 2 in Copenhagen join as she's known her. She's probably watching this briefing right now. So we look forward to hearing from her and I guess we won't be able to hear much about a trip on that, So I will take care of our business, but I will see everyone.", "end_time": 4477.4}]}