{"format": "raw", "annotations": [], "confidence": 0.9253661183987634, "data": [{"start_time": 0, "text": "Start City Council. So, this is March 4th 2019 city council meeting has Dale City Council come to order. It's 207. I'm Debora Juarez council president pro temp of the council will the clerk. Please call the roll. SWAT Gonzales council president pro tem Juarez a present. Thank you. So before we begin today today is kind of a historic day not because of me but I want you state a territorial acknowledgement that we are indeed on indigenous land and that of the Salish people with that said as we stay in it in country, let's go for today in a good way from a good place. So is that will begin the agenda? Thank you. We'll start with the adoption of the referral calendar. I moved to adopt in the introduction and referral calendar. Cancel a mosquito. Thank you madam president. I'd like to move I'd like to move to amend introduction and referral calendar by introducing resolution to 68 entitled a resolution relating to city council confirmation Andre confirmation of City department heads the council intends to follow Skyrim General criteria that the council intends to consider when evaluating the search process for an appointment and department head candidates superseding resolution 30962 and by referring it to the Seattle City council full Council Thank you. It's been moved and seconded that the introduction referral calendar be amended as stated. Are there any comments? Ocaso members want thank you prison Juarez. I will be voting yes to include this in calendar. Resolution redirect council's intended procedures for considering mail appointment for Department director positions and it asked them ahead of time of she intends to select a nominee. I just wanted to clarify just in the interest of not having confusion among a member of the public who may not know what's going on because you know, everything's lucian's appointments all of that. Just wanted to make clear that this resolution that will be discussed and going on later this month. I think it is not in conflict with the resolution that we have under boat today because that resolution does not reference the the question of the nomination of the Human Services director at this moment. Illusions are doing separate things. And so I just wanted to clarify that the resolution that is referencing the what the mayor should do about the Human Services director appointment is still going to be in play today. Thank you. Can't Force One cast for mosquito. Thank you for passing out a copy of the resolution that I shared this morning. This one has a highlighted version so that you may see from the council's perspective. What language has been added to council member? Look how does a resolution that was originally passed in 2007 and just to reiterate for the council as we discussed this morning during my morning briefing resolution focuses on Merrill nominees that have not yet been submitted. The resolution is to help ensure that Seattle City council has a good understanding of the process executive had used it before nominees in the future and clarification and importantly it's resolution recognizes that all departments are very different different Scopes different levels of Engagement. And so it is really an opportunity for us to have a better understanding of what the process was for each department and their unique characteristics. So the selection and Confirmation and processes afford to the city council in the public really give us an opportunity to better understand the goals in the vision for Department directors. What is the focus of this resolution look for it again to working with all of you on Council and Community to identify a possible suggestions questions. You may have within the next week and our hope again is to bring this before full Council by May 18th. Again, we're just moving to put it on the introduction referral calendar and everybody will have an opportunity to speak to that. We have Congressman or congresswoman pramila. Jayapal on the lamp. I want to move quickly to some housekeeping matters and it will catch up and I'll have councilmember Gonzalez make a few words. So those are favored the amendment vote. I Those supposed to have no emotion carries any further comments seen on those in favor. Can the introduction and referral calendar as a man to vote. I those opposed phono. The motion carries an introduction and referral counter is adopted as amended. So let's move on into the agenda approval of the agenda. If there is no objection to gender will be adopted. Doing this new Leaf Oaks. Okay, you gender is adopted agenda signed approval of the minutes in Minnesota, February 25th. 2019 City Council meetings have been reviewed if there's no objections and minutes will be signed hearing no objections to minutes are being signed it hard to do that. Okay. I'm sorry. I did that. All right. Now I'm just do presentations now. I'm not aware of any presentations today. Right? So let's go into comment at this time. We will take public comment on items that appear on today's agenda the induction introduction referral calendar and the city council's work program. How many people do we have signed up 50/50? So I will in a moment the public comment will be accepted for 20 minutes and speakers are limited to one minute of public Comet speakers, Exceeds one minute the clerical turn off. The microphone speakers are asked to begin their comments by identifying themselves and the agenda item they wish to address the clerk will call up to four names at a time if Name is called police lineup it either podium one. That's the middle aisle podium one. Emporium to go by the window so we have four people lining up then we can just move along and everyone will have their minute to speak. However, before we begin our public comment, we have an elected official that's requested to provide public comment. We have council member Gonzalez's resolution is on the agenda and my understanding is as we are lucky today to have congresswoman pramila. Jayapal have speaking to support the medicare-for-all resolution that will be proposed today by council member Gonzalez is a custom. We are going to allow the congresswoman to speak first. So I'm going to ask that we unmute the phone and allow Congressman or congresswoman. I'm sorry pramila. Jayapal that she can begin her public comment. Thank you so much. Thank you council president Pro Temp Juarez city council member Gonzalez and the entire city council for inviting me to testify I am so honored to represent a good part of the city of Seattle and honored today to speak on behalf of city council member consalus is resolution supporting the Medicare for all act of 2019 last week. I was proud to lead a hundred and seven of my colleagues in the US House of Representatives as original co-sponsors in introducing this Landmark legislation that would transform our Healthcare System and guarantee that every single person in our country has access to Healthcare in order to do so, we know we have to bring down costs and improve health outcomes all the addresses today in America. We have the most expensive healthcare system in the world spending double what most Pure Country and yet our outcomes are actually the worst of all Countries of all, the industrialized countries in the world. We have the highest rates of mom dying in childbirth the highest rates of babies dying and we are the only industrialized country in the world for life expectancy is going down not up every single day too. Many Americans are sick and dying because they can't afford insulin or Cancer Treatments that they need even as the price of prescription drugs are soaring and insurance premiums are going up by double digits overnight. I've received so many letter emails and phone calls about the medical cost at Seattle lights are struggling with just the other day. I spoke with a constituent who is hiv-positive and who's medications cost $5,000 a month and still paid a staggering $35,000 a year in premiums deductibles and co-pays unacceptable and that's why my bill tackles the Deep sickness within our four Prophet Healthcare System that puts profits over patients even if people die because they can't afford their treatment the top pharmaceutical companies are raking in 75 billion dollars in profit every year in 2018 alone the health and medical insurance industry token 43 billion dollars in profits and the United Health CEO Tacoma 83 million + CEO to come 59 million mm thickness CEO to come 44 million dollars and quality everyone in one single large insurance that work we provide comprehensive coverage primary care and individuals with disabilities and everyone gets to keep the same doctors and hospitals. In fact, you'll have more Choice than you would have with the increasing restrictions of private for-profit insurance companies who increasingly Too many providers are out-of-network or not covered and mine was pushing gets rid of Copiague private insurance premiums and deductibles and we bring down costs from matically by getting rid of the administrative waste at those for profit insurance companies and negotiating for lower drug prices. It is a bold and ambitious plans, but I believe that the people of Seattle and indeed of America are ready ready to ensure that Healthcare is a right and not a privilege available to everyone not just the wealthy. So I am so grateful to my friend comes councilmember Gonzales dance. Council for introducing this resolution I want to thank you all for your hard work and your dedication to ensuring healthcare for all of our City's residents and for all that you do everyday. Thanks so much and I'm happy to answer any questions if anyone has them or let you get onto your public comment. I would love for people to ask you questions, but we have an agenda that kind of packed. How do you think I have to have to say? No, but I wanted to call you later. Thanks a lot. Jodee, go ahead and we can start the public comment and we'll go for 20 minutes and we'll see where we're at then. Excuse me. I'm going to call for names. If you can all please come and line up at each of the podiums to Upper Podium. First name is David Haynes at the second name is group The Wheel women in black on number three is your vet denish and number for is Paul. Novaski. Great. What's her number? 4th person I got before person. Okay, let's go. search we need a second referendum amendment to once and for all hold the entire social welfare industry of government and non-government employees accountable get all this for one person's job is another deceptive guarantee that the corrupt social welfare. Ministry is getting off the hook walking sparring to have another corrupt non government official one of their own put in position to guarantee that they can get a salary raise at next budget cycle acting like they need more money to actually saw the homeless emergency crisis while the whole time oppressing the poor keeping them desperate. So there's always a demand for more money with the same unaccountable 200 billion dollar government and non-government contractors. There is over 20,000 Social Services employees government and non-government making a living off 12,000 Home Estates sheet daily shortchanging subhuman mistreating denying services for lazy lying about Bankers hours efforts. It's obvious. The city council is trading the integrity and proper interpretation of accountability of the social welfare industry as long as the activists and political operatives within the nonprofit. Do the bidding of city council re-election efforts to Sharita? Okay, sir. Sir, thank you. Your time is up. Who's who's next the queen bee group and we are going to give you my understand 2 minutes. Good afternoon, Seattle City council members. I am queen bee King Rios. I am a member will and a leader of women in black last year in 2018 women and blacks the silent vigil for 120 outdoor by violence test. The chair will shelter Network provides a warm safe. Loving Church Bay shelter Network for clean and sober homeless men and women. I thank God for the women Wheels women's low barrier shelter that accepts any woman in any condition at any time of night with the no turn away policy. And it's the only one of his kind in the city of Seattle. The city asked will to start this as a winter shelter almost 20 years ago, This made it is now a year-round shelter. If you can see, we surely need it more today than we did then women are scared and Afraid. Good afternoon. I'm a nature Freeman a participant in Sharon wheel since 1995. I have seen Human Services directors who worked collaboratively with Cher and wheel that is not been our experience under Jason Johnson after this Council voted unanimously to fully fund Wheels shelter for two years. It took two months for the human services department to send us a contract and then they told us they would send us for only 6 months with no guarantee of any funding after that. When you are homeless, you cannot focus on anything constructive when you're terrified. The women in the wheel shelter some of the most vulnerable women in Seattle are now terrified that their shelter will be closed. Please start the search over again and get us a director that won't do this to people. Thank you. Good afternoon Council about Diana's. I'm here to speak on the fact that in 2017 legislation was passed for the race and social justice initiative. Well, fine, then when it was packed and now the Seattle office of civil rights as World fully understand how they could not be effective or efficient and handling concerned that they would know about funnel through so I had of the budget process. I'm hoping you to take person so they can do what was that just say that they should do it. Also people in my community the south in Genesee way to be or up in arms over the talk of having an overnight parking for people that live in the card at Genesee Park, so I'm going to let you know that there's going to be some pushback on that they want and committed in put on people living in their cars being able to park at Tennessee Park overnight and thank you for being the temporary Hector. That's pretty cool. Like that, I'm done. Thank you. Thank you. Who is Kim Sung Hae? I'm actually actually look at the research research people is that they perfect and what happens is because of the malpractice they have cost more. So if you have a cell phone, which is actually cost $2.50 and you sell $4,000. That's the reason why and the other thing is I'm doing a city council member 342 atmosphere. Do you have a nice day? Thank you so much for people speakers 5 through 8 Joseph Saint Aubin Tyrone Kenny, Joe kunzler & M Z gifs folks come on up so we can make sure everybody gets a chance to speak today. Go ahead of me. Take me. Okay. My work. You would like me to see that so Joseph Alban. Hello. Thank U Verry council members. My name is Joseph Saint Alban and I am here today because I want to support the council member comes out of zits resolution for Medicare for all Medicare for all. It's something that is needed badly in our nation. We need in my case we need or if he needs long-term care that to be able to choose the facility of birth Choice which right now when can I do there? And also if you're living independently for sale people who do need that have assistants that operate a daycare can't be provided. Thank you very much. How you doing bass city council. My name is Tyrone, Kenny and also a member wife doing a lot of different things in the community. And also I have some things that I should have give out free land to the nonprofit that doing something in your community. And so this is one of the things that I'm up I'm putting together. That is a building for the young youth that ones that don't have a home and don't in the ladies. Also, we going to be very high security. And also we already got a plan for it. Just I need y'all help to give me the land because I'm one you sent you. What do you been put it in the paper in the mayor said she would do it. It's so I've been trying to get a meeting with you to get this land to be able to be fundable be able to be understandable to be able to help the young youth out in our community because we are losing our young youths in the homeless area because someone they don't have a place to stay. They don't know where how to how to be able to have a place to Play the head down to wake up and have food in the morning and we need to help help me out on this situation Amy. All right? Play I feel stupid suppressant. I was saying before us but the people who come here who I just give you a piece of their minds and hearts for better Seattle. But you also listen to you as you listen to us and really just come together as a human race. So really it's important that it's all the city council members in for strongly on Federated board. Thank you. Hi, I'm am sorry. I'm a member of UIW 4121 and also socialist alternative in the context was Seattle's extreme housing crisis, totally inexcusable the mayor durkan would push push through and HSP director has been roundly rejected, but it just you workers and by the people of the city instead of adopting a transparent process and choosing someone who can lead a strong fight for housing Gus's in Seattle on the other hand. It's not surprising given the corporate backers the Americans make yourself accountable to nothing less than bouillon and defeat a bully we have to stand up. I'm really inspired to see so many people here today doing just that. I think we're right to the man that city council stands with us and rejecting Jason Johnson. We expect that the city council listen to people who showed up today jcsd workers and vote Yes on Council Members wants proposal. Thank you. Next we have speakers 9 through 12 and that's Dan Kavanagh David McClanahan. Aaron Goodman and Mike Stewart. Hi, my name is food service worker anniversary today because I think that while we have a homelessness state of emergency in this city. It's really important who is at the head of the human services department and I'm really troubled by the mayor's approach trying to force through a nominee without Community input and then when members of share wheel are standing up and speaking against a nominee that she would threaten to cut funding for homeless Services. I think that's absolutely atrocious having it's the type of bullying intimidation tactics that I would expect from Donald Trump from Jeff Bezos and frankly. I'm not surprised that a mayor who took $350,000 from Amazon would stoop to that level but I think that our council members have a responsibility to say no and vote Yes on council members who wants proposal because we're going to keep building this movement. Under attack. What do we do? Neighbors are under attack. What do we do when our home is named cancer? Please have a seat or done shut off the mic. Okay, so can I just jodee Define there is a reason why I talked about us acknowledging that we are in addition to slanted Behavior. I would hope that everybody would listen to what other people have to say. This isn't a rally. It's public comment and everybody has a right to be heard. Even if you disagree with them democracy cannot live in a swamp if we do if we don't like each other we at least have to listen to each other and that's all I'm asking you to do is to listen for one minute. next four names we can dance time today. It was condensed. I'm in there 50 people signed up. Go ahead sir you to call the portal we have David McClanahan. Hi, I'm retired surgeon with 38 years experience serving the working with the underserved for 25 years pacmed allowed me to set up and stab surgery clinics in two of our safety net clinics Country Doctor in the International District Clinic during that time I saw and care for a thousands of people who came in because I had a late time because of financial reasons and tell their condition led to disablement or an emergency. I would hope that everyone in this country would be able to go to sleep at night without worrying about a medical condition causing them to lose their well-being their Financial Security and their family future. We will not be able to guarantee healthcare for everyone in this country until we have a single-payer national health program, which is what cup Congressman diapause Bill would provide. Thank you. Good afternoon. I married good men with DeSoto business Improvement area, and I'm here today to urge you to vote no to resolution 31862 and immediately proceed with confirmation hearings for Jason Johnson. The Mayor's Choice to lead the human services department. I have appeared in front of this body many times over the past years to share the public health and safety and packs that are cities homelessness crisis is having an employee's business owners and visitors and Soto and on people experiencing homelessness and Soto my folks needed Solutions and actions not political delays. We need this office to be filled with a permanent director who can continue the city's focus on accountability and results to better serve our unsheltered residence and our neighborhood, please vote. No. Thank you. Good afternoon. City Council Members. My name is Mike Stewart. I'm executive director of the Ballard Alliance our neighborhood Improvement organization that represents hundreds of businesses and thousands of residents in the core Ballard. I'm here today to encourage you to vote. No on resolution 31862, which would delay consideration of the nomination of Jason Johnson for the Director of Human Services Department is 4 resolution is nothing more than a political delay tactic that would create an unneeded process and result in lost time and a loss of focus on addressing homelessness Jason Johnson has years of experience with in AHS season is a qualified candidate for this position during his 10 months is acting director. Jason has ever seen an increase in the city's emergency shelter the city's response and improved outcomes by service providers. He's also implemented new accountability and performance measures like performance pay for service providers to help ensure. The city's Investments are making the bits of it fizzes biggest possible impact. I strongly urge you to vote. No on today's resolutions. Thank you. Next we have Christopher Anderson Anitra Freeman, Mary Castillo and number 17 Emily McArthur. Number 22 on your list is conceding her time Tera. When me I didn't hear what you said. I'm sorry. Go ahead. Good afternoon members of the city council. My name is Christopher Anderson. I stay at shares Bunkhouse shelter in the Rainier Valley on February 20th, my community testified to the Human Services Committee in this chamber. We made it clear our support for the resolution to restart the hiring of our Human Services Director of Human Services with an open process based on the city's racial and economic Justice toolkit. Our support for this resolution is even stronger today on February 26th. The mayor's office and Human Services director told us they plan to cut shares contract for indoor shelter Network to six months the end of June 2019 this by past your unanimous decision to fund our community building and cost-effective shelters for the next two years. It was the second year in a row that you had to restore funding to shares indoor shelters after the mayor and Human Services director cut them if the goal of the mayor and the human services department was to improve our shelters instead of ruining them. They would have sat down with us or told specifically to wrap up sir Thank you next. I did get to see me say my piece but Mary is confusion to go ahead. My name is Mary Castillo and I am a staff member at the wheel women shelter the women we help have been on this rollercoaster ride with us fighting for our funding back in November of 2018. All of us took a sigh of relief when the city council all of you wonderful people voted unanimously to approve our funding for two years. Imagine the complete fear and heartbreak the women and us the staff felt when we found out last week that our funding was taken away. Again, the women who utilize our shelter have been coming up to me crying scared wanting to know what they should do. Are we closing and when? Are just plain scared because they think and said to me several times in the last few days. I won't be able to survive if I have to sleep outside. I need you to wrap up man. Okay, so what you did three months ago was a good thing. Please continue to stand up for us and yourselves. My name is Emily McArthur and a member of socialist alternative. I'd like to speak to you know, they just do director proposed appointment. I would urge you to vote Yes on Thomas wants proposed you would imagine in a homeless state of emergency that's been going on for two years has been recognized as an emergency at the crisis in Saint Augustine is a chaotic and and democratic system that moves the goalposts on a monthly basis. That is a legacy of Jason Johnson results results based funding we heard someone speak to Merit pay as a positive thing. And I think it's an actual leadership an agency would be demanding a massive investment and publicly funded housing that we could actually put these people into I think the for-profit housing market is never going to be designed to I serve working class and poor people and we should demand someone who's willing to fight on the basis of working-class and four people in this city. Thank you. 249 249 Sure, if you don't stop them have you removed? Let's go on with the next four people numbers 18 through 21. That's Ava Mets Jordan Quinn, Sarah Stillman and Jenny coverlet. I'm a member of socialist alternative about the homeless crisis in our city and the city is utter failure to address it. They were killed the contacts would have been a substantial measure to address the housing crisis passed a budget with less than 1% of funding to build the previous year and it has totally failed to take this into account with her hsd appointment process, which is super crucial in this crisis in providing services to fill the Gap left by the city over and over people have raised their voices city workers community members with concerns about marriage records process was concerned about director Johnson and his failure to listen to Steph or take into account racial and social justice, and I think it's important to listen to the people. That's right today who testified at all these community meeting and arts a Mantine an inclusive search process. Thank you. I am a Jordan Quinn. I'm also a member social alternative. I think it's really important that the that the council keep the mare and check defend our human services and not defund them like in the interest of a big business just like the mara wants to do I think it's ridiculous that just after a week just a week after homeless Services providers from chair wheel spoke out against Jason Johnson domination of the mayor informed them that you got to be cutting their funding for the rest of the year starting in June. I don't think it sounds like you're finally at all acceptable invited to you today. You know, I think you know, the reason for this they say that they're getting his funding cut effective but it's like you can't hold someone accountable for like not being effective if the city is not providing affordable housing saying that home service providers are doing their job cuz they're not getting people in the house and it doesn't exist. That's ridiculous. You should fight back against that. I think more than that, you know, the city council should be fighting back against Cuts against share wheel fighting back against retaliation, but also fighting a tax the rich and use that money to fully fund the Human Service Direct best kisser. My name is dr. Sara Solomon. I practice Community medicine for many years and I was it my first Council type meeting on the 20th to listen to the stories many of what you've heard now, and I wanted to talk about my particular response to that. For more than two hours people stood up spoke from their hearts most of them volunteering to take care of people less fortunate than themselves and provide housing which as a physician. I mean, that's absolutely critical to help you need shelter. There was one besides congregate councilman still want there was one other council person there and at the end of all this testimony he started Talking at length intellectually about disagreements with one particular person's from have to ask you to wrap up man quickly. I left when the second person started talking on and on and on addressing real people's concerns, and I got out and I realized I could okay. Thank you. Thank you next. Connect Four people, please that we'd like to hear from following a Jenny. We will have a Terry Buckner Sarah Weinberg Imogene Williams and Bonnie Morris. Let's give them a moment to get up here and I don't want to rush him. We have our sorry. I was looking at this late into the communications director at the alliance for Pioneer Square of this is improving area. I'm here today to encourage you to move forward a Jason Johnson confirmation process in his role as acting director. Jason has shown leadership and competency as well. And we believe she's a reasonable Choice room pointy by the mirror our Focus right now and should be on how to prevent an address the homeless issue that's impacting. Our city now is not the time to recreate the system within our city government that stop broken. Thank you next Terry Buckner. Heaven forfend. There should be a break. My name is Sarah Weinberg. I'm a retired pediatrician and I'm the president of Physicians for a national health program Western Washington Chapter. I was speaking on behalf of over four hundred members. Most of us have been advocating for a national Universal Health Coverage program for at least 30 years now is the time really well past the time to provide health care for every human being living in the US you're here. You're human you're covered. So please pass this revolution at sorry resolution & Co Seattle I like what you said. We're here. We're human recovered. I'm going to write that down. Thank you. A picture of a magazine I never saw before Pacific Standard interviews with people who are homeless. I feel comfortable in the Tent City because they feel safe and they don't have to carry everything around with them everywhere we go everywhere. They go. If we would have got the head tax the tent cities would have showers and garbage pickup. That was so wrong for so miserable. It's Jason Johnson. That is the mayor's nominee for Human Services director. Doesn't like share and he doesn't like wheel and he can't talk to homeless people a doesn't like homeless people. So yes on the resolution. Thank you, ma'am. Hi, my name is Bonnie Morris. And I would like to speak about the resolution for medicare-for-all. I'm going to retired nurse for 37 and 1/4 years. I worked at uwmc on the psych unit and we care for all people regardless of their ability to pay. Hey, we did very hard work and worked in a team approach but a 7 to 10 day was never going to cure anybody's major Mental Health. Illness after that 7 to 10 days, we often found out that time of discharge medications were going to cost $300 for a two-week supply of patients that needed intensive counseling. We're only going to be able to get 15 minute med checks at a clinic that they were going to have to stand in line places that we were going to have to go to her too far away or insufficient right now. We spend way too much money of the money we pay for premiums only a third of it goes to directly to our health care and I believe that the Medicare for all Universal single-payer will help with this issue. We will save lives and improve health count So at this time we are going to if there's no objection from my colleagues on my light to extend public comment another 20 minutes. So what would that put us at 3 to 3:10, correct? Okay, let's finish this call for more names and I'm withholding whatever her name is. Now let you know is very imperative to have this I need for sure. Are the women? So they do not get lost and die on the street. That's all I need to say. Thank you. Thank you. Bye. Bye. Bye. Just 4 speakers are 26 through 29, that's Carol Butterfield Olivia Smith and sadika sekine. Okay. Can we have our four people up here? All right. Go ahead high. Thank you for hearing us today. My name is Carol Butterfield. I'm a Seattle resident in a parent and nurse practitioner. I am here today to support I Lorena Gonzalez has and right Americans are brainwashed to believe that we have the best healthcare system in the world. The topmost year of Americans may have this level most don't have access and we are behind most other developed nations in terms of access quality and cost. We are paying for such a system already in terms of profits are write-offs complications disability bad outcomes and the ultimate cost Cost Cutters. It's also not an efficient system, and I would also had that I don't believe that Health Care is a system where there is anywhere for profit. I ask you to support Medicare for all thank you. Thank you. My name is Olivia Smith Osborne race in Seattle. I live in District 2 now and I'm here to speak on the resolutions regarding the employment of the HST director and I'm hoping this will be in open an equitable appointment process. I'm working now with use undoing institutional racism in the greater people's Institute Network including I'm European descent in the village of Hope the black prisoners caucus in this or anti-racist organizing Network, which is touched so many people in this region was invited to Seattle through the hsd and part of my work is to understand our history and I understand very clearly that the people who have been in the department for decades are the people who helped develop the race and social justice in the initiative to help that developed the change teams and who I have leverage money from the city to send kids across the country to learn about anti-racism organizing. This is the Legacy I'm learning. Now and this is one of the many communities and collect as they're being overlooked through this whole unaccountable appointment process and I hope you decide to vote Yes on these resolutions and if you want to consider yourself a member of any politician, I think that you need to understand that your role is to use her we're done. Have the next person ma'am you're done. Please for who's next and please thank you. Again, just ask people to be mindful of other people's time. I don't want anyone exercising any kind of privilege here. It's really not fair. Go ahead man. Hi. My name is a resolution for Medicare for all and also to haul the opponent process of the director position for Human Service Department that has been fast-tracked by the mayor, you know, the person that said that this is a political shift is Ashley from the Marinette from the community. We need a Publix hiring process for this Dept charge of 170 million employees change team of HST and the community voice their concerns. Just the one the only city council member that was there to listen to the community with 128th employees 130 has sign petition calling for an inclusive and accountable process. We need to follow the lead from those most impacted in the city employees to honor their service and come. Into the city as the with transparent Seattle campaign where the community also seek a public process that led to Chris inherit Ali temporary appointment to follow the communities lead that already hold a strong distrust of politicians. Thank you. Good afternoon. My name is a city. Keenan on the Seattle King County. N-double-acp president stand behind. We firmly stand behind Congress to enact the Medicare for all we must continue to fight towards Universal Health Care system that is sustainable Equitable and affordable to all residents of our country regardless of socioeconomic status race gender ethnicity religion legal status as Doctor Martin Luther King states of all forms of Injustice. I mean, I'm sorry for all forms of equality and justice in healthcare the most shocking and inhumane. Despite improvements in insurance coverage since implementation of the ACA disparities persist those least likely to have health insurance include low-income adults unemployed and communities of color. We must invest now in developing systems that will not only physically responsible, but that is morally imperative ladies and gentlemen of the council. Please pass the resolution and demand Justice within break within our broken healthcare system. Thank you for your time. Thank you. Speakers 3333 that's David loud Tracy Taylor Rebecca, Ulrich and Nicole Gomez. Great weekend of our speakers up here. All right, sir, whenever you're ready. Puget Sound advocates for retirement action whom I'm representing today is very excited to support this resolution. And thank you Congress was over a hundred years. We've been trying to get universal healthcare in this country. We've taken some big steps. Now it's time to finish the job. This Medicare for all act would bring our country into the modern era establishing a national Universal plan to meet the needs of all of our people which by the way is the only way to tackle the cost of healthcare effectively and make it affordable and sustainable for us all for those already on Medicare. This bill would greatly improve our benefits by covering dental vision hearing and long-term care and by eliminating premiums deductible and co-pay as with everybody else the medical industrial complex and its political allies are powerful foes. We're going to need a mighty popular movement. Even if we have a healthcare friendly Government Federal Government in twenty twenty One we're going to have to fight like hell. Thank you. Thank you. Hi, my name is Tracy Taylor and I run a business up on Capitol Hill and I'm involved in many Community organizations up there. I'm here to ask you to vote. No on resolution 31862 and move forward with the appointment of Jason Johnson our social service provider. We lost over a year ago. We reached out to our council member to find some funding for that social service provider and have not received help from our council member. This is been held up and if we can move forward with the appointment, we will start to see our services come through. I've been listening to the people in the room today and it seems like issues are being conflated here. Is this about not liking our mayor is this about wanting to change the process going forward? If so, please change the process is this about one provider having difficulty getting their Provisions renewed then let's work on that. But for now, that's a point Jason Johnson hazard. HST thank you, ma'am next. Whenever you're ready, my name is Rebecca. I'm from Georgetown Nicholasville. Today. I'm done speaking about the hsd director of a resolution Jason Johnson. No power to the people and we say bring Humanity back to the human services are two weeks ago. We were told that the well, we had a contract by Lehigh and the leaders then gave us until March 8th to reach an agreement or else. So far Nicholas pill has been given no input into the mou contract. It takes away our democracy and a replaces it with whatever Lehigh decides they want. Over 10 years of hard work and success are in danger. Please be prepared to join us on Friday the March 8th to protect our communities and thank you for all that you've done for us. Thank you. Thank you. I am Nichole Gomez of district 6 I'm here as an individual on a co-founder of Alliance for a healthier Washington and support of the Medicare for all resolution to Congress. I spent 15 years in the L&I Workers Compensation Insurance in a major barrier to recovery for workers comp is non-covered comorbidities if an employee is off work no longer than 90 days many employer suspend personal health care benefits placing them in their entire family on COBRA or in the individual Market in which they usually do not purchase due to unaffordability. The longer an employee is off work claims Costco up and ultimately employers face higher premiums the labor market effects of surging healthcare costs are slower wage growth higher use of part-time and temporary workers and Outsourcing or offshoring or Healthcare impedes economic progress and Universal Health Care System ensuring healthy workers benefits in entire state of Washington and the country representing a resolution Speakers 3437. That's Michael Taylor Judd Krista Diaz, Leslie a Zucker and Kelly powers. Great who's starting who's kicking us off? Michael Michael good afternoon council members. My name is Michael Taylor Judd while several of you may know me personally. You may not be aware that I'm an employee in the homeless strategy and I'm here today in that capacity because I'm angry. I'm angry that council members want thinks it's okay to keep sending email blasts out directly to myself and my colleagues at our city address is advocating that we turn out like it's a rally to oppose the confirmation process around our director. I'm angry that a small group of employees wants to speak out with me about making greater efforts to learn what all of our colleagues in the apartment feel about this and I'm especially angry that close to half of the public comments. You've been hearing this far at meetings. I've come from staff and supporters of a couple of providers who continually fail to meet performance standards who refused to participate in developing Improvement store homeless Services System and have been accused of mistreating some of their clients and or have been recommended not to receive continued. It's true that many of us. Where's the mayor's office? It had conducted a transparent process for nominating Jason Johnson, but that does not mean that we all want to see a national survey. Thank you. Again, I'm not trying to be rude. I just a way of 50 people signed up and I would love to hear everybody. Go ahead then. My name is Krista Diaz and I must Seattle resident and an employee of the Seattle human services department and I'm here to urge you to confirm the nomination of Jason Johnson to continue leading hsd this is a significant time of change and transition for our department specifically as we determine what a regional approach to addressing homeless, that could be a possibility in our leadership is key to ensuring that we continue to serve our communities and be good stewards of public funds. I'm already concerned about the amount of staff time resources and effort spent and swirl around this process. Jason has been interim director for almost a year. Now. He's committed to maintaining continuity and services during a time of great transition and he has shown his commitment to send her in our work and race and social justice is ability though has been undermined by the delay and confirming his nomination. Supporting the nomination of Jason Johnson is a chassis director and being committed to the principles of racial and social justice are not mutually exclusive. Please confirm him and let us get back to work in man Leslie zuker from healthcare for all last week noted disability rights attorney in healthcare Justice activist, Carrie and Lucas finish serving her death sentence in flick by UnitedHealthcare for the crime of needing a $2,000 antibiotic and this perverse profit-making scheme the CEO of UnitedHealthcare to come compensation of 31.3 million dollars in 2016 what Carrie and Lucas needed to ration her medication till her last day like Carrie and Lucas I too am disabled. Why do I deserve to live and Lucas to die according to our for-profit Healthcare System, my life has more value than hers because I come from Financial for oblige. What has more value because when my private insurance company, and then later on Medicare would refuse to pay a specialist my family could simply write a check. We need Universal Medicare for all so that Healthcare is a right not a privilege of wealthy people like my family. Thank you. Thank you. My name is Kelly powers in a vice president of healthcare for all Washington Organization advocating for Universal Health. Care coverage. Hcfa Washington supports representative. Jayapal is National improved and expanded Medicare for all act for many reasons. But today I'd like to highlight the positive impact it would bring to local governments who are currently on the front line for mopping up the failures of the current system. I'm sure I don't have to Regale you with that information and also representative jayapal dominated earlier that I high premiums and all of that. So we're negative outcomes of financial insecurity Pepsi and homelessness dude, unpredictable and storing Healthcare cost will virtually vanish for Seattle residents. Medicare for all will provide relief to cities and counties struggling to use local resources to address these National problems hcfa Washington of this resolution. The passage of medicare-for-all would go a long way to making Seattle more affordable and destabilising Seattle Housing long-term. The number one issue is facing Seattle. Thank you. All right speakers 38, Washakie Patty Dawson, Melissa and Audrey bearing. Okay. Let's get our for folks up here. Okay. I think my name is Gretchen waskey. I'm a citizen of Seattle and also an employee of hsd we've heard a lot from the homeless Services initiative folks and I actually work for Aging and Disability Services initially. This statement is to me or darken for every ounce of resistance you put into denying the collective voice of this community. You have been and will continue to be with a pound of commitment to RSG. Your resistance is proof that you don't intend to participate in the values you professed the city is here to uphold for every attempt to turn racing social justice into a game of smoke and mirrors. You'll be met with the Winds of Change. Two council members before me today has made it clear that she believes the mission for you to feel in your heart and in your gut what has been presented to you today by community members who returns time and time again to bare their souls and solidarity for the transformation. The city's citizens deserve favor resolution 31862 healthy hsd director appointment. Thank you. Hello, my name is Hattie Dawson, and I'm going to hsd employees of 12 Years prior to that. I work for 30 years in Community Mental Health. I was a Clinical Director at Community House mental health agency way, we cared for a lot of homeless and had residential. I'm here is a lifetime public servant last year. I took the required city of Seattle training for a change team on institutional racism. We were challenged to do something simple to look deeper into the reality is if institutional racism and putting in our work environments and takes take action where we can we saw that we have a problem right now at 8th St. We need to address that problem now not later at a more convenient time. While I'm very sympathetic to the business community and I think that should be addressed. We also need to look at race in social justice and what is happening to our employees at hsd I need you to wrap up man. Sorry. I need you to wrap up. We're asking you support the resolution for an open and inclusive hiring process for the HSE director and all the study directors in the future. They time is not later is now they dressing. My name is Melissa Muffler and I'm an organizer 17 and inclusive process in the hiring of the new director at hsd. Thank you. Okay. A resident and an employee of the human services department is Alicia on the table today that asked to delay the confirmation that the Human Services director is example of why we deserve a reputation and demonstrates how we're getting in our own way. The mayor has the authority to appoint her because she's been elected by the people to make these kind of decision because if she had to run a formal process for every single Cabinet member her turn would end before she to get a tablet online. Let me talk about what having an erector is doing to our department. You heard a little bit about the swirl. It's creating but it also means we're trapped in purgatory unable to make any changes to improve our work because we have to consider the possibility that I might come in have a different vision and want different pitches and this constant change of Highly stressful and demoralizing for staff. So we said Frozen waiting and waiting for permits instability. What council delays scheduling confirmation hearing for a nominee who was quite highly qualified and we'll see. I ordered you to uphold the city Charter and keep the cabinet appointment as part of City operations. I know more. They were the last two speakers are rust Saunders and Leslie bullying. My name is Russ Saunders, and I'm sorry. I'm proud father of a child with severe asthma that I nearly lost and I want to talk about Aurora and the need for a 50 m buffer for Public Safety and public you're putting tens of thousands of people at risk of pollution related causes. The Pedestrian plan that you have for Aurora put people right against the street trapped by the pollution. It's a major Trucking Street 3000 plus trucks. Don't create an urban can't Canyon Road that traps. The pollution are most vulnerable population deserves to be safe and to have clean air C1 and C2 protect those people. Good afternoon. My name is Leslie bowling. I am a Seattle resident and District to MHS the employee and they use in family empowerment division director appointment is not about a person it's about the legacy of racism in white supremacy and government. I ask this body to use all of its available tools. With regard to appointments within city government say yes to resolution 31862 say yes to the resolution that council member most get it introduced today. Vote. No on the appointment refrain from bringing the appointment before a vote create an ordinance to change the city Charter regarding appointment only by working together. Can we dismantle the history of racism and white supremacy within our government on February 2028 councilmember herrbold shared about the struggle of separating an individual from the process. I offer you councilmember hair bald and the other way identified council members a resource that has provided me Clarity with the subtle and nuanced ways that we perpetuate white supremacy and God forbid I offer this to you last night. I want to indicate that ice to support the resolution of medicare-for-all. Thank you. Okay. Thank you everybody. Public, today. I want to thank all of you for coming down here. I know you're all busy and sharing your thoughts and your concerns and let me tell you will take that into advisement with that. We're going to move on with the agenda to payment of the bills. Please read the title Council for 11947 t a property manager pay the rent claims and order the payment thereof. Cancel Bill 119-4702 moved and seconded that the bill passes or any comments. Please call the roll on the passage of the Bill O'Brien. So want a banana post bill passes in the travel sign in? All right, we're going to move on with our agenda. So now we're going to go into committee reports. But before that we are going to I believe council member Gonzalez. You're going to be up on a resolution on your Medicare for all and thank you for providing congresswoman. Pramila. Jayapal. So with that I'll let the clerk go ahead and read it into the record. Point City Council agenda in one resolution 31867 supporting the passage of the Medicare for all act of 2018. So I toilet Council Gonzales B minor amendments. I need a mate to the resolution to reflect mirror Durkins desire to concur on this resolution. And then so will I'm going to move for that Amendment and then assuming that a minute passes then then I'll make some substance of remarks about the underlined resolution and then we can have discussion and I vote so that's that's the run the show folks. Okay. So I moved to adopt a resolution 31867. It's recommended that the resolution be adopted. Are there any comments I would just like to describe what the amendment is. A resolution has been introduced. I'd like to move to amend resolution 31867 by adding the mayor's concurrence on the Viet resolved in signature lines and as presented on the distributed and then that one which is at which was at your seats when you when we first started at 2. It's been now I can talk. It's been moved and seconded that the resolution be adopted. Are there any comments customer Gonzalez? I have no additional comments and I would invite a boat on the amendment Amendment all those in favor know. Okay, so if there's a hearing there's no objection. The amendment is adopted. Correct, right? Okay. So after his adopted and his food. Resolution 31867 is amended. Second. Okay, are there any further comments that yes. Okay to speak 7 is a resolution in support of the Medicare for all act of 2019 as most of us are where last week on Wednesday, February 27th and Medicare for all act of 2019 was introduced in the House of Representatives by our congresswoman pramila. Jayapal and over 100 co-sponsors for years Republican control of the House of Representatives has led to inaction and obstruction efforts to improve my federal Healthcare System and increased access to healthcare including be consistent under my name of the Affordable Care Act HealthCare Marketplace in the meantime the total cost of healthcare spending by the United States government has soared to about 3.5 trillion dollars about $11,000 per person the highest per capita spending rate in the world for healthcare. White spending roughly 19% of our nation's gross domestic product on Healthcare the US have the Hmong the worst Health outcomes in the developed world now with Democratic Leadership in the house and it was the leadership of congresswoman. Jayapal Congress is poised to hold hearings on single-payer healthcare policy proposals this my friends would be a first for us at to receive a hearing on this really important issue. And that is thanks to the leadership of congresswoman. Jayapal earlier today during this hearing we heard from congresswoman jayapal on her work to advance medicare-for-all in Congress and I am deeply grateful for her leadership on this critical issue and for her staunch advocacy on behalf of all of the satellites that she represents and I'm really humbled and honored to have had an opportunity to work with her and her office on making sure that the city of Seattle would be the first city. To discuss and hopefully adopt a resolution in support of her Medicare for all act of 2019. It is no secret that the city of Seattle has one of the most significant affordability and homelessness issues across the country and certainly on the west coast. One of the main contributors in root causes to that is the lack of access to Affordable Healthcare or in some instances the lack of access to health care at all. So this is absolutely relevant to our constituents and it's really important for us to make sure that we as representatives of our constituents make our voice collect the voices know as a body to those folks in Washington DC what power to move on these issues and really strongly encourage our residents to join in the effort to make sure that Washington DC can hear us all the way from out here in Seattle. We believe that that Healthcare I should be a right and not a privilege for those who can afford it. So I am really excited to have this resolution before us. I'm excited that so many folks showed up today in support of this resolution. This is just the beginning and I hope that you will continue to support our congresswoman and our entire delegation in Washington DC to make sure that they hear directly from you about why this is important for Seattle and why it's important for all Americans to make sure that we finally address. What is a clearly broken healthcare for profit healthcare system. Thank you. Number Gonzales for bringing forward this resolution very excited that you are leading the way to make sure that Seattle is the first city in the entire nation to pass a resolution. Hopefully this will spread throughout the country as we know that we have a healthcare crisis in this country and it's up to all of us to come together to address this crisis call for action and not just needling around the edges but true reform so that everyone can have Healthcare and that it does not have a profit-driven solution. I like that this resolution calls for action and it's a reminder for us about the urgency in which we need to tackle this challenge as someone who was a chair the health healthy Washington Coalition for almost a decade who had the chance to share the health care of the human rights Coalition with many of you and the audience. We know that our efforts at the local on the state level are only a substitute a placeholder a stepping stone in order for us to get through Universal Health Care and the, this morning But it Bears repeating the folks don't know the statistic by now, please memorize it are the wealthiest country in the nation. We have the most expensive Medical Care in the world ranked near the bottom near the bottom of health results among all of the developed nations are babies are dying earlier. Our elders are dying sooner our people no matter what your income is have poor health outcomes because we do not have health insurance. And if you want to look it up and check those facts, please do because Steven brust rooster right here at the University of Washington talks about the health Olympics. We are failing in every aspect to take care of our population and inequality is a huge contributor to why we have health inequality. So the question for our country is not whether we can afford universal healthcare for all the reality is we can't afford not to fight for it and pass it this year. mosquito so sorry councilmember I got that. Sorry. Just one more cheese on that. Shinto are call for National Action which comes Maria Gonzalez has underscored for us. There's a number of national organizations have done the same SEIU international national nurses United Physicians for a National Health Plan and a small businesses is the lack of Affordable Health Care is also crippling for all small businesses in addition to calling for this action at the national level. I know that I'm joined by my Council colleagues here and our King County colleagues as well as we work on a local Health Plan similar to what Los Angeles has done with my health LA and similar with two wet. San Francisco has done with I'm healthy SF plan in our County and I'm very excited to have been working with all of you and this last budget and also with the King County Council through the leadership of council member dembowski are working on a regional health plan in the meantime. As we work to fight for universal healthcare for all how many of you would like to see MLK care here in our region to cover everyone. Okay Gonzalez for her leadership on this the state legislators who are taking up mini similar bills to expand health coverage to those who've been left out and our King County Partners and addition to all the leadership that congresswoman jayapal has shown on this very excited to have this day come forward and two congressmen pramila. Jayapal if you're still listening or anybody is talking to you about what's Happening Here many thanks. Council member Mesquita and council member was thank you for your help on our Seattle King County Public Health Board because this is where we're going in my mind. This is a stake in the ground for the 2020 presidential elections. So this is this is a good start as a great beginning the fact Congressman jayapal has over a hundred and her colleagues in Washington DC supporting this bill I think is great. We don't need to go through the statistics about being the only major Nation industrial nation that treats its residents like we do it's really time for that to change. We have this I think odious unfair Healthcare System. This is a good start. Thank you very much, and I'll be supporting a resolution. I appreciate it. I want to give a special shout-out to Physicians for a national health program. Particularly. Dr. McClanahan in the audience here today. I have been working tirelessly on this issue for so many years with getting Council to pass us a similar resolution to the the den a single pair of proposal in the house bill 676 back in 2009 that was resolution three one one one one and one of just highlight that at that time. This was definitely a national effort to try to collect resolutions and both from cities and states and I hope that happens again at the time of the council's passage of a resolution supporting HR 676 back in 2009. There were 25 cities and counties and 18 states that were passing similar resolutions. So I'm hoping to see that this is a sort of a springboard for National Action and supported this bill and I think as it relates specifically to why this is so important to us here locally. I want to thank councilmember Gonzalez for sharing information from King County Health early or today, even though the ACA has reduced the rate of uninsured adults here in King County that we still see great great disproportionality. We see that Hispanic adults are 6.5 times as likely as non-hispanic whites to be without coverage and that low-income adults are 7 times as likely as those in the highest income households to be uninsured not to mention the fact that there are the types of of health services that folks are not receiving range from not incomplete vaccines. Incomplete or lacking entirely screenings for colorectal cancer adult Dental visit and a really disturbing presence of childhood Dental cavities again represented most in low-income families and in and people of color and it finally just to identify sort of what kind of strong support we we see for a single pair program 70% of folks surveyed in a recent survey support this approach. And so I really thank councilmember Gonzalez for bringing this forward to us here at the city council as well as congresswoman jayapal for bringing this before putting this resolution. Thank you. Cancel. Memory is also bringing this forward and kind of person jayapal for your leadership and in Washington DC. It's embarrassing that here in 2019. We're still discussing how to get Healthcare for everyone, but unfortunately, that's the reality we face and I'm proud to be part of a council that will support that and hopefully that's customer her both said many other cities around the country. Thank you present Juarez I of course about this resolution and I thank the many many activists like David McClanahan Kathleen Myers work here who have spent years dedicating their lives on this very important issue. The for-profit private healthcare industry is deadly literally deadly Donald Trump lies about an emergency at the border, but there's a real emergency in the US healthcare system, which is killing people everyday people live longer in countries with single-payer Public Health Care system than they do here. They do not fall into bankruptcy or into homelessness when they have an unaffordable medical emergency because it's not on the phone and despite having better outcomes the Healthcare System cost less than the private system because it is not of funding the endless Greed for profits by profiteering insurance and Drug manufacturing companies. Weather we also need to be real about what it will take to get those powerful insurance company to relinquish their demands profits throughout Europe universal healthcare was one in many countries are in the second world war one big business was faced with militant labor movement and movement of ordinary people and the real possibility of socialist Revolution and felt compelled to give real concessions to working people concessions that didn't want to give but was forced to give in Canada single-payer healthcare was 1 when regular people build a new working-class political party separate from their conservative and Republican liberal parties in many new Colonial countries Healthcare actually in some cases better than in the US was 1 as part of the colonial revolutions. What is consistent in all these examples is that Medicare for all our version of that was one in any country only when working people got organized under their own strength and fought for it. That is why in the absence of that in 2008 when the Democratic party won an overwhelming majority in the house senate and the presidency partially with the promise of Universal Health Care. What was eventually delivered by the Democratic establishment that helps ensure more people? Yes, and I supported that but fails to break the power of insurance companies and overwhelmingly protect your profits. So I support this resolution, but I also want to stress the importance of building a movement if we are to actually win Medicare for all that is also a point as stressed in September 2017 when I sponsored and the council unanimously passed a similar resolution supporting the Medicare for all act Senator Bernie Sanders and interviews at that time for that legislative session. That resolution also passed by the city council also stressed that the two US senators representing Washington State Maria Cantwell and Patty Murray continue to fail to support Medicare for all and have yet to agree to sign on as co-sponsors of any similar bill. It is also worth noting that they accept substantial campaign donations from insurance companies and big pharmaceutical companies. So in closing in the words of the Puget Sound advocates for retirement action, we're going to have to fight like hell to win Medicare for off. Hey, we will move forward then it again one last thing you do cast member Gonzalez may make some closing remarks and there were marks in support of this resolution. I think it's really important for us to be unified and our position on this resolution on this issue as a whole. I wanted to add a few more statistics to those that were already outlined by councilmember herbold. So here in King County. There was a King County Community Health needs assessment that was done and through our Seattle King County public health agency. And I think there's a couple of numbers here that are really important for folks to understand and that help to explain why it is really important for the city council to speak up on this particular issue and to encourage our residents to join us and advocating to to our delegation of the passage in support of medic. I also really quickly in 2016 low-income adults defined as those households with incomes below 20% of the federal poverty level for more than seven times as likely as those in the highest income households to be uninsured lack of insurance coverage decreases with age in King County from a high of 8.1% for those people who are 18 to 24 years old to 4.9% for adults age 55 to 64% And while we've seen an increase in people enrolling in insurance as a result of the ACA. We still have a significant on Matt's Pizza have a significant uninsured population that unfortunately results and unmet medical needs, of course through our Seattle King County Public Health System the city invest in by purchasing additional enhance Public Health Services through our Seattle King County Public Health System. So any cost that we see as a result of the broken Healthcare System we are asked Taxpayers in the city of Seattle to pick those costs up and I feel like it is appropriate for us to ask the for-profit medical industry to pick up the cost of those unmet medical needs and as a result of a lack of affordable healthcare. So this is absolutely relevant to the work that we're doing here every day and to the work that I know at least three of our council members do as they sit on the Seattle King County Public Health Board to address the public health needs of so many folks throughout our County and our reasons. I just want to thank you all and I'm acknowledge that this is just the first step and there's a lot more work that needs to be done to ensure that congresswoman. Jayapal is successful in obtaining a hearing and in making a case for white support of medicare-for-all. Thank you. Okay, so we're all done. Of adopting the resolution as amended vote. I suppose the motion carries a resolution is adopted as amended in the chair will sign it. All right. Don't Seattle. Thank you. Thank you for being nice. Okay, so we are now going to move on to the our committee reports and we're going to start with report of the Human Services Equitable development renters, right? Can you please read that into the Rings Return to the records? And then I believe councilmember sawant has agenda items 2 3 4 and 5 go ahead 60 to listen to delay consideration to the most nomination with Jason Johnson to be director of the human services department until a formal search process can be completed in to convene a search committee representing all human services department stakeholders to Define qualification skills and attributes for an appointee and recommend finalists for appointment. The committee recommends a resolution V adapter with extensions in cast members Carol and her both Thank you present Juarez. I will make opening remarks and I would like to make closing comments as the sponsor of the resolution. Please remind me to let it to the have you do closing remarks in case I forget that is no reasonable justification for the controversy around this resolution when my office first discussed and was invited to discuss the appointment with Human Service Providers Human Services employees and other community members, we heard very serious concerns and as the mini speakers today and envious meetings the cup of the committee of the city council Human Services issues. Discuss what they have said is a very reasonable position which is asking for an inclusive and transparent search for the leadership of a department, which is Ground Zero for the most emerging problem in our city, which is the housing affordability crisis and the homelessness crisis entirely reasonable proposition from the employees of the department. Also from community members and Human Service Providers and as speakers do they have said the city of Seattle has agreed upon or race and social justice approach to the work of the department and dad. Be upheld in all the work that the mayor carries out and that not that they not that that the politicians do not engage in cherry picking where they will apply resin social dresses on the red that was not applied racing social justice. I think that that is nothing controversial about this resolution because it merely expresses what we have heard from hundreds of people in our community. This resolution is only controversial because the mayor has decided to go nuclear over it writing threatening letters refusing to send representatives to Council meetings threatening to close homeless shelters and so on our city faces an unprecedented housing affordable getting homeless left homeless crisis. Therefore, I do not think that issues are being conflated hear the issue of the leadership of the department is very intricately tied to the work that the department employees do in dealing with the crisis faced by our most vulnerable community members and so in my opinion behind the mayor's attempt to bypass a transponder inclusive appointment search and to Sidelines the overwhelming and numerous voices of those who oppose her choice for Human Services director position is a broader attempt to silence opposition to are underfunded and punitive approach the housing and homelessness crisis effectively ignore the deeply embedded economic inequality. An affordable rents racism sexism and social inequality built into the fabric of capitalism problems that in this situation has been dramatically worsened by City Hall's long-standing support for and Reliance on the for-profit market Human Services Workers understand that the humidity humanitarian crisis in our city falls disproportionately on people of color immigrant women and the lgbtq community and they want a city leadership that also understands that unfortunately despite the deputy mayor promising Human Services employees in Fall 2018 of a transplanted intuitive search Adam are did not engage with the community all year last year while my office was asking her what she was going to do with the appointment and immediately after ending on December 19th. We heard that I'll be hard about her selection and immediately after my office began hearing from Human Services staff the union that represents most of them. 17 and Human Service Providers and community members I've been in office in in City Hall since the beginning of 2014. So in my time in the council, I have been asked to vote on any number of appointment of leadership and CD department. I have never seen a case where there's been such widespread concern about a director appointment. This is a petition. Sign by hundred and thirty members of project 17 Union who work in the human services department asking for the council to send the nomination back to the mayor to conduct an inclusive search. They also turned out in large numbers to the union meetings to the changed in meetings of the department to discuss how to respond doesn't the Human Services employees have turned out about the committee meetings and these were committee meetings where we had over a hundred people join us at these meetings. I would charge council member to think for a moment how much courage it would take for a human services employee to speak up on this issue and openly oppose the Mayor's Choice of the acting director of the department. I want you to say to you all I have the deepest respect for your resolve and for your solidarity among have yourself and if there is any question of harassment or retaliation on the basis of the courageous position you have taken I wanted to publicly state that I will stand with you and please let my office know if there's any such case. This is the letter from the human services department change team who among other things advocate for Seattle's race in social justice principles and arts the council to send the nomination back to the mayor for an inclusive candidate search. This is a letter from the Seattle silence Breakers that also does the same. This is a letter from the Seattle Human Services Coalition making the same request the Coalition represent 182 nonprofit social services agencies in Seattle Services Department contracts with to provide food shelter Supportive Housing health care and services for people with disabilities elderly community members and sexual assault these Our Community Partners that the director of the human services department must have a trusting and collaborative relationship with to be effective counsel should also take their input very seriously and reconsider their courage and writing a letter demanding actually inclusive director search because they also fear retaliation. I also wanted to share important letter sent by the transit Riders Union in solidarity with the Human Service employees and social service providers for demanding and inclusive search. I also wanted to comment on the fact that share and we will have received a letter I think two days after they testified in the committee and Chambers that there that that their contract from a year-long contract will be touch 2 1 terminating at the end of June and ended letter the mayor the letter says quote the mayor wishes to convey that she's happy with improved exits exits to housing and and hopes that they'll revisit award will provide incentive for improved utilization which could result in extensions technical way of saying you've done a good job and we're going to reward you by yanking your longer contract and making you fight for it every month. That's like telling an employee in this is orwellian doublespeak and it's like telling you and telling employer not being fired. You're just being laid off. I think it is important that those of us who stand for Human Services sandwich and will because they provide Much-needed basic shelters and there's being repeated attempts by the mayor's office and buy some council members to take their funding away on the basis of not having numbers, but the mayor herself is admitted. She doesn't have numbers for transitions to permanent housing. So why are we holding one small service provider accountable for that as a whole if you repeal the Amazon tag, and if you if you stand as an obstacle to any possible measure to expand housing affordability, when you are not in a position to tell individual service providers that they're not doing enough. I think the timing of this was very questionable. The timing of the announcement was very questionable, but whether or not it is a delegation, I will say the bottom line is given the crisis that our city is reeling under it is unconscionable to make any cuts to funding for social services on homeless services and the select committee on homelessness, which I will be cheering on March 12th at 2 p.m. Will take up this issue to make sure that shelters are not closed. I also wanted to make sure that everybody knows that showed x 17 the union that represents I think half of the workers in the human services department has sent a letter out in which they are clarifying that the Union as a medicine before I said that Union stands with the membership in asking for a meaningful engagement with external and internal stakeholders, and it says protect 17 membership maintains The Forum position that are transparent process. And that's the reason social justice principles and values of the city and department is required to establish accountability and Leadership. So in other words, he says is that whatever the mayor and the council May promise about the future is a separate question don't make promises about the future if you're not going to pull this resolution today, so it's really meaningless for council members to say we will support a resolution that talks about what we will do in the future when the promises that were made about this or not being upheld. Why should I charge the employees and service providers trust promise of the future when current promises are not being kept I won't say in closing. bat this nomination is much more than about an individual. It's about the choice that council members have about whether they were listen to the hundreds of community members who have spoken and the right thing restaurant. council member Johnson Thanks. I'm going to be speaking against this resolution today, you know, the conversation that I think is happening Community has become a proxy for the confirmation of the individual who currently serves as the interim director for the Department Jason Johnson. So I want to forward for the record that there have been dozens if not hundreds of emails that we've gotten in support of Jason as the permanent director of some of the qualities that people have expressed when talking about Jason. He's qualified. He's got a true concern for all Seattle residents his trusted admired and competent. He's got a grasp of the complexity on a wide range of human service departments programs. He's got a commitment to Positive Solutions is an asset to Seattle. He's committed to accountability. He's got a constant. City of leadership that's important in this time. He's committed to reform and continual review and Improvement. He's a people focus leader and a people-oriented is a person with Integrity. I need some come from individuals not to mention the letters that we've received from organizations has to versus Solid Ground The Pride Foundation Chief Seattle Club accelerator YMCA Catholic community services in others who've asked for us to quickly confirm director Johnson. So while I know that much has been made about this being about a process. I think that this is a really not about a process is about a person and I'll be voting no today in the hopes that we can actually take out the confirmation of this individual. Of course my Ryan, thank you. I'll be building in support of this resolution and I wanted to speak briefly to my thinking on it. I want to be clear that I've had a good working relationship with Jason Johnson as both deputy and in a room or what's the proper term interim and acting thank you and I don't suppose his appointment ultimately but I do believe that a process is important I need is an important role and I think the request from community members and that there be a transparent inclusive process and a chance to compare candidates and get them to that some of their opinions. I think it's a really important thing to do. Thank you for anyone else cancer mosquito. Thank you madam president. I think I want to be very clear up here. We understand fully that the innominate whomever she chooses for Department directors. And also I think we all understand that it's the council job to run a confirmation process. There's a few things that are clear to me as we have this conversation today many of the people who work at HST and including those in the bargaining unit including those from the change team including those who are the members of The Silence Breakers as well as others who are contracted providers don't feel like their voices were heard or that there was a thoughtful selection process in which they could make sure that there are issues and their values are represented number to we know that we can't go back and fix a process, but we can indicate that we wanted to see what we expected to see you didn't happen without enough time to make sure that those were Frontline staff and providers feel like their voices and then heard of the table. It is imperative. I believe to go back and ask for a more inclusive process. We need to work together as a city you to ensure that we focus on big-picture policy issues and pressing issues. But this process should not be interfering either politically or policy-wise with the important role that hsd has the play. We are very very lucky to have all of the individuals who work at hsd we know we have at homelessness and housing prices that is pressing and is getting worse every single day and I like councilmember O'Brien. I've had a very positive interactions with the individual Jason Johnson and his leadership team as well as incredible Phelps on the front line, but to me, the purpose of the resolution in front of us is to say that we need a process that is inclusive that represents our commitment to raise in Social Justice that ensures that front-line staff and those who are being served by the department have had a chance to either be at the table or to make sure that their values are represented at the table. So we understand I believe that our process our job is not to run the process. But as we look at the process that's in front of us. You don't have the right tools to evaluate whether or not individuals questions have been answered whether or not they feel like their issues in their values have been heard and whether or not there's a plan of action to ensure that the director of the new director will listen to those concerns and integrate public policy changes to make sure that there is a process moving forward. I also want to be very clear that this is our job. This is our job to evaluate that come down and I do take some offense with the staff member who wrote to us and said that resolutions aren't our job. It is our job as a council to ensure that impacted communities have a seat at the table. It is our job to ensure that there is a public and transparent process to decide on whether candidates are the right choice to delete to leave the department and it is our job to be accountable to the people of this city. We don't make decisions in a vacuum and as elected leaders will ultimately don't get to decide who gets sent down to us. It is our job to make sure that the process was inclusive and thoughtful. So from my perspective regardless of how council members vote on this on this resolution. I want to reiterate that. I do believe that we're doing our job to clearly question whether or not we have the right Tools in front of us to make this decision today and I it from my perspective this resolution is not about Jason's leadership or whether he's the right person to lead. This is a question about the process whether we got it, right and whether it was inclusive and saying that we've had other processes that haven't had to go this route or that we've done it this way in the past and we also don't want business as usual we have to make some changes and in the time of me too and in time where people tip courageously speak up and tell their truth and speak truth to power this means making space at the table and also recognizing that sometimes we do need to hit pause and ask if we've created the table for people to come to so I'll be voting in support of the resolution in the hopes that we can either have Process that's changed or that we will be able to vote up or down on the nominee and move forward and indifference to the mayor's office. I have held back the resolution. That's forward-looking. I do think that that helps provide us with additional additional Clarity on what the city council hopes for in terms of a transparent and inclusive process. I do look forward to finding a resolution on that resolution appreciate all of the council members, throughout this process regardless, which way we vote. We all know that we want to make sure that our human service provider Frontline staff provider organizations, and those who are experiencing homelessness get the Direct Services that they need or incredibly proud to work with you on a daily basis and no matter which way you folks out today. Thank you for your incredible service. Thank you. Councilmember back show colleagues. I want to thank you all for the work that you've done councilmember mosquito. You just outlined some things that I think are actually very important. But before we talked about this a second, I just want to say thank you to all and share and wheel for being here. I know that many of you remember very clearly just a few months ago during our budget cycle that you were one of the first groups that came and said keeping people inside is critical. We passed the budget making sure that you had that money to stay inside and warm and I want to acknowledge that I will continue to do what I can to make sure that share continues that the work that you do is supported and send it. So I just I do really do want to acknowledge how much I appreciate what you are doing to keep people inside and also week we need to improve the outcomes. We all know that and this is same thing. We're trying to do up here and I also want to acknowledge the concerns that many of you have brought forward about the process. A little different view on this. I was the chair of Human Services for the last couple of years prior to council members to want. I know how important getting this right is, but that said we've got the Human Services to provide we've got used to care for we have our aging and disabilities group. We have our age friendly group and the efforts that were put in to support those who are victims of domestic violence delay is not going to help us another year-long search is not going to help us the human services department has called me service providers have called me and we've received dozens and dozens of people saying let's move forward on this. We have a great man that is leading this work. I've worked with Jason for years. I regard him as a man of integrity. I saw him back in Washington DC where he was working very hard with national experts and he is well recognised and I appreciate the work and experience he brings to this. So rather than saying was doing National search I'd say let's focus on people. We have the excellent people and workers within the human services department if there's a problem with get that right, but I would like to move forward rather than delaying this so I'll be voting against this resolution. Guess what? Thank you. So I attended the last Human Services committee meeting back on February 20th. I also listen to the testimony at the meeting previous to that at this last meeting on the 20th. I abstained from voting so that I could continue to consider the thoughts and concerns of individuals about the proposed resolution. I've said before that I do not support maintain the status quo is it relates to the council's expectations for how the mayor conducts Department search process. He's back in 2007 when the resolution that currently defines the expectations for the nomination and Confirmation process the past night of the council mayor nor Department rsji teams contemplated utilization of the racial Equity toolkit as part of a nomination and Confirmation process. I'm really glad that we're in a different and better place today and I want to formalize the changes to the status quo that address sort of this new expectation and as we've heard since I'm Cases some council members have already made that part of their expectations to the executive for confirmation process is that they have see that they have overseen members of the public are asking today that we change the nomination and Confirmation process. I say let's do that. I support a transparent inclusive process, but I believe that the appropriate time the council to raise these issues is at the beginning of the nomination process for that reason. I requested that council member moschitta include specific language related to that process in her resolution specifically that prior to nomination that the executive give to the council a written description of that process the use of any advisory groups that will be part of that process in the composition of that Advisory Group that way the committee chair over seeing that nomination has the ability to engage with the executive about that process before the nomination comes forward again. Individual council members have work with executive in the past and developing these sorts of expectations as we heard from council member Gonzalez this morning. She described asking that the mayor use a racial Equity to get during the police chief process. I have shared my concern that this did not happen in this particular case council members who want produce emails from her staff that appear to have been on answered asking questions about the unintended consequences that these emails were unanswered is unfortunate, but I'm unaware of any communication from council member Salon prior to the nomination to the expectation about her specific expectations for that process. If council members who want had made those expect expectations known prior denomination and they were ignored I might feel differently today. We heard at the Human Services committee meeting on the 20th that the Human Services Coalition had been seeking a meeting with the mayor beginning of her term to discuss the Human Services cold. These hopes for the future of the human services department the fact that they have not had such a meeting since the mayor has taken office was described by the representative of the Human Services Coalition as unprecedented the Human Services Coalition represents dozens of providers hundreds. If not thousands of workers and tens. If not hundreds of thousands of recipients of service. I'm glad to report that the mayor's office has let me know today that the mare will in fact be needing with the Seattle Human Services coalition. As it relates to concerns that we've heard today from share wheel residents and their supporters. I've spoken with a chesty about their intent and giving them a six-month contract. Specifically in writing and verbally hsd has indicated appreciation for the progress made by Cher wheel and expectations for continued progress last week makeover games assured me verbally in person that share wheel is a valued partner and an hsg is sincere in his desire to continue to support their services as part of an emergency services Continuum as I have done before I intend to try and facilitate a meeting with hsd and share will I put that request in today with hsd about the specific issues that hsd has identified as continued areas of improvement as well as wanting to hear from Cheryl Wheeler about the barriers that they identify to improve completeness data. I want to clarify the issues that have been raised are less about outcomes to Department of Housing and more specifically about completely Complete nessus of data itself. So these are things that I'm really confident that we can we can work to resolve in time for the the continued provision of the services that the council funded in last year's budget. That's all I have to say that in four times in the birds were saying that though they're worried about the delay. I just want to clarify my office has been asking the mayor since March of last year, which is almost a year ago now asking them what they intended to do about the HST nomination. And in fact the first email that my policy analyst Edward don't send to the merits of specifically says that can be have the an idea for who's going to be nominated before the previous director left because we didn't want to have any delays. So I think it's a disingenuous. Boarding no against a resolution because you are against the latest but we're against the lights. Also. This is not a question of the late a question of hundreds of people having spoken up and we have a council that is predominantly it seems like going to hide behind process-oriented points are in order to not respond to and listen to the people that are spoken and I really appreciate council members O'Brien and mosquito supporting this resolution because voting yes on this resolution says that you wasn't elected representative are standing up for promises that were made to be fulfilled as opposed to simply saying what let's just roll it over to a another promise in the future and why should people dress up those promises will be kept at these promises one kept in the first place and in response to Gothenburg. Horrible's points of that I my office did not stay the expectations. I'm sorry. These are very very basic questions that ordinary people are asking about upholding. Recent social justice process and including people. This was a promise that Deputy Mayor ranganathan herself made in Fall 2018 to adjust the employees. So I don't know understand why the mayor's office need instructions from my office to do the very basic and minimally required actions that are her responsibilities. Furthermore furthermore. I don't understand by council members. Would Elevate what my office did or didn't do in comparison to the many voices. We have hard regardless of what my office did or didn't do your voice of shut down for far more than anything else anything else should down for more than any politicians voice. So given that you all are spoken. That is the most important thing and that is why I agreed to bring this resolution for was based on what you all said. And I also wanted to share with members of public that I had a meeting with the mail this morning and I asked her what she concurred with this resolution in response to that question. She asked me a question and response. She said will you withdraw this resolution and I just wanted to let you all know that I said, of course, I cannot withdraw this resolution because that would be unconscionable that I have to remain accountable not to her butt. How many people who have spoken and Richard open car with a resolution? I also told her regardless of how right you think about the nomination. You said what matters the most despite regardless of any other process point you make is that hundreds of people have spoken and you cannot just sideline those voices. I will I will say this if this resolution does not get the majority vote. I wanted to Orange everybody was fought for this to know that it's never the end of the road. We can still keep fighting and furthermore. There are concrete ways that we can keep fighting in this issue. I'm not talking about in the abstract. But somebody in the on the council will still need to move for the appointment of Jason Johnson and I appeal to you all to not give up and to keep coming and and and do for us to keep strategizing and I will just end by quoting Gretchen was Kevin. I'm going to paraphrase crazy because I didn't write down the actual quote but something along the lines of Let's keep building and organizing so that we can meet every penny of opposition from the mayor on any other politician with a pound of organizing. Thank you. Thank you. Okay, so With that, I think you can't remember still want we will move forward on a vote. Please call the roll on the passage of the resolution O'Brien. So Big Sean Gonzales purple Johnson. Mascara. Juarez 3 and favored by the post So the resolution fails there's nothing for me to sign. Okay. So with that I understand customers who want you have matters 3 4 and 5 their appointments on the agenda for George. I'm sorry 3 through 5 appointments 1262 through 1264 appointment to Calvin R. Jones has never sailed wrenches commission for a term to Ferry 28th 2020 an appointment in reappointment of Regina Owens and Michael Padilla Ocampo as member Seattle renters commission for a term to cover 28th 2021 the committee recommends these appointments be confirmed. Thank you. Thank you. So I will speak to all the appointments together Calvin Jones, you know, and then Michael Ocampo are all dedicated renter Advocates Calvin and Michael have already served on the renter's Commission in various want enough participated. Well Gina is a new appointment. She has been an amazing activist for 18 years with Washington Community Action Network and testified 2009 D Dime unimportant renter rights legislation the Human Services Equitable development and renters rights committee recommends Council confirm these appointments voice strong support for both Michael and Calvin of works of them both in the past and Michael and I go back to almost five years. He's got an incredible track record as a community organizer is an excellent voice for renters in our community and want to thank them both for their willingness to serve. I know the comments. Okay, so we can do all three. Okay, so I'll just move all three of them are going to sale 300K those in favor of confirming the appointment. So I suppose there's any appointments are confirmed. Thank you. Thank you next Port of the gender Equity safe communities new Americans and education counselor Gonzalez Huron actually if I can have the title of the bill read into the record. East new Americans and education committee Chatham 6 Council 1194 68th Lane to the Seattle Police Department creating an incentive program for hiring police officers and repealing office of sleet sections 4.20 point 530.540 point endpoint 5:50 to tell him to spell code the commuter commence of All Passes amended. Thank you madam. Clerk. May I sure? Thank you. So I need to move to amend this bill with a substitution version. So I moved to a man Council bill when 19468 by substituting version 3 4 version 2 It has been moved and seconded that the substitute adopted in comments. I think we need to vote on The Substitute give you some gentle prompt if you are. Okay. So there we go at those in favor of the substitute vote I adopted. All right. Now I will speak to speak substantiv substitution bill when 19468 so Council Bill 11946 incentive program for the hiring of new police officers at the Seattle Police Department my committee and this Council have a closely-watched the hiring and separations data coming out of the Seattle police department since the middle on 2018 when it became apparent that the department was lagging far behind their Henry forecast department has continued to encounter hiring struggles and in recent months and this is as we heard in my Committee hearing a reflection of a very challenging landscape nationally in which police departments across the country are struggling to recruit new officers the police department and the mayor originally proposed this legislation to offer lateral hires. From other departments in jurisdictions a signing bonus of $15,000 in total. We have a through my committee process following the initial hearing on this bill in my committee identified several ways that I thought we could strengthen and expand this incentive program of creating additional accountability measures to ensure the strategies that success. So I proposed for changes in total to this legislation which that were adopted unanimously in committee at our last meeting hearing on the 27th of February 1st is that would expand the incentive program two new recruits Executives proposal would have authorized a $15,000 hiring bonus, exclusively for lateral hires. My Amendment passed in committee authorizes the Seattle Police Department to extend hiring bonuses to new recruits of up to $7,500 per recruit lateral hires at only makeup 20 of the 104 new officer positions in the Seattle Police Department's hiring for Cast still considering that the bulk of new hires approximately 84 out of a hundred for the Department is seeking in 2018 our new recruits. I believe it's important that Department direct its efforts and resources towards the new recruit strategy as well as a lateral hiring strategy. In addition. I hiring bonus for new recruits can help reduce barriers to pursuing this profession and couldn't answer Department's efforts to Recruit & Hire women and individuals of diverse racial and ethnic backgrounds consistent with our police accountability ordinance and in connection with some of the progress that the department has already made in terms of increasing the number of diverse folks it to become a police officers. Secondly the second amendment that I advance in committee was a new data collection analysis and Reporting requirements that will help the council and the public determine if this program is successful including data regarding the demographics of new hires and the lateral hire Third is a Sunset date which would require the executive to seek the city council's affirmative reauthorization from excuse me, those with secret reauthorization before renewing or continue news on a program and then lastly a clause that ensures that new hires who receive the bonus serve the department for three years before leaving the department. Otherwise, they would be required to pay back the bonus at 2 at the city of Seattle. If they depart before the end of those three years, so following some additional discussions with the department and the city budget office. We agreed on several other updates to my original amendments and which is why I needed a substitute version most of that was wordsmithing and Technical language and that's all I have have any answer any questions, but would urge my colleagues to support the passage of this Council bill, which is as I mentioned this morning revenue-neutral and will be Supported through salary savings as a result of ongoing vacancies at the police department in terms of its hiring forecast to the good sheriff on public safety for her really intense work on this bill. I think when I initially came to your committee when we discuss this at there was a lot of skepticism that I held about whether or not this was the right way to go because I know many of us are interested in continuing to ensure that any additional dollars and efforts programmatic strategies go into community policing and trying to figure out how we can share some of the funds with our Community Partners and when I heard in that committee because of your leadership was really about how do we create stability on the numbers bo4 themselves and having us a chance to hear directly from the department and community members at large. I think you really struck a nice balance here. It's important. I think to underscore what you just ended with again, which is that this is not new money and there's three additional components for me that really make this a powerful piece of Legend. In terms of accountability and transparency to ensure that this mechanism works for creating greater stability for a police force. When is the sunset on the duration of the hiring incentive to as the reporting requirements that you championed included here so that we could actually see whether or not the new dollar or the dollars were truly bringing in new recruits and lateral hires and that we maintained our commitment to recent social justice by not just focusing on lateral hires, but also recruits for new hires, that would be hopefully younger women and people of color. So thank you for your work to incorporate all of these components into the revised version and I'll be supporting you in this effort. Pick customer Johnson just briefly as a the third member of that committee wanted to offer my support for the recommendation and highlight two things that we covered in committee that I thought our worthy of getting a person which has the proposal is very consistent with what hiring bonuses are offered by jurisdiction in are directly neighboring locales, whether that's the county or the city or Snohomish County or other neighboring cities. So this competitive advantage to doing this it will put us at least on a Level Playing Field with those other jurisdictions and the cons of signing bonuses that they offered both the new recruits and lateral hires. And then I think it's very appropriate for us to highlight that oftentimes. There is a rhetoric out there about this Council not doing enough to ensure the hiring of me. Officers it is a national challenge for the Departments around the country to bring in new people into the world of policing some folks attribute that to the challenge of constitutional policing some attributed to the low historically low unemployment rates. Regardless, I think our cat this council is doing our part to make sure that we are providing all kinds of incentives to ensure that normally are we doing fair and appropriate constitutional policing but put in the resources necessary to make sure that we have the appropriate level of officers that are necessary to do at work. So I want to thank the chair for a commitment to this and I look forward to enthusiastically voting. Yes specifically related to meeting our staffing goals. The mayor's office is convening a hiring workgroup regarding relating to Recruitment and hiring and I know that the count What is a part of that hiring workgroup? I want to raise an issue that I've raised before in 2017 the policing commission or the community police commission publisher reports about specifically this subject it was entitled recommendations of community police commission for recruitment hiring and training. It includes numerous recommendations that can inform this work if they have these recommendations have never been implemented and they serve as a I believe it's a starting point including comparisons to policies and studies in other cities Outreach diverse Community. I've requested that the work group not only consider the recommendations of the study but also find a way to incorporate the involvement of the CPC. They are specifically chartered to advise the city on issues related to Recruitment and addition. I want to highlight some other work related to recruitment that comes from work and Solace and I have Over the last couple years after the accountability ordinance adopted by the council included a section on Recruitment and hiring related specifically to preference points. The two of us worked to get implementation of language related specifically to preference points to expand the pool of applicants and make it clear that their skill sets are valued. It is true that a for all of the qualified applicants who who meet the requirements in the preference points policy. Those folks are all being hired. But my hope for the preference points policy is that it will actually send a message to our diverse communities that their skills are valued and actually increase the size of pool applying in addition. I've you know also had concerns that we're spending a lot of time although I absolutely support the Mission of bonuses for for lateral hires and I appreciate counselor Gonzalez's expansion to the new recruits. I really want to have a laser sharp focus on what are approach is for new recruits of are hiring plan for 2019. I believe 20 of those are supposed to come from lateral hires or as a tea or supposed to come from new recruits into me at that is a real signal that that's where the Lion's Share of work really needs to be done. And again, it needs to be done in a way that we do not lose the ground that we've gained on on hiring a diverse Workforce in 2013, 14% of all police hires were from racially diverse communities in 2018 were up to 42% So again, we want to make sure that we're not losing losing ground in these efforts as we move forward, but we really want to come up with I think. What is new and innovative ways to encourage people to want to be a police officer in our city, and it finally one of the things that we've heard from the budget office is that the cost of the reason why there's this discrepancy between what were offering new recruits in a hiring bonus versus what we're offering lateral recruits because there are more costs associated with new recruits. I would really like to see that those costs actually sort of calculated and put on paper. So we're not just saying the total cabinet cost which I understand we received but what the costs are for training including field training understand that this includes overtime. I think that will help guide us on where we want to put our emphasis in in developing with the Department the Staffing plan. Thank you. Thank you. Thank you doing the budget last fall. I proposed 11th Amendment to increase what the city of Seattle spends on affordable housing. One of those amendments was too slow the hiring of new police officers in to be up approximately 12 million dollars to build an additional seventy-five 230 affordable homes. Each year studies over decades consistently have shown that decreasing inequality is far more effective in reducing crime and improving Public Safety than increasing policing is the majority of the council did not agree at that time. This Council bill would invest in a rather than investing more money more funds in addressing inequality by for example, expanding affordable housing is going to spend more money to speed up officer hiring and I don't think there's any data to support that actually hiring more police officers reduces public pools Public Safety and reduces crime actually. Addressing an equality. Does that and for that reason I will be voting no and on a side note. I will also mention. How come we have not seen hiring bonuses for educators and emergency medical technicians and Social Service workers or any of the numerous other public jobs that do nonviolent life-saving work and I constantly asked to do so on some of the lowest wages in the city. Okay, anyone else I'm going to I'm going to try to make some closing remarks here in respond to confirm herbold suggestions about some of the additional work. They can be included as part of the work group. My office will be able to have a seat at that work group. So we'll make sure to at Loop in your feedback in Summerville to make sure that we are capturing some of that additional data that you've highlighted that I think is absolutely important and critical to this. I also just want to know that in terms of the hiring bonus for laterals vs. New recruits at part of the reason why I was motivated to expand this two new recruits and not just be hyper focus on lateral just because laterals are are are very small portion of the of the type of officers that the police department has historically been able to hire to address. The the hiring shortage in the staffing issues and so my my hope is that by offering the new recruit hiring incentive. We will actually see a significant increase in bump of hiring in that particular section in large part because we're the only jurisdiction that I'm aware of that will be The Offspring iron incentive for new recruits. And then lastly I just wanted to clarify that one last of facts that I think I I think was Miss stated by council members want which is that this is not a budget action. We are not allocating additional dollars to the Seattle Police Department for them to fulfil this hiring bonus. This is a policy shift in a policy change that would allow them within their existing appropriated a budget to utilize the dollars that they currently have in our budget for Staffing to also in Flewed out this hiring bonus as a strategy and if the hiring bonus doesn't work, we won't be paying out any money and there will be absolutely no dollars spent in this peso the dollars that are going to get spent within existing budget authority of the Seattle Police Department will only be spent if there is success in this area and if there is not then that means we need to take corrective action and the data that we are requiring that the police department provide to us and the long-term work of the work group to address the ongoing issues of a hiring and Staffing models and the forecasting will need to be informed by any lack of success or success in this base with a strategy. Thank you. I think that wraps it up and we'll move so we already did the substitute bill was adopted. So right now I'm going to pass Council Bill one 19468 as amended for the comments. Will the clerk please call the roll? O'Brien Gonzales president Juarez 7 and favor one opposed the bill passes as amended and the chair will sign it. So let's go on to tell Katherine Gonzalez. You have another matter for us an appointment. I'll let you go ahead and keep it up. I would love to the clerk to read this page and Adam 7 appointment for 59 reappointment of Maya babla as member Seattle immigrant and Refugee commission for a term to January 31st, 2021. The committee recommends the appointment be confirmed. Yes, you may thank you for the appointment. 01259 is the reappointment of Maya papaya as a member of the Seattle immigrant Refugee commission at Maya has already been serving on the Seattle immigrant Refugee commission that she joined us in committee last week. She is currently one of the co-chairs of the Seattle immigrant Refugee commission her a fellow Commissioners have expressed strong support of her continuation and would appreciate us confirming her nomination. She is currently a program manager within Microsoft Global Talent acquisition team. She has extensive experience with other tech companies including in San Francisco. Tom and she currently lives in District Six and is very excited to continue her service on at the Seattle immigrant Refugee commission and the committee unanimously recommends that the city council confirm her appointment. Okay. With that those in favor of confirming the appointment will die those post. The motion carries an appointment is confirmed. Okay. Now I see why messing up here because the script says report of the committee. Please read the report do you mean please read into the record Arts council member herbold. Please read into the record for UCL departments and outside entities committee recommends a bill passes amended. Thank you. I'm so comfortable 1190 420 references something called a dime point that you will not have to hear me talk about anymore. A datum point is a reference point that is used for the entire city in surveying and Construction in order to provide a known location to measure from to measure the position of a height the position or the height of an object in relation to the datum point at self data points were last updated in 2020. I'm sorry in 2000-2003 this legislation would eliminate the need for future code updates and ensure that the city is at the most current current datum Point both the horizontal and vertical datum will be updated in 2022. But that again will not require any vote from the city council. McCormick's Please call the roll on the path of the Bill O'Brien Gonzales herbal by Hayden favorite unopposed bill passes in the chair will sign it. Please read the next item into the record 19464 arthritis and general manager CEO of the Seattle Public Utilities executed contract with Waste Management in Washington for construction waste collection services in math anchor Pharmacy and practically recommence it'll pass the current provider of the services and was selected again after an open RFP request for proposal. The new contract is for 6 to 12 years and will begin in April 2019. If approved by the full Council the contract covers delivery and collection temporary drop boxes at construction sites for non-recyclable Waste. This contract actually covers a little less than 10% of total dispose construction waste as most waste is actually service by independent recyclers or self hauled by large construction firms who basically cut out the middleman by delivering their waist straight to the railyard the new contract. Prices that are comparable to be current expiring contract. Okay, let's go forward then. Please call roll call the roll on the passage of the Bill O'Brien San Juan Gonzalez purple. Hi Aiden favorite on the post and please read the last two items for a council member herbelin to the record and Bob strong. As member is Museum Development Authority governing Council for a term to July 11th, 2021. The commuter commence upon his be confirmed nine members three members are each appointed by the museum Development Authority governing Council the Seattle Art Museum. And the mayor the first appointment is a reappointment Douglas wrath. He is a museum Development Authority governing Council appointment He's a lawyer who's been involved in Civic activities, including the national board of the Trust for Public. And the director of Sasquatch publishing company and a trustee of the Bullitt Foundation the Pacific Science Center Coalition for open government and the Seattle Parks Foundation Bob strong is a Seattle Art Museum appointment He's a financial advisor who has been the chair of the finance committee of the Seattle Art Museum the chair of the investment Committee of the Seattle Art Museum The Treasure of the Seattle Art Museum's Board of Trustees and member of the board of directors of the Rainier Scholars. Okay, so that's for both appointments and comments. Those in favor of confirming the appointment, but I confirm the appointments are confirmed. I'm sorry committee. So let's move on to a very exciting committee finance and neighborhoods councilmember backshot. She has been living. I'll read item number 12 say that I was just getting ready to say it go ahead and historic preservation upon the Broad Street substation committee recommends a bill pass. So this exciting item after everything else we've done I'm going to move to approve this Council but one 19467 which will add to the table of historic landmarks to particular points of light in the broad substation for Seattle City Light. We are looking at the significant aspects both cultural political and Heritage in this area and there's some controlled features that include the control and crane buildings and the tower itself. So with that I would like to move it option of designation. Can any of the comments All right, so please call the roll on the passage of the Bill O'Brien Salon herbal Johnson president Juarez favor not opposed to the record 66 establishment watch list of large complex discrete capital projects that will require and has quarterly monitor reports for the 2018 calendar year committee recommends a resolution be adopted actually think you would much thanks to council member at Lisa herbold at this other end. Did you want to bring forward an amendment at this point? I do actually so that the resolution as as disgusting committee that creates an expectation for where the quarterly reports on the Text that are included on the watch list will be heard part of this enhanced reporting an oversight of large capital projects. Not only includes. I'm having some shared expectations with the executive but it also requires I think a change in focus on the council that we actually agreed to find a time and a place at our committee meetings to hear what the what the reports coming out of these specific projects say in in with the idea that if we hear those reports in committee, and we identify problems with projects on the the watchlist. We will be able to better hold ourselves accountable for addressing those problems with scope or budget as they are identified. So it's important I think to actually MBA It's the role that the council has by affirmatively stating that we will hear these reports in Council committee. And that's what this amendment does. So Amendment 1 2 resolution 31866 basically, like I said memorializes the cities and 10th at the finance and neighborhoods committee review the enhanced quarter reports and it states the city council anticipates that the finance and neighborhoods committee or successor committee or review the intent enhance quarterly reports. Any other comments? Okay, so it's been so, it's no more comments who's in favor of the amendment but I suppose the motion carries an amendment is adopted and I'll just speak to the underlying building as amended. So this resolution establishes a watch list of complex capital projects something that council member her both brought up during budget and page three of the resolution establishes the initial watch list of the the complex projects quarterly the mayor will provide us an enhanced list and the oversight will primarily be focused on scope schedule and budget of the individual projects. And as I noted by this amendment, it will come to the finance committee. We will get this started in the next quarter and we'll invite all who are have any specific projects from there, As I mentioned this morning, it is transportation. We will invite councilmember O'Brien give you plenty of notice to know when it's coming up and then he's got any issues around it will get more information before the vote. So what that I would like to propose that we adopt this resolution is Amendment II already yes. Yes. Okay, and if there's any of the comments 04 Johnson continuing this conversation, I think the a lot of this germinated when we all many of us started on the council in early 2016 and we're faced with the prospect of several major capital projects that were at 100% of their budget but maybe only at 80 or 90% through their scope and folks were coming out and asking for forgiveness than permission. And in what were we going to do? We were we had left with no choice but to approve additional resources because the thing that was going to get built or the thing that we were fine was the thing that we needed and I think that the intention here is to create opportunities for the council to have better communication with these individual departments an individual project managers. As the project move forward so that we have a chance to choose may be some changes in scope or changes in timeline of delivery delivery without having a necessarily the recipients of bad news at the end of a project budget when the project wasn't still yet complete. So I'm looking forward to seeing how this plays out over the next couple years councilmember O'Brien. I wish you luck because 11 of these 18 projects are transportation-related. So it seems like you're going to be spending a lot of time and counter vac shells committee that you are not necessarily a member of it. And this is at a base level a lot of what we should be doing as as Government working closely with this project managers to make sure that they are delivering their projects on time and on budget and making hard policy decisions early in the process as opposed to late. So I'm looking for devoting us on this. Well done. Okay. So let's move to vote those in favor of adopting the resolution as amended Lodi. So before we do that. We have to go on to other business. So is there any other business to come before Council counselor in the scada? Thank you madam president. It was exciting to watch you lead us through today's full counsel. Thank you for your leadership on that. I'd like to move to be excused next Monday as I will be in Washington DC for the national league of cities housing task force and convening letting Catherine was scared to go to Washington DC.", "end_time": 9089.3}]}