{"format": "raw", "annotations": [], "confidence": 0.9283182005882263, "data": [{"start_time": 0, "text": "Good afternoon, everybody Welcome to the sustainability and transportation committee. It is Tuesday, June 4th 2 p.m. My name is Mike O'Brien. I'm sure the committee joined by Mike Holli counseler potato. Thank you for being here and staff today by Lavinia and with some support from the clerk's office. We will we have two items on today's agenda. But we'll start I'm going to do is my chairs report. Do I need to amend the agenda template know it's in their excellent. Thank you. I wanted to just highlight this letter that we discuss the last committee meeting lunch. Guess was too committed means, you know that the committee members jointly sent off to director Zimbabwe of Sale Department of Transportation. And as we discussed that meeting we didn't talk to a letter and I wanted to just let the public know that this will be posted on our website welcome. We were discussing safety issues. They were highlighted based on some footage traffic footage that someone had shared on a Twitter account. It certainly gave the impression that the the new alignment on 35th Avenue Northeast without the protected bike Lanes appear to be quite dangerous with folks passing. Can you legally it unsafe speeds and then that week we'd also heard that there was a collision involving an automobile in a cyclist that resulted in serious injury or someone was taken by ambulance to the hospital. So the letter we sent off asked a series of questions. I'll just touch on them briefly here for the record implemented their met the objectives of the project in a vision zero. We asked if the designed went through the complete streets checklist assessing Howitzer is people of all modes. We asked if there are if now that it's been implemented if they have noticed any shortcomings of the design if they have any plans to make improvements up there and then we also asked how the F. In fact that this is not meeting our job to send if in fact that that is their analysis to how did we get through such a long project and end up implementing an alignment on that Corridor that that made things less safe. Not more safe. We've asked if they respond to us in committee two weeks from today. So hopefully they'll be here on June 18th, and we can have a discussion about this along with we're also planning an agenda item around the implementation plan for the bike master plan, which we had a discussion a few months ago and an update will be released sometime next week. And so that's Call you for the comments. You want to make on this we're just going to make this public public record and be posted on website that will go ahead and turn the public comment. I believe there's one person signed up David. Come on Ford. Vision zero, the only way to expedite preparing infrastructure to make it safe or emerging Tech Mobility options is to double the shifts at the S. Union to get these slow-moving hungover standing around working the pay plan off infrastructure projects completed. We're still waiting for the government to hire someone qualified. He doesn't vacation elsewhere to copy cat Patchwork bypass still unsafe. City council needs to empower The Pedestrian board Advisory Board to the man the police begin enforcing road rage horn honking tickets causing a mental health crisis on 3rd Ave and beyond plus we need pedestrian Advisory Board to demand housing for people who aren't lazy who would rather run to the bus stop half a mile away. Then have the bus stop right outside the home where you're forced to listen to the beach and horn honking like it's punishment for being poor in the Inner City. Maybe city council should include technology to expedite efficiency of the bus routes to prioritize stop lights for green lights when the bus approaches it would it would and could work at the Fremont in Ballard bridge to it would be great at city council included priority green lights at intersections. So the buses don't have to stop there. Thank you, David. No one else sign up. I don't see what else the audience will go ahead of you here to testify. Oh, yeah, that's okay. Can I teach an old dog new tricks? I am we need to approve the agenda. The old dog part of approving the agenda part. Thank you very much for a move on to agenda item number one, and if you want to read that into the record. A tank engine item number one appointment 1354 appointment of Andres are Jonah as member of the Seattle pedestrian Advisory board for a term to March 31st 2020. This item is for breaching discussion and possible vote. Can we start with introductions? Name my name my name is Andres Arjona live in District 4. Everybody my name is Berlinetta and and the Seattle pedestrian Advisory Board liaison. We are currently replacing a vacant position one of our previous board members had to step down and give it as they found a new employment outside of the state and under his actual previously already went through or interview selection and recruitment process for this pass Recruitment. And so well as we're looking for positions to fill in he was a really highly valuable candidate and so when the position became available we approach Andres is our next option and I can also read you the little bio that I have in front of me and I did that last time for the other can't I know that's great. I appreciate that. Yeah, and so he's been preselected through are co-chairs and he is a council position. Christian tell us a little bit about you like me to buy all that be great. Tell us a little bit about your background and why you're interested in serving on the visor for PT Sounder at the term. I am currently in urban planning graduate students at the University of Washington. My focus will be around Transportation issues. And I specifically pedestrian issues that I am very interested in the Nexus between land using pedestrian travel because I see pedestrian travel as the most Equitable form of travel seen that it's free, but it can do a lot better by creating more access quality child locks for for those who don't have it so that they can get 20 me to call. I'm so reasons why I'm applying to or looking forward to be on the board is I'm just holding the city accountable for some of the a project that they're coming out with I'm intrigued tell me a little more about the other examples of projects where we're doing so well and maybe where we could do a lot better. local example of District Ford that blends working on his 43rd very interesting on that the between Sound Transit light-rail coming in and a major employment Hub and four students. That's 43rd is going to bring so many pedestrians coming through there and it's exciting to see what kind of Street narrowing and the how to get the bus system through there and whether cars should even be allowed on that street. So that's an example of an opportunity that we have spring. Is there lots of opportunities facing us and in with his opportunities come challenges and possibilities do things right in the puss play than to not and I think I'm too often when we fail. I think we get stuck in with the status quo and thinking that we can't make the type of changes. We really want and I think the best Advisory Board and your perspective on that. I think could be really helpful and pushing us to not just accept the status quo. But really we envision no block by block how I want to remake the city to work better for folks. So I'm excited. I'm convinced calling to see any questions. Cummins I just love appreciated what you said about how The Pedestrian mode of transportation is in some ways. If you think it's not something that occurs to people because it's so ubiquitous but it is it is there's an equitable Equity about it. Then I'm actually that also brings to mind that if we want to make it too late quote about then all our sidewalks and walkways should be ADA Compliant because pedestrians with all abilities should be able to drivers on their own so very important. Well, I had the pleasure of actually grabbing coffee with Andres on Saturday. So I feel like I was able to have detailed conversation about his background and experiences. And so I hope that you remain involved and engaged and again congratulations on the new baby. Thank you. And I really appreciate this. I think how we protect and manage and make sure the pedestrian realm is others have said the great environment. Everyone is a challenge this text conversation. We're going to have about new CD. It's a little bit about scooters, but all sorts of things that you know as Innovation happens in new opportunities, We have a history in the city of San Well, it can't be in a bunch of different places cuz I was already dedicated to certain things. So let's keep cramming them into the space is left over which is the sidewalks and as more and more things are In that area without us expanding them whether that's cafes or advertising or Scooters or bike parking and transportation system users have to navigate that it becomes harder and harder and so pedestrian. Advocacy is going to play a role I think in just about everything we do Transportation go for it. So thanks so much without I'll go ahead and move gym that have never won. Everything I'm saying. Hi. Hi. Thanks so much for your willingness to serve to big time commitment will be voting on. This it full Council on Monday. You're certainly welcome to attend to watch but there's this new need to be right here because internees participate in all but thanks for mailing a servant. Look forward to hearing more. agenda number two loving you want to read that in and out and I presented support item. Number two is response to statement of legislative intent 35 - 3 - a - 1 - 2019 emerging technology and Mobility options operating in City right-of-way in this item is for briefing and discussion. Are all seated Wolf start with a quick round of introductions. Thanks for being here today. Thanks, I'm Tracey Crouch check with the Department of Transportation policy and planning director. Good afternoon. My name is Radcliffe dacanay. Also with s. In the policy and planning division. Thank you all so much for being here. I appreciate the kind of your Collective ongoing work about this question in front of us today. And I appreciate the kind of thoughtful response to the statement of legislative intent that came out of last year's budget. But why don't I let you all tea this out then walk up to the conversation and if it's okay as we have questions, we'll just kind of interruption. Awesome. Thanks for having us today. And I'm so glad to hear you received the response last week that we submitted specifically just in time. We finished a few hours earlier, but I don't know what I got to you. But it specifically you asked us to respond to three different elements that the survey of new Mobility options that may come to Seattle in the next 3 to 5 years or so to take a look at what other cities are doing to accommodate newer emerging mobility and then to develop a strategy to safely and sustainability integrate these options into our transportation system. All right. So there's actually quite a large range of emerging Mobility options. We tend to call them emerging Mobility other than new Mobility someone interchangeably. Some of them are already here. We are familiar with car share ride-hailing likely Uber and Lyft with Bike Share and then there are others that are on the horizon such as automated vehicles and delivery drones are robots may be flying taxis were things. We haven't even thought of yet. So to help us with decisions on where when and how we expand and embrace these new and emerging Services. We've developed a set of guiding principles to help us in this work. So the first one is we will put people and Safety 1st and safety is Paramount no matter how you get around Seattle and R Street should be managed to move people and good safely. We will design for customer dignity and happiness. You should not be made to feel that you were inferior by how you choose to move around the city and our public transit system and emerging Mobility options must accommodate people with Mobility impairments non-traditional schedules families and others who need flexibility and how they get around their City. The three principles we will advance race and social justice Mobility is a fundamental human need and everyone needs a barrier-free transportation system with affordable options that help Robaxin with systemic racial and social social injustice has inner transportation system. We will Forge a clean Mobility future. We're committed as a city to climate action and merging Mobility Services should offer clean energy and expand human-powered transportation. We will keep an even playing field through Partnerships and Affair and flexible regulatory environment that protects users and allows for data sharing with the city. We can urchin expanding Mobility Diaz companies jobs and Workforce training by doing so we will maximize public benefits. We want to ensure that new Mobility options are additive tour transportation system and do not undermine or take away Mobility options Chick-fil-A retention around our public transit system as well. We will be responsible stewards of public resources are right away is our most valuable public space and we will ensure that streets not only prioritize Mobility, but also allow for Access for people in Commerce. So as we go through our working and onboarding new Mobility options, we want to be mindful that there are a lot of great potential benefits. They can bring those City if we thoughtfully manage our Mobility future potential upsides could result in more convenient for users safety Equity affordability and importantly they will enable us to accommodate growth without increasing congestion. However, if we aren't intentional and how we expand emerging Mobility options, there are numbered downside risk some of them of the flip side of the potential benefits, but we could see more congestion pollution and transportation system inequities. We could also reduce support for public transit and which is the backbone of our system and we could end up in a situation where were not obtaining data valuable data that we need and could use to help manage our transportation system Rob optimally so with that is kind of some framing elements of how we approach this. I'm going to turn it over to Radcliffe to talk about some of the specifics around some of the potential emerging new ability options. So as Tracy's mentioned, there are a range of emerging Mobility vehicles and devices and for this particular legislative intent response. We focused on a subset of emerging Mobility options from e-bikes e scooters electric personal assistive Mobility devices, IET amd's delivery devices or delivery robots to transit POT also asked us to look at so we've kind of General Lee said from bikes the Box An hour Sly we did not include the car sharing ride hailing on demand microtransit Ariel Jones. Those are beyond the scope of the report that we prepared. Most of us are familiar with the e-bike. These are ones that you see up here on the slider pedal assist versions that when you start pedaling and there's some resistance electric motor kicks in and goes up to about 20 miles per hour and thereafter. It doesn't assist on these are a part of our Bike Share program. And these are probably the most common that we see among what we call emerging Mobility for this report in part because of the successes of our our Bike Share program last year. There were two million rides. We've made the pilot permanent or we've taken the pilot to a permanent Bike Share and we've taken lessons from the pilot and have applied then into the next version of of Bike Share. So expanding Citywide coverage. Access to address Equity primarily through different payment options. Also looking at improved bike parking management requirements and increased bike parking capacity boxes on the sidewalk and just to avoid clutter and then in through April 2019. We've got a promising number of a bike ride. So far this year and other accessories accessories include the Bike Share programs partnership with Outdoors for all so it's helping to increase access to cycling so over this summer The partnership is going to allow daily operations at Magnuson Park free rentals to people with disabilities for adaptive cycles and then Outdoors for all with this partnership is going to go to 10 different events in in South Seattle to broaden that access. And then also we've worked with rooted in rights to do Bike Share a bike parking education created bike parking education video that will be released sometime this week really grateful at both our advocacy and their partnership with the city to help us, you know, do a better job at delivering Mobility consistent with the goals that Tracy highlight in beginning. I really appreciate that one of the things that I'll just mention we were on the e-bike The Bike Share program is the continual concerns of of where people Park their bikes is being a problem and colleagues. I just went off like that. I I think I might be interested in making a formal request to ask doubt that we step up in 4. How he know including fines and penalties for users and the Bike Share companies when they're not in compliance with the parking. It's it's great to see these numbers. Some of these are just outstanding especially as someone who lived through the first iteration a bike share here, you know, we couldn't have dreamed to have these kind of numbers frankly a few years ago. And so it's it's definitely adding an outstanding Mobility options, of course, you know folks with certain disabilities can't use these and there's a lot of them what they're experiencing is actually a big relation of a transportation system because of that and so how do we know we can consist of the values how do we add more options but not on the backs of certain users and I know that my understanding is us. I think he's been working closely with some is providers, but I feel pretty strongly that it's time to step up on the enforcement in and hold these folks accountable. I think they will find ways to hold their their customers accountable or keep them off the system if necessary for not parking, right, so It's something that we have to do. on on the bike shares, is there any information or cuz I know we collect we currently gathered the data from in point in point. Is there any additional information or data? That would be helpful for us in terms of informing? What where does Investments are made for internship bike infrastructure and so forth for us to consider as a body on origin and destination for all trips. I'm using the Mobility data specification, which is the new National Standard. It's very exciting topic for me quarterly audit information as well. We are using that data to help Drive future investment and where will drop infrastructure so we are using the data from the program to basically kind of look ahead to where we might need more racks where we're seeing. That's where we're seeing how usage in addition to like a number of other methods. So I'm happy to share the q1 report. We do monthly reports as well and any other additional I can tell you how that conversation more specific data. Be helpful. For the bike parking infrastructure that's used. It's something that we are very interested in but are on to be quite Frank argue. No capacity to analyze it internally is a bit limited currently. So we haven't prioritized it for right now, but we hope to get to that, you know later this year. This has been a new project to bring the data and house. So would love to explore that with you if you're interested in it cuz it is kind of a next-level on data analysis, but something is definitely on our radar X. We have the data access to that data. So which are some of the The locations are reading the city where you're seeing the most lack of infrastructure that needs to be addressed. That is a great question. I don't have that in front of me. I can share with you. What's Anarchy one in terms of where we have prioritised infrastructure so far this year, which is based on achieving total and last year's day. As a new end of the summer were planning to do a deeper dive analysis, but I'm happy to share pass that along to you. We definitely want to make data-driven decisions around that for sure. Tell continue about variations in ebikes. So this is an e trike for sharing. This is an example of any clothes are covered each right share in Vancouver British Columbia. It's being piloted at the University of British. Columbia companies are already beginning to roll out or play variations of these attract both covered and uncovered. So we may be seeing more of these variations in the near future that we may be considering for our own City. It's still for one passenger yet. So you can see the internal a little bit of how it works there two wheels in the front one wheel in the back and a seat for one person. So first city and state codes are considered adaptive Cycles Orchard feed the same as ebikes. Right? So it's recommended that they should be operated in bikes beans where they can be operated by planes. This is how they're being used in the Pilot in in Vancouver. Another version is instead of moving people The Living Goods Sony trike for for delivery in these are being piloted here in Seattle by UPS. I got a pedal one of those machines a pretty sweet that are you go. I went to the ribbon-cutting as they were old enough now to share the transportation committee you get invited to things game. And then of course, we have the East cooler and we're all pretty familiar with the E scooter pictured there on the left is a typical electric motorized stand-up on foot scooter will likely see variations of these e-scooters over the coming months and years. The one on the right is the writer to can up to stand or or sit on the scooter House Bill 1772 pass in April of this year and an amended state laws related to motorized scooters, including the definition. So some scooters now can be sat upon well while operating And then back to the one that rolls off our tongue really nicely L electric personal assistive Mobility device. So you can if you think a Segway you wouldn't be wrong hoverboards hoverboards uni wheel and the center of picture there and then one wheel that we took a picture of just outside of City Hall not too long ago. These can you know, most of these devices are privately owned. We don't have necessarily the clearest of of regulations for them and how to manage them as well sidewalk. They're allowed on sidewalks and roadways, but not in bike Lanes. So giving the given the rising number of these devices again most most of which are privately owned probably a good idea to consider reviewing and upgrading out right way regulations to to better dress these devices especially with speed on the sidewalk disease can go up a fairly good clip on you said that they're allowed on the sidewalks but not on bike Lanes. Is that correct? Yes, they are pretty much treated like a Segway. And so they are not allowed in bike Lanes, but they are allowed on sidewalks and and roadways and yes about ebola pedestrian speak other cities as well. I think six different cities around the United States have different rules for them my personal experience at least a year ago. When I was in Denver, they had scooter chairs and scooters are classified as a toy is it state law which meant they could only go on sidewalks and then I forget where it may be is Oakland somewhere. I was when they they they they were prohibited from being on sidewalks in that jurisdiction and had to be on the road. So it's it's not clear regulation is not keeping up with the technology at the pace. It's evolving which is why we want you to help us get in front of us and one of the devices here that we don't have a slide for a electric skateboards that they do go pretty fast and similar they are treated as a toy so they have to be operated on a sidewalk, but when you kick a net electric motor that electric skateboard can go pretty Halls. And our helmet laws apply just two bicycles not to other devices. If it's again, it's not clear of when you're supposed to wear a helmet for these devices as well. So I think that's one of the things that we need to to review of How It's applying again for for the private vehicles that are devices. The next we have the personal delivery device probably the cutest among all of these devices were looking at these are cooler sized 1/6 wheeled devices in some cases no more than 120 lb. They have cameras radar ultrasound sensors and GPS says a lot of technology in the devices. They operate at a pedestrian speed at about three miles per hour, but have a maximum speed of about 6 miles per hour. Is this a defined type in the state law Wright City law state law that new a new law Washington state law has just defined what these are and what the maximum speeds are and where they can operate permissive towards cities or is basically saying the state's going to regulate this realm We maintained Authority that are not currently listed or mentioned at all in SMC. So overview where they they're being tested right now. The device on the left is a version being tested in Washington DC and for their pilot no more than 5 devices at a time are allowed to be deployed. The biggest example is in Milton Keynes just outside of London a larger pilot testing hundreds of these are delivery robots and they travel on sidewalks and cross streets and they're just treated like pedestrians. So like we just mentioned here in Washington state law House Bill 1325 pass turn in April 2019 allows for these devices to operate and on sidewalks in in crosswalks, but then leaves regulations up to the cities to Society hard to imagine that these will be potentially on on sidewalks in the very near future people use them regularly and DC. I was like my first time I was just a little bit spooked out. What is this, right? And then the next device or vehicle that you asked us to look at was depends upon and we included delivery shuttle here as well. Because of their similar in form and have similar issues related to to the right away, but the delivery shuttle that a caring people carries delivers Goods speed electric powered vehicles are they can go no more than 25 miles per hour and operate in the street and are typically operated as a commercially owned a fleet of vehicles. The example on the left is an automated Transit circulator carrying up to 12 people. This one is being piloted in Denver shoveling passengers from the Light Rail station to several Office Buildings in the nearby Business Park and on the right is an example of an automated delivery shuttle from a recent pilot in Scottsdale, Arizona an automated vehicle company partnered with the grocery store chain to test these self-driving Goods delivery vehicle to deliver groceries. Sorry enough opening you included automated Transit pods, but did not include on-demand microtransit inside clear to me what the distinction is between those right the microtransit right now in that definition is kind of like uber but they're just regular vehicles or bus has already that you can call out or user app. Been here just to recap the ownership models of the different types of of devices. We've got a number of vehicles or devices that are private are personally owned. There is a shared model and Commercial Fleet and these Hall have implications on how we manage and regulate the right away based on how these devices are used in and how they're owned. Check example the private and personal vehicles, especially the hoverboards in wheels of the one wheels that we have. A lot of right now, we would need no more education and enforcement of these existing devices. And then this charger stand. Summarizes all of the devices that we looked at their top speeds and we've included and specifically to recap where they're allowed to be used. If you note E scooter can only be written and the roadway for Seattle municipal code at this time. Do we have a code around physically e-scooters or is it just fall into some old category that existed before he's who just came along? It's again. It's not very clear of what specifically to e-scooters some motorized scooters are a to be allowed to be ridden in the roadway. So that may have been more for like Vespas or something at the time. It was written but they're falling into that at the moment. So, okay. And then I will move into survey of what we owe the state of the practice of what we learn from different cities. And generally what we've understood is all cities are experimenting with with all of these new devices. No one has all of the answers. There isn't a comprehensive how to to do this everybody all of the Cities. We looked at their learning and we're learning as well. But some of the common key things that cities have done are these main key points here to clearly determined if where and how emerging Mobility devices should be written and parked update codes. If you choose to bring in these devices and of course to use pilot programs to learn and to learn what works and of course to learn what doesn't work and apply that to the next duration of the program And I'll just do a quick overview learnings from other cities. Like I'd mention there is no comprehensive roadmap. No one has figured it out establish clear definitions and guiding principles are our Paramount that helps guide how operators will work with a city to deliver these these programs. And again the pilot programs help cities test and indirect ways to integrate these new technologies into the existing transportation system. and really important to cities and have been engaging the community to help shape pilots and policy and for us that should be a high priority and gather and analyze the data to help make a decision specially for right away policy and and Design And then just to reiterate the establish clear definition clearly defined where to operate these devices and clearly defined Howdy's devices May operate should operate in the right way and and of course to manage parking clutter, we've got some pictures on the side here of how some jurisdictions are beginning to address that parking clutter. Some cities have learned from us actually with these paint in the boxes of where you should Park the bikes more and more cities are applying this is practice to to manage that parking clutter and of course to provide education and enforcement opportunities just to learn the best practices of how to operate these devices and then also understand the rules of enforcement. Because it's it's interesting where we are at Contra cuz it has. Slide or who shared it that I've seen in presentations picture of New York City, you know a century ago and it's two pictures side by side of the same street and then maybe less than a decade apart and it one there's no the right away is packed in both. The first one is all horses and then one vehicle you can see and then in the next one, it's the opposite where it's all motor vehicle cars and was one horse and just in these these moments in our history is human beings were transportation technology olives in shifts and I can can imagine what it would be like when there is a equal mix of horses and Automobiles and I don't know if they even had sidewalks back then or what, you know, how you even Define the right away and clearly, you know for my generation we came up with a very clear understanding of where pedestrians are supposed to be in where cars are supposed to be in bikes or maybe a little bit of a gray area. There's dinner whatever City you went to America. There was there was a bunch of innovation happening and it just kind of worked and I think we're now at this another inflection point that the climate and Mobility are demanding that we shift how we get around in denser cities and it's chaotic mean it's and it's really disconcerting I think for a lot of folks and it's also really exciting for a lot of folks and sometimes it's the same folks. It's exciting and disconcerting more than our goal. You know, as we work through this in the city of Seattle, but obviously, you know, we redefine this right away in a way that meets our needs and I would say that the existing allocation of Iowa space is not meeting our needs him a climate perspective and Mobility perspective and prospective the changing is not an easy thing to do. And so anyway the pictures you've shown here remind me of for capable of these transitions certainly after the fact we can reflect on them. Wow, that was interesting, but we're in the middle of it. It's challenging. That's a good segue to the potential next steps that we've recommended pilot programs, of course and we started our e-scooter pilot and it's now and development will be working on that over the next few months and we'll look at policy and legal framework upgrades education and enforcement. Sorry. Can you go a little deeper and just in terms of where you are with regards to your scooter pilot out. We're at the very early stages of that right now, so I would say not very far into it. It's probably worth repeating of their number is on the council didn't excited for that work to move forward. I think I probably aware that I appreciate and then they are a few weeks ago. That was really helpful. I know that she seems to continue to have some like the same concerns it a lot of us have but we also think that it's time for us to get into the business here and start learning by experience. And so look forward to seeing that if there's anything we can do from a council perspective to help move that along we want to partner will speak to that a little bit in a presentation passing legal framework upgrade education enforcement that will do data collecting and Analysis and then of course design standards and right of way as related to commissioner Bratton. City scooter pilot program principles have these are planned actions. We're going to focus on safety and as two Riders protection for the city and taxpayers through full indemnification and equity. So the e-scooter pilot program development safety is first and First and foremost link incorporate best safety practices from other cities Define helmet requirements create an education campaign how to properly ride a scooter understand what the rules of the road are you this is an example of an education campaign have been used in different parts of the city across the country basically where and where to and how to ride where and how to park and also just probably just as important where and how not to operate these devices. So this is something that we're looking at to consider doing over the next few months as well. And as we engage the community to help shape the pilot which is this is a continuation of what we will be doing over the next few months. Engaging the community is Paramount to us help us answer and figure out where to where and how to ride and at what speeds where to park these devices and collect data on them with what are the processes for that and then we need to look at how we can require full indemnification Provisions into a program and also look at the establishment fines and enforcement and then also Define the minimum threshold for remaining shared bikes. And other potential next steps, this is more broadly applying to all of the devices again will look at reviewing and upgrading regulations. This is where we want to go with these devices refresh some of the city's existing principles. And then Define where devices can operate and park again to be clear and do more of what you see in the bottom picture and managing parking and less than of the picture of about and then revisit priority to inform regulations. Can these devices operate in the bike lane? Yes, maybe that's conversation still to be had and improved potentially evaluate based on safe speed. Could they be in bike Lanes? Could they be also be written on the sidewalk if they are slow enough but not for long distance just to park at cetera. I took the photo there on the the bottom right the more of this photo shows both Mark parking spot on the Sidewalk Ends in Ballard. And then also in street bike parking facility to one of the things that I appreciate the thought has been doing a great job of creating more parking opportunities for bikes at the moment that for probably a lot of devices going forward one of the themes that I've heard multiple times in the last few months of conversations including ones that started Vlad is the idea of using that that no parking spot on the street in front of the site the stop signs and right now that you know, that's not a piece of right away that's really being used for anyting. Although people probably legally park there occasionally and when they do it makes it more dangerous for Road users because sight lines are blocked. And especially hearing from some folks and Disability Rights community that that that's a really great place to put a cuz one is not on the sidewalk to it also prevents someone from parking illegally there. So I would preserve sightlines to make us all feel safer special winter crossing streets and I would love to figure out if there's an opportunity especially this moment. Where were you I feel like we have a shortage of move aggressively to claiming that space for for parking across the city and I imagine that the resources we currently have allocated to Dubai parking is probably not enough to do this Kaylee want that I don't know that there's a possibility of not waiting for another year to do that. If if we're hearing pretty clearly that that's is a priority how quickly could we deploy no significant increase in parking and it's so, you know, you know it at every intersection there would be spots in that can really help with some of the challenges and I would be certain they willing to Champion some of that on the council's and if we need to know with all those budget financing or other way. That's great. And we love your support and we have been working opportunistically when those opportunities presented where there's already something else happening or we hear from our safety or Vision zero team Wyatt and roll up and taking advantage of that. We want to do more we're doing going pretty fast. Actually. We're hitting our goal is 1500 this year and I think we're over 4:50 now installations, which is pretty good. Even the summer summer season yet. Glenn to carry on with education and enforcement do wayfinding and signage. This is an example of the trail courtesy that you might see on trails in the mountains with maybe we could grab that to be used here in an urban setting to say to be more clear about who has the right of way on a sidewalk or a trailer even a bike lane and it will include training and education enforcement Authority is from police Street ambassadors and partner agencies and organizations that are helping us to deploy some of these devices if we choose to take electrician subtle way of introducing a horse share program. And of course, we've got data collection and Analysis to Kelly's team working on working with that data to establish a baseline usage to help inform policy decisions. And then to require data as part of any pilot commercial and Commercial Services. We also probably need to figure a way out to address getting data about private vehicles. And the picture here is just an example from E. Scooter knee scooter data from Portland 2018 pilot and where the location of starts and stops their scooter rideshare. and lastly to look at design standards and right-of-way allocation of Four Points year to consider designation of low-intensity travel lanes and in strategic locations of these could be lower speed lanes and rethinking the right-of-way integrate emerging Mobility devices into Street design guidelines that are part of our complete streets guide book and of course to manage the sidewalk for safety and then also for commercial purposes the very last one is to provide more Mark parking spaces or zones and to be thoughtful of again how to manage the parking lot of only a few bikes but potentially scooters and all these other devices that are going to need us a place when they're not Moving about you go back to the the first bullet point the low intensity travel lanes and tell me a little bit more about what we're sure so this is an example in Kansas City Missouri where they've wanted to integrate a number of different devices from scooters to bikes to any of these into a low-speed laying low intensity line. So they just taken the parking Lane here and paint to use paint and post to say You have a protected place for these devices traveling no more than 15 miles per hour. So this is pretty similar to our protected bike lanes and perhaps this is something for us to rethink of where might these Lane where my baby appropriate so we should be doubling down on these Investments as a city then. We would need to look at where they appropriately where they would be based on the data that we think we have we don't have any data for Easter has obviously right now but that's something to look at. I'll try to answer your question comes home to take her. Yes. We should be doubling down. I do think on these things. We know we moved around around and it made a lot of progress for sure in the city on biking the structure. It feels like almost those last but my involvement in the last 15 years has been a mere warm up to the real action that may be coming if we're talking about no millions of riders on multiple different types of devices instead of simply looking at like what's the right Corridor to put a bike lane in through a neighborhood saying all's all right away is need to have this functionality in one way or another and now the potential for With things like you scooters to can I capture the imagination if you will of a much broader swap for the public than who've been comfortable riding bicycles to date which is also increasing rapidly as The Innovation with e-bike send and the bike sharing program could be the Tipping Point is just that instead of being a couple percentage points and travelers were talking to me at 10 to 15% of people are traveling on these devices and it'll be necessary for the city to have significant amount of right away dedicated to make that actually work and it's affecting him to do we would have done in a few years ago. So he's going to require a concerted both policy and kind of budget commitment to make this happen and I think we're at a moment where we want to build on the successes of the past, but also kind of move swiftly because you know from a climate and congestion perspective and Mobility perspective. We have an opportunity. Yes and Sergeant ditto of what everything comes when will Brian said but the other part of it to me is just thinking about it from the issue before debility more holistically. We we we have such a strong focus on housing, but the second largest expense of individual family has is transportation. I think when I think of but has allowed me to personally just give up my car is the work that thinks so many people like counselor O'Brien who have really pressing a lot of these issues in reshaping the conversation but also thinking about how demographic Alicia the city of Shifting how more individual can give up their car had the option of giving up the car is something that a particular mindful of especially as we kind of think about where does investment go for the future? Pictures you're bringing up affordability. That's a great point. If he's pleased to provide lower-cost Mobility options for a lot of folks at screen. Everything else. I want to touch on messages. I think that's what we will be building on the focus group. We held earlier this year and some of their comments and concerns and and using those we design that you screwed up program moving forward. We want to be very intentional about the community engagement on this since there are a lot of different perspectives and needs that have to be addressed when full of question just as you touch those pajamas. Can you say the question again? What are the what are the policies look like? In other cities were that were the companies have agreed to full indemnification? And can we bring that some of those policies here? I've I researched the different Indemnity Clauses and insurance Clauses and a number of different cities. Most of them are boilerplate and there are a few that have adjusted that boilerplate language Oakland for one that has I think done has massage their their identification Clause to specifically address what they wanted but generally not spoken to a couple of different cities that they said it. This is boilerplate for our ride share for other types of of Mobility Services as well. But I think Oakland is as a model that we might take a closer look at. A couple things that I'm just driving down just for my knowledge that I'll repeat here just so you could a pilot program. So either need to hear that from us, but I'm so anxiously awaiting next steps in. And you know, I think as soon as practically possible to get the pilot out there, I think the number of us would be excited to see that the guy mentioned earlier the bike-share parking enforcement is something that I think you know, it may have been appropriate to have a different approach in the past. But I think word a moment where we really need to step up enforcement so that we can get compliance which is the ultimate goal. I'm very interested in as I mentioned earlier expanding the parking options for these various Mobility devices. And so I don't want to acknowledge that I think I started is doing a great job and I think some of the eye Do we have our kind of becoming national standards? Probably little early to say that because things are moving so swiftly, but I do think we're innovating stuff and would love to make sure that we have the policy and financial resources in place to do that because I think and whatever Direction This World goes we're going to need those spots of figuring that out as soon as possible and then building these Mobility corridors what I'll call protected bike Lanes at the moment because that's how I envisioned in my mind that I think they're going to be used. They're already being used in likely to be used in the near future much more broad sense, but then obviously there's a lot of work to there were doing on that has been doing some great work challenge with some of the speed with which things have been delivered to will continue to work on that front. But those are kind of four of the takeaways that that I see from this moment, and I think it's really important to think about how you Continually surveying other Technologies like the e-trikes up in Vancouver UBC, you know, those are also a type of game changer, cuz those I think would be pretty and appropriate to be on a sidewalk. Not sure that they would not sure how well that I could do with with the motor vehicle where they fit in the bike Lanes. What are the widths of those things as though that's from like a regulatory thing. Like I'm just like freaked out about it. And then if I put my hat on like Mobility, it's like this is so great for folks with no variety of Ages and abilities and needs to be able to get around weather contained in those things that I got my quite sure if that was a pedal assist or just a pure electric deal, but they obviously there's different varieties that are just drive things and you know, you never think of going on the freeway with with some devices, but they could be the types of innovation. Really, you know radically transform our carbon footprint from Transportation perspective and I want to be in a position where we're embracing these changes because we've been thoughtful about where they might go as opposed to sang closed for business for the next couple years will we think through it because and meanwhile, we'll put thousands of tons of CO2 in the atmosphere when we figure it out. So however, we continue to count to be asking these questions and surveying other folks. I know you guys are part of the national and international organizations that are talking about this but opportunities to come back to this committee. ditto Thank you all so much else. You guys went out and closing. Really appreciate your kindness and look forward to working together in the future. There's anything else we will be adjourned obvious. Thanks for a great meeting. Thank you.", "end_time": 3731.8}]}