{"format": "raw", "annotations": [], "confidence": 0.9470225147902965, "data": [{"start_time": 0, "text": "Good morning. Today is Wednesday, June 12th. 2019. It is 9:30 a.m. This is our regularly scheduled meeting of the gender Equity safe communities new Americans in this committee. And I am assuming that I will be joined by some of my colleagues that later this morning. So if there is no objection and I'm the only one here to object to the agenda adopted today's agenda is adopted. There are two items on today's agenda first people here and possibly vote on Council bill, which relates to the County Emergency Medical Services EMS Levy that will be up for a no on the ballot for for King County voters at the next general election, which is November 5th of 2019 is Council would authorize the mayor to enter into an interlocal agreement with King County and would further authorized King County to place on the ballot for the general election on November 15th, 2019. Department of Education Early Learning on their rsji change team presentation as usual. We always begin all of our meetings with public comment. There is no one signed up for public comment and there are no members in the audience. So we will go ahead and close out the public comment period and go ahead and begin with items of business on the agenda. So we are missing the executive in terms of the presentation for this particular issue that is their presentation. So I'm going to go ahead and have Roxana read this into the record and and then I'll hand it over to Greg for some filibustering agenda item one Council Bill one 19539 and ordinance relating to Emergency Medical Services authorizing execution pursuant to The interlocal Cooperative Act of an agreement with King County regarding the imposition and allocation of property tax revenues generated by a six-year voter-approved King County Wide tax levy for emergency medical services for briefing discussion impossible. Secret santa lucky for you Doctor Noble we had introductory remarks to make but let this be a lesson to you that I do start on time. I'm very impressed. So we will go ahead and begin with introductions and then I'll hand it over for a walk through the presentation. I believe there is a PowerPoint presentation that is not yet projecting that will help you with that swell. We are doing introductions. Craig. Council Central staff budget director to just hand it over to you then. Okay to be straight for the straightforward piece of legislation. That would place would be the city's role in placing on a on the ballot for November 11th. That will be a countywide Levi for Emergency Medical Services. This should be a renewal that has been in place for several decades. Actually the most recent one was approved in 2014. It was a six-year Levy in The Proposal now would be especially to renew that Levi. So this is unlike many of the the countywide measures this one that is is From the city's perspective just reviewed the revenues entirely proportional to the assessed value. So entirely proportional to where the money is generated the cities and receive that money and I'll explain it. I'm to support our overall Emergency Medical Service response to essentially the fire department something like 80-plus percent of their calls are for emergency services. So it is essential how to say provide that service so we can we take that in as General Revenue for that for that purpose as described as force that helps determine the potential scope and size of the Levee for the rest of the purposes for them for the city. We get our money and use it as simply as we as we choose so I'm worth less involved in the discussions and negotiations about how the To the county money is allocated across the various fire districts and cities processor. It's essentially a revenue source of Summer level of what has been proposed by that by that group and what has what we are seeking her approval for in terms of placing is measure on the ballot So currently the Levee the six-year Levy will generate through the end of this year for million dollars over six years for the city and you can see how the poppy tax rate as average about $0.27. The the proposed living with raised considerably more about 20% more overall and you can see the property tax rate what's going on? There is an overall property values are increasing. So in order to generate even more money, you can actually do it at a lower rate terms of the average household property tax increase average for the renewal Levy compared to the previous level again about 20% 20% higher so I think it's important to understand. What do we do with this money? And how does it fit into the overall budget for Seattle's services in the space? So you can see her as a comparison just over the course of the previous levels of the year before and now your current what has changed in terms of the revenues that we get from the MSRP on an annual basis and what the city's overall. The budget is for the fire department has increased and will increase again upon renewal voter approval for emergency services increased considerably more than that. So will be asked for additional for additional resources that might perhaps expect some very large discreet increasing Services What's really happening is they're helping to support the ongoing increase in cost of providing those services. That said I wouldn't know that there have been some notable increases in the level of service that we provide particularly in the emergency services space. So if the past few years, we've added to 8 cars and are working out on a pilot at a vehicle that would serve comprable function but in a more targeted way so and at the same time and the same time the overall costs including labor cost of operating. The fire department has increasing as you can see here increase considerably over that time. I'm looking forward we expect again inflationary plus increases for for labor and other costs so about $53 from that will increase approved to 68. But again over the same time. Increase by but yet again more than that. So are we have assumed in the endorse budgets when we presented the endorse budget to you last fall and then and actually more recently give you a revenue forecast update we have I have assumed EMS love you in that face Revenue forecasts. They were not adopted law but our experiences up with a very high probability that just make her past countywide 60-plus percent last time so we have a high level of confidence that the revenues will in fact come through. So we've been counting on his revenues. We've been counting on these revenues to support the anticipated increases in emergency services that we've experienced and that and that we will experience what led to the Deborah the reduction from the point in time that we were projecting the $0.27 to the point to 65. What happened was the property value that in order to generate the same amount of money. You can you could come in with a lower rate and they making a second edition. We're sensitive to to the property tax impact and not wanting to generate more Revenue than they had and they had negotiated towards and otherwise intended cancel Central staff memo which was written by Greg. On his page 3 it notes that in the event that the renewed EMS Levy is approved by County voters City budget office indicates that the 2.9 Million Dollar difference would be backfilled with general fund and that the difference would be addressed in the overall picture of the nearest 20/20 proposed budget. So I just wanna make sure that I understand that the other impacts of we had initially thought they were going to go for a higher rating in the higher Revenue. Overall Revenue take ultimately decided the previous. So so as part of the adjusted revenue forecast, we are acknowledging it this compared to what we get done screen doors slightly less revenue from this source, and what will have to balance towards have to balance the 2020 budget from the endorsed now to the to the proposed with a little less revenue on this front. So I guess I'm not I'm not understanding if if is there going to be is there going to be some trying to understand it too or is in the mirror for president 2020 going to reflect 68.3 million dollars for this particular item. So when modifying theorem endorse budget for 2022 reflect the actual Revenue that we anticipate receiving from this Levi. We are getting these Levi Revenue dollars and then were adding additional money from the general fund to the general fund. We spend wellmore on the fire department then the Levee generates so we've been A long time before we have always considered part of the overall revenue forecast for the city. So so fun based on these decisions or later. There's a little less money coming in from the fundus Levi. There may be more or less money coming in from other sources. So that's why I think it's the fiscal note. It's it's the 20-20-20 25ms or change of plan and Levi Financial plans with a spreadsheet for those of you who are looking for it. Under it. So it lays out revenues and then it has expenditures and then there's a category that is specific to Seattle and it says projected there's a lion there disproportion projected King County EMS Levy and then there's the third line that says projected under collection and that's in the negative across the board for a total of 6.5 million. Can you just there wasn't a lot of explanation as to what that actually means. So I was hoping that you'd be able to shed some light on that. It's you do the math you get the one particular number but the experience tells us that we won't collect me. I was like 99% of it but not 100% of it. So it's a it's a recognition that Your son some portion of those are paid sometimes in arrears overtime. So they they they flow in but it's a recognition that simple as the tax rate times the assessed value because you could not going to collect Debbie penny. So under collection is literally the inability to collect the assessed property tax value from property owners who live in King County who are assessed the the levy but aren't yet painted throughout and then there may be some folks were we think it which is real as we don't collect every penny that that the math would suggest you can get great. That's all I had a high-level again with Which Wich in order to take for this measure to get to the ballot to County requires the approval of jurisdictions within the county. So in this case the city we've worked with the county in developing a proposal. It provides a basic Revenue stream to support the fire department and we strongly support moving forward to the ballot to provide the revenues for those pillows essential services are going to be lots. Of course. I talked about the two lines of business that I think are or has ordinarily and historically been funded through this Levy the first thing the advanced life support services in the second being the basic life support services both Seattle and in King County notably under the basic life support services. We've there's a new line of the mobile Integrated Health Which says it's King County as opposed to just Seattle. So can you shed some light for me on that? I could should a little bit I'm describing is at the for the Seattle Fortune. We get our share of revenues and we do our thing. If you will let you know one of the things were looking at actually ISM ISM mobile Integrated Health approach to again, the the low Acuity still on the county side so they can providing service outside the city and they're negotiating between and among the city's in a fire districts. They are also its funding for moving into a comfortable space recognizing that this is the issues that we see that they see as well in terms of some sort of folks who are calling nine-one-one are really not necessarily in an Urgent Care situation, but you need Medical Services of a form. Dollars in Revenue sources for the same thing, even though it's not called out in the spreadsheet absolutely not arrangement. We have on a countywide levy the city gets the money generated in the city to use for emergency purposes as we determine the fire department is in close coordination with its Regional Partners Mutual Aid agreements and currently planning around on the the communication system that they all use so but but but from a governess perspective self-determining Any questions or Greg? Did you want to add some committee? And the Seattle City council will have to meet in order to get the ordinance passed King County and time to give them authorization to put it on the ballot in those are at the end of the staff report. But essentially the quick version is it would be best if the committee passed it out today the committee could pass it out at a special meeting. The final sort of dead drop dead deadline is is the 24th of June for the king for the Seattle City council to pass this anything after that would require special authorizations. Okay. Am I understanding is that this proposal actually is generated through a task force that was previously created that had representation from the city of Seattle. But also from the other cities in King County and King County itself and they start of spent a year working through the process and identifying the plan that's before so that leads me to the conclusion that there isn't a lot of flexibility in terms of what the city council can actually do in terms of moving levers related to the proposed Levy. So I'm just looking to you been 4 for confirmation or or rebuke of that the reception that's already know that I think we do what we have done very well. This is the same reason we've had historically so I don't want to say to me in a week to cut a new deal and I don't have a piece of paper to wave in front of the press start with my new deal. What is a long-standing Arrangement that deserves the city? Well, as you described it's been work together with our regional Partners. So we are we are standing with them as we move to the ballot and ask the voters for significant amount of funding to provide again. This just really critical service the teamsters 763 who provide the services such as basic life support and advanced life support are folded into here and whether or not we've built into the Levee or the folks who did the analysis over the last year have built into the Levee the possibility of the need for increasing wages is that part of this is or is there an additional General fun or funding from the city and county that we would pull together to address the underfunding of those contracts? I don't know specifically came up again, but I was just driving this money will flow to the to the general fund with the Restriction that has to be used for for emergency services. So ultimately if we determine if you determine that inappropriate, you know, what the what that's inappropriate use of that money is to provide additional wages to the basic life support for the public Advanced life support So Serious by the Seattle Fire Department good call 911. If you have something less less significant, I'm going to speculate your broken leg or something. I need transport that's provided by a private service and expects the basic life support and it's the it's the contract that the city has with a Amar and then the way to the page that you're referring to soak. We don't try to direct general fund subsidy to that contract at least in the abstract we could and I believe these funds would you would be eligible for that use a bug and I want to emphasize it currently were counting on these revenues and there in the in our forecast for 20/20 and have been in our forecast for 2020 to support the if you will the SSD of the fire department's basic function, so we don't have an obvious additional Monies to to direct towards that but again, that's a question of overall general fund priorities, and we also may choose to invest those those flexible dollars. Follow-up question to that. So I'm in the basic life support services, assuming that the EMTs to provide as Services through AMR or American Medical Response as a contractor do we have a general sense of what the projected increase in wages are compensation is from previous years or previous Levy to these proposed out yours. This lady does not dictate that contract in anyway, so just provide resources that is negotiated between the fire department and am are correct and it contains the details that it is asking about To date and in our projections, we don't have the general fund providing subsidy into that contracts a week. That's so when you if you break your leg and you are so transported you get a bill for those services or your insurance company gets a bill for those services on the city does not step in the reason. We negotiate the contract with AMR he is at least two folding the first if you do if you will so we can put together a know how to take a patient in sir transfer jurisdiction. If you will from one to the other the other is to ensure the level of service in the degree of coverage we have so that when you call 911 and it turns out you only have a broken leg that you don't have to wait too long for the AMR ambulance to arrive. I'm so it's not a contract where we're paying but it is a contractor we're providing sent you a franchise agreement exclude. Right to operate within the city against the reasons. I just described to ensure smooth hand and toss and effective coverage across the city. So I'm just a just to clarify 300 what I think I heard on so obviously we do have a contract that we have initiated with ammar for the basic services that the folks at Teamsters 763 provide as EMS providers, but or EMTs and sorry but we don't necessarily in that contract dictate how much of this percent of percent of this Levy would go to that that would be as I think I'm hearing you say a policy decision at a later point if we decided we wanted to do additional general fund for those workers specifically thin hands or to fund the contract that is generated on it that purpose or alternative. We could use general fund and it wouldn't it wouldn't really matter cuz we're already spending from the service. Well more than is generated responding. Well more Jen. Funding is the Dennis Levi provides. So overall I think I think the big takeaway for me is that this is a mechanism. This is service table mechanism by which to continue to generate much-needed Revenue in order for the city and the sale fire department particular to continue to provide Emergency Medical Services in in the city and throughout the city and that's what this interlocal agreement that were going to consider today accomplishes is allowing us to enter into that region-wide countywide system to be able to participate and then the benefits of receiving some of the revenues that are generated through this That being said once the revenues are received by the city of Seattle. It's up to policymakers at the city to determine how to best prioritize those dollars with the overarching understanding that the dollars can only be used for Emergency Medical Services, which is a broad category, but that were historically to find it as advanced life support and basic life support and and that would include programs like the low Acuity mobile Integrated Health Unit. Is that accurate? Great any other questions or comments? All right, I think we're probably ready to vote on this particular given Mr. Doss's outlining of the deadlines associated with needing to take action on this. Also. I will be out of town on June 24th. So I would really like to be able to get this over the Finish Line on Monday this upcoming Monday. So I think it would be wise if there's no objection from your customers get up for us to take a vote on this today. Okay, great. Then I will organize my thoughts so that I can make a smoke shop that the committee recommends that the city council pass Council Bill one 19539 Any other comments seeing them those in favor of the committee recommending passage of the bill vote? Aye aye any opposed? No, no opposition to the motion carries in the committee recommends that the city council passed cancel bill on 9539 as no amendments just as is and go ahead and take this up at full Council on Monday. Thank you. Thank you. Thank you to both of you. Okay, so I'm going to have her agenda item which is a presentation from deal. And if you are here to make to participate in this presentation, I'd invite you to make your way up to the table as Roxana reads this item into the agenda Seattle Department of Education and early learning race and social justice presentation for breathing in discussion. Thank U Roxana. Hi, good morning. Thank you for being here. Hi, good morning so much for being with us. I think I'll have to do is click on a button and we'll see the presentation come up on the screen there. There we go perfectly. Start with introductions and then I'll hand it over to you all to lead us through the presentation and early learning and Michelle Winters. I change team lead for a Department of Education and early learning really appreciate it. You all are always a standout in terms of its really excited to be able to give you all an opportunity to share with us the members of this committee and the public what you have been up to this year take it away. So Michelle and I are going to as you say I just guide us through and to share with you all with what we've been up to this year. I'm still here just a high-level agenda what we talkin about. We're going to go through the 2018 year in review. We'll talk about our wimby summary will review our race and Equity two kids and I will close with some acknowledged. One more year in review one of the first things you wanted to talk about was staff engagement. We really felt it was important over the past year to offer consistent staff engagement opportunities tours SF and so what we did was we offered lunch-and-learns semi-monthly and we also took 30 to 45 minutes of every all staff meeting to talk about an rsji topic and said for us to provide an opportunity for staff to engage around a particular area of interest on recent social justice to practice a little bit of your Equity language and then to engage in peer learning flipping a really positive experience our staff have her spayed and topics on appropriation. We talked about gentrification. We had a five-part series on white culture and actually wanted out of that is that when we did the five-part series on white culture, I really inspired some of our staff to actually lead paperwork on continuing that conversation and looking at how white culture and white privilege play out in our work. And so they've started a racial identity caucusing group and that the meeting monthly so that's been a really positive thing that started from a you know, kind of a light entry conversation table Topic at election line and then became paperwork that they're carrying through this year. We also began integrating color Brave spaces and to our meetings this year and so color braces if you haven't heard of it is conversation Norms that were developed by Equity matters are local anti-racist organization. And these morons were intended to help us enter equity in our conversation. This is a pretty small piece but very intentional piece of Shifting our work culture and the upcoming journey to becoming a more Equity Central organization would be noticing power dynamics in the room examining racially biased systems and processes. He's keeping relationships first and making space for multiple truths. I just wanted to comment on the color Brave Space is really quickly. I meant this is all great work, but in addition to to be in the chair of the committee, I have the opportunity to serve as a representative council on the family and education preschool and promise Levy oversight committee always a mouthful of a title we have a deal is implemented. The color Brave spaces is a practice in that space, and I've had an opportunity to throw out this year. I'm really experienced him in and refine my own my my own skills in the space, and it really have appreciated the opportunity to be able to do that. I think it's a wonderful gesture to how we should be doing our work throughout the city. So thanks for that. Thank you. So as you'll see DeLand are our leadership team and I'll change team members. We all participated in you while you're training them in 2018, and we know that we invested in the training and it was a huge accomplishment for us in deal. But to be more effective if you know three things that we wanted to make sure we wanted to make sure that that we follow up with this training and then we also wanted to make sure that all deal staff participate in the uir trading in order to for us to really create that deep culture shift and we just we know that I'm doing you are all principles must work must happen systemically in order for us to move forward with our work. So we wanted to share that with you as well. We also know that are racing social justice work throughout deal. So here are some things that that we've been I'm working on it as well. So we have a culturally responsive programming workgroup have some white racial identity caucusing are we have inclusive work groups for early learning and implementation planning. We also have some around work around the language access planning as you just mentioned the color Brave space, you'll see that throughout here and then but ultimately we've had a high level of participation between our change team and I'll deal staff that were super excited about Okay. So one thing but we also want to talk about is the anti-racist Continuum. I don't know if you remember this time last year. We introduced this document just want to briefly talk about what is it? And why do we use it? And where does the o-ring kit self who stole the tool that was developed by CrossRoads Ministry and it's just one way that an organization can measure its anti-racism efforts. We began using this was first created it about once per year of an informal way for us to take the temperature on our department a house staffer feeling about the recent social justice efforts. So on the next slide will look at where we find ourselves so you can see a couple years of data there. I think that we've been using it for a few years the different bubbles are because we begin disaggregating by race in 2018 understanding that people of color and people that identify as white may have different experiences. So we started doing that. We saw a small decrease in 2018, but then we increased again in 2019. So we've kind of been meddling around the three number which is a symbolic change. Compliance organization in the stool is very interesting and thought-provoking conversations around anti-racism efforts. A lot of our staff conversations have been around. How do we how do we go deeper? What do we do from here? Because we've kind of been in this middle middle of the road where the floating in at 3 and we'd like to take the conversation deeper. So that's been something that we've been working with our change payments a van and Michelle remind me with the full. What's the highest number you can get is it? I think it's something like a transformed. Living in a liberated transform Society were racist. An indicator of quality of life for all working towards that aren't we seeing the government organization how he reaches 6, but we don't want that to be the conversation stopper that okay. Well we hit 3.64 done. So we're looking to take it a little bit deeper with those bullet points on that list that we can control. Yeah, we can maybe go to Duane for next steps on that. What's next after Dark Souls 2 staff surveys and we've we've had feet and feedbacks indicated that we deal salvage value diversity inclusion and Equity, but we know that in order to engage in deeper work or to make systemic change, you know, we have to continue this work and improve our processes and practices something that's coming up next hour change team and I were eating will be working together within this year to create one of the Collaboratively create water bills and priorities which is improving or should I say workplace culture? We're going to be collaboratively developing our multi-year plan to support staff like professional development and Improvement of workplace culture thumb throughout the year. And as we mentioned earlier, we know we know that including the color Brave space just gives us an opportunity to die deep. So that's what's next was coming up album after the ark color Brave spaces. What kind of other policies or practices have you supported or Advanced either? Either because you thought of it or because it came from your staff that sort of advances this priority around workplace culture. So or what we got to the workplace culture. So we met at came up with three priorities that we're going to focus on as a department for the year and the third priority we decide it was workplace culture. So that's why we want to work with the ETA to help you come up and figure out what it is. We want to focus on I'm so we'll be having more of that coming up soon. But what we've been doing on previously or something that was recommended by the staff is started off as just a me to bring donuts into the staff. So now what we do is all we have doughnuts and Dwayne that we need to come together Foster a break bread professionally and also engage and get discussions about you know, spending time about what a team or myself and to learn about what's happening throughout the department. And everyone else to go with us, that's something that we've implemented that the staff has recommended and then something else that will actually be taking place tomorrow what we doing. I'm just trying to take off the top of my head when we have dealed day in the park tomorrow. So there's some team-building for a whole staff. We implemented this last year was our first year Bill day in the park and it was it was recommended from our social committee. I still kind of get-together talk about, you know some priorities but also at the end of the day do some team-building work around the step with the staff. So that's something we'll be doing tomorrow. Take it off. If you think there's a lot more deal is one of the Department's that has a the numbers aren't in your statistics, but it is an incredibly diverse Department both in gender, but also in race and so I'm so I know and I know that there's there's a significant part of the Department's Workforce on our women in particular and I know I've heard you talk in the past before about the importance of flex time and flexible schedules during the week. And I think that's also a really important component protector fit a lot of the women that work in deal or women of color and I really wanted to just appreciate that practice and the thoughtfulness around making sure that we're taking folks needs into consideration that really goes a long ways towards promoting a positive workplace culture. so Wendy in Consulting women a minority business enterprises on purchasing and Consulting over the past year so you can see on that table there to show the photo of the percentages so far 2018 number for consultant purchasing actually decreased by a little bit but our purchasing went up by a significant amount and our understanding of why the consultant purchasing went down so much was that are Seattle preschool program evaluation contracts are some of our largest contracts and the thought it was a large National Organization. That is not a whim be until it's something that we've been really talking about with our finance team on how we can begin to strategize around increasing I wouldn't be spending and some of that has come out and how are purchasing has really increased. So you see that in those numbers are 25, please. Sure, that's where I was getting. So when I hear something from a department, I usually think for you Contracting with to provide services maybe to the department analysis, excetera in the intense work that you all do in trying to get more people to be child care providers is this including the child care provider population? You know, I do not think this is including the childcare population. This is really for purchasing in our Consulting. I think if we included the childcare population, you'll be will probably see even higher number. The folks that we do our that are funded through the Levee. I think those are categorically different then contractors and consulting firms agreed again, when Contracting in the traditional sense, it would be Direct Services to you all versus the Contracting that we engage with with the STP provider excetera. So her delivery of services that others so this is not so impressive still be looking at just that that particular Consulting number and we've been working with our finance and administration team to really look at how we can increase I wouldn't be spending to the highest possible because we know that us being able to confuse those resources back into the community is really important part of the equity work that we're doing and you know, I sometimes forget that we don't create space in this committee to have those conversations but the information lives in my head and you're always head and we share it with each other at the oversight committee meetings and in that context, and I know that we just finished up our evaluation around the last year of Levi funding under the families and education Levy program, but I Do you think it would be helpful particular round our shared interest around child care providers at child care services? And in that space in general, I do think it would be helpful to perhaps find a time before we go to recess to see if we can get a quick update from the Department on both the specific question asked by a customer Miss Kita around racial and ethnic representation in terms of her childcare Workforce providers that we're Contracting with and I am just rid of a general sense of the State of Affairs in terms of our last year of funding for the levy. Of course. It's the last year of the funding under that Levi. So it doesn't reflect the new programming that we funded through the fat Levy and those that information might not come out until next year around this weekend. At least see what the Without last picture look like under the last year of the former Levi that might help us inform some of our budget conversations and other other priorities as we head into monitoring of the first year of the implementation of the fat lip bass. I think anybody would be a helpful exercise and would welcome that conversation. If if you're agreeable to that counselor mosquito appreciate the request for the information prior to resources. I agree that that would be helpful to see visually for us for the community child care providers exist. I know that many people have a struggle to find childcare and having a general sense of where are contracted providers exist is a much more accurate tool then people going online to Google Maps and trying to plug in information to find where we can access quality Child Care, especially the ones that are accredited by Geographic representation to be great. I'm sure that the department can do that. Nothing happens if you've taken it just sad sitting there is empathy MD waiting for children, Joya sound of child care providers. Florida ceiling Windows waiting for those kiddos very Joyful We can do this all morning. Also just looking at the goals that we had said the last couple years ago for just that at 50% And so we wanted to have goals that were based on actual number is and realistic measures that we thought we could achieve and so we maintained our Consulting go light 50% dimmer going to try and work on increasing but then we increase our purchasing gold to 65% to say let's at least maintain that momentum. So we're kind of trying to do a little bit more of a practical approach charcoals there and then in terms of an action plan around, how do we get there? We're looking at doing a quarterly analysis of our wind be spending. We're also looking through our finance team has been great about identifying vendors who are not registered as Wendy. I'm encouraging them to register as an offering technical assistance, and then also training on wimpy for staff. Next we'll take a quick little dive scuse me into our race and Equity to kids. So the first one is Seattle promise. And so that the what the Seattle promise racing Equity to kiss soda actually consisted of design team members are we have members of the mayor's office CBO Seattle colleges Seattle public schools and the college success foundation and we know that African sodium with s o c r and a design team in all of our folks that were involved in that we wanted to do a more thorough rat with the Seattle promise. So and we are as you know, we do believe in leaving our work with and race and Equity lens. So the threat was going to look at multi-phase is that's going to be taking place this year in 2019 and starts with the sheriff. Just a brief high level of the six phases that we're going to be looking at going to be looking at funding for Phase 1 Phase 2 looking at assembling a rent and planning team that's phase to phase 3 we're going to do some type of rent reflection in face, or we're going to be looking at Community engagement. And then we're going to wrap this up with phases 5 and 6. Is it going to be on dialysis? I did some type of implementation based on the recommendations. Directions to Pelton at work cuz it started already. We're going to be this year. So the next two years left in the term, so before you before but the next rent was the RFI and RFP process and ultimately our goal for this was to understand and just reduced rates for Equity barriers to accessing our funding and deal and so as you'll see these three key recommendations that we have the second recommendation is already complete. So just so you know that this process is actually happening and improvements to the RFP and RFI process as being seen as we are developing and coming up on these RFI and RFP. I'm releases and we have Tissa paid that we're going to continue these conversations with our partners to inform this process. Okay, so when the things that we did want to talk about was just our approach to racial Equity tool kits that we really want them to be more than a checklist. A lot of times. They can be viewed as just a simple checklist. It's something that we go through sort of us an annual process City Department for acid do for per year in December 2018 start fresh the next year. So we're really trying to look at really okay knowledge in the realities of Reason social justice work and trying to be a bit more flexible with ourselves giving ourselves room to do the red set. We feel need to happen as the emergent issues come up. So what about things that we did that have I think started to initiate that what we're calling Rhett level thinking is that we did a department-wide right to it raining. So we actually had staff from es Ser come to our department and do group training with us specifically around that the one thing that was really great about that is that it really inspired some staff to leave their own red efforts and take deeper training on it. That was something really exciting after. Those trainings I had at least four different ask him up and say I'm really interested in leading a red. What can I do people that had an engagement at work before and we're looking at I have ways that I can look at my work from a racial Equity analysis. That was really exciting. One of the things that we also did with that we Revisited are at that. We didn't 2017 on hiring practices. So we went to want to make sure that when we do a read it doesn't just become a set it and forget it. We did it and no good for us. We really want to make sure that we Implement those practices. So we've been working with the changed him in the executive team to actually implement the recommendations that came out of our hiring event. I'm working with our work managers and just making sure that we can actually start to implement those so that's been pretty exciting work and then even working beyond our own City Department of sample of collaboration, is that are birth to three staff supported a King County racial Equity toolkit, but that's another example of how you know, we don't really do the work just within our own spaces, but that we really Rely on Partnerships in collaboration. Look at next slide for 2019 and Beyond. So we did something a little bit different rather than saying we're going to do the four rats in one calendar year. We wrote these five rats into the Fab Levi implementation plan to say that these were five rights. We knew had to happen. So you can see these are some pretty big areas that are pretty critical to our community. We want to make sure that we took the time to do them, right so they're not started on the calendar year. They were dodging they may take one to three years to complete a meeting for the start date of face in a little bit. So that was kind of after working with Ser to come up with that plan and we left ourselves room to add new rats as emergent issues come up or a staff are looking at their work and say this really needs to be analyzed deeper so that someone I think one of the things that is commendable for DL is it you all really are interested in terms of the work that you do and there's enough flexibility built into this programming though. They'll allow sir Fosters that additional creativity and allows us to Course, correct when we need to and and also need to continue to do more of the cool stuff that is emerging or promising practice. So really appreciate the thoughtfulness around instead of creating a checklist of we're going to do these four in one year really sort of taking too much more phased approach and a more realistic approach to the fact that I'm doing institutional racism certainly takes more than a year calendar year. So I guess I think about the use of the racial Equity toolkit. I know that you use it internally to evaluate your current practices and how your staff aligned with priorities and the vision and mission of the department. I also understand that you use it for analyzing the services that you provide or that the contractors are required to provide to our community. One of the things I would love to hear more about is how you use the racial equity. Get to analyze proposals that come to you. So let's say city council for example send to Department request to you to open up a childcare facility on site. How does the analysis of a request is coming to you get analyzed so that potentially and gets priority if it scores high on meeting racial Equity goals. Is that something that we currently do either from external Partners asking something of the department or when the city provides funding for certain programs so that it can be expedited or initiated without delay. It's not that would be a really excellent way to use the tool kit so that we can prioritize and put to the front of the line issues that have been on the back burner and shelved for various reasons in the past. And with the use of the Tollgate could be potentially Advanced. Is that a way in which you Zarate now, so that's a great recommendation. We do not currently operate that way, but but that isn't Recommendation we can take it back and look to see just if how do we embed that in our decision-making processes for request that come in? Thank you for that. I would say that on the future are a tease for 2018-2021. Several of those were generated by the city council, but turn out to be subject to which I appreciate so I think and I think it's it's I don't think it was intentional a Torres sort of systemic as you is your question poses, but I do so I do think there's an opportunity to think a little bit more intentionally bad to do that. This kind of came about organically as we works for the policy issues and begin to identify some potential for unintended consequences as a result of otherwise outstanding programs and so in closing, we really just wanted to thank all of our staff members of our change team members are former change team members deal staff who are a committed to advancing on racial Equity. I'm going to think O C R & R R S Local city Department change team for this work on the support that they've been doing with dill. I want to really want to thank the community members activist and organizers was really built this foundation for this work continuing to leave his work. But but you know specifically special thanks to like Michelle and going back to the deal staff at really lead this work day in and day out that make the great recommendations that I get to actually come up here and talk about a lot of these great things that I happened in most of them come from our staff work and better than the work day today and it's really just this really appreciative to have such outstanding folks around the table committed to Seattle and committed to our kids and I'm seeing Equity involved in in in in in M braided through everything that we do. So thank you Michelle and all your colleagues, but I'm sure you have something else you would like to say to. Are the things that when we looking at engaging in anti-racism work, we're asked to be very vulnerable broth to challenge long-held institutional Norms. Sometimes we are asked to expose ourselves to neutral without realizing that that's happening. And so I think really understanding that nobody does this work alone. It's a really fast network of support both inside the city and outside the city that support it and we're just really grateful for everyone that participates a lot. And as you all know this this work is very very hard and it could be mentally taxing. So again thanks to everyone that's sticking through this process and those cuz you know that at times you know, it is it is it is really mentally draining some time. So like the city of Seattle that is really committed to to undoing institutional racism and racism has really profound. It can be very heavy and I think that there are so many public servants here at the city who are really fundamentally dedicated to to that goal in that mission around RS j. I m really appreciate deals ongoing efforts and intentionality in that space to help us serve our community and a much more. Just way really really important work and I can't think of a more important space to do that work than an education. We know that education is not mean I don't even like saying it's a crazy level Plainfield. It doesn't is it actually you know, sort of undos in tips the balance towards equity for many people in our community who have been intentionally systemically since the beginning of the development of the education system in America left out. And and so it's it's it's more than just equalizing it is it is putting us on a better check to read to break the cycle of poverty and to fulfill our full potential and in society. So really want appreciate all the work that you all are doing everyday in the early learning and education space. So super important. I'm a huge believer in you all and a big champion of this issue as you know, and it will continue to be in a lion supporter of the work that you all are doing and think How much for your ongoing partnership on all areas of work but in particular in the space, so thank you so much for a gender items, so there is no further business before the committee. So we are adjourned. Thank you.", "end_time": 3491.8}]}