{"format": "raw", "annotations": [], "confidence": 0.9467122256755829, "data": [{"start_time": 0, "text": "Hi, good afternoon, everybody and welcome to our finance and neighborhoods committee. This is our April 24th. 2019 meeting. Thank you. Cancel, Amber Gonzalez for being here Lena Tebow. Thank you for participating Allison. Thank you very much for getting us organized. Do we have nobody signed up for public comment? Okay. Well today we're going to kick off our committee with two appointments at least kuwahara day and Audrey Hoyt have been selected for nomination to the Pioneer Square preservation board. And then we are going to invite our human human resources department to discuss and possible vote on our first quarter employment ordinance and that's going to be followed with Ben Noble on our City's Capital Improvement projects, and I believe that goes to Q4 from last year and then we will end with a presentation by RF a s department on their 2018 race and social dress. Initiative accomplishments and I want to recognize and say thank you to Calvin goings and his team in advance for that could work. So since we have no public comment and make sure that nobody's come in that wants to speak then let's just move forward with our appointments and Allison will read them in and then I'm going to ask for your introductions. Thank you can do both of them were one appointment number 01307 appointment of the least kuwahara day as a member of the Pioneer Square preservation board for a term to March 1st 2021 item number to appointment number 01308 appointment of Audrey Morton Hoyt as a member of the Pioneer Square preservation board for a term of March 1st 2022. So do you want to start introductions a project architect with environmental Works Community Design Center in Capitol Hill. I am interested in being part of the Pioneer Square board, I originally grew up in Kent Washington. So I have some familiarity with the area of my family is from the Seattle area in general. And so I've always loved Pioneer Square architecture and just the historic character of it. I will come back and have all the reasons in the moment. I know that's good. At least you're ready to go that enthusiasm Audrey Audrey Hoyt as I am a business owner and Pioneer Square. I'm one of the co-owners of the pioneer Collective. We are a local co-working meeting and event space in Pioneer Square and we've been open about just almost four years on the corner of 1st and King and I appreciate getting to be here and look forward to telling you why I'm excited about the possibility of the preservation board. Excellent. Thank you from the coordinator for the Pioneer Square preservation board in the department of neighborhoods and Gina. Thank you for being here and I just want to say thank you for All the help that you have given my office in the last year in particular around the preservation board and all the things were looking to accomplish if you want to say anything about your candidates. I'm just so pleased to have both of those to present to you today. And I think I'll just let them talk about them at least you are on a roll. So so why don't we start with you to pick up where you were you were leaving off? Like I said, I'm very interested in the Pioneer Square area as an architect. I really admire the historic character of that area and I'm interested in being a part of the board to help preserve that and make sure that that stays for future Generations. I'm can I ask you a question which is we're always trying to reach that balance between preserving the character preserving the building and at the same time moving forward. So we aren't seeing dead buildings and in a particularly on 2nd Avenue, there's some that we have been talking about Recently from the Metropole building down to what we used to be the Nugent building and that some of those faces are operating now. Some of them aren't what is your thinking and approach about encouraging use of like the opportunity Zone funds that might be coming forward and at the same time preserving the character. I'm not move it by the way all the way up if you okay, I'm not quite as familiar with opportunities funds but I'm interested in learning more about them as in terms of weather what striking a balance between preserving and introducing new and exciting things. I think there's definitely room for both and I'm interested to review any of the projects that come forward with that in mind. In terms of buildings that are there now, I think the warehouse are building was a pretty interesting mix of doing both. It fits pretty well within the character but also is new and doing unsustainable strategies. And so I'm interested in looking at that great. We are as well and are constantly doing that in our office. So thank you for your help. I'm Audrey. So tell us more about your vision and why you want to do this with all the things you could do with your time. Yeah, so I'm a Seattle native. I was born and raised with outside of Seattle. And I remember as a child visiting many older neighborhoods in Seattle and how magical and special those distinct areas felt to me. I now realize most of those areas are part of preservation or historic or opportunity Zone. Well, not opportunity Zone, I guess I've what's the third term? I'm looking for landmark districts and have recognized that it really takes two words dedicated to keeping those areas preserved to allow for that character in Rich history to be preserved. I received a Bachelor of Science and economics in college and have always been very fascinated with Urban Design architecture City Planning and policy. So I feel as though I I would like to harness this idea of creating economic. I'm interested in these ways that we can create economic incentives to facilitate positive preservation minded development. I I have two little girls and I think about them enjoying these historic parts of Seattle and how rich and interesting those areas are a Pioneer Square Pike Place Market parts of Capitol Hill Ballard while also recognizing that we are very growing city, and we need to be able to develop and change and create new histories at the same time. So I would say my interest in being on this board is comes from my true dedication to wanting to create a very livable sustainable urban city that has character and a rich architectural history while also is a growing and sustainable City great will thank you for that. I will just put in this last But no. Our goal around Pioneer Square working with a Pioneer Square Alliance in with your preservation board is really to raise some of the buildings that we know are either completely. I'm not just underutilized but like in the case of the Metropole building it is been 10 years now, since it burnt corn Walker building I had an opportunity to walk through it about a month ago a stunningly beautiful building, but it's going to need a lot of loving in a lot of investment same thing with J&M Cafe that there are ways that we can address that so I really am taking my leave from our department of neighborhoods, but we want to move forward with some really great intervention so that we can get more housing and not just low income housing but market-rate an affordable housing mixed in there. So if you can help us do that, it'll be great. Could give me the questions Goodwill then I would like to move the appointments of the lease. And do you need to go by your middle name to car a day or so to move this appointment for a lease? And for the appointment of Audrey Morton Hoyt both as members of the Pioneer Square preservation board and both for a while. You got a one-year term 3 2021 and you got a tattoo you turn to 2022 is that accurate? So she'll be feeling the remaining part of that term and then build Wolfram be eligible for another. Okay. So this looks good. We'll move forward to it the full Council vote next week. Thanks so much and feel free to call us if you got any questions or anything we can do to support you. Thanks a lot. Okay the next item. Do you like to read this in this Lane? I can do this for us item number three Council belawan 19493 and organs relating to City employment commonly referred to as the first quarter 2019 employment or very good. Thank you so much and thank you for coming in down. And with those who are Sarah. Thank you. All of you being here. Do I have to move this amendment first? We just have a correction. All right. So a dancer would you all like to introduce yourselves. Deputy director HR policy and legislation advisor Lisa Gardner ISD HR Compensation Program manager. Thank you very much. All of you for coming want to kick this off. Sure. I'll be happy to I'm going to turn it over to SD HR to walk you through the details, but at a high clip, this bill is has two parts. The first part is the designation of three positions to a civil service exam status on the second action that's included here is authorization to use 2019 Appropriations that were anticipated in the adopted budget. The Seattle Municipal Code. So for the designation of civil service exam positions the municipal code and the Personnel rules established guidelines for jobs that are covered by an exempt from Civil Service Protections in order for a position to be reclassified or change to be designated from Civil Service covered to civil service exam. Prior approval must be provided by Ordnance and this bill would accomplish that goal as you noted it at the front end. There is a technical amendment that makes some housekeeping changes to True up the intent of the bill with the positions that would be affected the second bit of the bill would I specifically authorized executive to use funds that were already appropriated in the adopted budget that would allow the executive to pay the employees share of the 2019 premiums for the Washington? Paid Family Medical Leave benefits that will begin in 2020. 2019 budget included approximately 5 million dollars for this purpose of this bill is what I would describe as a belt-and-suspenders explicit authorization to use the existing funds for the originally intended purpose enough. We have enough budgeted money to cover so sure I'm going to turn to you if you would like to describe these exempt positions why they were exempt and what your recommendation is and then we'll deal with the correction. As including amendment when you request to approve the 2019 first quarter employment ordinance submitted as is or with possible amendments of the difference between the original submission of the amendment bring this closer to you with so hard. The difference between the two is that after submittal upon review we learned that item a on the original submittal had in fact already been legislated and adopted as part of the 2019 budget ordinance. So it's it was not necessary for it to be included in this in this ordinance. Thank you. So do you want to talk a little bit about these three exempt positions two of the positions are in Information Technology as Information Technology professionals 8th and Pearl. city of Peru municipal code and per the it IT professional pay program are those are Exempted automatically by classification. The third position is in sdhr as a personal analyst moving to strategic advisor one exempt and meets the criteria for exemption request position requiring a particularly High degree of professional responsibilities and individual accountability at work position requiring confidential or fiduciary relationship with the appointing authority or judicial positions requiring insulation as a third branch of government upon internal review and Analysis. This position did meet the criteria of a position requiring a particularly High degree of special responsible responsiveness and individual accountability Very good. Did you want to add anything? Sturridge when I listen to that thank you for being here. Either of you have any questions about this? Yes, so let's see in the bill. I guess it's Section 1 C no suction to really into the authorization of additional payment for the employees Prima sharer into the state Paid Family Medical Leave insurance program. Can you just talk a little bit more about what the fiscal note is on that? I don't see any I don't actually see my station noted in the fiscal notes. It was included in the 2019 budget, but the total that I have is 4.8 million for 2019. And again, this is just for 2019 premiums 2.2 million of the cost or general fund and the rest is not general fund. Answer how much is for the general fund 2.2 million? And the remainder comes from where non General funds everything else. I don't have it broken out. So maybe Dan you can address that if 2.2 is coming from general fund? This is for paid sick leave premiums worse the remainder coming from different than hard me. It's the Paid Family and Medical Leave insurance program. And so I just want to make sure that is and I think the three of us serve them that they were relations policy committee. I just want to make sure that this is still in compliance and Conformity with everything that we're doing the Labor Relations policy committee area, which we can't necessarily talk about but I just want to make sure that we're not stepping on our own tools or the toes of the bargaining team. There doesn't know Danny physical impacts of this bill. I think what well, I could have mentioned what the dollar amounts are, but I think the reason why doesn't address the dollar message because this bill doesn't appropriate any new funds it merely provides explicit authorization to use the appropriate funds in a way. Is consistent with the expectation in the budget that budget didn't spell out that these funds would be used to pay for the employees share of the paid medical family medical leave and you don't necessarily have to walk me through the details of the formula. But but we came up with this number of 4.8 million dollars presumably using some form of formula in order to determine what that amount was. That's right. Okay, and we have a level of confidence in the formula that leads us to believe that this is an accurate forecasting an estimate of the appropriation needed to cover the benefits through the end of 2019 unions and there was a salary increase for this year. We may need to Return for further but Appropriations. So we're going to be paying 0.4% of the city's total payroll and a portion of that is the employer's responsibility and a portion of that can be pushed from the employer to the employee, but for 2019 is going to be entirely paid for by the city. I'm I will add that is up to the for each employee up to the Social Security maximum this year of 1/3 130 to $900,900. I miss almost everything you said if you'll is there a full the microphone closer? A maximum per employee up to the wages the Social Security wages of $132,900. As opposed to the Complete Payroll for the year the amendment to this bill look for Second Amendment say I so then we will go on to the amended bill on this is for when it's 1 19493. So I will move this as amended. Nope. I no further discussion or comments. This will go forward to the full Council on Monday. Thank you very much for the good briefing earlier this week. So we'll go on to the quarterly report. Do we have anything we want to read in or invite Ben Noble? Just on the record item number for the 2018 Q4 CIP monitoring report summary and highlights and Caleb. Thanks for being here. Dan are you going to get this one off as well? If you're happy to do that, as you know, the executive and city council have been engaging in the collaborative effort to up the game providing counsel and the public with forward-looking information about the city's capital projects and their ongoing progress have appreciated the cooperation and. First executive staff have brought to the table and I want to publicly thank CBO and the departmental staff who have been contributing as well and in particular Ben and Caleb Wagner today, Ben and Caleb were here from CBO to present the quarterly report for the end of 2018. I think you are well aware that the city has recently updated its Financial systems and this led to an unusual delay in closing out the 2018 books as a result the fourth quarter. Project reports were submitted somewhat later than what we expect will become the norm in a future silver in 2018 by way of background to these reports the council adopted resolution 31853 memorializing expectations for enhanced quarterly reports for high-risk high-profile or particularly complex capital projects that resolution established reporting formats and timing and recognizing that big and complex project space schedule budget and scope risks. The council's goal was to engage in a discussion about strategies to mitigate these risks before they happen rather than after the fact consistent with resolution 31853 the council followed up early this year with resolution 31866. Identifying a suite of projects that will get enhance reporting sometimes referred to as the 2019 watchlist executive staff will begin reporting on the 2019 watchlist projects when they provide the capital projects reports for the first quarter of 2019. This list is very similar to but not quite the same as the list of projects per year in 2018. For instance the City Centre Street Car connector project and some other projects were included on the 2019 watch list, but are not reported on here with that background all turned over to CVS Taft knowledge that this is something that council member herbold has been encouraging us to do is look at specific c i p projects rather than just the blanket budget control level that we've seen before. So thanks for being here then and Caleb welcome. Turn over Caleb wanted to Echo looking for being returned a reporting for ourselves. If you will of the council as well, as our goal is to get this right in to be open to to adaptation as we go today. I think things one is to introduce you to the structure of the work essential staff. And then also to talk about some of the specific sitter there. I will add but you will have questions about some of them and I also expect it won't be able to answer them all so I'm going to I'm going to cover myself right now about that, but we will I will try. But the stuff we can't answer here. We'll we'll certainly get back to you in the in the goal here is to see you have every reason to be holding you accountable. I think the frame we were hoping for is not one about gotcha if you will but really loud these are issues and projects that we all care about it. So, it's our problems. We all need to know about them and to think about what Solutions might be an Ideal Lease or as early as possible. So your flavor for how we how we approached it. So with that give love a chance to watch the keys and Caleb it in some sense around their structure of this and they're really hard work to make it happen. So far the structure and how we got there. X-Men yeah, so I was going to give a quick background. I'm kind of the report how we laid it out and the end why we laid it out like this. It's it's three pieces. We have a discrete projects report. We have an ongoing program support in the way of the watch list, which is the the enhanced report. The reason we did it like this is because the discrete projects are actual discrete bodies work with start and end dates ongoing programs are kind of ongoing bodies of work and we want to focus on different measures for those and then the watchlist projects are large projects that have a lot of complexity and different risk. So we're going to go to those in three different pieces have now the focus of our reports now or more forward-looking what's coming down on the horizon rather than what happened in the past. It's looking at total project cost for projects rather than one year looks at what just happened just this. It could have affected the project in the out years. So that's kind of what our focus is here. So the first section is the discrete project report and we worked with Dan Central staff and the Department's to find some of these elements the first that the three things that we are asking for from the Department's now or or an update for the project stage where to find those project stages last year in the budget. There's I think there's five of them or six of them and it goes from planning initiation to design construction procurement and then close out. So if your project has moved into different stage we ask to update that so that we know that it's moving forward we ask for an update to the end date of the project your projected end date if it has changed again this the information in here the total project cost for the discrete report come from the 19 to 24 budget because it was more current so we wanted to give the most current information. And then we ask for for update to the total project cost of projection. This is Becca. One of the things that just recorded is Kevin's Crab happened last year. We need to move the Department's all to some degree definitions on the stages of of construction projects in the end. I wasn't they weren't that far off involved in projects in Singapore. This is what you guys do what you guys do it for for both the council and executive on the reporting side may be leaping ahead just a couple of pages but on some of these projects the big ones that you've identified on the watch list. Are we going to have a dashboard like we did with the Waterfront project? I thought that was so incredibly helpful so that we could see the green yellow red green. Those things were on schedule. They were within the scope yellow was like hey, this is what we're paying attention to and red was either there was a delay Are an increase or a contractor's change order you will we have an element that supports those are also standards. So there's a format about each of those and you'll see a discrete v e 286th Street projects. What's the criteria to be a discrete project again? So you do some like the CIP that is one page per project. These are there projects that are the Departments are managing a very specifically to a very to a specific budget of that are going to know so Lake City community community center improvements to programmatic CIP friends since the parks department has was in a CIP something called Trail improvements. I think that's the official title and that is and I don't know the budget of that one of the top my head would say $700,000 a year that we tried everything along the question of the 286 discrete projects. How many are not discreet projects that are lost in the shuffle are like trailer proven to the is there another hundred or it's actually a different category that is called a programmatic projects. That is a separate so they're not included at all. Is as a start and end date and when it's complete, it drops out of the CIP. So my concern is a watch list. If you will that it was larger projects where we're looking and cost overruns in weather affect our bonding or general sub bun or utility funds weather week. We didn't want to find out too late or branch of our branch of government didn't want to find out too late and my concern or licking now 286 projects is that the big ones that are flat and I know we have the watch list, but that's fairly large to that some of the smaller discrete project and I'll speak just for myself. I wasn't too concerned about it was a much larger project. So I think that by doing that you're taking the watchlist enhance projects from the discrete projects ice assuming those are the ones were going to Arkansas on the program guide program projects that have a million dollars to spend on trail improvements that is never spend more than that considered it. Is that 14th project that's not on a watch list, but in deed is as discreet project, I thought maybe you're going to Dubai dollar threshold like any projects over 5 million not say or something. I enjoy it. What I'm hearing is it's not a monetary Criterion. It's a whether there's a beginning begin date and end date sorted for the watch list. We've actually we used some of the projects it it's it's more about how they are managed. Plus the street project. What's the meaning for new Subway to report on the ones of those that are better of most interest and that's how we came up to watch list idea and in particular thought about different criteria and one of them is financial threshold. So we so we look hard at projects. And then what we did is we took the ages we found everything over 60 million, we found that group of projects and then we found out a bunch that are closing out until we took those off the list because they're essentially done just some Financial closeout items and that's how we came up with the initial watch live in the second watch list, which you guys just adopted by the resolution is what we did is roughly the same thing and we and we added some Through just expressions and then send it to you guys. And then you had opportunity to hold it doesn't if you will we also said but let's look below 60 if there's stuff there that that is really complicated or if interest for you. We have that for the dialogue. We had that are below 60 in obese on the bus 62 aren't there but it did provide you don't we look at a different cut-offs seem to be a useful projects are absolutely Please continue. So that was that's kind of what the discrete projects report the all of the non watchlist projects contained some highlights on the discrete project report. There was 286 projects in 2018 31 work completed or closed that that kind of is defined a little bit differently across departments. A lot of these have long closure. Closed to Department. Sometimes is considered substantially complete. There's physically complete and then there's Financial close out. These are all projects that weren't in the CIP in the 19224 CIP. So they're closed out. It was some fire station projects large IT projects one or two utility projects and some parks little or Parks projects and then of the 232 that you said the subset of the watch list and then they're simple Masters almost Turn on the watch list and Reporting here 93% of them are projected to stay on budget AR-15 that are not at the moment projected to come under so we're going to meet a reporting everything above an envelope are not significant risks in the ones that remain but just as an example. There's some there's a little bit. We will seek an increase in the budget. It's all right for the for the part of Brooklyn project gets underway. It's related to some reimbursable work from the utility. So I don't have details but I think they've encountered some utilities at work is part of that project and they'll have to be accepting some money from the city like SVU and then also from King County to work on that. Thank you. I'm of the projects that are the seven percent of projects that are not on budget that are over do they happened to be ones that we've selected for the watchlist. I'm just trying to figure out what I think in system is that they're not very far over. These are small amounts in $100,000 on it. That's a lot of money but in the context of a multimillion-dollar project, so I think the combination i t and some physical project is over. Is that a all of the 232 discrete projects or is it just of the non watch this project is the normal before we leap off the discrete project report page which page 1 2 3 I noticed here. We have the aquarium expansion. I know that this has been something on our list for many many years and we've got a 34 million-dollar adopted CIP budget for that. We know that that's a public-private partnership that that's that's the ceiling on what the city's going to put in and then after that if it goes over there going they the aquarium or going to have to raise more fun to deal with that. Can you talk to us about where word that project is due process? Now with the aquarium actually in our intent is to bring you an agreement between us and them that sets out the payment schedule if you will for that $34 commitment from the city and the timeline that works for both of us fundraising schedule and then I'll come by there construction schedule and then also from us, I'm at the principal Source we plan to use to support that is as real estate excise taxes apply to be a city-owned facility although operated Pisces. So I think the next few months you will have an opportunity. I delete to approve an agreement that sets out a payment schedule for that. And as you describe it that will be the daddy is about to be the city's commitment. I would really request if we can to see that before September. Is this is just six projects of? 232 project it's more. If you're not drawing our attention to these particular project. We were just going to show you the antipodean whatever. This is 6 pages on my bifocals, but you can but also for this life that I think you were looking at council member herbold. I want to draw your attention to the fact that this is we're looking at actual cost as of the end of 2018 and projections that are more recent than the March timeframe the comparisons against the budget is to the 2019 and 2024 adopted CIP. That's that's the most recently adopted a budget and CIP and it's a little bit of a funny Nixon. Because it's 2018 actuals vs. 2019 and Beyond CIP, but when when they when Caleb was saying that approximately 93% of the projects are on budget comparison is to changes which may have happened in the CIP for the original projected cost. If work if we're comparing whether or not we're to budget just to the best most recent update are we not being as transparent as we should be as as it relates to the original projected cost of those projects. I think it's a valid point. It will only come up in the fourth quarter of each year the first second and third quarters of 2019 will be compared to the same 2019 to 2024 adopted CIP. So we won't have a mix and match of information for three out of the four years in the fourth quarter of 2019 good food for thought. Maybe we can think about giving you both data points and you can compare against And I think you're what you're identifying and isolating is out is a problem within a year. I think it is replicated year after year after year for not keeping in a column that identifies with the original projected project cost was going to be we do certainly for the enhanced reporting for the watch list project. We have a baseline against which we always compare that doesn't get updated long-standing conundrum work on reporting that you when I was with counsel as well. But the documents update LG is not satisfying but I think you've raised a good point and we will think of some butt is bigger projects. Even talked about this will bring you plan to bring an example of a percent of budget in the fall for some of these larger projects kinds of things that would be on the watch list or anticipate. We first introduced a project into the CIP is not to give you a false sense of what the final budget would because we know it's 0% design that we have no likely don't have a good idea. So what we're likely to do when I'm hoping your bill to Duke's I think it's better for everybody and more transparent is to say I'm you know, this is a business case if you will for the project and we are asking for 5 year approval for $5000000 to do the design work to get us to a more precise and it will only be a more precise and we will ideally beginning the number to using my example was with 75% confidence. We can tell you this project will complete at a hundred million dollars and we are now asking you for in my example potentially 90s. Live right and then we will keep people keep updating that as we go. Teddy me confidence The Ship Canal project is for that to transparency the 10 signals in the uncertainty. That is that is that is facing all us all. So we can move on to the ongoing program report on this one's a little bit different cuz the focus is slightly different. What we're trying to do. Our initial intent was to focus on the discrete projects and we were going to do ongoing programs a little bit later, but we would kind of combined this into one effort last year. And so will this this one is a work-in-progress what we wanted to get at more more. So on. This one was your accomplishment rate rather than just your spending rate because having spent 100% of your budget doesn't really tell us if you've accomplished all of the things you intended to accomplish so defining accomplishment rate. Is it work in progress? Some departments have more quantitative measures for that ass. Does a good job defining what that is. Some of the other departments are working on it. They're all there's also a lot of ongoing programs that are customer-driven these come, you know, just the utilities have a lot of those that are requests from customers and you can't really tell how much you're going to spend or it doesn't really give Performance metric to tell you how much you spent it of your previous budget. So we're still working on that one. What we showed this in this particular report was their final revised budget and the actual spending and how much was spent for the first quarter next year. We will show the spent through first quarter. And then what they what their accomplishment rate is defined as and what they expect is bent their projection. So I just wanted on this ongoing program report page. I noticed two things coming out of s. That are major interest to a lot of people on The Pedestrian master plan new sidewalks is an example where they've got percentage spent was 74% roughly three-quarters, but 54 blocks were planned and only 34 were completed. So, you know what this your quick percentage amount or less than 12666 construction project in and out the more snow that we had this year but it says do the contractor and crew delays several of the project scheduled for 2018 delivery are expected to reach completion in q1 Q2 2019. So were they able to make up that remaining 35% by that's the nature of this reporting being on going. Which puts you highlighted and I'm going to make the point is that these programs subsidies are but it's a specific project. We're working on the best way to provide that information. So we will get back to you on the specifics of where weather goes as we move into the q1 and Q2 reports about how much of that work is actually getting completed in the way that they had projected. If you look at the next line to been at this is with the protected bike lanes and of course all of you know, and as. Nose from me personally that connecting the downtown network is really critical if we're trying to get more people like me age-friendly to ride your bikes we've got to do this but that number to me is scary. It's like Owls were planned and only you know, 20% of those were completed yet. We have spent a hundred and 1% of the plan 2 on the original Focus to some specific set of projects that were more expensive, but I don't actually know that so let's project. So I think we can will need to follow up on this is a good example of the ground so and again at this concern for us as well. So let's dig in and get back to you and spend some time with Central staff identifying whether the other other these types of programs that need more need more detail if you will learn more information. Reporting for program CIP program elements as well. And so rather than you know, just having a line on a spreadsheet. I think we should talk about criteria for some of these programmatic plans and budgets and figure out a way to look at some enhance reporting around some of them as well as counselors chair back shot said, I have a hard time Dexter posing the hundred and 1% spent with you know about a fifth of the Les Miles completed for the bike plan and then simile for asphalt 98% spent but it looks like we're done and on that one. It's not clear to me. It says 32 Lane miles planned 9.45 completed Anaconda to come and say that the projects. We're started in 2018, but construction schedules were too optimistic and they won't finish until 2019. How are you going to tell that story in the in the first quarter report or do you just start all over again? Or is it still against this Baseline point is well taken about how we're going to What you're getting a couple of instances you're a star was over optimistic about what they could get done for weather and whether they are able to adjust to give us all more realistic projections about what's what's likely to happen would also be just for the sake of downside to I happen to notice and we only put these up his example Philly with the format, but I will note it on The Pedestrian master plan school safety. The last project was listed there that you didn't plan. I appreciate that. I was going to bring up that I was just waiting for my entry point is that I think that this oversight components in a coordinated effort is important because of course, we're not getting it right or when we might be underperforming. Are we actually over delivered on particular projects and you gave us one example here with a master plan around the school safety issues. I think you know during last year's budget process. We heard a lot of concerns from pedestrian Advocates particularly in this school safety zones about our decision around taking some money out of that particular bucket of dollars in order to fund other Council priorities and not be a compromise to the minimal promises made in terms of product delivery school zones that promote safety and I think that this is showing us that we were correct in our policy choice and in our decision to reprioritize some of those funds so that in this instance 108% of the funds are spent 20 projects and 41 projects were actually completed. And the comments here provide that that they had more funding this year than anticipated which allowed them to deliver a flashing beacons walkway improvements curb ramps crosswalk vegans and speed speed humps. I think that's I just wanted to lift that up as a as an example of something positive that were learning through this reporting. I really appreciate that you decided that we don't have that Caleb is this is not a one-man shop on this front, but I appreciate the department of lots of folks working on these sorts of projects accountability, but there is also opportunity for explanation and understanding is just helpful to the beginning of this why I said it should be held accountable. Black story about both under and over it and just want a chance to explain what's going on. So we will dig back in here and figure out what's going on. And if it's if it's bad stories and you know better than us and we'll try to tell you what we're going to do to remediate and if it's there's some of the Nuance there will have shared it transparency about where we are and telling the public what's going on and why the end of the day we're all human and we respond to positive reinforcement actions about last one and one would like to have that reaction more often. It's the watch this project receive the enhanced reports. And when I was going to do a quick run quickly run through the enhanced report just to describe how we lay this out. This was obviously a collaborative effort with Central staff with the Department's just to get the information. We need a lot of its it boils down to scope schedule budget type information. The first page is the project overview just a description of the work accomplished and identification of some risks that they're seen on the horizon. That's what we included. The indicator light the risks here, are there self-reported and by Nature there a little bit of qualitative because they are what they feel the risk should be so we would try to get more complicated with this but then it it didn't produce the results. We wanted to be boiled it down to two high medium and low and just took the average starting her up Caleb. Are you walking through the reader's guide or you walking through one particular report? I'm going to go through the layout of the parts of the reader's guide Ascension I do have a question about that. It's really helpful to to have a readers guide again. The vibration of this effort is a lot of it's about making sure they were all using the same language to describe some more things across departments the risk factors that we are raiding our cost estimates risk profile Union Council interest and the reader's guide said that risk factors are rated by departments as 1 2 or 3 green meeting all elements are rated 1/2 a yellow meaning two or more elements related to and red means any risk element is rated 3 or all are ranked to is that that's the standard that were used to destroy me to Moffitt. The five elements are scope schedule budget coordination and Community impact. The resolution and that it was just general criteria not interpreted version. And then as it relates to what's in the report itself for each report, you identify yellow green and red, but I am looking for some inconsistency between different reports of whether or not they identify the risk element particularly for for the yellow and the red like what so what which of the risk elements are have been flagged. I think there's some some some of the individual reports to that them don't ya and working with the Department's to better to to get the the information we need from them. This is relatively new. It's only the second time. We've actually done this report so that they are kind of getting a sense of what what the council is looking for as well. So we're working with them to Define them. Play single dashboard color and a little more information about which of the five triggered us into the one call or the other. We could in future reports move from this Earth composite summary and red yellow green, but only one of those two count for to account for five different risk factors. We could provide the tale behind it and just say if you know the the whatever the options that schedule is a is a red and everything else has a green and and give you that detail that I believe the the the Departments are reporting on that good and I'm open to doing it because it's this is self-reported and it is qualitative, but we have the information so that's why would you do that? Which what is your visual? On it with you added to your spreadsheet there or we that is we could have that summary and then underneath it or love it. I supposed to have the the individual elements and then if you will let the color of each of those and then I'm going to be obvious Ave summed up or not. Everything's all turkey button. Open Flag by staff for me that the Ship Canal water quality project is a good example of providing the more granular detail about the type of risk factor. So maybe just take a look at that one. Okay, then the second the second page in this kind of gets it to the explanation of some of those risks as we have the the budget summary is the second page that describes kind of what they're projecting for the project in the current quarter. So what we're showing right now is we have a 30% Baseline total project cost. That's the industry standard for when you establish your Baseline for your project, but that's 30% design and this can speak to the original budget and comparing to wait for these pretty larger projects. Annoying who did the 19224 David C A P total project cost the actual spending through 2018 in the projection. The variance on this page is the difference between the projection and the previously adopted budget. So it'll it'll show that that's the variance we didn't show the variance to the 30% design. Maybe just getting a little bit cumbersome to show all that and then we have provide the narrative section for them to explain what's going on there. The chart itself is cumulative to show the spending over the years. And then the third page is the schedule showing the schedule risk, what is projected for the schedule? This gets a little bit tricky because some of these projects the bigger project have multiple types of project within them example as the Ship Canal water quality project. So it's a little bit tricky to show exactly what thus the schedule is it for all of those elements. Are you working with the Department's to do that? The final point out that there is similarly to the budget slide. There is a baseline project schedule which remains constant even as the project schedule updates and a note on that as we are starting in the middle of some of these projects. So we just didn't include that because it's probably not that informative right now. So as we move forward as projects hit that Milestone will include those And then the last page is for is to show the Project funding by the funding source, and just to show what the strategy is. If there is a funding Gap we didn't include this for the utility project because they're primarily rate funded and so it wouldn't it was just one pie was a very helpful. So that's the that's the basic layout of the report and kind of the intent now we will go through wash this project risk factor not I can see a couple of things about these projects. But again on I'm honestly not the expert. So the bigger issue is a budget risk our funding risk, and that's it. We're waiting on a Federal grant so that it's a higher risk project. We have not secure the funding but again that that's not that's not a good thing or bad thing. Well laid right for a couple years now. I thought we were planning to move forward this year and it and then it was we had to take a step back. Again, I don't have all the details. I guess that's that's I would call the same talking from his debts. Subset that I was so that's in terms of ordering things there multiple projects in the in the viaduct space. If you will this one that we're talking like it was a habitat Beach and it's looking good and it's going to start to be completed this year 23rd Avenue Corridor and I was dating project in some ways is was one of motivation for this enhanced reporting work. It did not go as well as I had hoped so we are finishing Phase 2 there and then beginning design on face 3, so I generally looks looks okay. I have to look back and see what the the risk factors were. Yeah. I think I think anything is a simple only design on face 3 there's there's still some uncertainty there the delay in the viaduct demolition habitat Beach. I'm expecting to get reports from the office of the Waterfront tomorrow at 3 questions. So the real-time question in this is backward. Look at all the reports that we are finding out. What does impact might be personal I have never ridden my bike on the waterfront last evening and I hadn't been down since it's it's amazing experience a week ago, but we saw in the paper just this week that that the contractor is saying they're only 2 weeks behind but we heard from some of the water from Business Leaders that they were concerned that it was way more impactful than just two weeks. So thank you for let us know what you're getting ready moving closer towards construction. So risks are we still need to nail down some of the permitting work? I think the biggest thing is the project is not read not received for the project got to bed yet. Do not receive its back. So you actually have a bid on a project. You don't really know whether your budgets can going to work or not. So again transparency by where we are on that. The request for proposals are our bids went out about six months ago. So I'm just behind on this venue you're covering these at the right level. I just want to point out to folks that for each of these projects. There is a four-page has a lot more to tail. So what we're just getting enough, you know that the kind of top-level summary and we can talk more to do this on a regular basis. How do you want us to come and presented? What time do Delvin to the report prior to this meeting so that in a week and asked you very specific questions that and we can point to the information has been provided. Cuz obviously we all are very interested in many many of these projects. So we also don't want to put you on the spot pen to ask you for that because you know, we got we got the materials a week ago and I think it would be a little bit helpful to have a little bit more space between the receipt of the report and the scheduling of the committee presentation. I also would really like the opportunity and we can't do this in a week's time the opportunity to invite the chairs of the committee with oversight of these departments we've discussed before so in that time to opportunity if you got questions, we have an opportunity to process them. Be more productive review panel types of oversights. Wonder if there's a way we can get a message to those panels that maybe one of those members go to take ownership of being the liaison on that on this work their purpose. Of course is sure to be the watch dogs as well on on on when chiropractors Ojai. So maybe one of them to take only have to reach out Utilities in your Guitar Center. I'm done at some of the Continuum sounds like this is so productive Lander. It is inherently risky project because we are building over train tracks in the coordination are is tricky but gentle reminder science project is moving forward. Well Delridge had been my understanding is that original design and estimates were much higher than the 125 125 million and we are spending production is 102 million a good story and it's actively under construction and we could still want to do something Delridge medium. It was actually high or towards the end of last year because what's happened here as we discovered there was a significant drainage issue that needs to be addressed in order to do the paving work at it always been playing so working out with SVU episode of overall project cost you is going to increase because of scope is increased because there isn't this drainage element that that needs to be addressed as well given the given the scale of the of the repaving element. So not shifting to the Waterfront projects the main Corridor again. We just you just transfer back to ask me about that and I think medium risk year and we're going to find out some more about where they are on terms of potential delay. Overlook walk will be a complicated project a little bit more a little uncertain that uncertainty has been resolved in the in the months since as well if your projects are rated medium here Pier 58 is InDesign. These are not unlike the railroad project projects that are being constructed in the water and are inherently risky if you will and complicated. So I think we'll be back to you as more information about these coming months. It's windows and then Leslie utilities ship canal project. We've talked about Denny substation transmission lines. This is a transmission lines that connect to the substation that is going to be a difficult project complex project. We're only now in the design levels, but really underground work environment that in the schedule rescued. It says as the project news for towards completion a significant amount of non-conforming work within the project has been identified during the final accept. That was the Denny substation that you're the last one and some of this is maybe best taken up an executive session. There are some issues with the contractor about the workout has been completed and in questions about who's responsible and who's not and so that's You're in that Final close out stage and still sorting through that again transparent about there being an issue giving its subtleties and complexity not a position to go further. Great is not the kind of project at this stage of this project. There's no policy decisions left there that could mitigate those. I think it's right. I want to acknowledge the work that you're doing an oversized but also what Seattle City Light was doing with the community in a very positive way that they Seattle City Light Representatives meant with John Pearson, Mirabella a lot of the other folks up there and coordinated efforts with us. So that we weren't thinking of streets twice but making sure that we had in or even the empty empty cable vaults, but put them in at the same time so that we could just use that road space. Well, so as you're talking to people I just want to acknowledge the fact they appreciate how hard they work to work well with my office at on appreciate the comments. The spirit with which we're doing this work because this isn't got you work the public. They don't care. They look at us all as the same as the city. So if we go over these cost over and you're not saying it was a department executive as a counselor the city of Seattle, so, I think the Department's fully understand that so we're all in this together, and I think this is a good body works. I look forward to appreciate appreciate a lot numbers on your on your hand out on over a little bit longer. I look forward to hearing from FAS now. Thank you all for being here and for waiting. Are you kidding right? Thank you for coming and thank you for your all your work social justice initiative accomplishments are directed goings is here Peggy how nice to see you back at the table and then I'll ask everybody else to introduce themselves. Everybody get settled in. Count the green light here appear on the stem everybody make sure that your lights on and these things move. So if you'll make sure that they moved close to you so we can hear you and Calvin going to do you like to start the introduction sir and glad you're here Maggie Thompson the equity and policy director in the director's office. Sherry McLeod with Regulatory Compliance and consumer protection Kelly Allen senior analyst with The Fleets management Division. I am also the co-leader of the change Team iccp. All right. All right. You've got a lovely beautiful dosist soft voice. So move is towards you if you will throw a room or CCP and I am also keenly thank you Dora management division in the motor pool manager. Thank you Darcy. Alright Mister Goins. Thank you very much. We're really excited to be here today to talk about our 2018 race and social justice accomplishments as well as a free a few brief. Look at heads on the project. We are actively working on this year. I want to First acknowledge the members of our amazing staff and RF a s change T many of whom are here in the audience today. They can waive the amazing team and they really have been Critical Partners in all that will be talking about today. I know we've got about 30 minutes or so that one of your respectful of your times. We've got a 15 to 20 minutes PowerPoint, which will go through quickly and if possible, maybe they can hold the questions that you think you'll find me. The questions are answered during the course of the presentation. So I just want to start by saying thank you. First of all, I thank you for your confirmation of my appointment as we have to ask director back on September 17th. And in that short 7 months, we really have done a major recalibration to uplift highlight operationalize and socialize Equity at FAS cuz it really is foundational to all of the work that we do in our department and that starts with establishing our five pillars, which you'll see on the screen behind me. These really are the guide work to the guide guiding principles the framework everything we do at FAS and you'll be here in a little bit more about those throughout the course of the presentation. So first A-frame our conversation about race and social justice today. I want to focus on our efforts specifically into of the Five Pillars specifically pillar number to a respectful Equitable and collaborative work place really is important to me both personally and as the Director of fas and we've implemented several efforts to strengthen his body of work first elevated the good work that was going out at a fast by establishing an equity and policy director the in the director's office and it's not deeper engagement with our team across FAS around change theme and equity in racial Equity toolkits secondly early in my tenure. We kicked off a months-long process to establish performance agreements with all of my leadership team all of the managers and the Strategic advisors at FAS. So for the first time ever 100% of all people managers and strategic advisors at faf have a written performance agreement and a key part of those agreements is furthering racial Equity within the department 3rd. Rhr division is updating our workplace expectations and standards reviewing our Workforce. Impacts of performance measures and discipline and we're applying an equity lens to our recruiting and onboarding for all new staff that every manager has this kind of an agreement in place. Are you the only Department doing this the first time in my experience at FAS is done. This is this something that we should look into more deeply for my department as a new Department director. When I started on day one. I was interested in seeing the evaluations of the senior managers of the department and they did not exist. And so part of I think an opportunity for us to improve the work that we do is to make sure that we're holding our Frontline staff and our senior managers all accountable and by having written performance agreement written understanding of what's expected of me to be a successful employee. I think is very important and then number for Economic Opportunity. See-through City Contracting systemic and institutional racism is real and FAS must do our part through our Cornerstone program such as windy and priority higher and to that end. We are absolutely committed to promoting Economic Development opportunities to underrepresented communities and continue to build on the set success of these efforts going forward and that's just a quick overview. I am about to kick things off. I want to turn over to Maggie Thompson art director of equity and policy to talk about the work. She's been coordinating in partnership with the amazing team at FAS me to we have a lot to cover my intent is to give you a brief snapshot of sort of the coordinated effort that I've been doing in partnership with everybody at the table and in the audience, of course continued are on going to work around Wendy's and priority higher, which you'll hear about in a moment, but first wanted to highlight some of the other efforts that started last year and we took a renewed focus on racial Equity NFL Particularly with respect to support for the change team and engaging newly and differently on racial Equity tool kits at with respect to the change team. We expanded the change team went from about two or three existing members in 2017. And now to nearly 20 members representing every division across the department. The growth has been a real Dynamic process as the team continues to build relationships and skills. I'm in doing racial Equity work in collaboration with all of their colleagues. So you'll hear more from dorit and Kelly in a little bit, but we're really excited this year. I'm to have a new foundational Charter document. I'm in an upcoming Retreat to digging on this work further. How big is your department again? How many employees 630 employees do I take things you think and then just quickly and in addition we took a special emphasis on racial Equity tool kits last year. I was started by requesting proposals from all of our divisions and then move forward with nearly every one of them. We've been working very closely with the office for civil rights to develop trainings and workshops for all of the staff to really support them and moving through that work and then subsequently we've developed a community of practice around this body of work project teams generally span multiple divisions multiple subject matter experts every project has members of the change team on it. And then I've been holding a monthly community of practice sessions with our staff teams. Were they can learn from each other and discuss challenges opportunities. And then we also bring in staff both from OCR in from other departments to share their Equity expertise. So that's been a really powerful space for 4. Got to do some learning has definitely been a learning curve on but I can say that these projects have already had a strong impact in terms of helping staff. Bring a racial Equity lens goes to these projects into their existing job that they do more broadly. So you'll hear a lot more detail about all of these things but kind of just wanted to give you a quick overview and I'm going to turn it over to Liz next to talk about Wendy's in priority higher but and I am so appreciative of your enthusiasm. Let's just start with that that this sounds about as positive as I could imagine and 7 months. Well done. Okay, Liz Thank you. So the slide before you or behind me Reflex FAS wimpy spend for 2018 and it has shown with the exception of fas consultant Contracting spend which unfortunately fell significantly short of our projected when we go FAS when we spend for purchasing transactions and completed construction projects, exceeded the city's actual Wendy spend to ensure we achieve our goals this year FAS has implemented a more robust plan reflecting wimpy plans for each division that are tied two key staff performance agreements increase training efforts and monthly reviews. 44 Pompey FPS increase his pump payment rate in 2018 to 90% a 7% increase over 2017 and 4% over the Citywide average of 86% FAS would like to achieve hundred percent prompt pay we're confident that this year will meet the city-wide pump a goal of 95% through closely monitoring and Reporting out on a quarterly basis. This is great. We know that small businesses can't wait often times. But you are you specifically use the word Consultants. What about contractors? Are we paying or contractors 90% of the time as well? I would have to get back to you on that. But we do have prompt a Provisions in in our construction projects. Answer your question. I love what I'm hearing. So this is not critical. Maybe it will be after Safe Company like that. Right? So the prop a notion of pain within 30 days when I get a utility bill or any other bill now, I mean in in the olden days when I was younger, you know before the internet you got those 30 days but seems like if you're a week late now, you start getting all these calls your cell phone rings get these texts. It seems to me that we is a city. We really penalized folks out there for not paying us properly within 30 days in our utilities and and everything else. So is it that hard for us to pay our our Consultants just not just your department but all departments within 30 days. It just seems like we should hit that 100% of the time. So what are we doing wrong? Because we insist people pass within 30 days pretty religiously is an institution question, but maybe we can talk offline about how we improve that because for the temp. Are some of the folks that weren't paid on time, it just seems like we're not practicing. What we preach is a is a is an employer so I don't really want you to respond but it just seems to me that is a city we should be able to all the Departments should be able to do that under some of the time we expect it, right? It's are going to follow up. Alright, thank you. I'll now highlight our priority hire program which applies to select construction projects of 5 million dollars or more. But I'd first like to start with a priority higher success story Aundrea. The woman in the photo on the slide is a laborer apprentice and mother-of-five Aundrea completed a news trades rotation program in the summer of 2016 and as a pre-apprenticeship graduate, she was giving hiring preference and placement on the city of Seattle Denny substation project. She earned more than $115,000 in direct wages on the project and the contractor has retained her for work on other projects. As the date on the slide illustrates the city's priority hire program promotes access to construction careers for women like andreou for people of color and four others who are underrepresented in the construction industry are priority hire program prioritises, the hiring of residents that live in economically distressed areas particularly in Seattle and King County. This next slide shows that under our priority hire program women and people of color especially African-Americans and apprentices of color have seen an increase in work opportunities on these projects. The success of priority higher has also led to an expansion onto public-private-partnership projects like the arena renovation project the Seattle Asian Art Museum project and soon the aquarium project. I'm pleased to share with counsel today that the city continues to be a national leader in these Workforce Development efforts, and I want to thank Council for its ongoing support of the program. I also want to thank the labor unions contractors apprenticeship programs and Community Partners who are at our side. It takes true partnership to meet the Region's demand for construction workers, and we applaud them for putting underrepresented communities first. I would like to highlight that in 2015 when our priority hire ordinance was first assigned counsel gave us a goal to have 40% of construction labor hours on these projects performed by people living in these priority. Zip codes so far. We're we're on track to meet this goal by 2025 and why we appreciate having this ambitious goal to work toward much has changed since 2015 with the huge boom in construction and other entities in the region adopting priority higher even with the Recruitment and Retention strategies. We haven't placed reaching 40% by 2025 presents a challenge that will require ongoing review. We will be seeking guidance from our priority higher advisory committee on this Challenge and we will share any recommendations they may have with you. I'll now turn it over to Dora and Kelly and they'll be sharing information with you on our change team activities. Good afternoon. Thank you for allowing us to be here today. I'll give you a rundown of the change team. Maggie really touched a lot of the things that we have progressed and doing it since 2017-2018 and currently we have a headed up to thee to a direct and spanned a membership and throughout the department because of the input of the current director in making from 2 in 2017 to now about 20 individual for an audience today. We've also had the opportunity to do community service, which is something that was not stress. We have food Lifeline within the department in 2018, was able to deliver 1300 pounds of food to food Lifeline in 2017 died in 2018 with 1800 pounds of food. Now that my expectation this year as well. Lease at the 1:10 Mark. So as far as community service for doing great things within department for hour. Stakeholders and interior and exterior. I'm going to turn it over to Michael Lee Kelly Allen for your generosity. I mean a ton of food is a big deal and I appreciate you doing that. So what the expansion of our team and we took the opportunity to do a sort of reset for our foundation and so part of that we work together to establish our mission statement, which goes as follows. The Department of Finance and administrative Services has the most diverse set of responsibilities of any City Department in support of Fass service to both internal and external customers. The FAS. RCI change team is committed to promoting Equity diversity and transparency and Department transactions. seeking ways to seeking ways to further incorporate racial Equity into FAS lines of business through the racial Equity toolkit as well. As other means growing a community of fas employees who bring a racial and social justice plans to the work they do every day as public servants for the city of Seattle and we have also a source of his word and in the spirit of setting or fundation setting for the results to a doctor Charter that fits our needs today the process itself. I would consider that were describing to be synergistic representing the power of working together. The result is a starting point for us a structure that underpins our mission. So we are also. Working with the Department in the kids. We are actively involved in several of the projects that are happening throughout the department. I will talk in more detail and coming fight about that. We are also the change them is involved in some other valuable Partnerships as I am Cowboy encounter appointed to in the beginning. The department is working on a plan of racial Equity winds too. Well as the process and procedures that are happening so part of that we are they called upon her asked to participate or partner with the human resources department apply that racial Equity lens into some of the HR processes. So I will turn it over actually to Dora to talk more about another partnership that we have with a fire department hiring board decided to change their hiring practices in process. He's one of those things that they asked was for the change themes throughout the department change to drop a city that have representation for their hiring process for their fireman's boards, its unique opportunity with the first-of-its-kind the RCI individuals that had an incredible impact on their hiring practices and the outcomes for the employees we had an opportunity. I was on the board as well to not only interview the candidates but we also had an opportunity to kartik the interviewers which Gave a very Level Playing Field to to how they handle their business and I think it's the the outcomes will show with this new hiring process with a whole new group of recruits. And we're very proud to have done that last year. We've been invited to do that again this year and we're looking forward to this conversation and future on this. That's the first time that I have heard about across the part 2 mental effort that way and what you were suggesting about critiquing the evaluators are the people are actually selecting that is that's first class work and I think that'll really move the needle on what we're trying to accomplish cancel present hero the department of firefighter Department. Are the chief approach you or did you approach how did that this Synergy come come together if we would be interested in it and I'm not sure how they came to that conclusion. I believe it was an ask from the mayor's office to Citywide change teams to fall into your essentially to participate in because I know my counselor in Gonzales and others including myself. We've really looked at police and fire particularly, but other departments on the hiring at tonight. I have a meeting at 7 with the prison of the black firefighters Association in there about 8 firefighters many of them are old dinosaurs like me they've been around for 20 30 40 years, but the numbers have been staggering in terms of the losses of women and people of color and so again in a post i-200 environment, you know, there's been A lot of unintended consequences or maybe even intended consequences, but that kind of work is becomes critical of where we're trying to to get him quite candidly. No one within the department seems to oppose trying to look at how we could do better, but we just seem to can't seem to get there. So I'm real pleased to hear the your team helping out. That's great. Thank you. I appreciate it. And we look forward to many more operations what I'm really looking forward to tell Police Department once a step forward to seeing you representing saying is it this is genuine. I don't mean to ever say that we are a lot of words, but sometimes we do but this seems like it's been invited you are leading the charge here you are doing some things that are unique and successful and I'm very appreciative to all of you for your ex to work. Thank you very much. We have had our await your planning our first Retreat for FAS 10 team members, which will be the first week in May as matter fact. We have a very excited about it. It's a corporation of course with Str. And we are anticipating this to be an annual event. I would also enable S to bridge I'll work for the future for 2019 and possibly to 20/20 and if you have anything I'm more than just kind of winging how excited we are to Further build our infrastructure build our awareness and plan for the future participants. These lovely Folks at the table in the audience getting the numbers up. It doesn't surprise me Michigan's reputation precedes him before he's with the city on doing this kind of work. He's spent a lifetime of a conclusion. I built them in a prior life so to speak but it can't just be home alone. Maybe it was but how do you get to how do you get the energy up from a couple of people to 20? Someone's a good cooking brats food or something or but I just need to be clear. You know, I I set some broad goals, but it's the people around this table that did the work and the people behind me that did the work. We have an amazing team FAS and I've said it from day one, I think. FAS was a department that never got the respect it deserves and and I think with some of that a little bit of of of goal-setting the resources that are necessary and then get the heck out of there way. This is an amazing team is doing absolutely transformational work each and every day at a fast and they deserve the credit. Yeah. Is a good director? Okay, so I'm what else do we have here? Sophie FAS monitors women in our minority-owned business utilization very closely on its projects and we work proactively to support contractors to be successful on our community Workforce agreement covered projects. For example, we engage and contractors education at all stages of the project and we provide one-on-one technical assistance as necessary. However, we've noticed that over the past few years. When do utilisation has increased on non Community Workforce agreement projects and yet remain steady on CW a project while this may not be a trend we're interested in proactively considering ways to further increase wimpy participation on community Workforce agreement projects and therefore have undertaken to write a racial Equity tool kit to identify opportunities to improve our MBE participation so far we've conducted focus groups in late 2000. 18 and earlier this year and we're continuing with our stakeholder engagement strategy throughout the spring. For our next steps after completing stakeholder engagement will go through steps 3 through 6 of the toolkit and then we'll report back to our priority higher advisory committee made up of contractors union Representatives training providers and Community Advocates. Great. I was earlier today talking with Sound Transit about the Outreach they've been doing for st3. And I think they've done an amazing job on neighborhood by neighborhood when I had asked them if they would do is to make sure and they said they were already doing it but working with the Department of neighborhoods and they had really dive deeply into the neighborhoods where there haven't been people that or meeting people that hadn't been part of the real processes to date and if you've got things like that that you're doing working with the Department of neighborhoods to pass on names contacts because we're always trying to find people With the natural cultural leaders, maybe not necessarily the ones that are have been most of all today sounds to me like you're doing a great job in that Arena if their names of people organizations that you can share with the O N. I think I'd be very helpful. Thank you. Thank you. So all in my portion the presentation with one final success story. This story is about Tracy shown in the slide here Tracy is the owner of T&T traffic control LLC. We first met Tracy when she worked as a laborer on a City Light project since then Tracy has started her own traffic control company with 18 projects completed or underway, including the arena project. We applaud workers like Tracy who made the Bold move to start their own construction company, we believe it's truly an inspiring representation of the goals of both the priority hire program and the city's when we program well done and it sounds like some of our Small business administration helpers were involved in this too. I'll turn it over to see who will cover her team's important. R80 work on shared Mobility. Next flight. He'll see is about to reach luckily to locate on shared Mobility. The desired outcome of the Rat is to promote economic advancement of people of color through shared Mobility service contract for use by city employees for a city business travel establishing a contract is essential to augment the existing motor pool with the city of city employees More Travel options, when conducting City business accessibility for employees who cannot work downtown where the current motor pool exists and for employees when the motor pool is fully booked. So are at stakeholder Outreach and research included engagement with survivability providers such as local taxi companies and tncs. We also engaged current motor pool users Fleet coordinator and Regulatory Compliance and Contracting Professionals in FAS. It's on the next slide. I'm you can see that a word for moving on to next steps already implementing the next step. In fact, we are working in Fleet Management to create a centrally managed pilot contract with two local taxi companies that are primarily owned and operated by people of color. How do you contract will provide the city employees the ad hoc and scheduled ride Services, they need to use for Citi business travel will use the pilot experience in 2019 to guide the development of a long-term contract proposal process some in 2020 and that's that's that right to Sherry for the last one as we all know that using using something other than running a city car cost a lot less and I think in our office was pretty much shifted over. I like the idea of having specific companies that you've contracted with as a possibility one thing. I just like to throw in here and I've heard and I'm so grateful and all this work. We've been also focus on age friendly efforts in making sure that we're reaching out to people of all ages and abilities so that lets were looking at these contracts if you will just Add on through your your I know use the acronym of rat your toolkit just make sure that we're considering people who may not have the ability to get around as easily as solutely many of us are already looking about the wheelchair accessibility access from the street. Where can they pull up to Seattle Municipal tower? For example, I'm making sure it's available for employees if I could be so bold to ask a favor Twisted in it. We've done at the armchair the taxi comedian and in TNC comedian the ride shares in the whole that whole world is just a fascinating World presented your department a lot of challenges us as a council member and they checked it with a lot of challenges it can I just be keep I kept apprised of Serta what that kind of looks like in the Hat first I heard of it could be fascinating. Will know we have some resolutions in place and what we're trying to do what I was trying to creep parody, but I'd love to just know more about it. If there's some way I could get some information on what that looks like a deeply appreciate that. Good afternoon. And thank you Darcy. People of color have been disproportionately burdened by the criminalization of marijuana and disproportionately affected by economic barriers to business ownership. Washington and Colorado as the first states to legalize did not include any Equity program elements such as vacating marijuana convictions and prioritizing licenses to those most impacted by criminalization of marijuana. Mayor durkan and City attorney Pete Holmes address the vacation of Seattle Municipal Court marijuana misdemeanor convictions in 2018 Governor Inslee announced his marijuana Justice initiative in January of this year allowing individuals with one marijuana misdemeanor to apply for a pardon currently Senate Bill 5605 appears to be heading to the governor's desk this week, which would allow thousands of individuals to apply to vacate their marijuana misdemeanor convictions. We are in our fifth year of legalization people identifying as white own 78% of the Seattle marijuana retail stores, but demographics show whites as 69% of the Seattle population. African-American ownership is at 2% It's actually one store. And African-Americans represent approximately 7% of Seattle demographics. There are more people of color as marijuana dispensary operators prior to legalization. This inequitable trend is reflected across jurisdictions who have decriminalized some cities and states neutral legalization have built into their efforts Equity elements party licensing fee reduction and waivers mentoring incubation programs. support and funding are ret team has been conducting research and engaging and stakeholder outreach are stakeholders include former medical marijuana dispensary owners community and business associations civil rights organizations Community leaders and other City departments. Our research has included the state application and license process and learning from other jurisdictions with similar objectives to address the inequities when new programs under legalization. Our next steps include the Washington State liquor and cannabis board as a key partner The Bachelor participated by telephone at some of our meetings. We will continue to learn and engage with our stakeholders to develop Community recommendations to address our outcome and support equity in this industry. The photo in the slide is actually our team a couple 3 weeks ago down in Olympia. We did a little field trip to go down there and learn more about the legislative process and we were fortunate enough to meet the sponsor of Senate Bill. 5605 Senator Joe when And we got to see the cherry blossoms like to say that that is a very good use of your time. And I appreciate the fact that you took the time to go down to Olympia learn more about the process meet with the people that you needed to talk to you about why this bill was important? So thank you for doing that. And if I may add to that, I think it's really important for our legislators to hear directly from the people who are carrying the responsibility of enforcing and monitoring the implementation of some of the laws that gets a pass at the state level units one thing to to legislate another thing to actually Implement those things and we have a small piece of the implementation enforcement pie, but it's an important one on the lesson. I I as a policy-maker the city I have always found it really beneficial to hear from people who are actually doing the work to make sure that that whatever policies were considering our are being well. Informed by the realities of how those policies play out in practice. So really agree with Terry Bradshaw's observation and opinion that it's a really good use of city employees staff to head down to Olympia and share those stories about why some of these policy changes are so important and really appreciate you all taking the time to make the journey down there to to provide that information and said get information back to so I thank you for doing that. Thank you. I'll pass it off to Maggie to Sure up coming projects. coordinated so this next slide I won't read each of these off to you, but just wanted to give you a quick snapshot of the other projects that we have underway. We have eight total tool kit projects and the end. I'll just say briefly that, you know, it's been a really incredible process staff have picked some really meaty complicated talk topics to dig into and bring a racial Equity lens to inside the the thoughtfulness that they are bringing to these projects is really incredible, and then I will also say that one of the muscles that are being strengthened through these projects is really the Outreach Elementary Ram FAS is not necessarily a department that is as well practice as some other departments in terms of stakeholder engagement, and so that's been something that's been great to actually have conversations with community members on the work that we are doing very directly. So just wanted to Kind of give you the the whole universe of projects and know that I've got a lot of this work moving. Good job. Just sounds like you were underscoring what Liz was saying, If you have any questions you want to pursue closing comments if I will in the lateness of the hour that and I'm not saying this just cuz you all are here but this almost models the kind of work. We're trying to do with in the park then when I hear a presentation like this, I'm wondering how I could Share this as a council with other council members. And so we may want to think offline about it are briefing or something along those lines how we can encourage his kind of participation. Now what I do, like, let me see what I liked about it. I like that you're looking at something is granular as how do you wave in a animal shelter service fee as well as the large policy issues on the marijuana policy. Do you know Ali Garrett one of the Cannabis board Liquor Board Commissioners was out in Olympia. I started last week in Olympia. She understands his kind of work as a board member. She does a lot of inclusion working. So so so what I like about what you doing is you looking at the larger policy issues as well as some of the stuff that the Grassroots stuff as well and then I just like to see the numbers there. There are forcing numbers when you're trying to embrace this kind of work and then you're doing cross-departmental work as well, which is critical. So I think you're on all cylinders. I'm doing this kind of work and I just want Find yourself good stuff. So I think you that you are seeing are genuine enthusiasm about the work you're doing and appreciate the Outreach Liz just everybody around the table. I'm just very impressed. And for all of you that have been involved in the change to her sitting there quietly watching your colleagues. I got a quick question don't look Calvin how many of you agree with him that the department in the last seven months has become more collaborative. So how many do you believe of you believe that it's what he's created. You all have created a more respectful environment. Is that it? So you're feeling like that. There's things that we have to do. I will tell you that this is one of the most profoundly good rsji presentations that we have seen because you are your modeling as accounts president Harold said you're modeling the work we want to see but I'm also getting the sense that you've bought in. There's been a lot of times when we've seen these presentations where I'm just like what I'm hearing the words, but I'm not seeing faces. I'm not seeing people that are generally engaged in this so thank you all for your involvement and to the extent that we could bottle this. I'd love to do it directly goings. You get the last word a Sound Transit contact Studio n be mindful of wheelchair accessibility in the rat comeback generally on the shared Mobility update and share this going to best Cuz it was some of our fellow departments nobility Say That Tune. Is as you may know Maggie Thompson is leaving FAS for the private sector at the end of May and it is with very mixed emotions. Very happy for Maggie has a new opportunity in the private sector, but frankly, I'm sad I'm going to miss you. You have been a tremendous asset to the city to FAS. You have been a champion every step of the way whether it's the Five Pillars are performance measures are performance agreement Meggie who sets 10 ft from me probably comes into my office where I go to her cubicle six or seven times a day talking about how critical these issues are. It's a core of her being and she has the work of the change team Rhett's Rachel social justice issues. I could not we could not have done it without her and so I just want to say thank you for the amazing work that you've done and we are going to miss you and keep counting. I wouldn't feel like I could move on if I wasn't leaving behind a great team of people to move to work for word. That's very gracious. Thank-you. I didn't know either so Care more about it. I'm I'm proud of you. Thank you. Okay. Alright. Well, thank you. All again. This meeting is adjourned Lena Tebow. Thank you for being here and I'm taking over.", "end_time": 6811.0}]}