{"format": "raw", "annotations": [], "confidence": 0.9350345747690674, "data": [{"start_time": 0, "text": "Good evening. Thank you all so much for being here. It is 5:32 and I'm sure he's the most that share of the housing Health Energy and workers rights committee. Today is Tuesday, May 21st, 2018 and housing house energy and workers rights committee will come to order by Aaron house policy manager at the office and the bus from our offices as well. If you need any assistance, please feel free to grab any of us at any point in let us know how we do want to make some special announcements before we begin with. Our program today for is childcare tonight. We know the evening meetings are difficult daytime meetings are difficult and we're trying to make these these meetings more accessible especially to Working Families a folks need childcare. Please let us know they're going to be closing up the child care on check in at 6 p.m. So let us know if feel free to grab a or or Aretha. Let them know also for folks who did not take any public transit here and you have your own car. We want to make sure that this is an accessible and affordable needing as well. There is parking at Seaport garage located between Sherry and Jean Street between fifth and sixth Avenues at a discounted rate tonight at $5. If you do have your car there let us know and we'll get you a parking sticker and the parking garage closes at 10 p.m. But I promise you we are not going to be here for and a half hours knock on wood. Welcome to come to my restaurant. How are you? Thank you for being here. If you are having difficulty hearing us if you're having any challenges with hearing us, let us know we have hearing aids and a system of here so that we can make it more accessible for folks who need assistance in the room. So don't feel like anytime you can come up if there's any challenges let us know a little early because of other things that I can avoid challenging and I appreciate you being here and have been at multiple a community meetings on Fort Lawton in the past. I think the audience have seen us and we see many of you only had the chance to work on this for the last the about year-and-a-half, but I want to remind so so this is a conversation that's been going on for now. 15 years. This is also the fourth time that we've had this discussion in our community and our committee just this year alone. And the process for today is I'm going to do a very brief opening remarks on keto and Tracy from Central staff will also join us for some very reason opening which will be about 10-15 minutes and then we're going to be public on it for the rest of the meeting. So if you haven't yet signed up there still some time. We have some folks who've already signed up with really appreciate. We're here today to talk about the proposed affordable housing development at Fort Lawton. This plan includes a variety of affordable housing options, including Supportive Housing for seniors affordable rental homes for low-income families and individuals affordable homeownership opportunities for our community the crisis of our city. This is a crisis that is affecting West Coast cities up and down our Coastline and across our country in this County alone. We need at least a hundred and fifty-six thousand affordable housing units just to meet the current needs not even including the folks who are coming to the city for good economic opportunities on Tuesday sanctuary as immigrants and refugees and to start their own businesses as we seen a lot of people move to this area for economic stability as well. One of the biggest challenges is creating new affordable housing options and working with our nonprofit developers to make sure As we make moral and available that were actually creating opportunities for Community Driven development housing that means our community's needs one of the first things that we did in this committee last year was the past the land disposition policy basically saying that our city should stop selling off public land to plug budget hold and instead hold on to that public land use it to build affordable housing creep parks and Open Spaces green spaces for kiddos and seniors and families and that has very limited resources, but it's also important for us to make sure that when we do have public land that we are turning it into affordable housing. Provides us with a unique opportunity to put the ownership of a portion of this property from the federal government at no cost at a significant portion of public land is available to this city at no cost and that we can use that land to build affordable housing services that are cities. So desperately needs for people experiencing homelessness Brian. Thank you so much for being here with us. Appreciate it. I've also been involved in many of the community meetings in the past and I know that you and all the council members have heard the calls for not only housing but for strong Park elements of the plan and that we need to preserve areas for green space and open space for play and Recreation over 60% of the sites preserved for open space has large parks and habitat preservation and had the opportunity to attend the Magnolia on the environmental impact statement on the proposal and her support from Neighbors Advocates and community members about the need to move forward with the plan at Fort Lawton. I also heard and I acknowledge that meeting. We also want to make sure that there's access to Transit and there's access to good schools. And those are two of the issues that we brought forward in this committee last week to make sure that we're looking at enhancing access to Transit that were scaling up in frequency in which buses come by and that we're working with the school board to a Assassin create new report on access to public schools. On March 4th of this year. I was also joined by the office of housing public. I also join office of housing public Hearing in Magnolia Court for the proposal that I heard at the March 4th public hearing was looking at the need for us to re-evaluate how much surface parking lots we need. And then if any of our friends who were sitting on the Seattle Channel debate with me about two or three months ago are watching are here in the audience. One of the things that the folks said in the meeting was instead of the surface parking lot. What if we treated more wildlife habitat for the Wildlife that's in the area. I believe we have more Blue Heron on this would be the spot for them. And so what we did was we went back and we worked with the Park and Recreation stoves and said this resonates with me. In fact, I love us to re-evaluate all of our service parking lots across the city and see what we can do to scale back the concrete surface. Parking lot that we have that frankly are not cleaning Green Space or housing for both because of that call for action will you'll see from us what you'll see from me and the Amendments that were putting forward is a reduction in the parking lot. So that will at least reduce it by 1/3 at the SS parking lot and more wild space for our habitat mostly about the community for bringing that issue forward. So as you all come forward to the mics, please know that we're listening to your ideas and your comments and suggestions, even though we're at the end of a 15-year. Here there still opportunity for you to give us some ideas and with that Tracy Radcliffe and Carol Freeman are here to give us a brief presentation. The reason legislation and Redevelopment plans are then you will hear just a little bit of context and we'll get done driving in deep in the public hearing. We had an initial overview of the plan at the April 16th meeting at the house. On May 2nd. We had a deep dive from the department and Community Partners will be implementing different elements had presentations from Office of housing on the convenience of the property from the federal government to the city from parks department on the progress of the amendment. I just mentioned and helping to create additional Green Space we heard from the Department of Transportation from our Community Partners about what it will take for us to go through the evaluation of getting additional bus services. And we also had our folks our friends from school district there as well talking about first the play fields at the school is going to be considering and then also additional Services going into the future. We will have a discussion and possible vote on the Redevelopment plan on legislation at the June 6th how the health energy and workers rights committee. That starts at 9:30 right here in council chambers. And before we move on after these two presentations, we will have public hearing. I just want to make sure that that is noted in our agenda. If I could have the intelligence of our colleagues. I'd like to move approval of the agenda including public comment after our presentation from Central staff. Great Tracy and keto thank you so much for being here. Why don't we have you guys walk us through that overview that you have any presentation that you have for us today through it again. And again, so today we'll just see what I do on the table. So if you didn't grab that, please feel free to if you want us to bring it to you just like us down we'll do that and there's also sign-in sheets again for anybody who came in late. We will continue with all the comment here in a second. Thank you Tracy and keto there are two pieces of legislation. Hot Topic of the public hearing today the first piece of legislation would adopt and approve the city's application for Surplus Federal property at Fort Lawton including a Redevelopment plan and they homeless assistance submission, what does appendix age to the legislation as you stated the Redevelopment plan will create up to 235 housing units in addition the plan will provide 21 to 22 Acres of Parks and Recreation Area including approximately 13 acres of passive Recreation up to 6 acres for the development of to multi-purpose athletic fields and some parking between 4 and 5 Acres of forest land on the western edge of Fort Lawton that will actually be incorporated into Discovery Park. She also mentioned the ReUse of an existing structure to the north at the parks maintenance facility. And the summary of this information is included that handout I don't have to Dyess. Thank you so much Tracy again summary of the information included they hand out on the diet. If you didn't get grab one cheat on purpose of tonight's public hearing is to meet a code requirement for a piece of rezone legislation. Every razon bill is subject to code required public hearing Council Bill 1195. 103 Zone approximately 10 acres of the 34 acre Redevelopment area from single-family 7202 low-rise to multi-family residential with an M1 mandatory housing affordability suffix for those folks who aren't familiar with what and I'll write a novel Raichu Zone would allow that allows walk up part walk-up apartments up to a height of about 40 feet and ground related attached housing. So row houses and townhouses that housing type so the proposal in Council but one 19510 would be to change the official language map the zoning map. To allow those types of uses through a change from single-family to low ride to the things that I know is a big interest to the three council members who are here is creating as much affordable housing as we can especially on publicly owned lands. Can you talk a little bit about the side boards that are put on us with the environmental impact statement as is and and where we landed in terms of affordable housing and what's in front of us after this proposal. I'm look at a zoning designation up to low rise too. So that essentially sets the upper limit of her Council consideration of development that could occur in this razon. Are you something else that I'm missing here Tracy? Best men's in terms of building units for for low housing of the perimeters of the Redevelopment plan itself and was proposed there so I can say that this is necessarily the maximum amount but for the purposes of the Cities application to the feds, this is the proposal and I think it seeks to achieve a balance transfer our team and our office. I'm looking at our staff here is we had a really great PowerPoint presentation in the last committee meeting that outline the various components of the plan. Maybe we can make some of those available for folks as they're waiting for their name to be called and they can come through them if we can maybe pull that up from our last committee meeting and make some copies available that be great. One of the things that I think is important for us to reiterate the housing aspects public space open space. So could you talk a little bit about the preservation of the 60% of the land for public? Public space sure. So that was the piece that I talked about in terms of the 21 to 22 Acres of Parks and Recreation Area again, 13 acres of passive Recreation 6 acres for the F-22 multi-use athletic fields that Mary be developed by Seattle School District or by the parks department for to 5 Acres of four forces land forces land on the western edge Fort Lawton and then again W. So that existing structure at for the parks maintenance facility. , tomorrow, I'll cons of Collies customers who want. Thank you. Come to my room was good. I just got out of one or two Echo what you said correctly and also but Tracy and you were staying with his one desire that our community and all of us here. We have a desire to maximize affordable housing on public land. But also I also attend council members get up for the emphasis on open space and athletic fields and tell him because I think that also is going in the right direction because what the statement bar making through that is that all households regardless of income and their children deserve the best of all facilities and housing, obviously the primary component of disenchanted of living but it's not just that it's also access to Open Spaces, especially for children, you know space to play and so all of that goes hand-in-hand. Children of wealthy or household income households have that and it's taken for granted, but it's not true for low income people struck by the fact that when we go to visit other countries, for example, I just had the chance to go to Berlin last year and housing is very dense. There also have is Preservation of large public space as we create additional housing one thing that's really critical for us to do is also recognized that parks are people's new backyards, and it's a great place for those with in all ages and abilities and races of nestor's ethnicities and generous to be able to have a place to play and live in the city that they weren't to work for tire study or Or Lyft telephone number by any other comments from you. I know you've been working on this for a while to realize you have anything you wanted a point to in the PowerPoint or just do it at that up there just for recognition. This is the one image from this particular presentation. So I need for a pokestop Orient themselves to the Redevelopment plan area. Thank you so much for all of your work and to all of our Community Partners, you're not here at the dais with us today and have since moved on to retirement. We are looking forward to taking this forward as council member O'Brien said and to make turn the plan into action. So what that I think will go ahead and start with public comment. Any other comments on my Council colleagues? So thank you all for being here. I want to recognize as well Carlene from Council Office is also volunteering with us if she's here. She should raise her hand, but thanks so much for their staff for being part of this as well. The first person we to the microphone. Thank you, Mary and David Hines. Thank you so much David. I marry steel Klein Advocate. I have myself been home with him when my children were smaller, but I apologize project strongly because it is a an intention to create a ghetto a Socialist Communist Community, which is permanently poor. These are words that were used by Permanently poor aspect of this thing is devastating for the families involved. That means that if they work or otherwise better themselves, they can be evicted. Now. I have a problem of that and then and I think somebody has taken an entirely jaundiced. Look at this problem and I believe the problem is is enormous had to leave the project is sure I completely missed directed and has all of account holder truly will be gone it be coming in the future here to have to execute this plan. Desert, there's no reason to proceed with this nobody's here from the city come you're going you are up for election, which may or may not occur. I don't know who who is listening to our Panda. And what I'm most concerned about is index of in the isolated low-income community and 600 children with a group of disabled homeless vets who are known to be drug addicted to mentally ill and and those children who are unsupervised because there's no employment within easy easy reach will be exposed to these deaths now the play feels this is a particular problem in the plane. Appreciate your comments. Thanks for being here tonight. The next person will be Kelsey Hamlin. Let's parking lot more housing embrace the nature that's already there. The Catholic church is rotten to the core. There is still perverted pedophiles in denial in the church keeps expanding a for-profit real estate Empire City Council needs to stop proving there a loop and out of touch about the unqualified developers in nonprofits mixing religion and state the politics of guaranteed city council city council should reject the Catholic church out of principle the church can't even and won't get insured to let the poor wash their feet or bathe. It's all because the insurance won't Bond them without an exorbitant fee because the Catholic church has proven untrue trustworthy and deviant why is city council lazily resuscitating an outdated 13 year old business plan that never was improved with choosing a proper developer. We have stuff for the failures of social welfare system at the hands of the Catholic church in the other so-called non-profit to get rich off the demise and lies about the Forsaken. Darts, diocese as corrupt as hell. In fact, the real estate Empire of the Catholic church has been turned for-profit. Just look at the building. They own in Belltown where they used to have the Seafarer center. Now, it's rented out the two nightclub serving mostly alcohol and paying the church rent real housing is the only way in America allowing more Warehouse cinder block Billy's cosmetically prettified on the outside for the sea dispute. The social welfare in history is the problem city council should take the Catholic Church off the list of who gets Fort Lawton because the church only help people who are guaranteed to get a welfare check from the government. So it can be immediately transferred to a Catholic Church Bank the Catholic Church have his nonprofit extension taken away for their for profit real estate Empire and their political lobbying during the last election during the mayor debate. The Catholic Church did not. What is a patient and asking questions was all controlled by a Catholic Church operative. And anyway, we need real homes, not political favors Dragula just church that violates the separation of church and state and gets Rich building a rundown subhuman quality real estate Empire at taxpayers expense. Thank you. David. Next person is Kelsey Hamlin and Then followed by elizabel. Thank you so much Kelsey. I want empathize how every single decision we make from this point forward as though it should have happened while ago is Paramount in a Greenway means that we need to build things like Apartments which Cut ghg Is by about half per person compared to a single detached home. I think building is at odds with the environment for green spaces. The chance to revamp Fort Lawton is not one of the four that we handled housing and went and green spaces. In fact, Seattle's happens most during development. I would be remiss if I didn't go on as is meaning within walking distance of homes that typical typically cost $939,000 and is an equity issue studies show a huge map of access to Green spaces between incomes and between races. There are Health disadvantages associated with this by not building Mass affordable housing on one of the climate crisis on one of the spots of real Anne Seattle has left which will inform once we pretend the climate crisis isn't actually happening and that there are no it's a shame we have to leave more but it would be even more shameful to build not at all letting people live closer to drops means less people driving long commutes less traffic less pollution is to as health impacts. Stress Financial burdens the air we breathe in our children breathe. We cannot afford an every sense of the word because who can afford it here really not to make the common sense changes of adding multi-family housing the Fort Lawton. Thank you so much appreciated Isabelle. Followed by Michael George and thank you everybody for being here. I think it's been done in the right way. And I don't think it's very creative. So from what I've heard your proposed 92-97 million years from now, no one can see into the future. So we don't really know where we're going to be left up to the next city council to decide either because 40 million dollars vacant land on this land may be applied on Roy and Aurora where there is an S. Owned and Sons gravel parking lot that hasn't been used in years and we can use shipping container so I can do my plan. 8096 people with 40 million dollars using 575 shipping containers. I see this to be a much more not only green because these shipping containers often end up in the way cycle which is why Starbucks uses them to build stores and Japan uses them to build shopping malls, but there are also movable stackable and very modifiable there like Legos you can do anything you want with them and understand the people that are on a fixed income. And now that I'm running for city council. I understand the position that you guys are all in so I won't yell at you or be mean but I do think that this is really the most viable solution and it would cost $870,000 for 8 employees on each side the house anywhere from 176 to 352. People and if it doesn't work, we could sell it for profit when it's no longer necessary. Thank you so much. We will take everything out Michael George followed by George Smith. Welcome my phone. Thank you and thank you for having me. My name is Michael George. I'm running for city council and I'm running on a platform of making sure that the City Works for people of all ages and incomes it when I look at this project and you guys got the balance, right? There's open space and what really makes me happy is that there's affordable housing for seniors and families. That is such a critical need in the city and I commend you for really moving us across the line. I'd also like to say that I've been canvassing the neighborhood to get neighborhood perspective and I've heard a couple things. I'd like to just surfaced a lot of what I hear is actually, you know, I'm for this project, but my neighbor don't tell them and it's surprising how many times I hear that there's a lot more support than I would have thought in the neighborhoods immediately surrounding us. I've also heard that 4 people that do support they do want to see more Transit service the 33 needs to run more frequently. I'm just bringing up concerns and this public school system really does need more capacity what you You sound like you're really working with the school board to get done. The last thing I like to say is that there is a lack of days to clear space in that neighborhood. It comes up Time After Time Windrose daycare, which is just a block away from this project is having trouble finding a room to expand. There is a great need so I know it at this point probably can't be incorporated into this project, but it would really be an olive branch of the neighborhood if we had this housing right shoulder in in in also brought daycare somewhere on the last thing I'd like to say is beyond all of this. It's a real human issue with the lack of affordable housing. So I really look forward to meeting the families that someday are going to be living in this project whose lives are going to be bettered by this project and I really want to thank all of you for taking the time making the effort to really move this across the line. Thank you. Thank you so much. George Smith followed by James McIntosh Welcome George. My name is George Smith Magnolia resident. I live in council member Council district 7 near the proposed development. I'm testifying tonight in favor of the application for Surplus property and also for the rezoning. The need for affordable housing for low and moderate-income individuals has been a crisis in our city for several years and it's continuing to be a crisis in this space closure is just an unbelievable opportunity that's been thrust in our laps to have this kind of land in the heart of the city is just really remarkable and the close proximity to employment schools and other amenities the neighborhood provides. I think we'll make an excellent home for a lot of people. The other thing about this project that really excites me is it's a mix of people there's older adults families children is like a micro Community all to itself. That's I think a function of the fact that this project has the luxury of a lot of land which you don't normally get nut in a non profit Housing Development opportunity. The last thing I'd like to just stresses I think housing and many of us here. I think probably feel the same way that housing is a basic human, right and the city can't do enough in my opinion to try and secure more land for public ownership my simple-minded solution to the crisis as we have to take as much housing out of the market as possible. The market will just continue to go open up if we can freezeland get it into nonprofit ownership. We can keep housing affordable into the future. So I encourage you to take every opportunity. You can to secure land for public use because I think this in the long run is the most successful strategy. Thanks. Thank you so much. We have James McIntosh followed by Lisa Barnes. Hello, fellow City and my name is alternative. I am a person who is visually impaired and can I hear is why I personally favor alternative 3, let me tell you something personally some things about the location and bus travel is well-versed to shopping and services are very limited. You have to transfer especially this is very hard for Metro to change routing of buses. I work with Metro for years and very hard to work with the Magnolia area and other locations. Because you don't service in ridership is pretty low and in Magnolia and no better alternative to develop the area where there is access to travel shopping services and where they all that trailer available examples are lower Queen Anne Interbay shopping district. However, the park is accessible to the disabled by it was a regionally intended that this one of the last and greatest the best missing piece to Discovery Park be included in the park. It's in the founding documents approved by the city in the early 1970s Discovery Park is a place of unsurpassed serenity. Sisters and unsurpassed our lines and open space of quiet and Tranquility away from the city and the works of humankind or minimize. Thank you very much. Mr. Macintosh. We appreciate it. And if you'd like to leave your written comments with us, you're welcome to anybody else as well as well. At least the barn swallow. Hello, I think the most important thing I can say is I'm so ready for this to be built. There's absolutely no reason not to build low income in affordable housing right now. I think you all have done a very good job listening to concerns and incorporate those concerns and keep redoing the plan must be tiring. I really appreciate that. It is for a range of income levels. I think that's awesome. I work at a nonprofit where we provide eviction prevention assistance, and I am seeing way too many people on the verge of being evicted. We do not need any more homeless people on the streets. We need housing that they can afford and I see this in this project course, I'd like to see more but we got to take every opportunity to build that thank you. Thank you so much Lisa, and we will take that recommendation to Park West Akron Hi, my name is Rosalyn. Yes. I was pronouncing your name wrong. That's okay. Thank you. Very dense City with high government-provided home ownership. So I'm in support of affordable housing. But in this instance, I have to say that affordable housing needs to be outside and we need to Annex Fort Lawton to Discovery Park. So here are my reasons in terms of good urban planning. The most sensible thing to do is to increase density near resources and infrastructure like Transportation lines grocery stores that existing utilities Etc Fort Lawton is not situated in the location for increasing this sense density. There are far more efficient places elsewhere in Seattle in a location that can provide future. I'm going support for these seniors and low-income folks. More and more people are coming to Seattle as we know and these people will seek out Parks, especially Discovery Park. So the next thing Fort Lawton to Discovery Park seems to me like the most logical thing to do that no other Parkland close to the city, and you will be able to find land for affordable housing elsewhere, but not for tax. So this entire project is estimated to cost 87 million dollars will be budgeted to be 332 each. And anyway, it's going to be very expensive at what point would you say that is too expensive how about now lastly that will be 235 units is that enough that these will be eight years from now is it's going to solve the problem that we have right now with the crisis that we face. Thank you. Thank you very much Roslyn. Appreciate it. I Jessica West Scranton. Starkman. Hello. Thank you council members and staff for your time this evening. My name is Jessica West Grand and I'm here to speak on behalf of the Seattle renters commission Seattle renters commissioner urges the city to move forward with the plan to build 238 units of affordable housing at Fort Lawton as quickly as possible. Affordability is the single largest issue that ranchers in Seattle face today as a city gets more expensive renters are forced to either give a greater share of each paycheck to rent or leave the city entire communities are wiped out by displacement working people struggle to pay rent every month thousands of our neighbors sleep on the street. We need to build as much affordable housing as possible. So that all renters can live in the city that we love. The Fort Lawton development is an excellent opportunity for the city to build 238 affordable units. The housing will be next to Discovery Park which provides much-needed proximity to Green Space usually reserved for wealthy homeowners. We need to do more. It has been over 10 years was Fort Lawton was first declared Surplus land within the time. We've been talking about Fort Lawton average rent in the city has risen over 60% We woke every unit of affordable housing at Fort Lawton, but we need to do better when the next Fort Lawton like opportunity arises. We should build more affordable housing faster. We should widely Ami requirements so that affordable housing includes our neighbors both higher and lower than 60% Ami the backlog of shovel ready projects currently available to affordable housing developers the affordability crisis. That's Yellow Ranger Space must be addressed with the most pop most urgency. Thank you. Thank you very much, Jessica and just for the viewing Public's counter over there. And would you like one customer at thank you so much for waiting. Sorry about the delay meal. You got 2 minutes go for it neighborhoods in Seattle. I'm in favor of building low-income and mixed income neighborhoods in Magnolia. I am opposed to building low-income and mixed income neighborhoods in was probably the most natural and most beautiful Park in Seattle Discovery Park. Make no mistake about it the homes currently to the east of Discovery Park are not in Discovery Park. Fort Lawton is in Discovery Park, it always has been and when you add construction destruction traffic noise infrastructure and commuters for 238 Apartments townhouses and row houses in addition to 266 parking spaces covering 34 Acres. You will be negatively affecting this park. Not only while the housing is being built but also after it has been completed. I understand that the land is basically free. So it's a good deal for the city. But if you go ahead with this project, you will be trading some money now for the desecration of Discovery Park for years to come this is your choice, but I hope that you would think beyond the short-term profits in favor of the long-term preservation of the Park Fort Lawton is not the place to build. This is not the Seattle way. This is not Who We Are There are other places to build housing in Seattle even in Magnolia find one. Thank you. Thank you so much, It's as well to be left with us by Calvin Jones. Hi Karen. Hi, thank you for giving me the opportunity to speak and I can't read my notes. So I'm just going to say I live a block down the mic just a little there you go. Perfect. I live a block from Discovery Park. I take the bus on the corner of 36th and government way. I took the bus today to come down to this hearing the Fort Lawton area is just very close to half a block walk. I was totally in favor of this project affordable housing is so necessary in this city across the street from me on 35th Ave. You ever got way back probably nine Plex. It's just been the people have had to move out there either going to demolish it and build something new and large and expensive or redevelop it affordable housing is gone to Magnolia for 30 years. I've watched that affordable housing just appear all over. We have a city of Seattle public housing on the corner of 34th and government Way, Seattle Housing. There's no problem. So those people I don't think there would be any problems with the low-income elderly people in Discovery Park and having elderly and children live together is the best way for All Families to be so I thank you for the time that you put into this and we don't need to talk about it anymore. We just need to get it done. Thank you. Thank you very much. Calvin Jones followed by Laura Lowe Bernstein Hi, my name is Calvin Jones. And I'm an organizer for tech for housing and a renter in Madison Valley. I share a passion for parks and open space like a lot of people in this room. And I think that Discovery Park is one of the most beautiful parks that we have here in the city on a sunny day the fuse in the Puget Sound are you know an incomparable biggest problem with parks and open space in the city is not that we don't have enough of it. It's just at the park that we do have are not accessible to most people Miss Food City. Especially Discovery Park is nearly exclusively surrounded by detached single-family homes, which virtually ensures that only people who have enough wealth to afford a single family homes have access to that park. I think that the best thing we could do to improve park access for people in the city is to allow more types of housing around our beautiful green spaces so that we can share them with everyone. I'd also like to address just the amount of affordable housing at Fort Lawton. I think it's a little bit to go through a 15-year process and only come out but with 238 units of what I think of Fort Lawton as kind of a practice round for the next time we get public land available. There was a article not so long ago that the Washington National Guard is going to release 25 acres of land at the city, and I think it's really an opportunity to instead of getting 238 units after 15 years. Maybe we can get five or ten thousand after two years. Why not? I think the affordability crisis is a crisis in Seattle and deserves a crisis level of response and that we should treat him really really big with the public land. That's it. Thank you. Thank you so much. Next we'll hear from Laura Lowe and followed by a shoe. I just wanted to start off by saying thank you to everyone that's works so hard and sat through so many hours of testimony from Neighbors that are afraid of change and afraid of your neighbors. We have Catholic Housing Services Habitat for Humanity. This land is going to be for folks to have homeownership opportunities as well as renters and Indians of all tribes involved as well as most of us understand some implication that were paid activist Urban busting from other places. I live right south of the Ballard bridge. I could take a really long walk or shorter bike ride, and I took the bus here today. We look at Museum out at the county level. This is of Transit written rich neighborhood. This is an amenity rich neighborhood. This is a neighborhood that has employment opportunities within 30 to 40 minutes. I have friends that can you chew hours by bus each way from Maple Valley to talk to you about Maple Valley. This isn't remote. This isn't on some islands. This is part of our city. It's near downtown. There's grocery stores in Magnolia Ms. Grocery stores in Interbay is going to center with her and the claims about the folks are being isolated and not having services are just not accurate. What's a cover for fear of change and speaking that part on behalf of myself as a new neighbor. I felt that fear for my neighbor's they're afraid of me. They're afraid that I'm destroying the character of the neighborhood and it's very sad that they've expressed that. Make sure they cities Hat real quick and see if we work on land parcels and we might keep public lands in public hands and let's look at doing this * a lot on Echo what Calvin said and thank you for everything. Thank you, Laura Renee. Renee's any followed by Tara Miller Berry and then Maurice Emmett. You to the council for all the work you've done so much on this project. I'm I grew up in Seattle and I grabbed another fancy neighborhood in Seattle. And I think that when we were in the mha hearings someone from Queen and made the point that a lot of the outer neighborhood in Seattle, like less shy like Magnolia haven't had to do their share for. Mha and so I do think that there is an opportunity for some of the outer wealthy neighborhoods in Seattle like Magnolia to do their part in providing and making space for affordable housing and like Calvin said, thank you for your great comment it hopefully Fort Lawton is just proving ground for all hers for Windermere for Sandpoint to also be able to make space for affordable housing in the future. I also wants to know if the comments about intruding on the serenity of Discovery Park it it's beautiful space, but I do want people to remember that all of Discovery part used to be a hoe. You know what I heard about the project. I put up a Google alert for Fort Lawton and I thought I'd hear about a lot of affordable housing meetings and instead almost every week. I heard an obituary about someone who had been disembarks for it from Discovery from Fort Lawton during World War II or their Korean War and I learned that there had been over 400 structures on Discovery Park at that time that are not taken apart and that there were 50 mm servicemen at a time at Discovery Park. So I I mean it's a beautiful space but I think people should remember what our land is for random and that if there's we are able to how is more people than we should take that advantage. Thank you so much. Miller Benny followed by Mara cement Hi, my name is Tara Miller Barry and I live right across the street from Fort Lawton on 36th Avenue. Thank you so much for considering building affordable housing in my backyard. My family would be really excited to welcome new neighbors. If this Redevelopment proposal is approved this proposal matters a lot to me because I worked with families and individuals experiencing homelessness in Seattle for five years, and I know how hard it is to find affordable housing anywhere in King County. Let alone in Seattle any of these amazing people would be great candidates for the variety of housing being proposed and we could really use communities like this bill and every neighborhood in Seattle. Housing prices are soaring in Seattle and people of color immigrants and low-income workers are being forced out daily. Magnolia is a pretty isolated and segregated neighborhoods. Even for Seattle and it's time you make amends for the ways you look at people out is a good step towards remedying our cities and morally slow response the affordable housing crisis and for my neighborhood's culture of exclusive exclusive is Amanda Lee dizm. Please make this Redevelopment plan a reality. I'd be happy to help in any way I can thank you so much. Call It by Bryan. my name is Marva Smith and thank you for listening to us and I haven't heard any mention about the wildlife that has taken residence in Discovery Park since the military left. And the great Heron that carry their nesting material over Fort Lawton from Discovery Park near the locks right now. I'm told that they used to be closer. And I didn't hear anything about all the dead whales that are coming ashore. In fact, there's more whales this year in 2019 than all of 2018. I didn't hear about the owls who like their night sky, what are they going to do when some 300 Holmes + Holmes are going to be lit up a Jason to Discovery Park. We have one chance Fort Lawton is contiguous to Discovery Park. Let's access that and acquire that for Park to allow all the wildlife that cannot stand here in front of you and say help. Help give us more habitat. Thank you. Thank you very much, Samantha. Brian Carn the followed by Marty questra so as someone who grew up in Magnolia with parents and when my grandparents in Magnolia, I just want to say that this is a fantastic opportunity that this Redevelopment plan presents. This is a fantastic opportunity to chip away at our housing crisis at gentle density that fits with neighborhood character and provide housing for working people. And the elderly this is a great opportunity to provide more green space more room for nature more room for those animals who live there and also with that idea of reducing the amount of paved area both in the Redevelopment area in Seattle in particular one thought about that might be a little bit granular using tile and brick paving more permeable. It also serves as a traffic-calming measure drive slower over it something that you could run with little bit in addition this also provides recreational area as a person who was formerly a SPS student. This would have been amazing to have some place. They're pretty close to my home. There's some other opportunities that go beyond what are mentioned in the plan to including some reasoning and the vicinity for some commercial are mixed use to provide additional nearby amenities such as more grocery stores or other other opportunities such as that improving Transit frequency with a 33 and something that's been mentioned here is yes, it would be great to to build elsewhere. Yes, we should do that and we should also build here too. So over all this is fantastic opportunity. For more people more families more kids more elderly to live in and enjoy Magnolia and district 7 and Seattle. I heard you two today approved the reason ordinance approve the resolution. Let's develop Fort Lawton. Thank you very much. Bernie Kosar followed by Daniela lip singing Hi, Marty, welcome council members and thank you for this opportunity. I'm already quick dry work for the Housing Development Consortium. We are 180 member Association focused on housing in King County. I'm excited to be at this point. Finally when I arrived here in 2008. There was a folder on my desk at Habitat for Humanity that said Fort Lawton on it. This has been a long journey has council member O'Brien well knows with every moment that has passed. However, the need for affordable housing has grown. We now stop waiting and we act we need to turn this underutilized land into at least 235 affordable homes. What's a scale of Need for affordability in our region at least forty four thousand additional affordable homes needed in the next 5 years and we continue to need that amount every five years until we get to 2040 until we get caught up with the lack of housing that we have. We have a responsibility in every neighborhood in every opportunity to find out where we can provide more affordable housing. We need every tool in our tool kit and we need to use every piece Surplus land we can possibly find. We are meeting this moment with determination that it demands. I asked you to act and finally, I'd like to just make a comment or two. I heard some remarks about the Catholic church and other two of our members Catholic Housing Services and Habitat for Humanity, which I worked for for 24 years of my life are two of the most Stellar members that we have in this community Catholic Community is standing in the Gap like no one else in this entire Community or in this region working with the most vulnerable population doing the work that most of us would not want to do we're talking about two organizations that really care. They know what they're doing. They know how to build community and habitat is about Habitat for Humanity as well as everything else. Thank you. Thank you so much. Alicia Reece Welcome, Daniela. Thank you. The city council is going to be putting housing on the far end of Magnolia but says that there is not enough money to rebuild the Magnolia Bridge. The Magnolia Bridge is a main throw away for transit in and out. And if you take away the bridge you're creating more traffic for the buses. You can't reasonably ask to put in more units of housing will also not having money to replace The Ridge at the same time. You were saying that Fort Lawton Redevelopment, you'll have 24/7 monitoring for the low barrier individuals. This city right now is unable to maintain a solid oversight of the individuals in low barrier housing. When talking with local police officers, they mention the numerous calls it take them to low barrier housing that the city has put in and within six months the units are dirty and filled with drug paraphernalia. I would ask council members to talk with the local police officers who go into these types of housings everyday and see firsthand what is going on? The fact that the city believes these individuals will be that will be living here need 24/7 monitoring is an indicator of what will truly be going on. Logistically, you're isolating low-income individuals. There's no bus line that goes directly to an affordable grocery store and no bus that goes from Magnolia to Ballard as a current district 7 candidates. I am not able to support this project as it stands. There are no entry level available jobs. No bus lines. No affordable grocery stores. We should buy Lots where you get investment for your return. Look at 15th. Look at the Armory entry level jobs major bus lines grocery stores sell future sc3 line. We can't just add more buses or bus routes right now. They're over 600 bus driver opening. So how are you going to do that? You can't get parts face. How much more money are we going to put into this project to add buses add a grocery store and add entry level jobs. It's a lot more than 90 million. Thank you very much. Alicia Ruiz album saying that right followed by Mason roads welcome and just pull this microphone on up. There you go evening. My name is representing the Master Builders Association tonight. We recognize that there is an affordable housing crisis both locally and nationally to help address this crisis and create much-needed affordable housing in Seattle. We fully support the Fort Lawton Ivory development planning urge the city to approve it quickly after years of discussion planning with stakeholders public review and debate. It is time to adopt and implement the plan to create affordable housing in Seattle. Thank you. Thank you very much. Thank you so much for roads and David Moore ring. Welcome, mr. Rhodes. Hello. I'm a member of friends of Discovery Park. But I'm sore will cost housing but not in Discovery Park. It's a city Cruise Moorpark space is required. and I'm that's the main points but there's one other thing I'll just to List of things up a little bit. And I'm going to try this. This land is your land. This land is my land from California to the New York island to the Gulf Stream warm for you and me. Thank you very much. Treat your Vets For Peace had to thank you so much for your service. David Mooring. Are you so much David gave you a three-page handout that hopefully you can follow along with him. I'm here with the Magnolia Community Council who is actually meeting in about half hour as you've seen in the FBI is the may not like me, So that supported the alternative the number one. You think it's good to bring affordable housing community. So thank you for that point to the diagram to just put it out in that. I'm not sure if we have alternate number one of the kids from the screen or not, but I'll turn the number one, as you know is basically the right side of North Texas play the the units that an apartment style tip of the peninsula east side of North Texas way is the townhouses in row houses. So that what's happening on the Westside is really the LR2 what you're talking about doing what's happening on the east side is really just lr1, low-rise zone. So what page 2 represents is currently how this is being described as being LR2 all across the board. So in fact you'd have instead of row houses and townhouses you got the possibility of the whole thing being a multi-story buildings up to 40 feet in the last page Busy Bee shows how you should be describing in your legislation with the LR one towards the east and LR2 towards the West. If you don't do that, then you're going to be exceeding what was conveyed in the FBI is what should be greater than the scope work. I have to disagree with Mr. Patel. And I look through all the Thousand Pages settlers. I looked at for the four four stories, and I didn't see any alternatives 1 2 3 you're the preferred alternative that showed up with that level LR2 development. So please take a look at that. Thank you so much. I'm testifying and if you haven't yet signed up and you're interested we will still take your name. So you're welcome to sign up welcome. Thank you councilman. You know, I don't know. I spent a lot of time I guess in my life experience around folks that are caught up in this homelessness stuff and And I've heard a lot of concerns from a lot of people tonight and there is none that aren't valid and I think about where we've been with this type of housing with her. It's like least at the High Point projects for the stuff over by Harborview. And you know, what we're doing now is such a step up from there. So we're getting better. You meet all kinds. There are people that you see amazing success stories and then you see problems like we've seen with folks. I just can't get off whatever this and that the other thing, you know, I haven't seen him specifics of this but It seems like a good idea to me. You know, I haven't I'm more of a big-picture guy and I look at the numbers and I see where our city is going. I see the affordability stuff getting so much glass because of just the economic side of this how the economy nationally is going to shape and fix us, you know, we were so penalized in 2008 with the financial crisis because we didn't have that problem and Uncle bars portion of that problem is what it created. The financial issues we have in the city today and as this goes a different direction long-term that will in a lot of ways the affordability piece will work itself out for those folks that are willing to work. The challenges is there a lot of folks on the streets that just are not going to get reintegrated back into the system. And that's where we really struggle still and that's where I think a lot of this stuff in the creative ideas. We have really work and I'm very hopeful that we can get this done and get Harmony project. We need to get done to at least get those numbers right for where we're going because where we're going is going to be such a bigger city that we at least have to keep Pace with where we've been in the past and I will have the folks who are also signed up a sign up as as you come up and just say your name into the microphone if you have any at all ready. So let's see who we have next on our list here. Thank you, Sean. Next we have Max Baker. And then Jesse Simpson. I apologize for folks who may have been lining up. I didn't have the last sheet. So if we can have Max and then Jessie. Himax blue. This is my first time so I looked in Seattle for about 6 7 years now. I'm in that time but lower Queen Anne Ballard currently live in West Seattle served as Americorps went to grad school got my first professional job and I learned about for Lawton the first year that I moved here and 6 by the time I think it's happened and I've been waiting in Earnest to see what's going to happen in six years later. Here. We are again. I currently live in the Riverview area of West Seattle in the Seattle Housing Authority is building a new building on Delridge with 79 units planned just over an acre and I'm in full support of that project. I'm kind of shocked to see that that's almost a third of all the affordable homes are proposed for a 10-acre site at that doing that maths. It seems that we could have 700 units on teenagers of reusing the same density for the Seattle Housing Authority projects. Same arguments could be made by the Delridge site is an appropriate. Tell Rich is a food desert as far away from downtown. It's not near any amenities. I still think the Delridge neighborhood to great place for low-income housing affordable housing market rate housing. And I don't think anyone living in that neighborhood would have anything bad to say about their experience except for those issues of access to food and easier access walking around the neighborhood has any president would have so for this site to be ever considered not good enough just seems beyond reason so very much in support of it. Thank you so much. Text me I'm Jesse Simpson. I see I'm Jessica Simpson This Land Is Only Our Land if we can afford to live here. When we started talking about redeveloping Fort Lawton in 2004 as in 4th grade. It's been held up an appeal. 15 years because of neighborhood activists were posed accommodating more low-income and moderate-income folks with in their neighborhoods. And that's a travesty need to talk as much a fordable housing as we can to stem the homelessness crisis at affordability crisis that played to everyone who rents or wants to rent wants to live in Seattle. Derek currently only six different affordable apartments affordable buildings within all of Magnolia combined 18 units. This housing is necessary. If it will provide people with an with access to Green Space and access to a bus stop that will eventually get them to light rail at 15th Avenue and by 2035. It's only going to be 10 minutes away from the inner bay 15th. Stop. This is Trent. This can be transit-oriented development and provides amazing access to the Green Space something. That's sorely lacking from many of our affordable housing developments IRG to support this plan and move forward as quickly as you can. Thank you. Good afternoon. I submitted a written comment to you. I'll think that 5 so I'm here today representing the Discovery Park Community Alliance myself and a multiple of people that belong to safe and affordable, Seattle. The thing is is that the city was charged from the very beginning to involve the public and to make something out of Fort Lawton properties at had the buying of a majority of this city. And it's that unfortunate history that has brought the city in this project to where it is because the city took a heavy hand and decided to exclude out of the mix the use of the property hundred percent for Parkland. It was always possible to add additional homes for the homeless in the low-income off site that has never changed and the city unfortunately has misled people about what the conditions were for The Brak it gives me no pleasure to have this drug around and it'll be drug around for more years. It's like this says been misstep after missed up on the part of the city and I think the city should step up and men take its part in all of this. Unfortunately. Mr. I was in 4th grade. He doesn't see that and how this all came about Miss. Can you keep your remarks directed to? Play the final part of it is is we're going to continue to oppose this project. We sent out a mailing on Friday to 26000 people Which is far more in the city has ever done and invited them to step up and be part of this process and to oppose the housing and to advocate for adding Fort Lawton to Discovery Park. Thank you. Thank you so much. Is there anybody else who would like to speak welcome and if you could say your name for the record and then we will have you sign in before you leave. My name is Angela Compton. I'm a residence of district 7 I wasn't planning on speaking tonight at the sour note. I grown up in Seattle. I grabbed housing in the stable and kind of lived all over the Puget Sound. I went to three different high schools. I've worked and homelessness. About a case manager currently, I work in an organization trying to lower barriers to housing and give people more access to housing in our neighborhood. And Magnolia is a wonderful place to live. Like I take the bus up from my Belltown apartments and go hang out in Discovery Park. It's beautiful. It's really easy to access from downtown. So I'm assuming we access the other way of exactly the same so I don't really see how people think Magnolia is. So remote and removed from Seattle. It's part of our Urban space and we need to be building up Urban spaces to preserve our green spaces for those little animals that I was hearing about. So if we don't continue building up her Urban spaces and making sure we give people new green options. We are going to continue to see our animals going to exchange were going to continue using the climate change. We really need to see Innovative changes like utilizing Surplus City land for affordable housing for low-income people and making sure that children have access to Parks because that's what we were Are City and this is a wonderful plan. So as someone who lives in the district where this plan is going to take place. I very much support this and the only thing I would ask is that we may be double the amount of affordable housing going on this property. Thank you. Thank you very much. Kelsey was inspired to come to the microphone. Okay. Well, I really want to say thank you for the almost 30 people who came to testify tonight. I know you have been in any Community meetings over the last 15 years. Thank you for coming to the fore that we've now had just this year alone. This will wrap up our public hearing this evening on the city's application for the federal Surplus property at Fort Lawton. The application again includes the Fort Lawton Redevelopment plan, the 2019 update and appendices it includes the homeless housing submission. Appendix H to Fort Lawton Redevelopment plan, 2019 update mint the draft opinion letter that's all included in the application that you can find on our website. We will be having another conversation. So if you just can't wait for the next discussion, there will be five conversation coming up again in our committee on housing Health Energy and workers rights committee at 9:30 a.m. On June 6th right here in council chambers. I love you for your generous time for coming this evening for your written comments in your public comments on for folks were watching at home and listening on kuow. We appreciate everybody for writing in calling in and for providing us with your feedback. And this will continue on June 6th at 9:30. Thank you again Applause for all of your attendance and two are incredible staff for keeping us going this evening.", "end_time": 4429.9}]}