{"format": "raw", "annotations": [], "confidence": 0.9450644200046857, "data": [{"start_time": 0, "text": "I can see that my weekend was a blur a good morning everybody. Thank you for being here for our regularly scheduled meeting on June 3rd. My goodness. June is here already. So thank you for being here. I'm going to dispenser their presents report just do something very briefly before you go around the table and the small business advisory Council here who will be here for a briefing after we go through underwear preview of today's full Council actions. So thank you all of you for being here and I look forward to that and then we do have an executive session right after this that we'll we'll chat about moving to Executive session. And that's all I'm going to say for right now. So we just going to go around the room and do a quick preview of full Council actions Council restaurant does Equitable development and renters rights committee and our next meeting will be at the regular time, which is next Tuesday 11 at 2 p.m. In city council chambers, and we will be making some Commence the renters commission with the agreement of committee members to say yesterday was the 5-year anniversary of the $15 minimum wage in Seattle Seattle became the first major city do when $15 an hour a victory that run Nationwide with many cities and 7 and tire States following with the passage of 15 and also to become part of the presidential election conversations. And also let the way to the state of Washington state minimum wage increases and of course, we should acknowledge that before Seattle's Victory game SeaTac initiative, which was fought for the labor Movement by many Community organizations or congratulations to everyone who 4th grade one through four you forgot. I neglected to Winton Place at that place part of the protocol. Now, it's time to acknowledge the council members that are here. So I must say that that we're doing my counselor. I want where is Pacheco Bagshaw Mesquita her bald in Gonzales and Hazard rules now suggests of the approval of the minutes. I've been asked to hold off on approval of the minutes because there is just a clerical error and we will approve 2 minutes probably at our next meeting. So thanks for that counts. Thank you. I went public asset in native trees committee is June 5th. I'm dedicating his agenda to one item or breathing in discussion missing murdered indigenous women and girls by Abigail alcoholic and her team from the urban Indian Health Institute Abigail alcoholic who is Ponte is director of the urban Indian Health Institute in Austin this report along with the needle ucchista who is Southern Cheyenne the support sheds light on the following fax some of these facts I shared with you last week, but I'll Are quickly very briefly. Again, the Decades of an epidemic of violence perpetrated against native women House Seattle has the highest number of missing murdered indigenous women long over 70 cities identified in this report and where the gaping holes in our government when it comes to data collection and law enforcement and Reporting. I'm honored to share this meeting because they will be able to identify where the city lacks and accountability and how we can step up as we move forward to solve this major Health crisis. Abigail's advocacy has gone as far as Washington DC as well as King County Council in the Washington State Legislature. We hadn't proven down sees me in Olympia this last legislative session 1 think my colleagues for supporting us on our missing murdered indigenous women law that came out of Washington state and of course the national passage of Savanna's act Representatives Debra Wycoff and Mas Burgers sponsored legislation in response to this report, which is House Bill 1713 a bill that never won establishes 2 L Missions within the Washington State Patrol to build relationships between government and Native communities, which is your long-standing relationship of government to government requires a Washington State Patrol to develop a best practice is protocol for law enforcement response to missing persons reports for indigenous. Women are cars the governor's office of Indian Affairs to provide the Washington State Patrol with government-to-government training. The bill was signed by the governor on April 24th, while this life isn't perfect. It's a great step and Foundation to build from I'd like to add and thank Chief Carmen best who I've been working with behind the scenes as well as our mayor Jenny durkan who are working with us to make sure that we can replicate not only what the federal government has done but what the state has done as we move forward and what we call this data collection. And also what we have coined as a decolonization of data, I bite my colleagues and others were interested for this presentation. Again, it will be June 5th at 2 and council chambers today this morning. We issued a media device. Talking about the report on the legislation that we're building on that council member badshah, and I introduced in past year or passed last year directing the city to review and approve its methodology for collecting data regarding American Indians and Alaska natives. So what we have here is a kind of a parental issue where some of the city departments collected information, but a lot of the Department's did not collect information on Native Americans, and so what we're working with with the Seattle Police Department chief fast, and the mayor's office is strategizing and doing the same thing that the state and the federal government is doing so we have more intense, and I know this world gets used a lot robust data collection, but that's what we need to do to Target, and I think we want to address the issue that Seattle has the highest number of missing and murdered indigenous women across this country. So I hope you all join us. Thank you. Good morning. Good morning. There will be no pleasure deleted items on the full Council agenda today and our next plus come to me will be on Wednesday June 5th that we will have 11 agenda items six appointments to the Seattle design commission. Breaking public hearings Impossible Ghost Town Council is 119505 and 1195006 the Ballard and Capitol Hill Design guidelines a public hearing it possible vote on Council Bill 11949. Okisko change to the Seattle Pacific University to apply for an expanded major institution master plan. We also have a land-use decision to allow for the temporary expansion of the North Precinct to add portable in parking and impossible discussion and possible vote on the council Bill 11947 one which clarifies a definition of a vessel will be opening an office in District 4 at the University Heights Center in the U District. We will be open in the district office on Friday and I will be there for the remainder that for most prized for the remainder of the year and constituent should be what Reach out to my office if they would like to meet with me and District. I will be hoping it will be hosting an open house in that District sometime soon. So stay tuned for the details. Thank you very much. Everybody here to congratulations on your office. Let us know when you're open house will be so we can be there for you and I'm really proud. Thank you cancel never wore as the work that you're doing. Of course. I will be at the committee to hear about the missing women and you've done tremendous work and you and Abigail echo-hawk and calling in another's I'm just really grateful that you're out in front on that. So thank you. So we do have five items from the financing neighborhood committee today fairly easy ones for us or three Landmark designations Seattle Tower Mount Baker Community Club University of Washington's parrington Hall and we also I have three appointments of ties marbles to the community involvement commission and also the reappointment at Christopher make had also the community involvement commission. So that's this afternoon. The next financing neighborhood committee will be a week from this Wednesday on June 12th. And most of the day we're going to be focusing on Bobby Humes who will be our next hopeful director of the HST Human Services Department. Also, I want to acknowledge and say thank you to a dead get it wrong again to twice now. That's okay. So human resources to our hrd. So I do want to acknowledge and say thanks to our Queen Anne Community Council and Uptown Alliance South South Lake Union Community Council Seattle neighborhood Greenway, Susan McLaughlin from s. And everyone who came out and joined us last week looking at Thomas Street. This is really a big deal to come. At South Lake Union make sure that our skatepark is premium as we had budgeted for it last budget cycle to make the safety measures available all the way from South Lake union rep Terry Street up to an Across The Challenge on Coney bridge and through the Seattle Center and it's it is something that is coming together, but thanks to the community for all the work that they are doing and for organizing this ride last week. And also I wanted to give a special thanks to those who have been involved in our city hall Park work many of you know that last year we budgeted money for the esler Crescent that City Hall Park and Prefontaine. I'm in Fortson square and then down 2nd Avenue, but I really want to recognize hard King County Superior Court judges who have been very involved in this Carolyn Weiland from King from King County facilities. And then also once again asked. And parks are Public Health Department, we really are coming together and making big strides. Make it a healthier safe for Park and a couple of weeks ago are Pioneer Square preservation board authorizes are parts department to take out the benches cement benches that are all that comfortable but add a lot more tables and chairs making it a welcoming part for everybody. So you will see continued as he changes there with our art facilities as well Randy angstrom things from arts and culture working with Colleen echo-hawk important Square tremendous a minute. You know, I feel like sometimes we move at glacial speed but this one over the last year was really moving and I'm very pleased with all the people. I don't people have been involved and just the economic development opportunities in this neighborhood because of the work they're doing good morning. There are no items from the housing Health Energy and workers rights committee on today's full Council agenda on Thursday this week, June 6th at 9:30 a.m. We will have an extended a committee meeting that will go Until noon there's a number of items on the Full Count are on the housing Health Energy and workers rights committee agenda including the Seattle City Light review panel appointment appointments and one appointment of The Joint Apprenticeship and training committee the notice of intent to sell briefing and discussion on that legislation a possible vote on the Fort Lawton rezone and Redevelopment plan and wave reminder. This will be the fifth time that this this committee has brought this issue up and this comes after 15 years of Engagement and hopefully we'll able to move the ball forward with this council's full approval coming soon. There will also be a briefing discussion impossible vote on extending the rent bidding prohibition by one year a piece of legislation that we passed your mind committee last year to help get rid of the eBay like getting platforms that were escalating the cost of rental. Also reminds us that there is a lunch and learn a little bit after lunch. So you can either bring your lunch with you or eat beforehand. It will be at 1:30 p.m. If we are actually hosting this is a special committee. So feel free to join us one and all in council chambers here to hear directly from Human Service Providers in the city. This is a continuation of our effort from last year as many of you have been involved in Human Service Providers are the ones who have direct and meaningful relationships with the residents and who are either homeless on the verge of becoming homeless or within our community based organization to provide a vital and wide-ranging set of services to the residence in the city ranging from shelter and legal assistance for survivors of domestic violence to employment and food supports to services for those who in Seattle's were experiencing homelessness and last year with this council's support we were able to put into the budget a across-the-board increase of 2% All contracts not just those that are General fun. This was the first time this incremental inflationary adjustment had occurred in 10 years for all contract this year were very very interested in continuing to work with all of you, especially in the budget to make sure that we continue that momentum and that we apply an inflationary adjustment to all of our contract given that we know that Human Service Providers are working a hundred hours a week. Some are eligible for the same Food Services Housing Services and client services that many of their I'm homeless clients are eligible for some are living in their cars. Some are holding second jobs in in order for us to stabilize and create greater security for those who are on in very vulnerable situations and precarious situations either homeless themselves. We got to make sure that we reduce turnover and vacancy rates which end up in the 30 to 40% range in our human service provider organization. So in an effort to try to create greater stability, not just for that work. In the organization's but for the people they serve we will have a special committee on the Thursday at 1:30, which will hopefully continue to tee off our conversations coming for later this coming up this week on Thursday. I'll be attending the King County sexual assault Resource Center 2019 legislative Victory celebration from 4:30 to 6 at the Davis Wright Tremaine building on Friday. I'll be doing a walking tour with some of the members of the Greenwood Phinney Greenways and also a touring a recent daddy construction and really excited to see what it looks like to have that living space that is in more dense of quarters be part of our construction. Hopefully knock on wood coming up soon throughout the city. I'll also be speaking at the Northwest health law Advocates 20 year celebration, which starts at 5:30 p.m. At impact Hub. You can get tickets online. I think it's still there. I don't think they've sold out yet. She's congratulations to Janet Baron executive director of Northwest health law Advocates who I've worked with for. Oh my goodness, maybe 15 years now everything from Apple health for kids to Aca implementation to The Exchange and a more. They've done a tremendous job, and she is my go-to health policy Guru. So very excited to celebrate her and all of Northwest health law Advocates. I'm accomplishments over the last 20 years, and lastly very happy birthday to my little sister. She's turning 35 today, and she was diagnosed with Ms at 19. So this year is our 16th year anniversary largest surviving, but thriving and she's had a rough rough beginning part of the year, so I know she's not interested in celebrating right now, but we're interested in celebrating her. So happy birthday time. My little sister's Pontius, Indiana. Happy birthday to you. Happy birthday is on June 6th at 1:30 this Thursday, correct Thursday at 1:30 to work on the issue of the cost-of-living adjustments for our Human Services providers in advance of budget that's always a struggle trying to address that issue within the context of budget. But by the you leading the council to set set the policy in advance at the budget, I think that is just great wisdom. So I have no idols on the full Council agenda this week because of last week's holiday my committee meeting moved to Friday and Council rules are that things that come out of committee on Friday? I'm including our new directors appointment moved to the following Monday as far as items on my committee meeting coming up the Civil Rights utilities Economic Development and arts committee has a special meeting and public hearing tomorrow evening at 5:30 on Council bill 11950 for this is a public hearing to extend the effective date of ordinance 125650 by 6 months. This is the ordinance that Council adopted to temporarily extend the boundaries of the Pike Place Market historic district to include the Showbox and this legislation will allow the department of neighborhood some additional time to continue the work that was described in the order. That we passed last year the central staff memo. If you haven't had a chance to review what I can certainly share. It notes that the department of neighborhoods expects their consultant will complete much of the work needed to develop some preliminary recommendations to the council by the end of June. And if the recommendation of the Department of neighborhoods is for a permit expansion super review would follow that recommendation this morning house members received a joint letter of support for this temporary expansion from Coalition including Friends of the market Pike Place Market his foundation historic Seattle Friends of the Showbox rise up Belltown picture Studio Building HOA. I'm homeowners association and Friends of historic Belltown. Some of these groups did not take a position on the earlier legislation. They are at this time. I'm supporting the temp. extension Some of you may have also read about the efforts of the city in negotiations with the owners representatives of the last few months, the owner's representative approached myself to propose a standstill agreement as a related to the the ongoing lawsuit and I think it's accurate to say that the negotiations about that standstill agreement or at a standstill. So one of the pieces of I think relevant information in this discussion also folks might be interested to know that there's also this week separate hearing on a separate effort to actually Landmark the property and that is actually going to be my public hearing is on Tuesday. The landmark public hearing is on Wednesday. Lots of business related to the Showbox for this week. And then lastly I have Regional water quality. Fake fighting and I'll save my remarks to introduce the small business advisory Council when appropriate the morning. There are two items on this afternoon's full Council. Agenda One is related to the gender Equity safe communities and the other is with regard to the select committee on housing affordability. So the first item on this afternoon's agenda is Vizsla. So this will be an amendment to the city of Dallas Paid Family Care leave program to amend certain sections to provide coverage to city employees who go through the process of having a child and then have a child passed away shortly after the time of their birth. This is not a hypothetical situation. This is a real life example of something that happened to one of our own city employees. We are Doing this as a follow-up to the hard work and the courage of Aaron and Rachel Elder at who came forward to protect their Union and to City leader is to advise us of the fact that there was a gap in our Paid Family Eye Care policies that did not allow them to take Paid Family Leave as a result of the death of their daughter which occurred 36 hours after her birth. So obviously this was not something that we took into account when we initially legislator this policy in 2016, and we are now at taking this opportunity to correct that Gap in to ensure the future employees at the city of Seattle don't have to make the hard choice about I'm coming back to work or or sorting out a fair is in grieving as a result of an immediate loss of a newborn child. So really want to thank him for mosquito. With us on this issue and with the elders on the issue on special shout-out also goes to sejal Parikh in council member must get his office who has been engaging with the family over a year. Now. I'm doing intensive case management works are really looking forward to having the elders with us this afternoon. I understand that they will be with us and that they also plan to bring their supporters with us with them to Chambers and really excited about being able to take this final action and It's a really good ending to an otherwise tragic set of circumstances are really appreciate their commitment to allowing us the opportunity to correct. This this particular Gap issue is from the select committee on mandatory on the most of you. I think we're in attendance of not all were in attendance last week during a select committee meeting that we had on mha we heard a briefing from Alexander Chee of council Central staff update on various technical that are required to the housing affordability ordinance to make sure that the maps that are attached to the ordinance aligned with a council's intent in terms of the amount that developers will be required to pay in exchange for additional development capacity. There's also some some technical amendments to the language of the code to again. When we initially passes ordinance, so this ordinance is highly technical in nature in terms of the Amendments that are that were Advanced out of the committee and it will be considered a full Council this afternoon and excited to put that went to bed. Finally next wanted to just really quickly cover on some events that I will be doing later on this week in community tomorrow, Tuesday, June 4th. I'll be spending most of the day and District stuff. I will be doing a tour of the cell Repertory Theater between there a really amazing theater in chatting with him about their Public Works program, which is one of their major Community engagement initiatives really excited about learning more about that. I will then head over to the Sacred Heart shelter Sacred Heart is a temporary shelter operated by the Catholic community services staff that works with resonance to develop goals of teen health and dental care job in parent training and assistance towards finding stable and permanent housing excited to tour that facility with a good folks over at Uptown Alliance. And Uptown arts and culture collision at kexp to chat about new Arena construction transportation and the uptown's Art District and whatever else it is. They like to talk to me about doing a tour of the winter Club charity. For those of you that don't know that's a Seattle non-profit temporary staffing agency that connects people experiencing homelessness and poverty with dignified jobs and Supportive Services really excited that or there's space in learning a little bit more about the work they do which of course includes helping people overcome barriers to employment by providing job training meals Vision Services career coaching and more all of that on Tuesday, Wednesday, June 5th at 6:30 p.m. Am really excited to head up to District 5 to meet up with a group of Latin X parents from the North Gate Elementary School to chat about education and Civic engagement entirely in language. So we will be convening with Spanish-speaking parents to Talk to them about what the city is doing in the space of Education to support the education in the thriving of their children in the public school system. So very excited about meeting with that group of parents in Northgate District 5. What is it again? Fisher Pavilion to join the Children's Alliance for the annual luncheon and then later on that afternoon and I will also be at the King County sexual assault Resource Center event that will highlight the 2019 legislative wins. I'm proud to be on the D visery cabinet for the King County sexual assault Resource Center. So really excited about doing a review of all of the wonderful things that we were able to accomplish his last 2019 legislative session including the elimination of the statue of limitations on child sex abuse crimes ensuring that our access a sexual assault protection orders. And if Expediting testing as sexual assault kit still really excited about joining those folks on Thursday as well. And then lastly on Friday June 7th that Friday is gun violence Awareness Day believe it's the 7th annual gun violence awareness day. We're encouraging supposed to wear orange to raise awareness about gun violence and honor the So those last by and to gun violence, of course, we are sitting here today in the aftermath of yet another mass shooting and another series of shootings in our own city as a result of gun violence and it seems apropos for hopefully all of us to be able to participate in some guy gun violence awareness events and in in a day of remembrance on Friday, June 7th. We will also be presenting a proclamation. I'm going to circulate it to folks. This was sent out on Friday and we can prove with your offices that you all want to sign on to it. I'm going to circulate that now we're hoping to have some of the advocates in Chambers with us this afternoon, but if not, we'll make sure to deliver the proclamation to to those of folks in in due order. So that is that Proclamation that I'm circulating now also wanted to just remind folks in it with regard to gun violence. When I say there's going to be a big day of action this Sunday June 9th, it is called wear orange Greater Seattle rally and I-90 bridge walk is being organized by many of our good friends including Moms Demand Action zero USA everytown Survivor Network, March for our lives Seattle funny Brady campaign League of Women Voters and many many more. So for those who are interested will be posting this information on my social media network, but just wanted to give folks a quick a sense of the details. So this will be on Sunday, June 9th. 2019 Focus will be meeting at the Sam Smith Park at the urban. Peace Circle at 1400 Martin Luther King Junior Way South the rally begins at 10 a.m. Near the urban peace Circle sculpture in Sam Smith Park and in the walk on the I-90 bridge begins at 11. I am again. They are encouraging books to wear orange on that day. If you're participating, they're expecting hundreds and hundreds of people to show up. They have a wonderful setup of a speakers including our very own us Congressman representative Camilla. Jayapal from the 7th and representative. Dr. Kim schrier from the 8th congressional district is a really encourage all of you that can go to attend. Unfortunately. I will not be able to be there on Sunday much to my regret but it's for a good reason and that's because I'm going to take a point of personal privilege and say congratulations to my nephew who is graduating from high school on Saturday from Grandview High School my alma mater as well and I'm heading over to Central Washington to Grandview to both enjoy the sun and the 80-plus AccuWeather but more importantly to witness the great occasion of having my fourth nephew graduate from High school, so I'm very excited about celebrating that achievement. That's why I'm Brian. Thank you. There is nothing on this afternoon's agenda and the sustainability and transportation committee. We do have a committee meeting tomorrow afternoon. Just two items on that. Agenda One is a appointment to The Pedestrian Advisory board. And the second is we will get a briefing on a statement of legislative intent that we've had last year around emerging technology and Mobility options. Just as a reminder, the the sly was 35 - 3 - 8 - 1 and we ask the Department of Transportation to come back the survey of anticipated new Mobility options like scooters Transit pods and other non-motorized vehicles that may be coming to Seattle in the next 3 to 5 years. We ask them for an evaluation of other cities efforts to address these emerging private transportation Investments and a strategy to integrate these options into the transportation Network in a safe and sustainable Mater including the possibility of utilizing bike lanes for these modes of transportation. So I'm looking forward to that. Patient in discussion just want to flag a couple other things going to have a public hearing a week from tomorrow. I just want to have a heads up that's on the backyard Cottage Inn in law legislation or a to use that'll be starting here at 5:30 and Chambers on Tuesday, June 11th to expecting a pretty good turnout for that. So, I hope someday you can make it and be prepared for probably a couple hours. I'm guessing the reminder on that Adu legislation. The goal would be I will be will be back in committee on June eighteenth My Hope Is that people be ready to discuss and vote on amendments in June 18th, and actually vote that a bill out of out of committee on the 18th and folks continue to hear from constituents and figure out where the code Down in various aspects of it love to work with you and making sure we tfd amendments the appropriate order. Obviously. We're kind of waiting to hear what we hear from the community next Tuesday, but the folks have ideas on what they're thinking based on last week's discussion want to continue to work with hooks on that. Thank you councilman Brian for responding to the issues that I brought up last week while continue to follow up but I appreciate your position. Okay, thank you for all that. I did put a note that counts for mosquito did Advanced a athletic analogy when she said move the ball forward so we got that note to self? Okay. Let's come up for small business advisory Council briefing and I we can actually get more chairs if we need to that is not a problem. Okay. We're good. Okay. and once everyone gets settled a task that you push the gray button says the green light is on and bring the Mike's a little closer to you going to bring it to closely. Then before do introductions, I'll ask him from her Bowl to see this you up and then we'll start with introductions. So can council member or bald in the fact that one of the mares first actions as mayor of the city was convening the small business advisory Council and then the year following that convening. She also sign an executive order identifying what some of her top priorities are in addition to the items that the council has identified as their priorities. I really appreciate your your work on some of those items namely creating a welcome packet for both new businesses as well as if the welcome packet is I think as I understand it is useful for existing businesses as well. You're also working and taking a look at Some of our our B&O tax struggles we all we often talked about the regressivity of our taxation system and that includes the impacts of taxes. I'm on small businesses. I also want to give a shout out to the mayor for her reconvening of the the the Citywide business. Yes, it's a tactical IDT that exists to tie the efforts of departments across the city to act as advocates for small business as they try to navigate various City system. So that just a quick overview appreciate the work you're doing and eager to learn more and expose your your efforts both to the council's A hole-in and generally to the public and is his community. Traduction kiss my herbo actions. Mr. Lee Bobby Lee a task that you may be introduced elaborate a little bit on your introduction. I don't know. I think you met met with most of the council members, but the public needs no news actually is a former elected himself in another jurisdiction, but maybe you could elaborate a little bit on your background and then she have to discussion as well. If you don't mind. Sorry to put you on the spot like that. I don't know I'm used to it. Okay. Thank you for allowing me to be here just moved here in city of Portland. I serve as a director of economic development for Portland Pride to die server for to Governor Scott's Hopper and keep around to that. I worked in the private sector in the semiconductor manufacturing field Maria memory chips on your iPad on your phones when we came for that company that I work for a nonprofit that deliver Workforce Development programs. Since I started the case manager moved on up but it's similar to the workforce of all my counsel here in Seattle is for Portland. And then prior to that is Bruce mention. I also served on the Eugene city council or university of Oregon's located one of the most Progressive cities in in in Oregon and had a chance to work in in the field that you're in now and dealing with lot of public policy issues. Very challenging issues that are you all doing with I am familiar with that introduction on my house when I mentioned that I am from a different country. I moved here from Korea when I was fifteen and so I bring that immigrant experience as well. Keep my comments short because we only have 30 minutes and I just a lot of questions are all small businesses these days until keep my, short but I like to introduce our pristine three co-chairs who been Small business advisory committee. We have Donna Moody who is with majority restaurant. And then Taylor wrong with Kendall long restaurants and Tracy Taylor the Elliott Bay Book Company, I will so of course have caused Mother Hubbard. I must get who serves and that's as well as far as who serves on this committee and then very very active and diversity of issues that small businesses face is just endless as to have folks who actually live the daily expressly discharge has just been great for the committee. I want to thank all three of you is not like to get paid a whole lot to serve its role as a voluntary position, but they're taking it very very seriously, but not only are they do they take these issues very very seriously, but I've what I found was that they're also very interesting people and very fun folks and someday I predict they'll be a cable show about these three running shoes. And with that. I'll turn it over to Donna who's going to kick us off. Is that right? So I would first like to I think everyone in the council for having us here today over a year ago of the small business advisory Council was formed and as co-chairs with Tracy and Taylor and also Joe for sure who's not here today as he's recovering from pneumonia pneumonia, but he said Kiko chair press he's got some really great opinions and we all kind of come from the standpoint of appreciating the opportunity to give a small business as a voice in the city of Seattle or greater voice to weigh in on policies and decisions that affect us greatly and also just to explain to the city how important we are. It's well known that 95% of Seattle establishments are small businesses. I'm playing less than 50 people. I think a lot of times when people think of Seattle they think of the big name-brand businesses that kind of dominate the story, but there's actually quite a few small. Businesses that make up the fabric of Seattle and to find a way to support and keep them sustainable is a key driving force of our existence, and we are very committed to sing that continue going to turn it over to Taylor who will talk a little bit about the specifics. Thank you, and thank you for having us today and just to set the record straight and zero, we don't get paid parking for parking, but we'll see. So thank you. So after they may I convened about 23 of us on the council with representation from different districts and from different segments of the business community and including to council member council member Herbalife. Thank you for attending our meetings and being there for us words with over the course of a number of months. We work with Sol light to Burley Define. What are the strategies and goals of the small business advisory Council and through many months of discussions working through a lot of different ideas are we narrow it down to three strategies in which we wanted to the small business advisory Council as fat would be working on and making recommendations to the mayor's office as well as counsel the first I'll go into a little bit more. Town of each strategy, but the first strategy was to study the economic and social impact of CB policies on small businesses. The second was to amplify small business narrative and the third was to provide more support to the Xbox and a small businesses within the city and then we took it further and Define the Egypt strategies into pasch and then what do we want or the goals for those tasks were so under the first strategy which is study economics and social and pack up the city policies. The first task was to really research and defined the criteria for small businesses. As you may know we have different policies and regulations and it Define give different definition for what a small businesses and that's very confusing and it doesn't there's a lot of overlap, but it doesn't allow for a smooth transition in To enforcement. So the goal of that was to recommended definition and or criteria criteria for small business. And then the second task was to create a list and review of city policies and taxes for small business recommendation and the goal that was not to change the existing policies and regulations but to inform and enforce, you know, recommendations adjustments to City policies and taxes that we can a small business owner knows what these policies and regulations. How are they effective and how are they relevant to how we're on the bed are businesses and so make recommendations based on that and then the fort 1/4 task was to I want I'm sorry. It's to Assassin analyze the permitting procedures and processes by various City Department. So for example, we are meeting with the Seattle Department of construction and is Action this coming month and it was the reason for this meeting is to assess the city systems impact on small business and on an ongoing basis and how these permitting and and you know, whether a permitting and inspection how they affect small business when it comes to construction tenant improvements and so forth strategy to was to amplify small business narrative like Donna share 95% of our business in Seattle is made up of small businesses. And so we wanted to amplify and identify messages and key points that we can talk about small businesses and share their contribution to the our economy and the city and then the third one was really about bringing more support for small businesses. So reactivating the city business advocacy team as a council member Herbalife mention creating a year. Distributing a commercial at 4 to pay affordability toolkit and to help small businesses take a look at how they are able to afford the rising cost in commercial real estate and then the fourth task was to create a small business welcoming packet and the fifth fourth one was to create a website for small businesses where we can bring all of the different permitting questions taxation information into a collective website that small businesses can go to to obtain the information and all of this was with the goal to connect it existing and new businesses with ongoing resources within the city and then all of this was sent to the mayor's office. I believe as well as counsel for recommendation and some of these are being worked on right now, and then some of them are ongoing processes that we are working through and Tracy can share You little bit more. I thank you. So out of those recommendations of the mayor put forward an executive order for a small business. Welcome packet a cbat team city taxes and fees study and the small Workforce Development challenges. So just a little update and Taylor talked a little bit about the small business welcome packet update that we're hoping will be both physical and website available in different languages. There has been a group and Taylor's been working with the OED to put that forward there in draft process at this point. We found that a lot of small businesses don't know where to turn when they want to open they need information. So trying to get all of that information together in one packet is the general idea. We've also as a small business Missouri Council put together a monthly summary of what we've been doing the work that has been going on what has been happening in our meetings and we've been pushing that out to the small business advisory Council. We're also hoping to further put that out into the small business community so they can get updates on what s back is doing as well as we worked on establishing a cbat as council member her bald mentioned or re-establishing cbat so that there is one central place you can go to as a small business when you have questions calling it department and not knowing who to reach is extremely overwhelming when you're trying to open a business and run a business. We had someone presented our last meeting that council member or as was at talking about how his street got shut down. There was PSE work going on there was construction work going on. There was a snowstorm the snow got plowed in all the street was barricaded and none of the customers on any of those businesses could get to the businesses all done without any notice. So the question was who do you call when you have a lot of different departments that are engaged around your business. So we're doing continue to work on that. There is a city taxes and fees study that we've been working on putting together working with Fass. Sedi looking into B&O taxes Street, use and permitting fees were drafting a report of those which we hope to have in mid-july. And then we worked on a small business Workforce Development a survey was put out to small businesses on about hiring needs and that serve a closed on May 1st. There were 72 responses and the OED and sfac have been reaching out by phone call to talk to other small businesses to start of further that narrative and there will be a draft of recommendations that will move along to ask back probably within the next month. So that's where we are at the executive order. Let me know when we can ad-lib is that the close of the formal presentation so we should just make it up as we go with computer. Okay, very good show. I missed the part where it how big is the councilman how many members are there are no you are the four coaches and 23 members and the neighborhood Chambers of Commerce. How do they get information on what you're doing? Are you sick there in theaters are some interplay between the other sort of infrastructure of small businesses. Can you elaborate we had actually last week our first meeting with the business Community as a whole including all of the chamber businesses and you know, we weren't able to have this meeting until about last week because we wanted to make sure we have a lot of our the first year was just walking through a lot of are you know structure goals and strategies and then ask when getting to work plan moved along we brought in the business Community last week and gauge with them. She had with them the same presentation answer questions. And it will be a process going forward that we will have regular meetings with the neighborhood Chambers in order to keep everyone informed and I'm not as well. Most of the members on S back are involved in their Bia is or their local Chambers. So I think the idea and reaching out and looking at the different districts in areas and neighborhoods of the S back was to make sure that they're informing their communities as well. So that information is going out but what is the the general consensus on house? Yellow treat small businesses. Is this small business-friendly? Are we the worst place for his father's I mean, what are what are your constituents saying about small businesses? Let's just try to get it out there. Nationally is a difficult place to own and operate a small business and we are working really hard to communicate what those difficulties are and also to try to engage the city and the business Community as well as a city government on how to improve that are there some cities that are recognized as being much more small business-friendly. Do we have any models out there that come to mind at least Philadelphia? There's some cities in South Carolina that have been getting a lot of attention. I can't go into the specifics because I didn't come prepared to answer that question. But nationally speaking. There's a lot of cities where they engage supporting kind of lift up a lot of small businesses. I can share mine on that. I have a restaurant on the east side that I just opened about a year-and-a-half ago and just the response and the engagement that I receive from the City of Redmond is very different from the city of Seattle. You know, the city of fragments would call me up and talk to me about permitting licensing issues. They're the one that's reaching out to me versus me chasing them down to reach out to them. Their processes are much more streamlined much easier lower the cost. For example, I just got my patio permits and was three piece of paper that I sent in to them and the cost was $156. I see how tall is much higher and it was approved within a week and it was the you know that the gal that the lady that was in charge of Permitting when she It's the one who called me and sent me the paperwork and when I did get it in in time, she called me again, and she said well, you know, I know you're busy, but you know, we'll be okay. You know, it's not Sunny yet will be okay, but just get it into us when you can. So I mean just in general the process C. I mean not talking about regulations and policies, but just the process of Permitting is much easier and at a lower cost of business and even trash is is cheaper over there the Contracting I mean, I have the same cans trash and recycling and compost cans over there and it cost half of what I pay in Seattle. I think that we have seen a lot of progressive policies put forward in the city which Small businesses would get behind but I think that there have been some unintended consequences that have fallen on small business that have been hard to get a hard-on small business. We get swept up in the concept of business and big business and small business are interrelated, but they're also separate but we have had to deal with a lot of unintended consequences of what what happened really good and Progressive policies. So it's hard it's hard to have to work with that and we're all feeling it for most of us are feeling so transfer Mesquite at first, but then Katherine Bradshaw has in Caswell plating in the zoning and permitting discussion that they should I hear the most about first. I want to say, I'm really excited about the new directors potential to bring to this department having But even looked at the Portland Mercado system and seeing how he's created incubators for especially small women and minority-owned businesses to have a place to grow and Thrive and then facilitation by the city. I think that's really great leadership second. I think that there is a distinction and important distinction to council council president Harold's question, which is how is Seattle being perceived. I think, you know, it's important to remember that nationally we do get national attention for being one of the best places to have a small business. In fact, just seven months ago Forbes Magazine says the best places for business and careers in 2018. Seattle leads the way and among the 15 metres that they look at Seattle is doing the best except for in the cost of living section. It is very expensive to live here mostly because the cost of property and I think that it is very fair to identify policy changes for increased communication increased ability to reduce cost for permitting. I'm streamline. Permitting not just for construction, but also Forsyth those are some of the things that we're looking into working and modeling the Austin example, for example, and I think that there's an important Nexus there between what I'm really interested in as the chair of Labor and what I think you all are interested in it as small business owners easier for you all to build these new spaces and in doing so that helps our building construction trades get the jobs and have job security that helps those who are in the service sector had access to the good jobs that you're able to provide but I do think that there is very fair criticism. I'm about how we can streamline the process and make it easier for individual businesses to get a foothold to start up and that one thing I'm really interested in is delaying fees. So that people don't have to start paying any of those fees especially for the first three years as you think about incubation. I'm just small businesses and separating that out from sort of I think a narrative that's been created about sailing not being a good place to thrive is Those who are making it over those hard hurdles at the beginning are thriving at least according to Forbes and some other reports, but we got to make it easier for small businesses to get that still hold and stay in this city and I look forward to working with all of you on that Nexus between what's good for labor, especially around permitting citing zoning and Workforce Development, which is something that our national farmers at the AFL-CIO also recognized with an Antiquated Workforce Development process where dollars don't exactly follow what they need is some of our highest need occupations in retail and service and Healthcare are not getting that equal amount of Investments and who's in those lien those jobs people of color and with the small business emphasis, especially on minority end run businesses and our desire to lift up those job for that specific those specific sectors. And if there's a good Nexus there until four door comes to guys on those issues. I betcha can't remember mosquito raise many of the issues that I'm interested in as well. But I'd love to hear from you. As far as streamlining goes. I can only imagine the frustration of trying to get a business open with all the economic stress that's on your backs to begin with but then to have the city delay or to be perceived. That one hands not shaking hands with the other. What are you thinking about either through the business advocacy team or the work that you're doing with your Advisory Group that could help us respond quick more quickly to you and Bobby. Maybe this is something you'd like to weigh in on as well. Just one one thing I think comes to mind is just having the permitting Department visit as fact, which is something that we have scheduled and as was our experience when the Department of Labor visit us back and kind of heard the specific complaints and even came to the conclusion that they were unable to answer some of the questions showed to them that if they could not answer the questions there was clearly a difficulty in us for saving what the the formal compliant way to act is so I think having the Department of Permitting visit us and have a conversation and hear a real life story about what that delay caused. Someone financially as an employer as an employee as a business opening delays Etc might actually help to propel things. So part of it in my opinion is communication, which we've had a challenge with actually just getting a direct contact with some people. I feel like I'm a suspect has created a vehicle to facilitate better communication with many of the Departments and in that way just to amplify your voice and make our concerns louder when you heard from one person. It's difficult to imagine that all small businesses as are experiencing something when you hear it from a group that represent small business. It becomes clearer what these difficulties are and how we can possibly overcome them. And I know is Michael nodding his head behind you and this is something that I've heard from small businesses for the decade that I've been on this Council and I'm surprised that we don't have a single portal at this point where I can be an advocate for small businesses and to help get through the real and it's complex. I mean, we've got whether it's Street permits or like you were saying about the patio. I'm getting the help that you need to get going financially. I just think we can do a lot better and I appreciate your highlighting this One other thing I wanted to mention is that you know, the office of economic development is doing a really great job and supporting small-business, but there are so many issues that small businesses face and they are so limited in their resources and the budget that's a located towards Small Business Development is very low compared to other Metropolitan City. So I think asked Council that something that could be considered, you know, as part of the holistic approach of how do we support and you know, bring more collaboration more resources to small business is providing more funding and creative funding and specific funding for small business because right now if you look at old ladies by chat for small business support is very low and you have you know, if we have 95% of our City's business is small business that budget doesn't carry much weight in terms of support soda permitting issue there many different dimensions to it. It's not just Municipal permitting but there's County and their state and then there's Federal and so in the front line, we have a small business owner that are trying to navigate multiple layers of government and that's what adds to the complexity and is that is why it's so difficult to create a single portal because laws are constantly changing from all different levels during my private sector experience. I had to comply with Clean Water Act Clean Air Act and PDS stormwater permitting me. The list goes on the label of the list goes on and on and just even just a fire marshal permitting different levels of government are all asking the same information. It's just formatted differently and they want it and they have different timelines and often you don't even get warning about Windows deadlines are is To you to figure that out under the small business owners as there is a lot of work to be done around this but I believe that there are solutions because Technologies also involving or we can't allow immigration took her but one of the inequities that are unintended is that you can actually pay for Navigators to help you with permitting process, but often is for if you can afford it. So if your medium sized a large companies, you can actually pay more to navigate your permitting. But if you're a small-business owner who just starting you don't have that kind of capacity and Dusty inequity that we have to address. I believe I'll leave that that this point she's in the food industry. And so in addition to all the city permits, there's Public Health Department of Agriculture, and you know, it feels I hear that it feels like how was your day today? I got three more inspections. I got this to do. I got that to do by the comment last night was how's your week? Looks like it's busy. It's going to be busy until we take vacation this summer and Michael about after that and then it says busy again. It's just always busy. That's just the reality of running a small business. At least from from my experience and talking to folks around small businesses. That is possible to both be a really great place to be to run a small business and a really hard place to run a small business in Seattle has a lot of the things that make it really attractive to open businesses here, which is a growing population that population of a lot of those folks are relatively High income and have disposable income. They want to support local businesses. A lot of their values are aligned with values that business owners want to start here. So there's this a lot of good things that can happen in a city like Seattle, but that also at the same time makes it really hard. So I'm the competition for Real Estate just to start off at talked about the cost of housing, but obviously the cost of land per businesses real estate for businesses is really hard and navigating those spaces the fact that there are lots of people to do one open up businesses means wait times for permits in those types of things you mentioned maybe we don't have the right of The resources to process at Redmond's obviously a much smaller cities in Seattle that you know, if we were to be the same scale and provide those Services, you know, how do we do that and how to prioritize. Vs. Some other things? So it's I I do believe Seattle is an amazing place to do business and I believe almost because of that it makes it really hard place to do business too. And it and once you get beyond all the city things Noah Frances, if you're in the restaurant business, you got Hunters any restaurants open competing with you every single week that you have to fight with and so even taken the city's permitting and Regulatory spaced out of the way. It's hard competitive environment that when you're successful, it's great. You are flags at this question that I think continues to come up and put my policy perspective. It's it's something we struggle with this question about what is a small business and I don't want to pretend that there is a right or wrong answer but we do, you know, there are businesses that are very successful in Seattle. There are businesses that are going out of business every week because they can Make it their new business is starting out there that are under capitalized in making massive family sacrifices just to get their foot in the door for the first couple years. Hoping to get going. There are businesses that on paper Malik large as far as volume in sales, but their margin is so thin because of the competitive environment or the industry there in and we elected officials and relieve the general public will often depending on the moment. We'll say look how successful businesses are, you know, are they doing their fair share? Have you come up with some way for us to think about what is a small business or types of businesses or ways to categorize it so we can approach it because it's really hard when you know finite resources lots of challenges in the city and we know some businesses are doing really well and maybe could do a little more but when we do a blanket regulation taxes, whatever on everyone it can really be Listing to the smallest businesses, but it's really hard to draw that line. Make a comment, you know, I think you know that there's different categories of businesses. And I think first of all, that's something that would definitely actively working on in conjunction with LED to look at the research and look at what other cities are doing to Define small business. But in my experience also working out that UD of business Coalition is that you know, you have what I call micro business is very small less than 10 employees immigrant-owned, you know, minority-owned and they are small local community one store locations beds and they experience a whole different set of challenges than you know, a 10% company which, you know could be getting it all considered a large business based on gross revenue. And so when we are City legislate Palmas We lost everybody a small business versus Michael business or you no less than 50 or based on gross revenue or what their margins are as an industry. It really does have a lot of unintended consequences for these micro businesses and they don't have the capital injection is a capital access to Capital is very limited understanding the Regulatory Compliance. Has it spread complex even some of us and the discussion with the director of Labor Standard, you know to come to a agreement on the issue of tips and they were confused. We were confused. And so, you know, if the department is confused how all we are small business owner able to understand what are we to comply with and they have very limited resource in terms of You know going out and and getting that extra help light, you know, Bobby said because and it puts him out of further disadvantage. I put a disadvantage because if as a small business owner, I'm able to go and hire an attorney or third-party to navigate all of my permitting process and you have someone else that isn't able to have that capital resource to go and do that it puts them at a father disadvantage and we're not recognizing that I don't think would recognize him. I don't think we're providing resources for that. I'm so you know what I think part of it is before legislation come out as having a very honest dialogue with a business Community with having Folks at the table and talking about the issues and looking at the multiple, you know challenges that these businesses face and taking that, you know, not as someone complain Or making a statement but taking that ass experience and utilizing got experience to help us cross some of the legislation. I know we can't do one off legislation. But as a whole if you talk to the business Community, you will find that there are a lot of overlapping comments and challenges that they face and I think having that open dialogue with really help. I got four people on Q and cash rewards had her hand at the most. The strongest force Paul Taylor Donna and Tracy thank you. You guys came up on we hosted the D5 business Coalition. Our district has a business Coalition that we created three years ago and you guys have been very active in the local chamber helped us put that together. You guys are being very I had three hours with you and you are a lot more vocal than you're doing right now. So I was kind of hoping you'd fire up a little bit. I know that in that 3-hour meeting OED was there Pedro was there and well as Marty was there and gave a lot of information and you had a lot of issues that went beyond just the taxes and policy when you were concerned as small businesses why she also may just had this we also had a net of their who owns coffee clash and who else was in d5ns. I said who owns the Nexus Hotel in the saffron Grill who actually hosted that and they are stalwarts and RD 5 Business Coalition, but I remember distinctly a lot of the issues. I took really detailed notes as we all did Machine and I but besides the policies and the concerns you had about the business and the taxation is c c i o e d o l s. Do you had concerns about how we are handling the homelessness issue how we are handling the unsheltered people and how you were trying to react to that and how we were trying to get out there when we are working with people who were intense in living outside of the bit particular at the Nexus Hotel to Clover leaves to Starbucks the Quarry drive I could go on and on about all those businesses that were there the saffron Grill and I know that you guys work closely with the knob team is as well a lot of you share that with us at the meeting and so I'm glad you're here. I'm glad you're here with my colleagues to to be candid and open in about some of the other struggles that you deal with. I appreciate that you laid out the your strategies and goals and when your reports are all coming out, but I know that you have this frustration and I try to carry this back. My colleagues as well. So I was hoping you can touch on just be candid in touch on some of the issues that have did, cuz you were very clear with Marty about some of the issues you had you were very clear with LED on some of the issues and with me about some of the issues that you had and I was hoping you would share some of that with my colleagues as well since I I got a earful for 3 hours because mine cuz I got to thank you. I would just like to start by saying if there's anything that we've overlooked it's not from a lack of a willingness to bring it up or lack of Candor. It's more so from there such a long list that as we approached discussing it. I don't think I mean the three of us have no problem being candid and saying what's on our mind and I think that we are coming here today and we're talking to you in general and we started this become a part of this as back because we care. So deeply about small business and we care so deeply about its presence in our city and the fact that small business is a fabric of the city if we were gone and we just were city of big corporations Seattle would not have the personality or the attraction that it does work. We're committed to the city and to what we do as a business. So for me not to bring up homelessness, it's not because I don't care about it or it's not on my mind, but it's more that I had this list on my mind and it is a big issue for us. It's a big issue because we have a lot of constituents that talk to us about not being able to enter their businesses because first they have to remove some people who are blocking their door. It's an issue because we've got a lot of people that used to come to our businesses from outside of the city that have stopped coming to our businesses because they don't appear clean anymore. There's such an issue that it's really large. It doesn't mean that we lack Compassion or that we don't want to do something. We're also struggling a small businesses. So we're not sure what kind of assistance we're going to get her or how these items are being addressed and we've seen some of the same organizations deal with this topic without much success. So we're concerned about more money going to some of those organizations and seeing the same kind of lack of results. So as we can we start doing some lightning round questions and answers just let's just bottom line one another because I wanted cuz I have a few bottom lines as well. So short a question shorter answers if we can if I could still bold to say that we did have a really great conversation at a lunch and learn last week with the directors of organizations that you support. The the Bia director's came in presented to council member. Gonzalez and myself and had a discussion around some of the prolific offenders issues that that that you raised. So there are lots of different places to have those conversation and they need to be happening everywhere spank you I had opportunity over the weekend to talk to a person who considers himself a small business owner. Although it is he has a owner of some restaurants that are also part of a franchise but he shared with me and experience that he had enough of this is a business owner who supported the minimum wage support a paid sick and safe leave our support secure scheduling but he had an experience with the office of labor standards for a receding up a pretty big fine after some rule changes. And I know you had OLS at a recent meeting and I'm wondering if the topic of notification of businesses of rule changes came up. It seems like FAS has a database of all the businesses in the city. Could be using it when those changes happen. We did talk about that. And that was that was definitely part of the conversation. What's the process when a complaint is lodged and what sort of notification that is the business received cuz I too have heard a horror story from somebody who runs a small business that was taken by surprise and it was pretty awful the way it was handled. I think also what came out of that OLS conversation and is something that we've always known the well as office is in charge of both educating and enforcing and that is an interesting dilemma. So they're taking the complaints they are responsible for educating some of the businesses that are responsible for getting the information out to employees and they're also in charge of starting that process when they receive a complaint That can be a little bit problematic if that path isn't clear. So that was part of the conversation aren't they in theory supposed to be on the business has a completely neutral party or LS is is that sort of a rubric? Yes, and you know, I think we heard that and it was a really good real best conversation. We all left that conversation feeling a little bit better. But knowing that we needed to have more communication. What I've been told is the practice of enforcement peace does not seem like it's a neutral party. Is that consistent with what your kind of heard? Yes. So customers go to elevate the example. I think you gave on tips and service charges in the original minimum wage statue has a really great feeling and everytime legislation passed. There's always a need to go back and make sure that you're fixing to I'm concerned that come up on intended consequences one really important thing that the small business community did here in Seattle is in form an issue 14 33 at the Statewide effort because that tips and service language was pretty ambiguous. It left a lot of people wondering what do I do? And even those who are doing the best they could to comply or left in this very interesting gray area. So what we did with many of those individuals from the small business community in Seattle was to help write in language and initiative 1433 that directly improved the language so that across-the-board tips and service charges were equally or I should say equitably understood and that gave some guidance to small businesses. However, I worked on that in 2016, right? We are very happy to have that passed. It wasn't until this year in March that the final rules came down from Labor & Industries at the state level. I'm in some part of my big question 200 LS The state level will be how are we communicating this back out? Cuz now 3 years later plus actually if you think of it from the city of Seattle example, now we have information in the meantime as commemorable dead other friend who owns I'm a number of small businesses here in Seattle and she got caught in that gray area got hit with a fine a very significant fine because just because the language on her receipt wasn't clear enough the workers were actually getting 104% of what they should have been in terms of tips and service charges, but the language the court decided wasn't clear enough that just feel so unfair. So I just want to emphasize. Thank you for continuing to bring these issues forward because I do think that if it doesn't work for the smallest business, it will never work for the workers and elevating those concerns is something that we have to do through the legislative process. Is there a question in there? Don't you think? Say agree. ascend I also I mean to have a wellness in the room last time and to have 25 small business owners discussing one small policy issue, which many interpreted different ways and l a o l s to not have like the hard-and-fast answer on that was very eye-opening. So what happens to those businesses that don't have the access and don't have those conversations and aren't getting the information. I read everything I can on every policy that comes down. But I know that everyone doesn't have the ability to do that. I feel good picking up the phone and calling and asking questions when I have them but I also know that every small business owner does not feel that way and it is intimidating to call OLS and say, I don't know if I'm in compliance. Thank you for saying that one last item. I think this is similar to Many of our residents here and those who want to visit here in those want to start a business here is the cost of housing and obviously that's connected to the homelessness issue that you all brought up. One of the issues that I hear as we do our district tours we go to a different District every month from small businesses is that many of their employees are not having to commute 2 hours in many of their employees have no access to child care. So they're having to have the stress of worrying if they're going to get home on time for their kiddos and their families and with that type of cost of housing concern that's happening here. I'm wondering if you can tell us as you talk about improving standards which we hear you and want to work with you on for how businesses can operate in the city is the issue of Housing and the need for density in the city something that the small business Community is helping to elevate cuz I think there's this dichotomy. Where was some of the city believes that we don't need density and that's harmful for The way things are or the cold that the character of our neighborhood and small businesses is it is very hard to attract workers and keep workers because the cost of housing is so cumbersome exploding push out of the city has a small business advisory Council have the chance to way into the density issues because I think your voice could carry a lot of weight with combating that anti housing anti density message. I think two things come up from that question one is that there's the homeless issue and then there's also the issue of housing for middle-income dwellers in the city and there is some a lot of support even though it's some there's more needed and there's definitely need for more effective. I'm support for low and no income individuals, but the middle income housing Gap is what's forcing out of the city are Workforce. So we're having a hard time not just maintaining employees but keeping business owners in the city. Who else Fit into that middle-income bracket as well. And as we see rising cost we're seeing basically people and even some businesses. We're going to Tacoma. We're going to rent him. We're going to Burien even going to the east side which is considered like a higher income bracket but more affordable living in some ways and then I think with homelessness, it's really important to separate people that are on this rate because they have a housing issue and people that have mental illness and drug issues. And I think if that's not a clear way of addressing that issue, there's always going to be confusion about what we're doing how we're solving it and what approaches were taking. I think that's key because I think that there's a population that needs a different kind of help than what many people in the city are able to offer Cast member Pacheco, what I'm hearing is just a lot of the intersectionality. I think a lot of the larger issues. So I think that's what my car is really trying to get to is just the issues of homelessness affordability and so forth. One of the things I think what I'm sensing is a big elephant the room is this pain is acrimonious relationship between the city and some small businesses. And I think I'm glad that the chair is here as well to hear this because I think it's important for us to think about what we can do to streamline as well as crazy like a navigation or some form of navigation for small businesses to think about during the budget process, but one of the things that I'm really hopeful that we can kind of focus on at least maybe just as a thing about I know juron mha there was a requirement for development of pedestrians balance to include smallest commercial spaces for more affordable businesses create more space is more affordable spaces for small businesses. I'd be really look I'd be looking forward to just SFS back and analyze those outcomes as mha is implemented implemented so that you can report back to the council so that to see that they were achieving the desired policy outcomes. Are you making fun of me for that as part of the the you-know-what plan that we have just a comment on an observation on what what Donna has said what councilmember Mesquita have said and also can't remember Brian. I think they're at the bigger picture is that there are overlapping issues there's internal external and environmental issues that small businesses face. Yes. It is a great City to have a business because there's a lot of growing city. There's a big population. There's a lot of opportunities but then all of those opportunities come with a lot of challenges homelessness public safety parking legislation policy and environmental issues. These are all of the things that small businesses also have to face and you know is is not something that we're going to be able to attack and resolve in one day. But I think the openness of City Hall to work with the business Community to address a lot of these issues. I think the business Community can be a huge advocate to making these issues to bring to light a lot of these issues and to help City Hall to whether it's to streamline processing permit processing or to address homelessness because we all face that as you know, residence or business owners or our staff and Public Safety offer staff or being able to go downtown to park our car or our customers not come to the city because they feel it's on safe bet you know, and so I think you know, the overall comment I would have is that you know in the willingness to increase resources for small business the willingness to take a good look at what is working and what is not working instead of just saying this is the policy we're going to enforce it. And have an enforcement mentality vs. An education mentality providing more resources weather Willits with o e d or Os to make sure that small business understand a lot of the complex issues. If a director can't answer the question how we supposed to answer the question and working with the business Community to address housing, you know homelessness Public Safety because they are part of the community. They are part of the larger landscape and I think that's that's what you know for my personally being on. Here's what I'm looking for mention one quick thing to just on density. I think a lot of small businesses would maybe be more supportive of urban density. If we saw willingness of the developers and the building owners to rent to commercial space in to reduce basically the obstacle course that they've created to get Elise in those spaces to offer a decent. How to be more open to a small business that is not a chain that does not already have 10 12 15 businesses and to pay that business money to come in but not offered the same basically tenant improvements to a small startup business. The spaces are so large they are we're dealing with landlords and developers that are not compatible or open to inviting small businesses in the city seems to accept the vacancy of any of these buildings while they wait for the perfect tenant to come in and we're basically seeing a landscape of these stents buildings that are completely filled with residents or partially filled they seem active but have empty storefronts and we're just now starting to see some Community engagement with the developer when they're building the site to actually discuss with the What they want to see in their retail spaces, so that would have to change I think before you could get a force of small businesses to jump on and say we'd like that density. Cuz right now we see Mt. Real estate space speak Mr. Jatt Missouri from speaking of lack of communication from us too small business as one of the things that maybe we didn't do a good job communicating is in the mha up selling that we just passed even though it was only 6% of the land in the city. One of the things that we worked on was an incentive to create as more small business retail space on the first and second floor. So they got additional floor area ratio. They got additional height bonus are they got these incentives that they create a smaller butt smaller side so that there wasn't your next meal, right? That's the type of support that we want to provide and I think we're all not many of us were looking at you because this is exactly the type of liaison program that he ran in Portland and so I think we have passed the policy now we need the liaison to make those connections happen. So we taking the policy stuff. I hope that as we prayed that liaison and true connection. Would you continue to hear at the Smart the voices small business Elevate the need for that density? Cuz I think it could be a real win-win and without it. We're just going to keep pushing are small businesses and workers out of the city just don't tell on that really quickly as he is. He were speaking I was thinking about the fact that we did recently make this change around density and sort of the focus around Urban villages in particular. So even though there's only a 6% density increase Citywide through this new ordinance, you know, it is funneled and targeted in a lot of urban Villages which is where a lot of our small businesses are currently located and I think this council is very aware of the development pressures that that exist. It relates to commercial affordability and the footprint or the space that is there that are being developed in in ordinary course of business developers does not and would not meet the needs of a small of a small business and that's just that's just something that we were aware of and that we heard through a lot of the feedback as part of the mha legislative process and I believe that now the legislation that is that has passed and is now in implementation phase really does take into account in a more deliberate intentional way the retail space needs and restaurant space needs of small businesses throughout the city in those High concentrated growth areas that are Urban Villages that really are sort of the spine of this Urban Villages is our neighborhood business at districts. And so hopefully you will begin to see a change in in the next couple of years. It can't ever Turn off and I recognize that right. We have some grandfather projects in play in the pipeline that will not be subject to this requirement. But my hope is that in the future is permits begin to come in. There will be a real opportunity to create that pathway and that Runway to allow for more accessibility and opportunity to small businesses for that space. Then I'm looking at Bobby cuz I know that I had a meet and greet commercial affordability for small businesses in particular my own husband works in restaurants and just opened up a restaurant with with Mike Easton. Who is the owner of Bill corvo now of El Nino. I am smelling blood and I recognize the difficulties around permitting and Commercial affordability and also, you know, it's not a binary conversation. We also have to realize it a lot of hours. Small businesses rely on good labor, and we have one of the if not the most the lowest unemployment rate in the country. That is both good news and also bad news or tough news for employers were looking for talent to deliver the services that you all deliver every day. And so I think it's important for us to make sure that we're not having the conversation and isolation of all of the various parts of a formula that are really key and critical to a successful business model and that includes people as well as space and as well as just the general environment to ensure that people are able to enjoy the services and that you offer every single day. So I'm looking forward to continuing to have those conversations as is this plan unfolds. We live all of that every day. So we have a Schedule for bringing this to our attention having this discussion. It's really time to because one of the one of my takeaways is as we enter into our budget system. I want to recognize Pedro Gomez here from old lady is well now that we certainly donorship of the issue and that we need people and resource make sure that who is responsible for making sure we have this this Advocate and leader or someone that can ensure that we have a very strong climate for small businesses who who owns it sort of speaking. So I think we're going to try to come with some creative ways to make sure we have ownership of the issue. I can tell you some horror stories on of constituents in my district district 2 on their dealings with OLS years ago. We created a a position in the shell off civil rights. When we started looking at many of our Progressive civil rights legislation that they said well can we have something in there that gets rid of help navigate to help with a conversation? But again the experiences with oil that's this is who supposed to be so bad neutral party, but that doesn't seem to be what we're hearing in the field. And so I'm incredibly concerned about that. I would like to say cuz I feel like I just threw away last Center the bus Marty came to our meeting and it just having that conversation clear the air in a lot of different way. So I think that they recognize that and they're striving to do better to I just I wanted to get that in their conversations really good timing for us to think about how we can be good partners for you. So I want to thank you again. By the way you had a slide thing. It is not voice activated had to press the button but we know it was there at the point you had we didn't move from slide. So are we okay everybody good any closing comments about Okay. Thank you very much. Thank you. Okay is presiding officer. I am announcing that the city council now convene an executive session and the purse of this executive session of Scots pending potential or actual litigation and this executive session gives us an opportunity to discuss confidential legal matters with our city attorney's is authorized by law and legal monitor from the city attorney's office is always present to ensure that answers questions of policy for our public open sessions this session to last for 15 minutes so at 11:23 24r at 11:24. Hopefully we will be completed and if we are not I'll go in the public session and extend its duration of that lives movie.", "end_time": 5807.7}]}