{"format": "raw", "annotations": [], "confidence": 0.9376233798220641, "data": [{"start_time": 0, "text": "Greetings and welcome to the June 4th meeting of the Civil Rights utilities Economic Development and arts committee. It is now 5:34 a.m. And I'm calling the meeting to order. I am Lisa herbold. I'm the chair of the committee as well as the council member that represents West Seattle and South Park like to thank my co committee members for joining a steak on from Brazil on cast member O'Brien and thank you as well to cast member to check before joining us before we begin the public hearing. We are going to start with an overview from Council Central staff the schwitzen and he will present a brief summary of the legislation which extends ordinance 126560 by 6 months. He will present the map of the interim boundaries and the study area on the map just as a little bit of background. The department of neighborhoods is doing work to implement ordinance 12656 0 which called specifically to review the historic significance of the Showbox theater study the relationship between the Showbox theater and the Pike Place Market consider amendments to the historic district designation or design guidelines are related to the Showbox theater draft legislation conduct Outreach to stakeholders and conduct a State Environmental Policy Act review on the permit expansion of the historical district as appropriate number of people been writing to me today and other council members about the work that the executive is doing to look at the permanent expansion of the historic district. We today are only here to review an extension of the temporary expansion and the Reason why that's important. Is that a number of people are writing concerned about the proposed permit expansion because the executive is looking at other properties as well and will at some point in the next couple months make a recommendation to us, but we are not doing that today. We are only looking at an extension of the temporary expansion to only include the Showbox property within the historic district. So, you know again that the department of neighborhood consultant is looking at the stretch along 1st Avenue that was originally proposed but not included in this legislation after the after completing the review the executive will publish a seatbelt threshold determination. And then the next step would be for the mare to transmit the proposed legislation to the council. So I was going to clarify that because we're getting lots of emails today with some confusion about what this particular piece of legislation do. Can you hear me? So the legislation is fairly simple. It extends by 6 months ordinance 125650 that ordinance included one parcel shown here on the map which is the parcel on which the Showbox theater exists to the Pike Place Market historical district the effects that any changes that building while the legislation affect would need to go in front of the Pike Place Market historical commission for review and approval. That legislation was adopted last August went into effect last September and lasts 10 months. So it will expire in July of this year. The legislation front of you would extend that time until January of 2020. Well, if there are no questions from council members, I think we will open up the public hearing we have about would occur if the if we do not renew the extension developer could apply for well. The site is will be considered for nomination as a landmark tomorrow at the landmarks preservation commission meeting. and so depending on the outcome of that things could go into different ways if the landmarks preservation commission decides that merits designations The Landmark than any future changes to the site would need to go in front the landmarks preservation commission for review prior to any changes to the building if the landmarks preservation commission decides, it's not worthy of being nominated as low Landmark then developer could go to the Seattle Department of construction inspections and apply for a development permit that it could include demolition of the structure and I think another maybe more I think straight forward result of not passing this extension is simply that the council's intent when we passed the law in August of last year under ordinance 12656 0 the council the intent of the work that the department of neighborhoods is doing right now what would not be able to take place if all of those things happened outside of the expansion of the temporary boundaries for the for the market? Amber O'Brien, I just want to let you in the public know I'm unfortunately I'm also supposed to be in a meeting upstairs move Seattle Levy oversight committee meeting and so I'm going to stick around here for just a couple more minutes and then I'ma need to scoot off to that and I hope to come back by the end of this meeting to so I apologize that I'm double-booked at the moment. She's for double booking you thank you to her gold. Yes. I I really wanted ecowatt customer herbo just said that there was a commitment in a mandate and Ordnance for the council passed last August to do the work plan. That would avenge mean the whole purpose of the war plan was to go towards a temporary. I mean apartment and expansion of the Pike Place Market to include the Showbox and I genuinely believed that the council needs to fulfill that commitment and and and those studies are happening as we speak and we're supposed to get results very soon. And I also wanted to take this moment to thank the hundreds of people some of whom are here today, but many many more people who helped fight to bring us to this point. And so let's keep it in the mail. I ain't right. But with that I will open up the public hearing the public comment period is 2 minutes for individual speakers. But if people wish to represent a group of speakers your time will be again as a group it send it to 5 minutes Aldrich will be keeping time. He will live the sign to let you know when you have one minute when you have 30 seconds. And when your time is up and then there are also there's also the the the timer that keeps time as well to help follow along that I'm going to call the first two speakers up to the mics If people could when you hear your name not when it's not don't wait till it's your turn. But when you hear your name come up to one of the two mics that will help us move things more quickly. Eugenia will be followed by Naomi West. We're representing historic Cialis or we're going to split our time in. This is Naomi West Seattle wasn't many voices in the historic preservation Community. I want to thank the council members for your time and and service to the city last August the city council made a bold decision to temporarily expand the Pike Place Market historic the straight to include the Showbox property. We support exploring expanding the district be on the show about to consider more properties on the east side 1st Avenue. We understand that this is specifically about the extension today. The market does not exist as an island. It is part of a larger neighborhood the show bosses part of that Community as an organization that submitted the landmark nomination application with Arco nominators Vanishing Seattle and Friends of historic downtown. We researched the history of the Showbox, which was originally known as a Central Public Market built in 1917 10 years. The market was established in 1907. It made sense that after 10 years of existence that market uses will expand across the street in 1939 the building transformed into the Showbox Ballroom. We fully concur with a comment letter from Friends of the market regarding this issue. The city needs more time to conduct his due diligence in this process is story Seattle supports the six-month extension of a temporary District expansion in order for the study to occur properly. We hope the city's consultant hired to study the expansion will contact us because we believe we can provide valuable input in this process to date we have not been contacted and says we are the ones who do the research on the historical research. We think we can provide some really valuable information to the consultant and he was Naomi who will speak to other aspects of the Showbox and its connection to the market. Thank you. I'm Naomi West I'm asking you a city council members to extend the temporary expansion of the Pike Place Market historic district in order to allow the city's Consultants more time to study the feasibility and value is permanently including the Showbox and perhaps other buildings along the east side of 1st Avenue over the past several months. Here's what historic Seattle has learned through our Outreach all of the Pike Place Market directly benefits from Showbox because of proximity Is thriving Showbox is inextricably linked to a thriving Market 422 artist performed at the Showbox last year alone and those bands love to head to the market to explore upon arriving in Seattle bars restaurants retail spaces hotels and coffee shops all benefit from Showbox visitors who like to go out in the neighborhood before they attend to show annually the show box springs a thousand people to the area approximately 200 nights that's 200,000 people who are spending their hard-earned dollars in and around the market each year. Is data points aren't new. There's an 80 year history syllabus local impact the venue also provides 200 people with employment as a wise man named Ben Haggerty AKA Macklemore told us in his statement on this issue. The Showbox is also a venue that is critical in attracting many national acts trout there tours through Seattle losing it would mean fewer shows. And lost revenue for our city. Macklemore went on to say as our city continues to grow and density. It's imperative that we protect the spaces that gives Seattle is cultural identity. This is true of the Showbox and it's true of other important places in the city, especially in communities were displacement gentrification are dramatically reshaping neighborhoods. If we value our musical Heritage, and we want to leave the Next Generation with a piece of authentic Seattle. This is our fight we couldn't agree more with Macklemore and we argue to vote in favor of this needed extension. Thank you all for your time and for your service. Cake Craft will be followed by Shannon Wells. Hello, I'm Cake Craft. I'm the president of the friends of the market and we submitted a letter to earlier last week. And I trust you had an opportunity to read it. I'm here to again convey our strong support for the proposed six-month extension of the interim expansion at the Pike Place Market historic district to include the Showbox theater. I assume you do know who the friends of the market is, but I'll just remind you. We were established in 1964 and we spent seven years are fighting to preserve the Pike Place Market from downtown business interests and City supported urban renewal proposals. We spearheaded the passage of the public initiative in 1971 that now preserves and sustains the community and the Pike Place Market. We continue to serve an important role in the ongoing real bit Rehabilitation and the preservation of this extraordinary historic district. The prince of the market believe it is feasible and appropriate appropriate to seriously consider the expansion of the historic district to include the Showbox. But to also include other historic properties along the eastern boundary of the existing District. I was surprised just now to hear the distinction between the work of the executive and Ein and what I thought was Council funding for $120,000 study. For the expansion of the district. So some of what I'm saying may not be entirely appropriate. I want to be clear the friends of the market believe that the district should be expanded beyond the simple addition of the Showbox. This concept deserves serious professional study not just a public relations effort. An in-depth analysis. Neither of these things seem to have taken place. The friends of the market have not been contacted by idea when or by the exact so many times the six-month extension for at least the Showbox is absolutely necessary and essential. Thank you your time is up. And just before you go out. Maybe I wasn't clear in my opening comments. We are receiving testimony written testimony from people opposing expansion of the market beyond the single. Piece of property that this current temporary expansion incorporates we are going we have legislation before us now that only expands The Foundry on a temporary basis for one piece of property the work that the executive is doing is not inconsistent with the ordinance that was passed last August. I just want to be clear because people are contacting us worried that the vote that we are about to take is a vote to expand the market to include properties other than the Showbox that is something that we will be considering later after the executive continue. I just want to be clear the friends of the market supports serious examination of all of his story properties in Parcels between union and Stewart and we expect a professional thorough examination and study and the friends are ready and willing and eager to We have members who are very knowledgeable and we're hearing loud and clear that people haven't been contacted. So. And Shane will be followed by even having sex one. Good evening. My name is Shannon Wells and I'm a longtime employee of the Showbox. I'm also speaking today on behalf of friends of the Showbox, which is a Grassroots Community Coalition dedicated to saving the Showbox and I also would like to thank council members her goal dance want for your continuous support on this issue the friends of the Showbox strongly supports the six the six month extension of the ordinance that places the venue in the Pike Place Market historic district, the ordinance laid out a plan for the Department of neighborhoods to study the historic significance of the Showbox and its relationship to the market. The city was to have conducted I reach the stakeholders by April of this year. So I'm also going to say the same thing is that we have not been talk to you when the city hired the consultant to do the work does not appear that much work is actually being done the original meeting that was scheduled on May 1st with some of the stakeholders was canceled and it has not been rescheduled. So no stakeholder Outreach has occurred at this point. It is unacceptable for the ordinance to expire without the study or for a rush study to commence. Sweets before the deadline. We want a professional in-depth analysis that was laid forth in the original ordinance. We understand this takes time for this reason. We are city council to approve the six-month extension to ensure the matter gets the proper analysis over the past 9 months. The community has been organizing in the absence of Duty action on this. We stand ready to engage in the process with our historical knowledge and expertise and with our lives experience in the market neighborhood over a hundred and eighteen thousand people have now sign the petition to save the Showbox. It is an icon of Seattle and an important player in Seattle's music ecosystem and in the Market's business today our relationship extends back 80 years, please let's take this seriously and extend the ordinance so that we can study the matter. Thank you. Following a time is dr. Robert Walsh. I'm here on behalf of rise up Belltown but 2 minutes is fine. I am sure to speak in support of the ordinance to extend as the proposal to extend this ordinance by 6 months. I also want to say I am expecting my first child literally any moment and my wife and I are she's six months of a set size unit 6 days overdue at this point. We find ourselves thinking a lot about what type of City we want our child to grow up in we think a lot about what it means to grow up in a city that's committed to progress versus a city that's committed to culture and how we find the balance in between as you consider this ordinance. I would ask that you think about what the very basic non jargon political requests that you're being asked and that is 4 time time for people in the city of Seattle who want to think about how that balance plays out in their own lives and how it's going to play out in the lives of their Can talk time for us to talk to each other. We have written you a letter and several organizations connected with the market and with a nearby neighboring organizations and was in that letter we try to make clear that what we need as a community is this time and there a lot of considerations up play you'll hear from a lot of folks that are concerned about any today about whether the Showbox should be saved or whether the Showbox should not be saved and ultimately that's not what you're asking you for today. When I asking you to do this for the deep thinking about what the final solution is, what we're asking for is another six months because the work hasn't been done yet. So I appreciate your time. I appreciate you being here and thank you for giving us your consideration. Calling dr. Welsh is Emily McArthur Council for letting me talk and I want to apologize cuz actually this talk is was designed for the summer. I didn't really know what today was about. But anyway, so this is whittled down for a minute. I should be able to get it in. I've lived in Seattle for about 32 years. I've lived in Seattle for about six years one of my passions his music and I first started going to the Showbox roughly 20 years ago. When a friend of mine surgeon, dr. Denmark has introduced me to it and I fell in love. It is a landmark weather it gets designated or not. Its location in the market. It's classic Marquee its guts and its history no venue in this city. Pears and I've been to most of the venues in the city of not all of them this weekend. I stopped huddles. Wonderful pity party puddles had everyone leaving the venue with smiles where will puddles and all the other Talent, which is actually you need to this. Then you perform next year the venue allows entertainers worldwide to enter the Seattle Market at its size all this will be lost Seattle memories once, there will never be another Showbox. The rent is just too high Highway 99 Seattle only Blues Club, unbelievably the only Blues Club in our city another casualty of this City's growth. I hope the city council can find a way to keep the special than you and all that. It brings to our city. Thank you. Thank you. Following Emily McArthur is Keyshia core fighting to be part of the movement to say the Showbox And to clarify that this is not a fight of housing versus music. This is a fight for the cultural heart of our city against profits just the other night. I went to see a show at the Showbox with five of my friends as we left. We realized it was the first time that any of us at all hung out together outside of a work. That's the power of a cultural landmark in the city right class person a night out is precious few and far between play sounds good shockingly is rare. I think we just need to fight for the right for Working Class People to not just exist and work in the city, but to actually Thrive and be dynamic Play the place that they live. You know, how many people I talk to a union member in the audience before we started today and we talked about how the majority majority people who work the doors at all these venues in places in in Seattle can actually afford to live in the city. Of course that's also an issue or we need to be fighting for housing alongside the preservation of our cultural landmarks. What is a very basic duty today to vote to extend us the time on this ordinance. We having accomplished the promise goals of proof what an awesome even know the word that I'm looking for a just peace and heart and soul of the city of this this Landmark is and so do dollar lawsuit from a billionaire. Following Misha. Dimora is at Emerson Johnson. Hi, my name is Misha. I'm a local artists and have been a theater and venue employee and the Seattle for nearly 20 years that includes venues such as McCall Hall Benaroya Hall 5th Avenue Theater. And of course the Showbox thank you for your efforts so far to save the Showbox. Your continued efforts are sending a message to Seattle and the rest of the country that we are more than a corporate welfare city of corporate wealth you're saying we are strong creative and courageous people and that our entertainment history matters. History song with jazz Vaudeville burlesque and of course grunge and Olive Seattle working-class No Frills Glory, all of these things have happened at the Showbox, by the way. So let's extend that protection and at 6:10. Protection to save the Showbox and show everyone. We're about so much more than luxury apartments, and we've earned the title of city of music. Thank you. Following emerson-johnson is Ernie Ashwood? My name is Emerson. I'm a member of socialist alternative. I don't want to thank the movement who is here who has stood by to save the Showbox as well as a council member, San Juan and Michael Brian for taking leadership on preserving the cultural diversity of our of our city. I want to call on the council today to pass the six-month extension and stay on with our movement demanding that are City put culture and people and arts over the profits of a developer. I think the reason that we see such he was huge support for a save the Showbox 118000 signatures worth of support for saving the Showbox in multiple times. The packing on city council is because working people in Seattle are sick and tired of seeing the seat of the city prioritize, you know. Pets and wealth of a very, you know, small margin of people over, you know, our lives and almost every single sphere of our lives and I think this move is part of a growing fight back of people demanding that the city and our city council make Seattle affordable for all which is why I think that we need to link or fight to save the Showbox onto the fight for rent control and attacks on the wealthy to massively expand the amount permanently own deeply affordable public housing that we have because it's not enough just for artists have somewhere to perform. We need somewhere for them to live. We have so many young artists in the city who want the ability to someday go to the Showbox and have their name on the Marquee, but we can't do that if there's not housing for them. So I went to call on us not just for our movement to move forward on saving the Showbox but to join with so many other activists in the cities were fighting for affordable housing to come out on July. For rent control rally and take show save the Showbox to make Seattle affordable for all. Following Ernie Ashwood. We have Megan Murphy. Thank you very much for your time. We really awesome. Thank you very much for your time. We really appreciate you guys taking the time out to read listen to us. I really haven't had that offered much of an opportunity to engage with city council before this issue. So you guys giving us this time to really hurts. It's really really important to us. I'm not here to ask you to make a decision right now regarding saving to so I guess that's not what this is about. This is about the concept of making an informed decision. Repeat that this is about making an informed decision and it's been made it extremely clear today through people that I've had the privilege of working with that. There is a lot of resources that have yet to be tapped for information including the Showbox itself. It is hard I believe right now that if you guys were to go into making this decision at the end of July, it would be an uninformed decision and we all know an informed decision is the best decision. I'm asking you to please give us exactly what's been asked for multiple people that have stayed in front of you. We just need more time. We're not talking about time to procrastinate were talking about time to learn we're talkin about time to really establish. What's the right course of action to make moving forward, but we can't do that under a crunch. Not only am I asking for time I'm asking for more support to really really stand up the mayor's office and ask him for the real support to really stand behind us and really provide more information. Again, I'm not asking you to make decisions today about saving the Showbox. I'm asking you to make the decision to increase your time to gather more information under more information. I think we can decide what's the right thing for the future of the city. Thank you very much for your time. Megan Murphy we have Nick. I think it's hard to tell. Thanks for letting me talk. I were standing on indigenous land as as I speak. We drew boundaries and these boundaries developed in the cultural spaces where people can perform as I was working towards my studies at the school of the Art Institute of Chicago. I lived at the three Arts Club for women with that was considered a cultural Landmark on 1300 North Dearborn founded in 1906 for emerging emerging women artists and men were allowed to come in. The summer is the most of them were from Europe and they gave me a job at the front desk right before September eleven 2001 and I admitted ballet dancers composers painters Hard Rock performers all women and like I got to check them in and give them their mail and it was it was awesome. I heard these voices that were may be considered mainstream friends. They didn't like Broadway production. Some of them some of them were in Broadway production. Some of them were mainstream and some of them weren't and as I work there for a year. Everyone's like a wicker Parks getting gentrified wicker Park's getting gentrified and there was a scare so they close the Jane Adams house down the street and then these like Bank people moved into the three Arts Club and they made a woman who was like in her sixties with cancer leave and she was just phenomenal New York artists and then they said well, we're no longer for emerging artists were for mid-level and like it became more exclusive and my awesome sweet deal which help me graduate was gone my housing. So we were scattered. But while while our voices had a boundary the art scene was rich and pluralistic and we we had multi-dimensional and as I understand the Showbox is Affordable has a wide plethora of like voices and of Music & Art and it's a it's a landmark. It is a cultural landmark. And I hope just like the three Arts Club it stays preserved. Following neck. We have Lauren Rice. I think you very much for your time. I'm here. I'm speaking on behalf of friends of the Showbox as a long-term Showbox employee coming up on nine years. This September. I were here to show you the we're doing the work the employees have been organizing. We've been showing up trying to keep the motivation of everyone knows what needs to happen with the Showbox. We're just trying to find the path that works. We need the city to do the work as well as we're here. Just keeping everyone honest. We look forward to extending out of the ordinance so that we can have another 6 months to determine what we already know how Showbox Market fits into the market but we need to put the facts to that where the quantitative part of a process that everyone recognizes qualitative the whole way. It's the cultural significance of the building either really drives home why we need to save it and pick you up on the last speakers point I think about how to describe this in those terms that Seattle is the city that is has the story of disc. Fashion of being on Coast Salish land and still draping itself in that identity while the same time those those people have fallen by the wayside with the city just turning a blind eye over and over again, you know letting the draining the lake letting little crossing over Place go try the veal beds deal grass beds. The mussel beds that have long been forgotten in Seattle. We ended up at taking what made the city you just so have a little and then letting it all just disappear in the name of progress and there's there's a parallel to that now the city once again is draped itself in this identity of this culture of musicians and artists and being welcoming and you just hear over and over again wasn't a possibility that can be for so many people But we still have hope and we still have a few and safe spaces for those people that are dispossessed of their are in their culture and Showbox really is is the Crown Jewel that in Seattle. Thank you. Following Lauren Rice is Nate on doll. Hello. I'm at in Florida Diamond Showbox employee. I'm going to keep this nice and short because I do have to go ahead to the Showbox market for work here in a moment that like to ask you to please consider a six-month extension of the ordinance that places the Showbox in the Pike Place historical district. As Ernie said we do need more time to look into the best possible solution to keep the building and preserve it as a parts used for shows for generations for Betty more generations to come Alex have kids no more kids one day if he shows there and the Showbox and the market have been intertwined for ever since the Showbox built in 1979 1917 as the Central Market and later on became a ballroom be bringing theirs was last year in 2018 yet 422 shows. Therefore they bring you roughly maybe about 1202 without thousand people for show and they bring businesses open Christmas to all the business for the market that's employees. Also, enjoy the market and going to The Alibi Room. Urgently * after show the please consider the extension and so we can find the best possible fast path moving forward. Thank you. Following Nate is shua Sanchez. My name is Nate on doll on the lead organizer with the musicians Association local 76493 and I'm here to encourage Council to adopt the six-month puzzle in my line of work. I hear an awful lot about how difficult it is for musicians performers in this community to keep up with inflation and displacement and just all the rising costs associated with living in the city and the thought of having one of our main venues in the Heart of the City be replaced by something. That's not a performance space would be very very dangerous is a very fragile performing Community as it is and I would just urge counseled remember that. This is a very direct way to send a message back to the Performing committee that this is indeed the city of music and that you will fight for Tremaine. Thank you. Felicia Sanchez is Wesley Tucker Hey Abel. Hi Lisa, I don't think we know each other very well. I'm sure I'll Sanchez. I'm in organizer with that UAW 4121. Yep. Yeah, so I'm here I suppose representing the 6,000 people in my union that are scientists academics researchers Educators at the University of Washington. And these people they are for the most part not from Washington. They could do their research anywhere in the country, but they choose to come to Seattle to do their work and to be their studies here in to teach the end. You know, why why do you think Lisa? Because it make this part of the economic fatality of the city because it's a beautiful city. Right? And it's a it's a cultural city zoo with a really deep culture and in particular the music culture. That's a big part of why I wanted to come here, right? So, you know, when we think about these people that are moving here and they finish their schooling at you dumb and they start, you know, a friend of mine started a biotech company that now has over a hundred employees at it. Right? I mean, they're building the local economy, but they have to get here first and they have to want to come here first and this is true of the tech workers. This is true of a lots of the different types of people that are moving to the city right now. So this needs to continue to be the kind of city that people want to move to for us to continue to grow our economy hearing grower City here. And I know that this whole fight it's being framed around this issue if we need more housing, right like the proposal is to destroy the Showbox and then build some condos, right? Well the kind of housing that we need and I know that you know this very well. Decatur housing that we need are for people that are making under $100,000 or under $50,000. This is not pausing that wouldn't support people like that. So we're losing something that draws people to the city. I'm exchanging it for housing that we don't need right now for that kind of upper income level and I've got a few seconds left. Have you seen taco cat before? Have I seen tacocat? What do you know? What is your question about tacocat who played at the Showbox on Saturday? Okay. Yeah, so I got you an extra curricular activities navigation through November this year, but Alright. Thank you. And I just want to add I I moved here in 1992 with musicians. I am part of The Exodus of folks who have come here to the city for its music scene. Kobe followed by John Brewster Fischer Studios building a historic register landmark in downtown Seattle on 3rd between I'm here to lend our support in the extension of the protection of the show box so that we can spend more time determining if the Showbox is a significant cultural site. So I want to ask you what is a significant cultural site. Is it a full of right and light and science? Is it a place for generations and presentation to make us who we are when we go there to see a star or visit a barbed what we tell our friends and our kids and our neighbors to go there and share and all that it is when you comers coming to your city looking for all the things that are pretty will they go to that site and safe. Holy cow. Look at that. What is sing bling bling bling? That's the Showbox are significant cultural site full of right and lights and sights. It's who we are is who we want to be. So say it with me save the Showbox. Save the Showbox save the ShowBox a significant cultural site. Thank you. Following John brister is Jeremy Oden. Hello, I don't know what I'm going to go with this by expanding the study you guys are doing this is we're going to go back and forth. Do you guys have The study was funded in the 2019 budget so I can give you some more information concerning baby Master. You know, she had was only bad the white man here 160 years. I don't know how long I might be cheaper in the long run. I don't know if this is relevant, but I'm starting to feel a little bit maybe like a left like a native people. I grew up with most of my friends have people that were here from the early 1919 20. Small amount of time is cheese changed a lot and I don't know if there's been a lot of consideration for the Fung shway the group of how it is. If you put that building that you can hire me for five bucks. Yeah, so I don't know. It's just I don't even know why we're even having to have this discussion. Cars, and I just came from the Lummi reservation today to come down here and talk and then Thursday Thursday Friday 2 weeks later for the burning my reservation for me. Following Jeremy Oden is Amanda Parsons? Hello, my name is Jeremy Oden. I am a union stagehand though. I am here to share my personal opinions. I'm not here as a representative of iatse. I absolutely support this ordinance because I support the Showbox not only because it's an amazing historic institution. But because the loss of any performance venue is a loss to our community as a whole as someone said earlier. There are 200 ish people employed at the Showbox some of which are stagehands and all of which are my brothers and sisters regardless of whether or not they're in the Union. And they would all be out of work at the Showbox closed. I mention this here not because of this ordinance per se but because of what may come farther down the road according to the summary in fiscal notes. There's no financial institution financial implications currently, but if upon the completion of this study, it turns out that there are financial implications. I strongly urge the city to require a labor Harmony agreement to protect my brothers and sisters employee of the Showbox from the employer's managing. The space agency is an international company that may not have their best interests in mind their interest may be more in line with the Sons and Daughters of the profits that built our city and while we all love Seattle, I think everyone agrees it was a bit of a bumpy ride to get here. Seattle is the people in it and we can't allow large companies with no vested interest in the people of Seattle free rein whether that be a g or a land developer requiring a labor Harmony agreement ensures that companies like AEG that may be receiving City funds either directly or indirectly are required to negotiate in good faith and provide their employees Fair wages and safe working conditions to continue being amazing music and performances to this people of Seattle. Thank you for your time and your service. Amanda Parsons will be followed by David Price. Amanda Okay. So Amanda Parsons doesn't seem to be here. So David Price will be followed by Heidi Deandre. Davis already signed out I'm sorry. It's 2 minutes per individual for the work you're doing and considering what's before us today. I'm fortunate to have a job and I'm independent and the reason why I'm independent is because of the art community that supports what I do. I've worked at all a lot of the venues in town and I just a little brief history about a couple of observations. I've had when I first moved here. I watch the Showboat Theater on Lake on the canal on the cut. Pad in their possession and it was a WPA building building built back in the 20s and 30s. Lillian Gish perform there there were you know, I'm sure all kinds of amazing things that happened in that building probably most of the people here up. Hopefully somebody like you remember that building but that buildings long gone because of the shortsightedness of the u-dub and it was probably the most beautiful theater I've ever seen actually broke into it because it was boarded up. I wanted to see what was inside and crawled in there and I couldn't believe my eyes revolving stage quarters for the for the production folks for the stage manager just beautiful woodwork throughout and they had her no, maybe $300,000 to do something with it and instead of using that money to ultimately they took that money and demolished it. That's a piece of History one. Very incredible piece of history is gone. We can't do that to the Showbox the extra time to consider this Landmark. So please vote because these little jewels that we have or what make this city and if we keep losing in the city's just going to be sterile and it feels incredibly sterile right now and vacuum vacuous and when I walk down Belltown it's dark and there's no sunlight coming in because all the buildings are all everything's push it to the limit. So that kind of mentality will just destroy this town. Thank you for your time. So Heidi, are you not intending to speak Vern deroche will be followed by Tiffany Jorgensen? Turn here. Okay. How about Tiffany Tiffany here? Thank you. Tiffany will be followed by Kristoff dolls. Hi, my name is Tiffany Jorgensen. I represent friends of historic Belltown. We as a city council to extend the time that the Showbox is a part of the historic district in the Pike Place Market have a third-generation Seattle Light. I grew up here going to shows at places like the rock candy king cat Funhouse off-ramp Grayson Sargon their buildings destroyed their histories lost who can imagine Seattle now. The Pike Place Market 50 years ago was almost demolished 60. Sorry to be replaced by a parking garage if it wasn't for Grassroots groups, like Friends of the market that it would not be here today right now. You are surrounded by the same thing. We've stepped out of our comfort zone to create a movement to protect something we believe is invaluable to Seattle's history. We have one task at the council, but I have to To save the Showbox by protecting its use-by it kind of continued extension of the market line. My other request is for the council to consider changing the zoning directly across from the market as well changing the height allowance to a lower level with not only protects the Showbox, but the Integrity of the market, but the world know we welcome change but love our history to French dinner music. The Showbox is one of the last medium sized venue is left in the city. Please protect it for the future Generations so that they too can be enriched by it. Just hundreds of thousands before them. Thank you. Kristoff dolls, we followed by Jean Bateman I think you to be a city council for a hearing us out today. I'd like to speak my support for extending the Showbox for another 6 months to take a look at the study of expanding the district to another six months as a lifelong Seattle resident many members of the Showbox going back twenty years me and my fiance always make it a point to you. I'm celebrating anniversary by going to shows there is some of our best memories of a shows the Showbox important stuff into slime arts and culture little eyes and it's mistakable link a mistake blank in proximity to Pike Place Market and its surrounding historical district. The several blocks are some of the heaviest visited and biggest attractions to tourists and locals alike tourist want to see you this the storage Showbox and not just another giant hotel that looks like everything else in our city. Pictures in 2018 allowing more than 200 people are 200,000 people saw 422 artist the Showbox. That's a lot of people spend a lot of money that he caused a lot of tax revenue just then then add that to all the tax revenue of visitors in the Pike Place Market General historical district in the city known for its length lien legendary musical landscape in history were slowly lose him any of the places where rich cultural heritage was established and what truly put us on the map and brought a claim to Seattle. If we don't stop to think and consider that culture and history could be losing we will surely regret it in the years to come and generations that follow in the case the Showbox we cannot simply afford to lose one of the shiny beak and that is really seen it all and still stands today as it actually expanding at 5 and City, we have to stand our ground and say what few unique cultural hubs we have left and must not like green and pasta Redevelopment turn a beautiful Unique city into something. We hardly recognized or want to visit or live in We have to work and save all the places that simply make us unique. They Seattle we did it was saving the Pike Place Market we can and must do it again with the Showbox, and we just need the time to to do. So, please give us the time then due diligence. Thank you. And the final sign up speaker is Jean Bateman if there are other folks who would like to speak I request that you line up at one of the one of them likes to thank you for considering this extension. We hope you will vote Yes by the Showbox is woven into the cultural and Heritage tourism fabric of the historic four corner entrance to the Pike Place Market at 1st and Pike the Show Box along with the Han building, which is a working man's Hotel the green tortoise at 103 Pike service historic Market wayfinding buildings are known by citizens and tourists from around the world are regions citizens employees and visitors see that history doesn't stop at the clock these historic buildings like the Showbox encourage people to step across to the east side of 1st Avenue. And to continue on into our city they've been welcoming citizens and visitors for decades and decades. Please protect these building such as the Showbox to allow for authentic and expanded cultural heritage tourism for the next 50 years in Seattle. Thank you so much. We have all week or Rico Dondo. I once knew how to say his last name. It's been awhile to see Rico followed by Sara Patton. Thank you Lisa and Abel and Mike and Shauna, thanks for letting us speak today. My name again is freaking kidding. Go I am the Civic design lead or at the arch of firm that I work for DLR group. I said on the historic Seattle Council for six years and I'm currently the chair for the Pike Place Market PTA Council. Where is this is a super important issue. We're dealing with here today. And another you guys know that I also know that you know that the PDA is a very important stakeholder in this process. You have all heard that the work hasn't been completed the study needs to be finished and we are here to support that statement. We we believe the same I think that in addition to that. I would suggest two things we're talking about not only context we're talking about history and were talking about zoning when the study is completed. I think you need to have you know. I will go there at SMC 2334 124b britches boundaries criteria of of the district. We need to have a zoning consultant. Look at that criteria as we look at this conversation, and it may be that we aren't just simply talking about that individual site. That is the Showbox. So I would encourage that as best we take the next step forward in moratorium extension or not. So thank you for your support. Thank you for all your work and we need to be a partner with the PDA needs to be a partner with you in the process. We would like to help so please reach out to us. And Sarah Patton will be followed by Amber King. Hi, Sarah Patton. I'm here today as a the advocacy chair for the friends of the market also as a volunteer for friends of the market. I started when I was 15 in 1964 with that work. So I've been doing this for a long time. I serve for 10 years on the market historical commission. So I really think that is that that that the possibility of extending its expansion is a good one give the time to to deal with the issues that are coming up. It'll give the time for a real public process with didn't get started during the previous six months to find out what's going on. And I also want to Echo the comments of KidKraft for friends of the market and say, yes, please extend this expansion. Thank you. Hi welcome. My name is Amber King. I am chairman of our Revolution King County. I'm also a PCO in Shoreline. My family has been in Seattle since the turn of the century helping build this city from the ground up and many times over. I also work in construction presently and I grew up working in the Pike Place Market going to school at the art school down the street that is now closed. I've seen so many shows at the Showbox. I've seen so many shows at all. The other venues that have now closed and I really want to urge you to understand the importance of the Arts in the city without our art music the city dyes we can build this mini condos as many apartments that nobody can afford but without the Vitality of the Arts community that is why we are here that's why we stayed here. That's why we're fighting for it. That's why my children are here and that's why it's important to me. So please extend this for 6 months. Thank you all for joining us and testifying if there are no more testifiers off close the the public hearing and move on to discussion of the legislation itself. Okay, close Publican. So before we go into deliberations around the the legislation, I want to signal. I hope that we can vote on Council bill 11950 for because we had a public hearing today, because the council rules specify that when we have a public hearing we don't vote on the legislation at that public hearing. I'm in this case with my colleagues support. I would like to consider suspension of the rules given that I will make a motion if there's no objection the council rule relating to voting on a final committee vote on the same day of public hearing is held will be suspended to allow the committee to vote on Council Bill 1190 504 I'm all those in favor on suspending the rules, but I I am standing now. We I would welcome discussion and comments on the legislation before us. Nope. I'm I'm look I'm deferring to my colleagues on the council and if there is no discussion, I have some comments, but I have a feeling there will be we're just maybe try to figure out who's going first. unsupportive I need the crowd to read my question is the length of the extension at 6 months confidence level that will be done doing the math. That's early December and it is our rules. Like that's what we can do right now. And if you have to come back in December, we'll do it again under Washington state law. You can only extend for six months. After which time you'll have to have another public hearing to extend it further. Turn my bathroom by time and some check out time the council. So maybe we'll see you all again in six months, but hopefully less. Can you speak a little bit to the executives process and where and where they're at in it. And also what you know of who they've consultant has begun engaging with us and what we can hope for in the future just respond a little bit. So what we've heard today about stakeholders have not heard from the executive consultant. My understanding is about to start their Outreach process, including both online and in-person Outreach. I don't know who they've talked to so far, but I have a list of people that I will make sure that they are talking to in the future. I have a feeling some of the people reached out to our property owners in the broader area because of the people we're hearing from and I'm imagining that we're hearing from them because they receive some sort of initial engagement. But yes, we definitely want to make sure that that engagement goes beyond simply the property owners in the in the study area. I just want to say a few words about cultural spaces in the city. It is such a significant concern in issue that the office of the of arts and culture a couple years ago put together something called the cap report for creation activation and preservation of existing a cultural spaces. And that report I made note of the fact that it is I'm going to quote from the report. I don't want to pretend these are my words that it's a neighborhoods theaters galleries music Halls artist Studios community centers museums in cinemas at Showcase Fatality and reflect character attracting residence businesses and visitors the value of cultural spaces and activities can be quantifiable driving economic growth and Urban Development blocks in Seattle with cultural spaces have significantly higher walk scores more businesses open at 10 p.m. On on I'm adding to a public safety of a community twice as many Outdoor Cafe seating permits and three times as many photos uploaded to social media despite cultural spaces role in strengthening neighborhoods creating and maintaining these faces in strong real estate markets can be extremely difficult the older more eccentric spaces that often house cultural uses and small businesses are particularly vulnerable to development driven displacement. The report goes on to identify the accolades that Seattle has received from our vibrant Arts life top US city from call for culture and Business Insider America's top 12 artsplace world's 5 best cities for arts and culture five best up-and-coming cities for art and culture five. Top coolest cities Forbes greatest City in the u.s. For starting a business and several others these accolades reflect an act of ecosystem of cultural life treasure locally and recognized Nationwide. Again in a real estate market like we have right now precisely what makes us so successful as an arts and culture City and as a as a City generally is also what makes these venues vulnerable and I I want to tip my hat to the work that the office of arts and culture has been doing around preserving these spaces. They are working at looking at creating a potentially a PDA as a mechanism to preserve art spaces in the future and that's great work that I think the city needs to look at what we can do now. And so for that reason, I'm very supportive of this legislation extending the the Pike Place Market District historic district to include this piece of property in in the interim. the next 6 months Herbold, I just want to do also add that that we actually wouldn't be here if it were not for several things. But one of them the fight that happened to save the Pike Place Market nearly 50 years ago. And at that time as some of you have said and many of us have read because of the save the Showbox struggled with red the history of the Pike Place Market. It's only here today because there was a movement at that time to save it from the same kinds of forces that we are talking about here in the in the same question that came up then is coming up now but accepting a much bigger way. What kind of city do we want? What kind of vision do we have for our city? Do we want it to be just a place? Where are the wealthiest of the wealthy can live and a place? That is slowly but surely becoming a divided of the culture that we all. Are you know so greatly value or do we want a city that has vibrant culture and has a space for everybody regardless of our race regardless of our income and you don't have to be a six-figure salary or nor to be able to live your actual said we don't need more luxury units. What we need is affordable housing. So I really wanted to commend our movement are our Collective effort that has made it very clear that this is not a fight between music and housing. It's a fight between everything that we we all value as Ordinary People music culture housing a city that we can call our own vs. The endless Greed for corporate profits. So I just want to do in addition to complementing our movement. Also, you know, let's leave here tonight by the reminder to ourselves that we are not going to be able to win the permanent expansion of the bike place. Market do boundary to save the Showbox unless we keep building our movement. That is why we are here in the first place. Thanks to all the hundred eighteen thousand people who signed the petition. We haven't seen all of those hundred and eighty thousand people, but we know that they care because I don't know the last time we had a petition that had so many signatures and so can I can I make an appeal that you are also signed the rent control protection in eyewear. Also fighting for rent control in the city. So if you're here and you support music, I think you also support affordable housing and going to make a safe bet they're so make sure you sign the rent control petition as well and I wanted to thank all the people who fought for this but I especially wanted to give a shout out to all the Showbox employees Shannon or any Nick Misha. Done such incredible incredible work. And I want to do I want to do I want to do it goes up with humming and Misha said really spoke to me and she mentioned a grunch and you know how it has roots in working class culture that really spoke to me because I'm not from Seattle. I'm an immigrant from Mumbai and I've been here only 10 years and I feel such a strong connection with Seattle sculpture because it is a culture that speaks to everybody in in many different ways and Grunge music mural branches part of what I identify with. So, you know, this is something that everybody feels a connection to regardless of how long you've lived and that's why it let's shave the save the Showbox. I'll Target Echo to Shaw's point. I thought everybody moved here for the weather. I just have a quick question which one what was the the payment for affordable housing initially. So there was never a application for a development on the site. We don't have that information. There was a proposal in the media there was about 440 units of housing on the site and the adjacent site and I saw estimates in the me up to five million dollars of affordable housing by project never got to the point where there was an actual number and my follow-up to that specifically, I guess I haven't received this in detail yet. But why is this delayed so long? I specifically what what's causing the delay. I think the biggest part of the Department of neighborhoods don't have funding to start the work until January of 2019 as Council was adopting the legislation last year. They We're aware that there wasn't funding available at that time for the work in the additional funding might need to be identified that was identified in the fall budget process. And so that became available to the apartment about four months later than the original legislation expected should have delayed be for the extension be three or four months to can be consistent with what the delay is. I think to be safe setting at 6 months would ensure that the work gets completed in that you don't have to come back during the budget process if they're not able to complete the work. There is one step that could cause additional delays environmental review would need to be undertaken and if that environmental reviews it filled it will further delay any legislation getting to council. The newest member of the counselors want to share with everyone how important how difficult these decisions of a compliment bar and just how they come with trade-offs the trade-offs with typically not easy choices. I think today's discussion Lee highlights a need for additional tools to support the arts and culture City grows at this point. I do not have sufficient information to make an informed decision about moving forward. So I will abstain so am I also want to before calling for a vote? I want to thank the folks who have contacted our offices in support of ordinance 12560. These organizations are organizations who did not take a position last year. I'm on the temporary expansion. That's it Friends of the market Pike Place Market Foundation historic Seattle all the historic Seattle did definitely composition this time last year. Sorry about that fisher Studio Building HOA and the friends of historic Belltown. So thank you for for weighing in on at least giving us the time to study this issue further and giving the executive the necessary time to make some recommendations back to the council if there are no further questions. I will move passage of council Bill 1190 504 did you all those in favor of council Bill 11 at 9504 Lodi all those upstanding and none of the post and the vote passes 3 2 1 and if there is no further business come before the committee, I will adjourn the committee. It is 6:47 p.m. Thank you all.", "end_time": 4426.7}]}