{"format": "raw", "annotations": [], "confidence": 0.9266836454596701, "data": [{"start_time": 0, "text": "Good afternoon. Thank you for being here in City Hall for a regularly-scheduled full council meeting the April 29th, 2019 city council meeting of the full city council. Now come to order 2 p.m. On Bruce Harrell council president. Please call the roll with fake. Please call the roll. Juarez mascara O'Brien Pacheco president Harrell 7 present very much if there's no objection councilmember Juarez will be excused from today's meeting. Turn up Jackson cast member Wars is excused from today's meeting and wish her a speedy recovery. There's no objection today's introduction and referral calendar will be adopted. Colonel Jackson the introduction of throw calendars adopted in Seminole if there's no objection today's agenda will be adopted. I hear no Jackson's day's agenda is adopted the minutes of the April 15th. 2019 City Council meetings have been reviewed and fish. No objection to men's will be signed. You know Jackson the minutes are being signed presentations. I'm not aware of any presentations this afternoon. And so this time will take public comment on item that appear on today's agenda our introduction for a calendar or our city council 2019 work program and will start off with mr. David Haynes followed by Marguerite Richard. Oh, let's start anytime over the city council needs to realize the root problem in Seattle is the sabotaging of the 2012 police reform. That's all the Attorney General bypass the legislative branch is rule of law and slip slip and unconstitutional sentence that literally Exempted low-level drug pushers from jail. This was also the same time the public defender Association went into business acting like there is a public-private partnership to keep nefarious self-destructive junkies out of any form of advanced gel to break their habit instead enabling the big Pharma alternative juul drugs in the nonprofits that issue them. This is resulted in Seattle Police Department refusal to go after the crack meth heroin pushers destroying lives daily yet listed nonviolent by liberal Democrat. We need honest cops and honest oversight. Not more sympathy for drug pushers causing suicidal implosion embraced by social welfare industry prioritizing more services and housing for those deemed a nuisance law forsaking innocence sober drug free only reached out to drink Bankers hours. I hope the community police commission is going to investigate the ongoing crisis of Seattle bar owners buying off cops Moonlighting as they protect bartenders oversee over serving drinking and driving patrons. There's a case against the homeless veteran that proves cops on the line for bar owners who pay their overtime Moonlighting as Security in order to maintain a relationship between the Seattle PD and bar owners buying their loyalty at the expense of an honest police report resulting an innocent for oppressed by the city prosecutor conducting a war on the poor left over from Ed Murray's evil Administration further by present leaders undermining interpretation of who to make the commute. Money in the public safe for the figures trains are next and last week was Marguerite Richard? Yes, good day everyone. I guess my concern is this only because it's on here and was brought to my attention about the other business of mr. Zimmerman. It's not online and as stated on this paperwork here. So I guess what I'm concerned about is that you want us to speak to a program agenda. But if we're seeing all these inconsistencies going on up in here then for the average person that may not be thinking straight, you know bus not a crash somewhere like the cream man came down and so you got post-traumatic stress because either you witnessed it or you saw it happened in your city. And then you come down here and it's like you spanking for but I'm I'm letting you know today. I'm not no rollover. And if you got some Iddy biddy feelings that you going through or you need to put them in your pocket right now because of this stuff that is incompatible with public duties the customer service bureau. I heard that the curtain is down over at the office. I've yet to find out why because that's something that you would think that we're always going to need its customer service. So whoever created that situation down there. I'm still trying to find out why that was violated. So consistently telling you that these are criminal acts if we are not able to go into a public entity without fear of retaliation just because of the color of our skin that I 200 and that 1000 and go 1000 and 1 2 3 4. I don't care how much down the line if you're still connected to slavery those stalkers over there. You see him. That's what I'm saying. That's why he said clean this dirty chamber and then we can all be free. But you're that will conclude our public comment section and will move to the payment of bills section. So please read the title. Cancel 11950 at 3:49 to pay their claims and hurting and payments rs.50 three questions comments or not. Please call the roll on the passage of the bill Pacheco president Harold Aiden favor and unopposed. Please read the first agenda item is returned to December 31st, 2021. The committee recommends a point and be confirmed 02741 came out of the Civil Rights utilities Economic Development Arts committee recommending that the full Council confirm appointment. The mayor first appointed director Lockhart as interim are in December 2018. in February, we invited the commission's and their members to help craft questions to include in the questionnaire for interim director Lockhart and the cop the confirmation process has been unique in that Council Bill 11920 actually made reference to a retina that was being conducted along during the same period of time that we were beginning the confirmation process that analysis was intent is intended to assess the structure and position of the office of civil rights within the city and with a particular look at the independence of the office understand the role that the director has in offering a strong independent voice is one goal in this rat analysis, especially with the potential responsibilities of overseeing recommendations from the racial Equity toolkit process that my Result in actual changes to the structure of the office as well as potential changes to the structure of the director's position. So the confirmation questionnaire and director Lockhart's responses, ultimately help inform the expectations letter that was emailed to two counts numbers this morning for review in the confirmation process structural Lockhart and provided important insights into her goals. If she was appointed highlights being advancing anti-racism with Insidious tutions, adopting alternative models to enforcement for civil rights and discrimination violation in working to create broader adoption of the racial Equity toolkit and supporting staff in a resource tight environment and especially importantly as somebody who would play a role in shepherding potential changes to the office that might come out of the racial Equity toolkit process. I really appreciate director Lockhart for Commitment and diligence throughout this process as well as the efforts of the executive pacifically folks in the mayor's office who have been very Cooperative with me in mapping out a process that might have taken a little bit longer than the executive would have liked or as director Lockhart would have liked but also I think did a really good job of both incorporating and put some commissions as well as respecting the autonomy of of the right process and I'm really excited to move forward with director Lockhart's confirmation. I do understand that. I might need to amend the point in the appointment to add the letter of expectations to clerk file and Amelia's not in so I will also move amending the clerk file to add the Lector letter of expectations to the court file add the letter Have expectations to Mariko Lockhart an amendment to appointment 1274 describe a council member herrboldt any questions on the amendment only all those in favor of the amendment, please what I opposed guys have at the appointment is a minute comes from herbold specifically to the confirmation as well. And so with that I like to move forward with confirmation to rebuild for her due diligence throughout this process part of the reason that I think we now have a more robust process moving forward is to make sure that especially the voices of women to Bose color of the lgbtq community focused directly within our department, but the folks that office of civil rights focuses on serving and addressing any concerns to come forward we are trying as we move forward. As a body to make sure that future appointments are as inclusive as the ones that OCR major one day. And so thank you to account number hurdles for her work with us on the other resolution. I think that this is a great example of where we want there to be a great outcome and not Adelaide one and to make sure that there's more folks who are able to serve the other constituents that they look like and represent. So thank you for your work on this and looking forward to supporting the summation O'Brien. I just want to listen, send me to committee. I'm really excited about this appointment in my car. I'm really excited for you to take on this role. I appreciate it seems like you're very excited to take on this role tube and knowing that this is going to be it's a really challenging for key balance and we talked a little bit about some of those Dynamics we talked about it comedian. You're well aware of that and I'll just named you know, my perspective is that Does the challenges we face around racial equity and all funds directly the city require just a huge amount of urgency with which we need to move this institution in didn't you know that better than I do and the reality of this institution with its institutional racism built into it is that it's not going to be able to move with nearly the urgency that it needs to go and you get to walk that line between being held accountable to you know, a whole host of folks for going to hold you accountable to move without urgency in at the same time. I have to balance how fast you can move this institution with lots of leadership and 11000 employees in a hundred plus your history and no matter what you do and how great you do. There are give me a bunch of people that are not to be happy with you. And but I think that my experience of working with you over the years that the commitment your passion about this work and the grace with which you do this work makes me feel really good and I will try to hold you accountable and not be too upset when you don't meet all the goals all at once but look forward to working with you. So thank you and Brian Gonzalez. Oh man, it's hard to follow that I just want to say congratulations in a sort of premature early congratulations attitude as soon to be permanent director Lockhart. I've had the pleasure of knowing you for several years and have really come to appreciate your sense of dedication to what Public Service means and I'm really rooting that service in a concept of the work that were all I think I committed to a need to be more equally committed to which is centering the work that we do it feel like servants on dismantling institutional racism in the Life and Legacy of racism that is current in our country has a former civil rights attorney. I have a deep affection and appreciation for the work that the office for civil rights does and for the work that you have done both in the office for civil rights, but before coming to this particular role, so thank you so much for taking this work. So seriously and really making it your life's work over many many many years for many people in our community. Narcity, really appreciate the perspective that you bring in that regard, but also the perspective you bring it around being a steward and a protector of your staff and the people who work at OCR. I think that's a really important value to bring to this position in this current. Of time. So, I appreciate you and appreciate your staff and look forward to continuing to work with you on some of the more important issues that are City faces today. Looking forward to voting. Yes Ellis other comments from the diocese before counseling her boat may just save close remark, and I'll just say it brief remarks at thank you for for your leadership. It's proven. We take these appointments very seriously as recent events would suggest and certainly you you finally passed the test if you will, but again with all of my personal interactions with you, you're the ultimate professional, so thank you for your service councilmember. Thing I've really appreciated your commitment and your leadership and I really look forward to working with you over the rest of my time as chair of the civil rights committee and want to pledge to you that I look forward to working specifically on dressing some of the resource challenges that we've identified through this process. Thank you. So about further do all those in favor of the appointment as a minute, please go die by those opposed vote. No the motion carries an appointment is confirmed. Objection. I like to expend the rules and would love to hear some words from Miss Lockhart. You take as long as you want me to shred agenda today are your support in such a personal and direct way that trust that you are placing in me and the confidence to leave. This office is a tremendous responsibility and I take it very seriously. I am committed to living up to that responsibility and to your expectations. I'm also really excited because I think the office is at a an important turning point and I think we're going to do pretty amazing. We're going forward several you mentioned the staff and I'm really proud to be leading such an incredible team and very fortunate to have To be in this particular place at this particular time and councilmember her about you reference the racial Equity toolkit analysis that our office is undergoing. We do anticipate that there will be a change and that this is a. Of transition and I think we have built strength and Trust among ourselves as a team that we will really be able to move forward and accomplish. Whatever changes are in store for us, and I am confident that they will be the best changes for our community and particularly those most impacted by institutional racism. So, thank you so much. Thank you. Thank you very much. Thank you customer her Bowl. Please read the next agenda item policies adopted one for 6:32 to provide for the limit application of the herbicide. I must have power to treat invasive knotweed species recommence a bypass to treat treat the invasive knotweed in the Cedar River Watershed visit ordinance would allow for 3 additional years through 20 21 of The Limited spraying of a massive ear with a goal of eradicating knotweed the legislation would amend a 1989 ordinance that band herbicide used in the Cedar River Watershed and extended the authority described in ordinances from each 2010, 2013 and 2015. So each of those three years we have amended that 1989 ordinance to extend. The authority to allow very limited application of this herbicide and has appeared in order specifically and only to treat knotweed not we poses the greatest risk of any invasive plant in the Watershed the plant takes over habitats in your water displacing date of plant species degrading habitat for salmon and other fish and threatening water quality by destabilizing stream. Riverside has declined herbicide use has declined every year since 2011 and the amount used to treat knotweed throughout the Watershed reached a low of 0.4. Oz per acre treated in 2018 is a 95% reduction in the use of of this herbicide. And it's also the Seattle Public Utilities has gone to Great Lengths to adjust its application practices specifically to minimize potential impacts de pollo. Thank you very much. Any questions or comments? Customer Brian just a quick comment. Thanks for your work on this council member herbold. I will be clear. I'm frustrated that we are still allowing this but my frustration lies solely with the Persistence of knotweed. I was part of the work on the original piece of legislation in 2010 to create this exemption and I will say that I am convinced that spu is done some amazing work to continue to reduce the footprint and the amount of pesticides herbicides are using and it's an amazingly invasive pervasive persistent Beast this knotweed and it may be a number of years until we can say that they're confident that it is completely gone and will not come back, but I also want to say that this is part of an overall strategy all the way down to Cedar River not just in the Watershed that sell Hobie Cat Cody where to get my water from but all the way down to the lowlands and King County another Partners have been working clabbered of lead to remove that along the bank because it does transfer by water to so I'm happy to support this and I think that's to use doing a really great job in a really difficult situation. Thank you customer Brian Christopher Bradshaw you give me any numbers do we know whether or not the acreage has been reduced rate life? And can you talk a little bit about if you know how much left that sbus focused. So they are anticipating being able to move more into a maintenance stage, but the the amount of area that they have to cover has greatly reduced over the years that they've been doing this application. And as I mentioned before they are very careful to not apply Mazza. Hiiraan knotweed plants when they're flowering specifically to address those concerns about the impact on on pollinators. And when I say they're anticipating being able to move in to sort of more of a maintenance approached their they although their goal is to eradicate knotweed they are still anticipating that even in the maintenance approach if they are still going to have to go out and spray because and it will be spraying more to deal with the bugs that come out of the ground while they're still there still Roots. They've tried doing manual eradication of knotweed but just because of how invasive it is and how it travels the manual eradication doesn't isn't effective. But at some point they feel that the root system is going to degrade so much that that the the the threat of larger plants Going to be greatly reduced or continue to be greatly reduced. My recollection for the presentation was it is about a 95% reduction. Also in the in the Acres of art is so and I believe they haven't seen any places where is popped up. So we're still dealing with the same areas. They have in there. Just going back there on a regular basis checking it and when little pieces pop up they're going to treat them until they win the battle over the energy left in the root system. I don't know if they used to do injections where they would go break the plants hear they're doing then I'll switch to spray and I forget I don't know if that's the reality of the maturity. The plants are dealing with is much different or if it's a different technology or that's evolved everything. You need to know about the passage of the bill Salon Gonzales herbal O'Brien president Harold Aiden favor not to post Go Passenger set it. Please read the next item on the Square preservation board for Toronto, March 1st, 2020. Excuse mean Pretty as a first-quarter 2018 employment ordinance designated positions as exempt for the Civil Service authorizing payment of the employees 2018 premium share into the Washington State Paid Family and Medical Leave insurance program and ratifying confirm me searching for Exile by two-thirds vote of the city council. The committee recommends a bill passes amended. Thank you very much. So we've got two subjects in this ordinance. And the first is designating three positions as exempt from the civil service system to in our information technology department and the third in the human resources department. This is typical of the quarterly report. There's just these three that will be made exempt and there's no other changes the second section in this ordinance authorizes payment completely separate from the first items, which is that the city will pay into the Washington State Family and Medical Leave insurance program the employees premium share beginning. January 1st of this year and up to December 31st 2019. So those separate subjects are both Incorporated in this ordinance and committee recommends to pass very good. As any questions or comments. Please call the roll on the passage of the bill. So why mascara O'Brien Pacheco president Harold Aiden favorite and a post appointment at 1307 and 1308 appointment of at least kuwahara day as member Pioneer Square preservation board for Trenton, March 1st, 2021 an appointment Audrey Morton Morton Hoyt as member Pioneer Square preservation board for turn to March first 2022 the committee recommends the appliance be confirmed. Thank you. Bible has her bachelor's from Carnegie Mellon University. She will fill the position of architect on our Pioneer Square preservation board. And if I may just jump to Audrey Hoyt will I vote on them separately. She has the business or the retail appointed to this commission commission and many of you know that we have been working hard with our Pioneer Square square preservation board supposed to preserve the character of the Pioneer Square area, but also to begin to focus on some of the buildings that have been derelict for in some cases 30 years. So I'm excited about these two appointments because it's going to fill out the board and then they've had multiple vacancies for a couple of years now. So I recommend that this these appointments be confirmed any questions or comments. And we can vote on these together since they are read together show all those in favor of appointment 0 1 3 0 7 0 13083 say I know in case appointments are confirmed. Please read items six through fifteen, please 1294 1300 + 13 0 9 through 13 11 appointments of Asha Mohamed Natasha Moore Mark Mullens and Elena Sunday on as members Community police commission for terms of December 31st, 2018 appointment of Erin B Goodman as member Community police commission for a term for December 31st, 2020 and appointments are appointments of Brandy Grant S room settle Carissa Moore, just to see you and Harriett Walden as members Community police commission for a chance of December 31st, 2021 the committee recommends these appointments be confirmed. That was a mouthful. Thank you Amelia. We are in the home stretch here. So I have a book of today's agenda items and I will go through each one and I'll leave it up to chance president to figure out how to call the roll call on us or call us to vote cuz I think they all have different term limits. So the first one is Asha Mohamed has been nominated by the mayor. She could she is currently the director of the of the Somali Youth and Family club chairs professional experience as a leader addressing Community needs relating to housing self-sufficiency education criminal justice and immigration. She's going to Seattle light for over twenty years, but maintains a global Consciousness having work to for multi-ethnic Multicultural and multilingual spacers in an effort to achieve equities for human rights lens. She is also the daughter of a police officer as well as the mother sister and wife of black boys and men Natasha Moore is our next nominee. She is at Council of pointy Natasha has five years of experience working with high risk youth and And adults involved in the criminal justice system. She currently works as a program manager with choose when Ada restorative justice organization. She previously worked for the YMCA of Greater Seattle in multiple roles including as an Outreach worker. She's a board member of the Beacon Hill Hub and is currently enrolled at Seattle Central Community College or third nominee is Officer Mark Mullens. This is an appointment being made by the community police commission and serves in the role as the ass pawg representative Mark Mullens at Ochsner Mullens was born and raised in Dayton, Ohio. He graduated from the police academy and became an SPD officer 1990 his work primarily in the south precinct for the bulk of the 29-year career. He has served as a community police officer. And in that capacity, he worked closely with community-based organizations such as in central address. He was the South Precinct officer of the year in 2017 and currently serves as a shop steward for spot. Air Force nominee is Alina Santillan. She is a council nominee Elena works at the director of racial equity for Seattle Center cohort supporting Seattle Center organizations to strengthen the racial Equity strategies and practices previously Alina worked at kexp 90.3 FM in several roles. Including is community engagement manager. Alina is a graduate of the Seattle Community Police Academy and has volunteered for a number of nonprofit organizations, including youthcare the Rainier Valley Corps and the black prisoners caucus at Clallam Bay City of Southern Mississippi Goodman as she is a appointment Aaron has served as the executive director of the Soto business Improvement areas since its founding in 2014 in her will she cultivates collaborative relationships between a business and Property Owners elected official City department and Community organizations with a high degree of focus on public safety issues impacting the Soto area. She is currently the chair of the South Precinct advisory Council and is focused on build. Bridges between the South Precinct officers and the community they serve our next nominee is Brandy Grant a cancel appointment Brandy currently works as program manager at the alliance for gun responsibility Foundation at the alliance for gun responsibility Foundation. She works to build a network of Advocates and allies to help promote education awareness and Recovery Services for domestic violence survivors Suicide Prevention and mental health around gun violence prevention. Brandy has 20 plus years of community work in organizing mental health and program management all through the lens of gun violence prevention in impacted communities. She earned her bachelor's degree at the University of Tulsa and her master's degree at the University of Oklahoma or next nominee is Esther Lucero. She is a nominee made by the mayor she is the CEO for the Seattle Indian Health Board, which operates the Thunderbird Treatment Center S65 bad residential treatment program in Rainier Beach among many other healthcare related Services as Sir is a co-chair of the healthier here governing board as well as a delegate for the American Inn. And Health commission in our next nominee is Carissa morikawa who is a nominee made by the council. She currently works at Chuze 180 as a cedar and Navigator supporting used and their families when facing their first felony charge. She worked as a case manager for ccy J's link intervention team while employed by YMCA Young Adult Services. She's also at work at Roots young adult shelter and has conducted case work as a rapid rehousing resource specialist and a program manager. CPC reappointment is next in that's Joseph seia Joseph was originally appointed to the CPC in 2018 to fill the remainder of a partial term and is now being reappointed to his first full three-year term. He serves as director program operations in New Horizons where he manages the organization's youth programs in Seattle. He previously worked as a youth case manager and community advocate for Southwest Youth and Family Services and is deeply engaged in the Somali community in Seattle and the region and has a highly valued and is a highly valued addition to the CPC our last person that we would like to move forward in terms of a reappointment is a mural reappointment of Reverend Harriett Walden Jesus Culture on the CPC and has served on the commission since its Inception in 2013. She has been reappointed to or third and final term on the community police commission. She co-founded mother for police accountability 1990 and has been a fixture of the police Reform movement in Seattle in Washington. For decades. So those are the appointments reappointment to the community police commission. And I think is you all can tell from the diversity of candidates we have in front of us. We really at work hard to identify people across the Spectrum to bring different perspectives to the community police commission and to continue to advance upon at the mission and the goals of the community police commission. And with that I am happy to recommend passage questions or comments before we cast judgment. I just want to thank both the mayor and councilman Gonzalez for some of us even recruiting I should say but just for making sure that we have such a talented commission for the community police commission cuz this is incredibly important work for a shity. So thank you very much for this Outreach. Okay, even though they are different appointments and reappointment in different terms. They are all to the same commission so we can vote on them all at once. I've been told by the Clarks. So I'm going to take six or 15 to all those in favor confirming appointments six through fifteen. Please load. I oppose voter know the motion carries. The appointments are confirmed. Please read the next agenda item. They put it in sustainability and transportation committee agenda and 16 cancel. But when 19472 related to Lenny Sansone many sections 23.2 and 2.0 sixty-two 23.20 4.0 45 23.49 points are in 1923.54 points or 30 and 23.84 8.0 10 of his electric vehicle charging infrastructure is mended customer Bryan. Thank you. Very excited about this for this is something that's been in the works for over a year to create this Eevee Readiness ordinance. This legislation will require that all new construction in the city of meet certain standards for making sure that any parking spaces that are already going to be provided in that building or even in a lot if it's not a Structure Parking provide a certain level of Readiness for electric vehicles. The main standard for residential is that in single-family homes or in small multifamily developments like Townhomes or real houses would require that each parking spot have a TV ready Outlet ready to go home. And then as we get larger structures where you have a structured parking at shared spaces eventually faces to about 20% of the rack exactly 20% of the spaces. To be electric vehicle ready meeting is there is a wire pole. There's pound capacity everything ready to go to hook up essentially an electric vehicle charging station relatively easily as I mentioned this morning's meeting the technology now exists so that as people put in charging stations you put in a charging station per Outlet charging stations are capable of balancing loads and charging up to five vehicles perception. So a policy that has 20% of the state's spaces Eevee ready could effectively to that technology be a hundred percent of the spaces could be he's charging simultaneously over the course of the night. It's really I think it's some of the best legislation in the country at bills on what other jurisdictions have done and take the strongest parts of various cities and come by and sit in this. I'm sure that in the coming months in years other jurisdictions. Will LeapFrog us to the next level, but I'm proud to say that I think Seattle will be at the moment at the Leading Edge. Requirements for electrical vehicle Residence Inn new construction. Thank you can spare any questions or comments? If not, please call the roll on the passage of the bill. Consalus herbold. O'Brien by Jayco president Harold and unopposed Adoption of other nations, and can you read what he read? All three resolutions will vote on them separately just into the records are all interrelated to committee structure membership meeting times and duties of the standing committees have the Seattle City council for 2018 and 19 and superseding resolution 31859 resolution 31804 doesn't need the monthly Pro president pro tem of the city council of the city of Seattle for 2018 through 2019 and superseding resolution 31790 resolution 31885 relating to the Seattle City councilmember participation for 2018 and night 2019 on King County committees Regional committee State committees and city of Seattle committees and service near resolution 31782 Very good. Is that describe to you this morning? These three resolutions basically revolves around the point of councilmember able to check all to counsel position number for the first resolution. Number 17 basically dates are standing committee structure of councilmember pacheco's name in the place of former council member Robert Rob Johnson. He's now share the planning land-use and zoning committee by Cher the sustainability and transportation committee and a member of the gender Equity safe communities new Americans and education committee and is also an alternate on the Civil Rights utilities Economic Development and arts committee resolution of 818 re-establishes the prothom schedule designating customer pacheco's president pro tempore the month of October and number 19 resolution of a 19 updates the assignments to King County committees and Regional commanders and state committees. I'll just name a few then cast member particular place is Katherine Johnson on the growth management planning Council of King County that Growth management planning Council executive committee as well as the Puget Sound Regional Council executive board and other boards. I just want list them all councilmember. Where is our places according to this resolution former? Councilman, Rob Johnson the following committees The Sound Transit board and a Sound Transit elected leadership group. So those are your three sir transition resolutions describing the change are there any questions or comments? Because from Checkers likes a few words. I just want to take a brief moment. I dress my colleagues. I'm sure all of you remember how crazy the first few days on the counselor, but I've been impressed by everybody in my first week here at City Hall. I'm inspired by the high-level Civil Service display my both my Council colleagues and all those work behind the scenes to make sure the legislative body doesn't miss a beat. I want to give a big shout-out to the central staffers are clerk's office in a different department directors. I've had a chance to meet with so far. You've all been very generous with your time as well with bring me up to speed so quickly during my onboarding. It's a little bit like drinking from a firehose at times and I want to make sure I say thanks. I'm excited to start the kitchen study for and it work with all of you and the mayor's office and to identify areas of common ground to benefit this beautiful city. We all love and go home. I look forward to work on the clothes. I look forward to working closely with all of you to identify places where we can make a meaningful impact as I assume former council member Johnson's committee appointments. It's an honor to serve the Emerald City. Thank you Katherine Pacheco any of the comments or concerns or questions before we take boat on the resolutions? Okay. So those in favor of adopting resolution 31883. Please hold. I know the motion carries a resolution. Than those in favor of adopting resolution 31884. Please say aye aye those opposed both know the motion carries the resolutions adopt in Sherwood sign it and those in favor of adopting resolution 31885 please Road. I know the motion carries a resolution. Contreras on it. Just one month. Okay other business. The city council will now consider an administrative appeal to an exclusion issued to avrum avram Alex Zimmerman on April 18th, 2019. The question is Shawty decision to exclude this individual from Council meetings through May 14th, 2019. Be sustained. So just to make it clear. If you vote in favor of the exclusion that means you are in favor of the current exclusion. And if you vote opposed to the motion, you'll vote that you do not agree with the exclusion and the individual should be allowed to attend future Council and committee meetings before the expiration of the exclusion. I'm hope hoping everyone has any questions about the motion councilmember her both the date of May 14th. How did we land upon that date? She'll take a shot at that when I believe the rules allowed for a 28-day extension a 28-day exclusion. And there's 20 days from the moment of the incident that came into to be scrutinized and given that we have had discussions about. Mr. Zimmerman's activities being Beyond simply rule-breaking. We are exploring other avenues that would act as a sanction be on the 14th of May Charlotte apartment on all available options based on the most recent contact. Meditrek I had one question. Fuck off better sit on record. I suppose am I to allow any testimony? in favor or opposed to the exclusion to the members of the public work with did my public comment section suffice for that. Do I have to open it up again for public comment on this motion? Okay. Well, I'll err on the side of caution this year if there's anyone here that would like to testify on behalf of the appellant. I will open up the floor dependent being mr. Zimmerman based on his exclusion on April 18th, 2019. Curing no one willing to speak on his behalf. I will close that section of the public comment section. Okay is a motion clear to my colleagues. Okay. all those in favor of the motion Please go die. I those opposed vote. No. Show the motion. Carrie's and exclusion remains in effect. Is there any further business coming for the council? Okay, if not, we stand adjourned and I won't have a great rest of the afternoon.", "end_time": 2747.8}]}