{"format": "raw", "annotations": [], "confidence": 0.9417662730583778, "data": [{"start_time": 0, "text": "Good morning. Thank you for being here for our April 2nd meeting of the governance equity and Technology committee on Bruce Herald chair of the council will have counts mereminsky to hear just a brief minute or two and cancel her bulge under the weather today. But I'm sure she's viewing a new wish her a speedy recovery. We have two items on our agenda today. When will be the reappointment of Ryan vancil are Seattle hearing examiner in the second one will be a introduction and explanation of some software software and a and a tool to address homelessness and people experiencing homelessness the Good Samaritan app and I'm so excited to see how that works. And so we'll start off with the common as we always do we have one person sign up? I believe this would be Dale Kim and tell Dale Kim. Come on forwarding. Hope to hear from you. I know that they rolled out their dollar 50 low income bus pass, but it's not available at any of the places that you would normally purchase above pass and then so if it was possible to be able to get access to that little bit more easier instead of having to Put on there. Usually if that's the case when you have funds and issues with my money and whatever all that kind of stuff that you have to just the barrier to entry to get the bus pass would be better on the second one is the All there was a few thing. I'm curious about the saddle strap dress who gets paid six figures in terms of the strategy and the overarching themes of going the different components are at play. The subcommittee's that are I believe might not be subcommittees anymore. And you know, I do know that this is more of a and discussion instead of just more of a working kind of democratic discussion, but that's just something in terms of the strategist. Maybe that's something he can work on but it's weird that pay 6 figures and all this stuff is going on. So that's just my type. Anyways, thank you. I didn't fully understand the second point. But the first point I'll be sure to relay the information on better access on the fly. So a lot of times it's not this like one repaired think there's a lot of things that Taco on thanks for coming and sharing your thoughts appreciate that. Okay, that will end our public comment. Session unless someone else is running to the mic. Otherwise, I'll close that and we'll move into our first agenda item. So it has that anyone associated with the vancil appointment come forward and table appointment 01277 reappointment of Ryan P vancil as hearing examiner Office of the hearing examiner for a term to March 28th, 2023. Pretty rattled cancel sound. Examiner, and he is now here to be considered for reappointment to a 4-year term for call the eggs in their staff were falling this Tracy Staffing Association helping us out and so keep a little informal and call you Ryan. If I may have supposed to hearing examiner vancil sound like I'm appealing a land-use decision something for those that don't know what the Examiner does cancer explain the job that you have and in what your services are. The hearing examiner is to provide a forum for appeals of City. Sorry City decisions and permits. We also make recommendations to the Council on some items such as rezones, but it's mostly the appeal side that I think public season is as familiar with that Candy Land Use of heels or also, we handle hundreds of citation appeals which her more like a small claims court level of dressing disputes that people have with the citations they been issued. Very good and again to introduce yourself as the hearing is on for a year, maybe describe your background starting with your role as the deputy hangs down in your private practice and give the viewing audience a snapshot of sort of who you are and why you're qualified for this position. Certainly I have prior to joining the city. I had a practice of 15 18 years or so in land use most of the appeals. We hear our land use appeals and so is a practitioner in that area. I had the fortune fortunate opportunity to practice in front of the former hearing examiner to Tanner and also an watanabei the deputy hearing examiner and so similar with some of the city's codes and practices but also practiced around the state. When the opportunity when mrs. Watanabe after 22 years retired the position for Deputy hearing examiner came open and I saw it as a great opportunity to participate and get a front-row seat. Is it where to land use development of the growth management act in the largest jurisdiction in the state and Miss Tanner. I saw that I had some Merit and so I join the office she did tell me that time. I was hired that she was looking at retiring soon. I really didn't enter my mind to understand. I just knew that I would have a new boss at some point. She ended up staying with the office for about a year longer than she anticipated. I got very invested in the office and its Administration and ensuring that it would be a good functioning body. It really a leader in the state as far as I hear examiner's office goes and when she did go to retirement. I thought it was incumbent on me to make sure that that process was good and I stepped into and through my hat in the ring as it were to be appointed as hearing examiner. The council saw fit that I could I could satisfy those that Duty and so stepped in. I don't know if you want to hear about the last year and that was there's a lot to it when I stepped in as I mentioned this Watanabe a retired Miss Tanner. We also had an executive assistant retires. We have decades worth of institutional memory step out of the office just before I stepped in and so when I took the office over we even had the most most short-term executive assistant took another job. So it was me and a legal assistant trying to keep the office of functioning with new hires and the deputy hearing examiner a roll and the executive assistant which they needed time to get up to speed limit Dynamic exciting time both administrative leave for that reason, and then we've course have a caseload that a historic high right now with the number of Places were having and last year was an interesting year for the types of cases as well. We had the burke-gilman kicked our year off was the first one of the larger cases. I had its council's familiar with that process and then mha came to us in the summer. And I'd imagine if I look back on my land use career Sunday that that'll be one of if not the largest ant hearing that I will have participated in an door handle. We also have the l i d hearings which was a little little bit different than our normal fair, but it was also very involved. And so that was that was that's it in a nutshell are our year and I think it went. Well we the I don't think for the most part that with exception of the mha sort of being the kid big big kid that jumps in the pool in this place is all the water. I think we're able to handle our schedule very well and be responsive in in a normal course, even though they're behind the scenes keeping things managing was was a challenge. So I think you described in both of the burke-gilman trail and mha and Lida issues and many of the land is land use issues that we we cope with it affects almost every but I mean, it's it's it's it's widespread and it's it's it's impactful work. I would say too many folks just out there that you know, the average person out there. They may not see the effects and but they wanted a the solid person in that job. I even though they don't see the the tangible effect. So, can you describe a little bit about who you are your values? Why did you migrate to this kind of work shirt who you are? I don't want the intimate details but it didn't occur for was to describe your DNA in terms of why you do what you do and how your value system how you make the decisions you make I'll give it a shot. We don't often get too personal with me on the hearing examiner level but if it's an opportunity to do that just which what you're comfortable actually appreciate that that's part of how I appreciate their approach. The the position really is that we are a quasi-judicial for him. We we act as a essentially the court and yet what's important is that we presented face that I presented face to the every individual that comes into the hearing room that their case is going to be heard that their voice is going to be her that have the right to be there and I have no problem doing that. He's quite comfortable to me to approach every case that way we do see Up Abroad spread of individuals coming in in the hearing room Strickland the citations hearing and so I really need to be present. Listen, and I'll be engaged with what they say. This may be the only time they have a hearing and be present with that as I mentioned in the outset variance to The Landing site along practice history in and land use a lot of that was in actually in rural areas and farming and parks and stuff. And so the opportunity to be engaged with this heavy an urban environment once was a really a joy to me in and do something but I presented new challenges all the time. So there's that personal intellectual interest, but the thing that I think keeps me engaged with it is the opportunity to really be in gauged with Seattle lights on a daily basis and really experience of a variety of people at some point. Maybe we can talk about where I'd like to take the offices and if that's something that I writing the ship and just keeping it moving was the width of This last year both with the from administrative point and the large caseload, but my hope is that the office can be increased if it's opportunity for transparency increase since opportunity for reaching out to the community and end so that maybe it isn't quite a mystery to everyone so much and that can be taken from an angle of either us the work. They were doing to modernize some of our technology equipment in it in the office. So that people can maybe Skype in for a hearing to me engaging with different public meetings or something and going out into the community in and just meeting people so they see you face to the person that's behind the diet as that is a little more neutral and many more standoffish. Demeanor is as it where when I'm playing that role but they get to see that it's a human being another context. Of land use any chance you live in District 4 because we're excited that you do have that appreciation for land use and I think on the whole your approach to the Fort Lawton and mandatory housing affordability appeals were pretty well received in terms of perception from the community. I heard it was a very fair process. So my first question is, is there any thoughts that you have in retrospect having that with those two pretty big issues already this year that you thought our lessons learned from your first year that you'll be applying to your work going forward should you get the reappointment process wise with? Mha and Fort Lawton that I I'll be able to speak at CLE isn't each other hearings. How to do that was that was that was a process that I had to wing it a lot to make sure that was done. Right and I was very honored and blessed better to feel that I am and not just to feel but to hear from Council on both sides or in other meetings and just do it about in the community that regardless of how I made my decision that they felt like they had had a process that was good because they was 29 neighborhood groups that were appealing we needed to get it through in a timely manner, but we needed to make sure that every issue that would need to be addressed wise address. We had lots of emotions in the beginning and of course a lot of emotions in the room as we went forward. And I think that what I come back to you with that and it would have liked to continue exploring and him in it and developing as we we going to are hearings is that element of neutrality and helping individuals sometimes our local papers. I understand that this isn't a political decision for me as very that the emotions that people bring into the rumor valid But ultimately that's not what I can make a decision based on that. There's a law in place and help them understand what that process is. One of the things that I think people are challenged by and I think I even our guide to Citizens right now says this that is more of a user-friendly form. I don't think that's the case at all like I practice this a lot for decades and so I I I find it to be a very challenging for them even as an attorney coming into it and so I would like to explore ways that we can make people feel comfortable there, but understand And at this is all right to come in and represent a group but you don't get ink or if you can the Rules of Evidence are a little looser. But that means something to an attorney. It really doesn't mean something to an individual has never done this before. So how can we make sure that they really understand what they're in for and be prepared as is that direction that I think we need it to continue during when you were being interviewed. Remember a question was asked about how does a good hearing examiner distinguish if a person is just I'm fixing income there representing themselves. They don't know the rules of evidence is not as sophisticated in terms of procedural issues are legal procedural issues versus the very affluent litigants that is hired a an attorney from a major firm that knows the evidence rules quite well and you're looking at one versus perhaps even litigating against the other and you're trying to make good solid decisions that can withstand appeal. So, how do you how do you do that? I mean in a subconscious or there could be all kinds of Things working as you're looking at these two, perhaps one litigant enormously disadvantage. So so so the question I put it in terms of an RSV eye contacts is how how do you see our SGI playing out in the things you want to do in the future, you know, the city is is is behind our are shy Ann and it has a been experiences in last year so that you so well we could do a little better here so we can talk a little bit a little bit about how your office and braces the artist Cheyenne issue. Seriously, I sort of two parts. I heard him in your question council president. I there's simply how do you address someone who's may be a pro? Se litigant coming in and try to make their case something they feel is not right or good or or a problem with the system that they've experienced and the other side may be very well prepared or and or very well-financed and have Strong legal team and then there's also more specifically the rsdi ass back to that in the hearing room to dress the first part of that in the hearing room, but I do have my hands behind my back and in a sense. I have there been there laws very clear. I can't help someone to do their case. I can I can just I can't I can't hear what they see is a complaint on a problem with their lives and as a private practitioner, I help people fix their lives all the time and I can't do that in this role. So one thing that I can I can do though is make sure that they understand the process may be slow it down a little bit if they have a gift of the other side's going to send a motion to dismiss I can give them two weeks to respond and said it one week something along those lines and that's all very normal for any hearing process that I can make sure happens there another piece that I want to keep exploring with the office and just didn't get too with all of the administrative changes in the types of cases we had last year. That I've been able to do some baby steps with is improving the opportunity for mediation and making sure that individuals are aware of that. I'm with mediation before they get they come to me where I can explain it to everybody. I'm a thumbs-up thumbs-down. I got to decide on the law, but with mediation there's these long-term relationships off and neighbors are going to be next to each other landlords and tenants. I can't fix all those problems. But if they can go in front of a third-party neutral that can help guide them through this process. They can address all kinds of issues that they can't aren't addressed by the law. So it's it's an opportunity that I'd like to try to emphasize through the office if I can specifically with RSD, I we we aren't as I understand it held to that because we're under the legislative branch and and aren't required to follow up by five once I came on as a deputy hearing saying there was was actually really excited about the opportunities for education and understanding what what what's the city is doing under rsdi? And so I believe in as a deputy. I took as many of the rcia classes as I could and when I stepped into his hearing examiner, it was an immediate priority for me to to have the office follow that diet require not and so at this point again, like with the mediation it went a little slower than I would have liked last year and things just seem too and I am not in private practice anymore. So I can't get it done in a couple months. But we were able to do is all of my staff have been through RCI trainings at this point. We did do we just we just finished the underlined institutional racism trainings. So we got the training or training in place outside of that. I either some programs were hoping to really see some progress with we've reached out to some local law schools to try to start bringing in develop relationships as we're at the stage now, but ultimately the goal would be to have lost students coming into the hearing room understanding what land uses And I would love to see people of color in the context of land use practice right now. I just got statistics from the bar association environmentally induced group. There's a minority women a minority there simply are not people of color practicing land-use law and so to hit the hit of the student level on trying to focus on that and use our office is a platform for that another opportunity. I'm looking at and if this is going to be with the council discretion is as we go and please keep an eye on it you let me know if I'm not doing it right but we have a proton budget so legitimately within that the course of time we will need some help occasionally we get overloaded. I have to choose who that pro-temp hearing examiner is going to be and one thing. In fact, I think it was a council member must get at you you mention this last year when I was looking at the opportunity of to looking at the afternoon to hire a deputy hearing examiner. Is there an opportunity for people color to two? At that level because we do land use cases and there's there aren't practitioners practicing land-use there really wasn't there but here I think I found an opportunity where there are individuals for it we've connected with wine. His name is Anthony Jones. He's from the port gallon gamble s'klallam tribe, is that administrative long? And so what we're going to do with him and and one other candidate later this year is bring them through a training process so that they really understand the hearing process here in Seattle. Now, they are fully qualified to do hearings. So I think that I'm within the rubric of what my discretion is to hire them as a proton but we're actually going to make it a training program so that they will understand Seattle laws will go have them do hearings bat with them afterwards or observing hearings and ultimately my dream would be that when I'm stepping out of this role and or my Deputy is that there are people that are qualified they can come in Examples of what we're trying to do with it. I'm looking for more and I'm always welcome to welcome in very good and I again during your interview process you have some great ideas about using internship in grantchester about diversity. So appreciate that. Okay, so let me sit or walk you through the process and they said it had any other questions, please you must retire. I'm so thank you so much for helping us understand the process that you're undertaking to create Pathways for greater representation there. I think when I asked earlier about what your Lessons Learned were from, mha in Fort Lawton, it was through this lens at the council president has outlines for the race in social justice lens, you know specifically over all I've heard is very much a sense of fairness coming from your office, which I appreciate one of the big concerns that I did hear though was specific to the Fort Lawton appeals and when an individual and this case was Campbell delays the process by going out of country on vacation and and that her her vacation is given the acceptance to delay the process that does raise Equity concern concerns not only come from you know who has access to the process, but you act accurately describe but the equity concerns of a delay and then another delay on top of that delay given the appeal resulting in less housing as quickly as we need. So I think what I'd love to hear more about as you go forward as sort of a reflection on that process the allowance of that extension given the fact that it's not and mostly people who are housing insecure who are coming to your office and challenging land use policy is it's mostly those who are housing secure who have a fear of the unknown or misconceptions misperceptions about what is being proposed who are ultimately delaying process that raises Equity concerns just as much as it is about who does come to your office and and the Resources that it takes to file does appeal. So as as you think on Lessons Learned in your first year of taking into consideration what type of delays we continue to allow if those who have resources like that are choosing to do things like go on vacation overseas versus being part of the process of the initiated. I just don't want us to be fueling additional inequities on by allowing a process to get dragged out even further when someone's making those decisions that ultimately delay housing affordability. So on the equity issues, I completely agree with the council president, you know, glad to hear you're looking internal glad to hear you're looking at who has access to the process and would definitely appreciate you thinking about that your internal. I'm immediate bad processes for is allowing extensions for situations like that given the result May I come home? I'd like to just so you know after this hearing you're going to get some written question that you can elaborate. Do you want to move to next agenda item? So go ahead and respond that I'll try to give it to her appreciate your long-winded that respond. I'm losing my view our audience when you go on on that land you say she's got the Raiders are going down. The first item on the on the schedule is very tricky for us because there is this opportunity for a balance to come in and make their their statements. It's always balancing it it from this the spot. Haiti went into this as a decision maker trying to balance or is this someone really gaming the system or are they legitimately experiencing a health issue or is there counseled legitimately not available at a constant balance that I can guarantee? I don't get right every time simply cuz I don't have information. Everybody is not telling me and so I can't say I'll always get it right but it's it's it's a constant balance the Bells by Barbra Dykes ehrlichman my Tepee and I have to explain run one with the experience. You do start figuring it out the longer you've been in the hearing process with someone may be on your second 3/3 pre-hearing conference and hearing motions and you start to learn about the folks real fast. And then you can start moving along as opposed to giving opportunity to be heard is it is essential that's on a service of the of the of the hearing examiner office what I do want to focus on and I think you You touched on this and I didn't in my rsji response is we we really do have to figure out how we get access to that hearing room and I I I didn't set up the mha if he'll and I I don't want to speak for those folks that were there, but I can speak to my observation of what I saw and when I saw her 29 neighborhood groups and I believe what I saw and I don't know the background of of the people there or their personal orientation or their races, but what I observed was the rapper's Representatives the the the the attorneys everyone at the table appeared to be Caucasian to me and when you have 29 neighborhood groups, you should have some people of color force her for an issue that covers the whole city. And so that's the end I see that and where is her, and land use cases in a citation process is a Manchurian River City of the phases of Seattle. The gentleman I was trying to sell something on the sidewalk and didn't get a permit all the way to a Caucasian woman who had her Gardener cut the tree the wrong way the eyes as we see it all I don't see that in the hearing. So that's really I don't have a plan for that yet, but it is part of what we're working on it. I went to a meeting just last week at Village of Hope over and south of Seattle as an opportunity to start developing those relations. We like to think that that's where it's going to start. They got to see the face of of the individual cuz I can't go to those communities and tell them this is how I do what I do. This is what you need to know about me. I need to go to the home and find out what's what I need to know their story before I can I can come up with the answers. Thanks, excellent questions and cast members get a thank you. Thank you very much. So here's a process first. We know we start with daylighting the process such a public knows we're evaluating you and I who sent out evaluation forms to your office into our council members and we're seeking feedback on your the last year and where they should be confirmed. You'll get after the day after a few written questions on this follow-up questions that kind of thing talking about your vision for the next couple of years. I will have this in front of this committee again on April 16th, and I'll schedule a vote for that day. And and from there we'll go to the full Council on April 22nd. And so that's the process and so next couple weeks will stay in touch and thank you for your public service. I mean it is that public service and to appreciate that and thank you very very much for a Shepherd Yankee Council, okay. Okay, so why don't you read the next item into the record and go ahead first Samaritan app presentation, unsheltered individuals Financial capital and relational guidance. Okay. So whoever's of Philly come on forward here walk right here and try to sit on my left over here. We have Jeff from Central stats going to join us. And for the viewing audience, I lost a few with the land-use discussion. Hopefully they'll tune back in because We're going to show some technology and I'm always nervous when we use technology like this that we haven't done before of it will be fine. So let me get up the purpose of the discussion. Today is simply that is that just one second. Let me gather my notes year. this once I get so Jonathan Kumar has been Diligent in trying to explain to the city of Seattle sure the benefits of this app that that I've been told about and I want to thank you first for your patience. And I know dealing with city is a huge BRP ocracy sometimes and so I think for your patience and this app we want to know today how it works and how it changes lives. There could be some policy questions. We may have I did invite members from the human services department and I T who I think around here in the audience whose mhst we had hsg here. So they're here just to are they weren't a part of bringing you here, but they may have questions I can get them to me, but they're here to show to help evaluate as well. And so I'm so we have here from Central staff was just sort of monitoring. This is well. This is going to be informal by the Q&A and thank you. Thank you for being here. We really are honored to have you so why don't we start with just introductions and then I'm going to just turn it over to to however you like the receipt Jonathan. Jeff Sims Council Central staff Jessica McCoy 0 Samaritan Jonathan Kumar founder of Samaritan app thank you this morning for for inviting us and we're excited to be here and hope this will be enlightening and hopefully entertaining for you guys. I will take 10 minutes to talk about the technology were ultimately here to talk about a contract to provide a access to new technology for people who are experiencing homelessness and so will take maybe 10 minutes to explain how it works and will have a stopping moment for questions for myself or Emily. Any the beacon holders. We have a current Beacon holder who's experiencing homelessness and then a former Beacon holder of another alumni who is been permanently housed. And from there. We will talk about some of the outcomes that we expect to the city of Seattle to Experience through a pilot expansion given a contract and also have some information about potential budget roll out for the next three years. So I guess I'll start at the very beginning just if you're interested in how this all came to be. I was standing a couple blocks away from here on the corner of 6th and cherry on a lunch break at my last start up and I was watching a black man Panhandle for about 20 minutes. He held a sign that said I need medication for the diabetes in my feet and I saw some gingerly standing there as not a single person walking by him that existed in a single car window open to him. He's fairly imposing figure actually flat. Brim hat tattoos Overcoat fairly large, so I should have mustered up my courage to go up and talk to him and I just asked him like she's answered. Do you mind if I ask you what you feel your challenges are in terms of raising this money? I do feel people. Don't carry cash anymore. Me off. You just said I've got the wrong look for this the wrong clothing the wrong skin color. Nobody actually believes that I'm homeless. And that was sort of. Genesis moment where I realized that beyond the financial poverty that this person was experiencing to the point where he was begging strangers for help. He was experiencing a find a relational poverty. He was unable to cut through the Pisces or the perceptions of people to share his true identity history story people passing by a couple seconds not having the time or ability or capacity to understand who he was in his true needs with a simple way to help and so that's why we fast forward two years and some change we have developed these smart wallets. Oh, yeah, you can pass it around called called beacons and we have provided these beacons to several agencies in the city who have used them in our relationship building and navigation and we had a 500 Deacon pilot that was contracted by Vulcan actually here in the city to evaluate could this actually help people Elevate themselves off of the street? And so we're here today at the conclusion of that to your pilot. Thank you DIY with on the behalf of over 10 agencies in the city and I actually have some written statement that provides you at the end from these agencies that couldn't be here with us today to ask for access to more of the technology to provide to up to 2,500 people by the end of next year that are experiencing homelessness. Agencies, are you referring to organizations and businesses? Not City agencies or departments. So Salvation Army Mary's Place rest on the second slide right in front of you'll see some of the organizations that are requesting access to more beacons to use again and Outreach relationship building and so forth. So I'll dive into how the technology works for about 5 minutes if that's all right, and then we'll have it some time for questions for than the guys are here. So as I mentioned we provide these beacons is not reach tool. We have seen that about seven out of ten people who are invited to have a deacon will end up accepting one. So these are panhandlers. These are people on street corners these people at off-ramps. These are people at millionaire Club outdoor meal site whether they be in a meal. Center or a day Center or outside? The basic message to them is like a this thing helps you accept credit card donations from people want to help you can spend it from at any of the places on this map or you can sit down with a counselor. Would you be interested in one received roughly about seven out of ten accepting this form service once someone has a beacon we have a group of almost 10,000 Samaritans in the city of Seattle who have equipped Samaritan as a personal an immediate response to someone's homelessness. Are we partner with organizations as well that I can even add money to Beacon holders for completing volunteer behaviors. So you can imagine if you can holders are invited to come clean up a park or to participate in some sort of event you can have $10 is $20 to everyone speak in that sort of thing. You can always have the opportunity to share their store. Are you the platform as well as well as a portrait? And so if the beacon holder has funding their Beacon we had we have to have a Samaritan that starts every weekend with at least $10. They can use the money at participating businesses or where the counselor towards goods and services. So we have places like Goodwill Grocery Outlet South St. Vincent de Paul a different top chef restaurants. And because the needs of the population we serve are so great. We can hope to Canvas all of their needs within the business Community here in Seattle. We Empower counselors to access the money if there's a need that the beacon holder has this out on our Merchants list essentially the counselor can access the money towards a rain check a greyhound tickets bus fare and we can speak to a cell phone bill really anything that the person needs. I think one of my favorite outcomes to the project is that once a month we can holders the battery actually dies in the weekend and we can holders have both the opportunity but also responsibility if they want to if they've done enough value from the beacon to want to continue to use it. If an opportunity to have what we call a Life Care visit with a counselor at a nonprofit, that's about a 10 to 15-minute conversation where they're talking about how the last month when they're setting goals for the month ahead and they're sharing a greatest financial needs to get in there. They have an opportunity to share that progress update with supporting Samaritans and we see about 99% of Beacon holders opt into that opportunity to share with the Samaritan Community analysis is very helpful, especially as you wrap up two years. I'm one of the things that we here if you listen to the consultant who's come to the select committee and presented markdowns and his team I'm have talked about the way in which our intake process can be re traumatizing especially for folks were living unsheltered and the disconnect between the questions that are asked. Intake for Amore, you know consultation form versus the type of service at someone needs that may be harmful to them. Every time they come in one of my can you explain how the monthly consultation that you just described is going hand-in-hand complimentary whatever processes that d e s c or the low income housing Institute Lessons Learned where this type of more I would say relational discussion could supplement some of the quantitative responses that many of our agencies are being asked to do any Lessons Learned so far and can you help a stressed that this isn't being added to the list of reporting requirements Friday individuals perspective, so, we're not re traumatizing phone. A lot of these incredible agencies are already having these conversations and we want this to fit within their existing Frameworks. I'll have a demo of what it looks like at the end. But I'd also like to invite Emily to make sure her experience cuz she has Matt she's it sounds like you have helped people sign up for begin as well as you've met with Beacon hosingen monthly basis. So maybe if you would be willing to to speak to compliment muskets question sex trafficking or a sex work, so it's already traumatizing to bring up the narrative. But when going over the needs weather that's weekly daily monthly. They said speaking in front up as an opportunity for folks that are engaging in chronic homelessness. So this is a discussion. That's not only some of that comfortable with them with me, but also with other providers in our area and they know that we You want to create safety? So these questions of how did you become homeless? Will you like to refrain that and say do you do want to disclose that you're homeless and what would it look like for you to receive that assistance? So this is their language their narrative and they want to express that and with Mary's place. I work with around 200 Lumen on a daily basis and we would have check-ins maybe three to four times a day depending on the schedule of the month and it was just a quiet time to just sit amongst all the chaos. I've been stood Services being provided and just really investing into them personally and for them to have a moment of being seen and being known as super important and that's what Beacon like your visits provide. Can I can you explain? Rest is what they do. A lot of people may not be familiar with r e s t r e s t waited through sex work. We work with trafficking victims as well as those that are engaging in survival sex or sex or substances. I primarily work with sexual and gender minorities. I'm so we work within the confines of King County, but some of my clients have even gone farther to Bellingham and feelings to Eastern Washington. So I provide wraparound care. Just at the quick conclude that the technology introduction I could see on the screen here at slide slide a tan on your printouts. That's a screenshot of the app that Emily is used to do if the person has a need that's not on our list of merchants to targeted again towards different needs that they may have that's a conversation that happened at Mary's Place the picture that you see there and then and then yeah, so in conclusion to this process of providing for these real critical emergency needs more potential strategic needs and wraparound relationships. We we have seen that when you combine these two things we're seeing outcomes of Readiness for housing brightness for treatment admittance if there if it if they happen to be using drugs on and Readiness for employment job training, I'll provide two case studies actually one is is with us today Michael. He he received the pecan and mentioned. I think one of the most powerful things you mentioned to me was how the Good Samaritans investing in your life was one of the ways that you kept yourself pointed in the right direction. It wasn't like he was paying for housing through the beacon. It was about maybe $50 a month, but it was just enough to to fill in some of the small gaps razors winter clothing the ability to go into restaurant and pick out an item that he wanted like a normal person again and over the course of six or eight months or maybe a little longer actually. That the one on one to Life Care visits you having a discount store was able to eventually find him a place that he was comfortable moving into in Shoreline. There is another example, so. I think points to the value of the relationship and and there's another person who couldn't be with this here today. His name is John. He received a beacon and over the course of the week received about $125 in about 5 to $10 increments. You can holders receive text messages if they have a phone I can receive texts or then get an email whenever someone invests into their life and so he was getting repeated text messages from these random strangers saying hey, I believe in you keep your head up. I want I want investing in your life and he called us about a week later saying hey turn off my begin, which we thought was bad news at first, but he's like I've decided to finally enter treatment and I'm going to be gone for about three months and we were we were ecstatic and we were in our database turning his profile off. And we saw that he actually had to spend any of the money is $130 sitting there and it it it wasn't even that he needed to meet these financial needs. He just needed to know that he was worth investing in so that he could start investing in himself. So there's there's a about 43 stories like that from our 500 pecan pie about 9% of Beacon holders have reported to either the counselor or to us that they have gotten house or employee or entered Sensor 2 treatment program with the thing that we can control most is on is a beacon holder or getting enough value from their Beacon such that there are willing to keep using it on a monthly basis at basis and accessing our web of care. And from there. It's our incredible organizations that are doing the heavy lifting in terms of permanently housing them or helping them into recovery. The housing outcomes are not to be ours and they're not ours to credit. This is a technology to help nonprofits incrementally add to their outcomes. And so I think this is actually a good stopping point for additional questions for either Beacon holders. I'd love to talk for about 10 minutes afterwards about some of the outcomes we would see from expansion before I saw the members of the table few questions practical applications. Then I want to hear some more hot how it affected lives. So, can you Volume representing. She didn't want to be going to use your phone. Okay, so I'm not in one of those machines in a very long look the kind you so we're not like that though. Oh, I look at that. Okay. Or just get up. Okay. So you have the technology ends and begins with this smart wallet call the begin. It runs on a Bluetooth transmitter is working up to you if you need to. The technology starts with these digital wallets called beacons. This is the Samaritan app and will allow volunteers as well as nonprofits to carry out a intake with a beacon holder. So it's just a couple questions that will be asked about you know, how long have you been on the streets would let you to be here. Where what do you aspire to be? What would you want to be? What will you be when you're not experiencing homelessness? Yeah, we start right from there. So I download the app on my smartphone if I'm interested in participating as a as a Samaritan and we have thousands of people that have participated this far in this almost 10,000 people would they have known about the app? Because homelessness is such a pressing issue. There's a lot of word-of-mouth next door communities the median. We have been invited to equip employees at Facebook at the Lloyd at Nordstrom because these individuals who are working downtown or confronting the issue on a daily basis. They been real interested in a tangible way to help. So even without a expansive marketing budget just threw Grassroots. Mark Sound Transit donated $5,000 towards a PSA on the light rail. And the the Metro buses are advertising budget has been about $502,000 a month so far and you still there you are able to get 10,000 Samaritans almost and one of the questions that I've gotten as a council member are a lot of people live ACNL say what can I do? You know? What can I do and you know, we talked about the agency's week. They can't give money directly to the city of Seattle. So in a lot of folks probably are not in some of those Facebook circles not annoying, but that's okay so that the Good Samaritan download the app and then what happens when they're in proximity. How do they know how to act they see Mike Michael Michael Michael Michael, they see Michael and they want to activate my condo your former, but How does it how to deactivate to get to know Michael story? Yeah, they do the Samaritans. We have this community news feed which is what I'm going through right now. It'll show you a new Beacon holders that have recently joined Samaritan be can holders who chosen to share their monthly Life Care visit with the community we can holders who are in a redeeming things at different Merchants around the city. We can all those who are completing goals. So there's a way to discover individuals on this platform. We have a beacon holder the day you'll see this instance. There is no photo because we give you can holders the option to not take up to not share a portrait of themselves. So we'll have a beacon older everyday. I will send people push notifications occasionally, but then we also have this Nifty thing with the technology wear if the beacon holder has opted into this they can just by having their Beacon, which one Bluetooth if a Samaritan walks within about 30 yards of heavy can holder they'll get a push notification on your Android on your iPhone. That just says hey you just pass by Jared Jared's been on the streets for 6 months and you'll be able to see his story that way if that was the part that I was thinking about is the show the automatic connection show if I see Ravens an example, and I'm have my Bluetooth on I can also if he has any like you have a Samaritan app had and I can know if they're connected if you brand if they're branded or I could see this physically see the the beacon. Yeah. Yeah. She's obviously near the Raven so she got to push notification that that was that Ray was nearby so that's how we see a fair amount of discovery that way through those organic. Encounters on the like you be on a bus and you'll just be going downtown and then you'll pass by a couple Beacon holders who are on the on the corner and you'll pick up notifications so we can hold it will just be walking around the city and then those get hit up with text messages saying like a someone give you twenty bucks. Which is I mean Raven, maybe you can speak to what that feels like. Yeah, it's always interesting. I keep my phone on me in general like most but like I'll get texts all the times. They know I have thrown donate this much. Someone said this but I've gotten texts from people saying hey, you want to meet want to hang out want to do something, you know, like the fact I get those texts. There's money on not money and doesn't bother me none really. It's the fact that they actually take the time the effort to care. You know, it's the fact that I have to check in once a month, you know, a lot of people like well that's responsibility. Yes homeless people most of us want our responsibility. It's hard for some of us because of the background because of a drug addiction or what-have-you suppose you'll look at us really down but a lot of us trying to get job trying to go to school trying to do stuff. We want that responsibility. You know, I'm so having that two people Just to hang out. I mean, I've met some amazing people through the app that on a daily on a weekly, I hang out with Raven you'd mentioned something about receiving messages of encouragement gave $5 to one of the beacon holders Alicia and I have this option to add a message of encouragement and this will be received in a couple different ways if they have a phone or get a text like Raven does if they don't have a phone to can get an email if they don't have an email address that they had access to the next time. They stop by a merchant or a nonprofit. They can receive that message and respond that way Michael. I'd also love to hear from you about in a what what happens on the receiving end how that's been for you. well as Jonathan already said I want you to permanent. I got the permanent housing been there for just over a year, but before that. It wasn't so much. What I was buying with the beginning as much as just what it represented don't it represented is just a feeling of normalcy. You know, it's a I go to a restaurant and I can order something off the menu specifically I go to one of my favorite stores in the Army Navy store then because I could I felt like a regular customer in feel like someone who was in the system. I didn't feel like someone who need to be helped. I'm getting a handout from the government and in a vet. Wanted to me was the most single most important thing about the beacon just how it changed my outlook on the situation. I was in and how I felt about myself at the time and I really truly wasn't about the physical things I could do with it. You know as you're talkin I can't help but think about a few unintended consequences and I'm sure you've thought through it. He's already so maybe help us with the process that you went through to address on getting some policy questions. I just asked a technical question. I just want to get the so so The app receives some form of a donation the the vendors so I so it's loaded on a on the beacon. So how does it transfer to the beacon transfer to the store this receiving? Right? And so everyone on either we call them Life Care Providers, whether they be merchants or nonprofits. So when the person walks into a barbershop or they walk into Mary's place, they both have the same app and Samaritan so they're able to bring the beacon up because you're logged in as a life care provider are they able to see additional things like battery life the balance and they can charge a good or a service to it? Okay. So the vendor if you are the store they have to have the app thing on their able to withdraw the cut the conversation right from that app, and they could goes to there till right sickly, right? And so if it's up a barbershop, let's say this doesn't have the app. They obviously can't take it but So part of your task will be to try to get as many vendors as possible to receive the app. I think one of the Lessons Learned these two years and it's pretty tough working with different businesses to Canvas the needs of a beacon holders. And so we looked at further empower the nonprofit to allocate the money towards whatever is needed. So the nonprofit can put money towards a Orca card. They can put money towards a a phone bill if if if they feel is appropriate they could give us a prepaid card to the individual. So we we've trying to get a simple for the nonprofit to be I was trying to figure out how the 10 nonprofits came into the picture. So that's how they come in because then they are up like a wholesaler if you will they'll come in and try to look at the end of the needs of the beacon holder and purchase would there so many incredible people and Programs available at the organization's listed and our job is just to help people get connected to get plugged in and so the beacon and I will get to some of the outcomes which relates to this but the beacon is a way for them to build relationship and get them to opportunities that are much greater than it begin. And what if a Samaritan after 6 months, let's say the receiver source to bug the Samaritan can they go back in and then cuts it off. I mean, what is the control is Samaritan have on the contact if he or she wants to change courses sure know a personal contact information. So if you message has a beacon holder, they're not seeing your cell phone. They're not seeing your email. We are monitoring responses. So we are tracking potential abuse. We haven't had Quartz or seen anything damaging to date not to say that it won't happen but there will be ways for Samaritan to be no just close a chat. So usually if I text him they could all just see my number on the receiving end. So this is a Samaritan so it's like this would be within Samaritan. So if you're using Whatsapp or Facebook like you had you have messages with people and then you can block them if you don't want to talk to anymore. I was just looking at how someone controls it on the giving end of it right wood with interface. They have IC to close a chat starting the receiving end. I mean the population that you talked about having more on human trafficking task force for a number of years before this job. We know how vulnerable folks are and I think you know some of the Some of the folks who are experiencing homelessness are extremely vulnerable populations. You say you're monitoring the chat. Do you do the receivers also have a chance to shut down a conversation because I feel like there's a power Dynamic at play. If somebody were offering you $5 or $20 in its means you can go to a shop or go get food. Finally having the Not Justa bility, but the requirement to shut down anybody who might be predatory in this process an hour and try and engage in create a relationship with someone for non Samaritan course seems really important. So how how does that work? In terms of both you monitoring the number of the type of communications and ensuring that there's not people out there who are using that power or that privilege and their ability to donate to manipulate a relationship. We have the ability for both sides to report an appropriate conversation or messages and we have the ability to ban either Samaritan from sending a message or a beacon holders send a message for husband bility to report wage theft or retaliation in their current their daily work, but a lot of people don't report when there's a violation wage theft intimidation harassment assault. Because of that power Dynamic so are you or are you saying that in addition to the receiver being able to report if there's a violation you are actively monitored at this time because it's an experimental features that ability to send an send a message of encouragement to Beacon holder as well as to receive response because we just introduced that we are actively monitoring proactively monitoring those conversation and I saw some suggested text, but they could also send that can happen and I love the examples that both of you share just about sort of the investment the value that the encouragement that you've seen when people have written to you. So thank you for sharing those examples. I just population that was a major concern. underscores that how important I think this could potentially be in addition to Reliable public Revenue Raven folks are talking about needing to make sure that there is access to food food stamps and affordable housing and job training programs in counseling and I think all of those things require public investment and a reliable public Revenue, so I don't hear you saying this is anyway, it's the planting that so we need those public dollars that will be non-discretionary as a building block the concern that I might have is this word to be a standalone right is that to some degree? It is still discretionary, you know, the example of the individual that you talk to First who was I'm experiencing probably racism and and stereotyping and based on skin color and tattoos and appearance like that. I assume still happen. So how do we avoid dealing with the type of stereotyping or discretionary nature if at all in this app, or are you saying that that will always happen and what we need to do is Backfill some of these programs with reliable non-discretionary public revenue is a core identity to Samaritan and $200 for that month, which could be the difference between life and death which could be the difference between getting into that house or not. So the discretionary nature of the funding is something I appreciate I mean the discretionary nature of the Samaritan did she pick and choose who they got something too and that's something we're exploring to we have a internal goal to we've seen a sweet spot around $802,000 a year in terms of picking holder retention meaning those having those monthly Life Care visits to continue to use their Beacon and in so that's about $80 a month and in so We want everybody can holder to have a guarantee of two things on access to about $1,000 a year and access to the transformative relationships. If we can do those two things and provide people as social home before they get a physical home and then do it through the the work of these nonprofits what we think we've done our job and so we are exploring ways where it's not as discretionary. It's like who gets the money like we will have a fund we call it the Samaritan general fund, but that will actually be disseminated to to be can holders survata automatically. We will also have ways for people to give to geographies and if people identify with a neighborhood like hey, I hang out mostly in the Central District or hang out mostly in in Ballard for Ballard owners to give to Ballard and for that to go to all people who identify as any on Ballard. So actually your questions you at your asking a question and I should have had been a different ways to let me tell you about my my my thinking was it if if the if the recipient wants to tell their story a lot of them may not even be able to keep it in there. They may not have they may struggle telling their story show. How do you help them? Tell their story on their intake happens through the Samaritan app and there is a form on there that will just have some optional questions for them to respond to just like how did you get to the streets? Where are you aspiring to go? What are your greatest needs to get in their job skills that you have interesting life facts for the on behalf of the beacon holder. Okay, because to customer Mesquite this point I was thinking, you know, these five folks are constantly getting 510 out in thirty bucks and this over here. Their stories of a song about their story. Yeah, and this person there are Daiquiri gems in this person story that no one pulled out and then yeah. Oh well cheese you used to do this and you want to do this. So I think that's because I was thinking about there's always her winners and losers and certain programs in so I think what you're saying is so the volunteer helps, but that's that's that's a bunch of your organizational. That's the only other nonprofits or the nonprofit stuff themselves and they let you know everyone's changing that has uses Facebook in those kinds of tools are changing and Brooke profile changed. So do does the recipient sometimes occasionally change your story and I'm doing better and it actually made a really hard on the nonprofit's to change the profile you can holders but we are working on that and they will have the ability to update the profile with the next month's goals than the person that sent with the next month's Financial. Needs on a map during that monthly Life Care visit and is I'm just going to have to ask is it a 501 c 3 sister donations are tax-deductible or we got some we have a fiscal sponsor that we process the donations through which makes every transaction tax deductible. Thank you and that you don't feel free anybody at the table to answer these questions cuz I feel like I'm just brainstorming out loud here but I really appreciate you both again telling their story about how this has helped in the stories that you brought up about some ways in which you seem folks not only get into housing but also treatment may be additional support that were necessary because they said they had access to this Begin Again on these sort of Technology unintended consequences. So I think we've spent a lot of time in this committee and others talk about data protection. I worry a little bit if someone is engaging in conversation with that one individual has gone from donator to not worthy and how folks are being tracked and you know, the the the concern I have is the protection of the data and the location of folks the type of hate that we've seen in this country in the volume has been turned up on both racism and classism and sexism and homophobia. I think you know In terms of vulnerable populations. I know you folks who are living unsheltered have experienced increased numbers of hate violence. I don't know what else to call it. So how do you protect against individuals from tracking where people are at and who protects your data we use some of the best security and Industry in terms of production. And in terms of the tracking there isn't any functionality possible for real-time location awareness of Beacon holders to the beacons have their running Bluetooth which the ranges from maybe me to that wall over there. So if you're outside that range you wouldn't know where that you can was there's no Google maps of Beacon hose running around in real time. This is no way we could do that. There's no GPS says no Wi-fi. There's no RFID Fitbit discretionary thing I think is important and it is something worth learning. We I mentioned briefly earlier that we we want to empower organizations including the city of Seattle to award. Beacon holders are add money to be can holders and do that indiscretion way. So I'll be can holders may be bad complete this act of service or I'll be can holders in this area or just hope he can holders will receive $50 that you guys know will be money well-spent because it's spend in concert of someone like Emily. Well, you know me I me I'm a bit so it's I don't have too much issues. But the fact that like you don't like Jonathan said, you know, they can't really track US. Unless we hang out with them personally and tell them where we're at and stuff which you know, I've not had an issue yet with that thing fully so but I don't know anyone who else has but like it is a big concern for those of us who are homeless cuz I've dealt with a ton still due to a point. So I've never met anyone snap that has been at all threatening. I found people helpful way more helpful than anything. So, You just speak like a privacy or feeling tractor mistrusted biggest things about the beacons. Was it offered in Amity? You know what you could donate to someone if you didn't feel comfortable giving the money directly, but I kept people we're actually once they once my profile can one on their app. They were actually looking for me and I was like, oh I was going to meet this guy now and it was like and think about it like that. Oh, that's really cool. Cuz now has it's actually Bridging the Gap because it's now the person was using Samaritan because I didn't know how to approach someone but now they're willing to do that because they read the profile. They know they're helping me see this person is like right there. Set director facing homelessness whole bean is one of our advisors and and he propagated this movement of just saying hello, and then so certainly there is evil that can be done face-to-face, but we are absolutely encouraging personal face-to-face interaction as much as we can. Look at the the budget piece that that were there other parts cuz I wanted to Okay. Okay. Okay. Let's go ahead. I'll just look over it like that the five critical outcomes that we want to deliver on on an expanded pilot. I'm so I think that is starting. It's like 12 and 13. I know that one of the key metrics that organizations like the navigation team reports on his service service acceptance rate. And so for example, the Union Gospel Mission maintains, the search-and-rescue Vans for which there are spots every night for people to come into shelter. They are turn down 99% of the time and so when people are unwilling to come in for a job opportunity or for a shelter opportunity or a treatment opportunity they have been willing to accept a beacon which is a very low barrier form of service. Hey take this thing is $10 on a go get a meal people will continue to add money to your weekend. If it's helping you come in and talk to us at that a month and we'll get it started back for you. So it's it's a it's a very low barrier way to help people think about accepting services that normally don't accept service until we expect that given an opportunity to expand access to begin. We will see growth in service acceptance rate across organizations that are using Samaritan and it work the second outcome that we see is is reduced recidivism from programs. So let's no-shows left dropouts. If we are if I am doing my job and my team is doing our job and we are making sure that the beacon holder has access to meaningful Capital. They will be more likely to continue to access care which is the true transformation meeting with people like Emily. Accessing employment accessing treatment recovery that is the transformation, but we can help people stay in track with those programs until the life-changing outcome is achieved. So we would have we would look to see that people entering a program or more likely to succeed and stay in that program if we can provide them if he can on the third, how come we see for the city is obviously citizen engagement. So just to private means of our budget from Vulcan was roughly $100,000. And so we we will expect that many more Samaritans in Seattle people who like you've been asked. How do I help? We'll see this is the low-hanging fruit. Everyone has seen that come on his documentary. This is their next action step. And I think to fact-check the Komo News documentary would be a good first starter because I wouldn't say that that's an accurate or he's covered face. And nor would I call it a document just putting that out there? Oh, yeah, we actually have whenever Samaritan app users here. I know we're running short on time. I love to have you join us at the table. Yeah, I took from the Samaritan engagement standpoint, and I understand we are limited on time here. I meant just make sure the green green life is on pull the mic and so it can we just talk about why you sign up and how its work for you know, my name is a zeeza sastre. I joined I download the app that July 2017. I remember night my number I felt like 3940 something. So yes. I decided to download it because I had done the Union Gospel Mission on a search-and-rescue born and raised here. So I've seen the you know, the homeless how much is exasperated in and so I got invited to the search-and-rescue and I have to say that was a real tough. It's really took an emotional toll on me. You know, I realized it was it was a good experience. But at the same time it it was just it was too much, you know, and then and I was talking about it with a colleague of mine and she had come across she had heard about the Samaritan app throughout I think Cairo or something a news peace in and for me I said I felt this would be a better way how I can engage and cuz I'd want to do something, you know about the same time. DIY for me I want to do something but I wanted to do it in a way where it's not too much of a motion told cuz you really do have to have a mental strength, you know, cuz. I remember that night you you learned so much and there's so much to their story. They're just not someone on the street there's more to them and you know my stuff for me this app has allowed me to you know, everyone's story and it's a way to engage and also like I downloaded and I've been doing it since thankful for our primary mission is again to to give people access to Capital and and relational relational guidance, but I'm one of our secondary outcome is is giving people a way to walk with individuals on the street. Into the fourth. How come we would see for the city is that we will be able to D identify and provide a rich source of real-time data on on how to help people experiencing homelessness those monthly Life Care visits provide insight as to what people schools are as well as their greatest needs and so we will be able to see on a month-to-month basis. What's keeping people back with moving people forward into permanent housing or employment opportunities are or treatment for Kennedy's and then and then ultimately were looking at and being able to provide Hope housing Better Health outcomes for and by the end of year 3 mm of our City's most vulnerable you may have seen earlier we had called out. That's odd that we would look to permanently house 500 individuals. And so we'll we'll talk about why this number is 2000 the second here. So going on to the next slide where our budget and we we see that and to provide a to access for 2,500 people to access a beacon by the end of next year and we are looking at are we having a we have 5500 now and will look to provide in the next nine months access for 750 this year and 1250 next year and we will predict we will see that of the 750 this year. 75 of those will will reach some sort of life-changing outcome Weatherby housing employment treatment and I'll come as well as an additional about 250 at least meeting critical needs in their lives, which I don't think should be understated. I understand that that's not necessary that I will come back. City is tracking but for people like Raven who is not yet house not yet employed, but at least says is connecting community in his Reading critical needs to keep his spirits up at we want to make sure you call that out as well. So I would love to leave some questions for the budget. If we go to the next like to see some of our expenses from the hardware store the data provision in the platform development. We actually plan on granting one of our lead agencies a full-time employee for for helping train other organizations as well as trained volunteers to you know, provide beacons to folks who are interested in having one as well as train people to effectively use those monthly opportunities to advance people's lives. And so they're there is a small advertising budget in there as well as some operational items ultimate Lee. We we know that every person who enters housing doesn't necessarily save the city hard out-of-pocket dollars. I totally understand that but I do also realized that when one person exit the system and provides that opportunity that that shelter bad or that program for the next person that needs it and dad has value. And so it's really up to mina City budget office said to see what that value capture / housing outcome is but because this is inherently technology-based we see this pilot as having the great r-ry opportunity for the city, so Thus far your inaction the city has been what have you met with some departments or just talked to some of our some of the agencies that we fund or can you talk about your interaction with the city? That's far outside of this presentation fan, which I believe is City initiative date. They use beacons in their in their Outreach in the relationship length. I'm trying to think of other City funded agencies. I'm sure there are many so we've been working with the the nonprofit's to try and Empower their outcomes first and foremost and then we've had exploratory conversations with Dusty and Basically city council and soon-to-be. I'll meet with that David Mosley the deputy mayor best forthcoming. Yeah. Okay. So a few things one is I thank you for coming and sharing. So as I explained you offline, you know, I personally have an interest in this technology. I don't see it as as as curing cancer of this problem dealing with that I succeed. Is this possible to look great too. Well at that and should have shopping into a An unused resource off in that is just people that want to want to help and they don't know where their entry point is and some of the concerns I had, you know, the customers get a raise I had as well about no, we we we really try to make sure that there aren't unintended consequences of you even well-intended Investments. So from this point, what I'm hoping to do is have some discussions with the Department said they would fall under both hsd and I T and maybe maybe even have you back. I'll talk off offline with you to look at Budget Inn Paxton the whole bit but I sure don't want to see at work and I think you did an outstanding job in the participants are standing at outstanding job should tell him that the stories behind it it when I hear good people like this talking about the fact that it works. I mean, you should like that movie said you had me at hello Raichu. I see the stuff working. So I look forward to continuing our discussion. Are there any questions if you had of the to count Summers before we before we return go ahead. So we'll talk offline about a game plan and it will be talked to the pharmacist. Well one more thing. The pilot evaluation. We want to make sure that we convey that we want to find out the impact of this can make as badly as you do. We understand that we have more to prove and that that burden is on us we've shown some anecdotal outcomes from a small pilot group, but there's more data show. This can make a scalable difference. And so we expect that where we to do a contract that we love to have a structure for 3 years, but we understand that the second and 30 or maybe conditional on the outcomes from the first year that are measured. So we're totally comfortable with that. One of the things that we want to learn is The difference between a beak and older population of the non Beacon Hill the population of a randomized control group would be a part of our initial pilot in the first year if there are 750 peak in Zebulon individuals. We would try we would develop a control group of 750 people without a beacon and we would love to get a. On both populations and be able to see like does it really make a difference or is this just conflated with different opportunities? I just want to make that clear that you know, we expect to be revisiting metrics quarterly. We expect to be looking at the percentages of of Beacon holders that are elevating their life forces a non Beacon holder. We would like to team up with the city on access to historical data on emergency service usage on bobtail rates arrest rates things of that nature would be soliciting feedback from different nonprofit. So all the say that we want to Pilot this with you guys. I'm and continue to evaluate does this make a discernible difference? We we feel that what we have done so far justifies the the Rays to give more people access and as well as give us access to the historical data and perhaps up the randomized control group continued to evaluate so we're not there yet. But we love to do this hand-in-hand with you guys moving forward or your your your way in front of the kinds of things the city looks that's outstanding description of the kinds of things the outcomes in the and the date of sport something the sustainable and in more important than that, it seems like the stuff is just really working. So I appreciate you being mindful of the kinds of outcome and measurements outcomes and measurement should City.", "end_time": 5421.3}]}