{"format": "raw", "annotations": [], "confidence": 0.9120118287743115, "data": [{"start_time": 0, "text": "Good afternoon, everybody. Thank you for being here for our April 22nd full council meeting the April 22nd. 2019 full city council meeting to come to work is 2 p.m. I Bruce Harrell president of the council the clerk. Please call the roll a present. There's no objection the introduction and referral calendar will be adopted. An object's motion the introduction in a pro calendar is adopted. Also moved to adopt the proposed agenda. How is the move the second and I would like to make an amendment? Let me swear to describe it. I'll move to amend the proposed agenda. To include the voting procedures for the appointment of city council position number for listed under the item of business to be as follows at chair. I will open nominations to fill the city council position number for council members will have the opportunity to nominate an applicant's in a napkin will need to be nominated by a council member for them to be considered and a second will be required to consider that nomination. After nominations have been made the call for nominees will close the council members will then be given an opportunity to make any comments about the selected nominees the factors or Criterion, they used in deciding whom to support and any other any other information they wish to share before the voting begins. When is it time to vote on the nominees the clerk will call the roll and council members will respond by stating the name of the nominee. They wish to a point from the selected nominees council members may not change their vote until the next round of Elections. Should there be one if one nominee versys five or more boats that individual is appointed to fill position for and it will soon office immediately after accepting the position and taking the oath of office if the nominee does not receive Five Oaks the next nominee will be considered and if no nominee receives 5 holds the process will repeat until a nominee receives 5 or more votes. So that is the amendment. I'd like to propose for the agenda of any questions or comments about the procedure described. Okay, so we're going to Mindy Jenna all those in favor of the voting procedures for the appointment of city council position number four as I described please vote aye aye those opposed vote. No. The motion carries the voting procedure has been established there for those in favor of approving the agenda as amended, please vote. Aye aye those opposed vote. No the motion carries and the agenda is adopted as amended. approval of the Menace 2 minutes of the April 8th and April 11th, 2019 City Council meetings have been reviewed and there's no objection. The Menace will be signed. You know Jackson the minister being signed. Presentations are not aware of any presentations this afternoon. So we move to public comment. at this time we will Just one more out of here. Check your notebook. At this time will take public comment on items that appeared on today's agenda our introduction fro calendar and the city council's 2019 work program in so I'll call you out in the order with what you signed up in this right here. We'll start out with mr. David Haynes followed by Jenna Williamson for 2 minutes per speaker. City council, we needed invigorated pedestrian Advisory Group to influence the 21st century development and combat the abuse of being a pedestrian disrespected by road rage horn Honker. We need to elevate the punishment of road rage horn honking that's just detrimental to the health of individuals subjected to noise pollution that justify ticketing horn Honker. We need pedestrian priority as it is now pedestrians are subjected to delays in crossing the street cuz cars are prioritized forcing you to stand there breathing toxic pollution from exhaust causing leukemia cancer that any person unfortunate enough to be forced on the 3rd Avenue. Nosa pedestrians are subjected to road rage horn honking by are bus drivers inconsiderate of others while they honk while speeding through the bus stop getting off work or Wheeling on the Hornet Uber taxi Bowl. Every pedestrian is overwhelmed by the bus horn honking. So good luck to the 21st century attempts to give the people a reprieve on the city on the side of the highway figure is staying or are next. speakers Jenna Williamson father by Ashley Gordon Good afternoon. My name is Jenna Williamson. I'm here today as a volunteer for unified Seattle. I'm here to make a statement today regarding low-barrier Shack in canton's which are not only hurting the community. But the homeless residents themselves low-barrier Shack in Kentlands. Go against the recommendation of homelessness Experts Seattle has already seen Shaq encampments fail. For example, the lichten Springs encampment in North Seattle crime has doubled sales Solutions enable struggling homeless addicts rather than encouraging Rehabilitation the goal for these residents is for them to be able to live independently and support themselves. An example of the failure of these enchantments just two weeks ago. So Lake Union and can't mint locked out City officials and a hostile takeover. This was due to disagreements and how the encampments a run. The nonprofit groups that have refused the city officials entrance have also failed to show transparency in any outcomes on their use of public funds. This proves that they are the only ones to stand to benefit from the L'Auberge Shack in Canton proposals. Is Seattle continues in this vein the homeless epidemic in the city will only get worse and people will continue to suffer on our streets. We need real solutions not checks. Thank you for your time and attention to Ashley Gordon will be followed by Alan bickham. I'm good afternoon. I'm here in support of Abel Pacheco for the vacancy for District 4. I've known able for several years and I am here because I really do believe that. Both personally and professionally and in all of his spare time. He's shown a dedication to being a part of shaping the future of Seattle and his work with University of Washington in particular around diversifying stem programs is really personal to me as a black woman and someone who's interested in seeing initiatives that are inclusive across-the-board in the city. I also think that as a resident of District 4 as well as a professional in District 4, he brings a unique perspective on both ends of the spectrum around public transit and issues of homelessness and will do it with a sense of compassion, which is really important to me and I think to a lot of residents overall like I think in particular Disappointment you are looking for someone who can come in and kind of tow the line of bringing new ideas and A New Perspective and lived experience. That maybe isn't right on the County Council right now, but also someone who's going to want to partner and collaborate and see through the programs and initiatives that are already in influx, and I think enable you will find someone who can do that. So I really do hope that I help you no tip the scales in his favor. Thank you. our last speaker B Allen bickham Hi. I'm just going to talk about the Levee and I'm a student at Seattle Central College and part of the promise scholarship that's provided there. I would say it's been a huge benefit to be a part of that. I think it's nice for students to have the time to time to figure out what they want to do and take those two years if they're not ready. I guess having those two years I can explore and I really Under the Sea what it is that they want to do in college and are with what they want to do for the rest of their life and some students just aren't ready to go to a 4-year University straight out of high school. So I think that having that opportunity for future students will benefit them a lot and the Deathly has benefited me a lot and saving money to with college cuz it's very expensive. Thank you. Thank you. Thank all of you for your public testimony that'll close the public comment section of our agenda and we will move to the payment of the bills suction. So please read the title cancel 5:01 and ordinance appropriating money to pay certain audited claims and ordering the payment thereof. MoviePass cancel one 19501 removed and segments the bill pass for any further comments. Please call the roll on the passage of the bill herbold. What's Guetta president Harold Aiden favor? Please read the first agenda item resolution 31878 a resolution providing an honorary designation and 72nd Avenue Northwest to Northwest 56th and Northwest 57th Street as Rob Mattson way introduce day, April 15th, 2019. Brian thank you cancel president colleagues. I'm excited to pass his designation today 22nd Avenue between Northwest 56th and Northwest 57th. So that's the block between on the westside of the Ballard branch of the Seattle library has Rob Matteson way Rob passed away last year. He retired in 2013 from the city of Seattle having worked for the city for 42 years in 1973 and our mayor wesselman. He was appointed the director of the Ballard little city hall at the time as head of the Ballard neighborhood service center and founder of the Ballard District Council of opportunities were connecting residents of Ballard with each other in the city services through most of his career. Later years, Rob was often referred to as the mayor of Ballard by introducing this resolution mayor durkan along with his family and friends intend to honor Roberts Honore Street in destination. There will be a celebration as the signs go off in the neighborhood at a date to be named in the future. But Rob was someone I didn't get to work with a whole lot that someone who I know is respected by his bed everyone in the community Z amazing person. Thank you. Cousin. Brian any other comments or questions on this resolution? Actually my honor and supporting us think you catch my breath bringing stuff will come to the attention of adopting the resolution, please vote. I know the motion carries on a resolution is adopting sure will sign it. I had some fans out there to give him a longer speech. Okay, please read the next agenda item. The report of the governance equity and Technology committee agenda item to appointment 1277 the reappointment of Ryan P vancil as hearing examiner Office of the hearing examiner for a term to March 20th, 2023. The committee recommends reappointment be confirmed the confirmation or reappointment of our hearing examiner Ryan vancil little background for the viewing public hearing examiner is perhaps an office that a lot of people don't know what they do. They may associated with simply land use a peeled for certainly office covers much more including many issues that arise from our city code appeals that are taken to that office becomes a critical place because many people are not represented by counsel many are a critical play before really understanding due process when people are having issues legal issues associated with the city of Seattle's directions on land use and issues and many other ones Mineo. I'm so little description of how we got to this point over a year ago. We had an opening because of the retirement of our former hearing examiner to Tanner. There were several rounds of interviews the first round of interviews for the hearing examiner has conducted by a three-person selection and on that panel there were representatives from the Seattle Department of Human Resources that King County ombudsman the King County Bar Association for the hiring process described in our municipal code. And from that process over 20 applications were reviewed and five applicants were forward to the second selection panel up from that from that second selection panel that consists of four individuals councilmember former council member Rob Johnson who was chair of the planning land use and zoning committee and Watanabe. He was a former hearing examiner, Karen Jackson the legislative department Human Resources Director in myself, and from those interviews. Mr. Bansal was the top candidate. Fast forward to today in the research process. He was confirmed originally for one year and after that process the more exhaustive confirmation process. I took place very recently. I members of the governance equity and Technology committee on April 2nd and April 16th interviewed. Mr. Vancil and forwarded forwarded to him several questions and oral questions as well and presented the responses to the full Council. We also saw it free back from basically everyone in his office to Deputy hearing examiner all staff from the office of the hearing examiner and upon the review of all of the evaluations. I was very pleased to call for a vote of the governess technology in equity Equity committee, and he was unanimously recommended on April 16th a little bit about his background. He holds a Juris doctorate from the Seattle University School of Law. He Jose A bachelor's degree from Willamette University in Salem, Oregon and a master's a mediator certification certification in a King County dispute resolution practicum. That's what since July 2013 he served as the deputy hearing examiner from October 2016 to the 2018. And of course from 2006 to 2016. He was in private practice primarily operating in the area of land use in response to his questions about what what kind of hearing examiner will you be if you were so chosen in certified deeper dive in his Valley Circle what makes him tick and new ideas what kind of new ideas do you have? He had some very interesting and I thought courageous responses for that. I commend him. He talked about looking at their current caseload that is indeed picked up in recent years with all of the land use and Zoning issues that he is confronted with him. So he is very interested in a nuke. High School database system working with i t and looking at Best Practices throughout the country on how other cities in jurisdictions handle their database management of different if he's interested in exploring more mediation possibilities using committee section that he belongs to the land use and environmental mediation Committee of the Washington State Bar association's environment on land use law on alternative dispute resolution. She has some creative ideas and how to encourage in Foster mediation and many of these disputes. He's interested in exploring a video conferencing and sometimes I want to Skype or FaceTime in that kind of process to have more hearings and making it more accessible and available to members of the public who often have it challenging to come down in particular and some of the matters in front of them. He talked about. Embracing the rsji racing social justice initiative, I wholeheartedly with he and his staff making sure that all members have registered into two different workshops and understand the work that were trying to do. He's specifically looking at a translation product where the hearing examiner will take steps and identify where there are great option is to enhance access for individuals who may not speak English and he also talked about the land use section of being not very diverse at all and engaging both law students for student Outreach. Let them know this is a dynamic area of the law and the use of hiring lawyers people of color to active protem hearing examiner. She has a budget for that in going to be very intentional about that kind of Outreach has he moves forward. So again, it's my honor sport. Mr. Vancil is our new hearing examiner or return hearing examiner, I should say and it's my Ford in submitting this to the full Council. Any questions or comments from any of my colleagues before we take a boat? Okay, that's always a good sign that you cancel all those in favor of confirming the appointment, please what I vote. No confirm congratulations sir will could suspend the rules. If you like to dress the council the few words of wisdom. And I mean that literally so the wisdom Barbie. Members of the council and counsel president thank you very much for proving my reappointment to the u.s. Hearing examiner appreciate your confidence in myself. And in our office. I'm grateful to serve the city in the role of hearing examiner. Look forward to maintaining the office of hearing examiner with its historical reputation of dedicated efficient service to the community and working to progress the office with several initiatives the council president mentioned. I am now they don't have the time to see two through Pruitt fruition earlier. This month are in a report for 2018 was distributed to each of your offices with the conclusion of this process. I'll be reaching out to each of you to schedule a time to scuss that report the steps. I hope they go to next several years and see if you're in putting comment. I hope they usually will have time to have that discussion knowing that you're all busy and I may not get that meeting. I am that also that many of you are actually a cycling off Council. I want Express at this time in my regret at that change in the context that each of you in various ways is influenced how I am approaching the office. You you set a tone for policy and leadership in the city that I think is heard throughout your various staff including myself, and I regret the simply that you will not be here to see Yonder the distance of this year how that input takes fruit and the office progresses as I hope it will I do look forward to working with you under this this for this coming year and of course with through those who remain in future years. And again, thank you for your consideration and their appointment. Thank you. Mr. Vancil. Don't go too far away will now ask the clerk give you your oath of office. Rain, once again, it's my honor to administer your official oath of office. Please raise your right hand and repeat after me I Ryan P vancil swear or affirm swear that I possess all the qualifications to Seattle Municipal Code Seattle Municipal Code of Seattle tuition of the United States support the Constitution of the United States Constitution of the state of Washington ordinances of the city of Seattle of the city of Seattle. Okay, please read the next to a gin item since I record the appointment of Tanya C. Woo as member International special review District board for a term to November 30th, 2019 and the reappointment of Sergio Max legon-talamoni for a term to December 31st, 2021. The committee recommends the appointments be confirmed historic district saying it's a collection of early twentieth-century commercial and Hotel built buildings that service the center of Seattle's diverse Asian American community of the district was established by the city city of shelter in ordinance in 1973, and I can reserve the district's unique Asian American character in to encourage Rehabilitation of areas for housing and pedestrian-oriented businesses. Consideration for Tanya C. Woo Tanya was born and raised in Seattle and she grew up in the Beacon Hill Neighborhood and the Chinatown International District and her grandparents and parents are lifelong community volunteers and many of you know, her parents. I believe she's participated and volunteered and many of the local CID organizations and community activities throughout her entire life. She's working several roles in journalism for much of her career which includes working at King 5 for 10 years and her family is a partial owner of the Louisa hotel and she knows Oliver time to the hotel. Redevelopment project and prohibition mural restoration. Very pleased to have Tanya is part of the the board missed. Your leg on alimony is a train in architecture and design and his work both locally and internationally and Community Driven design and Community Development projects. Sergio work for an environmental works and serves on the board of Architects Without Borders in Europe in South Seattle and has great familiarity with the Chinatown International District is a Community member at the end of the pass applicant who previously presented to the board, so he's completing his first two year term, and so this is a reappointment so that I'm pleased to request at the full Council consider Miss. Woo and Mr. Legon-talamoni to the international special review District board for turn off confirmation to December 31st, 2021. Any questions those in favor of confirming these outstanding appointments, please go die those opposed both know the motion carries an appointments are confirmed and thank you very much for serving. Tanya and Sergio She is not. Okay, please read the next agenda item into the record. They're part of a select committee on the library Levy agenda item five. Cancel Bill one 19491 an ordinance relating to regular property taxes providing for the submission to the qualified electors of the city had an election to be held on August 6th, 2019 a proposition to lift a limit on regular property taxes under chapter 84.55 rtw, and authorizes the Levee additional taxes for up to seven years for the purpose of sustaining investments in library. The committee recommends a bill passes amended. So he was going to quite a process. I'm glad we're finally here in 2012 sail boaters approved access to critical educational literacy resources for every resident bypassing a 7-year 120 million dollar Library Levy Levy funds concluded by the end of this year has the creation of Select Committee of the library letting to assess a proposed renewal to continue Services. I was I am proud and honored to share this committee regarding one of the city's most valuable institutions and assets are public libraries as a committee. We closely examine the mayor's proposal which slated to continue Baseline Services while keeping up with the demands of a growing City sell public libraries invested and priorities and values set by our constituents all of our constituents residence across the city of Seattle and uses of the library who have set Which include I'm sorry, the four are the open hours at access collections technology online services safety and maintenance maintenance mean that we are protected from earthquakes cuz you all know I can't say that word seismic libraries are the people's University. They are the most public of institution since our country's founding the library the 21st century fides more more services than ever and these past decades. They are neighborhood centers that give greater access to learning books Electronics media equipment conference space lecture series and much much more including Library time for little ones for reading and for english-as-a-second-language and it's at its core libraries have been serving millions of people and transforming lives to that build a stronger or Democratic Society. I hope that we continue to look at libraries as we do with other institutions as they evolve. Last week the committee approved three amendments that strengthen the proposal in addition to the marriage proposal. Number one. I want to st. Casimir Gonzales for her Amendment to the expansion of Play and Learn from 0 to 5 years old is zero two five years for education. I want to thank councilmember O'Brien for his Amendment for the proposed in the additional open hours at 26 libraries. And finally I want to thank councillor mosquito who work very closely with our office and I'm adding expanded community resource specialist program for use thank all of you for working with our office and the mayor's office to move this important Levi forward a total committee has presented from the marriage proposal is an estimated 219 million dollars the select committee in library Levy recommended at the city council pass. Cancel Bill one 19491 as amended and hopefully our I hope that this will be on the August 6th 2019 ballot again want to thank Central staff. That would be awesome for doing a phenomenal job and briefing. And drafted the amendments in the gain in my office who were closely not only with the executive but with Asha and put together a much of the framework and the analysis and of course, I want to thank my colleagues for supporting this very important Levy. Thank you. Thank you rewards any other comments or questions on this legislation customer back show. Can swim Boris thank you for your leadership on this just as in some of the previous items. I appreciate very much your organization getting that information to his early and keeping the notebooks updated and Marcellus Turner. Thank you Auntie for being here. We really appreciate your leadership in this as well. I don't know whether our library Foundation or friends of the library or here but having that kind of a robust Community engagement on the front end is really helpful. So I'm I'm fully supportive of this. I think it's a good package one that is tempered but still addresses the needs of the people's University. Cancel present. Thank Marcellus versus I'm sorry. I did not see you sitting out there. But thank you so much and your staff for getting all the material back to us. And I know we pushed a lot of dead lands on you and ask you for tons of information and statistics and Trends and more information. So, thank you so much. Thanks for the comments Casa Ramos Kata through the process. It was a great to be able to work with your Juarez and the select committee and all of my colleagues to help strengthen the Levee package that we're bringing to voters this August. I want to specifically think the folks on the front line are Librarians and the folks are working in the library's who came up with some of the strategies that we offloaded during this last few weeks. I'm very very honored to have been able to work with you to get into this Levy the ability to make sure that we have community service officers who are serving our youth across the city and more locations, especially for those were self-identifying as homeless making sure that we're connecting them to Housing Services health services and educational in job opportunities. We heard from folks came to testify that sometimes are libraries are unintentionally being used as they centers. And while the reality is we need to continue to scale up our housing and shelter Services The Librarians. The folks are working on the front line. Providing tremendous service to the community at large and we want to make sure that there's community service officers there to help make sure that we're connecting those who are self-identifying as being without shelter in two separate shelter and services. So I see this is a huge compliment to the work that you all are already doing and it is additional need that was identified by folks on the front line. Look forward to working with the council and the budget chair as we think about some of the other opportunities going forward around child care and a greater security for our folks who are both patrons and workers at the library. So thank you and thanks to your team into the board for all that you do and to our front-line staff think each other words for your work with us tonight. And I'll just say a few parting words to thank you again for your Leadership Council and worst thing for shepherding this through and you and your bored your various boards and volunteers and employees know the library has always been very personal to remind my mother's I think you will know spent most of her career at the library in retired from the library. And so I just think it's so critical for this to pass until the sometimes difficult conversation. We had looking at the finance of this of what we're trying to do. We're good conversations because at the end of the day are library system so much more than just brick-and-mortar. I'm in particular giving all the issues that are facing are underserved communities are youth people on fixed income. The libraries are just one of her most treasured gems. And so I think the hard work will begin after this to make sure that everyone Understands that and she was going to be my pleasure and actually supporting this legislation won't take all of the hard work that went into it. So so having said that please call the roll on the passage of the Bill O'Brien Salon Hayden favorite unopposed bill passed in Sherwood. Sign it gladly Okay, please read the next agenda item into the record their part in the Civic development public assets and Native communities committee agenda item 6 Council bill 11949 for an ordinance relating to King County Conservation Futures Levy proceeds. The committee recommends the bill passed. Customer where is the proposed ordinance will significantly streamline the conservation future Levi the CFL the interlocal agreement amendment process. This upgraded process will allow faster reimbursement for Seattle CFL projects that have been awarded funny by the King County Council the Civic development public assets and Native communities discuss these items last week last Wednesday and voted out of committee and we recommend that city council pass this bill. Thanks very much. Just any further questions or comments. If not, please call the roll on the passage of the bill and Brian Salon Gonzales president Harrell 8 in favor and opposed. Please read the next agenda item in the planning land use and zoning committee agenda item 7 Council Bill 11949 7 and Ordnance related to monitoring and inspecting vacant buildings for compliance with the requirements of the housing and building maintenance code. The committee recommends the bill pass. Councilmember O'Brien, thank you. Just really briefly. This ordinance would Implement a new set of rules for inspecting vacant buildings, but I'm going to hand over to my colleague council member her Bowl to get a lot of work on that. That's why I never heard that I sponsored post budget cycle last year during the budget the council acted on an amendment to the existing mandatory. I'm sorry, not mandatory vacant building monitoring program and these recommendations came out of a couple years process that Council had engaged in we've both hired or funded the hiring of a sad person at SDI to make some recommendations for how to improve the monitoring the vacant building monitoring program, and we also indicated in a prior piece of legislation that we intended to make these changes. In last year's budget cycle because of the concerns that the executive had about those changes. We agreed to have them not go into effect until the beginning of June and we address some of the concerns that they had prior to going in effect. So the changes to the program will modify fees for buildings found to meet the requirements of the code to better reflect the cost of the inspection to the Department of construction and inspections fees would change from $171 to 261. Again, this is intended to be a neutral program the fees associated with inspecting these buildings are intended to pay for the inspections and solves. It also allows buildings to fall off of the monitoring list. In other words no longer be in enrolled in the monitoring program when there have been three consecutive inspections without violation and then finally the Amendments allow the city to enroll buildings after one violation if that vile It is not Remedy by the compliance date established in the note of violation or if there are subsequent violations with in 365 days from the date of the first notice again, just to serve a picture of the reason why this is really important is we've seen how much damage can be done to a vacant building that is not being maintained in a way that is consistent with the city's existing a vacant building code. Those are requirements that really are focused on boarding up the property so that people cannot access it so that Frank would they can't be magnets for for crime and other unlawful activity we found through our review of the existing program that police and fire are often having to go out to these properties hundreds of times and that is a bad as being paid for with public tax dollars instead of being paid for by the The property owners who are choosing to keep these buildings vacant rather than either maintaining them is occupied buildings for people to live in or moving forward with their development projects has many of these properties are within the development Redevelopment process and cycle. Very good. Thank you cancel my herbold with any other questions or comments on this bill. customer Gonzalez council president and I might need it later on cuz I just pulled into water on my keyboard works. I just wanted to say that I was one of the council members during the process that expressed some reservations and concerns about this particular program as it was being proposed and wanting to make sure that whatever approach the city at took was one that was going to be responsive to the realities around the implementation of the program and really want to appreciate the work that can't remember her Bowls has done as the prime sponsor on this bill to make sure that those the flexibility is going to continue to exist within the program but also making sure that we're managing. Can you the neighbors expectations about the city's obligations to respond to what are real real concerns within the community. So I really do appreciate your your hard work over a long. Of time to be responsive to those, but I think we're Reasonable concerns running with imitation and am excited to be at a place now where I am supportive of this legislation. Please call the roll on the passage of the bill president Harrell 8 in favour going to post a resolution recognizing the effects of the north Delridge Community to prepare an action plan for their Community. The committee recommends the resolution be adopted would recognize a North Delridge action plan. We had a good discussion a committee and like the last item. I'm also going to refer to my colleague councilmember herbold it a lot of work on this or both. Chair for his willingness to I'm have both of these pieces of legislation in a committee that didn't necessarily have to be moved forward and this was some sort of hold over legislation from previous chair Rock Johnson's committee chair shut until I really appreciate comes number O'Brien feeling those commitments. So this resolution that memorializes many years of effort by members in North Delridge to develop their neighborhood plan the action plan itself identifies, six separate priority areas diverse and engage communities Dynamic neighborhood destinations access to Affordable healthy food active transportation choices a healthy Longfellow Creek Basin and support of parks and cultural facilities the resolution also request that the Executive review and make recommendations regarding the action items. Indicated in each of those six priority areas. So we'll be looking for movement on funding some of these priority areas in the budget process this year. And then finally the resolution request that the office of planning Community Development review and make recommendations as identified by the community in the action plan in the 2035 comp plan for consideration in 2020. I have a very small amendment that I mentioned in free things this morning. I'll pass it out. And basically it just makes a change to one of the action plan priority actions to just clarify that one of the action items its success moving forward really relies on our ability to coordinate efforts with City departments. So first I'd like to move Amendment one, which is contained in attachment the north Delridge action plan priority actions. Remove the second to make the amendment as described by accounts from her bold. This is just the amendment vote. All those of any questions on it will just want to confirm that the language that you've just handed out now is the same as what you ended up this morning. It is all those in favor of the usual. I oppose the eyes have it. The resolution is a minute cuz my herbo it's been a long time coming, Thank also David Goldberg at the office of planning Community Development for shepherding process. All those in favor of adopting the resolution as amended, please vote. I know the motion carries. The resolution is adopted as a minute in the chair will sign it. Please read the next. 2 items, please report of the sustainability and transportation committee agenda items 9 and 10 appointments 1284 + 1285 the appointment of Joshua and Maurice and the reappointment of Weston Brinkley as members urban forestry commission for terms to March 31st, 2022. The committee recommends the appointments be confirmed senate committee with both the appointment and reappointment. Joshua Morris is an urban conservation is the urban conservation manager at Seattle Audubon Weston, Brinkley, Urban environmental scholar specializing in urban natural resources read natural resource planning, and he teaches at Antioch Seattle University and University, Washington. Forget any questions or comments on these appointments? Those in favor of confirming the appointments, please vote. I vote. No the motion carries an appointments are confirmed. Please read items 11 through 15, please agenda items 11 through 15 appointments 1289 through 1293 the appointments of Carol kachadoorian hand. Yonko Anna Letitia zivarts and the reappointment of Patricia m Chapman and David seater as members for terms and they March 31st 2021 the committee recommends the appointments be confirmed. Thank you. Another great discussion about The Pedestrian Advisory Board. We heard from a lot of folks why the interest in continuing to push the city to make sure that are all right away is safe for all Transportation users carols and active Transportation planner formerly work for Washington DC Metro han-jung also known as Coco is a research. Ghost in gerontology the study of old age and would bring an equity lens to walkability in the city and as a program director of disability rights Washington visual impairment and so they don't drive Patricia is a master in urban planning retired as a planner for the City of Kent and finally David is a volunteer with Seattle neighborhood Greenways helping you transform Seattle streets in the safe Act of all the streets that are safe Equitable and comfortable for all the greats Lou Phelps. Thank you council member or Brian any questions or comments on these appointees? Okay those in favor of confirming the appointments, please go die. The motion carries appointments are confirmed. Please read the report of the housing Health Energy and workers' rights committee 16 resolution 31879 a resolution supporting a safe and responsive workplace in the city of Seattle's legislative Department providing guidance to update legislative department policies including p o l l d 100 on workplace expectations. The committee recommends a resolution be adopted for that. Even when working at the Washington State labor Council AFL-CIO. I've been constantly working to try to make sure that we're creating safe workplaces. That means not just say from hazards and injury, but also safe for intimidation harassment and retaliation. I'm really excited that this Council and the city at large has been engaged in a conversation to respond to the me-too movement and to make sure that those who are speaking up and Spa. Is there truth to power that those who are sharing their experiences of retaliation or intimidation or even assault and harassment are having their words met with action today? I'm excited to move a resolution that looks internal to our department in the legislative department and our small are affiliated apartments on external from the executive branch. We have made a commitment to supporting policy changes within our legislative branch to changing our policy to updating our training to making sure that we are learning from the stories directly from front-line workers and incorporating anti-harassment and prevention training on the front. Then I've been excited to participate and learn from the folks on the interdepartmental task force as we've talked about ways in which we can change the cities of response to creating inclusive and welcoming workplace with looking it at our own department policies. We have such an incredible opportunity to build on that work on the leadership of our department. Leaders and making sure that we have a responsive resolution. This incorporates the voice of city workers on the front line from Silence Breakers from change team makers and from labor unions. We ask them directly what they would like to see in terms of amending our policies and procedures so that we can not only ensure that those who are getting elected adhere to these requirements for a safe and respectful workplace, but that we're also making sure that as staff where we were responsive and creating a safe place for people to come and share comments here and that as electives and staff that we have a decorum that we expect of our communication with the public-at-large as well. I'm excited from the very beginning of the Revolution will continue to have a role in helping a shape with the policy changes will be going forward and that our workplace resolution is about setting the table making sure that those who had Direct experiences of intimidation and harassment or helping us understand better. We can do to update our Personnel policies. We're reaffirming our commitment today. That staff should be treated with respect by members of the public and by any bosses and middle management. We're also making sure that we're stepping up and creating not just a place for one-time advice to be given but an ongoing work group so that that we can continue to advise us as electives and our department leaders on policies and practices. I want to thank you. Mr. President for your support on this. I want to think Monica Simmons for her with support and work with our office on this as well and specifically to the Frontline workers Who provided feedback and ideas in here and public office are hoping to lead by example as public employers who want to show across the city what it means to stand up and be responsive and good employers High Road employers as we respond to the me-too movement. Thank you very much. Mr. President would love to have the full Council support if we move this wreck a resolution, Fort Worth. Thank you cancel, a mosquito any questions or comments from any of the colleagues on the diocese? I just want to thank you for for your leadership and for working all the the the constituents and the issues and making sure we are leading by example and certainly your commitment is a is a lie that we should all follow. So, thank you very much for your leadership. Okay? Those in favor of adopting the resolution please go die by those opposed both know the motion carries. The resolution is adopt in the chair with sign it. Please read the report of the gender Equity safe communities new Americans and education committee. The report of the gender Equity safe communities new Americans and education committee agenda items 17 Council Bill 11948 e an ordinance relating to the 2018 families education preschool and promise Levy. Customer consalus request that the clerk ulcer read agenda items 18 + 19 + to the record. I like to speak to all three of them at once. Please do that an item 18 resolution 31881 a resolution relating to the 2018 families education preschool and promise Levy approving a partnership agreement between the city of Seattle and the Seattle College District and it's in the item 19 resolution 31882 a resolution relating to the 2018 families education preschool and promise Levy approving a partnership between the city of Seattle and the Seattle School District. Number one, the committee recommends the resolutions be approved adopted as president Harold. I spoke to all three of these pieces of Legislation during Council briefing today. I won't rehash all of the remarks that I made this morning since I I know that I spent quite some time going through all of the details of the amended version of the council bill and I walked us through the fair components of the partnership agreements with our partners. I do just want to say that the bill handling bill which was originally transmitted by the mayor's office this city council in this particular version of the bill is it includes nine different amendments from committee work in my committee all really centered around making sure that the implementation and evaluation plan as presented in this Council bill is in alignment with the the priorities of the city council as adopted both in the ordinance. And in the resolution that we all consider it last year before the levy went to to voters for their consideration in the fall. And again, I won't belabor those I went through them pretty thoroughly this morning during a council breathing, but I'm very excited about having the council bill in front of us at this juncture, which will effectively provide Appropriations to the Department of Education in early learning in order for a deal to be able to begin the process of Contracting out with Partners to begin the process of investing a taxpayer dollars in the various areas of Education both from preschool to the K through 12 system. And of course by establishing a sustainable Revenue stream for the Seattle promise program, which will provide two free years of college of War high school graduates of our public schools. And so Council bill. 11948 covewood accomplish all of those things consistent with the Levee as adopted and approved by the voters and of course our stop Levy oversight committee also considered the bill and the resolutions. I'm about to talk to and recommends that the city council approve all of the above the two revolutions that we consider 31881031882 are resolutions that would approve the partnership agreements between Seattle School District. Number one and the district. These are our first two identified Partners as it relates to the K through 12 Investments and the Seattle promise program and again at the sap Levy oversight committee reviewed this partnership agreements and approved or recommends that the city council adopt those resolutions. I will also note that as it relates to the Seattle School District. School Board did review and consider the partnership agreements, and they approved those partnership that partnership agreement last week during their Seattle school board meeting. I will just end by saying a few. Thank yous are there some folks in the audience today supposed to be here today, but I do want to thank some folks before we take a final vote on advancing the implementation and evaluation planet and the accompanying partnership agreements, and I like to thank Chancellor pan from the Seattle colleges. Thank you so much for being with us this afternoon, and I also hear from you so much to both of you for your partnership and making sure that we got the model just right and that were sent during the day. I'll promise program on on those students who have the least amount of access and opportunity to pursue a college degree or a certification for a career after after graduating from high school to really thank you. Thank you to both of you for all of Work that you've been doing this and for your ongoing commitment to making a college accessible and affordable for as many students as as we possibly can. So thank you both and her staff over at the Seattle Public School District number one for all of their ongoing partnership and cooperation and structuring are education investments in a way that will really really wrap around a student who has additional needs to be able to learn and and be successful in their academics have really enjoyed getting to know a superintendent Janelle on that these really critically important issues and have just been really honored to be able to share that space with her and to relieve See her Center, the academic performance of our students that are farthest away from educational Justice within that busy all public school system. So thank you all for your partnership equal. Thanks go out to the Seattle school board and their members really appreciates their inside as we continue to develop his Investments. And again making sure that these partnership Agreements are workable for the Seattle school district is really really important to making sure that the Investments are being leveraged as as efficiently and as strongly as possible as they continue to look at their budget as well as a man. I would also like to thank the Departed education Early Learning director Dwayne Chappelle and all of his staff for all of their really hard work on shepherding this along over the last And a half or so, we've actually all collectively have been working on the families and education preschool and promise Levy proposal and implementation evaluation plan since 2017. So it has been a long road and I'm really excited to be able to be at this juncture. We can finally give our final vote of approval to the Department of Education in early learning to begin deploying the dollars and investing in our kids through our partner. So thank you so much to director Chappelle who just happened to walk in and it's like he heard me to all of his staff for really being so committed to to this work in ultimately to Of the kids are cities. So thank you all so much. I want to thank mayor Jenny durkan and for her cooperation and her steadfast commitment to working with my office and with City Council on and dancing these really important areas of investment, especially when I think Chris alejano from her, thank you all so much for your ongoing partnership in and and wanting to continue to work in a spirit of collaboration to make sure we give our kids the best opportunity they they can have and then lastly in my office when I worked very hard and diligently on shepherding through a lot of my policy priorities and at this implementation and evaluation plan in the overall Levy as a whole and I also want to thank you for shepherding through a lot of her own priorities in this at Levi to continue to invest English language Learners in diversifying our teachers and Educators within the Seattle public school system and it really making sure that we are continuously centering our work on those students who again are farthest away from opportunity or from my select committee on education and really work closely with me and my staff and my office to just continue to Champion the needs of kids particularly in the K through 12 system. So he is Miss cuz he's not here with us in the end in Via in the physical sense. But his legacy will continue to live on in the work that he did on this particular. Love you. So want to give him a shout out also for all of his partnership on the families education preschool at Living including this implementation evaluation plan. I think the only thing he didn't get to do was take a final vote in committee. So I know he's watching so I went to Thank him. Thank him for that. And with that being said I would like to move for the council to adopt. Cancel Bill one 19480. Does it have to be moved cuz it's just encourage you all the support it? Questions customer mosquito because I'm very excited about the work that you've done and I just want to congratulate you can't remember you mentioned you and your coaches have been working on this for years. And as we talked about it in your committee, there was a round of applause and murmurs of people had talked about how long as they have been waiting for this to happen. So just a huge amount of congratulations to you and everything that you were got accomplished in this Levi. You had a good document to start with and you made it even better. Thank you for all the work that you did to include race and social justice, especially trying to think about Adam alternative career Pathways. Good living wage jobs on making sure that we had a focus on earliest Learners. You mentioned the Legacy as we think about our former calling come over Johnson, and I think you should also get yourself a pat on the back of won't do that for you. I have for the Legacy that you've also included in this legislation. I also want to thank our colleagues and and especially as the chair for your support for the amendment that we were able to work in to make sure that our Public dollars are being used to really support our institutions that are adhering to labor laws in a commitment to labor Harmony the amendment that we got in as you read this morning item number eight ensures that are $30 mix ensure that our city dollars are providing a baseline protection for the labor policies that the city has already passed and that we don't deserve further or Road labor protections are collected worker voice and I just think that this is really important to liftoff, especially in the era of the Janus and the attacks on labor nationally that we continue in the city to stand up and show what it means to be a strong Union City to support workers across the board whether or not they have a collective bargaining agreement or not. And I applaud you for including this in there. We were really excited to make sure that our amendment was included because we wanted to make sure that we applaud the fact that when we have higher unionization rates, we see higher retention less turn over less stress and improved Health outcomes. All of these things are good for our kiddos in our city at large. I also think that it's important that we continue to apply the good work that are public schools are doing just by recognizing the hard test that you all have in front of you. I'm to to raise our youngest Learners all the way through now the Seattle promise program. So thank you for everything that you do and to your front-line staff for helping to raise and grow our kiddos in this in this community. Thank you my customers want This resolution adopts the implementation plan detailing how their funding from the education Levy will be distributed to schools and programs when the mayor for Sunday to cancel. My office was concerned to see that the more explicitly put an implementation plan that funding might go to charter schools in Seattle teachers and their unions. They remove Democratic Community oversight of schools and they drain resources from the already deeply underfunded district schools. Ever since labor movement have one public education. There have been Relentless stop in German forces trying to privatize it in the 90s these forces try to push my vouchers that would take public education funds and put them to watch private schools when they fail to win support for that. They started pushing for charter schools, which in many states do not in Washington state are operated by for-profit companies with devastating impacts for both children and our teachers unions. The owners of Walmart and the Gates Foundation both are examples of Institutions that pour money into charter schools. Even in cases by Charter Schools, maybe Road run, they siphon off funding from the district schools Harding the education of other students. And of course, we know the most adversely affected are very low income in poverty-stricken communities with no accountability. Seattle charter schools are nonprofit, which is good, but they are all run by Charter School change out of California. I hope these problems are considered when funding Awards on May to the Seattle Public Schools does not lose out. I will vote in favor of this implemented implementation plan because I support the overwhelming majority of it, but I just wanted to say for the record that I do not support funds being taken from our public schools to find Charter Schools Charter Schools will need to unionize to push back against the privatization and austerity agenda of the so-called School reformers and it is encouraging the charter schools teachers in cities like Chicago are starting to move towards us as a member of an educator Union. Confederation of teachers local 1789. I know firsthand how important unions are adjunct professors will tell you, you know, I join Professor to Cobble together a living by teaching courses in different universities will tell you that they are paid more in attributions, but they have a union than and universities but they don't even though the universities with that don't have Union to me actually have larger resources when you have a union you have better wages and benefits if I need Educators at the Seattle's Charter Schools who want to unionize I would urge you to contact the CEO of Educators Union or my office so that we can make sure that all charter schools are unionized and then ultimately brought into the public parking. There's no further comments. I'll see if you were Janelle last customers house if she'd like to close. I just want to thank councillor Johnson in council member Gonzalez basically for doing their job. So well that this is a time where the legislative department will do a very deep dive almost very granular in its approach to make sure that the Investments exactly where our priorities are and that's not easy work is thorough work and I want to thank you and commend you for the love of detail that this legislation presents. Thank you very much. I can swear I would you like to see any closing remarks before we vote just really quickly. I want to thank you want for her remarks. I think it is important for us as an institution an agency that can invest in education to make sure that we are centring the children that we are investing in at the center of that work and and I also think that are in Events in the area of educator diversity really signals to potential partners that those are the things that we really value. So even though Charter Schools will be allowed to apply for $11. It doesn't mean that they're guaranteed funding and it is my expectation. I think the city council's expectation that deal will be taking our priorities very seriously seriously in evaluating and applications for funding of public dollars in the space of education. So is not very common for us to invest in nonprofit organizations preschool promise. I'm sorry Seattle preschool program that relies on nonprofit agencies that are not public entities to deliver preschool and early learning opportunities. We also have a similar partnership with Seattle school districts in terms of Pi locating preschool classrooms with K through 12 rooms. And again, I think my expectation and Cancel the expectation is it will continue to work with Partners in the area of Education that really fundamentally understand and have a strong commitment to race and social justice act and to educational Justice at the same time with Partners who are willing to commit to transparency accountability reporting data sharing and also to their Workforce. We know that when we invest in our Educators and when are agitators look like the students they are serving we do well in terms of reducing the opportunity and achievement gap for our students of color in particular and and I have full faith in deal that they roll with the law and while also continuing to send her our investments on the students who need the most investment in order to be able to succeed in school and and Beyond and there is I'm work that is left to be done through the interpretation and evaluation plan at for example figuring out how to connect students who are graduating from Charter Schools figuring out how to connect them to the opportunity of Seattle promise is something that still needs to be done. Again, there's a dollar is it go directly to an opportunity to go directly to students and that's a good example of that. When I think this Council would be a supportive in general of making sure that those Partnerships exist for purposes of connecting with the actual student and not punishing the student for having gone through a charter school process, but could still benefit from Seattle promise. And the last thing that I will say that I learned in terms of the council president's comments around the granular details in this space things. I found most astonishing is when you dig into the demographics of who is attending the three charter schools in Seattle. It is a predominantly Madrid. Demographic of students of color of students and children who are on free and reduced lunch and I think that's exactly the kind of population. We want to be helping in the future. So my hope is that we've been able to thread the needle well enough here to be able to comply with state law while at the same time continuing to send her our work on the students who need it the most and and I'm looking forward to continuing to to do that hard work with DeLand with Community Partners to make sure that we continue to get it right. So with that being said, thank you so much. I really appreciate my colleagues engagement on this somewhat wonky, but very important policy area and really look forward to continuing this work in my committee. Okay. I think we're ready. But we're going to go out separately on three different piece of legislation will take the bill first. Please call the roll on the passage of Bill Scottsville. 119480 herbal eye. Where is President Harrell? Going to vote on resolution 31881 those in favor of adopting resolution 31881. Please hold. I don't suppose vote. No emotion in motion carries in a resolution is adopting sure was sign it and those in favor of adopting a resolution 31882, please vote aye aye. It's a wig on those eyes The most scariest resident reservations at in the chair will sign it. Just one moment. I was standing between The end and identifying a new colleagues. So thank you so much for letting me an extended. Of commentary on this. And I may have to do that as well. Okay, we will move to the adoption if I the resolutions I don't believe we have any resolutions for introduction adoption. So I moved to other business which of course is our Council vacancy position to the city council now vote to fill the vacant Council position formerly held by council member Johnson. I'll say a few opening remarks and then I will solicit the floor for nominations has been if you know former council member Rob Johnson made his resignation on public land March 21st, 2019 the city Charter gives the city council 20 calendar days to fill the vacant Council position. I know many people of question that we actually did a research and found it's actually been that way since 18 96. One of the arguments is that we certainly don't want a segment of the population going without representation, but it certainly is a tight time frame. Within that time frame is very important to think the 15 applications are applicants. We did receive your C15 by April 5th at 5:15 to do not meet the legal eligibility requirements and two subsequent applicants withdrew. So today we stand 1111 qualified applicants. Those applicants were invited to the community involved public forum and the special city council meeting on April 17th for all 11 applicants provided the opportunity to formally presented a 3 minute presentation and respond to questions from council members and I must say that I was indeed both impressed and humbled by the Quality quality of the Outlook instead of preparation and their commitment to Public Service. I want to thank you personally for such a splendid display. All applicants. Of course were required to participate at the public forum and again appear at the city council at the special city council meeting meeting on April 17th. As we stated at the outset on the onset of the process that the desired qualifications for this Council position. We're in individual qualified to chair the planning land use and zoning committee and a caretaker who agrees not to seek election to the council this year and then an individual who has an understanding of our governmental operations and budgeting and the legislative process of these demonstrates. The knowledge of public policy issues associated associated with potential committee assignments and demonstrate a commitment to social justice and the ability to communicate and collaborate effectively across cultures and with diverse populations. So again before we take nominations, I like to thank all of the applicants who applied that was not a An easy process to be subject to such scrutiny. I hope somewhere along the line that that irrespective of the outcome that you realize you did yourself in your community a great service by displaying a challenge in your commitment and a dickin indeed should be very proud of the efforts that you show on all 11 or outstanding. Okay. I'm going to slow it down just a little bit as we go through this number one. It's a lot of paperwork involved here and number to don't do this all the time. So at this point I am going to open up the floor for nominations and I would ask since you simply nominate the person I'll ask for a second and then at the conclusion I will make a motion to close the nominations and then I will allow people at that point after the nominations are close to speak about anyone that was nominated in part of the selected Naaman nominee committee. Okay. So at this point I will accept nominations for Council position 4 customer Bagshaw Is there a second to move in second at the David Goldberg vplex be placed in the nominee group. Are there any other nominations councilmember sawant? Does Trailer Sales? It's been nominated. Miss LaSalle's has been nominated and second. Just when this is where I'm going to go a little slow so I could take notes Here. Even though I know what the clerk's are down there much better than me on this stuff. Are there any other nominees councilmember Mesquita? Is there a second? It's been. Mr. Pacheco has been nominated and second. We have three nominees. Are there any other nominees coming from the floor and there's no pressure out customer Gonzalez? Is there a second? It's been moved and seconded that Brooke brought be placed as a nominee. Just one second here. Are there any other nominees to come from the floor? And again falling counselor Gonzalez Isley dial filibuster just a little bit to make sure we do this right and no one's over cuz I have a great joke and I don't like to hear one of my to know I always mess up on that any other nominees to come from the diocese. Okay. Can I just wait for a second here? And I will move to close the nominations. Is there a second it's been moved and seconded to close the nominations all those in favor to close the nomination. Please go die all opposed the eyes have it. So the nominations are closed just to reiterate to the public before we have four nominees. I'm just going to read them out in the order with which they were nominated David Goldberg. Sheree LaSalle's Abel Pacheco Jr. And Brooke Broad am I correct in my notes clerks? Thank you. Okay. I'm going to go a little slow here in the way. This will work is based on the roll call physician that rotates every week. The clerk will call out the names and I would just ask that the council member. Articulate their candidate that they are voting on the first round. It could be over in a first-round. We'll see but just one candidate they are to select and I hope those rules are clear to everyone and Yes cast members who want you do you say you would do the first round of Oats before any comments or do you want us to say comments? But I would like three mistakes. That was one. That was my first mistake. I forgot to let people talk about I was going to go right into a soap mistake. Number one. I got two more though at this point prior to voting. We would like to hear comments from any council member on any of the applicants in the four nominations. But any of the date the other at 7 as well, so now is the time to hear from the dice on comments and I'll just recognize you as I see hands. Council members want to go first and number of phone calls from people who worked with mr. Goldberg including Senator Jamie Peterson and others that work with him during the 520 Mega project and obviously his land use experience is deep. And since we're replacing council member Johnson hard to replace but having somebody with that experience. I think it's important. I also want to acknowledge the fact that not only has he been on the Planning Commission reappointed the Planning Commission here, but also in his work and Decatur Georgia near Atlanta and I also respect the fact that he's worked on the pegboard The Pedestrian board something that's very important to me personally and lastly his education credits are impressive from the East Coast, Dartmouth, Columbia and her University I appreciate that could work but also he has been very deeply involved in community local community Communications and strategic work. I think he would be a fine colleague and I heard she wrote. Forget thank you. Cancel my back Shaw. Who are still receiving comments from the dice on any members in the nomination pool? Maybe we should do with the order in which we nominated. Would that be? Okay? I'm fine with that. I can't remember that. I wrote it down. I'm just so I'll just send you just raise your hands. I mean, it's not that formal on that process. So why don't we just see where the spirit move somebody to speak and we'll just see Hands fly up. So He's so shy today special council meeting. So I'll just say thank you to all of the 11 folks who threw their name into the Hat. I know that that takes a certain level of courage and and vulnerability Ted put yourself out there as somebody to be considered for a very public position outside of the context of a full election cycle to just want to say I really just thank you to all of you who are wanting to serve your neighbors and community members in District 4 and consequently to sit up here with us every Monday and have this much fun and also to really just help us as a city council and an entity really struggle with some of the most difficult issues facing our city. Of course, we are here looking at replacing Former council member Rob Johnson and District 4 in my evaluation. I am hoping to be able to support somebody who who comes to this work with a lot of experience and understanding of land use policy in particular as somebody who's going to be the chair of the land use of the planning land use and zoning committee as well as somebody who's going to be a member of the sustainability and transportation committee. And as well as somebody who's going to be a member of my committee the gender Equity safe communities new Americans and education committee and as a result of that after having reviewed all the materials and after last week's public hearing and having my staff help me identify additional information about all the candidates. I decided to nominate Brad largely in part because of her ongoing advocacy and commitment in the land use area and wanted to make sure that we have the most inclusive set of policies available to What's at the city over the next seven months that will really promote and support the success of the mandatory housing affordability program. Hopefully getting us to continue to advance and move around the ATU conversation. We have some issues related to the multifamily tax exemption program that are going to be coming up and I think having somebody like me has brought it in the seat to shares some of the values that I have is it relates to inclusive land use policy is really important to me. Thank you cast Frank Gonzalez. President just want to say thank you is all they have received your letters and just a huge amount of appreciation. This is not easy. This is all so very different from you. No running for office, which then we get to evaluate you based on your criteria for all of the positions in which you could potentially be starving on Council here. We have a specific square, and we're trying to fit into that specific Square as we finish out this year. So it's a little challenging and we appreciate you your willingness to step up and to really put yourself out there. That wasn't easy on Wednesday. I was nervous so I can imagine that it was a hard discussion for a lot of you. I saw any of the comments that we make today. I hope folks take away from this time. You all were tremendous Canada's and as we speak in favor of certain candidates that doesn't actually mean anything about not wanting to see one of you on Council one day. So I hope that that is still something that you're all interested in and that this process was inspiring verses being and nerve-wracking which I'm sure it was. So, thank you. Once again for just putting your name out there cuz we know that it's hard that we say thank you for running the people who run for office or thank you for putting your name forward and being part of this nomination process. It is not easy. I understand. I do want to say I'm really excited to be able to nominate first evil the chetco as you have heard him and previous committee discussions and in the debate that he had on Monday last week in our conversations on Wednesday. He brings to this nomination process excessive experience in land use Planning Development and social justice from the neighborhood and Community perspective. Does the Wallingford Community Council quality of life chair from 2013 to 2015. He served on the Hall of focus group for the volume as the Wallingford representative in 2017 works with as part of the young professionals group of Plymouth Housing group from 2013 to 2016. And really I'm excited about the letters of recommendation that we have seen from him. Dissociation and the former planning commissioner remember really excited as well about the support that he received from Senator, Joe know somebody who has been elected leader leader of color as well who stepped up and push for greater density greater zoning that's inclusive in opposition. These are not easy positions to take on those are not easy boards to serve on so thank you for your pass work on that and thank you for your interest in bringing that forward to this Council sings. I'd also like to pass out for the committee's consideration is a letter of recommendation that we received from The Martin Luther King County Council AFL-CIO who wrote in support of evil last week has been Equity work at the university has extensive relationships with a community Apartments as a form of Union member and renter and man of color table has intangible lived experience to respond to sit at Seattle's most pressing challenges. He has our I'll report that is part of their letter to us in summary. I would just conclude by saying in one of the things that I really liked about Abel's presentation is that he lifted up that he's currently a renter in a city that's over half the city who was renters in a city where we're trying to encourage more people to get out of their cars. He talked about the need for greater density development around transit-oriented development the ability to walk the parks in grocery stores in schools and libraries and childcare and create safe working environment. So bringing his experience as an immigrant as a person of color. I'm sorry as the son of immigrants in as a person of color as a renter as a lawyer for social justice. I would love for folks to consider our friend able and again kudos to everybody who put their names forward because I think we saw a lot of these great qualities and many of the candidates that came forward. Thank you able for putting your name for it so I can come to you. Councilmember War has a great honor to again Echo the words of counselor. Mascara in my support for Abel Pacheco before I launched into a few items about what I know about this young man and watching him these last four years work particularly in District for I want to point out to my colleagues at when we did when we put out the city of Seattle Council District number for applicants summary on their 13 factors or 13 issues to look at and one of them of 1 or 13 only says this applicant identify any previous planning land use and Zoning experience. Now, I drive it to your attention to say that you don't necessarily need to have a Content intense background and land use transportation is only the old is helpful land. Use Transportation zoning is statutory nature. I think every one of these applicants possess the intelligence and certainly the work ethic to move forward and I'm do this job adequately for 6 months and what I value and what I look for in anyone who wants to be a public servant is to not only as a sea navel who can best represent the interests of the city as a whole and who also honors the needs of their District. I think public policy experience is important as well as being an advocate and activist. I value hard work and results civic-mindedness more importantly quite frankly than just someone who is passionate or very confident in this world. A lot of people have unearned confidence and I see a lot of that and with this young man, I see earn confidence. I see integrity and I see someone that is committed not only to their city and to their Community, but I want to thank this individual cuz I work with him in Indian country and advaced advocacy and leadership in the Mesa program in the stem program is an Too many of our used our Native American use our Latina and Latino use and more importantly are young women in these areas of science engineering and math. I also had an opportunity to watch this young man. I'm work with him and look at him at his his writing in his analysis and his innate intelligence when we discussed holla when she eventually we move forward and most recently passed. Mha and I appreciated the conversations I had with Abel about district for Amanda Mendoza mandatory housing affordability about issues of displacement his concerns about zoning in about the Ave and what district for men to him. What that the only other thing I want to add more on a personal note. Is that while you see us up here every week of council member Gonzalez said it's a difficult people aren't always kind. It's it's difficult. Sometimes trying to do the right thing. You can't give everybody everything that they want. But I think if you come to this job with an open heart civic-minded community-based that your pragmatic that you care about our city and our community and again that we thought that you value hard work and results then I think for me that would be able to check. Oh, thank you. So what thank you present hell. All right, before I talk about the candidate, I nominated short lascelles. I for sure want to talk about the appointment itself it. Yes. The appointment is only for a few months. But anytime there is a position on this Council. It's a very important question because this is. The city council has the highest legislative body of the city and as an elected representative working people myself who takes it very seriously using my office to amplify the struggles of ordinary people. I think that even for those few months it matters and I wanted to talk about that in a second. I want to talk about what this in mind you what a disappointment is about in a second, but I want to do first talked about what I don't think this appointment is about in my view. I don't mind you this appointment is Not about land use experience or any kind of technocratic experienced to be Berry clear. The reality is every council member and their office depends heavily on the expertise of the subject matter experts in the council Central staff and other City Department staff and that is as it should be we do and should rely on subject matter experts because the role that I think you have to fulfil as an elected representative is not having subject matter expertise on every single subject but more but actually not about technocratic experience is about political College. What are you going to use your seat for? That's what matters to get Ready Concrete experience myself and I did not have experience with Seattle City Light when we were first selected and that was the committee that was handed to us. I'm an economist. My staff members have experience in different fields, but not in that particular field. But we were very successful in sharing the energy committee because of the incredible Health technical help of the council Central staff and other staff members in the city of Seattle and we use our committee my office use this committee and our position as chair to carry out a major expansion of the utility discount program making it opted out of jail rather than 10, which it was initially advocating for Progressive rate structures, which we are still doing because we haven't had a council member support that and many other issues that are related to the environment using advocating also far to Pilot Charter Community Broadband using City. Like I don't have to be a Broadband expert to Advocate Community. What I do need is political courage to stand against Comcast and CenturyLink. That's what it's about. And I think this appointment is about political courage and at this moment as we all know the most urgent crisis the city of space. Is the question of the escalating homelessness and the rising lack of affordable housing and we know that a renters are absolutely facing the brunt of this crisis. But we also know that hormone middle-class and working-class homeowners are facing the crisis also because we haven't had a real Progressive Revenue Source. I like the Amazon tax, which was repealed by the majority of this Council and most of the attacks button lands on ordinary people to the sales tax and ordinary homeowners to the property tax. And so I think we urgently need to build a United movement of renters and property ordinary homeowners against the domination of big developers and financial speculators and Property Management Corporation. So what I was looking for in this appointment process was who has the who has shown Some college in standing for the correct positions on these most urgent issues that are faced by our city. I first met Trailer Sales when they and they are following advocates for sex worker rights came to my office to talk about those issues. And I asked that we would like you to be part of the Amazon. Struggle and they readily agreed and I remember there was one memorable moment, which story mentioned during their responses to this Council last week at a really exciting meeting that we had a rally that we had at the Vermilion on Capitol Hill after we had won the Amazon text. But before the Council of repealed adverb, we were just launching about oh, you know, just then launching our Summer and Autumn campaign of door-knocking enabling to really be able to push back against the lies of big business and hopefully when the ref win against the big business referendum that was coming out of the last November Should I reaffirm their support for the Amazon tax at the question-and-answer that the council dead last week when I asked him about it joining and joining the movement of ordinary people fighting for it. Everyone says that they support more affordable housing. But what does that mean other than empty words unless you're actually willing to support a realistic way to find the needs of affordable housing. And as a matter of fact that amount of bandwidth that's being used up by talk about affordable housing has grown since the council refused to actually take a position on this not only did the council majority of the council to peel the Amazon. They refused to vote Yes on the 11 separate amendments that the people's budget movement brought in the budget discussions. So what we need is somebody who will really use their position to can you stand with the community that has brought them forward and I think she only has said said those words In the end. I am no to that effect. They have also met with my office staff last week and they have said that they support rent control, which we know will be necessary to stop the hemorrhaging of the remaining affordability rental affordability in our city. In fact, mine that bird on my my office policy analyst ask Shirley about rent control. They said they supported and that they themselves as a renter needed that It was also very important that Sheree said that they are opposed to be ineffective and inhumane sweeps of homeless people. I think that is another concrete thing that the security Council has refused to do witches stop the wastage of tens of millions of dollars and use it for affordable housing has taken many other Progressive Physicians, but I won't go into all of it. I raised these issues examples because they are the most pressing and they are where we need the most courage. And so I really urge All City Council Members to support a candidate who has shown that they would be willing to stand up for the community that they represent and I also wanted to say for anybody who gets elected if you have professed nominates, are you appointed here not elected for every candidate who professes that they will do the right thing again, once again wanted to articulate that if you have Already come under pressure. Then you have no idea what kind of pressure you will come under once you are in this position. So the need for courage would be much more after you are appointed not before so thank you think you can Smurfs what? Casanova Brian Thank you, I'll try to be quick and just reiterate a few points that have already been made. First of all, it was amazing as a resident of Seattle to sit here on Wednesday and listen to all the folks that showed up to talk through their passion for the city and the dedication to it. So often in the political world when there's vacancies in openings political pundits in the Press come up with a small little small list of people that are that are off and recycled throughout the system and see some folks who I've had a chance to work with in a lot of folks. I've never worked with at the table. I felt really proud and honored that there's so many amazing people that I believe could all do an amazing job the city council member. So it really went home that evening at ease knowing that I felt like who can go wrong and yet still have a decision to make and when I look at the folks who are before us today. There are two individuals who I'll speak to just briefly. To really rise to the top for very different reasons, but I think could equally Well Service City tree, I really appreciate the comments that you made like on your honesty and transparency about what you wanted to do and why you wanted to be here and what motivated you you talked about the courage it took to be there and how hard it was on appreciate hearing those words. What I saw was a real strength that I think would be anything on this Council and the other person who really Rose is David Goldberg. I've had a chance to work with David a bit, but I didn't know frankly all of your story until you spoke on Wednesday, and I still don't know all of your story. I'm sure but there were pieces of it that I didn't know and I really bought into light help me understand how some of your values When your your lived experience interact with what I've known you about is about transportation and land-use policy. I know that I'll have to make a decision here in a moment. And I'm and I'm going to be struggling with that for the next few moments, but there's a there's I don't think we can go wrong with anybody certainly 4th it or before nomination or outstanding too and I'll be deciding between the two of you on the first round. So, thank you. Thank you can spell with Brian. So we're going to vote all recent instruction instructions again, just to be clear. I did want to address one comment. That was said that this positions for a short-term. It's actually for 7 months and I will share with you try serving in a position for five days. That's a short-term. So this is a lot. This is a long-term. So having said that. I'm going to ask that the clerk call the roll on the vote to nominate a candidate to fill Council position 4 and each council member would simply State the name of their chosen candidate clerk college-ready. Okay proceed. I will vote for David Goldberg. swan trailer sales Bang song Gonzalez purple Abel Pacheco Juarez mascara and Harrell Abel Pacheco Jr. We have four votes for Abel Pacheco one vote for Sheree lascelles to votes for David Goldberg and one vote for Brooke Broad. So no candidate reached five votes. I'm going to give my counselor remembers a moment to gather the thoughts and we will in a moment proceed with another round of voting. in the same manner I'll give you a moment. Okay. Does anyone need more time? hearing none and can I ask you your pace was just a little fast. Just just a little slow down just a little bit if you don't mind. Okay, we are going to go to a second round. And we shall now proceed. O'Brien David Goldberg swan Trailer Sales Big Sean Gonzalez Kerbal whereas mascara and council president Carol Pacheco for able to check o Two for David Goldberg to for Brooke Braun and one for sure a LaSalle's. Okay. Just one moment here. The last of the council members deliberate internally. No, no talking to your neighbors. And we're going to proceed to round 3, but I'm on my queue in the queue has not been given yet. Just one moment here. committee ready Please proceed with round 3. David Goldberg Swan House Bank Shaw Gonzalez herb old broad Juarez mascara peril Just one moment. I'm going to do the consalus pause like she did. I'm trying to but I'm trying to see and I think mine is reflect that this is the identical voltage round 2. So I'm going to say Brooke Broad Social just actually shipped in boats. And what I was signal to my colleagues is this on round for that if the votes do not significantly change on Round 4. I'm going to move then we in the process and we will have to have a special meeting and reconvene. Maybe I'll do around 5, but I don't see with just one vote deviation from around to it around 3. I don't see any movement and for the viewing public this is an open and transparent process. And so that's how we're going to proceed. So I haven't said we're not going to do a v I was just I was bluffing a little bit trying to see if we can get some some ocean here. I'll tell you what I will do before we go around 4, I would like to open up the floor just in case any of my colleagues wanted to make any any comments before I go around 4. I don't want to deprive her but I do believe that land use experience is important for this position. But I also and balancing it with other attributes that I think Miss broad has those attributes primarily being her commitment. To our stated priority of wanting to find additional Revenue sources for housing and I also want to speak to the fact that I was very impressed that this broad spoke to some of the recommendations in the navigation team audit. This is a piece of work that is really really important and I truly appreciate the fact that this broad has paid some attention to the fact that with the the the implementation of some of those recommendations that we can result in having better outcomes for our neighbors who are living unsheltered outside. That's fine. We can Solace thank you cancel president. I would just also also want to make some additional comments about Ms. Broad in addition to the nomination comments that I made I think one of the things I also appreciate about her skill-set is her understanding about how City policy is directly impacted by what happens at the state legislature and she has had some experience of the state legislature doing some lobbying work there again, I think this is one of the one of the most notable at legislative sessions in my mind in terms of the city of Seattle's ability to actually get some real meaningful movement on a legislative priorities at the city council and with a special session is probably upon us. I think we could benefit from an additional person on the city council with some of those relationships and just really fundamentally the understanding of how we are hampered in some ways at the city level. By laws that exist at the state level is really important. I also really appreciate it her her intentional remarks around collaboration and the importance around making sure that the collaboration is at front and center in terms of her style of interacting with other members of the city council and with members of the public. I do think that in an era where Civic discourse has gotten away from us. It's important for us to have council members who who will be willing to listen and learn that doesn't mean that you're compromising on your values are your ideals. It just means that you understand and appreciate that other people have a different perspective and and that and that instead of making moral judgments and an escalating that sometimes it is better to at listen learn and still have your position but listening and learning is an important value. I think of the council member At her fundamental understanding that it's one thing to pass laws and it's another thing to think about passing laws through the lens of implementation. How will it work? Will it work? And what is working? I think those are all important things that we will be struggling with over the next seven months as we undergo another budget process and as we get some very complex policy issues across the finish line. So that is my additional statement on behalf of his broad. Thank you, Mari Gonzales before we hear from some more comments. And I think I saw a hand in queue Madame Clark. Would you be so kind as to read the note tab for round number 3 the last round? Brooke Braun three votes David Goldberg two votes Sheree lascelles one-vote. I'll Pacheco Jr. Two votes. Thank you very much able to check off. Thank you. Okay, I've asked the clerk to prepare voting tabs around 5 and 6 just in case Councilmember O'Brien, would you like to see a few words? I would think you cancel president appreciate appreciate the comments that others have made for book product. I do think she is high qualified. I'd like to speak a little bit for David Goldberg and some of the comments that we heard on Wednesday starting with the David's background about how he got into this work and the path he's been on and the commitment to making sure that we have a system both of land use and transportation system that works for everybody. I also think that I I feel very strongly that that the David's values when it comes to especially tricky land use decisions are consistent with some of the positions this Council has taken in the last few years, but I also similarly a Dated some of his comments about how we get to that is not the end game is is also about the process and a conciliatory tone. You know it believe he lives in the neighborhood where the mha zoning was very contentious and talking about how you know calling each other names is not a productive way and we have to be making these changes because it's necessary for furry quality climate change, but we also have to do in a way that brings along are our neighbors in a way that makes me feel people feel hurt and I really think that that tone and tenor that you would bring to this Council of consistent with the direction, but also be very helpful. Thank you cast member Bryan. cast members Kayla Thank you, mr. President and thanks for getting some of the dishes additional sheets printed up as well. I think that if we could vote for each one of these candidates, I think all of us would because we see Incredible strength in all of them. I do want to comment on thank you to everyone of the candidates who reached out to our office who had the chance to meet with I did have the chance to meet with Brooke and I really appreciate your honest answer is around supporting Labour unions in supporting public education is supporting teachers. And on what we just took a vote today on the Seattle education Levy. There's going to be a lot of issues that you have a deep knowledge of understanding of Education background that we're really excited about and your support for public schools. And those teachers I think is really important to thank you in addition to everything else that have real identity. So thank you and I think that one of the reasons that I can continue to I want to underscore that is because I think there's a lot of value in all of the work that the Kennedys have brought forward by I definitely understand. Where are Collies are at in putting all those names for it. But then growing number of books for you. So I thank you for your time and your explanation on some of your position. We're at right now. I'm going to continue to encourage our callings to support Abel Pacheco. I also think that as we think about who is most impacted by housing discrimination and I work play Sorry housing discrimination specifically, it's immigrants and people of color as we think about had the lack of affordable housing in Seattle was the high rates of housing discrimination in housing displays having brought forward. I think to the previous councils a table has sat on again the Wallingford Quality of Life Council the Halle focus group and the young professionals group of Plymouth. There's a real value in being able to have that voice brought forward. I am here with my Council colleagues is staying in terms of it doesn't necessarily have to be that one for one replacement of our former colleague and that's Possible I think for any any individual to meet but to have the ability to bring forward that lived experience and to also then serve as the chair of land use and planning very very much still in the camp of wanting to see our friends Abel Pacheco Jr. Of bring forward his perspective from those previous councils. And that doesn't take away from any of the experience of any of the other nominations. Did you think of this day and age with the type of discrimination that we see? It would be great to have that voice represented on Council charcoal Junior on before I actually kind of get a little bit wonky. I want to just want to I want to frame this in the hearts and minds of people who are watching while I do think it's incredibly important that the skillset such as Mister Goldberg and Brooke are phenomenal and I'm sorry I should have said your last name to poop broad very impressive broke. I appreciate You came down during public comment and gave great public comment regarding. Mha and I'm for that that action for me a lot about who you are and what you've done but getting back to what two points major points. I want to make sure I had the opportunities as some of us up here on the diocese back in 2015 to watch Mabel on the campaign Trail for 10 months. So I don't just know his can't his stump speech. I know what he stands for and what he wants to do for District 4 and 4 on the city of Seattle. I appreciate the use. I also appreciate that when you come from an adverse background and you've dealt with adversity that it builds character and those kind of experiences touching on what council members who want said really frame and mold how you approach situations with courage? Yes. I said incorrectly 7 months or 6 months. It's the 7th month 7th month gag. I want to point out that One of the things that have always felt in my other discussions with people does University of Washington is that the University of Washington has the largest economic obviously and academic footprint in District 4 and I've had discussions with Abel about University of Washington and not only who they are and what they do here in the city of Seattle, but Statewide and certainly in Olympia able also has the experience of I'm working successfully in Olympia where he successfully call LED efforts to receive Chilean dollars from the state legislature for expansion of the Washington Mesa Community College program as a result. The Mesa program was able to go from 12 to 18 centers, but for people on the other side of the mountains particular in Indian Country the Yakama Nation for the first time they have received additional $150,000 for First Nations, and that was no small feat and I watched how able brought people together not just myself. But other other state legislators and leaders and leaders in Indian Country, which is no is not the easiest thing to do and I just want to add one last comment. If those of you have not seen what Abel has done besides his whole resume wishes online is that he has not only practice but has taught introduction to political science and leadership and management in those skills and does hold his MPA from the University of Washington. And again, I want to go back to something. I'm council members who want said nobody comes into this job with a perfect subject matter expertise skillset, if if they did I'm thinking of of the 13 things that we listed when we were looking for a particular candidates, we would at least have more than one saying that you need some some experienced. You have eight other colleagues Central staff legal counsel and everything here to give you the tools you need and when we had our last council member of Chris and hairstyling who came onboard people thought that she couldn't get on the Joe quick enough and handle a 5.9 billion dollar budget, and she did. So this is about talking about how you not only your city, but your district and knowing your District annoy those needs and so with that I will continue to support Abel Pacheco Jr. Thank you. Thank you, cuz remember she want. Thank you Fresno. I just wanted to share with members of the public that at least I mean, obviously I think many of the candidate. I don't know if this is true for all candidates. But many of the candidates have had people write to the council in support of their nomination. I just wanted to share with members of the public that 40 as far as my staff has informed me 43 people have written to the council supporting strongly supporting Chehalis. Alice's nomination an appointment to this position. And I've looked through many of the names that I'm seeing in the in the in the emails that I've come. I have the whole stack here with me and what I'm seeing is for sure if all I see many familiar names names of people who themselves are activists in their own, right and I have been on the Forefront of not only the fight amazon.com renters rights, but also these are people I see you when I'm out there Marching for immigrant rights and the rights of communities of color in the BLM marches. I mean the people who have written in this. They're not members of socialist alternative my organization and as far as I know not a single one of them is ourselves about socialist, but they are genuine people who may disagree on various things, but they are genuinely fighting for social justice and they Getting really good customer testimonies as to why they support miss lascelles his nomination and appointment of this position many of them Rd for residents. So I really don't agree with this characterization that somehow this candidate does not have that kind of experience and and I stand by my position that it's not about technocratic experience. It really is about political Ordinary People and you don't have to convince them of this because they know this and they see the lack of political courage in every realm of politics around them. And I also should mention in. This is very relevant the vast majority of the people who have written in favor of sharia law cells have written on the basis of having watch dirt estres testimony at the community forum and at the city council meeting and I think that's substantive support meaning they have watched their responses and are saying these are the kinds of things that we agree with and that's why I wanted this is not Cherise personal friends saying I would like on account of the bushes my personal friend, but because they're impressed with the kind of a commitment that really has made of the culture of the Seattle disability commission is one of the people was written Jordan gold work whose responses also impressed me in in his commitment to a religious, you know Professor do many of the issues that I care about who has withdrawn his name and offered his support to Shalala cells. So which is quite a significant thing and a lot of the people who have written and have said that what what day was this said is Shota is perfectly capable of a kind of collaboration is its Unity with ordinary people people are struggling to get by people who are extremely vulnerable and really building a real confidence among them. I believe also in that kind of collaboration collaboration absolutely important. Unity is absolutely important, but it has to be on a principal basis and has to be with ordinary people who have a stake in the fight against lgbtq people facing, you know against the violence face by lgbtq people people struggling to just get by and pay their rent facing housing instability. So there are many of these examples in the letters that have come in support of Sade's appointment. Okay, so we are going to proceed with another round of voting and if we are ready, I think we should be at this point. Madam clerk. Please call the roll. O'Brien David Goldberg Swan for this house Big Sean Abel Pacheco Jr. Gonzalez purple El Pacheco whereas Mosqueda Harrell Jr. That's five votes for Abel Pacheco Jr. One vote for Sheree lascelles one vote for David Goldberg and one vote for Brooke Braun. Vitale's been read. Mr. Abel Pacheco Jr. Has been elected and appointed to fill the city council position 4. I like to invite Misha Pacheco Jr. To the podium and the city council has elected you until the November 5th 2019 general elections are certified. I the script requires that I asked you a question. And that question is do you accept the position sir? Congratulations on being appointed to the city? Council Mission Pacheco you make sure the microphone is on this load green light on the butt night. I want to make sure right at the there you go. Make sure there's a green light on and this time I'll ask our clerk Monica Martinez Simmons the city clerk to administer the oath of office in If I made a mistake on that Madam clerk, I have two more to go. So I'm fine on that one. Are we to read the the the oath of office now, correct? Okay, let's proceed. First of all able it's my honor to administer your official oath of office. Please raise your right hand and repeat after me. Abel Pacheco Jr. Jr. Battle City Charter Scranton the Seattle City Charter Seattle for the city of Seattle and the charger is for And the charger in the city of Seattle Seattle number? Personal check will you please address the council and Cher was congratulations first serve and please share with us and words of wisdom and realized that I did have printed out rounds 5 6 and 7 for votes at think that scared him to get him off to Dives submission for check on the floor is yours her first. Thank you counsel. And thank everybody that went with me through the process. Has you all I got to know all of you boys over the last few years, but there's one person that I want to thank you aren't with me right now. And those are my parents. Take timeshare. I've been booked their love that's inspired everything and I've done. my dad who's raised me as his own son, and I recognize how fortunate I have been throughout my entire life because of that and my mom are you all have never had the chance to meet her and see her once and I know she's important. She couldn't be here today, but I know she's watching and so I just want to say 9 years ago I kissed her forehead and I told her that and make her proud. Leaving her was the hardest thing I've ever done. But I also recognize why any one of us would ever seek a position like this. and it's her that I think about. now and always so I just say thank you all for the opportunity. And just like I told her I hope to make all of you proud just as well. Thank you. Thank you sir, and congratulations, and I think all the other candidates as well for helping us out with the process for playing. Thank you, Miss Pacheco and congratulations. well, that is if is there any further business come for the council? If not, we stand adjourned and they won't have a great rest of the day.", "end_time": 7943.6}]}