{"format": "raw", "annotations": [], "confidence": 0.9581203736910006, "data": [{"start_time": 0, "text": "Good morning. Thank you for being here for our Council briefing. Would you are my customers to want Moscato and Pacheco? And there's no object to the minutes of the June 17th, 2019 meeting will be approved. An objection the minutes are being approved from the have a few special meetings today just for the viewing public at 10:30. We'll have the select committee on homelessness and housing affordability. And of course follow the briefing and we have a short intermission and then after our full council meeting this afternoon, we'll have a Parks district council meeting about 2:30 or anytime after 2 meeting. on the full Council agenda today from the governance equity and Technology committee. We have three C tabs Community Technology Advisory Board appointments Renee Peters, Jr. Target Madison and Stephen Marsh weary, and we look forward to that and I'll go around the table. Now. I'm new goal over full Council actions. So cancer number to watch no items on today's council meeting agenda from the Human Services Equitable development and ventral side, read the next meeting of the committee schedule for his regular time tomorrow, June 25th at 2 p.m. Where we will discuss with renters who live just saw the Seattle who are facing a no cause eviction as far as we understand if they obviously we know that if they had lived in Seattle, this would not have been legally because of the Just Cause eviction ordinance, so we will be discussing the importance of extending that Beyond Seattle and we will also be a virgin your landlord renew their lease later in the meeting. We will be discussing with representatives from all home will present the results. Girls from this year's point-in-time count. We have a proclamation honoring the Seattle Channel 4 winning five Regional Emmys and I have a proclamation here to give to them we can get sign that be fantastic. And as far as my committee meeting which means tomorrow and the Civil Rights utility the economic development Arts committee is tomorrow morning at 9:30 and we have a pretty small agenda. We have the appointment to the lgbtq commission, but I'm also a navigation team second-quarter Proviso report. This is the Proviso that the council placed on the navigation team funds in is requiring regular reporting on data associated with the navigation team. And it also includes some reporting required under the city auditors. I'm checkpoints. So I hope folks can if they can't join us. I hope folks can follow along. We have no Regional committee meetings this week. I am in office hours this Friday between 2 and 7 at the Sleep Center West Seattle office hours are drop-in or if people prefer they can make an appointment either is acceptable bars major events coming up last weekend coming up last week. I spoke on a panel at the women's center Haley Morris new Leadership Institute along with Cindy Domingo and and Sharon. Tomiko Santos the really really great opportunity to speak to young women who are considering I'm careers in in public policy coming up this week little bit about the The labor-management leadership Retreats that we have coming up and then on Saturday and Sunday the Delridge neighborhood Development Association is having their Annual Arts and nature festival at Camp long and it's really neat interactive event. Both promoting Arts actually in nature really experiment experiential way of enjoying our and there's also like music And I'm also just wanted to make a quick plug you may have noticed last Thursday by myself and Mami Hara of the draft. Seattle Public Utilities went out to Recology and took a little spin on the electric garbage truck. It's the first of the nation Class 8 electric garbage truck is pretty pretty cool. Thank you. Guess where where is So I'm glad to be back. I'm I love you people but a week was not enough. So I'm just going to say that the first vacation I've had since last August. So yeah, it was good. Thank you. Okay, so last week has her bag should share the Civic development public assets and Native communities committee for me. Thank you very much. And I should have went really well. I was on the office. I love how my staff wrote a family commitment know I was on the Oregon beach enjoying some time alone. Thank you. So if you for chairing the meeting and I'm happy to be back the sitting a committee held to 2018 reports on the race in social justice initiative one from Parks and Rec understand and one for the Seattle Center and I saw the power points. They look great. Our next meeting is Wednesday, July 17th at 2 p.m. In regards to District 5 on May 29th. This is been going on a long time on May 29th, 2019 Seattle Parks and Recreation finalize the acquisition of Lake Washington waterfront property. If you all remember it was called save the beach started like and I think 2013 and it finally settled. This is a North Seattle in Lake Washington. The site has been a public small Street and Beach property used by the community is a public park and access tube and the access point to Lake Washington since the early night out of its the 1900s. But okay in 2013, it became clear that the land was not in fact publicly-owned however after strong advocacy from neighboring community members and Leadership from our City attorney and parks office. We reached a settlement and finalize the purchase of this property the property totals about 13,000 square feet mostly water with a small Shoreline its acquisition will produce many benefits for the surrounding neighborhood and every defy resident, of course all of Seattle to enjoy recreational Lake Washington and the beaches except Foot by foot or by bike and his most easy reach on the burke-gilman trail. Now, this is a sad note in because those of us who live up in District 5, we know Jesse Cornett. Jesse is a used to work at Value Village and we know his mom because she works at the Starbucks on Lake City Way But on Saturday, June 22nd, there was a memorial walk for Jesse the lifelong Lake City resident to honor and celebrate his life. Unfortunately. He was hit by a car on Lake City Way on March 29th, the driver later call the police and and is identified but the case is still unclear and under investigation and I should point out that he was in the crosswalk and he was not walking against the light. We all know who Jesse is because we see him around Lake City and we know his mom. So with that pedestrian safety is serious and so are speed limit signs but distance a dream means vital not only to those who build our streets but also to those who use them And so we are committed to keeping safety. The priority not only likes it your way or or any of the it should be obviously for our whole city Jesse. I went to the memorial and his family has described him as a beautiful soul among the many positive attributes. It's kind of sad. They've had a memorial up for him for over a month since March and it with his picture and and I was really proud of our community that came together and put together in the memorial and just on a lighter note. I want to apologize for eating the Taco at the Lake City Library, which I understood you could eat a taco there the it was renovated to Lake. Mary was newly renovated. One of the things that we ask besides getting the Ada in the bathrooms redone and the new conference rooms. We had that there's a floor space with table. So people could sit there with their children and have a snack that isn't carpeted so that it's safe to eat there and then plug in your phone. And so I be at the market went in there and ate a taco and apparently that has caused another uproar. Uproar, so just like when I made the joke about thank you for forgiving me for my library fines, which I don't have any it was just a joke. I want to apologize for that Taco at the Lake City Library in the area where you're allowed to eat a taco. So I just want to say that welcome. Welcome back. I'll tell you you are missed when you were gone. Okay, pregnant cast member nothing in the finance committee for this afternoon, but we've got a couple of major important things happening today first immediately after Council briefing and after the executive session, we have the select committee on homelessness and housing affordability. That's the committee that council president Harold created a year ago. And the briefing is going to be by Tesco beef in the mayor's office updating us on the regional homeless homelessness governance work important message for all of you sitting at this table. We need a quorum of five members. So as soon as the executive session is over, you know, the five minute break but asked that when people get back so we can get going on that. We're also going to have an update date on the Region's Youth and Young Adult homeless. Sanford's Melinda giovengo from Youth Care will be here also discussions from all home and our human services department asked that our department come forward and give us some wins because we are criticized so much about spending money and that nothing is happening and I cannot say how many times people say. Well if you only just did but of course we're doing that. So I'm hopeful today that we can begin to have these opportunities where people can say what is going right in the community. Obviously, we need to do more obviously. We need a whole lot more housing. We need more money for mental health and drug addiction purposes, but this is moving forward. So I am hopeful that you will all be there. I will go just immediately after executive Session 5 minute break when we get started also tonight. I am leaving to go to Spokane. We have the association of Washington cities meeting. I might continue to be the large city representative on that board and will be at least through this meeting and possibly through the end of December. We'll see where that goes. But I'm also supporting a woman from Spokane and our friend from Tacoma if either one of them want to step up for that, so This coming Wednesday is our next finance a neighborhood committee and it's a really full committee. So I know council member I think Gonzalez is back by then, but I don't know council president hero. We've got the guest of Crescent Proviso on our Seattle Parks and Recreation boat, which we have to raise so that we can begin to spend the money on City Hall Park and yesler Crescent will have the vote continue discussion and vote and Bobby Humes who is our new Human Resources Director. We will also have a briefing and discussion on the sweetened beverage tax creating the dedicated fund for revenue and I want you to know council member was that I have been steadfastly working to make sure that not only are we spending money on the things that we've said we would but to make sure that your focus on food food bags has been and will be included in this and we've invited Show me the number to the cab and got green but also the north helpline. So Kelly's we've reached out to Kelly Brown to invite her. Just I wanted to make sure you knew that and the second item of courses were creating the dedicated fund for revenue on our retail and short short term rental tax and that includes a number of folks who were the awardees from last year Colleen echo-hawk will be here. We will have African women's Business Association as well. So I want to thank people for coming to that. This is this Wednesday briefing since I said and also a landmark legislation for the Old Spaghetti House Thank you. Mr. President there is one item from the housing Health Energy and workers rights committee on today's full Council agenda. That's a big piece of policy that we've been working on over the last year in partnership with community members regarding how the city uses its funds for affordable housing. This is the ANS plan or the administration and financial plan for the office of office of housing dollars and made available in 2019 and 2020. I like to refer to this as the moral compass document for the office of housing in terms of how they spend Levy funds and send the zoning payments mandatory housing affordability payments as well as other funding sources that the city administrators for the creation of affordable housing. I want to highlight a few elements here. Mr. President before we get that out on full Council today just so folks first. I want to acknowledge and thank councilmember herbold's for your work with us as we tried to elevate and harmonize some of our labor standards and priorities in the building of new. Housing we want to make sure that those who are building affordable housing are not also eligible for the same housing that they're building and we know that this city has done quite a bit in partnership with Seattle Housing Authority, but we wanted to explicitly include language and the AMF plan to make sure that I were looking holistically across the city about how we create a comprehensive approach to including hire labor standards with in our housing policies and funding those projects. So really excited about the future work that will come from this harmonization effort and want to thank you over the last several months. We've also been meeting with various stakeholders in the community from this community housing round table that we've been convening who are individual to assist those with getting into housing individuals who need housing themself folks who do the building of affordable housing especially those who are new to the Housing Development world who worked directly with those who are at the highest risk of displacement and making sure that new organizations who are working with those at the highest. Displacement do you have access to housing affordability dollars and so we've included some key Provisions based on their feedback one of the things that you all remember last year that we did was we said, please stop selling off Surplus land that the City of Bones to plug budget holes and we want to preserve public land for the highest and best public use which is housing affordable housing and our Community Partners at the times of yes, thank you. This is a good first step for the other concern that we have is or not able to access the dollars to actually build a housing. So what we've done now with the ANS plan is we have created a complimentary piece of guiding document that will help tell the office of housing. Please prioritize those developers does nonprofit developers those developers who are the non-profit world who works specifically with our communities of color and those who are most risk of displacement and get them to the front of the line so that we can make sure that there's affordable housing that's being built to ensure that those who are at highest risk. Opportunity to stay and live in place where they work or Asian place. This is a really important compliment to the Surplus land proper disposition proposal that we passed last year with the council support. So this is really important and it helps us to create additional housing for those who've been at risk of highest first of displacement by supporting the and enhancing the preference policies affirmative marketing policies those I have been a guest put on steroids in this document to make sure that we're prioritizing community members with historic ties to neighborhoods for the new affordable housing that is going in in areas of highest risk of displacement. And we've also done another thing directly from the nonprofit Community organizations that we've been talking with and that is great additional funding for acquisition of existing buildings. You can imagine that with the cost of land in the city the cost of labor on the cost of materials continuing to go up if we Don't have the resources to build brand new buildings. What we should be doing is acquiring existing buildings that are affordable updating those and making sure that they're healthy for low places to live in getting those in the cities hand so that we can get get access to our community members. So we're really excited about this. We think this is a comprehensive approach want to thank the office of housing specifically director Walker and his team Emily Alvarado and others at the mayor's office at for sending us down the proposal and especially our colleagues here in my committee who works at amplify and I think strengthen the proposal as it came down very excited about that. So that will be on full Council agenda see how they help energy and workers rights committee will have a special committee meeting this Thursday on June 27th from noon to 1:30 or discussing one thing and that is a protection for hotel workers. There will be four pieces of legislation. You may have already had a chance to see that when you're real bus reading over the weekend. We did post the four, please. The legislation online thanks to minis are offices for already engaging with us on the council member Gonzalez and I have been working to try to get some of those details right with all of you. And we now have the four pieces of legislation ready to go. We will have a public hearing on the hotel worker legislation next Tuesday. That's July 2nd at 5 p.m. Here in council chambers in the evening. Hopefully make it more available and accessible childcare again will be provided anybody who wants child care. Please let us know it will be complimentary email my office or Ashley Harrison at seattle.gov, and we will make sure to get you checked in parking is also going to be subsidized for those who can't be here on public transit $5 beginning at 4:30 p.m. And we will make sure that you get those tickets in hand. If you need to come and park emphasize that we're doing this on the evening of July 2nd. We will be canceling the July 4th. Obviously cuz it's a holiday on July 11th. This presentation possible vote on the provider wage inflation adjustment. The hotel worker industry standards were discussing amendments at that point and as a follow-up to our last meeting conversation Impossible on the notice of intent to sell legislation that helps to get more tenants and nonprofit developers in line to potentially purchase properties that are going up for sale that have at least one unit. That is at 80% Ami and below and to try to expand the scope of that legislation that you all passed a few years ago with my council member Clark and Burgess I believe. Last legislative session and how we can make sure that the city's priorities are better reflected in future years on Thursday. I'll be attending the fair work center is legal clinic to celebrate their new legal clinic at my accent at 10 table dimensions on Friday and number of us including jails number herbold present here all by myself members of the labor community at a coalition of Labor and co-chairs and members in addition to the executive's office will be convening for an all-day Retreat to talk about the labor and management leadership committee. Many of you have been on that four numbers of years in various iterations. We are reaffirming our commitment to use this body as an opportunity for us to bring together. Workers management Council budget office and to talk proactively about issues that we should be able to address before they end up on the bargaining table so that we can continue to lead by example of good strong supporting city as an employer a Bosch and also spell Housing Authority yesler Terrace open house that's in the evening really excited about that and I'll see you on Sunday at Pride a quick addendum to this American Solace wanted me to do a report for her if I may, okay. Sorry Council colleagues. I want to add to this in for council member Gonzalez who has access to report out happy to do so. Thank you for asking us on the gender Equity safe communities a new Americans education committee. There will be one item from the jazzmatazz committee for today's full Council agenda. That's Council Bill 119. 539 which relates to the King County Wide Emergency Medical Service EMS Levy which expires at the end of 2019 and is up for Renewal. We did discuss this in her committee. Last time we met at the council bill would authorize the mayor on behalf of the city of Seattle to enter into an interlocal cooperation agreement with King County regarding the use of the revenue from this Levy is Bill would further authorized King County to place this Letty proposal on the ballot for general election on the November 5th, 2019 election. If approved by King County voters the renewed letter you would provide an estimated 436 million and total revenues during a six-year period from 2020 to 2025 to the Seattle the fire department for Emergency Medical Services. This bill was held over last Monday because the county was reassessing the tax levy rate in light of changes to their financial forecasting. However, the decision was made to not adjust the rate currently. In the 2000 the legislation which is 26.5 cents per $1,000 in assessed value there for him to Tori work on this legislation is necessary and it is now ready to proceed with a bow by the full city council. So the Levee proposal can be placed on the ballot for the general election in November and 5th 2019. Good morning. So there are two plus related items in the full Council agenda today and I cancel Bill one 19546 switch updates the rental registration and inspection ordinance and clerk file 3 1 4 4 1-3 which proves a temporary expansion in North Seattle Precinct to add for Portables and parking. The next meeting is on Wednesday, July 3rd. And I think the folks who were able to join me on Saturday at the district open house the organizations that were able to attend in and help talk to me that I appreciate it. What is the painting and if you'd like to schedule some office hours, please do so by counting contacting my office as I'm there on Fridays this week. I will be at the Laurelhurst Community Center advisory council meeting on Wednesday. We will housing a round table with the District 4 Council presidents on Wednesday as well. I'll be doing a impact I'll be at the United Way emerging leaders in fact bash on. Play on Saturday the Wedgewood Park open house and I'll be with all of you or those I will be participating at the Seattle Pride Parade on Sunday. And if you are going to get tacos again, we need to talk about it. So. Thanks very much, Thank you Dean Transportation committee has one item on this afternoon's agenda. It's an appointment for the love of you move Seattle oversight committee committee does not meet this week. I am passing around a letter that you should have received in the last week that I'll be circulating for signatures at full Council this afternoon. This is a letter. Well, it's a letter about a letter. So there's a letter for us to sign that essentially supports the Seattle for a green New Deal how much has been put forward by a number of groups but being led by Guy green and 350 Seattle. I know a couple of my colleagues already signed on to this opportunity. And so we have been circulating out of that city council that are on letterhead that folks can sign on to I'm if you have concerns about it, just let me know and I'll just write the name from it. I will be at a press conference in a cup. Cars with City attorney Pete Holmes about Seattle Green New Deal and I believe they'll be a few folks that are coming after the press conference to full Council to I say a few words about their efforts at so we have a list of actions to the letter quickly look like principles that are pretty strong and I have certainly agree with Are there specific actions at this point. We're asking people to take a shower and I appreciate you always cutting to the chase of like what are we actually going to do? What I can tell you is that this there are some ideas around actions. There aren't specific actions at this time part of my understanding of the work that's being done. Not just locally, but nationally on the green new deal because of the State of Affairs in Washington DC. It's a lot about building moment momentum and energy for a future opportunity. Do something of a national level but here at the local level. There are opportunities obviously to do things already. There are conversations that are happening with community members part of the framework of the green New Deal is to release some of the voices of community is most impacted by climate change. So low income communities and communities of color around really driving the changes and those conversations are happening right now. There's a recognition of course that we need to radically reduce our carbon emissions. How do we do that is the tricky questions. So the models that a lot of traditional environmental and economic Economist have been trying to use for the last decade I've been about how do we increase the price of carbon emissions to try to use a market mechanisms to shift people away and what we hear from a lot of these Frontline communities is even a modest price shift can be really challenging for us and force us out of our communities, but we also are more committed than anyone to moving away from carbon emissions. We just need some help doing it. And so what those packages look like and how they might Ford I think there's there's ongoing work to be done. I suspected in the next even few weeks. We'll probably see some actions that they'll be asking us to take this year. And I think I lost be laying out a ground War 4 how to move forward because a lot of this work, you know, for example, if you want to convert from a natural gas or an oil furnace to electric heat switch is 100% carbon neutral in Seattle. It's an expensive Capital costs. And so we will need some revenues for at least some households to help them make that transition word of those revenues come from how are they raised those revenues? How would they do that? A Progressive Way are all conversations that are happening. So at the moment this letter is is more about Concepts and ideas that I suspected before Summer's over and maybe even sooner we will hear some very specific things in the framework. The folks are going to be asking us to do City County State. Eventually had a very good thank you. Love it. If we could find some quick wins. Let's Identify some things that we is a city can do that's going to make progress, you know over the next weather is 60 days 90 days 120 and then also have a schedule for looking forward for the next decade did I think once people get excited about his needed some things we can do that can really make a difference then that builds his own momentum. Totally Green in my mind. I have a feeling right focus on the next 6 months for some reason. I'm not sure why but I but I think doing a lot of things in the next 6 months really excites me and then laying some groundwork going forward. So I am with you cancel before removing executive session is you want to think many of the Department's for the city of Seattle for putting together a magnificent celebration for Juneteenth day in the birthnight Lantus last Thursday at council member Pacheco and I attended that great event. I want to give a special shout-out to a Marta a towel and I need a wide another should put that program gun. Sure. There are many others that played such a huge role in organizing that but it was very well attended in and the mayor attend as well. Then they were gracious enough to let me share a few words. So thank you for all of that. And with that we're going to move into executive session. Switch presiding officer. I'm announcing that the city council now convenient executive session. The purpose of the executive session is discuss pending potential or actual litigation. It's an opportunity for us to discuss confidential legal matters with our city attorney's is authorized by law. But we always Reserve questions of public policy for public open sessions and a monitor from the city attorney's office is always a present during these sessions for sure that we reserve those questions of policy for our open sessions expect this executive session to to last about 30 minutes. So that'll be 10:32 a.m. And if it goes beyond that all announced its extension and the expected duration and with that we will move into executive session.", "end_time": 1891.9}]}