{"format": "raw", "annotations": [], "confidence": 0.9434691295027733, "data": [{"start_time": 0, "text": "Greetings and welcome. It is 9:33 a.m. On March 12th. This is the Civil Rights utilities Economic Development and arts committee on Lisa herbold on the chair of the committee and council member representing District. That is West Seattle and South Park on today's agenda. We have a reappointment of Michael Garrett as the number of the Seattle lgbtq commission. His appointment will follow a public comment and after his reappointment. We will receive a update on a draft bill regarding public accommodations and closed captioning short agenda today. So with that will begin with public comment, we have one person signed up Alex Zimmerman Dolby keep keeping time 2 minutes. Dear Kyle my dirty shooter. I'm not your garbage rats are pure anti-semite in Criminal. All of you without exception right now. So you talkin about disabled. I'm disabled to but I don't understand what is every meeting cause of water has passed me because they go for position number 530 Coastal physician number 5 in U console Wii U console don't stop until you see it is this chamber for 20 years, you know, you know, what does mean fascism in the new broken rules. Are you Lord protect me during Civil Right, You posed to be practically so surprised me right now. So Atlantic to the stranger Seattle number one personal or five times supposed to be out from this and you supposed to be doing this because you represent see if you're right. She posed to be out 5 * 5 * Broken law constitutional or other people. What is a cup of brown? Not to God We Trust support kind of wise or mosquito what's going on with you guys or brown counseling? What does it represent only 7% of people in this a mafia Band guitar to assist. You know, what is mean control directions to Alexander Menards. You are old man. I disabled man come for 2 minutes is talking every single time. You don't do nothing when you share of tibula write your boss to be stopping this brown Mafia. Seattle cleansing story chamber. First item on the agenda today is appointment 01266. Reappointment of Michael B Garrett as member Seattle lgbtq commission for a term to October 31 2020. Welcome to the instructions, please America Pablo from the Seattle office for civil rights. We are here to do a reappointment of a member to the Seattle lgbtq commission. This is America appointments. Can we start off with just a quick overview of the commission? What does yes, so I stopped the Seattle lgbtq commission and as we all know they helped advise city council and the mayor and City departments on issues pertaining to the lgbtq community on there currently working on their work plan excited to presents out to city council. I can't believe in the end of April and I'm excited to be here for Michaels real. He's been great on the commission has been really involved especially around trans Healthcare last year. And then he's hoping to you know, continue with some of that work on the state level as well. Great and remind me of when was Michael first point was he appointed to fill a vacancy? I believe so so that's why he joined in the middle of a term. I don't know the exact dates though. It was in the middle of the term. So this will be his first full term and his background as you state is focused on Healthcare. And that is the focus. He brings to the commission. Yes, that's he actually did the committee of the commission before he was a commissioner so did some work for about six months before he was confirmed. And then now he was just the last meeting he was voted in co-chair of the Community outreach committee. So he's working on developing some of that work plan right now and just to restate you'll be joining us in April. Yes. I'm sorry. I don't know the date May 23rd, I believe and then coaches from the other commissions as well. I don't have any question that I just want to do make a mention of how a graded was that be lgbtq commission. Take a chicken explicit stands in support of the trans Healthcare demands that UAW Local 4121 had in the last contract negotiations. They also had a really great one-day strike action was about expanding health-care rights for their trans members and discuss this with the lgbtq commission and they were very open. Do you know shooting a statement of solidarity with them and I'm sure Michael was part of that as well. Although I have not had a chance to talk to him might have had something to do with it that I will move appointment of 01266. All those in favor, but I I an opposing abstaining and Michael's appointment will move on to draft Council bill regarding public accommodations and closed captioning. greetings And welcome. Could we start with introductions? common Council Central staff I'm Eric share commission co-chair for people with disabilities. Thank you who would like to start? Absolutely, so we discussed you all discuss the concept around this bill on that would require closed captioning in all areas of public accommodations a little while ago. And so since that time since having this discussion, we have drafted legislation to put that into the municipal code. It would create a new chapter 1405 mm in the Army and we modeled some of the enforcement around this on how the office for civil rights currently enforces all gender restroom. So if it's too far I'll go through the main points of the bill would enforcement looks like and then that'd be perfect. So what this would do as I mentioned is required public areas of all places of public accommodations during the regular hours to activate closed captioning on television receivers. There are a few exceptions if the TV is not being used in the public area if the only TV. Their eyes technically incapable of using closed captions or the program itself does not have closed captioning in it. Enforcement is currently drafted by The Offspring civil rights. It will only begin 180 days after passage of the bill itself to allow time for education and Outreach people aware of that obligation. If it is after that 180-day. If it turns out a person's not in compliance than the office for civil rights will send an advisory letter at that point the person must provide a written response to the office for civil rights within 10 business days, which describes how the violation will be fixed or disputing that the violation to place it all at that point out. If there's no response from the business or the director is not satisfied with that response. The office for civil rights has the ability to issue a notice of violation which would include a penalty of up to $125 for the first violation and then up to $300 for the second violation. I'm at that point. You could go further into an appeal to the hearing examiner which could and hearing examiner can consider a variety of factors in determining what penalty would be and those factors include is the nature of the person's involvement in the violation weather harms occurred or suffered as a result of the violation. This could be economic Financial or otherwise, what is a violation for isolated or temporary or their repeated and continuous the magnitude and seriousness of the violation the cost of the city of investing the violation, excuse me, investigating violation and correcting and are attempting to correct the violation and they any other facts that could bear on nature or the seriousness of that violation. Given that this is I'm going would like to go into it like a hundred and eighty days. It seems to be enforcement going to affect 180 days after passage. It's possible that after cigarettes might need assistance in terms of Outreach and education, especially to small businesses those who may need a translation or technical assistance to be aware of their obligations to comply and as I mentioned some of this was modeled on a all gender restroom Bill and so depending on This spells level of compliance. There may also need to be additional staff to help with technical compliance, but that won't be until obviously this goes into effect and the office for civil rights to use what that looks like and when you say it's modeled off of the all gender restroom Bill, what do you mean? What's what's similar in terms of the enforcement piece? So are other bills are other bills other parts of the muni code. So for example of compliance with public accommodations generally and there's a full investigation process. It goes straight to notice of violation. This bill is is closer to all gender restrooms because it speaks more to how to get into compliance. I'm so does the way all gender restrooms played out is that there are very few businesses that aren't willing to actually you don't create an all gender restroom. It's more about knowing Compliance means how they can be in compliance and being aware of the obligation. And so this is very similar to that. It's it's unlikely that there will be businesses that will refuse to do this, of course they're there and that's why they are so right at the discretion to be able to issue the notice of violation and decide what the penalty is but more likely than not this will be about educating businesses about what they're what the requirements are and making sure that they know how to comply even if it's as simple as you know, where on the remote you need to figure out how to turn on the settings and which specific settings it is cuz there are technical standards in here. So so it's focus more on that. Fantastic. We are joined by council member O'Brien, I think a thank you for joining us an important points to put right up front for folks who don't know it is that since 2002 the FCC has required closed captioning requirements in All Digital television receiver. So whether you know it or not your television very very likely. Has this capacity is literally just a matter of turning it on. If you can go over how how has the compliance I mean how how long has it been since our generation bill passed and what has been the track record of that and what is it? Does it offer any guidance for us to for us in in this? And then also I really agree with the findings should not be hard for businesses comply with it because it has FCC has so that you can use it and to be honest with you. I use it. I find it very helpful and I'm I'm running into more and more people who are not necessarily hearing impaired, but they actually appreciate having that so it seems like it should be an easy thing, you know about to leave your things to do and that's that's absolutely the moment and so for all gender restrooms what I understand and talking to the office for civil rights. Most of the work has been around not necessarily issue a notice of violation or any of that but actually Find looks like so I like taking a photo of of the difference between the restrooms before and the restrooms. Now that have the sign that says I'll drive the restroom. So it's been very much more the staff. There has been working very much more around technical compliance and they have around investigating intentional violations or refusals to to go about complying and the other pieces of that may be a little more challenging for this for this bill is determine how exactly compliance will be shown because it is so easy to turn it on. It's also super easy to turn it off. So in those particular situations, it may be difficult to sort of figure out what it looks like to to provide a written response to the director and proof compliance. And so it's likely that in rulemaking filby public input about what that looks like. How one would go about proving compliance and then what that looks like on an ongoing basis. There may be lessons to learn from Portland Brands. They have a similar piece of legislation. I don't know if they're also taking a similar approach towards enforcement having a few very compliance-based rather than punitive, but that might be worth checking out. I don't know how long Portland's ordinance has been in play there perhaps Eric you do because you were the one who let us know other cities and states in States Nationwide to try to fill out some of those loopholes to prevent those issues from coming be coming here like having the captioning the business can also make the captioning difficult to see if it said with a gray background or a very small font people that have visual issues will not be able to see the caption. so if for example of the captioning right now, if you are television, that's exactly what we want to see within the bill to clarify what I look like, I think you appreciate that research on the experience of other cities and the guidance that you provided us and not only identifying this is something that the council should take up, but also in working with Council Central staff on drafting the legislation as well. Preciate it I want to mention that we've received a letter of support from the hearing loss Association of America and we've received also a number of letters in emails from constituents over the last few days. Somebody must have told them that we were hearing the same committee. The plan is to introduce a bill next in 2 minutes into two Mondays. Okay, and then hear it in Committee in our first April Kennedy. Is that correct? On March 26th, March 26th at I'm getting all the days off and then I'll be working to get and solicit the input of both the Seattle Restaurant Association the Seattle hotel association and the marriage small business advisory Council to get their input on it on the bill as well before a committee vote. There are no further questions. On this all right. That's our last item on our very short agenda today. Thank you all for joining us. 9:50 a.m. And we are adjourned.", "end_time": 1071.5}]}