{"format": "raw", "annotations": [], "confidence": 0.9344808472569581, "data": [{"start_time": 0, "text": "Good afternoon, everyone. It's 2:03 p.m. On March 12th. 2019. This is the third meeting of the Seattle City council select committee on homelessness. I'm joined today by a council member water. Thank you for being here. This is a select committee of all nine counselors. Hopefully other consumers will be along soon does the rotation by myself don't remember back show and councilmember mosquito and the previous two meetings as many of you know, where's Jed by the other two council members. This one is being shared by my office. And today. We have two important topics on the agenda first. We will discuss with The residence of the share and wheel shelters about the six months into the five-year contract that they were recently awarded to keep the Beast basic shelter keep open the basic shelters to operate they will talk about what they think this new notification from the mayor's office means we also have Central staff here to help us the song what what we think this means and you know, we want to just go over some of the questions that are, based on this new announcement and what that means to the Residence at Cher. The second discussion will delve into some of the causes of homelessness in Seattle and specifically connections to eviction. There is an ongoing and really exciting new series of studies from the University of Washington and collaboration with other researchers and we are lucky to have dr. Tim Thomas here who is leading that study to help us understand what that study tells us. And also what it means for Seattle in terms of policy-making and so both of these discussions today are related to homelessness and also housing insecurity in g-force. Of course, we have public comment. This company is being assisted by 10 garden and Nick Jones from my office Nick, will you be reading the names of the people who have signed up for public comment on each of you has to go to minutes to speak. Thank you good. Okay. First Republic, we have David Haines called by Alex Zimmerman. There needs to be held accountable and honest and not give Scooby. We need an accountability for the board members of Cher and Wheel City Council president created this committee to create a transparent parent working group that develop strong policy and investment decisions as well as enforcement strategies gets Scott more of a share Anisha Freeman of wheel in the board of share/wheel thinks the performance improvements are nebulous meaning big unclear accountability goes to the heart of solving a crisis and justification of financing self-appointed politically-connected six-figure salaries getting rich not helping in Singapore. This committee needs investigations into Sharon Lee Ronnie guilbeau of urban rest. Stop Scott Morrell all home and many of the do-nothing power mongers feeling the poor daily to ensure that they have a 20-year working career and pay plan at the expense of innocent poor. Excuse me. City council needs to know why share/wheel office is only open to screen home as for about 20 minutes per day 6 days a week and that start moral refuses to help an innocent homeless person in it that an emergency by helping them get shelter if they don't meet that requirement of showing up at the office and he claimed it's because he's not allowed to use the cell phone to call another shelter like overseer because if the city council finds out that he can use his cell phone to screen so begin. He claimed city council will take away his office, but he only owns his office that he has even open usually like 20 minutes 6 days a week. He needs to be investigated about his lack of effort. He wants to keep the homeless card and sub Schumann mistreatment. Have you ever stepped up here represented why he doesn't keep some there. Subhuman, and dishonesty tells me you're not allowed to tell other people about different on promise cuz we compete for the same budget money that's outrageous and revolting. He needs to be held accountable along with the whole share/wheel board and low income housing mortgaging their future off of urban rest. Stop Shakedown of that square footage of that dilapidated building. After Alex Zimmerman, we have Jim McMahon then queen bee King Rios then Alex Finch. Zakir my daughter if you order a criminal and killing my name Alex approximately $30,000 approximately four hundred million dollars spent approximately between hundred volume 250 million dollars you fix it all problem once and forever Nu 7 season 6 here in this chamber never talking about easy fix it this number to about the rent. I have eviction six-time in a brain to 9620 more than 20 years ago biggest class-action about eviction for 500 family in Bellevue. Class action in high winds class action very simple. I know that we need to stop a government fund. This phone can operate like a debit card or credit card when he can give you feedback probably percentage zero or something like this simple easy. Give me a couple million dollar Sunday. Why don't you exist not have sense? Because I probably why you a servant for 6-year never talking about what this guy talking right now. Where is it? Very simple. You don't need big money for fixing a problem. So why your Crocs it has a champagne for many year you don't do nothing. So I speak right now just yet. They'll stand up Seattle. In Killer, Joe country people die every year from you. Jim McMahon then queen queen bee King rails Jim McMahon workers world party don't defend the city safety net for the homeless and fully fund share and wheel these homeless organizations might have more experience providing the homeless with shelter in the whole city council and mayor's office put together. This city is not dealing with homelessness as an emergency as declare instead. It has bided his time and use brutal sweeps to deny those living outdoors with even a place to lay their head and the city has greatly contributed to the desk of 120 people living outdoors in the past year. Don't pass the buck for responsibility to the County government and other levels of government. This is one of the richest cities in the whole world and the city stands embarrassed in front of the whole. Concrete for refusing to tax the rich corporations, especially to provide housing for the homeless. We demand a moratorium on evictions housing is a right elect Sharma sawant for city council. We elect Sharma sawant and tax Amazon provide housing for the homeless. Can you be done after queen bee and then w? Good afternoon, Seattle City council members. I am queen bee King Rios. I'm a member of Will and a leader of women in black. I was also formerly homeless in 2018 women and blacks does silent vigil for 120 outdoor by violence deaths in Seattle and King County the share/wheel shelter Network provides a warm safe. Loving Church band shelter Network for clean and sober homeless women and men I thank God for the wheel women's low barrier shelter that it is seps any woman in any condition at any time of night with the no turn away policy. And it's the only one of his kind in the city of Seattle. The city asked will to start this as a winter shelter 20 years ago this may and it is now a year-round shelter if it was needed 20 years ago, we can surely see that it's needed more today women are scared and Afraid our cities and more than a crisis. It is a health. Human health disaster if we don't have the women will women shelter. What should I say to 40 or 50 women who depend on this shelter nightly. We all know how important shelter is since we got 20 inches of snow last month a big thank you to use city of Seattle for opening a warm safe doors last month for people to get out of the cold. If you really want to talk seriously about the future of our city. We need to get serious about how we help our less fortunate. I'm not talking about simply throwing away money at the problem. I'm talking about permanently funding shelters, like share/wheel and programs that help change people's lives this help includes from temporary to permanent housing. You can expect a high x-ray Department of Housing when we don't have enough housing to exit people to city council. We need you not to let mayor durkan and the Human Services director. Do you find the Are will shelters 200 more women and men will be affected by this defunding the funding isn't a want. It's a need for our people and our city. Thank you. God bless you. speaker speaker Sorry. Good afternoon members of the Seattle City council. My name is Alex bench. And I just moved to 3814 4th Avenue Northeast before then. I stayed at your wheels Tent City 3 and I am on the board of directors on February 26th. The mayor's office and Human Services interim Human Services director told us they contract for 6 months the end of June 2019. We believe this is in retaliation for outspoken support for requiring the Human Services director to go through a race and social social justice based open to everyone throw hiring process. Cutting our shelters bypass this council's unanimous decision to fund our community building and cost-effective shelters for the next 2 years. It was the second year in a row. You had to restore funding for two chairs indoor shelters after the mayor and Human Services director cut them. It's already March. We don't have a contract and we've been performing services in good faith without reimbursement since January 1st, we're doing well at placing people into stable housing and there are many other agencies doing much worse than us and Reporting demographics and other markers. However, the most important reason for shelters though is ignored by all of hsd's data Matrix metrics. It's to help homeless people who would Otherwise Die in the streets with last year's outside or by violent death count at 120. And this year is a 28. How can hsd keep ignoring this metric? How can we keep being a pathetic in this state of emergency? We know that there's always room to improve. We've made many changes over the better over the last decade and will continue to do so with the approach of the mayor. Mr. Johnson in the human services department of retaliating against us for our views instead of working collaboratively with us makes positive change much more difficult for the record. I don't get a paycheck to do this. I do this out of the goodness of my heart. Because I care. After Imaging Williams, we have Tracy arm and then Rebecca Morrow. this this This funding cut has already been restored once by city council, I believe it was unanimous. So this should not be happening. The first Speaker talked about problems in the leadership. That is that is serious. That would need to be addressed. On the other hand, we can't be careless with these spaces. We need every single space and we're glad share and wheel is providing them. So I guess city council. You just got to do it over again. I also picked up confusion about what improvements the mayor wants cuz I did not pick up anything about the leadership from Anybody else except the speaker today? What improvements she wants? movies continental breakfast there is confusion on that so city council. I just guess you got to restore them again and hope it sticks. I thank you. My name is Tracy rent and I currently work for the wheel shell toe. Currently will shelter over Trinity Episcopal church and the dandelion sure. We spoke to y'all and y'all to Natomas Lee to give us funding for two years and it was like this is great about it. Cuz I know that we struggle to get funding every year and then we got the news that it's only going to six months so far this year at all no contract to sign nothing and It's like a slap in the face to the women. I mean y'all need to get to know the women that we serve the one you want me to come to our shelter. They have just add the addiction problems. They have the mental health issues. But there's also women that just you know, if they got evicted they know they got nowhere to go the women you can't do this to the women. I mean, there's a they trust us. I mean, I was one of the women that I slept for a long time. I want to come in and not too long ago, and she said that she talked to me she's been raped and she did that with the physical pain for 3 days before she before she came to us because she was embarrassing to my to be didn't want to be embarrassed by the police. Nobody talked to her and she trusted us enough to call the police and sit with her while I talk to her and make a report on it last year. We lost two women at the end of the year one died and housing and other friend's house went out in the hospital. And we grieve with the women when this woman died when they when they die when they die, so young protection the most you're condemning them to an early death as well. Why can't you do that? You have to it's it's right. It's the right thing to do. I mean, that's the bottom line. It's the right thing to do, Seattle. You know, that's it. Statue Rebecca Morrow. We have Megan Murphy and she could be the last speaker. Good afternoon, council members. I'm Rebecca Morrow as the new hired employee to the will women shelter. I get to work firsthand with the women and see their struggles. We operate as an emergency women's night shelter. Are we accept women throughout the night and early morning when other places are already closed we receive phone calls and request from from spaces from from Force bases from hospitals and other agencies when they're out of room. We have a housing worker that comes in and meets with the women and schedules appointments. We also hear the term that I can't afford that too often from the ladies. When we suggest places the women depend on us to be open last night. We had 64 women sleeping in the shelter instead of on the street. The women deserve to have the funding back for the two years. They don't need to have extra stress trying to find a new shelter to go to. Thank you. Hi, I think it's deplorable in this day and age that organizing enough to provide basic shelter for vulnerable women is an issue. If we should be well ahead that we know that this is Marley part of the the the formula for how we spend money because I know firsthand if a woman is diagnosed mentally ill and it's a diagnosis isn't correct there is cracked or whatever some of that medicine the side effects are horrible to leave her totally vulnerable to the forces of eviction and then when you know, she's evicted or you know, if I were evicted and then I had to find some guy that would let me couch serve just to say safe and it's probably going to be an abusive relationship and there's probably going to be drugs involved because it has to be fast fast fast. So you said nobody sleeping on the street and left open the Predators on the street. I can't believe none of this is taken. Two consideration, you know to just it would save a lot of money in the long run. I read an article and CNN that some women were spending like 6.4 million for their kid to get into an Ivy League school that money is just being wasted by the by that political agenda when it should be pure talent that doesn't cost any money to the only people really talking about this or socialist. Cuz Pelosi is is really disappointing me that the so-called important meal Liberals are in addressing this unfortunately. That's why I'm I had to you know talk about this because he should be the most feminists because she's married to a woman and she's letting this happen to women and Don Johnson. Irritated her enough to threaten funding for with that's misogynist on her side, which might win her big points for the patriarchal capita. Best time to inflict pain on women cuz that that drives her what they Define is testosterone up or I don't know what it is that they call her their sense of superiority cuz I know a lot of good men who disagree with this also. Thanks. Nashville a speaker who wants to speak in public comment Okay, sing. No. No, go ahead. Go ahead. And and then you should sign up on this sheet as well after you speak to make this decision. I went out to the all home website that date is over a year old. How can anybody in the public know what the performance is on the shelter's the missing data there a lot of other shelter providers who have worse track record than sure will please look into the data. It's I don't think the correct and I don't know what the human services department is using to make these decisions. I don't trust them. right on girl Thank you to everybody Who provided public comment so our first agenda item is discussing. The city of Seattle's contracted share/wheel to provide basic homeless shelter services in the city. Are we could we have presenters the table, please? And I always wondered if not like we've been joined by a constant for her both. Thank you for being here. And could we could we start with one sentence introductions from everybody? And then I just want to preface. The item a little bit and then you guys can speak. Michelle Marchand, I'm an organizer with Cher and wheel. Nicole Calhoun on staff at wheel and also the data answer. Anitra Freeman and formerly homeless participant of wheel and share Christopher Anderson and Share Board of Directors Oh, and and I am the President of the Share Board of Directors and an elder of will they call me? Cast member swap topless in Lake Elsinore. Thank you for the public know that my office did invite the mayor's office and the human services department leadership to join of this meeting because we we we never really wanted to hear from them about this issue and the reasoning behind the decision that was taken and explain their thinking unfortunately. Their response was in this was in response to a letter from my staff member to the mayor staff. It says thanks for writing the same message from before apply to the select committee as well. No hearing from no hearing for Jason means no, I just east of our mayor's office staff coming to council and it's it's unfortunate in my view that the mayor's office has taken this intransigent position on this question. Do not engage in any issue at all. Cuz you know based on the what's happening with the appointment to the Human Services director that was awarded to make sure everybody knew that since we had that discussion on the Jason Johnson crash in the human services department has released information on the survey employees are way that they did last year. I don't think we have that here, but we will make sure that shared with the public as well, but you're not here to discuss that issue here discuss the cashier at the table. You will find I think the one on my left most is a packet. It's a statement from Sharonville. It's an email. That's a job an email from the human services department explaining their reasoning for the notification that they sent to share/wheel. And the last one is the notification to Sharonville itself that the notification is it says that it changes the Contracting, PA. From January 4th this year to December 31st this year to January 1st this year to June 30th this year and the letter says the mayor wishes to convey that she's happy with improved exist to housing and hopes that their device award will provide incentives for improve utilization which could result in extension of the contract now we unfortunately we don't have the mayor's office of the human services staff to expand as we we will rely on Alan Lee accountant obviously not be speaking on the mayor's office has BF but will give us whatever inside you can give I will say just from my standpoint. It is it's real. It's odd to take to say the least to say to a service provider that you're happy with the improved exit and happy with the performance and that's why we are making your funding more even more contingent than it was before I did doesn't make sense to me, but we'll see what what it means and hopefully coming out of this meeting we can also have Questions that we can send to the mayor's office do explain certain things but having said that and making sure that the public knows that the information that they can get we should get into the discussion. Maybe we can start with the Sharonville representative serve what at the table to let us know, you know, how you find found out about this. My assumption is that you were notified on the 26th of February. And also have you had a father communication from the mayor or the Human Services leadership. Have they told you when they will decide whether what would happen to the shelters after June? Like I said what the process will be and so on and if you want to make some opening remarks before. That's fine too and I also invite Allen. Do I make any opening statement that you think would be useful to us? When did you want to speak first before they even in times of what you know, and then maybe we can go to share/wheel. So I have actually nothing to add outside of what you've already described. So we each have opening remarks and they directed me to start for share/wheel. Good afternoon council members. I'd like to thank you for allowing me to address you today. I'd like also to thank my community Sharon will members and Leadership for releasing me from our standard protocol homeless people speaking for themselves in order to discuss contract matters with you today out of my role as the contract specialist for our organizations now and also from past work experience here in Seattle. On February 12th, 2018. I address the council housing committee and outline the Arc of my work experience in Seattle, which is the Arc of downward Mobility solidarity love and hardwork. I currently am one of the lead organizers with wheel and share and have been working with this community since 1993 and all of my organizing co-workers make minimum wage. This is a matter of solidarity philosophy and also under Sesame because of our shoestring budgets. Before I came to work with wheel and Cher I will suggest with volunteer and then a shift worker and supervisor at st. Martin de Porres shelter for older homeless man. Then I was recruited by Catholic community services start up a winter women's shelter just before the snow emergency of 1990. That shelter was supposed to be a short-term project but need demanded our advocacy and negotiation for its continuation are working together with Mary Rice's Administration and many others resulted not staying open and gross into Noel house Rose of Lima house and Paquita Gardens. I was just 25 years old when they will have started very green and new to the task of running a large important life-saving shelter at the time that shelter was in the same building as the Seattle Human Services Department the Alaska building in an Unleashed and ramshackle tallyspace on the first floor, which is 10 days notice before the shelter open HST staff the Seattle Conservation Corps and community volunteers help prepare the space clean it up install heaters and laundry machines HST workers routinely spend time at the shelter hanging out with women conversing and asking what we needed. Nhsd contract manager sat down with me and taught me how to prepare budgets and navigate the forms needed to invoice the city for the work we did. those were glorious days, but they were not without struggle public conflict and criticism, even though we disagreed on many things HST in the mayor's office worked with us in order to create something that would save lives and offer dignity comfort and Community to homeless women who had no other shelter before our soap and I left that job after four years Having learned a lot and done some critical analysis and discernment. I decided that Community organizing was a better fit for me and a more powerful approach to people surviving and solving homelessness what always rankled me about my time at Noel house was the demand for me to speak for the women rather than allowing them to speak for themselves at the same table with decision-makers and also the tension of having the same notes a very reasonable very human request from the women because of bureaucratic rules or fear of liability or lack of funding. I wanted to find a way for our city to say yes to this. Very reasonable very human request seemed to me we be a better City if yes, where the answer Since 1993 I've been arrested many times in the cost of seeking shelter with others during the administrations of Mayors rice shell and nickels and still we and those administration's found ways to work together shoulder-to-shoulder as funding and provider Partners in the year 2008 USD staff approached wheel and asked us to partner with them to operate a severe weather shelter for women, they helped us identify space and supported us when we move to another location in our second year several years later HST invited wheel to convert that shelter to an all winter women's shelter and accepted and help clarify the literally back of an envelope budget that we wrote together for us operation. In 2002 after a long struggle and legal action HST in the city attorney's office at down at the same table with us and crafted a consent decree guiding the operations of 10 cities in Seattle that since served as a modeling guide from many other cities in the United States and our own groundbreaking and life-saving Seattle encampment ordinance. In 2007 HST staff set down at the same table with cheerleaders at Saint Mark's Episcopal Cathedral and crap crap to the deal to allow our participation in the H my ass in a way that was not and statical to self management. This collaborative Spirit became spot here in the 20 teams just as the city was growing wealthier and wealthier homelessness, which fundamentally is a problem of economic Injustice and painful a fordable housing got worse and worse and homeless people in program started getting blamed for the intractability of the problem fault lines fault lines kept changing and new city funding came and went in 2013 and 2017 each time these new funding initiatives and policies were proposed. We were worried but the rhetoric of their resulting RFP skate wheel and share cost for hope that finally the strength of our homeless lad and decentralized shelter model would be understood and valued cost-effective where the best The Sweat Equity put in by our participants in our self-managed shelters and minimum wages of our handful of organizing staff mean we Remain the very least expensive per bed night shelter program in the city. Community building and breadth of Partnerships. We have the broadest partner network of host sites of any provider in Seattle 10 different locations. Mostly churches spread throughout the city council member bagshawe called this out in her remarks during last Autumn's budget process. I've talked to your faith community. Hope she said and understand that you allow them to live out their Ministries in ways. They couldn't do on their own empowering participant leadership deeply living out the city's race and social justice values very few other programs in Seattle. If any can claim they live out their shelter operations in this Democratic and participant light LED way as Sharon Weil du housing outcomes last year do to strengthen our circuit riding case management component in partnership with Catholic community services share had a year-long exit right to housing of 19% to permanent housing and 10% to transitional housing this abstract. Another basic shelter programs as one of our share shelter participant said in testimony before this Council last fall low cost High performing. What's not to like about Cher? Council members are asked to be critical in your thinking and thoughtful in your deliberations last fall. You heard our testimony saw the evidence and Wade public testimony from us from our faith community host in the church Council from our provider Partners in the Human Service and Homeless Coalition. You looked at the number of people living and dying on our streets for lack of shelter and then made a unanimous decision to guarantee our funding for two years. We were so grateful and relieved such stability hasn't been ours to share for many a year hear. Your decision was the right one and called us all to the common good of working together in good faith on our Sheltering efforts. So you can imagine how shocking it was to us to learn on February 26th nearly two months into the contract year that the mayor circumvented your Authority and intends to contract with us only for 6 months this year pending improvements that were not named to We were told that the mayor hopes that this reduce contract and its resulting threat of defunding again will incentivize improvements. We are human. We are Americans and wheel of Seattle even as we challenge our city to be better than it is right now. Think about this in human terms humans. Do not perform best under threat of harm or Extinction. Think about this in terms of a Civics 101 lesson. It doesn't Inspire faith in democracy to have a decision democratically indianamat unanimously made by the city council after a huge amount of public testimony and discernment reversed in this way with no explanation a real justification and outside the boundaries of council Authority and the expectation of all of us and our partners and supporters who weighed in during your deliberations. Just last Friday, March 8th at 9:35 p.m. We received our first direct communication from HST about what the spread of defunding designed to incentivize our improvements regards. They said it regards occupancy and then missing data fields in the hmis. Holy moly. This is how we operate in a state of homeless emergency. About our occupancy. It's true that share shelters were a hair under the contract capacity percentage is last year at 82% capacity year-long 85% If the contract nor are being under capacity related in part to our high exit right to housing and other words, our shelter is decreased an occupancy because we were so good at getting people into housing. We're working to build our numbers now. We started this year and good faith and good spirits. And with the serious game plan. We're living out right now for outreach and recruitment Outreach which will be made much more difficult with another defending threat hanging over us and shares occupancy rate is not the only lower than capacity rate among shelters in Seattle, which are getting threatened with the funding. Wheels occupancy rate at are extremely low barrier women's shelter was 130 8% last year because the dire need for the kind of shelter that we operate and are no turn away policy. How can wheel and its homeless women participants be condemned or penalized or put on probation for that? About the hmis data again. We just learned at 9:35 p.m. Last Friday what this concerned specifically regards at no point last year or this year did HST flag concerns to us or sit down to meet with us about those issues or requests or suggestions for improvement. We knew they were worried about housing outcomes and we worked hard on those last year two very good. In fact, I've already mentioned this shared housing outcomes, but Wheels worked on this hard to with proceed funding security last August, we finally began and Outreach case management component, which is different from shares because our constituency is different long-term homeless women many with multiple vulnerabilities the wheel case management Outreach component is just starting to bear fruit. We had to housing exits in January and 4 in February which in February comprised 15% of our out exits. We should be celebrating this Pro. Press but instead are terrified for our future again? The other hmis data points just name to us last Friday regard data completeness in the hmis. Here's the thing many other very good and important city funded shelters including the once. I started my work with here in Seattle have dated completeness issues. None of them is being threatened with defunding. so, how can we not analyze this information and data and conclude that we Share wheel are being punished for being publicly critical. I looked up the meaning of that world critical before I came here today. It has many meanings important and analytical and judgmental and also sometimes condemnatory. I learned long ago that my personal and our Collective progress require critical analysis judgment and also speaking up when things aren't right shared us that and wheel does that and I would argue that even though it makes folks uncomfortable when we disagree. We are called to speak up and speak honestly, and we have done it many times before and still work together. Another day to set that. I wish we spend as much time analyzing and critiquing in arguing about doing something about regards the deaths of homeless people in our community a critical project of wheel is women in black facials to remember and reckoned with the deaths of homeless people in King County wheel advocacy and partnership with the King County Medical Examiner has resulted in there providing data to us and many other stakeholders including hsd about homeless deaths women and black are standing vigil tomorrow for 10 more people who died outside or by violence in Kane County already this year bring you the outdoor violent death total to a record-breaking 28 of 38 homeless deaths all together. The average age of death is shockingly low just 47 years old with tomorrow's vigil women and black. Will it stood for 1006 homeless women men and children who died Outsider by violence since our visuals find founding 19 years ago. Without Shelter people die that's a pretty simple mission statement, but it is in fact our motivation and animus. It should motivate us all of us together to do everything we can to help people and programs like share and wheel rather than incentivizing data improvements by threats. These past two years of work here have been particularly French fractured dissonant and painful time. And again through recent conflicts are communities Allied organizations, like Nicholasville and many others have cried out to be treated as equals and partners and stakeholders and collaborators with our Seattle Human Services Department. Nothing about us without us is what we've requested over and over again, but we seldom if ever are allowed to meet at the same table with decision-makers until after decisions are made if then Through public testimony over the past week's HST employees themselves many of whom I admire greatly have been saying the same thing regarding that hsd director nomination process. We desire to be treated as equals and partners and stakeholders and collaborators and we are not being treated that way now I have old friends who remained in the field like me and are still working entrance traditional social service programs today. I respect their longevity and dedication and expertise many share our analysis and critique but are too afraid of retaliation or defunding to speak up publicly. Wheel and share and our participants need the security dignity and promise of a full year contract in order to move forward toward possible improvements this year. Bigger than that, we and HST employees and HST bosses and the council and the mayor need to be honest with one another and be at the same table together and work together as partners for the sake of homeless people survival and strength anything less than that kind of true collaboration in good faith and despite critique and criticism is squandering the true wealth of the city, it's Humanity. Thank you, Michelle before the next because she's just one with knowledge. We've been joined by controversial. Thank you. Thank you, Michelle. but thank you. As I said, my name is sneaker Freeman. I stayed in a shelter while I was homeless late 95 to early 96 and I've remained involved because this is my community. I'm the president of the board of directors of Cher and Elder of wheel. The founder of wheel women in black and a founder of the wheel women's shelter. In 2000's Michelle said the city of Seattle asked wheel to start a severe weather shelter for any woman in any condition at any time of night. We located a host First United Methodist Church Wichita that time was it this time Colombia and hired staff members out of our own community. I filled in this extra staff for those first few nights. The atmosphere those Spruce nights. Relief at being inside dry and warm and safe combined with anxiety about how long this was last. The shelter was open only during severe weather. Then the women will be back on the streets, which was still dangerous. Everyone was glad when the city asked us to become an all winter shelter. The women's felt more secure and so did the staff. It was even better when we became year-round. During last Thursday's Pioneer Square art walk. I was sharing dinner with activists and homeless people at impact hub. I was describing our filter when a woman that stapled burst out of the wheel shelter. She told everybody that it was her favorite shelter that she felt treated better than anywhere else and then you can walk in like a down and feel safe. I've also felt fear and anxiety among the women of the shelter again. Everyone was so relieved and happy last November. We were secure for two years. Everyone's attention was turning to plans for the future. Now suddenly we can't say for certain if we'll be open past June 30. Homeless women are under fear and stress all the time. I got into housing in February of 1996. It was the summer of 2014 before my guts enough. It does not help anyone to add more fear on top of that. I'm quite sure that women will keep coming to our wheel shelter. We've averaged 138% capacity for a year. I am worried about the share shelters. One of the appeals of a sure shelter is that you screening once then you know where you're going every night and you can stop worrying about that piece of a survival puzzle. Many people uncertain about the stability of our making people's uncertain about the stability of our shelters does not incentivize our occupancy rate. I take part in hiring interviews for the wheel shelter. All of our staff all staff in share and wheel make minimum wage this year. Thank you Sean this one. Living on minimum wage you don't have a margin. Our cash flow is already under strain because we don't have a city Contracting can't be reimbursed for the work. We've done for 2 months. That makes staff nervous. Now we can't guarantee paychecks passed June 30th. This would be demoralizing to any organization. I'm very proud of our staff for how well they are performing under this anxiety. I'm worried about getting any new staff. We had planned to open new shelters this year. No prospective host to bring up the funding crisis asking if we really want to start something new right now. Current house to bringing this up asking for going to continue. Even when we get our contract. Because hsd would not offer share and wheel a cost-of-living adjustment citing a technicality. We're going to have a funding Gap. That we have to fill find fundraising. Now, how can we fundraise if Thunders are afraid that we may be closing in months or weeks or days? What is in the Forefront of my concerns is the effect this is having on the women in the wheel shelter? 120 homeless people died Outsider by violence last year. We stood vigil for them. As of tomorrow, we will have stood vigil for 28 already this year which isn't even higher rate of death in the last year. I don't just a few brief from our community at these victuals. I feel a palpable fear. Now that fear has been turned one screw higher. The reason my gut stayed nodded for 18 years is because while I was homeless I could never admit. I was scared. I stuff it. My guts hurt. It now because I can tell you I'm scared. But my guts feel like they're running an electric current. This idea of 6 months at a time funding isn't helping. Withdrawal that give us the full year contract that you voted for and that hsd originally offered in their January award letter. Then sit down with us and help us continue to improve our shelters. fear itself can kill my name is Nicole Graceland on the staff member at the wheel low barrier women's shelter and I'm also the data and true. I have received an approximately seven hundred hmis forms from women who have stayed with us since we first started collecting data most of the women request anonymity and the forms are often incomplete. We are currently contracted to accommodate 40 women per night and we've been consistently operating at 135% capacity every month or 50 + women + night. Our numbers have gone up recently and last night. We accommodated 64 women. When we get up to around sixty women, we run out of Matt's utilize just about every square inch of our floor space and do everything we can to stretch our resources so that we do not have to turn anyone away. We let women into our shelter all night. So if a woman is getting off of work at a late hour or if a woman needs to get to warmth and safety any time of night, they know that we will let them in our shelter functions as an emergency room in many ways and daddy will never tell what we experience on the ground. We can't show you through data the woman who is terrified sitting up on her mat and a crowd of shelter because she was recently evicted from her apartment. She's around 70 some years old and is now out on the streets to this is the stuff we see constantly you can't see the women who are working to get in late or wake up early struggle to hold on to their jobs and hope simply just to find some place they can afford at some point. Do women who stay with us utilize other services during the day there on waiting list entering Lottery's working with case managers at other agencies and staying with us until something becomes available. Some women stay with us for only a few days and managed to stabilize their situations and move on and we never hear from them again many women have stayed with us regularly or on and off for years. We receive calls from social workers at hospitals when they are discharging a homeless patient in the middle of the night and they need to find a place for them to go women have been referred to us by the police operation nightwatch and the mobile crisis teams. I personally struggled with homelessness since 2012 and share/wheel was the first organization that I utilized after several years that enabled me to stabilize and improve my personal situation. All I needed was a place to stay a sense of community and Mobility Sharon will do shelters best. I wish I could say that there wasn't any need for what many would consider to be us to EUR emergency shelter. I cannot in the last month alone. We have received several women who are recently displaced and it just become homeless for the first time. It is still going on a significant number of the women staying with us are actively fleeing a violent domestic situation and when will income or no income woman decides to escape of violent domestic situation she often leaves with nothing and become homeless as a data enter. I was instructed to D identify any woman who is currently fleeing to ensure her safety. Women of all ages utilize our shelter. We have women a high percentage of whom are in their 50s 60s 70s and even up into their 80s while they're battling chronic and debilitating illness on top of that. I never thought that senior citizens in the US would find themselves without the end of without the ability to access shelter. Now, we have senior citizens dying on our streets many become ill and Kern medical debts lost everything and must now recover without stable housing the San Francisco the San Francisco Chronicle ran a story on this last week titled aging onto the street and all of our policymakers should pay attention. I have witnesses first-hand since 2012 when I first experienced homelessness, it's going to get worse and everyone should be looking ahead to provide shelter equipped to accommodate the growing number of elderly on our streets and we're currently serving that function. We have a lot of elderly women. The wheel low barrier women's shelter has been a trusted and reliable fixture for many women over the years. I cannot understand the violence that pervades every aspect of life of a life for a woman experiencing homelessness. I wish I could say you could just how is everybody currently on the streets and just like that homelessness would be a thing of the past. It's not like that the need for easy to access emergency shelter is now greater than ever. I can't think of a worse time for this funding to be cut. Thank you counsel members want and consummate your time here and there should I move? Not a problem. Thank you. All right. My name is Christopher Anderson. I reside at shares Bunkhouse in South Seattle. That's one of their 11 programs providing shelter to the hundred seventy men and women each night. Our organization was excited and encouraged by your budget when we learned of that that had changed and allowed us to get set to work through 2019 and 2020. We are very very encouraged by that after working hard in 2018 with good results in exits permanent and transitional housing. We began looking ahead on helping more folks new communities continue to welcome our self management model and we hope to fulfill the need by adding to our shelter Network. We can't do we can't do that without your help or self-managed shelters are unique in the country the folks in other cities do some of what we do none suffer. The numbers of homeless coupled with such a rollercoaster of treatment as has been handed our organization recently by city government. We see the recent reduction in our contract as a direct attack on the needs of the homeless and All rights to conduct ourselves as members of the communities you serve. This is another aspect of ourself management model. You'll never find on any hmis datasheet agency an opportunity for self-actualization. This isn't a grade school social studies project. It's real people origin of purpose toward realized Solutions, and we hope it's this committee that will make things happen. There's many individual examples of success assistance with housing just scratches a surface continued sobriety renewed sobriety assistance through case managers on a number from including mental and physical health needs to Daniel funeral and from time to time. I've been lucky to run into former participants. Our program recently folks like James be Mike these folks that I ran into a tribute the structure of our shelter program as a contributing factor to their success continued success after getting housing. So they learn something. From their experience because it's a self-managed model. Seems excessive is always always very rewarding. They're real outcomes of self-management. We hold ourselves accountable for the function and condition of our shelters that moves forward when people leave Rhm is data is similar to many other basic shelters and we cost a lot less than I do. They're not being treated with the funding and neither. Should we Thanks. Thank you Bert trying to turn the lights down a little bit because it's too bright. Okay. Okay. Well then doing that. Where is where is Allen from Santos Chef so that we can have some? Sure, go ahead. And this is good for the lights right now. Thank you. Madam. Chair. First of all, I want to thank all of you for for your speeches today Michelle I didn't catch your last name. It's Marshawn. Okay, so I noticed three of you had or all of you had written statements. Is there a way that you can we can maybe give those to 10 have copies for us and we have your statements because obviously it with the email exchanges going back and forth between HST and everybody all these things being said, it was really good for me to hear what you were saying what you were saying all of you were saying so we can at least try to distill, you know, facts and data and what all that means just so we can I can have some kind of Baseline. So if I can have your if we can before we leave today, and I'm sure my colleagues would like coffee. As well, so if we get that to 10, then we'll make sure those get dispersal. Thank you very much. Thank you manager. Thank you. Thank you to all of you for being here and we have met before I want to follow up with one of the suggestions and I appreciate what we always say here is not nothing about us without us. I'd like to come and meet with you off site if we can do that in the next couple of weeks so I can see your facilities. We can talk further about what your needs are. I know that many of you that are in the chambers today that I've met with you in the past like you I'm completely shocked that what we had put forward in the budget last year was suddenly taken away and we weren't talk to either and frankly we've got some work to do to mend some fences with those that made the decision without talking to us after we had passed a budget about it. So before we leave I'd like very much to get your contact information. Maybe council members want has it but let's just get it written before you walk out the door. I'll follow up and we'll come and meet within the next couple of weeks. Thank you. I too want to thank you for joining us today and sharing both your work the history of your work the successes of your work and the frustrations and difficulties in uncertainty and fear surrounding your work and I apologize that this uncertainty that you're faced with right now is creating additional fear. And so I just want to share one small way to try and addressed those really legitimate fears about the ending of a contract big deer when share some correspondence that I received from the mayor's office today after speaking personally with the mayor last week about the situation and I had mentioned earlier that I was working to facilitate a meeting between share/wheel ccs and hsd And today I was it was suggested that we should first allow share/wheel ccsnh SD to meet without my facilitation, which I get that. That's okay, but I want to share what the mayor's office said specifically about their hopes. They say I have optimism that this can get resolved and share/wheel NCS CCs is concerns can be addressed before the mayor's office and Council start attending meetings. And if it doesn't we can evaluate next steps. I'm grateful for your encouragement for hsd and share/wheel in ccs to me and for raising the issue with the mayor and this is Health insurer that this first meeting happened the prom play. I was also notified today that there is a meeting scheduled for next Tuesday. Is that is that correct? Its next Monday at 4 p.m. It's Monday. Okay, that's that's good to get that. information that that that is happening and I also I also want folks to know I had believed councilmember sawant has asked for similar information that you have made us aware that as it relates specifically to the data completeness datasets that there are other organizations that are falling below what hsd tells us is an 84% completeness this rate and so I've asked them for for information about the organizations that also fall below that average and how hsd is working with those organizations to to seek continuous Improvement on the data completeness data set so I am doing that because I want to make sure that that Chair wheel is not being held to a different standard than other organizations. Once we get that information will I think no more about the impact of this type of these types of ways to influence performance outcomes, and whether or not they are being used across the the Continuum of providers that the city funds and I do have to leave a meeting in South Park, but that's why I wanted to get all that out. Appreciate take it off line as well. Thank you. I did have some questions someone the data can be to them that Alan is the back of the table. But before that I just I just wanted to say in my viewpoint. You know, we we should do everything possible and and my office will do everything possible to ascertain the specifics of what apparently the mayor of the human services department leadership seems to be saying I'm not clear yet. And that is why I have some specific questions, but but but I also want to make it clear and this is along the lines of the statements you already read. So I mean and what I say is not going to be even half as eloquent as what you've already said, which is that it doesn't matter what those specifics are. The overarching reality is that homelessness is an absolutely devastating and brutal experience and share and we are some of the very very few basic shelters that provide that welcoming space for especially for women who are experiencing violence on the streets or in their homes, and that's why they're leaving their homes. And so I think the bottom line that we need to make clear at least four. My office is that only homeless people in the butler Butler treated this way. When was the last time you heard the mayor sign your contract with big business that requires them to apply every three and a half months that does not happen. It is very clearly linked to the fact that we're talking about homeless community members and there's no there's no concept of the mayor's Executives being asked you take an extent of being up having to apply for extension and I have to say it's just for me or Valium doublespeak to say we're happy with your performance. That is why we are devoting your contract that was a short for the rest of the year and I'll make you apply every 6 months that that makes no sense whatsoever. And I think we have to make those bottom line is very clear while at the same time seeking as much specific information as possible. That's not what I meant words here. I really appreciate not only the people from sharing wheel hub come here, but people who come here in solidarity with them really wanted to recognize you all for being here at it. It's really very very important on the data. Cleanest question Island. I had a couple of questions on this one is didn't stop didn't the city council passed an ordinance and referring to counsel Bell 11925 to 45 story in which I mean it's these are whereas Clauses that I'm looking at. I think you also have it. I just want to read it for the band for the public. I mean one of the things that it seems to be conveyed to Sharonville from the mayor's Manor side is that there's a question of the incomplete data being collected in the HDMI switch is homeless management information system. SA node. Wright says America's use of HMS. Can God shall be voluntary for both providers and the clients they serve and the human services department does not intend to compel providers are clients to use that you're my scan cards. In any fashion and where has the Seattle City council requests of the human services department and sure that service providers make amply clear to their client the option of using an anonymous Rd identified profile an HDMI. It seems to me and I would like other than put on it seems to me the spread of these words is very clear that we don't want the funding for the providers are the provision of the services in anyway contingent upon providing data. So, I'm not sure that I had a follow-up question also and specifically to go ahead so hopefully I can be of assistance. So actually for our for the vast majority of our of the city's homeless has contracts as well as region-wide. So King County is well that promotes programs the city and the county actually do require use of hmis to track data. I saw the recitals You read the first one actually refers to the new pilot laws pilot last year hmis scan card. So that's a physical card that contain that links to a certain profile that a participating agency agency can give to willing participants on this allows them to expedite Services. They can also more accurately track data. So that's what that first recital refers to it doesn't refer to the hmis system. Overall. I'm the second recital and yes, so I'm in this is actually a challenge with data management. Is that per the report that the human services department provided last year around privacy that's on anybody who engages with hmis can choose to have a d identified profile or of course not. Just stayed at all and that is a challenge of a data because one person can have multiple profiles in the data. Good show and not what I mean. I think the speakers earlier made it clear why particularly for for women who are escaping from violent situations why people would very much want to keep their or have concerns. They want to keep elements of their data private and hmis asks lots and lots of personal information and and people have a basic right to privacy. It seems like and I know it's quite vague. What is what this letter from the mayor's office explaining that talks about the the quote-unquote incomplete data, but it seems like incomplete data what that's talking about. Is that second Warehouse cause it's talking about people not feeling in all the forms forms that they might have chosen for good privacy reasons to keep black. Yeah, I I actually don't know so that would be a good question for the executive. However, if I had two positive guess I would actually guess that know it would not involved dispense using a d identified profile or choosing anonymity, but I actually don't know any of the details. Thank you. And please let's follow up on that the mayor's office and secondarily on this is and I'm what I'm reading is from the letter by Meg olberding in response to the queries are letter dated February 28th in response to the queries from Council Members about why Sharon wheels for Toyota dealer funding world. Not be continued Astro June 30th contingent on whatever we still don't know what it is. But in that she clarifies that the 2017 RFP scored performing in the following categories length-of-stay entries from homelessness rate of exit to permanent housing utilization and return to homelessness. So they know quote completeness is not one of those criteria. So I'm a little confused why why would they change anything Midstream and just just just to explain what I'm saying for their it's it's very misleading to us why it feels misleading that in the letter. She clarifies that the performance criteria are does the Sundays and none of those into Jada completeness, but then later in the letter that she says we understand the rate of increase from home homelessness. Sorry. Sorry. I need to continue to improve it. And so on so I'm not sure why it seems to me like they're changing Mystery Men sang. What now? Did I complete my should be a Criterion that he should be judged Shawn and so suddenly we want to find out if other service providers are being placed being asked to fulfil the thing Criterion. Also have I ever again I wanted to make the bottom line very clear regardless of what are the election is. We cannot We cannot put the put this additional fear in the minds of people who are already facing vulnerabilities. So I don't think we should keep finding contingent on that. So that's one thing if we can ascertain what happened there, but going to go ahead and ask another thing and that say about it off to boarding ladder. It says share/wheel completeness Ray did a complete mess Raiders 59% compared to the basic shelter average of 84% So I have two questions related to this one is which are the other basic shelters that there that there benchmarking against And also just for Mom. General I mean General stand for Felix 60 nearly sixty percent is a pretty good completeness. It's not as good as 84. Yes, but it's not like saying that I can buy another 16% or something to do. You know what I mean? So that's one thing I want to do have like this. Is there a general idea and not just in Seattle, but overall that we can get a sense of and also my previous question is what what other shelters are there benchmarking gas and how do they get this average percent of seeing how that compares with the sure weld share/wheel rates. I'm out note for the first set of questions at Meg olberding is a letter describing the performance so long in the various measures a specific concerns are Article level to the Fine granular detail. We do know the bad paragraph concerns the share/wheel application for the 2017 RT which did substantially rely on each my ass. So I'm that was about their RFP application which they submitted in 2017 and then this apparent issue with data completeness. And again, I don't know what I'm having without having further information from the executives that it it seems to concern the information the the method in which information is obtained to reports on those various performance measures, like exits permanent housing length of stay and so forth. But I will certainly follow up with the department and got these details. Did you always want to add anything on this? Yeah, it's we don't really conduct them exit interviews because we have been exiting them after 3 months of of not attending our shelter. That's been my way of entering a when you don't have that person coming back for three months when I don't see them for that long and I mean women have gotten housing on their own or with their other case managers and while they're staying with us and the only ones that I've I've exited to housing or the ones that have been confirmed by our case manager that we've been doing it with the Hands-On, but I mean the women are getting housing that isn't showing and it isn't being reflected in the data. And it's very impossible to do that. It's very common for large shelter programs including many other emergency shelter program. Simply not to know where their people go. They're providing a safe place for the night and when people don't return then after time the exit by attrition of people leave without saying where they're going. It's very common. We're not the only Sheltering program that has that data incompleteness sort of record in that area and we're lucky when we would have to get it and when we get it it's filled out by the participant indicated that it's either self exit. But more specifically self exit to housing so that we have a delineation there A lot of times we do that when we need the bed when we can't wait that extra day to hold that bad for that person that person is releasing that bed so that we can fill that bed. And sometimes we do get indications of exit housing and and we ask for that documentation when we expect that they're leaving for housing. But again, we don't always expect it. We don't always get the heads up another area is sort of entry into our shelters from what HUD now says is true homelessness, which is sort of Street homelessness. They don't count Couchsurfing or you were in apartment and got evicted. So, you know, the wheel shelter takes a number of people that 70% of the women are coming from what now is considered to be true homelessness share a little bit lower than that, but that's because the feds changed up the room quotes about defining homelessness Okay. And went and when did that change happen quite some time ago. 4 years maybe at the vet at the least and maybe more than that, please go ahead. O I'm just articulating to myself that I need to get the answer to that. So. I just wanted to say I'm the data question and it came up and public comment the need for Council to to kind of independently. Look at this data in council members to watch office. We've been asking the executive for the raw data that they used to make these claims for over a year now and they have not agreed to share that information. So we only have their their conclusions to go based on and you know, they can what question you ask can really change what answer you get so we don't have any way of verifying those responses at least be to my office doesn't office craft a request to King County who are the keepers of the H my SATA to I receive if not the rod a tie which I doubt we would be able to receive for privacy. Concerns about at least data that's much further Upstream from what working for the Department in the interest of time because our presenters for the next item are waiting. I just wanted to lay out some next up that I think we should follow up on Porsche Paul Allen and Dad will be helping us with the following up on all the questions technical questions that came up. I think that's important that we have as clear answers as possible. But then I from from my office we will be initiating a letter to the mayor to reinstate the funding and you know and also clarifying that that the green setting the funding would be in agreement with the decision of the council when we passed an amendment for going to rain in the last year's budget. So it is only November 2018 to function wheel for the for the two-year budget. So it should go all the way to the rest of this year's another word. All we would be asking the mail to do is to be in compliance with what the what the city council decided already rather than change the state. So I will be inviting other council members also to sign that letter 9 might and it's available send around a draft version of that to all the council offices and We'll see where that goes and will be in communication with the show unreal organisers, and I really appreciate you all being here. And those are very moving statements. I really appreciate the preparation you did in order to do justice to this committee. So, thank you so much. And thanks also to Allen and Ed. Thank you. Thank you. Thank you. So will the presenters for our next item come up? Coffee submarine with mother and broke the folks who came here for Schererville. If you if you have time to say, please stay because it's a very good study on evictions. the show That helped kehlani. Come here. Just as long as you come here. the colonial Can you bring a copy for customer Juarez? And we can email it as well. That's the PowerPoint version of Okay, can we have very short one sentence introduction from both both of you, please? I am kehlani. Thank you. Thank you for being here. If if it's okay with both presenters, the discussion is about mainly about the study on evictions that dr. Thomas is going to present but in order to a frame that discussion in light of what actually human beings go through album wanted kehlani to share her story of what happened with her and she knows what I'm talking about. So if you could just take a few minutes to describe what you went through and what happens to people yet on the last few years. I've been homeless man homeless probably three times even with the Section 8 voucher and it's all about you, but you were unable to find housing that would accept Terminating your your house or terminating your lease or eviction. Yeah. I've been pushed from three separate places. So this last time I was almost evicted for owing $2 and you describe your fight to do not be evicted. So it's just a struggle and say it is a fight. It's a fight even now that it's settled. I don't know how to describe it. It's like Almost being evicted for $2 and then coming to a court agreement that I would leave at the end of my lease and they would drop all their bogus fees or whatever. Now I have less than 30 days to find a place and that's it's just expensive. It really is and I'm a single mom in it and it's it is as it's just a struggle. I can't even take up four times and I'm still fighting, you know, just to get into a place in. Be able to afford it and afford all of the cost of evictions. Right, right, and it's costly it's stressful and it's tiring. But thank you kehlani and you know, you're free to go to add more things if you want later, but for now if it runs okay with this will move to the presentation itself. And dr. Damas, you know, please share everything that just the basic of why the study came about in Salon. I just leave it to you. Thanks. Thanks for inviting me here council members appreciate the chance of going to speak on the behalf of the situation. So I wrote my dissertation on evictions couple years back and it was a collaboration with ACLU Northwest Justice project Sands. It was a very similar situation. Basically it was for a case where someone was looking for an apartment. She had no voucher. She was a person of color she have children and she mentioned that she Eviction and basically she was denied even the chance to fill out the application. So this is kind of sharing, you know, the issue of what the mark of an eviction has on future chances of Housing. And so the research I did was that I've been continued to do is is trying to understand this phenomenon, especially in Washington state, but just kind of start from the beginning. I kind of want to talk about the theory behind where Vixens kind of star just going to set a framework. So if you look at this graph right here on the x-axis, it's basically showing economic status that shows the type of people that move on the y-axis is residential Mobility anything that's high beams is high Mobility anything. It's low means low Mobility. So on the far right hand side, you can see that folks that have higher incomes basically moved by choice then So that's basically unforced Mobility folks were in the middle class are less likely to move. That's largely because you know moving is expensive and also maybe they just have a reason not to and they're trying to establish something but then there's a group on the left hand side that is usually low income that are forced to move for various reasons. And these folks are renters there a single mothers folks that are making low-income students minimum wage workers and we know a lot about as a sociologist a demographer. We know a lot about the middle and the far-right group the folks that are middle-class in Upper, but we know very very little about this left third portion of people and so what this research is doing is trying to kind of reveal who these people are or where they're being affected and all that. So I basically work by Matt Desmond. He wrote the book evicted. This is a dissertation in and work on it as a study in Milwaukee looking at eviction. See if you live with folks and he came with this kind of triangles showing that evictions was basically falling at the intersection of increasing rent that is with house burden and inadequate welfare. So basically income with the inability to read to pay for rent that's increasing. So for an example, the kind of dotted lines on the left are rent increasing at the very bottom line is a one bedroom in Milwaukee back in 1997 to 2008 and that's constantly increasing as well as like a two-bedroom that's constantly increasing right about that. But at the same time that bottom dark line is showing stagnant wages at that time of minimum. I'm sorry welfare. That's hasn't really increase over time. During a study and then welfare, which basically saw a slight bump moving up regardless. I found that largely over eighty to ninety percent of folks income was going towards the rent of the people that he surveyed with the study Milwaukee found that women were disproportionately over-represented black evictions were really high families with children. In fact, he wrote a paper that basically said if you have a child you're incredibly likely to have an eviction above anybody else. He found that there was some the poorest neighborhoods neighborhoods with the folks of color and Latin X. Neighborhoods were seeing a lot of high rates of evictions. But even in white neighborhoods Latin X folks, we're seeing a high rate of eviction in there. He also measure the outcomes of work itself future layoffs environmental hazards and involuntary displacement homelessness and crime. Thank you for being here. Can you clarify in in the Milwaukee study? Also was that based on a core data on evictions are can you explain what that background was? Yasso Desmond used court date as well as observations and surveys so is a very very complex full quality of research study and it took him a long time to actually collect that data, which is really difficult to have. right The work that we're doing at the University of Washington as part of the Washington State evictions research project is we're heading on top of that this idea that where you live can really impact your opportunities or impact your eviction. So, for example, we take into account Market forces residential segregation and neighborhood change on top of what we can about household level characteristics. So the Washington state eviction project. What we do is is we look at unlawful detainer Theta flight 7 and 8. If you can go back to Fortune, you can go back to slide seven something that's really startling not surprising necessarily, but what song is for the evictions that in the Milwaukee state of his dad were studied you see the people who are the data said they were talking about his people for 80 to 90% of their income goes towards rent. So obviously we're not talking about people in general facing eviction were talking about the people who are absolutely devastated by Rend who are facing eviction. And then I am I interpreting your flight number 8 correctly. Just say that The first level of problems that people faces obviously related to their lack of an adequate wage and income combined with increasing rent. But on top of that they face racial segregation where they live and is that correct? That's that's that's the that the purpose of the state is to see how segregation plays a role in this because we know that the legacy of economic disadvantage that has been forced on several populations that has to play out in the housing realm eventually at some point, but it's also it's not only that but it's also a combination of a lot of things to it's an umbrella out of sorts of Market forces macroeconomic context City changes. Basically what happens in one space has a ripple effect and can actually impact other people as well. And so We try to do with this research is try to capture that Ecology of evictions as you call it. Sota continue about our research project real briefly. What how what we do. What day do we use? Basically we are using what's called unlawful detainer data and unlawful detainer is an actual legal eviction case that's filed by a landlord and it's hurting Court 3 to after the 3-day pay or vacate notice. So if I could kind of unpack that a little bit basically if the landlord wants to evict you for whatever reason and two large majority what we understand why people get evicted just based on the research 80 to 90% of those evictions or because people fall behind on rent so against your point about low-income households are very at a very precarious situation landlord can file an eviction post a note and these they say you have 3 days to pay or vacate. The really is unfortunate if you're getting that note on a Friday because a lot of businesses aren't open on Sundays and Mondays are difficult to Irregardless, if the person is actually staying past three day. Then they are considered unlawfully detaining the premises. That's when there's a court order for them to go to a trial within one week. This trial is heard is absolutely amazing how quickly this actually happens if it's undecided or there seems to be a evidence in favor of the tenants they can go to trial but that said within 30 days still not very much time left and eventually if the person is still in the in the premises and resolution has a mad thing, you know, she'll follow through with a writ of eviction which Paisley physically removes them and regardless of the outcome. The important point of an eviction is that it stays on your record impacts your future housing. So a lot of the folks that you sure about that are facing lot of homelessness, you know, they're facing that not only because they just got evicted but they just can't really find another place to live either on top of that. It impacts where you can get a future apartment. Is not all landlords are willing to take vouchers or take folks with an eviction. So you have this like cascading like stack of things that are compounding someone's option options. I when it comes to that so what we're trying to do is we're trying to understand the trends and unlawful detainers. Now. This does not account for people who wear rent went up and they decided to move or people that actually left during that 3 day. So we're looking at a very small fraction of people that are actually going through this process and he's unlawful detainers don't necessarily mean that they actually physically mood. However, the record does stick on their on their looking at what compels them to not move because obviously it's better to not get an eviction on your record of the must be some sociological factors that even covered to give some insight into who are the people who don't end up moving in. Stop having a eviction on their record and also might I say the term unlawful detainer seems to be very very and I for rental of pro landlord e therm and I think you were saying right when I seen that in my court paperwork. I was just like I know it's like a criminal in worst storms in other states may be so it's not like Washington is exception if there are worse terms in other states, too. I think Oregon has a pretty tough one. But it's your first question why people actually get unlawful detainer. So, you know, hopefully if I had the chance that there's been a massive shift in the county or around the state. So there's the compounding fact that you have an eviction on your record, but there's also Do you know you don't have anywhere to go? And so if you don't have anywhere to go? 3 days to figure out where you going to go next? I mean, I I can't do that. I have a PhD and I don't think I could do that. So and I also, you know can't afford Seattle myself. I need a roommate even though all these situations are going on. There's a lot of people that are facing that and so there's this massive displacement supply and demand impacting where you could and could not go but that's a very localized Effect 2. And so we're seeing this across the state to so there's other factors that we're trying to unpack as well. But here locally specifically in King County. There's just very very limited spaces that we could go. So I know where we're taking on a Herculean task to look at all evictions from 2004 to 2017. That's 271000 court cases. And if I guess that's about 25 pages of court case which is actually pretty small considering for a court case that's close to 5 million pages that we need to examine and the King County alone. There's 80503 cases from 2004 to 17. And that's about 1.6 million pages. So in each of these documents are gathered at the county clerk level, so we have to actually talk to each the county clerk's to try and get access or purchase access through their electronic court records system. So it's humanly impossible to look at all these numbers. So we applied data science method sew in particular we use machine learning to analyze all the court records to digitize his court records and we scrape them for important information using natural language processing technique that basically The text was identified as this is an address. This is a cause of evictions in this isn't amounts all those kind of things. And so we're doing that right now. We're focusing strictly on addresses because with an address we can actually pull an estimate demographic information for individuals with it's unfortunate that the Supreme Court at the state level doesn't collect race information or gender. But what we can do is buy taken the first name, we can kind of come up with the likelihood or estimation for each individual that's named in an unlawful detainer estimate the likelihood that there are there male or female and with the last name surname, we can take that and estimate the likelihood that there of a particular race based on where they're living at the time of eviction. Super example, if your last name is Jackson, that's a high likelihood of being an African American name. However, that name is located inside a white neighborhood. Then that decreases your likelihood of being an African-American and Where is it that if that name was located in a African-American neighborhood it increases it. So that's a Bayesian process. I won't go into the details because it's kind of dumb butt by doing that. We've actually come up with some preliminary results results. And one of the things that we found is that there's an absolutely High rates of evictions particularly amongst African Americans in King County, which is really troubling because King County only has about a six to seven percent black population overall. However, the eviction rate white to black is about 2 to 1 the fact that White Sox are African-Americans are over-represented. This is extract incredibly alarming. So for example, we find that female-headed households are evicted about 2% more than men African-American headed households are four times more likely to be evicted than whites. And about 40% more Latin X households are evicted over whites only come by and sex and race. We find that black women or victim. 7 times more than white women and black males are evicted about 5.4 times more than white males this I think this graph right here actually helps settle that case that I was helping out without a court because it's astronomical what that effect is. I in earlier research. I looked at racial differences in the neighborhood. So kind of looking at segregation and Seattle Seattle had about 27% of the evictions. Where is the rest of the county have the others but South King County had the most and we know anecdotally that African-Americans have been being pushed out to those areas. And in fact that we see that they're incredibly High rates of eviction within some of the most diverse neighborhood. So the south is really dominated by minority and integrated neighborhoods. Where is East is mostly white and Asian, but we're seeing a high rate of evictions within the most diverse neighborhoods. So if we move on to the next slide, if you look at the neighborhood typology on the left hand side or all white neighborhoods and on the right hand side or the most diverse neighborhoods and basically over all the most diverse neighborhoods have the highest rates of eviction, but it's absolutely absurd to see how Hi, the rate of eviction is amongst African Americans are basically we come to the conclusion wherever there's a high and there's at all the presence of African-Americans and in certain neighborhoods, there's an extremely high rate of evictions amongst a population Latin x Falls and 2nd and the area where whites are evicted the most are located in a white Latin X neighborhoods. In other words. There's about a little more than 10 to 20% of Line-X population in that neighborhood is is there Speaking of graph the eviction rate for black households is actually the highest in integrated neighborhoods. Yes. just a little bit about the German nation is We we used to have a lot of segregated neighborhoods, which is interesting. Cuz when we talk about segregation in a week and it's kind of a reference towards household of color segregation, we never talked about white segregation. In fact white segregated neighborhoods seem to have a protective effect against evictions largely because there's a lot of income there for sure. But what happens in in neighborhoods of color is that you have not only low income but you also have the added effect of discrimination, but that an employment level also add, you know historical level but also the Contemporary level two and so integrated neighborhood some particular for my observations are some of the neighborhoods they're saying a lot of the gentrification transitions in the neighborhoods things like that. One of the things that's really shocking to is that evictions occur most in the lead in the most affordable neighborhood. So this is a graph showing rent where on the left hand side. We have the lowest rents in the County compared to the highest rents in the area. And as you can see there some tracks, we have a meeting in Randolph close to 3 to $5,000, but it's the areas with $1,000 to $1,400 that have some of the highest rates of evictions in anywhere from a thousand to $2,000. And again, we see that African-Americans are being overly represented with Latin ex followed up next and then White's third So this slide got a little jumbled. It looks like what this slide shows is the next stage of our research where we're at right now. So this is looking at all evictions across the whole state of Washington as you can see King County actually has the highest rate of evictions peeking around 2005 actually declining around 2017 to 4700. Now this decline in my, you know, it might look like it's promising, but actually I have a hypothesis that this actually means we've actually displaced everyone that we can and I hope to have a chance to explain that a little bit more Pierce County comes in second Snohomish. These are both border counties to King County Spokane Eastside Clark County is where Portland the county that's closest to Portland. Is there similar facts that are going on in Portland, and it's actually Rippling into Washington through Clark County. We found so far as that women are evicted way more than men across the state except for in a few counties, which includes King County. For example or Snohomish. There's not really I think that's largely because there's an even ratio of male to female in there in in the facts. Some areas have more men is a King County on slide 15 and then the green one is Snohomish everything else including every other county is anywhere from 6 to 10% more than more women than men across the state, but these rates are very different for Burke County. I told him what was sorry I missed you all. So what was your explanation for? What might be happening in King in SoHo Snohomish just there more men in in the area at that level. There's just a lot of hidden this so we're not really sure why that is it is a larger population. He knows I'm not really sure why to be honest with you, but we're trying to explore them by expanding the research that we did. We found that on slide 16 that again after Americans so that with that one slide that I showed before was just from 2013 this shows from 2013 to 2017. And basically what we found is in that five-year. One in 11 black adults got evicted the number of evictions in King County equals 8% 8.8% of the black adult popular. That's six times higher than whites. 3% of the land next population had the number of evictions for Latin X was 3% of the popular 3% of population size two times higher than whites to in Pierce County. It's even worse the number of of black of evictions that we saw their over that five-year period equals 1 and 6 black adults now, we're measuring adults because thankfully children are names and unlawful detainers unless otherwise, I would follow on the record. So just adults are named from what we know and this is a severe under count to actually collecting everybody is possible, but this is about the best estimate that we can come up with. So in Pierce County the number of black of evictions equals about 17.9% of the black population. I'm in 11 black adults were evicted once or one or more times. Are you following individuals? How can you how can you explain that mean? That's just absolutely shocking number 1 and 11 during those five years and then spin you said Snohomish County 1 and 6. I just love your so have you followed the individuals to see if it's more than one time the level of more like duplicate of evictions for people Falls well under 1% of the sample. So this is largely first time of Corrections. And can I ask you a question, which I feel I should have known the answer to already but I'm going to ask her when when the court. size of the landlord in an eviction happens How does it work? I mean does only the adult whose name is on the lease get an eviction on the record or all the adults in the in the household get an eviction and you already said the children. Don't don't get it on the record options on there. So the reason why this is under counting what's going on is because sometimes they say Mrs. Jane Smith and all occupants of 1215 Main Street other times a lot of the times actually named other people. So we don't know how many children are in these households. We don't know who all the other occupants are. So this is 1 + 11. I mean in reality is probably one in seven in Kane County if we actually had everybody in there including children and also a lot of legal professionals believe that this severely under represents actual people who got evicted prior to the 3-day pay or vacate. So this is a very conservative estimate. I'm sorry. I got evicted prior to the 3 days that they may have left and that's that's just to get the get a person out of their unit. You know what I mean and not goes unaccounted for I've had to terminate my tenancy before out of fear of getting an eviction and right and we don't have a way of counting that at least so far by those serving these evictions, but that data is private. Where they're applying for an extra the date of that we pull is public but it's highly you know, cos preventative. For example, every single county has a different way of holding the state of in King County. For example, you know, the way that the laws are set up I found this out recently that apparently can't Washington state has the second least funded court system in the nation and that that tax on a lot of fees for access to these data depending on the circumstances. So the rest of state is using this system called Odyssey, which is online. It's about 500 to $1,500 to subscribe to get access to these court records for King County. They charge $0.25 per page to download it. So I estimated the number of pages that we would need to do that no somewhere around $350,000 to $500,000 to actually get access to these data at Kane County right now. We only have two years of data. That's only the summons because the summons is the front page that has the address and that's two pages. And so if you look back at that graph, you know, there's some years they have upwards of seven thousand court cases going on tour next step after this as we want to look at the complaints to get that the reason for eviction and hopefully maybe some demographics or some other stories behind this, but right now we're just focusing on the demographic estimation by getting the address using the names which are provided by the state to do this kind of assessment and so far, you know with you know, the shoot we we have zero budget is kind of Gorilla research at this point. We have the no working on the hearts of a lot of people that are interested in this hard to fund this kind of project but it's do you know, it is on the precipice of new sociology its incorporating data science into this actually answered new novel questions and the fact that you know, even with What little we have to find that 9% of the black population in King County's facing eviction while at the same time we know they're being displaced and all this kind of stuff is it's highly alarming and so that that you know that I've been down to Olympia and I've testified before the representatives in the Senate based on this because I think it's actually a civil rights issue. How much more time do I have you have I have a I have a meeting how to get do outside at 4:30. So maybe 10-15 minutes. Sorry, the four sound like a little bit longer. Okay, so I'll cut to the chase of like how we got here. Basically, you know a lot of the research that I do I study segregation. I just want to point out by showing this is a map in 2010 block level race Dynamic. So you turn those points equals one person and the color codes them by the racial category that they identified by through the senses. And as you can see there's really distinct lines in which people kind of fallen so the red are whites blue or African-American with the little blue you see that's part of the Central District Green is Asian, which is kind of defining the International District and Latin XR gold that's mean going to simos. Going down in West Seattle. Now the way that these neighborhoods are formed are not random and Factory formed through history. So for example redlining was one thing you can notice that wear those groups fall right now is exactly where they designed hazardous areas back in the 1930s and 40s. We also have restrictive housing covenants that we're over 400 restrictive covenants were that we know of 400 restrictive covenants are found in King County. And these are some of the neighborhoods where they fall, you know, everything from Ballard Capitol Hill Central District all these different areas helping to find where whites could live but a household of color could not so these restrictions help push during the Great Migration in the 1940s 1920s. It pushed most African Americans into the Central District as you can see from this map and another form of neighborhood shaping was Japanese internment as we know where folks were actually taken out and put into internment camps in when they were They actually couldn't live back in the areas where they had lived before and that's what's formed the sent the International District. Now, we know a lot about this history. And I know that this city is very big on talking about this history, but I think what is actually happening is wearing a new era of a migration that I almost want to call it the great displacement or the great inversion because basically what's happening is that every single neighborhood that we concentrated a lot of folks into in the urban core is now shifting to folks moving to the suburbs and that's not necessarily it's it's good in the sense that allows people to move freely. But as you can see from this map, you know, 1980 in those kind of last decade that we had really concentrated segregation. It's showing this is all folks that are non-white moving over the past 40 years moving into the outside of the urban poor. But if you kind of high slate that to African Americans of the tick They've only been able to live in certain parts of the of the region and a large part 1 the issues with this is that poverty has been increasing into those same areas where they've been display. So if you see this map on the left hand side shows the blue is below median poverty. The red is above median poverty for the county. And as you can see that some areas have seen increases in poverty from 2000 to 2016 by about 12 to 35% of points. And there's a lot of areas and Central Seattle of actually seem very low poverty and fat decreases in poverty and at the same time rent has increased in Seattle and rent has still increasing South Seattle, but below the median of the county areas of rent. But what's interesting about this that we find is that there is a huge shift that's happened very rapidly. So one of the things that is really interesting this man this plot shows the fair market rents and rent burden or in other words income needed to actually afford rent. So fair market rent basically means you if you and I were to go and Craigslist we look for an apartment that's you know, the area is considered fair market rent. So how much are unit should be available. So the bottom line if you look at this, this is basically Washington state in the top five most populous counties are in the state and Washington State the Orange Line back in 2003 was under $800 in on median and by 2019 it increase to about $1,000. That's the the left hand side on the right hand side shows the amount of money you have to make to afford. In other words the amount of money you have to make to avoid paying more than 30% of your income to rent that's called rent burden. So in 2019 to live in Washington, he needed to make about $40,000. If you look at the blue line at the very top 2003. We see a really sharp Spike that started around 2012/2013. So that basically means that in about 2012 or 13 you needed to make about for rent was about $1,400 a month. Whereas by 2019. It jumped up to $2,200 a month and that this is the median across all bedroom type. So once to Studio one bedroom two bedroom three bedroom, so this is kind of a median across all those and if you look at the right hand side King County to live in King County you have to make $90,000 to afford rent, which is actually that's deflated because this Snohomish as well. So if we were to isolate Seattle and probably somewhere around $110,000 needed to avoid rent burden. The I think we've called in previous discussions and an inflection point in 2012 something interesting. Happening. We just got your report and then I just got the Powerpoint. I just want to go quickly back and you don't have to go back but this is just a question. If you can't answer that's fine on page 16 we talked about evictions by race. I think what's what's a bit glaring for me is that we know that Native Americans are seven times more likely to be homeless and I'm wondering why we know the students cheap sail club the work of calling alcoholic and of course your sister Abigail alcoholic at the sale Indian Health Board and the other Native American organizations and try to work with so I was wondering why there isn't any of that material in here. I really appreciate you bringing that up actually that highlights the kind of flaws that the census and data kind of Extra large degree. Nestle the senses especially in our estimates is because there's such a small population of the Native American folks and so they they waited at 1 to 2% of the population and the measures that we use can't really decipher between whether or not their Native American or not. So in other words if they took the last name that may change it to you know a name that would be identified as a different group force is another and so they kind of get thrown into what's it's hard to decipher. So Frank's is a completely statistical estimate that we we actually compared to other accounts and we were within 1 to 2 percentage-point of the black and white and Latin X categories that we found in Albers the rate so we feel very confident that but when it comes to other marginalized groups, like anybody else, especially like for example Pacific Islander that represents a whole different Spectrum of folks and it's unfortunate that we can't pull them out. If I was to make the best gas though. I would say that their rates would be even higher better understanding and so I would hope that when you if you have a chance because of the data is there we know that through to Chief Seattle club and the study they put out and how we find them and we know that we make up wehlus into percent of population, but we are way to support unit in the homelessness and the eviction. So I'm hoping that something you can you can follow up on in the whole history of we all know what happened with the history with the red lining for African American and Japanese and we understand all that history, but I think people don't realize is and I wish I knew the number at the top of my head, but I know just for my own tribe, which is blackfeet that their 5000-6000 blackfeet Indians in King County alone, and that's Those people from Montana so we know that the Native American population just City proper is very high and that is so it's not that hard to find those numbers weather yourself identifying or through the senses. I guess I'm sharing with you that there are organizations out there that have gotten have gotten the money had been able to get in and get this information particularly Abigail alcoholic and the study that she did in her presentation to the King County Board of Health. So I'm hoping that maybe we can take a deeper dive in that area because there is a time up until nineteen. I think 1920 Native American people who are indigenous to slant weren't even allowed in the city limits. So I think that's an important picture that needs to be reflected in this and I hope you would you would help him if you come back again we can work on that. So thank you. I really appreciate you bringing that up because that's one of the big are the big missing pieces that we we don't have and you identified exactly how we could do that is Groups that are familiar with a group and can actually recognize those those level evictions and we would love to to collaborate and try to improve that because it I think that you're right it sits on what day does American people's have gone through is is almost worse than any other group. That's that's gone through these circumstances. Thank you for raising up. I'm almost done. I one thing that I couple things. I wanted to point out about this slide real quickly as that as a demographer. I've studied for you know over a decade now population Trends this Spike that occurred in 2013. The beginning of that is just unprecedented only, you know, massive shock events can impact something about you know, that that that heavily and you know in 2008 we had the Great Recession and we had a long. Of recovery bad for a lot of a lot of people it was mostly recovery for industry and folks that were hiring come where is low income and middle class have been really impacted by this and there's just it's it's kind of shocking what's going on in during the same time or moving from a service industry to a tech industry to and with Amazon showing up in 2010. They been here since 1995. Start occupied South Lake Union around that time. That's when we start seeing these prices getting impacted among those who can afford these rents, you know on the right-hand and left-hand side is Washington State on the right hand side is the median household income by race for folks in the King County area on the right hand side. So at the top the orange line is overall median income. I'm sorry. The green line is the overall median. Income orange is Asia and red is white. Non-latin X blue is Latin X and purple is black right now the whites meeting. I'm sorry that overall median income is somewhere around $90,000 with white said about 97 and that's far above What's called the area median income at 80% Ami or area median income is considered low-income. 50% is very low income and 34. What is extremely low income and those are the definitions by Hud as you can see Line-X are falling below the 80% or low income area. So I means more than half of the Latin X population is below the poverty line. And then the African American population is falling around the 50% Am I so that means that more than about half of the African American population is falling below the very low income status. So when you look at rates of $90,000 needed to afford or avoid red bird and we're starting to pack why we're seeing racial disparities and evictions to lower 80% Am I also for overall median and white median, it's increasing but you see, right the black median income. Actually decrease in 2016 compared to 2000 median household income and the all that increase my theory is that basically it's not because the population improved but it's because the population has been replaced. So any kind of increase that you see in that area is not happening but it is increasing amounts all the groups, but that may mean because we're displacing a lot of individuals in that process. The kind of unpack a little bit about how important it is to not just look at evictions, you know, it's important to kind of be intersectional and this and look at everything. So if we look at the housing crisis in particular fordable housing actually is declined in Washington state. So we've lost about 91,000 affordable home at about $800 per month, which is $2,017 and 85% of that loss started in 2012. We look at the homelessness point-in-time count which is again under represent actual homeless because of this only accounts for sheltered and unsheltered folks. We see that in 2017. I'm sorry the year after affordable housing started to decline. We started to see an increase in the homeless population. And right now in 2018, the number of individuals who are sheltered in unsheltered is surpassing the number of people that were homeless in the Great Recession. So this is actually a sign that were actually facing something a lot bigger and a lot worse than when we did during the Great Recession. And then finally the evictions has fed folks in to the homeless population has been decreasing. But then again we're looking at this idea that potentially that the decrease could be because we're displacing a lot of folks into that population finally on King County. We see similar issues by we're seeing a much Starker increase in homelessness and a deep crease in the eviction rate, but that decrease seems to be related to the loss of affordable housing displacement of folks who are low-income and highly impacting a lot of people was problematic about that is that there's a massive effect what's going on? This is a graph that shows kind of a tear Theory. I'm going to skip this right now, but basically what it shows is that We go back one slide tutorial quick number the number of units that are affordable in King County. That's a number that has been discussed in the other committees on other topics. Where did you get this information? So I calculated this using HUD fair market rents for King County. So this is a number that I I there's a calculation that they make to determine what I'm sorry. This was this is pulled from the Census. Actually. I'm sorry. So each of those years each of those points that you see up there are a point in time where we had accounts of homes that were at $800 but I adjusted for inflation for 2017. So each of those points are adjusted for inflation. So in 2017 there less than 40,000 Homes at $800 and then in 2004. Scene in 2017 dollars there was about fifty thousand or so and then up all the way to 2012. They're about $55,800 units that are in 2017 dollars that inflate that adjustment for inflation tries to help standardize the issue. This is really useful numbers because you know, there are periodically grandiose announcements of how much affordable housing is being built in Seattle. But this shows that on balance the amount of affordable housing is going way down. Yeah, what's also shocked into that and I didn't have a chance to include this slide in there is that the number of actual units being built is like somewhere around fifty or a hundred thousand across the state while at the same time. We saw a decrease in affordable housing to So another words units are being built but affordable Latias or because they cost. and is it correct to conclude that in the in the. When you had the worst effects of the Great Recession affordability went out because all rent increases Plateau. I'm going up on the years right after the Great Recession happen 2009 because rent increases Plateau during that time because it was the reception area. Or how do you interpret that? We need more the problem with census data is that 2002 2009 is kind of a touts. It's not as detailed as it is after about two thousand ten because they change the way that they collected data so that 2009 numbers nestum in across five years of an average. So I think what The housing crisis not only impacted homeowners, but it also impacted renters to a large degree because if homeowners were leaving or maybe there's just like a loss of affordable housing in general there's a loss of of units because a lot of people got out of the business or sold their property or shut down the renting Market maybe that had something to do with it. I honestly don't know and that's going to take further investigation cuz our Focus has largely been on evictions the relationship of homelessness. And time. I think that the fact that it happened in the cross the whole state, you know. Tells me that there is some sort of thing that people lost their jobs people lost their retirements. They lost their homes. But we also saw a loss in the stock the rental stock apparently to you know, Seattle thought and I think it was 2003-2004 something like that right after the.com bust. There is a lot of people that saw that Seattle was very resilient while the rest of the country was facing a lot of problems and while a lot of companies lost a lot of money and a lot of people lost a lot of money and it's understood that investors saw Seattle is an opportunity City so they started investing in and actually in 2003. I think the city council came up with a study that said that the population of Seattle is going to double by 2017 or something like that back then so they started, you know, investing and developers started building buildings and stuff kind of Hondas like Wham that you know. Play she was going to grow there's a lot of good evidence towards it. So by about two thousand five or six we started seeing the effects are the Canary in the coal mine in the housing crisis. And that's when all these Powers stopped building. So that point there's a lot of empty, you know, a lot of cranes in the sky not as many as we have now, but there are a lot of cranes in the sky and they weren't working for about you know, a long. Of time. Once the recession recovered what happened was that a lot of low-income and middle-income income folks kind of got highly affected lost their jobs retirement all that kind of stuff. Where is those that were able to ride out the recession kind of picked up with the building right where they left off and I remember I lived on Capitol Hill at the time when that was going on in there was an apartment complex that finally finished after the recession and they're like, you know what we're just going to auction this off. We were going to ask I think it was like 500000 or something like that for a townhome or something like that. So they never going to get that back. We're just going to get what we can so they went to auction and they actually got more for what they built than what they are going to ask for in the first place. So something happened we're socially and economically a trend kind of got set and I think that that really triggered developers to be like, oh wow. This is actually really hot Market. Maybe that's why we see that Spike increase in 2012 along with we also saw a massive increase in the population, you know, Amazon brought with the 42 60,000 new people. A lot of those folks have six figure income supply and demand follows be on with that. There's limited, you know, housing Seattle unfortunately is not very geographically Bast. So there's only a few places that a lot of these folks could go and that's mostly South and there's a lot of theory behind why they're heading in that direction and related to networks discrimination neighborhood. Happy to talk about that but what's interesting is that there was a massive effect. That's a macroeconomic effect on this that started way back before Amazon even showed up and getting back to the lot of people, you know, not only African Americans will an X but also low-income whites as well. And what we're seeing is that a lot of folks have been moving into marginalized spaces, you know, as their first they were chasing culture, you know, like Columbia City and all those areas, but then there was like that was the last affordable space and now Columbia City is completely totally different decimated from it, you know, you can go to Broadway on Capitol Hill in a lot of small businesses are not doing well either and you know, you need a a name, you know a high. I'm not going to mention any names but you need a high recognizable name to open a restaurant along with, you know, a lot of capital in the back end. But small-time businesses are really suffering. There's only like really to that are doing okay in there, you know talking about the the they're tightening the belt right now for verbally, but yeah, that's why I don't think I have much more time at all. And I took a lot. I really apologize about that first item, but there any other times you've really piqued my curiosity on this and when you said that and looking at that top graph where the trends for affordable housing are going down abruptly starting in 2012, and I think you just said that the trend started before we started seeing 40 50 60,000 new employees in the tech industry, but I like what Ted said and I'd like to see the intersection of where We're building. We know we're building, but we don't worry. I'm building anywhere near enough. I mean, those are the studies that we've seen in the last couple years are saying for a hundred and seventy-five thousand units short Tri-County that it's going to take according to the McKinsey report something like 380 to four hundred million dollars a year of investment to catch up. I'd love to see those graphs at what point even though we're building and building as much as we can. How does those intersect and will they intersect in order to accommodate the numbers that even people who are in frappe little concerned about raising taxes, but a recognizing the need for housing where those intersex, so maybe we could talk a little bit more about this and we've got your website down here in the in the corner of your PowerPoint in a I'd love to follow up with that. But thank you more than happy to talk. No change, I'm incredibly pessimistic about this unless very drastic changes are made. This is kind of like when climate change was discovered. Unless we make a really massive shifts in the city and the and the states in the country. This is not just a Seattle problem. This is highly impacting Pierce County as well. And we need bold bold movement. I don't you know, I have ideas what to do. But because everything is so intersected it's going to take a lot and it's going to need to take a you know, a lot of people to actually believe that this is an issue. I can look at the Red Lion home assistant has an increased that hasn't dropped it off and that's not even the Macan tow Vinny definition of homelessness, which is people doubling up sleeping on couches things like that people using their networks to stay house when those networks dissipate, you know, that's going to just increase homelessness even more and it's it's dire and it really concerns me to be honest with you, and I'm You know, I'm afraid that I haven't seen much evidence that the city's not doing enough. I'm just going to be honest. Thank you for injecting. That's over Nadia. I mean the numbers are devastating and I also agree with you. But you're you know with your analogy of the climate change questions that you know, everything is different but it's a similar situation in that without massive bull Solutions. This is not going to be fixed and do support what you're saying. I was ordered to share just as a concluding note for this meeting this report from King County Regional affordable housing task force, which founded 244,000 additional affordable homes are needed by 2040 for Aiken County. So obviously we're young in terms of its massive. That's how about a quarter million homes that we need on an urgent basis to start being built and and the keyboard that are being off course affordable. What's really affordable exactly if I may say to like based on a lot of the research on segregation sociology social impacts Health employment education. We're not even scratching that yet talked about affordable housing. And right now we're just talked about accepting the fact that we know it is his crisis. Now people want to pick at evictions being the problem or homelessness or you know, it's choose your flavor basically, but it's it's everything impacted on that and it's on a macro scale to convert one. I want to thank you for having this meeting and I also want to acknowledge that you of all people have been saying we need something bold. We need something big. So appreciate your bringing facts and figures in here today, and I want to follow up with you. So just a couple of things. I know you're running out but but in terms of the number of homes, we have got to get serious about this and not just say We need them. It's what and I will give council members who want your do that you've been saying we need to do something big and bold. I will need to see our community come together in ways that they have it and just try and we need to drop do something. That's driving something much bigger for Tri Counties in four counties. If we're talking Kitsap and it means the state it's going to need all of us to put our brains together and say look at when I see this, you know, it kind of reminds me that it's going to take something massive to change and an N an analogy that came up the other night was in 1972 half the people here weren't born but 1972 we had the draft and when the college deferment ended and when fairly well-to-do young white men were about to go to Vietnam things changed and it changed like practically overnight. It's that kind of shock and awe that we are really going to have to look at say what are we going to do differently? And how are we going to do that? So The evictions what you were saying and what you showed with the idea that 1 + 11. Families are being evicted one or more times the idea about the number of homes that huge number that we're going whatever pick your number pick your flavor. They all they all lead to the same thing. I'm in the end earlier when the shelters we were talking about seniors and the number of women and senior women that are outside in the cold. This is like Way Beyond acceptable Way Beyond something that we can turn our backs on. So I'm just really appreciative of what you've done today and bringing people together and just pointing to the stuff that we need to get serious about and it's going to take you know, frankly a bunch of wealthy young people that are going to have their their backsides on the line until we finally step up and say we're going to do something different. Thank you. Cousin verb action. That is a good conclusion for the meeting.", "end_time": 8914.2}]}