{"format": "raw", "annotations": [], "confidence": 0.9356010920965849, "data": [{"start_time": 0, "text": "There we go. Now I'm really loud turn down just a little bit. Thank you appointment of the new director of The Office of Economic Development will have a presentation and briefing from the office of arts and culture on their 2018 race and social justice report and then we'll hear from Seattle public utilities on the state of recycling and finally will end the meeting with again focused on Seattle Public Utilities and audit exit report. That I want to kick us off with our monthly edition of cultural Spotlight. Jenny went to do cement trucks are good morning. Thanks for having us. My name is Jennica with the office of arts and culture and we are joined this morning by Joe IDE injure and Rosalie Miller of the documentary of personhood. Hi and thank you for having a us here today with person hun. We've heard a lot in the news the last few weeks about abortion the attack on abortion rights. And this film is we hope to show that these laws reach far beyond the right to choose and can affect women who have no intention of ending their pregnancies personhood. We're going to show a clip today and we're very excited to be at this point what the film person who does the story of the rise of the fetal rights movement and the growing criminalization and policing a pregnant women. And there are now 38 states in the country that have laws. They give separate rights to fertilize eggs embryos and fetuses and as a result the prosecution's of women for things like miscarriage stillbirth and drug use during pregnancy. I have become very widespread and this film looks at this issue through the story of a Wisconsin woman who was jailed under that State's fetal Protection Law, and we kind of look at what happens to a woman when you try to stuff two sets of Rights into one body. So this clip is we're very excited to show this as the opening of our film. It's still a work in progress, but it's the first time we've laid our credits on it and it's exciting because there are a lot of Seattle artists that will show up so Here we go. oops There's a metal cot. There's hair fingernails feces on the toilet. And I would just think to myself did I do something like Ally really in hell? They tell you that there's a war on women there is no war. Sorry about that. It's quite alright. Well, I have to let me just type in the I'm so sorry. Sure, that's a good idea to fill the fill the empty air with a withhold comment. It is but it's a I'd have to login. All right. Try to set the mic. And no beekeepers time 2 minutes. Thank you. Yes, I'm here today. Hello, you're on crack. I didn't hear myself just like you before but you kept on talking. Anyway, I'm here to make a comment in regards to who I see you have arts and culture and race. I'm a culture. And Judge Brown Joe Brown gray stuff and he took freedom of speech to another level. So if the judge is okay with just saying whatever he want to stay when he came here the other night. I'm okay with saying whatever I want to say. Okay, he cleared it up for everybody in the audience. Okay, and that's standing up for the rule of law. So my question today to you. When are you going to stand up for the rule of law? You have gunzalez 5 * violate her oath and then you can make something up some rules and regulations to try to us and cut us off at the pass when we not doing no more than what Judge Brown did the other day when he came and spoke to his audience at any time you can Cut something off because you think it's unfair so that that means that if our human rights are being violated and you find something that is unfair you have enough enforcement law in your job to cut it off and say it's wrong. It's wrong discrimination is illegal. We don't want it in this country. We don't want it in the fabric of Seattle. Therefore we going to cut it off we going to shut it down. I haven't seen any of that in the ten years that I've been coming down here repeatedly telling these people about the level of of degradation in hell that we're suffering through as a peep on top of black people. Okay, and I wanted to stop and I'm not going to keep telling you over and over and over again to end it. Thank you. All right. Now we're going to return to our originally scheduled programming back to the cultural Spotlight. Sorry about that. When I found out I was pregnant I had so many emotions. I was happy but then I was like, oh I need to get my thyroid taken care of. Like I had this urgency like okay. I need to fix my depression. I need to go in need to get back on medicine. I need to fix myself for the baby. We didn't realize that Wisconsin had you know what the laws that protect. fetuses to that extent that we just try and even going in and get care and admitting things in my past would cause them to Want to intervene? I thought if you went in for help, like that's what you got to know. They they would be carrying they would listen to you and not judge you and just get you better. Social Services Corey Haim Corey, this is attorney Courtney drop time. I can put on speakerphone you okay? Thank you recorded this time the doctors, you know, they told me they're like all you know. You can be honest with me and nothing you say to me will have legal repercussions. That was a lie. I had no idea that they were like rallying all these people together for for my fetus. underwear unborn child whose mother is at Tamara Witcher. Thank you. That court order the words on the paper were pretty powerful mind-blowing seeking temporary physical custody have the fetus says a lot about where we are in this country right now on this issue. Thank you both at the arts and culture for always bringing us time issues manifest and represented in art and thank you for the work that you're doing and would love to know more about the film as it progresses. Alright, let's move on to item one will can you reconsider I can't place item one is appointment 01345 appointment of Robert wonsung Lee as director office of Economic Development. Greetings. Early. Thank you so much for joining us again. So this is the second briefing related to your your confirmation. The last time that you were here with us in committee. We talked about the preservation of small businesses. We had a bit of a focus on the needs of small businesses associated with construction and development pressures that impact foot traffic as well as commercial rent cost. I just like to take a minute maybe to do a few follow-up questions. But before we move into that, did you have thoughts that you wanted to add from just your experiences is your first weeks here in Seattle? Great. Well do is pass this out instead of writing long reports because I know you get plenty but I thought is too kind of have a visual aid and this is something that might directors and I develop in concert with the mayor's office. And our mission that we would like to propose in this is just a draft and down the road after confirmation. I hope to engage in more discussion with this committee and get input from all of you as well. But as a starting point building inclusive economy is our proposed mission. The second layer from the base is our core competency as a department where our expertise are. And the final the outer layer in this rainbow is our service delivery platforms to fill the mission eventually with this graphic. What I hope to do is eventually put all of our performance measurements included in the budget that's associated with it and that our action plans underneath each of these buckets. So those Rd organizing tools if you will we will use to help move deed department for that some it's helpful to have a visual to not just demonstrate your programs in your office and where those programs are focused, but I think the next layer that you discuss what help us understand the proportion of time and resources that you devote to teach of those areas. That would be very helpful as we move in. Exactly from the last conversation. I had a little bit more of an opportunity to review the materials that you provided to us in response to our question, but I want to thank you again for doing that work. I know that was a lot of questions and there's a lot of interest on the part of Council in this in this position in particular. I found interesting the conversation around and of course, it's not the note stuff. Hey. I think I might return to that one a second. So let's talk a little bit about cost-recovery around special events the city auditor highlighted that we can be doing more as it relates to cost recovery for special events. In the reason for the viewing audience that that's has relevancy for the office of economic development is because this special events permit and goes through the office of Economic Development. Your your office issues the permits and along with the permits identified as what the what the obligations are of the permit holder and in many instances the obligations include funding Services associated with with the events and so the auditor found perfectly as it relates to law enforcement that we aren't recovering cost associated with with line. Forcement necessary to manage some of these public events the folks in the office for special events rightly point out that many of these events are free speech events. So we have to make sure that we're creating a balancing and even of those that aren't free speech events. There are events that bring bring Vitality to neighborhoods in downtown in and actually have a draw and economic draw. So how do you see the city moving an area that we can both address some of the findings of the city auditor while also preserving the balance necessary in order to continue to encourage these types of events. Thank you. I haven't had a chance to read through carefully the auditor's report yet. But this is a struggle for most cities is how do you recover the cost of that sand? This is certainly the struggle because you do want to allow local events and Free Speech events to occur. But all of those events costs as it has a pressure on our on our budget. I think it's ultimately it will be a combination of Civic public and private sector with the right formula based on the scale and a type of advanced as the one thing that I will do is work with our special events to provide our electives different scenarios on how that formula should be structured and certainly this pertains to has embeds fees. It does pertain to the permitting process and the nature of the event has different types of perming that's required. So what I'll do with our special events team is a come out with scenarios for electives on different trade-offs that will be involved and how to pay for these events for the Long Haul but this is something that I did meet with the police department on this issue and they're very clear to me is is that this is an issue that needs to be solved. But also when we solve it it it doesn't one of the concerns that they have raised is that the bureaucracy to we just need to make sure that it doesn't cause more paperwork in order to recover These funds and sometimes that the recovery process itself will cost more than the revenue that you generate. So it just needs to take that into account great. Thank you. One of the other topics of great interest right now relate specifically to be used on the part of cities of opportunity zones are there are challenges associated with opportunity zones as well as as the name suggests opportunities. Can you talk a little bit about your philosophy? Addressing both the challenges and taking advantage of the opportunities still feel. So the the role of government on the opportunity zone is really be a broker of investors and then for us in the public site to create portfolio a different projects that snow line with our values and typically for example in Portland. That was a supermarket that was that was closed the community wanted to own that property and turn it into Community Center. So we put that as wonderful folio for the Enterprise for the opportunity Zone projects. And so from from the public side, our goal is to organize all the different Community Development projects until profolio and then have a third-party broker those opportunities for investment, but the challenging part, is that for the investors. What they want is they want a lot of different profolio. They want as many different opportunities to draw from so if you only have Seattle folio, then you're not going to attract as much attention as if you had for me sample the whole region or the whole West Coast. So the question is, how do you teach a clean organized of profolio in a way that attract the type of you need answer only the mayor talked about the workforce housing as an example. So if that is the values and the priorities of the council in the mirror, then our rule on my department is to organize the foliage from middle-wage or a the workforce housing side and make sure we have enough for foglio's on that front and identify the right investors for those projects. So that's right. Now there's a website just being developed in Portland. We developed a website as well with all those portfolios in one area. And that's something that will do here in Seattle as well. Another one of the topics that I found interesting in your response related to expanding direct foreign investment in Seattle. And in your response you it indicated that there are particular types of foreign investment that an SDI program foreign direct investment program that are investors who are more predisposed to hiring locally and hiring from high-priority demographics race populations that we want to make sure have access to clear wage jobs. Can you talk a little bit more about that? I have a direct experience in this I work for a foreign direct a company in Oregon. That was the largest FDI company is called hynix semiconductor. And it's a of a large plant. That was making memory chips. But the at that time the economy was different at that time where the the workers in the logging industry in particular were losing their jobs and some questions how you do how do you retrain them and become a high tech workers in a fabrication plant? So that was a win-win we knew that threw up ride a different reason economy is involving and Regulatory issues that those jobs were going away. And so this company played a crucial role in taking those workers and and retrain them in to protect workers wear wage was completely is it was it was higher as well on top of that so higher the workers who were losing their jobs, but they actually played a role in the training because it's a specialized field. It's the the investors themselves who were taking on that responsibility. So what we did is is it is a combination of public and the company in the public Workforce Development. So what we did is we made an arrangement where the the Workforce Development agency of that region, which is calling or Force partnership would actually do all the recruiting and do the basic training first. And then once we hire from that pipeline, then we'd then trade him even more so that they understand how to use the machines and the tools and so forth. And so then we contribute we make an agreement call First Source agreement and that means we will hire locally the original agreement was 50% would be local hires, but we ended up probably around 80% And so and also to the work ethic of that Workforce was great and they were happy that they have a job in the future and it High paying job average wage at that time in the 90s were like $70,000 a year. So that was a good paying job. And so it's a win-win the FBI's activities are recruiting companies if we can find a way to solve problems in our economy where does displacement and use that opportunity for incumbent worker training and so4 enforcers hiring? It's a good can be a very powerful when one to learn more about that. Can you just talk a little bit about the role that you would like to play working? Both with the the Arts office as well as the evolving office of film and music to ensure that we continue to support our creative economy jobs in the Arts design entertainment and media sectors. You may recall the office of arts and culture released a report that was done by the office of films recently about the creative economy and it that report itself showed that we have a lot of games to do in some of the jobs that are available within the creative economy. There are some some jobs that are very high paying and there are others that are not and racial disparity among The Starbucks order proportioning of the the high paying jobs vs. The low paying jobs is just reinforces what we already. We already know about racial disparity patterns in an income for Randy and I am at yesterday talking about successively and d in in Portland, that was a TV show that was filmed in Portland called Grimm. I don't know if you had a chance to see that is quite an interesting show a very small company in Portland got the contract to provide CGI services for that program and CGI is a visual manipulation with with monsters. And as a result that contract a wand for that show, they were able to scale their businesses and ways that they did even though they could truly a success story for a very small company in Portland. So as the film industry and the creative economy continues to merge evolve technology sector is also providing additional tools. But the challenging part is at the technology, especially the software field light CGI is advancing at a rapid rate because the technology platform is is that there's a lot of input and money going into that field. We also need people with the actual creative mind to take advantage of those tools that is lacking currently. So another words you have the hardware but not the software. So Randy's roll. And when we talked about this yesterday is that we need to make enough Investments. So that the creative the people still can have access to advancing their Creative Learning as we also look at the technology platforms and be able to integrate those two so that they all will benefit from and and they need but right now the technology side is advancing at a rapid rate without the creative community be engaged and that disconnect is what we need to solve and so from Randy's side and an economic development side. Our role is a connect those two so that the artist can actually take advantage of the technology in or How to get into college jobs at Denny and it's a win-win because of Technology folks are saying we don't have the creative minds that should take advantage of it. So it's a win-win since that would be the integration. Well, I I have no further questions. I find your vision for the Department to be excited while I'm excited to work with you your experience as the former director of Economic Development Portland and your service as the ritual Solutions coordinator for Oregon governor, Kate Brown and your experiences were also working in the private sector. I think make you a really good fit for our city and I think we have identified a number of shared priorities to be smooth with that. I'm just going to go right ahead and move appointment 01345. I'm not going to vote Yes waiver of your appointment and this will move on to full counsel not this coming or not this coming Monday because we are voting on a Friday. So we're going to skip a week, but I will see you at full counsel Monday after next and I'm congratulations. Thank you so much for Add item to the office of arts and culture race and social justice 2018 report. Makeup brands going to be joining us. Thank you. Right there with you. green Are you all right? Thanks for asking. Happy Friday. I just out of the computer cuz I have to start. Right now it was all settled and start with some introductions places to quit go around and culture. Hi Randy engstrom director of The Office of arts and culture manager for the office of arts and culture. Hi Diana falchuk creative strategies initiatives manager of new partnership between OCR and arts Welcome and thank you for having us. I think that the office is racial Equity work is probably the the most significant force that holds our work together. I think it guides are are aspirational work in our programmatic work in the office up there. I don't need to show you read you but we've our office put forward a commitment to racial Equity as a department about 3 years ago and we use this as a as a guide for all of the work that we do including the rets and the programmatic work that we'll talk about today. But we really Envision a world in which we don't have a racial Equity plan and a strategic plan. We have one plan that is in fact a bowl and the racial Equity Drive all of the work that we do and it's not separate and apart from the work of the office that commitment is cosine of Arts commission is not up here with us today. But who are our partners in all the work that we do we will talk about two specific racial Equity tool kits that we did one in the cultural space world that Matthew Welter. About around the public Development Authority and one that Calandra will elaborate more on I'm related to King Street Station on but for a variety of reasons our approach to this work is less about checking a box of the four are you tease and more about how we actually integrate this work into everything that we do and so there are challenges associated with that the urgency that the institutions would have requires of our work day today realizing that real really meaningful partnership work with Community really meaningful Equity work. We like to say moves at the Speed Of Trust takes time to build those relationships with community and just putting a deadline of four things that must be done by the end of the year doesn't necessarily translate into meaningful change or deep relationship. We're lucky that we've been able to build some of those relationships overtime and I think you'll hear about that in a lot of this work but the tension between the way the bureaucracy functions in the way that social movements function is is an interesting tension to be in And I think while we are eager to demonstrate our commitment to these values we have also found that as we stack new programs on top of new programs on top of new programs without necessarily the resource or the capacity to implement them fully. We find ourselves being so overwhelmed and under-resourced Denso part of what we tried to do in 2018 was carried through some of the previous ret work that we had done specifically at King Street some programs like a Creative Advantage have been racial Equity initiatives from their origin, but that doesn't fit the box. That's a Sara Lee oven ret in the way that they are designed. Currently. I think we've you know where I'd work. I love that move at the Speed Of Trust rather than the speed of deadlines and your your critique around the sort of the Citywide departmental standard of for our 80s a year is interesting. Not every Department I think has gone as far as your department has is it in integrating this this work throughout all of your your programs? And so I I I get the concept that the sort of 4 one-off projects may not translate very well to an organization like yours that again has integrated racial Equity work throughout everything it does but I just because I'm interested in your perspective is that critique of for that for rats a year may not be very useful. Does that extend to I just seems like the good place to start for organizations that aren't as far as long as a secure I put I think it's both about compliance and about aspiration and I think if the way and I understand that the way to go kids are designed as to train you how to do work in a particular way that is inclusive in center community and I think that's really important in particular that's not the practice that you have. And so and and I think there are departments with a thousand employees and their departments with 20. And they all do for rtt's and so there's that there's a it's it's a challenge to figure out a system that will work for everybody. But I think that there has to be a balance of what is required. And then what is offered at that make sense? That's why I don't think we've we moved our office last year for the second time in 47 years. We had a lot of changes on staff and we've been without a functioning online Grant system for several years and all of that creates an administrative compression that that makes time a challenge and makes capacity a challenge that's not an excuse. It's just a reality and you know, we will always have challenges as we go on. I do want it named that I feel like we're in a much better place with the graph system now and talk more about that if you want, but I'm a huge fan of sides and the work he's doing it Seattle it and I feel like we're we're on our we're getting into a really good place but figuring out how you You evolve your organization as you deal with the constraints of capacity overtime the Negroes and and the the capacity is is constrained. So we're working on it worth working to get up to full speed. But we want to be honest about the challenges because it's lovely to get up here and talk about the work that we're all so proud of but we also know it's a journey or still on it. There's more we need to do and there's a that we're going to continue to push ourselves. So with that I will turn it over to Matthew to talk about what some specific ret work ideas for the creation activation and preservation of cultural space report. The first is to build artspace equitably or we call the base cohort is a cohort of 20 to 30 people who spend a year exploring these issues of the intersection of cultural development and real estate development. The code word is red equally split between folks from those two Arenas real estate and then cultural Our Community Development and it's entirely people of color based cohort. We just graduated the first cohort about a month ago and are launching our next cohort in June in builds capacity in both of these communities to engage with one another. It seeks to connect these communities back to one another they're both Really curious about one another and understand that they rely on one another for survival and don't have the tools necessary to engage directly with one another. The second project is the creation of a new public Development Authority dedicated to the retention of cultural space in the holding of cultural space Also Rose from the the cap report. It is another one of these programs that seeks to nip these two halves of the community back together again, the folks from the cultural community in Folkston real estate development community centers cultural spaces is really the hearts of the neighborhood as the city grows. How do we retain cultural identity in these neighborhoods? And it seeks to hold space for that retention on the base covert project. How are how are people selected in the first year made sense in both the Chinatown International District in the central area. I'm through the Central Area Arts and Cultural District and my wing Luke Museum really engaged folks from those two organizations along with folks on staff. The Arts commission to build nominate MN vet the proposals that came in from community in the second year. We relied on those communities again and also folks who had been through the first years cohort to be part of a panel wedding team did both the entire first cohort and staff were able to nominate folks to apply and then that smaller group did the wedding over the course of two sessions over two days to narrow it down to the final Court training how people were able to apply the the expertise that this this effort gave to these communities bad connections get made within the cohort development projects move forward and and architecture engaged and and projects develop directly out of the cohort people also gain the skills to then go out and Not need quite as much of a translation service to engage with the the communities that they're seeking to work with and have a little bit more ability to engage in that conversation directly. And then on the way, we've been what do you do with a certification certification? What do you do with this group of 30 weave now created one of the really interesting ideas, I think and we were starting to engage a couple of different organizations around. This is the creation of ad hoc teams of certified folks from that first cohort to jump in and consult to an organization looking to deepen its connection to the communities of color looking to deepen its connection into various cultural identity and real estate projects in town that may not lead very easily to a lot of data and you know reported outcomes, but do they sent you can collect anecdotes and stories of what has resulted from from this work. I think it's interesting and and potentially useful as it relates specifically to the PDA you talk a little bit about the timeline for the Ram in the design the policy design phase and specifically what alternatives might be if it turns out that the PDA is not financially are operationally viable. Although I hope it will be about three weeks ago at the most recent square feet Seattle event. We released the structure for stability report, which is 100 page report broadly recommending the creation of the PTI. We are currently spending 2019 the remainder of 2019 creating a much more detailed road map to the creation of the actual organization. I'm wearing ongoing conversations with CVO with LED with other departments in to create the Partnerships interdepartmentally and the relationships outside of the city to spend this thing up in the first quarter potentially of 20/20. So it sounds like we're figuring out that it is operationally in financial aid. This is the report strongly recommended and reflected the recommendation of the folks that did engaged which is about a hundred people both within the city and without again through the the ret process as well that we move forward with the idea. This year's been really diving down into the minutiae of budgeting and legal constraints around the organizations in the money in terms of what is a fallback plan for addressing these issues. The report itself looked at multiple different models for how to stand this work up. One of which was a simple as continuing to move forward with an interdepartmental team of different folks from different departments focused on Commercial portability and culture affordability. And that is one option to keep addressing it just as individual bodies of work within departments remind me the name of the report that was released structure for stability. Send a copy to your office and it's available online as well. Clara great, thank you. So I'm going to talk a little bit about the Creative Advantage which is David of arts and cultures primary investment in K-12. Arts programming colleges are Citywide initiative srk12 plan to establish a Kodi box. That's Arts education for all students in the district and it's realized through a collective impact partnership between the district the city through our office on Santa foundation in many Community Arts Partners since its launch in 2013. We breach 61 at 102 schools in the district this last year alone. We launched in the Southeast region which includes go like Aki kurose e Mercer Middle School Franklin and Rainier Beach High School on to add 21 schools. We also launched the media arts Skill Center course at Seattle World School on this is part of our goal to connect Arts to careers for high school students something that young people asked for in the research phase of the Creator advantage and in the neck. School year 1920 will be expanding into additional North End Pathways with the goal of reaching all schools in the district over the next two to three years. So by 2022 are racial Equity outcomes are really focused on increasing access Arts education, not only for all students but with a clear Focus for underrepresented students and the research that we did local shows that that is students of color English language Learners special education students, and we do this by increasing certificated Arts instruction and through Community Arts partnership. We're also working to increase access to teaching artists of color who served in partnership with schools to provide really meaningful quality engagement for students during the days of Arts integration and also provide a professional development teachers and that is a direct a resource that comes to the office of arts and culture that Sons those relationships and lastly we're working to arm practitioners across-the-board teaching artists and teachers with culturally responsive teaching. Strategies that Center the cognitive development capacities and Ludacris. Seuss of students of color for the benefit of students of color and for students with large in the district. Oh, oh and by saying, you know, we do an annual evaluation of the program with an external partner the Burke group looking at the games that were making are we increasing access to the Arts? Are we moving the needle on equity and some of the the findings from a roast recent report are encouraging as they reflect things that have to do with creating a culture shift in schools where the Arts are present. We're continuing to make significant gains and access for art and music specifically and particularly at the K-5 in K-8 levels. I will say that racial disparities continue to persist though when we look at high school secondary actually middle and high school in particular. We see that while soon as of color are represented and in some cases over-represented. In Visual Arts programs particularly black and Latino students are under-represented in music programs. And we're looking at the data and talking with practitioners in schools to dig into that a little bit more and understand what's going on there. It may have a lot to do with what schools are offering which schools are providing, you know Advanced programs that also then provide music programs that connect to a pathway of opportunity that begins in elementary and what students haven't been able to just access that opportunity. So that's something that we're looking into I am happy to say that when we look at schools that have been involved in the crate advantage. That's far their development and cultivation of the 21st century skills and habits and culturally responsive teaching is higher 30% higher than I'm schools that are not engaged in the Creative Advantage. So those are just some of the highlights about the work and be happy to answer any questions that you have. You're coming back for all Creative Advantage briefing on June 11th. One thing I am interested to learn more about not to suggest that Arts education is about employment. It's who you know about getting people career-ready or anything like that because it's our situation the value of it is so much more significant than then career Readiness, but the Creative Advantage report did identify disparities racial disparities related to the types of art that people are employed in and it seems that the Creative Advantage Program might by introducing some of the technologies that are used by folks who are in the Arts, but are in the Arts and the higher-income more white. Vocations you might be able to find a way to sort of coax up. He's into that issue through Creative Advantage, Maybe you're already doing absolutely I will definitely talk a little bit more about sort of the cree connected learning creative Workforce Development stuff. When we come back in June in the Partnerships that were doing or holding interdepartmentally around some of the specific things that you're talking about. So appreciate you for doing that. Diana great. So in 2018, we launched the creative strategies initiative which is part of our longtime partnership between office for civil rights in office of arts and culture. And as part of a new culture ship strategy that are stray I as working on in this approach for using arts and culture based strategies everything from actual artist-in-residence projects and programs to using artist through an r e t process to arts and mindfulness integrated learning environments like the photographs that you see up there to actually make shift in policy and practice and non Arts areas. So looking at areas like the environment in Workforce equity and housing etcetera the project that we spent a lot of capacity on in 2018, which was one of five initial creative strategies projects that we are working on is called or what called Turning commitment into action for environmental just Partnership between off of arts and culture office of sustainability environment and Seattle Public Utilities. And for that there was a direct request that came from the environmental justice committee at osc saying, you know, we have this Equity environment agenda, but we really need policy influencers from historically white light organizations to actually get behind it and work on what it is to show up and racially a couple ways to move forward and agenda that actually centers people and communities of color and so developed this cohort model that met for six and a half full day's over the course of about 4 1/2 month working with a team of teaching artist in myself. The other three folks were from around the area of the the northwest region all people of color working on Arts integrated in mind Creative Learning about structural racism about what it is to do culture shift work in about how do we actually make policy change and three key areas around Food Systems. Around green stormwater infrastructure and around urban forestry and that code word is continuing to work in those three areas. Those groups are continuing to connect with each other and make change through their organization Community organizations and also through on city folks and County folks were part of the cohort as well. So that's just a little taste of that and it says the idea is to sort of replicate this partnership with other departments while you know, you using this concept of a culture ship but having it go from working with o s a n s p u now but you're going to be moving on to other other departments to to use that Arts strategy. So that was just the one product that you wanted to highlight for 2018. So there have been five that we're working on on the biggest one that you've probably heard of is a partnership between sdh Roc R&R call the shape of trust which kicks off next week and it's a multi-year project that begins with an original piece of theater based on stories from our City's Workforce of racism racial equity and belonging some reason that is it in a series of coal worth of the teaching tool the video for managers supervisors and people who advised on HR matters. So that's just like another example and other one is the Chinatown International District race. Free tool kit process which used to live with opcd and it's now a t i o n and so last year we piloted two different ways to embed artist to do communion gagement and we're going to be continuing that this year as well. I'm here to talk about the public art program and I think as a Randy mentioned earlier how racial Equity has been incorporated into the work that we do and drives a lot of our decisions instead of talking about the work that the public art staff and advisory committee the last few years and You know, we are working to engage and commissioned artists of color working with communities of color and then do our partners like spu and I had some major achievements as far as of commissioning lot of younger artists the color who have now joined the public art field and it's been it's it was exciting with the last few years. I think one of the exciting projects that we are here to talk about yours. Is he up shipping a water quality product that we're partnering with spu on it. So we have our four locations that are located on the ship now that we have work and we have commissioned three artists for three of the sites for the Ballard at the pump station. We have commissioned artist Jeffrey veregge who is a port gamble s'klallam tribe remember and we specifically had that project. We wanted to honor close. Which culture because the location of that site was where the social Village was? And so we wanted to make sure that we know the city had an opportunity to honor that history in that culture. And so we wanted to make sure that we had a native artist for that and then for the two other products that we had and Wallingford and Fremont Motors open calls, but the nice the great thing about it is that true fear of the two other indigenous artists that were commissioned for it though GIF Preston Singletary of the tribe who was for the Fremont project and then Ryan feddersen who's from the confederated tribes of the Colville for the Wallingford project. So it's really exciting to have three indigenous artists for those projects. Which also go along with Marvin Oliver who has that not work project at the salmon and Salmon Bay as well. So we'll have four significant public art projects coming online and Future. Thank you, as it relates specifically to public art we have in the past discussed our interest in the percent for art project moving into using funding derive from these large capital projects to also support live performance art if we had any success in doing that. Yeah, that was one of the one of the items that had come out of an old cyberport. And I think we had talked about making some changes to the program to allow for that possibility. Yeah, so we have a artist-in-residence on Jason to remind me which bridge is. So we're starting to push a little bit of the boundaries Beyond just working with individual realm and we're definitely thinking about a lot of the public art projects as being experiential and using social engagement. And sometimes that that looks like performance. Sometimes it it does end up being in the visual realm, but I think we're definitely pushing those bounds and we can definitely give you more specifics on the public art program great. So not live. Are we refer to it as experiential Arts a cracked screen? So I'm so excited to talk to you about things straight. This was a project that as you know has been several years in the making and went through a really expensive racial Equity toolkit where we engaged about five hundred folks to really get deep feedback about how we can use this really incredible resource and how we can make it the the best used for folks who haven't been traditionally represented within the the the the I keep trying to say public art and it's not just a little tired but was in the Arts field itself. We're actually coming up tomorrow will be our 10 weekend versuri of being open to the public. We opened in mid-march, and I'm really pleased to say that we've had over 5,000 people come through the space in those 10 weeks. We had about 2,700 for opening day and we've been averaging about 50 people a day that are just walking into the space to experience the exhibition that's in there right now which features more than 200 indigenous artists. I'm so that feels really successful. And in three weeks on the same Plaza that you see here for the opening day. We are going to be installing and unveiling our first plaza art work. So a piece of art public art that will help identify the space as a cultural Hub and let people know that there's something on the inside that they should come and see that piece is called brings the medicine Sundial and it's by Kimberly darianka and it is being intensely unveiled on Friday June 21st for the solstice because it is a sundial and so it's representative of that time. So that's all really exciting. But we wanted to talk today a little bit about how the outcomes of the racial Equity toolkit really informed how we created the programming in the space. So I wanted to talk about a couple of the sir top-level themes that came through with all of that outraged that we did. The first one was around racial Equity ending. And that was we approach to that Outreach that we did through a racial Equity toolkit process where we really prioritize the voice of the folks who haven't been traditionally represented and really what came through loud and clear is that it's not just the approach and how we got that feedback, but it needed to be the driving theme and how the programming happens and so the programming is really explicitly about showcasing the voices of communities of color and other artists who haven't traditionally had that kind of representation. And so that is how decisions are getting made decision making is happening through a brand new group called The King Street Station advisors, which is a group of about 20 folks that is highly representational on on Race on disability status. We've got folks who are in their late teens all the way up into septuagenarians. It's a really incredible group of people who are reviewing all of those Community ideas and request and Being able to figure out what makes sense to go into space. What do we really want to prioritize and where do we want to put our resources? So I think the way that we've looked at that programming model is really very different than start of the traditional curator or group of curators that kind of makes the decision from on high. So the ideas come from community and they are undecided on by community. So that's the first the second fix team, which is not too surprising is that we have to really support artist. We can't have art without supporting the artist and one of the pieces that actually came out of that's what I thought was really neat was that we don't want this just to be a presentation space. We really want it to be a generative space. We want it to be a space for artists can come in and work on their craft and create things and expand on their ideas. And so we actually through the feedback that we got in the construction process. We moved the artist-in-residence space from it was originally going to be enough kind of Corner area really to put it right in the center. So when you come up the stairway the first thing you see is the artist-in-residence space you can see artists at work in there right now. We have a really amazing Carver prisoner right now. So that's pretty cool. And then the last thing that I wanted to touch on with connecting the space to Civic life and that's the piece that I think we're really looking at right now now that we have been running and where we're getting our feet underneath us. So we've been really we've been reached out to buy our partners in so many different departments about how they can host things and have their events in the space. And that's the piece that were sort of figure out how to get the resources in place so that we can do that in a way that supports everybody but I think that's the really exciting pieces knowing we've had you know thousands of people come through here. How do we connect that back to everything else to the city does absolutely you don't I mean the the visit that you're receiving You don't lose that momentum, right once it's not so new just having an intentional program for always having people in and using the space. And as you say specifically connecting it Pacific life, I think is really really in so I'm glad you're you're working on that. It's a great space and everybody I should have the opportunity to use and love it. Thank you. I think we talked about the show. You should come see it you everyone it's an incredible accomplishment. Just want to shout out a Tracy Rector agent ale and some Creed cologne the three curators who put that that show together. It's more than a show at King Street with 300 artworks. It's a year-long your long plus Endeavor that involves dozens of sites a really incredible thing that we're privileged to host. That's a bunch of stuff. You know, I should have said this at the beginning but there's over 40 Staffing our office. And any one of them could have been sitting at this table because this is work that everyone values and contribute to looking at Hyde. We're really excited. I want to give a quick shout-out to Rick reyez are all racial Equity coordinator, officially full-time racial Equity coordinator, as of Tuesday. I really did the other Lions Sheriff of work on this presentation. We're really lucky to have him where were excited about the new realizations. We can have her on public spaces. Where were excited to have a second base Cove or we can learn from and build on the success of the first year were excited to keep diving into the PDA as an instrument of of equity and cultural preservation. I'm that you're going to hear from where I'm at the creative careers cohort as a part of Creative Advantage and are contributions to Workforce Development in the future of work. I mentioned Ricky Hazard Hazard full-time racing like Coordinator super excited about that and next week the shape of trust which is the arguably the big at most ambitious sort of equity partnership. We've had with OCR which is a 7-year partnership lunching with three sold-out shows that are going to be going to bring this program and I'm to fruition so you hear about all this next year and maybe some other stuff cuz who knows where it's going to go but this is something that we're really proud of and that we enjoy being able to talk about because I was so what you were saying about rats that I am afraid. I got lost over it up a little bit more about what it means to be a granting organization that is functioning without granting platform. So our office was chartered in 1971. And since 1971 are primary activity has been investing in cultural organizations. In 1971, we find at 7 organizations last year. We ran nine funding programs. We funded about 375 organizations for many years. We did that with up with a web-based platform that allow people to apply through a platform and then that software with aggregate information. That's what I thought you were talking about, but I just want to make sure I friend the time it takes to do that by hand when you get hundreds and hundreds of applications nine times a year is significant about September, but we can do to help. It's getting better and working on it the 11th forward to hearing more about great Advantage. Great. Thank you. H&R M3 is Seattle public utilities on the state of recycling? greetings Thanks for joining us that start with some quick introductions and kick it off tracks manager Seattle Public Utilities. Zero-waste, Washington. I don't know if you want to say something. Go ahead with an update on the state of the current recycling market right now. It's you know, there are a number of issues impacting the Global Recycling markets. Today. We're going to highlight two of those elements on the first of which is the The first of which is the recycling important limitations better being imposed by China and others text and then we can come back to that heart issues do a quick presentation on the talks about the drivers for why were in our recycling crisis and then spend a bit more time on the solutions. So is there a way to Washington is a Statewide nonprofit working to make Trash Obsolete and largely by helping pass laws at the city and state level and doing pilot projects and community-based projects. So I'm going to talk to a picture about Plastics and then some of the drivers like the consumer confusion. The challenges that are recycling operations are in markets and then finish up with Solutions in legislative bills that just passed at the state level. So as you know, we live in a plastic air up since World War II we have had an explosion in the amount of plastic around the world that's being produced and used the this is showing from 2019 52 2015 bisector the different types of plastic the bottom which is the blue is packaging between 30 and 40% of our plastic is being used for packaging and this is what's causing some of our biggest problems in our recycling crisis right now. One of the challenges is it that the manufacturers keep introducing new types of packaging which end up not being very recyclable different materials put together laminated materials and flexible pouches and metal put with plastic and that that can right there. Another challenge is that we the consumers are very confused about what to put in Which Wich been there's a thing called the 3-second shrug. And that means that if you look at your bill and you have something in your hand and you can't figure out what to do with it within 3 SEC 3 seconds, you just put it in which ever been is closes. So I hate to admit it but even so I should be able to figure this out and I'm even confused. We need to make it easier for the consumers completely correct. The other issue is is something compostable or not. So if you have a fork right now if it's brown, you're not tan colored, you're not sure if it's compostable or not compostable. So the consumers are confused on that. So as Hans is going to talk about in the moment. I'm in terms of the details on some of the Seattle numbers. We have a crisis that's been precipitated by China national sword. In March of 2017 they announced that by the end of that year. They were no longer going to be accepting waste from around the world. They were accepting 60% of our ways from the Pacific Northwest. The reason is because we are in a deadhead situation. We have all this material coming from China and Southeast Asia two airports in containers, but we didn't have that much stuff to send back. So it was very inexpensive for us to send our race to China to be processed and it was cheaper do that than to truck it to say Portland Oregon from Seattle. This has a manifest itself that they said they were 24 different Commodities from textiles two different types of paper and Plastics that they would have a standard a .0 5% contamination that is essentially zero and the reason that's important is that people don't like to talk about it, but our contamination rates in our Bales is 11. To 20% way higher than 0 and when one talks about contamination, we're not talking about pcbs and toxic chemicals were talking about things that are the wrong thing. You need to bail. So paper metal glass food waste all have value if they're in their own bail, but we have them in the wrong bill, which is 11 to 20% contamination. The is the standard that I'm China sets. They're saying they do not want any material coming in if the bail is has basically anything at these are two inspectors on the Chinese port in a Chinese port on the dock that used to just look at the bails. They look okay send him into the country now they cut them open and if they find anything in there, they said the entire load is rejected because 0.05 contaminations essentially zero. Thank you down in San Francisco has been able to get to about a 2% contamination rate by investing in a lot of new equipment in their recycling facility, including seven Optical sorters. So it is doable at the recycling facilities, but it takes a big investment. So the problem is to eat. The idea of having better sorters is really to correct human error, though, correct, correct their many solutions, but one of them is to make the recycling facility operate better and Hans is going to talk about this a bit in a minute. D I wanted so why do we have such a high contamination rate one reason is because when our trucks are going around our neighborhoods, they Crush everything down so they can put 30% more capacity into the truck which is break from the greenhouse gas perspective and from a tracks in your neighborhood perspective pollution. But what that means is at the recycling facility the Plastics are now really flat. This is a couple of weeks ago. We were I got to be a picker at the at the recycling facilities are some of the other folks we were trying to pick out the plastic film from the line and I kept grabbing the bat bottles. They were so flat they look like film. So the problem is your your recycling facility is set up to sort round things from Flat things like paper and the classics become flat and they get into the Bales as do plastic bags what time to show here? So this is a mixed paper Bale that is was at that I encounter. At a wood pulp paper facility in Spokane. It looks great. It looks like it's all paper. But when you look up close you can see that it is not it is full of plastic. So this is for example a yogurt or sour cream cap. And this is a plastic bag to the vertical Brown. That's a plastic bag the bags become flat like paper. So those Bales look like paper, but they really are full of plastic and other things. The other big issue this cousin contamination is that the the recycling facilities have these big rollers which is a system called a waterfall the idea is that the paper will float across the top and go into a paper. And everything else will fall through water fall through and that will be other things. I sort separately the plastic bags and film catch on the rollers and clogged them up over the course of a work cycle x 8 hours by the end of 8 hours their down to 75% in efficiency. In other words. It's so clogged very little can go down that causes contamination and then the workers have to go in on the line and use knives and blade and dump drills and cut the film and plastic off. The rollers takes about an hour at least and it's very dangerous for them. The plastic is like concrete and so hard and it's also costing us repairs because of having to pay for this this this action that they're doing plastic contamination is going to the Bales. So what are solutions? So basically, there's sort of two areas one is reducing the use of unnecessary Plastics and the other is building markets and restoring our recycling system and we'll be talking about that a bit like to point out that the Seattle team we have is excellent. So we have Hans we have Susan we have Seco Jackson and other people at spu her working really hard and I do believe she had was a leader in the cut in the US on this. We are helping push the push the spear. So let's start with bags. I am struggling with the focus on Plastics when I've heard and I maybe I've heard incorrectly that the contamination issue that China has most identified as the problem is with paper. Right? It's the paper bills that are contaminated with the wrong thing. I said, so yes paper is the biggest it's not that I've just been assuming it's all dirty paper paper paper with food waste or wet paper. It's it's Plastics in with the paper address little bit that in your teeth and all the stuff about the flat plastic plastic is huge. There are other problems, but if we could really address Plastics would help a ton with the paper contamination, but there's also glass and there's some starting with bags. We now have 28 bag ordinances in Washington state council member O'Brien was a leader here in Seattle to get our bag ordinance and Bremerton. Is on Deck they're getting ready to vote on June 5th. Graduations. Yeah. Yeah, it's break. It's been really exciting. It was we got to the Tipping Point of being able to try to do a Statewide bill. It failed we had enough votes but on the last day the leadership didn't let it come to the floor, but we will be back next year with another one. But in the meantime, it would be great to update Seattle's bag ordinance to be more and have some of the features that were put into the Statewide bill because we don't know what's going to happen and things could happen. You know, we would be great to have Seattle and get on that another area are the to go containers what it mean to update the ordinance but what elements be happy to tell you so we would like to see it go right now the charge for if you have a paper bag or thicker plastic bag to check out is 5 since we would like to see that good at eight or ten cents because the cost of paper bags has gone up in the last 10 years to over $0.10 to 10.5 to 12.5 cents for the end. Anna Grocers so it's very expensive for them and put some of the smaller stores to be providing those paper bags. Also, it would motivate people to bring their own bag more vigorously if the charge was higher than $0.05 and are you confident that stores are passing those costs on to Consumers? We don't know in Seattle, they might be but it was only $0.05 and some paper bags are so expensive but fundamentally weed. We don't we wanted to be more of an even playing field also for the big stores in the small stores. So the Safeway and Albertsons can easily more easily afford this and their bags are cheaper. It's the independent stores like the pcc's in the red apple in the IGA s who are challenged because they have the more expensive bag and they're kind of a lesser advantage of wrong terms of economies of scale. Another issue is fast food. So right now we exempt fast food. The state bill would not and some of the newer ordinances do not exempt fast food and What's our sense of how well we're doing as it relates to enforcement particularly in small stores. I still see a lot of plastic bags in our corner stores going to come back in a few weeks cuz we have an annual report we provide to on exactly that topic. So we're on that together and that's a really good question said a lot of enforcement because we see this is something involving overtime. So we all these things are like recycling. It's something that organically people do more and more overtime. So the second issue are the to-go containers, they are now 8 ordinances in place in Washington state and it. Is on Deck the newest ordinances have it they ban styrofoam and the alternative is compostable. Only Seattle does not have that Seattle is compostable or recyclable. And one of the challenges is is if you have a plastic box that has salad dressing on it that's food contamination. And it's very hard to really recycle a plastic box if it's got that food contamination on it. So there's an area that we could consider for Seattle's upgrade on their own. It's as well as we want to really encourage durables. So people is there in a store to be able to have a real plate and a real real silverware instead of having plastic disposable. A big big issue is water bottles. We are not feeling at this point that we can ask Seattle to ban water bottles yet because of Flint Michigan basically people are not assure that their water is safe and we can't assure you that you don't have lead in your at home piping. Although most people have probably fine water. We just we it's a little tough to go without from a policy perspective. But we are wanting to do is encourage a lot more refill stations. And in fact Seattle Public Utilities just funded us with a waste free grant to do an app to encourage businesses to sign up on the app be on a map and then people they would refill people's water bottles for free and we've course want to go Statewide with us. So this is an exciting opportunity to really get people to bring their own bottle, but not yet go with the regulatory approach. 2 in addition to reducing the plastic the other big thing that we can do is to build and markets and restore kind of who's paying for the recycling and the bill that I'm Seco Jackson Seattle help right and it succeeded in the legislature. It didn't pass as a actual program but as a study bill would be to do plastic packaging stewardship and that would say that the manufacturers and Brandon hers would pay for the end of life of plastic packaging in Washington that would shift the burden from the ratepayers to the manufacturers like they have in British Columbia and like they have in Europe this would make this would be a complete revamp of the system. This would be amazing. So we got to study bill which sets us up for legislation in two years at the state level. It's kind of a state-level type of thing. Another bill that just passed which is super exciting and will really make a big difference on recycling is composed of Italy labeling. It says that if you have something that's compostable. It must actually meet the Standard & B compostable and say compostable on it hears a great example. So these are two Splash tix from a local major company and one of them is compostable and one of them is not compostable and you can't tell me to pass this time. She can take a look. They're very difficult to tell with this law which will go into effect in a year. If something is compostable as a utensil or a bag it must be green or brown tinted. Otherwise, it can be pink or purple but it cannot be green or brown tinted. So this will really help with some of the challenges that we have with people not knowing what goes where and contamination both in both the recycling and the composting stream green or brown tinted if it's compostable, correct, okay. So another bill that will really help the past is the food waste. It's going to call FATZ going to help plan for reduction of food waste in Washington state by half by 2030 right now 17% by ways to what's going to the by weight of what's going to landfill is food waste food waste not yard waste food waste that's kind of shocking. And then finally, I just want to mention that there's a lot of pressure to start to go to waste energy or to incineration for are Plastics. We strongly oppose this we do not want to see Seattle do that. We don't want to send a mountain of plastic to the landfill or to incineration. We really want to have Solutions and then Hondas not going to talk more about that before you never can. You tell me just a little bit about the food waste Bill what what what does to do? So what it does is it's a planning bill. So it's it says it at the state level and then also the local level the county level. Planning for how to actually do the food production and what are the barriers and things we need to do in terms of finances to a deal with the problem. The challenges is that all the food rescue groups don't have cold storage so they don't have cold trucks and they don't have cold storage. So if they even get all this food, they can't keep it safe. So that's going to cost money and we don't actually know how much it is a meeting with the other barriers are so this is sort of the first step towards that path of really addressing the problem. It's great on the whistle a slide to go back one more energy. Yes. So, what are the options to landfilling and incineration given all of these challenges that we have? I think we can the strategies that you identified. Are helpful, but it seems like there are going to be slow and helpful around the edges where I was I think it's from my perspective. It sounds like we have a set of circumstances that need an immediate response so that we don't have to use those other very unattractive Alternatives. I you know when I was 20, I worked to fight and incinerator in in my community, so I really don't want to go back there and but but really don't know how we're going to handle this issue with Turn it up when you go to take her our products anymore. Sure. So there's three or four different answers to that one is things are actually moving quite quickly because of China making their restriction. There's a whole lot of entrepreneurial activity in the United States to address that there are companies that are coming online who are addressing the three to seven Plastics which of the difficult Plastics. So we there's a lot of things are happening quickly. The markets are changing quickly in that regard. Secondly, there is a chemical recycling process, which is pyrolysis and some other things were you take the plastic back to the molecular level and then you can rebuild the resins and make new plastic soap chemical recycling might be a good option and there's a facility already in place in Oregon and one in British Columbia, so we could potentially bring something like that to Washington and then thirdly California just passed and is looking like they will pass a law that is going to really change the dynamic in terms of the packaging what's allowed and get us back to that recyclable. Itching inside of the not recycle packaging so I would say things are actually there's a lot of reaction happen quickly Seattle. I think can be ahead of ahead of the curve on that. But I'm pretty optimistic. We do not need to go to waste energy. You want to switch the you never underestimate the power of the market to respond to changing conditions, Iowa backup before we had recycling in New York state. I was working for passage of the bottle bill in the late eighties and before very skeptical that there would be a market for recycled products again, we proved them wrong there, too. Great. Thank you heather that was great contacts and information and I and I think your questions are very present. And we appreciate the opportunity. I think their questions on everybody's mind like you said with the changes in the market what is happening with our Recycling and how quickly as you just said 10 the markets really adjust or not. We don't underestimate it. But the same time that there are Dynamic force that sometimes doesn't doesn't change as much as you'd like. So I think those are great questions and can kicked us off pretty well and just clarifying is tube and Heather did too kind of major things that are happening here. They were dealing with one is you mentioned is the restrictions in China and especially I mix paper and makes plastic until covering both those Commodities. And as you mentioned it say there's a lot of mixed paper in that and you see that everyday and it and it forces the questions that you're asking like what it what what's happening now and then secondly at the same time there's a And that has another Force that's not directly necessarily related to the China limitations, but it's certainly indirectly related and it's a major factor in kind of power reacting and how our understanding and you see that in the news everyday, you know, we are here Fort Bragg will cover what's happening with our recycling in this presentation as you requested and we're fortunate in our location that we're out of court as you know, and and have the opportunity to take advantage of a lot of markets but not everybody has that opportunity so you don't see it so much along say the West Coast but other parts you see where they might be cutting back pending on what their meeting in the income shifting especially for drop-off location to see that so yeah. Yeah middle of the country or state are the disadvantage. So just for contacts, it's helpful to know what is in our recycling what we're dealing with and this is what our customers put in the recycling what we collect in the blue carts in bins as as noted. It's it's primarily fit over 50 per-cent paper products and then a small amount of plastic. So the total tons per year for are mostly residential customers here are listed in the table. And then on the charger you can see that represent as well. And so when we talk about these Market restrictions were talking about papers. So that's 56% and then the Plastics with it when we have concern about that that's about 5% that I give some contacts and kind of these two big issues and how they impact us. And then also it's helpful to understand what happens to the material when we collect it. And in many of you are familiar with this, we have a contract currently with the facility here in Seattle public as Heather mentioned, there aren't there under a contract that's competitively bit out and last between six and ten years. We pay them to process it. They have a variety of May. Is Heather mentioned first word in many lasers Manny Manuel sorters many mechanical sorcerer's staff, you know, they've ever ride a mechanisms to break all the Commodities apart and then they're responsible from finding those markets as they change and selling the Commodities and adjusting to those market. So that's part of their service contract is to do that and then we'll come back to is that we retain the market value and so that has some opportunities for us and we'll touch on that the city of Seattle with every month and then we retain Revenue equal to those values. So the value of paper the buy of glass the value of metal and we retain that market Revenue each month. The city of Seattle does separate from our processing payment Sol Republic isn't receiving the revenue generated from they received the revenue from what they sell it is and then we ask for the average value of that based on the market indexes until when there's When the markets are worth more we received more and when they were last we receive last like now we can come back to that. Kind of plays and kind of how we're positioned and the impacts on the city. So it's also helpful to understand these challenges had their covered most of this China as you mention in and it was mentioned stopped importing basically makes paper and makes plastic my starred in late 2017 and then escalated last year in 2018. Related to that the market values for paper had dropped significantly. There's other places it's going as well cover, but that that shuj influence on the market that China plays has significantly drop the value where the other destinations are. And in in response to other Asian markets have responded North American markets have responded. And so China is no longer taking mix paper and makes plastic. They're taking some paper directly like cardboard and then they continue to be the largest buyer Downstream. So that's just interesting to know that it's being sorted and processed either North America or other Asian destinations, but the Commodities still going to China cuz they're the ones that need it for manufacturing new packaging for the most part. So they're still buying it but further down stream and so they still have a major role in kind of the value in the commodity and there and they're exercising now. Can't be both days for the most part have stopped importing mix paper and makes plastic. There's very few processors that are shipping mix play for a plastic directly to China anymore. Is that because they can't meet the contamination rules or is it is China saying we don't care how how whether or not you're meeting are 0% goal or not. We're not taking it mostly appears to be the ladder. It's hard to tell and it changes what they what exactly is said by the government of the industry changes from from month to month compared to. The fact remains are not really accepting any right now. And so that's where their stances and what they say their intent is Barry's you know, what is your question a month to month? And I was saying that their prices have stayed low and that all the other places have adopted similar very high standard. So it's not like the stuff is going to another Market. I have lower standards. Like everybody has an elephant has adopted these high standards for their Bales. And so that's happening in other. So everyone's responding to that and then part of this landscape is the response to the plastic pollution. We see that it's a smaller sliver but it's Heather explained it in put it it it it it find its way into impacting the other materials and also that response globally to that has it played into this how it impacts for us. So that's that's just some of the context and then in terms of that market value what that means to Seattle the table here shows you that that are our Revenue received from the market drop from 8 million in 2017 to 4 and 1/2 Million last year and then you see that is primarily relay the paper Plastics did not drop that much Glass and Metal with your locally processed and continue remain stable, but the paper which is the majority of the commodity as we discussed earlier drop significantly, so that's kind of what you see in that. That's what that's what it means. That's what it means for everybody in the world basically in some form. What happened to the facility and Heather text on this in San Francisco similar in Seattle and the facilities here including Republic facility. They had to improve their quality and types, which they've done a diversified the types of paper. They sell and then reduce the contamination in an essay and others have needed to two and a do this they reduced how fast the material goes through the plant they've increased the Staffing at the plant significantly and they've added additional sorting technology just like a dimension San Francisco. They've added additional laser sorters to the ones they had before producing a higher quality of mix paper bell in this case by 1.5 million upgrade for this particular facility here republics, in addition to the they basically rebuilt the plant in 2016 fairly recently. And then Dave Matt other markets, they found to ship the material. So I'll get into that certainly was an area that you were interested in and so I'll come back on that. I'm on What markets and where I roll we manage the contract for the customer here. And so it's our job to monitor enforce the contract terms couple things. That means no disposal of Cialis recycling which is which is something I know we're curious about and sell weave make sure that they continue to move our materials to Market throughout these challenges and that's something we want to reassure our customers that we continue to take the recycling and it gets processed and Recycling and then also we have standards in there for higher-value. So to make sure that I material is processed in a higher Value method into new products. So we have no standards. So we we monitor we get reports on that we track that also work with them on Partnerships. I will talk about hear about our Plastics is now being processed all in North America and we work with them on those connections and to support that and to introduce them to other people. We're meeting nationally and internationally that might provide new markets and then the market risk like you asked about it and we just displayed is giving us some one reason we do it is to self insure basically, like if we didn't take on that market value rest, we would be paying a premium because it's a risky Endeavor. So we will be paying insurance and a premium on that basically and we choose not to and over to 30 years. We've gained a lot a lot of value of the market risk. And today we have a lower value and that is a challenge certainly for us financially, but it allows us a to not pay that premium and secondarily to not enter into a contentious area of contract terms with the Bender. I'm almost every city locally has had to pay additional fees over the last over the last year and Ashley did that matter because of that loss of value in the recycling market. So we've been insulated from that because we own that risk, so certainly a challenge for us to own that but an opportunity as well and it avoids any conversation. About are entering that cuz we already have that so that's been helpful in Seattle. So now most interesting thing where does it go into your expanded significantly and stick markets quicker than we might have thought and other Asian I mentioned already China's biggest fire Downstream. So if you look at the different materials, there's a picture there of glass that has and continues to go locally just down the street to to be further shorted have been made in the glass bottles right here on the duwamish metals stays locally highways has continues to so that's too large Commodities Plastics, which we talked a lot about the higher Valley Plastics have tended to stay domestic. Anyways, those would be bottles and jugs to lower lower Valley Plastics that you see where 85% exported just in 2017. And now it's basically 04 Seattle. I put less than 20% cuz it's changing everyday and as mentioned we worked with the plant to make sure They could find a local market for that which they're doing. They're sending the fire at the Lower Valley Plastics a portion of it to a plant right in Canada. And that portion is greater than the amount we send them. So although they're still sending some and to be clear. We're not the entire feedstock in that facility. So so there's other plastic that are still going offshore and and I won't be surprised to see that change cuz for bride reasons that continues to be a challenging thing to ship Plastics overseas and I wouldn't surprise to see most of it come on Shore paper. The cardboard was 60% exported and now it's dropping every day under 20% and mixed papers was 98% Fantasia and $0.20 to China even in 2017. And now I'm less than sixty percent is 5 out 50% This month is is being so funny still being sent but as they've improved about quality and the prices have changed their finding more and more North American markets every month to ship that too. Number is other places than China. What do we know about the environment protections for there's not enough and and we'll come back around to that. But I yeah, that's I think that's a concern for all of us and we've learnt, you know been exposed to that more and more and so that is an outcome that way and my partners are focused on is learning more about that. So cuz we don't always know enough about where that goes. So yeah, we will talk about that more his presentation. I think that's an excellent question. So this is some of the other things we've done and certainly had their touchdown most of this outside of just a recycling plant contract and our partnership with recycling plan. Big thing was in 2018 or early 2018. We had a plastic Summit with a lot of private and public entities. We focus on some of the challenges that we focused on some of the follow-up actions and I mentioned in Fall of action coming right out of that was moving low belly fat. Text from marfitt from the Republic facility to a Canadian facility. So that was a great outcome in a number of other actions. Never take me on that and then a big thing was the sit-down regionally all through the year last year with Partners in government-industry nonprofits and others to come up with really understanding what the problem is what the opportunities are and what are solutions could be. So that was a big effort to Big Lip last year now. It's moving on to action and I do want to highlight just some of those without getting into too much detail and then it's Heather mentioned were continually involved with a variety of national International Players on this until you see some of the nonprofit's and the government entities that we're working with gun every day to find Solutions. So the recycling task force really focus regionally and comprehensively on what the solutions would be. They came up with these goals to cover the whole spectrum of a recycling in terms of the customer terms of the markets in terms of the system's the demand for the commodities. Commodities look like the manufacturers. So to make sure we are comprehensive in our approach and that was it a team effort throughout the region. Like I said, I'll just highlight some of them there were 20 specific actions with specific time lines on them starting right now and I and some of them that relate to the topic they were talking about today Heather covered. These State legislation was a big Focus right on the heels of of this task force work last year was this was the Washington legislative session and so the recycling Development Center was created and that's very helpful to focus on local markets and in and infrastructure here in Washington Street and technology. So that was a key win plastic stewardship Heather mention this that very strong look legislation was put forward and turn into study bill. We think this is a great opportunity obviously is not to neglect much greater than just Plastics, but this is a good Focus area for a for us to start with and it has recycled-content legislation in there which helps so we're pleased with that. Further items from the Task Force pilot projects on domestic infrastructure, and I mentioned moving mixed Plastics to locate a Canada and will continue to look at additional expansion there. We hear from the poly coated cartons milk and and and Juice cartons what not about opportunities there and what that might or might not look like film had to mention the challenges with film and see how is leadership Wheatley prohibited a lot of film for my wasting a man that helped. We did the color coding thing around the post ability and that helped but nonetheless, they're still film there and regionally there is and so we're looking at what a mite look like to make that more of a drop-off commodity if that makes sense or not. And certainly that something will be coming back to see you then for conversations throughout the year and Beyond local markets. We continue to partner right here in the county with see it with King County Seattle on what we can do to make those connections and then you know, we are aware of the challenges around single-use. And what we can do through requirements, which we've done extensively on foam and straws and bags and what we might do going forward and what and then what we might do with our customer. So both voluntarily in terms of Outreach and then a non-regulatory fashion to to reduce the amount of that low value material in the recycling and then just wrapping up some of the other items that that you might be interested in that from the recycling task force unified messaging we realized as the need to be really clear to the customers in the city out of the city in the region and consistent. And so we have working across jurisdictions to do that. And then we're working on Downstream impacts as well and in some of that's beyond certainly even our action like the most interesting thing was the battle convention recently adopted amended its requirements for countries that are imported materials needing to provide permission for that and and that gets to your question about You really know what happened and I think we're seeing much more from Private Industry wanting to know what's happening and be accountable to it two countries wanting to know what's happening and be accountable to it. So we're going to take advantage of all those efforts around accountability. And then also we are going to work with with the King County to figure out what what we can learn what what's doable in terms of some of that tracking a material and NN stewardship as it goes Downstream because I think that's something we're all curious about and concerned about is knowing if it's going to be shipped somewhere. Is it going to be handled and appropriate fashion saying that this convention will create some oversight and Reporting regulations if if a country is accepting imported materials potentially Nevada convention allows countries to reject material without their permission basically and you're seeing that more and more I mean China is a major world player and they Can write their own book to some degree, but then it some other smaller countries that you know that need that support and so it allows them to set the terms of what they'll accept materials and then yes, it was monitoring in place. I mean some of this you've seen with electronic waste in the challenges of that over the last decade in the Basile convention has provided the framework for that monitoring so and so that's just one mechanism and there's other things and and like I just mentioned the manufacturers are are tuned into this and so they're doing the same thing like you saw that an Electronics like the electronic manufacturers wanted to know. Okay, so I need to own that, you know that that the the awareness and information. So there's a lot of moving Parts there and we're just a small player, but certainly we want to see that And so we can wrap up now but stable packaging in addition to our own stewardship and the state stewardship language were looking for what to partner with many manufacturers to adopt sustainable packaging practices. So we work with the certainly the national steel packaging Coalition. We held the conference here with them and April and so that was fantastic. A lot of players were here a lot of interested parties and we continue to work with them locally and nationally to have manufacturers step up and and make their Commodities their materials more acceptable to our system since were the receiver of the system at least for the time being and so we were going to do it working that voluntary measure as well as we look for also for regional legislation and then just in terms of reaching out to her own customers venues, like this are greatly appreciate the question and we know it's on everybody's mind and it so as I mentioned we're doing this regionally, we have a regional campaign to reach customers and basically remind them to own What's on your instructions in the car to take that second to think about make sure it's an acceptable material in the card and then tend to take a moment to make sure it's empty clean and dry so so that helps a lot. We've seen a lot of opportunity there. And then also we aware that's an opportunity to talk to our customers about a variety of things in terms of waste prevention, but certainly single-use packaging like this brings the awareness that this these materials get handled many times and go many places for just a single use on our part. So if we can take additional measures to reduce the amount of single-use packaging in our lives, it's a great opportunity Heather mentioned the food scraps as well if we can reduce that we see that as well. So we're wearing that. This is an opportunity for us to share that as well. So that's just some of the things that are going on. It's a very Dynamic and and moving policy area for us right now. And so but but some success certainly a lot of his domestic now and so that helps Is there something more that we can do and I understand that a lot of the companies that are producing single-use packaging are not local companies International companies. But is there something that we can do to incentivize locally for local producers the reduction of single-use packaging tonight? You know, I think we'll we'll certainly have continued that dialogue as we come back, you know with producing this kind of packaging. I think that would be helpful for us to get our arms around again the local businesses that are engaged in these kind of practices that we want to discourage. I think exactly I mean we were looking for lots of opportunities around doorables and what can be done in the Foodservice there and I think as we move forward, you know through With you and with executive on Food Service packaging with taking a lot of steps, but there's a lot more steps as you're saying exactly that we can look and how to both Elevate the right practices and require more specific practices. I think I think that's exactly right now of the paper. So China still needs the pulp and this is what the pope looks like case you've never seen pulp so it's not slurry. It's actually dried out stuff that what that is. So our middles and Washington are now taking a lot more recycled paper and they are now exporting that in big Bales to shine up. So kind of processed hope so they're taking it but they're taking it once it's right thing is removed. Hang out of the the task force and the prior to the task force the summit would love to get some materials that identify as I see that their there's mention of follow-up actions for Partnerships tracking legislation and regulation on the summit piece likewise detailed action plan on the task force piece of wood. Would love to learn more in dig in and see where I can help out for is Seattle Public Utilities audit exit report. Good morning. Hello there greetings and welcome. I am Laurie Tisch with moss Adams the exit report. Yes. It is the book end to your last visit exactly. Maybe the big picture of of of what you're here to do and then was taken to the presentation certainly and actually our first page of the presentation is the big picture. The purpose of are audits really to audit the financial statements of the three utilities within Seattle Public Utilities, and these are We work in conjunction with the Washington State auditor's office. So there are no duplication of efforts you'll see when Tyler walks through the areas of oddest Nipigon some efforts that we work hand-in-hand. For example, they audit the cash and Investments of the treasury level the city and so we rely on their work in conjunction with ours and part of that is because the financial statements of SP you do roll up into the city's comprehensive annual financial report. Another purpose of our audit is the opinions that go along with those financial statements are relied upon for the bond issuances that occurred during the year for each of the utilities. Now our scope just as a reminder. We do audit just the financial statements. So we don't get into efficiencies or economies of scale or other areas that might be covered by different types of audits. Management does draft the financial statements and they do provide the supporting schedules to us. And then we take over from there and do conduct our audit procedures as you know, when we came earlier for our planning meeting we walk through those. We did Issue unmodified opinion for each of the three sets of utilities water drainage and Wastewater and solid waste. We had no material weaknesses noted no significant deficiencies reported and we did not provide a written letter of recommendation. So very clean out at this year. Tyler is going to cover some of the the key points of our audit that we hit and then I'll wrap up with the required Communications and some of the larger areas and significant areas related to our audit be high-level kind of working through the slide a big portion of the funds are related to their capital projects in the plant utility plant in one of the things that we do is that is part of our audit is to make sure that cost at the gate that they've incurred are being capitalized appropriately as opposed to being dispensed on the fund and as part of our testing we will reach out and select certain projects and actually meet with project manager to kind of get a sense and an understanding of that project to see if it's the cost associated with the project are appropriately capitalized and that's kind of something. I'll call it a holistic approach. To just get a good understanding cuz sometimes you can get down into the the weeds of the numbers but they're really you have to have an understanding of what you're you're looking at two really ensure that it's something that's correct kind of moving down that one thing. I will say for this year. It was a quieter year on related to bonds as there were no bonds issued by any of the funds during the year, but we still look at covenant compliance. We still confirm outstanding Bond debt with one holders at the end of the year, and we're also looking to see if interest expenses is appropriate for the year as well. And finally as part of our audit and we mentioned this on our our opening presentation of the audit we look at internal controls during the first half of our audit to get it at assessment of the control environment around the funds processes and controls to kind of thing like a checks and balances that they have. So we're looking at different business cycles that they have with expenditures payroll how they close their monthly financial statements their plant their Capital project workflow if you will, I mean that's something that is built in as part of our attitude to get comfortable of what they're doing on the day-to-day flows up into the financial statements. It's it's accurate. We also look at some of the larger environmental remediation liabilities that are out there and looking at any sort of updates during the year related to projects that are out there. So we also meet with project managers that are kind of overseeing those larger environmental projects. And you know if there is a change in estimates which would increase a liability, for example, that's something that we aren't that's part of our assessment. We found that Seattle public utilities are appropriately reflecting those liabilities on their first evening of position at the end of 12:31 2018. We also from a litigation standpoint. We will send a confirmation to the city of Seattle attorney the kind of get a an overview of any matters are contingencies. It might be out there and to see how that is reflected in the financial statements which we were all so comfortable with how Steve's recorded there that results from an operational standpoint. We're looking at kind of revenues that are being recorded by all three funds during the year as well as expenses. We said independent expectations based off of non-financial data historical information and your friends too kind of come up with our own assessment of where we would think Robin and expenses are at and that's something that again we from our expectation and comparing it to the sbu. It was it was reasonable to what they recorded for a 2018 Chevelle closure post-closure Care on the slide. Yeah, so the landfill closure post-closure care. That's that's referencing the solid waste fun and it's relating. It's kind of a unique thing to have fun and not it's related to their some accrued liabilities that are related to kind of the the the the landfill the governmental Accounting Standards Board requires that all future estimated cost that are expected to be incurred be put into your balance sheet today. So it's really an US future is an estimate of all future costs related to the eventual permanent care of that landfill in the closure in the post closure care. So that is recorded into the financial statements. True did last year. Matthew came back to the city council and assisted closure of the South Park landfill and there was a settlement with the state in a private property owners. From the city door SVU Tucanos a 20 million-dollar liability over the next 20 years for the remediation of that property monitoring that are fulfilling the obligations of the agreement that you're monitoring the finances associated with. Well, it's all part and parcel when you are committed to any type of environmental remediation liability which a landfill some what does fall into that category. We do look at the agreement. We look at all of your requirements unique to landfills. The Gatsby actually has a statement devoted entirely this to landfills in the capping of those landfills in the care in the post closure care. So we do ensure from an accounting perspective that all aspects of those costs have been accounted for And the cost for nest 3rd fill the obligations. Yes. Indian kind of moving down a little bit the key change if you will for 2018 was the change in accounting systems, which was affected the in all three funds and we as part of our Moss Adams team. We have a team members who are specifically specialist within an information technology and auditing kind of those it system. So we bring them in every year but especially for this for 2018. We had them kind of look at that transition from the old accounting system to the new accounting system and we didn't identify any areas of arrest sell house cleaned and then finally the management discussion and Analysis. That's the first part of the section of the financial statements and then as well as a note disclosures, we as part of our responsibility we're looking at him and making sure that kind of those State Management statements are representative and in accordance with The accounting standards which is was one of the things that we have done as far as our review of of their statements. So we're required to make a number of communications to the governing body, which we will do right now. The first one the significant accounting policies are continuing to be explained and no one. So if you don't have a whole lot of time to read the financial statements, no one is a good place to start because you'll get a good good idea of the various accounting policies. There were two new adoptions this year Gatsby statement number 75 related to post employment benefits on Health Care subsidies that sort of thing very similar to the pension standard a couple of years ago that liability is now required to be recorded onto your balance sheet. So you have to estimate what the future payments are going to be for the existing retirees. So that was implemented and it was adopted by a prospective or retrospective Leary stating the beginning balance of 2017. So it basically kind of went back in time took into account the past impact put it all into Sears balance sheet and it's all very well explained in the notes the impact or was it wasn't a significant a dollar amount as far as the restatements but it did the utilities did comply with the gas requirement to do that. The second one that was adopted is regarding capitalized interest. So the Gatsby has determined that governmental entities are no longer able to capitalize interest into their self-constructed assets. But because Seattle Public Utilities can use regulatory accounting which means you're able to match your expenditures to your rates. The utilities have decided that they are going to continue to capitalize interest and the the kicker to that is is that you'll just have to make sure that the rate on cases your rate budgets incorporate this interest costs going into the self-constructed assets. So that was adopted this year really know. Change because you always have capitalized interest you will continue to capitalize interest but from an operational standpoint other will have to be some checking done to make sure that that estimate of the capitalized interest gets put into the right cases each year. Of course every set of financial statements contains estimates, and we've listed the primary estimates here that relate to unbilled revenue, which is really just your cut off. So as of December 31st, there's a certain amount of services that have been performed but have not been billed yet because they'll be a building January for example, so there's an estimate on that estimates for any type of allowance for doubtful accounts all the environmental liabilities that Tyler spoke of including the landfill closure and post closure of those are estimates and they're very sophisticated estimates usually helps along with attorneys and engineers and such and we do come behind that and just make sure we understand the rationale and the reasonableness of us estimates and get comfortable with them from an accounting standpoint. Next just to cover adjustments we had no adjustments there were to reclassify in trees and what that means is we just found an item with into the drainage utility wear instead of being a trade receivable that should have been recorded as do from other governments or do from other funds. So it was really just within the receivables category we proposed and they didn't record that reclassification entry. We did receive a representation letter for management. We had no disagreements with management throughout the audit and we're not aware of any consultation that they would have performed. We have no difficulties encountered in performing the audit, but I did want to mention there was a delay in the issuance of our opinions. They were approximately a month later than normal that is because as I mentioned earlier, we work hand-in-hand with the state auditor on certain of the accounts that are audited and we had to wait on the cash balances at the city for the state auditor should perform their work. Apparently there were some delays in the city being able to fully reconcile and get to a final balance of cash. And so we were we had to just basically sit and wait for that to be done before we could finish our work. So as a result the statements were issued at the end of May as opposed to the end of April, which is our normal time frame. Lastly we are independent with respect to both the utilities and to the city of Seattle as a whole. And so as it relates to last year's audit, there were some business practices recommendations. I think an account and information technology just go back and check to see whether or not those were those recommendations. We do. Yes, we do and we keep a running tally of that. There were some information technology points noted again this year. We did provide those to the utilities IT staff as well as the city's IT staff. We've had several meetings with them regarding the disposition of those items most of the ones from last year had been cleared. We had a few more come up this year that I would say again really fit the description of business process improvements rather than control deficiencies. And we feel like they have a good plan to address them. And in fact many of them have been addressed as of today again keeping my We did our work at the end of 2018. So several months have gone by. Well, I'm glad to hear that the operation from spu as strong as well as the financial control thing strong and thank you for your welcome. You can see from are acknowledgements that we continue to be very impressed by the tone of the top the openness to everyone throughout the utility to Auditors coming in because we are very invasive and time-consuming in our request and some of the things that we ask and we really do feel like there is a good attitude in place at the utility as far as being very open and being open to recommendations to best practices and improving to internal control structures. So again, another audit under the belt here and again, it went very well. Thank you. I appreciate the good news. I'm in with that. It's 11:42 a.m. The meeting is adjourned. Sorry for asking.", "end_time": 7558.8}]}