{"format": "raw", "annotations": [], "confidence": 0.9449664043883482, "data": [{"start_time": 0, "text": "Good morning, and welcome to the April 23rd meeting of this civil rights utilities Economic Development Arts committee. It is 9:35 a.m. I'm Lisa herbold chair of the committee. I'm as well as councilman representing District 1 West Seattle and South Park joined by counseling bro, Brian, good morning cast member and we have a start of our of our morning with a presentation from cultural Spotlight and followed up with the items of business as follows. We all have our second appointment meeting of proposed Mariko Drucker Lockhart as director for the office of civil rights and expect about today after a second discussion, and then we will have a discussion only of an ordinance related to the Cedar River Municipal Watershed specifically. Headed to the application of herbicide or Massacre to treat invasive knotweed species. And then finally we're going to wrap up with presentations from each of our Civil Rights Commission on their 2019 work plans. With that, I'll hand it over to Jenny who can tell us about our cultural Spotlight presentation today. Good morning. Thank you so much for having us. My name is Jan from the office of arts and culture and I am doing this morning by Raven two feathers. Hello, my name is Raven two feathers. I am Cherokee seneca-cayuga Comanche. I'm originally from Albuquerque and I am here because of Tracy Ray. She's one of the three people who leaves you out and I would like to tell you about how she convinced me to go to do an indigenous artist residency. So as bubbly as ever and as enthusiastic as ever she tells me hey, you probably should go to this thing. So knowing that it's mainly going to be feminine classical artists. I hesitantly except to mainly in film and I'd only just started passing his mail and when I got into groups of him, then people I usually got group jam with them as female, but I get there I pick up one of Other artists like Hua and turns out when we go through our whole introduction and figuring out who sang in what part of the cabin we go through pronouns and everything is good. We're all not on the binary Spectrum, so it's brilliant and where y'all seem super excited to go home and get started with this residency because we stay up talking till 5 a.m. And then eventually when I wake up the next morning we or I Do you not feel the creative Endeavor whatsoever things aren't clicking for me and I decide okay. We'll just take this little slower than I expected and I go out with like who I am and we just explore Port Townsend, which was amazing. So the residents he was in Port Town. Yes, it was part of Centrum and about how many people how many artists were participating at that point. It was five of us. So we go out and then we come back and we all make our one of many family dinners that week and then we get to go and work on our own pieces together for the exhibition. So I'm working on a road map that it's the most I can manage to work up to which service starts to get me going in that creative process. And then I wake up the next morning and an abusive ex text me and all of those terrible memories come flooding back so I decided okay, I'll try and take a walk. Unfortunately that makes things worse I go back I make breakfast burrito. I try and calm down it manages to keep it from getting worse. And then I and then like whoever comes back from their walk on the beach. And they noticed that something's off with me. They ask me. What is it? Do you want to talk about this? I say no and then immediately start talking about it about all the things that are messing with my creative process and that I'm not doing as much work on the product that I will be submitting but then they come back saying that there is no one piece that you could ever strain yourself over. That would make it worth you losing yourself. So doing as much work as you can on yourself. Is it doing more for your artwork and your art and yourself than anything else ever could be. So supportive environment sounds like uber supportive environment. And as she saying that all of this doesn't happen in one day. I blocked my ex finally and then of course during those other dinners we are able to really talk about what has been following us and really all of us built up this safe environment for indigenous queer artists and finally on the last day I'm able to get the only recording I really needed from my newfound friends and that is in saying the word. Yeah. So really Tracy Asia and separate have been doing so much incredible work for Seattle and the Arts Community here in the Indigenous Community here. Sounds like it was a fantastic experience for you and the other artists. Do you have on you want to share with us anything in particular about you know, what happened post creative process as I mentioned before I did have the privilege and pleasure of attending the the opening as I also said, I'm going to need to get back there if there's a lot going on that day, but I may be just a thumbnail sketch of what folks will experience if they are able to make time to go down. Yeah, definitely because I believe there are multiple right? Well, we have over 200 indigenous artists and I believe over like 280 pieces there at King Street Station while we also have a letter next show at the Vermilion or gallery and we have multiple different curators from all over and we have gas curators as well from throughout indigenous Americas and Latin X places and you can in the show runs through August 3rd and runs to May 4th, I believe. Great. Thank you so much for coming and sharing your experience with us. Then think you're really glad that Tracy Rector was able to have that sort of mentoring and supportive role in your in your process and I'm happy that you were able to participate in this really groundbreaking exhibit. So thanks for sharing that with us. Thank you. Thank you for sharing your personal experience at 2. That's really powerful. Looking onto public comment. We have two people signed up for public comment. The first is a Steven Burke and Then followed by tour Bell. But I'm sticking Buick. I'm the manager of the King County. Noxious weed control program a he says speak in support of a witness one 19502 gotten good. So used to this is about authorizing legislation that will control the Sears. Noxious weed Japanese knotweed which has devastated large areas of the Watershed Downstream of watershed. I am through a community-based long-term if it would now managed to control most of that mutt weed and minimize the water quality in habitat has created. However, it is very important source of stream of many of the initial infestation. So it's very important quotes from a washing scalp respective to control the what does not wait in the in the Watershed the work has been done to this guy has got the knot way down to very low levels and from aphmau. Very important to maintain that level of control minimal amounts of herbicide used by trained Lawson stop riders in largely upon the air is in the Watershed to maintain the levels of control and we reached the Milestone of this project of getting control rod dancing like Washington Without Partners for Tara and it's to you so it's being a collaborative Community what if it has been very successful. So we support the land ordinance herbicide to be used and an API registered a product that what kind of sand is the best tool for the job. So I just added you to give the tools that the staff of this view need to be effective and Saif this works. I thank you very much. doorbell Hi, my name is doorbell on the field program director for the nonprofit mountains to sound Greenway trust and I to meet here in support of Ordinance one 19502 for the use of a mouse appear to control Japanese knotweed in the Cedar River Watershed the mountains to sound Greenway trust has been partnering with the Cedar River Watershed for 15 years or more on Recreation and conservation projects and we work outside of the Watershed on the control of Japanese knotweed and have a great deal of experience with it. The limited use a Mauser pure and the long-term need to control. It is important in the Watershed and is Steve mentioned it very much is this long-term iterative process working down the entire length of throughout the Watershed and this is a tool that has proven effective and that is one that needs to be continued there in the Watershed. So Thank you for the support of that. Thank you. Great with that. We're going to move into the business for today or going to start with item. Number one signal has appointment 01274 appointment of Mariko Lockhart as director Seattle office for civil rights for a term to December 31 2021. Good morning. Instructions, please Mariko Lockhart interim director at the Seattle office for civil rights. I'm happy to once again. Good morning cast member horrible Daniel. Bryan is a great pleasure to be here to reintroduce Mariko Lockhart as as the mayor's nominee to permanently head up the office of civil rights as you as we spoke about last meeting Monica has a long history and an empowering communities and lifting up voices of those who need and whose voices are not traditionally Hardin Community in her to Nora as the Director of the office of the right. She has played a vital role in helping to stabilize the office most importantly to help continue to implement its Mission off of entering the civil rights are protected and that we continue to advance equity in the city of Seattle so that I will hand it over to Monaco. Thank you. Well, I don't have a new statement. I just want to reiterate that. The work of our office is incredibly important to especially communities most impacted by racism both inside our city government and throughout Seattle Community our office play a very important role and has the potential to do even more and it would be a great privilege to help guide this office through its next phase of transition wherever that may take us, thank you. I'm just in a little bit of background for the viewing public. This is a follow-up to the committee meeting on April 9th where we heard some initial answers to questions that council members as well as commute remember specifically folks from representing the Civil Rights Commission prepared questions and on April 9th, we discussed many but not all of the answer to those questions. The council back in 2018 passed legislation that defined some of our expectations for what the process would look like of this of this confirmation. I'm in specifically called out the interest of the council to involve the commission's more than than typically spelled out in in the confirmation process. So that's that's why we work with them to collect answers should this move forward to the council typically prepares and expectations letter. I'll be working with with the commission's as well as putting together by expectations letter and because the mayor appointed director Lockhart as interim back in 2018, that is what led to the council's decision to pass this this ordinance about the process because the office of Wright's is currently engaged in an exercise to make a determination about recommendations for potential changes to the structure and so because of the desire of the council to so to protect that work and honor that work we had some hopes and expectations that we would not be acting on this particular nomination until we've gotten through the bulk of that we can I think we have so that's good and I really appreciate director Lockhart Amex active for working with me on the timing and I'm working with the rest of the staff. I appreciate your diligence and attention to the to the process generally and to commitment to the the people of Seattle as well as the staff in your organization and you have any thoughts Boys come and go at night when excited about the opportunity of coming forward in the challenges Fink leave it in front of us. I think they really interested to hear, the report back in the month or so and I doubt that they'll be a thing you just do tomorrow and it's all good. It's going to be a long process. But I really feel confident and having you at the helm just kind of Shepherds and Stewart that process we move forward to fix your commitment. Thank you, one of the things that you highlighted and that I thought was really helpful is that there are changes challenges at socr for how to advance Equity while constrained by laws that are aimed at ensuring a quality in that you spoke to the fact that there are some limitations to the complaint base model and that you were interested. Didn't support exploring other tools to get at that Equitable. Can you talk a little bit more about that sure and those conversations are ongoing or enforcement team is in strategic planning mode and has had several meetings to look at that issue right. Now the way our system works anyone can come to our office with a a complaint either in person by phone or online and there's a screening process to determine one if its jurisdiction know if it falls within the jurisdiction of Seattle and then really there's a set of criteria to see if it meets the threshold of an investigation and that's really the one tool that we have right now what we're looking at and their other cities around the country that are starting to use other types of Remedies as well is at which stage might we offer and support and facilitate other types of resolution. So There's always the option of conciliation that exists and you know in our process but that comes at a later stage. What we're looking at is possibly as someone comes to us with their initial complaint that they might be more interested in a restorative practice early on and not go through an entire investigation. Those are generally quite lengthy because they're very thorough they involve potentially looking at comparators several interviews researching documentation. I'm looking at every aspect of the complaint and the respondents information and responds so I think it's an exciting possibility. I was recently at the government Alliance Andresen equity membership meeting in Albuquerque and had the opportunity to talk with the folks from the New York City Human Rights Commission, and they are using restorative practices at different stages and they're also interested in exploring. I think this is a new field for for the country really for people engaged in enforcement. So we're looking at how we do that and tap into both existing resources like are alternative dispute resolution team at the city. And also how we might tap into Community Resources as well. That's really exciting. The reason I asked this question is that aligns with some of the work. I'm trying to do with Vice crimes and because of the recommendations coming both from the staff of the office of civil rights as well as commissions. I'm we're looking at whether or not we could work to design a restorative justice approach to those instances. When the city attorney adds a charge of bias on top of the underlined crime that they are already there are already pursuing. So I've been reaching out to the number of folks who do this kind of work around other types of crimes and trying to see whether or not a curriculum could be developed for bias crime. So I'm really excited to work more with you on that. That's great. I think it is a really exciting field an opportunity. Also. I just wanted to mention that as we're rolling out the implementation of the mayor's executive order on anti-harassment and anti-discrimination. We've now stood up a new centralized investigations unit and the office of the employee on bud and so together with the office for civil rights were looking at 1 that there's no wrong door and he complained can come to any of our off. And that together will be coordinating and ensuring that the response is appropriate and supportive to whatever kind of complaint and what the complainant is. Hoping to achieve not only no wrong door, but hopefully also some consistent practices for handling those complaints to go regardless. Okay. Thank you so much. That was the main question that I had his follow-up if there are no further questions. I like to move appointment 01274 by Monday. I really look forward to continuing to work with you. Thank you so much. Agenda item to is Council Bill 11950 to an ordinance relating to the Cedar River Municipal Watershed The Mending the secondary use policies adopted by ordinance 11463 to to provide for the limited application of the herbicide Ms. Pair to treat invasive knotweed species welcome. round of introductions down the line I'm Julia Munger. I'm the invasive species program manager at the Cedar River Watershed. Thank you. Amy LaBarge. I'm the term watershed management division director. Thank you for having us today. I just want to provide a little context to this ordinance request and go back in time a little bit to the secondary use policies for the Cedar River Municipal Watershed that were passed by Council in 1989. Under ordinance. 11463 to 1989. You said 1889? Yes. So this ordinance way back when it clarified the Mission for the Seattle Municipal Watershed a Cedar River Municipal Watershed in and designated the primary Mission as high quality drinking water supply Watershed. It also articulated secondary missions of protecting fish and wildlife habitat and managing for a sustainably and also at that time to acquire additional Forest lands in the Watershed and and protect them for habitat and water supply this ordinance also clarified policies of the first of which was to maintain close Watershed access and protect against trespass for the purpose of protecting the water supply. The second was to continue of fire prevention and suppression efforts. The third was was to advance in education programs uniform. Users of the water about where the water comes from and the unique asset of the municipal Watershed and to conduct research that was relevant to watershed management in the long-term there also policies to protect cultural resources and the what the last policy I'll mention which is relevant to this ordinances to continue a moratorium on herbicide application in the Cedar River Municipal Water shed. So we are here for the fourth time to request exemption to that portion of the secondary use policies and to request exception to the herbicide moratorium for the strict purpose of applying the herbicide am as up here on the invasive plant species knotweed which we've heard a little bit about for a. Of of three years. So that's the context I'll pass it to Julia. Thanks Susie mention. We're here to request the continued treatment of knotweed with herbicide and as appear in the Watershed. We worked for nearly two decades to control knotweed in the Watershed. We started with manual control and moved onto chemical control 9 years ago and it's been really in a girl to the health of the Watershed to continue this knotweed program. So I'm going to cover some of our history of controlling knotweed in the Watershed and why we control it some of the concerns that some of our stakeholders have had in the past that they may have currently and also what we've done to address those concerns. Does any mentioned we do have a general provision of herbicide in the Watershed after we discovered the knotweed in 2002 York for 8 years to control. It Wii controls for acres by digging and covering it with fabric and that was less than a quarter of the known infestation at the time and even though some of the patches shrunk during those eight years. Most of them remained really vigorous and we realize that it wasn't possible to fully treat that infestation using the methods that we've been using some 2009 we came to council and asked for the use of the herbicide am as appear to treat knotweed Andre perceived Authority from city council three times to do that for back asking for a fourth time. He began feeding knotweed since we began treating knotweed with him as appear. We've had a really drastic decrease in the coverage. We estimate there's been a 95% decrease in the knotweed area or the coverage of leaves in that time since 2011. And we've also decreased our use of herbicide. Annually with that decreasing knotweed in the early years. We used hundreds of Oz per year in 2018. We use a total of 10, oz of mouth appear across the 28 Acres that the knotweed is present. So drastic reduction application. Yeah, that only has declined or is it are there other reasons such as the method that you're using for animation been using the same method since we started which is a targeted foliar spray. It's just a decline in the coverage that allows us to use so much less. So we are anticipating a need for maintenance level control. We still have about 5% coverage of knotweed and we think we're going to average about 16. Oz of a year. We think it'll be more than our 10 ounces this last year because we found some really large flowering plants late in the season that we decide to flag and come back to treat later because we want to avoid pollinators. So we'll treat those earlier in the season this year before they begin flowering so you got some large areas or some large plants that we weren't able to treat this year. So the the amount that will be used will probably increase 5% coverage. Yeah, 5% of the entire water should a 5% of the area of our original 28 Acres of coverage as to leave decrease by 95% Sweet multiple reasons why I've been controlling knotweed in the Watershed and some of those are ecological. We've there's some major water quality impacts that not we can have on the streams. It causes of erosion and reduces riparian vegetation and it limits habitat and all of these issues can end up being really negatively impact full to spu's drinking water supply and also the habitat that we have especially for are listed salmon species that are in the Cedar River. And we've also got Civic reasons why we're controlling knotweed. It's legally required to control along the Cedar River and we also have Partnerships with our Downstream groups including for Tara and Kane County who came to speak earlier and these groups have also been controlling knotweed along the Cedar River for over a decade and we worked closely with them to coordinate our treatment down the Cedar River and real using very similar approaches to our methods and a critical piece of this coordination is maintaining are Upstream work as Seabrook mentioned even a small fragment of knotweed floating Downstream can reroute and cause a new population of knotweed. So controlling this Upstream work now that we've cleared all the way down to Lake Washington on the Cedar River is really critical piece to this success of our Downstream partners. Classification of the of the work below below spu's control area blue annesburg is it had similar success where there's just a fraction of its last a minute. It's been a few years since I've been out there but I remember seeing large patches in various places along Sarah and unprompted, you know, not telling them our experience. They shot back almost the exact same numbers of about, you know, a 90 to 95% reduction limited recurrences, but still having to treat year after year these plants have a really large root mass. And so you might treat one little plant on the root mass but under the ground, you know, there might be another one that pops up the following year. So they've been experiencing almost eerily similar results. So it's it's a very consistent all the way down. The cedar has been working a lot with private landowners along the Cedar River and its required by Kane County for control. So they are required to comply with an option to decide they want to harvest knotweed is a cop or something. And then do we have any more at least when we did the first of these ordinances I bet the infestation of knotweed wasn't that silly along adjacent to the river a lot of it was planned and then we have a sense of how it gets there and drop pieces or how did it happen? Well, there's certainly Areas of the Cedar River Watershed that used to be occupied by people there towns in that sort of thing there in those towns have since ceased to exist but some of those ornamental plants remain also back, you know, 20 years ago before it was really recognized as a problem. It would get mode frequently. And so those small fragments would get distributed all over the place. And so some of that is a little bit fire on doing before anyone knew any better. So they're certainly patches that are roadside or in more Wetland areas, then directly along the Cedar River. I would say the majority or a good portion of our knotweed infestation is beyond just stream Banks. So I'll continue on we've been understand also that the public might have concerns about or herbicide application within the Watershed. We've really been wanting to address the community health concern about a massive hearing how it impacts human health. So am as a peer inhibits an enzyme that's only found in plants. So that impacts to Animal Health and that includes humans fish and pollinators is really minimal as to you work with the toxicologists at Washington State University and his analysis showed that even a fairly large amount of herbicide that accidentally entered streams would result in negligible amounts. If it ever reach consumers TAPS in his analysis was six cups of herbicide Which is far more than we use in a given year at the stage and that amount was 60 million times lower than the no observable adverse effect level four. Child cells and low and so this that six cups level that is Way Beyond what you use and it's also and what you use doesn't make its way into the water, correct? So we recognize that impacts to pollinators are also a concern and we've made a point to prioritize the health of pollinators within the Watershed even though. Target's enzymes only found in plants. We avoid spraying of pollinators are on a plant and we flag large flowering plants to come back to to spray later rather than treating them while they're flowering. Both of those methods are consistent with King County. Noxious weed guidelines, and we're also helped by the fact that the majority of the plants that were treating are very small regrowth and most of those don't produce flowers and you'd mentioned earlier are Downstream Partners. Do they also follow the practice of not spraying when flowers are present. That's cool. That's my understanding. I know King County is really work to adjust their guidelines in the last 2 years and the policy is to avoid while pollinators are present. Sometimes they're spraying outside of the pollinator patterns sew in the morning or in the evening when pollinators aren't active. Is it another method that they might use we have so few plants at this point that we have the flexibility to just completely avoid plants while they're flowering at all. So it sounds to me like you're saying some of the other people who are doing this work don't consistently do a plant by plant observation and avoid spraying when their flowers some of them just do it at a different time of day. yeah, I think for the most part they've tried to adjust for the larger plants to a Time of the Season when they're not flowering but there's also evidence that shows, you know, the herbicide drives within a matter of minutes and so being able to avoid the time of day where pollinators are active has been helpful to them, but I'm not entirely sure of all of their practices and their practices are governed by King County policies that Yeah that they have a guideline that they've produced finally recognize that there might be concerns about a magic are getting compared to glyphosate witches getting elevated to a tier-1 pesticide by the city and it's also recently been in the news of the subject of lawsuits are restricted. Use pesticide pesticides are classified as Tier 1 pesticides in the city and that includes a math appear. However, glyphosate in the past has been less restricted because it's been readily available to Consumers and project products like Roundup and so the elevation of glyphosate to a tier-1 or beside is essentially the recognition by the city that that herbicide is not as safe as they once thought and so are beginning to use higher precautions for that love herbicide in the city and those are precautions that are already in place for a firm ass up here and we've been using Those precautions to limit exposure to the environment and tour applicators. There's also differences between am as a peer and glyphosate even though they're both used to treat knotweed. We originally chose to use am as a peer over glyphosate in the Watershed because it's less harmful to animals and glyphosate and also more potent we end up having to use a lot less of it than the glyphosate and as it relates to elevating glyphosate to hear one. Is that something that is contained in the ordinance or is that done outside of the legislative realm and done via internal policy? This is a Citywide policy that's outside of our current ordinance. So but I'm assuming that there is some sort of a guiding document that defines what tier 1. Products are in what's the what the restrictions are for those for those products that yeah that the city has an interdepartmental integrated Pest management team that's currently working to revamp this and I think the glyphosate issue really cause that was sort of the impetus for this. Redoing of our tiered system. And so the team that I'm also a member of is really taking a close look at all of these are besides that the cities using and coming up with New requirements for why each herbicide is in a different tear it would be great to get some background on the scope of that effort. How many different products are are are you looking at? How many are currently tiered and sort of what the what the approach is of the of the team and that the timeline for it to be our interesting facts? So we're we're dedicated to making sure that we're protecting the environment and our citizens when we apply herbicide in the Watershed we've been doing this by Insurance water quality is monitor that we're getting pollinators and also that are applicators are staying safe. We've tested water quality during or not. We treatment since 2010 and we found very limited detections in our samples. We've detailed all of those previous actions in our 2018 knotweed report last year. We developed a new water quality sampling protocol that had zero detections in 2018 to protect pollinators as I mentioned before we're taking care to avoid spraying knotweed when it's flowering. Even if it means skipping a patch for a year. We've also replanted areas previously infested with knotweed with native plants to attract are native pollinators. I'm also making sure that are applicators are protecting themselves and environment by wearing protective equipment and also applying herbicide in a very targeted manner using handheld sprayers. So during or nine years under these ordinances, we've had drastic decreases and not weed but we really feel like we have to keep going on this path to maintain the success as I mentioned at the beginning of a presentation. We've had an estimated 95% decrease in our knotweed coverage since we started herbicide treatment, but we do still have some left and it has been known to grow back to pretreatment levels if it goes untreated. So we're anticipating the need for maintenance level control and for a thinking that that's going to be about 16. Oz is a year and ultimately our goal is to eradicate this weed from The Watershed. So so maintenance level control. Is that a different is that something different than what you have been doing? I didn't say at this point. We've kind of reached I think it's we've been decreasing ever since we started and now we're at this level where we think we might start keep seeing me a sort of pop-up populations for be no potentially multiple years as these large root systems just kind of fizzle out. The research is really unknown at this time. The treatment of knotweed is a relatively new science and we're constantly using the best available science, but that's evolve and we found as our partners have also found that We're kind of at this stage where we just have to kind of keep going back and you know, what kind of like putting out little pop up fires. So you refer to the goal being mean to eradicate knotweed Can we do that in three years and is that the eradication of knotweed is that different that measurably different than your identification of an ongoing need to serve watch out for the popups until the root systems atrophy write our goal of eradication is not necessarily in the 3-year timeline for this ordinance. We honestly don't know how long that might be. We've talked to multiple other people that are experiences experiencing the same thing but it is you know and radication from a noxious weed standpoint is considered five years with no detections, and we would really like to get to that point. I really appreciate the young work and how he is approaching this. So it's obviously frustrating to see invasive in persistence species like. Weed in our pristine Watershed and I know when when I was part of conversations with both environmental Community spu 078 years ago 9 years ago, there's a lot of sensitivity to you know, are there better ways to do it, you know, can we bring in goats coming to get up and the consensus of the time it wasn't unanimous but I think was it that this is a serious threat and the risk of not getting it right and allowing it to expand was greater than the potential risk from using a herbicide in there and it was just some kind of trepidation that I moved that direction. But I've been really impressed with the seriousness which which spu is taking on this work and it's great to see that we're continuing to see a good a smaller population. It's it's rough that it's been 9 years and we're still you know, we're going for another three years and it may be a few more Cycles, you know, hopefully not indefinitely, but we're clearly trending in the in the right direction and the dedication and kind of focus on minimizing the amount and the impacts on on both animal and human health in our water quality. It's clear that everyone is taking this really seriously has opposed to just hey, they gave us permission. Let's go out and spread like crazy. So I'm really grateful for that and I'm deathly supportive of this and look forward to the day when you're here saying we haven't seen that weed anywhere in the Watershed for for 5 years. And nor has it been up and down the Cedar River. That would be an amazing day. I look forward to that too could work on the 95% reduction. Thank you as well for the the work in the 2018 report. I know many of the items that were identified by a previous Council to be addressed in that report. You you've covered well related to some of the concerns that identify prickly around pollinators and literature review and just an echoing councilmember Brian's words that were really glad that you're taking it seriously and doing this work with with great care to all of the different ecosystem components. Oh, thank you. So I'm open to boating on this today if you are. Agenda item three is Seattle office for Civil Rights Commission 2019 work plants. Okay. Thanks. Thanks for counting. Number of Brian is hopefully getting an additional chair. There's one I think is available. I think we're good. Welcome everybody really appreciate the annual visit on the work plan. If we could maybe just start off with a quick round of an introduction to the viewing public and hear everybody who's represented here. And then we'll we'll hear from each of the commission's individually. I want to also thank you for compressing. What I know is a lot of plan work for 2019 into digestible presentation for us though. Sochi maykovich coach of the Seattle women's commission Mar to eat a wolf Seattle office for civil rights Jason Morris commission for people with disabilities commissioner. Christiana Ave Sumner co-chair Commission of people with disabilities Katrina Sanford co-chair for lgbtq commission commissioner for the lgbtq commission Eric gray commissioner for the Human Rights Commission petastic, thank you who would like to kick us off? I would all right. So I'll just go through really quickly. We have four different committees. So the community health and wellness committee. This is for the Seattle Seattle women's commission. Yes, I'm sorry development economic education opportunities and violence prevention and Jessica Simpson. Look at some notes for my phone. So overall like our multi-year policy focus is going to be at promoting stable housing for women and families a little bit of what that specifically is going to look like is kind of dependent on what the state legislature is doing the eviction Reform Bill, which we Through our eviction report that we released last year is really close to being done. It just need to be concurrent in the Senate. I'm not I'm not saying it all the way down yet that needs to happen. And then if that does happen then I think whatever other policy recommendations we didn't get in till will probably come to y'all about and then as far as for the other pieces, we are an I was planning. I was not planning on doing the sofas a little rough. Sorry, so then I'm moving out and that's it in the Equitable development committees focus and then also for violence prevention and Justice we're going to be doing a lot of work around domestic violence in particular and looking at how to advocate for continued funding and we're also looking at Bring a report with the King County Bar Association on protection orders. That's still in development then for Community Health and Wellness. We are going to be focusing on maternal health issues in particular the maternal death rate for black and native women and then for educational for economic and educational opportunities are the big Focus. I think will be childcare and supporting efforts around making child care more accessible. Partnering up with the King County Bar as it relates to the prevention and Justice project, I think. The commission joining forces with an entity that can help identify with the problem produce data about the problem and use that those reports as a jumping-off policy for for policy changes a really really good model and it's certainly proved to be successful as a relates to your eviction reform work this year. Amber Bryan I'm excited to get to session and get to work. where to yeah, so that I mean when when we do get through session, I think it will be important to have a conversation about the remaining policy recommendations and how to move those forward. I think the last time we had a discussion about the eviction reform work. We did a fairly Transparent job with the assistance of central staff of identifying the items that we thought we're going forward in the ones that didn't look like work contained in any of the pieces of legislation before the state legislature. So I think we've indicated a likely path for folks who are watching the that that progress and I look forward to having more conversations here in this committee and then just really quick. We also really like doing events and we're doing we're doing an event with both your office and counselor Gonzalez is office on the 24th, which is Thursday. I think yes at 5:30 around Sexual Assault Awareness here in and it's denim day. So wear your denim tomorrow. Alright, I appreciate it. Chicago so since our work plan is up there. I think maybe we can go next time. He'll lgbtq commission. We had some changes occurred this year where we decreased many of our committees, which has been super helpful. It's been able to help us convince our work and be able to really focus a little bit more on the priorities and with that we've also changed with two-year work plan instead of a one-year work plan our goal and the commission is to make sure that we are ensuring that trans Justice and racial Equity is a lens that were consistently looking at the work that we're doing through. We definitely want to prioritize those marginalized communities cuz I think we're all the way of many other difficulties that come with being on the person of color or someone who's trance in in our community. So that's first and foremost, but I'm going to chat a little bit about the Committees that we have now, and then I'll move it. What's my other Commissioners to to chat as well? We now have our commissions operations committee, which is still what we had before this committee is the heart of our committee it helps to stay organized to end and that's very good that I'm sure we're all aware. We have a people of color stakeholders committee. So that is very much focused on making sure that the voices of people of color are heard but also were reviewing current policies and practices of creating an affirming Equitable spaces for people of color. So that's it. That's a priority Express and we're very excited about that. We have our social media committee and Communications and they're really going to leverage our social media to make sure that the word that were doing and that the people that we're doing the work for being Amplified to our social media and addition. We're going to start spotlighting lgbtq leaders on it as well so we can come and get the word out about what people are doing around the community. And then we have our community outreach and engagement committee. And this committee is going to advocate for our population the lgbtq population by serving as a hub or conduit of information and resources, which we find as important as we've been doing our work at it appears that either the information is not in one place, which is difficult. And so we want to be able to do that for the community. So people can just come to our website. Oh, I need lgbtq restaurant. Boom there. They are. That's where the thing. So then I pass it on emanuela to chat a little bit more about what we're doing. Thank you. Hello, good morning, everyone. So I'm going to be reviewing the second section here on advocating for queer and trans people of color housing an inclusive lgbtq homelessness services. Probably this is 2016 where the rainbow Alliance was created and in partnership with the lgbtq commission at the time. I lied through with a culture of the time Lulu Carpenter and this Alliance is an organization of two spirit black brown disabled fan gender-nonconforming indigenous Pacifica queer trans people of color and we are honoring the experience at the experience and portents of Storytelling and collecting stories of resilience from these groups. And so this effort was sort of a response to the 2010 lgbtq commission survey of the community what was found in the 2010 snapshot survey was that the majority of the respondents were white the majority of the respondents were cisgender male and the majority of a response respondents were identifying Game and it's Reno. Now. It's at the community is more diverse than that. And some questions that the group is proposing and trying to figure out some answers to would be how do we decolonize research? I know that in some committees last year Sun City Council committees silver referring to it a 2010 snapshot survey of the lgbtq community and how do we focus on strength based approaches versus deficit? The second bullet point here. It is a continuing relationship with the human services department when example of a current relationship, is that statement of legislative intent workgroup to review the contract of shelter services. And I would hope that at the end of our commissions presentations, we would revisit the cross commission homelessness task force. I remember councilmember O'Brien refer to as the super commission. I know that from Q3 and Q4 of last year. There was a lot of transition in the commission's instead of Representatives at that time or no longer with the commission's but we have at least one representative from each commission here at the table. So maybe we can revisit that I can spend a few minutes kind of reviewing 2018 highlights and we can start the visioning process here today for 2019 and 2020 before you move on to the next bullet. I do want to just check in with you a little bit take this opportunity on the participation on the workgroup reviewing the shelter and Human Services contracts. I was recently informed by hsdd. But they were not going to make the deadline at the council had identified for a report, but I was very encouraged that the reason why is because they are entering into a contract with the Ingersoll to guide the discussions as well as developing the report and just this is a good opportunity to touch bases with you and find out whether or not you're feeling that were moving towards a productive discussion and set of recommendations that will improve people who rely on our human services department a quick response to that. We are on track on the extension granted us Grant at the work group the ability to further Engage The commission's since the lgbtq commission was sort of presented with this. With the pretext of the initial deadline which was the end of this month. I believe what date did earlier this yes and end with extension. Their goal is Anna's light without lines in the statement of legislative intent Visa documents that will be needing to be shared throughout the Civil Rights Commission spoil their input as well. So this is would be a kind of like the first project of the Cross commission home has his task force is to identify some areas of concern and some gaps in these documents for shelter services for the community. And then lastly again is to build relationships within the alliance and other queer and trans people of color, like coalition's to further strengthen our race and trans equity lines. and now off to khary great. It's my pleasure to present the third bullet point area of the lgbtq commission work plan. And that is to increase accessibility access and better Community relationships in general. We have a several strategies for doing this and one is to hold general quarterly meetings in the community outside of City Hall more in the places where our community lives and works. Secondly Katrina already mentioned less is to produce and post videos of people of interest to our community and to have a very diverse array of individuals who can talk to issues that are of importance to the lgbtq community. Along those lines. We are advocating very strongly for better technology for our commission meetings again to make sure that people can virtually if they cannot come individually accessibility issues. And then finally we were we were quite delighted to to see the satellite reentry work group final report, which was commissioned by this office for civil rights and end. The final report came out in 2018 delighted to see the move towards more social justice and away from Criminal Justice solutions to social problems. And in particular, we are interested in and amplifying the the recommendation to repeal the prostitution loitering ordinance. This is issue of prostitution and sex work is an issue of great importance to the LGBT community for all kinds of historical reasons. We are disproportionately located and and the sex industry and so we are working quite closely with a sex worker Outreach project. There's also a cola For the rights and safety for people on the sex trade who is a great Coalition of anti-violence workers a human human rights lawyers and so on and we think that we are in a position right now to to create a greater Coalition across race trans and coaxing books of color have communities around these issues while not explicitly under their purview of the queer and trans people of color stick along the lines of the Seattle re-entry work with recommendations. There has been a partnership made with the Human Rights Commission the trafficking committee the traffic in human trafficking task force, and we are trying to collaborate on the formalization piece. But additionally I have the Seattle gym teacher commission has been attending the Seattle youth And meetings and I know that I have highlighted from the re-entry workgroup recommendation. So I decided to 5 which was reimagining the city's use of jails. And so this could be a potential collaboration with the Seattle youth commission particularly if the city and county schools to reaches zero use of Youth detention and particularly highlighting the three entry workgroup recommendation of creating an Advisory Board. I'm highlighting 4223 internship positions from the Youth Employment Program and perhaps an additional recommendation would be to increase that and Seto one to include Seattle youth commissioner to participate in this Advisory Board. I think as it relates specifically to the reentry task force recommendations, you mentioned some legislative priorities that came forth in the recommendations as I mentioned before I I think before we can have a conversation about the legislative priorities. We really have to have a very very Broad City Wide education conversation. I just remember the response. I got from people who received my newsletter when I pushed out the recommendations and people don't have a really good understanding of what the lawyer in laws are and so I think it's really important to be able to clarify a particular in a climate that were in right now around public safety issues to really have a broad-based discussion and seek seek agreement that the loitering law. Are not very much used and removing them from the municipal code will not prohibit the police department from enforcing using other methods to enforce laws related to those issues of of illegal substances and sexual exploitation. So, I think there's a lot of groundwork that needs needs to be done around that but I'm wondering if you would consider a request from from me as it relates to the budget process which were coming up on soon to highlight which of those recommendations might have budget applications that we could we can work on champion in in the upcoming budget process. Yeah, you must have been telepathically communicating with me because of the Cross commission kind of a review and projection for 2019-2020 would be a partnership in the budget cycle process. And also I appreciate that request very much happy to come Advocate or talk to whatever committees that you would want me to and on behalf of the commission. There's also a survey that I've been analyzing that comes from the Coalition for people for the sex trade. So we are collecting empirical data, which I think would be of great interest to the community. That would be happy to help her son. Great. Look forward to learning more. Good afternoon, and thank the council for their time and letting us speak. We also going to a biannual work plan. I think that will help the commission stabilize our Direction and work together and be a team as a whole it's our job deals establish full membership while promoting a culture of intentionality respect collaboration engagement and cohesiveness. And I think everybody is on that same page one are bullet points up here is inclusion development and Outreach this emphasized recruitment. I tried being diverse candidates support individuals through nomination and onboarding process to the commission. bridging gaps between the disability community and institutions and community community organizations of all type One of the things I want to mention is that we support the OC. Are we going to be working together with them with the nominating in orientation committee and the membership like to me as chair of that and we are so impressed by director of Lockhart. Soul Eater has been very instrumental with our work. Some of the committee is going to be doing is sitting out applications to candidates answering the candidate questions as a commissioner do in 101 on with future candidates. We will provide information will provide information on interviews alone. And in in groups will also going to be supporting holding hands and walking applicants to the inner. Interview process this includes checking in every two weeks after the primary interview directing candidates to correct information send officials to make sure all the lines are completed in the central paperwork in dates are included in done. We're also going to welcome and Duo onboarding process to the new appointed Commissioners. We are building an onboarding process for future nominees and and Leadership succession planning for the commission VSS the nightstand the criteria for official information and guidelines of the commission and our duties with OCR as well as the council and the mayor's office. We're also going to be assisting can understand the current work plan on boarding a new nomination. I'm in the areas in the roles that utilize their individual strengths and collaboration in the commission and then assisting guidelines newly appointed Commissioners with questions throughout the first year of the Commissioners work and help assist any reasonable accommodation that they may have in the commission. So I pretty good package and Domino's Christiana has anything to hide and it's been a pleasure working with you before I just want to say I really appreciate the fact that there's a lot of internal Focus that you're devoting time and energy to with this commission. I think it's really really important that people feel supported through the nomination and onboarding process and really appreciate the extra care that you're taking with that insure. Thank you so much. So the two last thing so they'll work plan and two to that point but I will Woodall will say is that you know of this last year. We had a lot of folks alert Exodus. Please have some issues within the commission. I'm open I am okay with it being that your office is known as we've spoken. I've been working with office of rights as well as some of the other Commissioners I think coming to this work plan was it was a difficult process. I think it was a really generous process is a transformative process and I am hoping that throughout the operation of this work plan the nominating an orientation committee and there's some of the other support that we received from off the civil rights as well as city council that we will be able to be a stronger more collectivistic commission. And that's been my charge says being elected coach her. The accessibility and you know, each of these the commission has a hole with a nominating orientation committee. We are kind of under these like four buckets with leaves of committees, but we're also trying to have it be more of a fluid process where we work we're working together to accessibility is so is going to be chaired by my coach Eric and Kita who's the commissioner who's here in attendance with us today is going to see how we can enhance a full participation throw increase access in for Universal use of communication and information. Will you put it down to the areas of housing education Transportation, but of course, there's a lot of different areas where it says ability and Universal Design can be implemented just within the commission itself, but also within the municipal government holidays station is past and also, how are Community operates Which leads to the intersectionality peace, which I will be leading that charge. It has been a passion of mine since I've been on the kids mission in general intersectional disability disability Justice seeks to hold the entire person and so intersectional erase year is this idea that when you have intersectionality of multiple oppressed or are privileged identity is that the ones that you wear the most out loud are the ones that show up and then the ones that you don't wear as much out loud kind of Fall by the wayside are erased my experience of a specifically is physical on the intersection of gender race and disability and especially having multiple disability. So people might see the narrow diversions, but they may not see the chronic illness for example, and you know working as a rulemaking for i-944 example of the state level is coming out. There's more of this conversation around, you know for a good example of race rules. Training around issues leading with race training on issues leading with disability in training out issues at the intersection of race and disability because charleena Lyles Freddie gray and John t Williams in their memory should have that analysis of training with intersectionality though. The main thing that I've talked about that I think will be really important is to work with office civil rights as well as yourself and the other and other members of the council around looking at the race in social justice initiative to see not only if there could be if it could be perhaps transform into an ordinance for greater accountability structure. But if this racial Equity toolkit could perhaps become a social Equity tool kit that leaves with raised but also holds the entire purpose of person so that legislation and decision-making could be as affordable as possible without it being Silo tour homogenized only to this one Constructor price. I can't imagine another person better than you to leave this work. So thank you for the aspirational goal that you start working on driving us towards and I'm really optimistic that we will be getting some recommendations from the the red team that will produce a blueprint for how to how to implement some of some of those aspirational goals. Alright, alright, turn it over to the Human Rights Commission. So I wanted to just set the stage a little bit about our commission this time last year. If 16 members this time last year only two of us on the commission. So we've added 14U individuals to the commission and I think that was a welcome change the energy of the new vision that my colleagues have brought in has really transformed our commission and we've decided to with all these new ideas take a more holistic approach to our work. So that starts with one taking a two-year plan which other commissions have done as well because it allows us to take a longer-term. Look at some of the issues that we're approaching. The other piece is really trying to send her our work on accessibility and accountability and that started by us having our first commission meeting out in the community. We had a meeting in April at BSR Terrace and their challenges that come with that that we're working through but that's the first step that were taking. I'm going to turn it over to my commission members to talk about the three task forces that we have specifically focused on homelessness challenges and also on traffic in human trafficking. Alright, so first up, I'm the chair of the homelessness subcommittee. And so we in general have four areas that were to come work in four goals one is having a very of sweeps and decreasing them we have heard from this is probably the most important thing that we've heard a community is that these sweets are very opposed by Focus preaching homelessness increased access to a debased and also based on our experiences hooking us Highland porn. Number three is increase in early intervention Outreach to unstuff individuals. And the number for is increase coordination with workstations help disseminate best practices. And so those are what we're trying out with those are but we're working on Use Waze such as a budget process and also we are being very intentional and how we are to help make me really ships and being in community. We have met and talked with folks from real change and other organizations as well. And we're planning more to the Outreach of that sort to make sure that we have what people are interested in as the center of our agenda. Thank you specifically to the issue of removals as you all know, my focus has been on Watch dogging and reforming the process that the city uses currently to ensure that the city is following the protocols that placed an emphasis on and removals and locations that meet predictor criteria and they're largely criteria criteria around around health and safety and is part of that watch dogging of the process. We've invited the city auditor to do a series of reports on particular benchmarks that the city auditor has identified that if the recommendations around the benchmarks by the city auditor are addressed that we might see better outcomes both for people who are living unsheltered as well as the people who are living sheltered in homes surrounding those areas. so what if you haven't received a briefing from the city auditor on the recommendations that they've made thus far it would I think I'd be happy to facilitate that but I think that audit is one of the most powerful tools that we have for reform and to the extent that folks on the super commission can work on some of those those recommendations. It would be really helpful. Yeah, I think we've been in talks of a chesty about a breathing like kind of like what your type of the city auditor the shattered sounds great. And actually just a follow-up on that. We do appreciate the support that your office has shown in particular for keeping disability on the issue particularly as it relates to this week's which has been kind intense issue. So, thank you. Was Richard I'm a member of the Immigrant and Refugee task force. Largely our work focuses around keeping Seattle's accountability as a sanctuary City for immigrants and refugees. We have a lot of work to do in that area. And thankfully a lot of work is being done by other coalitions and Community organizations. So our work has largely focused around not Reinventing that work but creating a cross Community Coalition. We've been inviting several members of other organizations and Community groups to our meeting. So almost every month. We have a visitor this month. It was one America. There are several people on the roster that sort of come through tell us about their work and how we can sort of holistically support them through the lens of the of the cities of the city at using the city at the lever to help them and support them in their work another Firework plan that came up throughout the commission was the aspect of Storytelling and how we can best support communities without doing sort of top-down reorganizing on their behalf. So storytelling was a way that we identified to uplift voices that need amplification without planting our own lens on top of them. So for our task force in particular what that means is the launching of forthcoming podcast, which is like a storycorps style podcast which includes community members from The Immigrant and Refugee communities to I mean literally unadulterated just tell stories that will be releasing on in the coming months. So we'll keep everybody updated on that another seem for our overall commission that we transferred to our task force is the theme of corporate accountability. So we are sort of a longer-term approach for us is to identify ways in which we can collaborate with Corporation. Is to enhance protections for undocumented workers create more citizen-led Pathways to sponsorship of individuals and decrease barriers for employment. Learn more about that will let you know. Hi, my name is Eric gray chair of the human trafficking task force for the city of Seattle Human Rights Commission my prepared a letter alongside with people who have been in currently engaged in the sex trade and Commercial sexual exploitation. It's been better through a variety of communities from indigenous Nations the Healthcare & transgender Community use by are those who identify a Survivor leaders in those communities Rights Commission has heard and review testimony Honore have issues from survivors of human trafficking in the nonprofits that support them after some deliberation information of a human trafficking task force who proposed the creation of protected class on the office of civil rights additionally recommend the creation of Wall-E full-time off of civil rights top position with $600,000 a funding support the needs of human trafficking survivors and coordinate efforts locally fire lane with indigenous Nations set of leads the nation in the number of murdered and missing indigenous women and girls with 45 reported cases and this issue remains on a dress. 2016 report by the urban Indian Health Institute claims that out of 5712 missing and murdered and missing and murdered indigenous women and girls only 116 those 5712 or log in the Department of Justice database out of a study of missing and murdered indigenous women girls lacrosse Avenue in cities involving 506 reports 39% of the victims involved in the sex trade Bristol paid at the time of their death patient protection class was support for housing Legal Services similar to mestic violence with start the process was addressing dire needs and Indigenous Community give me traffic in affects all genders classes and cultures of people in our community Warriors 2008 study asserts an estimated 300 of 500 children are being sexually exploited in King County every night the 2014 Arizona State University report finding 6800 Byers soliciting sex online and Seattle within one. 24-hour. This is an issue that impacts all of us youth lgbtq people color and those experiencing poverty are most vulnerable trans identities experienced discrimination in Marshall station employment education housing in accessing Emergency Services, the u.s. Trans survey for Trans equality found in 2016 at 81% of transgender children have also experienced exploitation. Janet mocks book redefining realness describe sex work as a rite of passage the trans Community currently. There is one bad in Seattle that supports non-binary intersex transgender identities. All some shelters do support transgender female identities clients off in request transgenders, headed programming and a safe place that doesn't currently exist very much outside of the limited space at end of Justice League. Creation of a protected class was so to allocate more resources to combat issues the transgender Community faces to the bottom line issue and Rachel power divided within human trafficking or extensive Bell Richie's online university producing demand for the commercial exploitation of children of minors in your community. May 2017 report asserts on one hand in King County 52% of all child sex trafficking victims. I block the bocce ball only comprise 7% of the general population on the other hand buyers are 80% white males to tend to have higher socioeconomic status of education and oftentimes employed at major companies in the area or we allocate millions of dollars for the creation of Youth detention facilities. There is zero beds available in the city of Seattle for children experiencing human trafficking creating upgrading a protected class serves to narrow the racial Equity divided and break the school-to-prison pipeline. C7 Human Rights Commission demands the needs of human trafficking survivors be mad. We proposed the creation of a protected class for human trafficking survivors out of the office for civil rights with one full-time position to support. This is $600,000 in funding we call for this to be applied to the stage next budget cycle called for the creation of safe and tangible housing options for transgender people call her man immigrant refugees in child human trafficking survivors. Thank you for that. I look forward to working with you on those recommendations. And I think you know as a first stop if you have not yet met folks from the executive to make that proposal on that be something I'd be interested in facilitating. The proposed budget is always the first car. On the slides, you mentioned proximity to rural areas. What's the the connection with the world? Larry is for human trafficking. So what areas will affect labor trafficking often times we have a helicopter cultural industry in this area trafficking is often times overlooked. If you look at the intersection of Transit populations engagement and trafficking we have I-5 right here and then goes all the way of a hundreds of miles of international border and then Coast border with major ports in Tacoma and Seattle and then smoke poured in Olympia. If I'm a trafficker I can deploy a victim or survivor of the Sexes are human trafficking with an hour's across many many cities from Las Vegas all the way to Spokane to Seattle to Portland La all with under if you look up flights right now, and then you can probably get one for under a couple hundred bucks. And if you could just help me understand a little bit more about the concept of creating a new protected class under civil rights ordinances for survivors of human trafficking. I'm just I'm trying to understand. people who are survivors of crimes aren't typically considered protected classes in in and it's not a necessary component for pursuing Justice for individuals who are members of those / if you could help me understand a little bit about what creating a new protected class with it would complish good look like a mestic violence sobrepera lot of shoe, you know, so much of the early stages of domestic violence movement Wheelock the language to conceptualize inappropriate represent ourselves and have a look at what creation of protected class under domestic violence survivors homeless homelessness veterans has done for this community as I expect anticipate, we would experience some parallel a fax in our community without knowing definitively for sure without pursuing support of the Executive Inn council member such a Off to explore what are the real impact on community can be but from discussing this issue with the convenience. We have discussed it with housing first unemployment gives us increase agency and stability. I know for myself without having sudden housing protections for instance of the wa wa I would not be here today. So it doesn't always have to account for all that we can do to support a survivor. An artist to follow up on that I think that the protected class enhances our network of services already available, but that don't have specific affordances for people who may be survivors who require a certain lens of care one example, I can think of off the top of my head is in the criminal justice system often times. If you're for example, if you're eligible to be let into a drug diversion program instead of being charged with a crime you're actually not eligible for drug diversion if your crime involves sex, so if you're a survivor of a traffic incident, you actually may need that diversion program more than anything and incarceration will infect harm you quite a bit further and with a protected class. We may be able to close that loophole or at least look at it in a more holistic way. No further questions or contributions from the Commissioners. I just want to really thank you for the eye that you bring to the work that you do and want to restate what we often do say to y'all at this table, which is we really count on you to bring forward your your policy ideas. This committee takes your recommendations really seriously, and I think that specifically as it relates to our handling of the Seas Seattle women's commission recommendations around eviction reform and more recently the people with disabilities recommendations around closed captioning. I think those efforts at Policy changes, I would hope speak for themselves as it relates to our our strong commitment to you and to elevating your voice is in using our policy-making role to do so all of the Second Battle Cats with hairballs. You've been your leadership on this committee has been great for me to see to just that the channel from the great advocacy and Community works at the these commissions all do and providing a place for that to be turned into a handful change of the city has been looking at this set of ambitious undertaking is it the commission's are all looking at. I can't wait to see what comes out of this in the next few years. Thank you so much. Thank you. I would that we are adjourned.", "end_time": 5628.2}]}