{"format": "raw", "annotations": [], "confidence": 0.942282112551407, "data": [{"start_time": 0, "text": "Good morning, and welcome to the June 11th meeting of the Civil Rights utilities economic development in our committee. I am Lisa herbold the chair of the committee and council member representing West Seattle and South Park district one. It is 9:37 a.m. And I'm calling the meeting to order we will have on our agenda following public comment. The following items of business were first going to hear a geographic and demographic analysis of hate crimes in Seattle from dr. Tim Thomas. And this is part of the city Auditor's report that we heard in a previous committee meeting but this is specifically focused not just on the enforcement piece of bias and hate crimes in how SPD in the courts handle. It said this is a look at a mapping exercise showing where the crimes have occurred and it sort of analysis of of what that might mean for for us as a city for how to address those crimes. Now. We followed by a presentation from Seattle public utilities on a joint effort between spu and Seattle Department of construction and inspections to implement some changes to the construction codes to require. Access equal access to recycling composting and garbage facilities on every floor of new construction residential buildings. The my interest in working on this is come out of previous year's Seattle Public Utilities recycling programs that clearly shows that there is a better participation in recycling among residents of multifamily buildings, when they have equal access to all three types of solid waste facilities again that being recycling composting and garbage and have access to those each of those facilities on every floor of the building. And then finally we will end the meeting with a presentation from Arts office on the Fantastic Creative Advantage program a really wonderful program in many of our public schools and soon-to-be in All of our Seattle public schools that go right into public comment. We have one speaker signed up David Haynes and will be keeping time. You have 2 minutes. Sticks and stones may break your bones, but names will never hurt you unless you live in Seattle. It's obvious re-election season is upon us in the loop city council further undermine community. In fact, Seattle City council protects perverts drug pushers and non-citizens treading on local innocent. If you're a drug Pusher destroying lives your Exempted from jail yet if you're bothered by a pusher or a pervert and they won't take a polite. No and leave you alone. The only way to defend yourself as to go defensively hostile to let them know no means know yet. If a third-party hears, you tell a creep to leave you alone. You can get in trouble for calling evil and name. This is more proof of the aloof cowardice cupcake eating fake nice mistreating to face Flakes and Seattle responsible for the oppressive suicidal implosion caused by passive aggressive hypocrite who like to tread on locals. God bless the overthrow of the treasonous and unconstitutional policies of city government is so pathetic. Go from a racist Lee motivated UW College, puke compilation of data to blame white people to Solid Waste storage practice bill should be dumped in with a solid waste and sanitation recycling program. It's going way out of control. We got trash trucks coming in to Upper Queen Anne like 6 days a week banging and clanging people coming out and hid in the door on the side of the trash on asking why they show up at 5:30 in the morning. All right, so I'm before we move into the first item on the agenda. When I also recognize the other members of my join me today come from Swan and Captain Brian. Thanks for being you. And start with item one on the agenda item. What is a geographic and demographic analysis of hate crimes in Seattle? Thanks so much for joining us. There was a reduction place. Thanks for having me. My name is dr. Thomas Thomas the University of Washington study labor to change segregation and all things that involve migration. And also how crime and pax's are related to consequences of urban change. I'm so I was asked to do a report on hate crimes in the city of Seattle from 2012-2016. And these are kind of some preliminary findings that I've had. I'm kind of going over the major contacts and happy then take questions at any point introductory report comment. I just wanted to note that I asked the auditor to include this kind of work. I'm really glad that you were able to accomplish it and that that we had you your expertise here here locally, but we really wanted to How to test a theory of whether or not our patterns of development had any relationship to to hate crimes and just putting that out there as my thinking and asking for this work and look forward to getting some more there's probably a relationship with the presentation we can talk about those couple maps that show that so just to kind of Scituate what hate crimes are and where they kind of occur for the most part of hate crimes are situated within the context of neighborhoods and social dynamics, so they're not randomly distributed there different kind of issues that happened that kind of produce more hate crimes than knots and So based on a lot of the theories on hate crimes the overall General kind of understanding of it is hate crimes are situated within the context of exploitation marginalization and cultural imperialism. In other words is this form of dominance that one group Is over another in particular trying to inflict that especially they feel like they're their hegemony over their dominance is being threatened in terms of where hate crimes occur. They happen most in where they're high concentrations of targeted groups. So lgbtq groups or racial ethnic groups or other types of groups that might be marginalized in areas. They also occur a lot in areas with high but pedestrian traffic and residential turn over so that's kind of a friction hypothesis when you have strangers meeting with each other with potentially differing beliefs that kind of the also happen in areas with liberal views and support for lgbtq and Rachel civil rights. So that's kind of one of the dominant issues with Seattle's. We have a lot of liberal views. So we may see a high rise of hate crimes in general but in particular what I found one of the first things I found is the hate crimes are most frequently directed towards the victim's race or ethnicity. And sexual orientation. So race and ethnicity was the most dominant 54% sexual orientation was at 32% this bar graph shows the frequency of subcategories that I took and kind of concatenated in two primary categories just so it's understandable. And as you can see at the very top so the African American cities, these are all the listings at the bottom are organized into five different categories. They're organized into gender identity hate crimes other types of hate crimes are very various race and ethnicity and green religion are related hate crimes and blue and sexual orientation and kind of pink and those are all listed at the bottom. But as you can see there's a high frequency of them amongst a very few types of categories in particular the number one categories against African-Americans number 2 is what s p d labeled as LBG Lesbian bisexual and gay number three came in as what were considered white hate crime. So another words against white individuals number for was Jewish and then there's just kind of a whole Myriad of different kind of categories that take those areas. So for example, the highest and gender identity was those then found a transgender hate crimes against them homeless individuals had a high rate of hate crimes within the other category and then all the other groups racial groups that have pretty high rates of hate crimes in particular Native American Latin X ethnic hate crime listings, Asian and Arab and then again with religion Islamic came in second as one of the primary hate crimes and homosexual in the the sexual orientation category. Are some questions lining up on the LGBT coding. Can you explain the different distinctions and whether or not the large LGBT category that does not have an additional distinction. Demographic distinction weather. That just means that that information wasn't collected. It's not doesn't look like it's white because there is a white category. What what can you tell me about that that plane LGBT category is compared to the other LGBT seeing it's right below the the dolls the spike. There is just the LGBT not a GB black right angle. I can tell ya so that's this is just an issue with data and general depends on who's collecting the data and what kind of access they have to from. Live viewing of a lot of the data there's a lot of categories that just for dominance. So they'll just throw lgb4 example, they may have had an opportunity to ask some sort of demographics or some individuals were very insistent on saying, you know, there is a demographic component to this hate crime DP is it just these are being reported differently. And so yeah, so they were actually so this is directly from the SPD data. And so that was a decision made at that ground level and these were vetted through investigators as well and already pre aggregated. This is I can recall about 30 different categories and I looked at two hundred something categories. And so I tried to concatenate them as best possible to present it in the most the category categorize these into a Place that would be make most sense and also be most respectful to each other groups as well. But there was just yeah those distinctions or yeah, they were it's unclear why they were that distinct. I think you are so one. AIDS don't hate crimes are reported hate crimes from the police department is there is under-reporting but I don't know where was just curious on. This is diesel Seattle numbers. Do they also generally mirror National? Things and then to let me go in and ask another question. What did the Expedia find in terms of the hate crimes record against white people? Like what does that concert you like? How how did they get deported and that sort of thing. Unfortunately, I didn't have the records related to each of these crimes and because there are 808 work. I was mostly interested in trying to identify the types and locations of them. So I'm unclear of like why what would constitute a white hate crime over another what I could imagine that you know would be a question for the SPD make a definite clear that up but they would I would imagine is is it would be something along the lines of someone feeling like, you know, their race was being you know, they're being persecuted because of their race and so the individual was white and so that's pretty had to kind of clarified as a hate crime what goes into those details. I'm unclear and they'll be a great question for the SPD to kind of follow up on. So are there any questions that you could answer to that. The right? Yes. I'm at to mention. There are a lot of different categories and I think the goal spd's goal is to be as granular as possible so that we can see some of the trends over time but and I know that with the implementation of their new system, they are cleaning up some of these categories as well. So I think over time in the future will see that be a little clearer some of the categories might be combined in the future. The number to think that I found was that hate crimes occur more often in neighborhoods that are either racially diverse that were slightly below the Seattle median income but very close to the median household income or had a high proportion of renter's so basically I'm going to be showing a lot of maps and so I'm going to be going through several Geographic details, but particular what I wanted to highlight in this point, is that the racial diversity in which hate crimes occur happen often. So this graph going to shows kind of a scale of racial diversity on the far left you have mostly white neighborhoods. And on the far right? We have most neighborhoods with mostly folks color. And what I found was that race and ethnicity of hate crime Stephanie dominated about all of the categories in a particular you were high with in areas that has three groups of another words over 10% or more of the Group was represented. So if there was 12% African American 12% Asian and 12% white or over, you know, the rest of them are white and everybody else is under 10% That's how I categorize each of these in this kind of drawers from some literature on segregation to this is a way to get at micro segregation scale. So the three groups are actually a lot of those groups are located in North Seattle white asian, neighborhoods are kind of sprinkled all around Seattle and those came in second with a race and ethnicity and sexual orientation hate crimes and then mostly white neighborhoods had a high number of other crimes as well as mostly race and ethnicity and some sexual orientation crimes there, too. I meant just to respond to your earlier question calcium just want nationally for the last. Of time that we the FBI has reported data that rise in hate crimes has been 17% rise in Seattle. It's twice that 34% like the Seattle day. For example, the SPD indicates that the majority are black. I believe that it's similar National. It is kind of shocking how high the black hate crimes are in Seattle given that it's only 7% of the population. So that's just under about 4% of the population is made of experience to hate crime. But like you said and pointed out the rate at which how much higher like hate crimes are Mesa de I mean with we know that there's a lot of Under reporting as well and has a lot of people that you know, that face a lot of discrimination tend to not have faith in the system. So those are the people most likely to not report whereas folks who them and dominant culture such as whites and males tend to have more faith in the system and will continue to report so, you know, I find it interesting. That's why why it's kind of showed up third in that category is you know, that's what that's based on academic theory. Of course number three the large. Clusters of hate crimes occur in downtown and Capitol Hill smaller clusters occur in the U District sand in the Ballard neighborhoods. All these spaces are known for high commuter and visit your traffic. So basically what this shows is a map of the racial diversity that I mentioned previously as you can see Seattle is kind of done the on the North you have a lot of white or neighborhoods and you also have it's kind of difficult to tell the distinction with the colors, but What I try to do is is cover as much diversity as possible. What's difficult to and I just always had to point this out and it's hard to distinguish Native American populations because the sense of state is just very poor it and kind of identifying those groups. I just want to point that out real quick, but the four areas that I had pointed out if you point here so the downtown area and the Capitol Hill area located right here and Ballard is located right here where we have there's a lot of bars and and Street locations and then there's the University District here. This is 45th Highway 99. I think if I'm thinking correctly and some coming up and down around here. This is about swear 23rd MLK and 23rd kind of Rainier Valley area is located my courses West Seattle there too. And as you can see You know, those are where the highest concentrations are located at. the best rate of pedestrian Activate meaning of you pointed out. Especially Capitol Hill district. These are all very high pedestrian areas in about three or four slides. I have some zoning map switch where I found the highest correlation of where hate crimes are occurring. So yeah, you're correct that hate crimes tend to occur mostly in the Hyde pedestrian high traffic areas. So that's why there's so many downtown. There's a population density component to it. But there's also a transportation component to it as well. The one thing I wanted to point out before I get into the zoning Maps is that in less dense neighborhood some particularly in the north Seattle area. Will this is probably one of more interesting things that I found. Is that where I hate crimes to occur along the borders and mostly white and racially diverse neighborhoods in this is up in North Seattle weather has a larger white population. So what I mean by that is if you look along here, We were just the kind of like do a regular statistical regression. We wouldn't find this kind of relationship. But I kind of just spot checking this stuff. We see that they are dark red areas. These are all white diamond neighborhoods. There's not a lot of hate crime activity except for in Ballard, but that's largely because going back to council member. She wants a comment about the high pedestrian area and also the U District what we do find is if you just kind of pay attention, there's a lot of there are a lot of major thoroughfares along here and along here and down this way, but what's interesting is that they're kind of falling along the residential racial divide within those spaces as well as the high traffic areas, so we can't just blame it on high traffic. There's something kind of going on. So here, you know, there's kind of a border going on. There's a bit of Border action. There's a little bit of clustering going on here and there's a little bit clustering ongoing On here. So this isn't like extremely conclusive. However, knowing what we know about. There's a theory called racial threat Theory which beso talks about if a dominant group feels like that. Their hegemony is is threatened that there may be an increase in hate crimes and so is potential that that's something that's going on socially Within These spaces, but it's very difficult to get it that without qualitative data. So this what I'm doing is drawing in a lot of theories with what I'm visualizing and trying to explain what's going on their level of hate crimes were were there three or more groups that had at least 10% of population. So I think that is is a population where there's a fair amount of diversity when you look at the like absolute numbers of say they hate crimes on black population Solis, Personality perspectives you go into a predominantly white neighborhood where maybe there's only a handful of black people. The rate would be lower. But I'm wondering is the risk for a black person to be a victim of a hate crime lower their or higher than me to maybe if there's only one person but there's a small small biscuits like all that happens is going to happen to me. I'm curious folks better off living in a more diverse Community or if you're isolated in a community like no there's actually a lower incidence of hate crime because you're not lack of representation White shows up that way or is it you're not seen as a threat when it's just a few of you until hate crimes don't happen at the same frequency. Yeah something to kind of highlight is that What's Difficult about using residential information as maps to signify diversity? You're not talking about the Ambien population during the day so downtown Seattle may be incredibly diverse, but during the day on the bus and maybe you know one group heading to City Hall heading to Amazon or dominant groups that kind of shift, you know within those faces at different times on a Friday night. There's a different dominant group from Bellevue, maybe moving towards, you know, Belltown or Ballard or something like that. So I think that my if I was supposed to. Be more related to the Ambien population at the time rather than the residential space, however, You can't ignore, you know things like this where there's a very low rate of race and ethnic crimes and white neighborhoods white neighborhoods have you know benefited a lot from economic and social context, you know, they get police less. They have a lot more value with their homes. There's a lot more white Centric spaces there that kind of allow them to thrive in what other wooden in whatever ways where is you know in in there's a lot of high traffic areas are going to draw more attention for policing and there's the economic diversity and things like that. And so that friction can cause what you know, kind of leads to hate crime soap. Living in a white neighborhood will protect you, you know from hate crimes for sure the neighborhood to I mean, I grew up in Georgia and I know some white neighborhoods that has a lot of these neighborhood still had housing covenants to up until about 2005-2010. I believe they weren't in forest, of course, but that kind of social Norm of white dominance was MIA propagating. Yeah, it's embedded in there. So, you know do people feel comfortable going to these spaces, you know, we haven't been able to test whether or not hate crimes or thriving or not in those spaces are not that makes sense. Is that answer your question? I probably said that the most academic blurry way possible. It's complicated as it draws a lot of Newports a lot of people and there's a variety of Fino institutions from you know country music to Capitol Hill. I'll be absolutely in Capitol Hill Capitol Hill live at my hair in a minute but since 2000 since the recovery from the housing crisis and especially since 2012. There's been a massive shift in the demographics and the economics and the homeless population in the housing, you know Dynamics and rent all these things like there's a Amex atom bomb kind of dropped in 2012 and with that kind of introduction of an if you know one of our primary theories is that if we have friction between strangers occurring then I knew you know residents that may not be totally tied to the city may be coming in with bringing with them values on what they believe is important and that may conflict with what Seattle has traditionally been known for and in fact if housing has now become so unaffordable you start to push out people that you know, love the city and care for the city and and and nurture the city The Gardener's if you will of Seattle and so that's when you start seeing shifts going on. In fact, one of the items in the report that I found is that lgbtq crimes are highest in Capitol Hill. That's a traditionally you unprotected space that used to have you know, that it's kind of had been flow wherever there's a safe space. It was a unsafe space became a safe space and now it's unsafe Again by and large. I don't think it's As unsafe as it was back in the 80s and 90s, but it's definitely changed neighborhoods graphic change and how we can Target our efforts to address hate and bias crimes to those neighborhoods of change so that we can reinforce what the values are of those neighborhoods to people who are coming into neighborhoods and don't have those values and some people do have those values. I think that part of it and they're just needs to be a fostering of that space in these values to kind of be reinvigorated and empowering other people to step up. So it gets into what you were asking about over half of all hate crimes 53% occur in a mixed General use these are commercial and residential zoned areas and also multi-family zoned areas. So I'm about to show 3 maps that kind of describe this circumstance. So hopefully you can kind of distinguish this but basically the pink are General mixed-use stereo. So these are kind of a mixture of storefronts and apartments and then surrounded by them in these kind of Darker yellow. These are multi-family Zone like apartment areas and then the light yellow is which is about 75% of the city of Seattle is single-family zones housing. So there's a large amount of how things are getting back at your question councilmember O'Brien about white space is being protected. I think single families own spaces are also very protective of that too. So that's because you don't have a lot of those intersections as you can see Highway 99 a lot of thoroughfare but these are kind of like you'll just see very quickly that it's literally like even in small mixed-use or multi families own spaces, you'll start to see this is where hate crimes are clustering and if a Please like solo hate crimes out here. This is for example, this red one is a sexual orientation a crime in the middle of a neighborhood is very rare and uncommon this racial diversity. This one on racing at this is it seems uncommon and likewise around in these spaces, but as we see this is the Ballard area down here down south and this is the University District down in the southern portion right here too. If we look at in the central Seattle location. This blue area is the downtown Corridor. This is the central business district. And as you can see the most kind of dominant hate crime that occurs. It's a mixture of sexual orientation and race and ethnicity but it's seems to be largely dominated by race and ethnicity. Where is if you move just East to Capitol Hill you start you start to see basically a massive splattering of sexual orientation hate crimes pushing through the Pike and pine Corridor. There's a lot of bars in those areas and also up tour. Broadway and up north right, obviously, you know we have to Be careful and precise in what we are inferring from the data. And also it's a question of the scope of your study as well. So I don't want to obviously I think we should respect that kind of academic procession. But clearly there's something there's a story being told you are from what you've uncovered here in the sense that it seems to me that if we need to look at the I mean The Clash that's happening. I don't mean like actual Clash of light incident. I mean The Clash in in the British the fictions. Yeah, that's a better word obviously income and economic questions are going to be important because it seems to me that in in the neighborhood where for example on Capitol Hill lgbtq. People are more likely to be working class or low income and so there and there's a higher population of lgbtq people among the working class. And so we might then to see that an n in neighborhoods where the the working class is more highly composed of people of color or immigrant communities are Muslim communities and they end up becoming targeted. Do you know why I hate crimes and and that it really to live in in Samsung that depends on which Group it is that is seen as the perspective in terms of social good. These are the residents that have to put up with this type of activity in it on a constant matter or more frequently. So, you know, if you just take out the population of South Capitol Hill faces sexual orientation crying. I hate crimes more. So whoever is there that will kind of from a theoretical perspective. There's a lot of research that talks about how that creates was called social disorganization and that dismantles any kind of like thriving structure that we go back to the example of a white single families own neighborhood. There's a lot of social organization there. In fact, there are you know, a lot of stability there's a lot of resources and availability to kind of do what you want and kind of Creative Commons space. What does friction is adds to a lot of the stress this adds to a lot of other kind of issues that could literally lead to a very how do I say it like kind of an unhealthy social order in terms of social health is a better term to put in on multiple levels. And so any kind of crime that happens in those spaces. I mean crimes going to happen in dense high traffic areas all together. We know that and ends very similar here, but it's the groups that are being targeted have to put up with this type of behavior that it just kind of ads on top to what they're dealing with already marginalization in other words. is a couple like couple of theories that I'm that I'm hearing coming for dealer looking at the data and I want to like try to understand how we as policymakers address that to one of them is this idea of these these mixed-use owns what has more pedestrian traffic is more interaction and Three next job asleep by Design from a city we're trying to create more of those faces. It's so you know, you know decades ago when everyone fled the urban areas to suburbs there is a life where you just got in your car in your garage and push the button and left and you didn't have to interact with anybody and you know, you go to work in your secure, you know, there's more like know we're breaking that down because the sensitives so isolating to so many people it was unhealthy. And so now we have a place was a lot of interaction. I would argue that neighborhood like Ballard or Capitol Hill is creating a lot of really good things because of those interactions and but there's also a downside to that and so I don't know that you're asking nor do I think you would want to say insecure going back in the suburbs? Generally more incidents of crime in general. I'm sorry and will these numbers are going up significantly and it's it's appalling and unacceptable. It's still you know, as a white male walking in that neighborhood Who heterosexual. I don't feel bad and I feel like all the benefits of all this great interaction. So it's great. So maybe the folks with different identities than me have a different experience. I mean certainly they have a different experience. I don't know if it's overwhelmingly terrifying to be in there if it's still a relatively small number. It's just going up a lot but Trying to figure out how do we how do we create this vibrant neighborhood that we want and have these really strong interactions and avoid the downsides and how he managed for that is it? Is a couple things one of these I hear anecdotally when I read the news is this sense that there are people that whose identities are threatened to off of your come. Maybe they live in Seattle made me to come from outside in Seattle like almost for sport. We're going to Capitol Hill this weekend to cause him trouble and you can you read incidences of a group that was there was bullying her picking on someone or physically beating them up and it's just a poem of these folks feel like this is Sport. We're going to come into this liberal places Seattle and that feels like if if that's what's happening that would require, you know, some sort of awareness and policing strategy. It was happening is there people that have lived together for a long time, but they're okay with the previous balance, but now we're just really uncomfortable with the balance or there is economic disruption in their life. So they're feeling insecure and they've been lash out in ways that you know, that that doesn't require an essay. Police it's like a we had a social system that we got to fix. I know, you know, they're obviously both related. I think you know when people are coming from far out of the city to pick find us some social problems there too. But it's harder for us to deal with the data is like he's got a partner that really hard because that's not what we're measuring. You know, I'm going to drawing from other studies that I've done that kind of hopefully answer your question. I used to live in Capitol Hill and I live in Ballard now and I know these areas pretty well actually went to Seattle Central Community College before I actually went to the University of Washington and I'll never forget that experience because the one thing I remember the most was there's a lot of iconography your icons of social justice and lgbtq communities and there were a lot of people talking about this concept to this this new, you know, this space being safe and there were a lot of businesses that were owns and diverse and there was a lot of opportunity To thrive in these spaces if you look at Capitol Hill now, what is Iconic iconography? All the businesses have shut down. I've talked to recently one of the I won't name the name, but one of the business owners who works on Broadway and says like, you know, people are just at struggling to stay alive and stay in business and they've been you know serving there since the 80s. So, you know, I'm in different capacities and you know, if you think about it now, you see, you know brand new restaurants. You see upscale. Yeah, so that I can ography has been replaced by a new iconography that invites a different population. And so that different population has been being invited into a different space that used to be dominated by a different group. And so when that happens, you know, that's basically competition if you think about plant life, you know one seed is trying to you know, take over the field of another there's going to be some friction at this borders. And Capitol Hill right now is one of those Borders and its really uprooting happening. I mean, that's the I would say that the large phenomenon that's happening and that's exemplified by the quote you had on the business because it's true. It's not just working people that's also small businesses that are being uprooted. And now I mean something that you would never thought you would never have thought would happened on Capitol Hill like a whole block of a baked Starbucks and that's when I drink Starbucks. I don't have the whole set of you know, but it does signify that neighborhood that used to be known for viber instead of divorce small businesses. It was yes, it was dangerous for lgbtq people many decades ago, but it was also the place where lgbtq activism became, you know, hang in Seattle to Capital Capitol Hill was the Genesis of that and I hear stories from Lake just to give an example of Sean bags be who you might know is a longtime member of IBEW 48 Journeyman electrician, he's he's black and he actually we used to work at the Safeway that you know, the key of C that used to be whatever Kroger or Safeway at one point. I wasn't there that time but he was talking about how there was a whole thing of uniting black people and lgbtq people because everybody was facing discrimination and they said let's get together and just this was happening on Capitol Hill and now it's completely changed and so who gets to enjoy that change. That's the thing. That's a concrete question a lot of histamine your you use the the plant analogy you reference uprooting. It's about an ecosystem of identity for a community that is being lost and that identity is part of what protects a community is when it's clear that the identity of a cup. He is supportive of lgbtq people or at the identity of the neighborhood is supportive of African-American residents and businesses. When you lose that you're losing a very public message about I think about safety Falls within the shadow of development and changing around sand and affordability. You know, I have a PhD in like if my rent goes up $200. I had to find a place outside of Seattle. You know, I have won the last cheap places in Ballard and I have a roommate because I have to pee and there's a lot of people that face though. The last time you came to the committee. Selectivity on homelessness you said you have a roommate? Yeah, yeah. Yeah, it was talking about evictions. And so maybe I study what I'm afraid of but I have a few more slides and I'm sure I've gone over time. Sorry. No, don't be obviously I want to talk about social organization all day personally because I let you know if I was to say one thing at the city could do its difficulty change rants, unless you inhibit, you know certain zoning or some other kind of laws or you can do is try to defends icons were spaces. You know, if you wanted to impacts hate crimes. It's a social issue. It's an economic issue for sure. But directly you could bolster, you know, small business and icons that say, this is a safe space. So this other map real quickly going to shows South Seattle. So in West Seattle again, we see the same kind of thing around the corridors were starting to see if More race and ethnicity crimes down in the Rainier Valley, but we definitely see if you sexual orientation crimes as well and kind of the heart of West Seattle in the spaces. We see if you down there but they're a lot less frequent. I did a quick analysis on hate graffiti under the request of the auditor and basically broke quickly what I found like hate crimes. He graffiti is reported a long busy thoroughfares and then highly racially diverse block groups, but unlike a crimes in other words. This is what you need to Graffiti is also reported in black groups that were mostly white and white asian, which was kind of interesting to me. It's kind of the opposite maybe special people afraid to act on hate crimes but aren't afraid to tagspaces. So most of them happened in mostly white neighborhoods and white asian, neighborhoods is coming the opposite where the actual hate crimes occurred and then they also course are happening in general mix you Siri. But what was interesting as the second highest count of graffiti was found in single-family residential now, we know that is a is a plethora of the map that shows hate crimes basically shows a lot more dispersed kind of identification where this is where these are located but hate crimes in crime and Generals related to age as well. You know, the younger you are the more likely you are to commit a crime around adolescent to about 25 is kind of the threshold of kind of the peak threshold of crime activity until your feet is no tends to be related to that more youth related incidents. And so it may make sense that single-family zoned areas are affected by didn't you know this but it's definitely still a Kind of getting back at that concept of iconography. It's replacing icons and putting them in spaces that might be more harmful for certain folks. That's about it. Can you speak to whether or not you've looked at other cities in whether or not they have similar studies to to this one in other cities and if so, there's some more conclusion on hate crimes Stone unfortunate I have not. Something worth us taking a look at the literature out there. But again, I appreciate the work that you've done and I want to continue working with the city auditor as well as SPD who's the audience a detective Elizabeth wearing of the heat Vice crimes unit is here and I want to for the city to work together on having some play Space strategies to deal with these types of frictions that I think are in an outgrowth of Redevelopment of traditional communities where places were again, traditionally historically safe places and now or safer places in and now now less though in that doesn't mean exclusively enforcement strategies. I think there are a lot of different things that that We can do you know SPD has led on creating the safe spaces initiative with having business owners be clear to passers-by and people entering the businesses that it is a safe space, but I think we can do more to I think broadcast of what our expectations are of the city for our values and I and I think some of that does may involve some specific Place based enforcement strategies. I think again, I'm looking forward to continue to work with the office of civil rights on my hate crimes legislation and specifically using that as a tool not to have additional layers of disproportionality against marginalize people in the criminal justice system. but again as a way to enforce our values as a city and also to address the harm that is done to the the perpetrators of hate crimes acting on biason and hatred so that's where I'm I'm hoping we can go hopefully with the help of my fellow committee members what are afforded the same increase safety, let's not say everything was perfect in any way but I made them safe for in the past was I mean a big component of that was also affordability and neighborhoods being welcomed not a name. I mean, you know, you have lots of proclamations at Seattle's welcome. But what does it mean to be welcome and you can pay your rent and you're getting pushed out all the families and neighbors that you knew who you know who grew up with you being pushed out and I'm and I'm not talking about to be the talking about working class people having the right to the city. And so I think I will let you know. I think we we all should draw that message out and not like density is bad or possessed having pedestrians in this bad. So I appreciate my colleagues, you know. That's not what that's not the message of this really I think safety and Public Safety overall can be improved when we don't have such economic. Just two divisions and in fact, the whole data being so indicative that it was after the economic boom began here that it's all a lot of these are being observed also has a lot to do with that. But the post-recession recovery has been only for a few and many many have been left out of it. Appreciate it. Agenda item to is solid waste storage and access requirements. Joining us. We just do a quick Roundup instructions first place high and Susan V Paris, and I'm the division director for planning program management for the solid waste line of business is spu Hans Van Dusen Seattle Public Utilities. Seattle Public Utilities Solid Waste Department of construction inspection land use code development team in this issue after a couple years of s p recycling reports and one of the clear messages that I've seen is that we need to do more to assist residents in multi-family properties to do better and Recycling and the I think the approach that the city should be pursuing is not a punitive approach not to punish people for for not recycling but to look at the reasons why they may not be recycled spu's been really good at helping to demonstrate that recycling rates are higher in multi-family buildings where there is equal access. To each garbage Recycling and composting facilities and on multiple on multiple floors. And so I from that I've become really interested in and how we can make sure that new buildings as they're being built new residential buildings meet those standards. So with that kick it off to whoever wants to get us get us started and then tell us a little bit about the work that spu and STC. I've been working to promote this. Thank you very much. Thanks for having us here today too. And I really appreciate your interest in being up till now we've given you some background. And so today we're here to talk a little bit about the engagement that we've been doing to try to figure out what will work in the multi-family area. We've done extensive work with multi-family residence and just developing data about what Will and won't work and so Hans Angela and Eric are here to talk a little bit about the engagement. We're doing with the development Community song. I had it off to Helen's sure and an engineer can cover a lot of the great input. They've gotten from the business Community as they worked on this likewise preciate the interests and the opportunity to come hearing update you on what we've done related land use code guidance and just not a big picture level we work with UCI to make sure that land use code has requirements in it to ensure successful Recycling and composting and that covers all building types. In this case including certainly commercial multi-family single-family covers recycling composting in garbage. So say adequate space safe access successful successful access are all part of it and then it as you mention, it applies to all new buildings and then two major remodels as well that code and we haven't had any significant changes to it for the last 10 years or so. And so we're dealing with this day in day out to make sure that as you identified we have successful Recycling and so is the last For the six months, we had great interactions as you know, with the business community and development Community China understand what opportunities there are two before done that. So angel can speak to some of them what we found out here and of course anytime so well Hans mentioned that we do have land use code that does a lot to provide for a president storage for solid waste and access to that Solid Waste, there's places where we can improve and I wanted to talk about basically four areas today two of them are related to multifamily and two are not but I want to just bring them up because they're part of an overall Improvement plan that we might be able to implement. So I'm the first is that most new buildings in Seattle that are built do not provide the on floor access that we know is critical and I'll talk about our data around that so we would like to think about ways that we can bring that on for access to new multi-family buildings. And the second is that the land use code has Provisions for allowing modifications to storage areas and other Modifications are allowed as well to the five pages of land use codes that apply to Solid Waste storage and access and at modification language is really Broad and also really vague and we'd like to look at ways to make that more clear for developers make it more clear for Architects as well as staff. So so that when new building plans are proposed that nobody is wasting their time on a design that isn't safe for is infeasible, especially in these multifamily buildings are we have thousands of residents and and the impact to what people can divert really matters. So those are the two things and the variance request and what those might look like in taking up that language and then bringing that on floor co-located access to Residents that really apply to multifamily. And then a couple of things that are peripheral but I'll just add here today are code lacks Clarity around when a commercial building expands and commercial buildings. It's really important. They had Solid Waste to and especially commercial portions of multifamily buildings. This is where this might come into place. So say they're adding ten thousand square feet of commercial office space right now. There's a little loophole in the land use code that doesn't require them to come up to code a the commercial storage code that we do have to come into compliance with that to account for that extra Solid Waste storage that they might need when they add say 10000 square feet. So that's sort of just an oversight, you know, the code is done 10 years ago, and that's something that we'd like to look at. I just want to clarify it. Storage requirements are we talking about the standard that I described at the beginning of equal access to all three stream storage for all three streams on every floor. Yes. It's so the third bullet suggests that that requirement already exists for multi-family remodels know so, well, it gets to the point that when a multi-family building is remodeled in two or more units are added to that building then they need to comply with the storage square footage requirement that's in the land use table. So it's by numbers of units and how much square footage storage you need for the dumpsters that's not related to on for access at all. None of these bullets relate to the 80. The very first bullet. It doesn't does certainly yes. Okay, that's just yeah. We just want to do our best to look at the various areas that could use Improvement. Not just the most important in Avon for Access. And so when we talked about the existing requirements, it is merely to have storage facilities on site right now and sufficient to handle the waste streams according to the square footage of of the building right number of unit. We don't prescribe. We're in the building that has to happen. We don't prescribe on floor. Thank you. Great. Okay, and then the final smaller item here is that we are code lacks any storage requirement for industrial buildings. So it's just sort of an oversight again. We have very few industrial buildings being built this city. But while we're looking to improve things we should add this and I'm proof that as well today that has not been an issue. I've reviewed one industrial building and they had to they followed the commercial table for square footage and that's great, but we should just close that loophole in my mind OK or background. So am I calling Soto Medina has done wonderful research and actual buildings in Seattle the 300 largest buildings in our city that are multi-family or mixed-use and we assess those buildings for how successful they are at Food waste diversion. And in buildings that have that on floor access word that top top image that we're looking at where there is a combination of cards and shoots are all cards were all suits when they have that on floor access 60% of those multi-family buildings have very strong food waste diversion programs. So that means that they are diverting a lot of material there doing it cleanly as there's not a lot of plastic or their contamination building management and maintenance are on board supporting that program 60% of those buildings with on floor access are doing a really good job and in stark contrast when those buildings residents have to go all the way down to the dark or really far away Solid Waste storage room only 10% of them have a strong food waste program. So we are in 300 buildings to show that my colleague Soto Medina gets their credit for that work and then so when other bullet point of day to hear that's more related to the work that I do day-to-day the buildings that are coming in new MultiCam. Proposed buildings were the past two years about one-third of those are coming in with on floor access. The developers Architects are saying yes, we're doing that someone that's because Steve has been guiding them that direction very closely for a couple of years now, but some of it's just that they've done that but that means that two-thirds of them are not so we have we know that developers Architects are interested enough to a third of them roughly over the past two years, and we know that two thirds are not doing it for various reasons. So that's an opportunity for us to be here today and talk about improving that Okay, so I think this is my couple final sides here about stakeholder work that we've been doing. So F you in a sec. I over the past 9 months or so. I've done quite a lot of Outreach with the various stakeholders including meeting with the master builder Association Seattle Council on several times starting back in November going through April and June including more meetings tomorrow tomorrow today. We've also met with the Seattle chapter of the American Institute of Architects of the AIA. We hold us to read again. That was an spusd CI joint effort and that was in November and we met three weeks ago with a group of the larger developers in Seattle including important groups like Seattle Housing Authority Plymouth Housing Excel Pacific just larger developers that are doing a lot to help those that are City and provide housing and we're actually meeting on July 11th as well with the downtown Seattle Association about solid waste another land use considerations that are important to that group. Question or the data point related to new buildings. Do you see any difference between the nonprofit providers their buildings and the for-profit fighters and the the voluntary equal access facilities in in those new buildings. I do it's been communicated routinely that it's unaffordable for the low income buildings to provide shoots or to provide on for Access. And so has that resulted in fewer of those buildings yet. You've identified as a voluntary compliance. I would say that I haven't seen any of those through to completion yet their buildings that are under review the Rhino DCI permitting process, so I can't say for certain of the outcome of all of those because they're just being permitted. But yeah, he was at one of our meetings with us last week. Yeah, okay. So just to wrap up some of the feedback we received from all that stakeholder Outreach that we've done as correlates with a data. I just mentioned many of the medium and large multi-family developers are choosing to provide this on floor access and many are not they are not they did not communicate so far that there's that they're against providing that on floor access, you know, their reaction was yet. We already do this and it might be even easier to do if the solid waste storage rooms on every floor which would be small 25-30 40 square feet did not count toward their floor area ratio their far calculation and Sault Ste. C i n s p o r and conversations about what that might look like. So those are the two big takeaways. We also mentioned clarifying that ambiguous part of the code where modifications can be requested and kind of laying out when it's appropriate for those medications to be considered and there in support Anytime to the code can be clarified but not be too restrictive. So that was some important feedback we received from the from them. And that's all I have to say anybody. Yeah, we're just really love to get a sense of what your next steps are in the memo that is linked to our agenda from last November. We talked about a timeline that included a delivery of of legislation sometime in in March. So, how can you give us an update on what we can expect from spu and nscc ion on that time line in when we might be able to expect to see a bill. Yeah, preciate the follow-up question. I mean and what we looking at right now is finishing up the stakeholder input which exactly right it is extended longer than we initially anticipated but we're getting great feedback from the developers are just been rapping that up this summer and then August September is what we're looking to recommend next steps going forward for the rest of the year legislation is proposed. We can't tell this point. We're trying to figure out, you know, get the get the Finish or stakeholder and put in it and get the Outreach from that and identify what would be the best apps for finishing at working with all the info we get there. So on these potential next steps, I am concerned because I would like to see a piece of legislation proposed to dress it this and the issue of equal access as well as the other clean up the pieces that STC I identify as being variances and Industrial properties, but I don't see any time in here identified for a FIFA process, which I understand it be necessary. That's right. I said yeah if the land use codes changed American speak to a little better than they're probably would be a simple process it if you know if that step came Ford. So should I take from his that there isn't agreement that that we're going to be proposing a land-use could change as a result of the work that y'all have been doing since last November. I think we don't know that at this point, correct this area of a definitely focused on improving and appreciate your interest there, but I don't think we clearly know whether it'll be a change for the code or not. Well as if there were to be a change how would FIFA fit into the timeline so after this is the August September kind of drafting up potential language C outfits. Once that happens, it goes the executive office. They take a look at it. See if it takes about a month and then from there it goes through Council deliberation and that takes about a month or two after that. But that's the potential down the line a couple months afterwards three to four months not looking at a potential FIFA process until after September. write app I'll have to continue discussing this and I'd like to know how I can help whether or not it is as it relates to your engagement with stakeholders or having discussions with the mayor's office about addressing what my objective and hope is for for this policy. Think it's really important considering some of the challenges. Bestie is identified as it relates to recycling. I think it's really important as it relates to our climate change goals, and also some of the things that you've come and talk to us as recently as our last committee about our recycling waste sounds great. Thank you. We appreciate the support. Jenna rm3 is a Creative Advantage update. Turn that frown upside welcome. Thanks so much guys, it's one of my favorite topics do a quick round of inspections, please from director of the office for the office of arts and culture. Good morning and Larry Davis. Good morning, hun, Larry Davis, and I'm not her syndication manager with the office of arts and culture and haschak morning up. We're here to talk about the office has created youth programs and share some of our work and some of the progress I think our hope is to provide some information for you answer your questions in here any of your thoughts and perspective on how this work might align with your interests and priorities. And so Oh, I can control the screen. I'm driving us. Thank you. So just a super short history of how our office came into this work Seattle public schools had one of the best Arts education curriculum in the country up to the 1970s and then due to a double Levee failure at the end of the at the end of the seventies as well as the rise of Reaganomics study disinvestment in primary and secondary education in America and in Washington, and then Seattle Arts education was was disproportionate Lee eliminated from Public School curriculum, particularly in school that didn't have strong PTA that could raise the money to replace the teachers. So in 2007, we had a we had we discovered that the school district did not even have a staff person in the visual performing arts department at the district. And so the time at the time the Arts Commission of the mayor's office of Arts and Cultural Affairs reached out to the district and said if we invest $100,000 in the district, will you reconstitute that department of the district and they They did and we did and a woman named. Carrie Campbell was hired who is amazing and but in the years that followed we saw a pretty dramatic increase in the number of art education programs, but it was still happening pretty episodically and it wasn't a but wasn't a systemic approach. We were then this unique partnership between the district and the and the office so estate partner in a city partner attracted the interest of the Wallace Foundation out of New York who gave us a $1000000 planning grant that allowed us to set the goal of restoring art education to every student in Seattle Public Schools 52000 kids in a hundred Worlds by 2021. That was an Incredible 2 years that was in about 2010. We got that Grant it survive for superintendents and for Mayors and eventually we were able to engage about 2,000 Community Partners parents students teachers teaching artist cultural institutions labor unions and we develop A plan that is now the Creative Advantage. We launched in 2013 in 7 and 13 schools in the central arts pathway. I can let them explain what the pathways are underscore. It's really important that you noted the survival of this initiative and the importance of it through For executives on the school district side and six now that the time and Greg Nichols was the mayor. Know how much you know new Executives like to change priorities and that didn't happen agreed and thank you a ton of that credit goes to larra and the team that she's built because I do think that what has allowed this partnership to whether the political see changes that come and go has been the fact that I really have a collaboration between the city and the district and that we are centering the needs of the kids at the collective impact model and we really believe and it's in its capacity to change lives. Yes. Thanks for the contacts Friday. I'm going to step back for just a second to give a little bit more context for the cribby programs overall in our office. The creature Advantage has certainly been the Lion's Share of the work of the last handful of years when it comes to K-12 Partnerships in investment to realize equity in arts education, but we talked about in the office. Also talking about our work to connect Arts to careers and give him the future of work and some other National priorities around tending to cure connected learning and Workforce Development. We're going to spend some time digging into that as well. And then also share a little bit about social impact project the Arts and alternative high school project that is supporting students who are experiencing homelessness and is also connected to the connecting Hearts 2 careers kind of framework. So just to give you an overview of the the elements that we will be discussing. So the Creative Advantage which again is our investment in K-12 opportunities really just very quickly want to talk about why this work is so necessary. We meaning the city and the district are committed to the Creative Advantage because we know that young people who are engaged in the Arts are motivated. They do better academically. They are more likely to stay in school and less Likely to actually be pushed out of school and have higher college enrollment and I think this is a really critical element at this time the peace around Civic engagement young people who have had access to an Arts education are more likely to be civically and Community involved and we know this both from long-standing National research and the and the impact of the Arts on students experiencing poverty or how it's framed low socio-economic students, but also from our our data locally that was funded through the Wallace Foundation that showed us that the greatest the pictures of who has access to the Arts are by race family income and home language so that we know that this is undoubtedly a raise in Social Justice efforts. So these are our goals of that. We're working to realize with Seattle public schools in our community Arts Partners. We are making sure that young people have access comprehensive and sequential access to Arts education that teaches skills and techniques that Fosters 21st century skills and is culturally responsive that their Arts teachers certified during the school day that we work to help diversify the pool of artists and teaching artists and arts teachers that are part of this work that we're connecting the Arts to other content and subject areas like math and language arts and science and that we have our Partnerships that are funded through the city to the office of arts and culture specifically and that we're working to connect art sticker ears on a pause on that one for a second because during the research phase at Randy mentioned what young people specifically asked for in regards to their art education experience. Is that a they had opportunities to perform and Cher? I worked at work they were doing but they also wanted to understand what is my career opportunity when it comes to an art education. Like how can I parlay this into a meaningful experience as an adult and also what can the Arts do for me whether or not I go into a specific art related career. So just a little bit of what this looks like an appointment ation. Cuz you know what we talked about the collective impact initiative and Partnerships can be sometimes hard to imagine. What is it look like what it looks like in real time. So these are the components of the work Advantage is a district-wide initiative meaning every school in the district will participate and benefit from the Creative Advantage and I think I did mention this at our last presentation aarush a presentation, but we are everywhere except for the North End. So this next school year were rolling into the north regions of the district and the way that we do this is through Middle School feeder pattern is called Arts Pathways. So when we go into a region, we convene all of the schools that are connected by a Middle School feeder pattern we work with those principles to cultivate a vision for Arts education that meets the goals of of their region. We have them look at access data. So they're thinking through a critical ratio. Plans about how they want to prioritize the things that they do and again that were connecting them. So that principals were running high schools are thinking about what the elementary and middle school students before they come in and the others are more ecosystem-based approach to how they support each other. They then go back to their schools a for March teams. They drive the work forward in their own School communities. And we invest in principle coaches train principles to support them and developing their own plan so that they can really drive this work forward and then we do a lot of rigorous professional development in partnership with Seattle Art Museum. In other folks that we can continue to invest in the quality and the leadership of our teachers in teaching artists here. So many of whom have been pushed out of the center of the city because of a lack of affordability. So we have artists and teachers coming from south, you know King County north of the county all the way into Seattle. Participate because they work here, but they're just not living here. So this is our way to continue to invest in them time. I'm sometimes to catch up on the connecting Arts to careers and high school bullet and your reference to the fact that it was the students themselves who expressed an interest in this I remember when we started implementing Creative Advantage there was a lot of talk among policy makers that even though there were academic studies that showed that people young people who had in arts education were more successful in their profession and then in their adult life that it was really important to policymakers to broadcast that this was not about making better little workers, but that it was about The innate good of providing Arts education for young people through whole other variety of really important aspects of their life and their development. So I'm really interested to know a little bit more about how the youth themselves identify this as important to them. Yeah. I mean we have to do a little bit of digging into I'm the kitchen hard plan that has some information from those focused. I really think that young people were expressing their connection and interest no intrinsic desire to be engaged and have access to creative spaces and artistic opportunities ongoingly. And so trying to understand how can I continue to do this as an adult? Is it something that I have to just do on the side that's outside of my profession or can I move a fully creative artistic life and have an integrated into how I make money and how I spend my time and Other students. I think it's just all so if I want become a teacher or a lawyer or a doctor, how can I also do that in a way that's a really creative an expansive right? So, I think it's a really good point because what's really awesome about the Arts and Randy says it's a lot is like the Arts are the house. So they're both a specific thing that you can learn about but they are a vehicle to drive learning as well. So we talked about Arts integration and connecting Arts the other content areas. It's really about supporting on people to be Innovative and creative and think expansively. So I didn't answer the question that we have to continue to come back to because a lot of times we can say the Arts at the end of the day are for X Y and Z to really Drive these other things forward, but they have power in and of themselves and they are expensive. So yeah, I think it's the hope that we don't have to make our students choose between making a living and making a life. These kids want to be realized they want to be actualized they want. Participate in our community. That's why the slide by Cedric engagement is so important and so did not have to commit to a life of wage slavery in order to be able to practice your creativity. That's the idea that they're able to find a way to do both. Absolutely. I think I also talked about this a little bit last time but I just want to make a note that critical to our efforts is that we're evaluating the work that we do. So we're doing a longitudinal study of the impact of the Creative Advantage. Are we breathing access? Are we closing racialized gaps in the Arts? Are we increasing teacher efficacy around teaching creatively and cultivating 21st skills and teaching and culturally responsive ways and we are making gains and all of these areas, but I do want to underscore in name that while we have increased access at the elementary level. We are still seeing racialized gaps at the middle and high school level and under-representation and over representation of students of color in course taking and in certain art forms, and we know that this intersects with all of the institutional and structural racism that occurred in education. So it's also raising awareness about how the Arts are a part of that and we need to have the Arts engage in any of our educational Justice strategies that are being priority. Highest and so this brings me back to the question. I think I asked when you y'all were here on the rsji lightly touched on Creative Advantage, but I was interested then and I'm interested now on how you're tying your experiences and the evaluation findings of Creative Advantage as it relates specifically to racial inequities in secondary course taking as well as the the recent creative economy report that shows racial disparity in the creative jobs that people are accessing and how that how we can tie those lessons to result in different outcomes for both educating young people in school on those types of creative Outlets. More creative disciplines that will then lead to the higher wage creative jobs on the outside. Yes. That is absolutely the question of the day and the work that we are investigating its advantages in and of itself. I'm has been a Monumental initiative around Arts education in a game-changer. I would save for the way the office of arts and culture thinks about how we support young people. The next phase of this is really around a crate of Workforce Development and the creative economy. I'm going to zoom pass this unless you have questions about Smith howl of the financials work and go into the conversation about career connected learning and how we're engaging in that work and what that means in terms of our Equity efforts as to your question. So we've been pumping up our partnership with Seattle Public Schools, especially around gaps in some of the gaps were identified by the young people themselves and focus groups and interviews and in a research project that are office spearheaded really asking them about what they wanted about the kind of careers and Community Support they were seeking and what they talked about was being the gaps between schools right there like all I go to this school and we have this and that and white like, how can I get that or why don't we have that and why are there these barriers? So one of the steps we were taking was to address a gap in media arts, and we've been investing in media arts center started as a summer program. We've expanded into a school year program and it's housed at Seattle World school, but open to any student realizing there were all these access barriers. How young people could get these kinds of skills, which are really about fostering for small well-rounded education. So again, like young people are not getting access to the same kinds of courses. That's a problem rights were trying to just that it's also specifically around her 21st century skill development in critical thinking around media arts and audio and video production. It's been super successful and it's going again this summer and we'll go again next year that's been awesome and I'll just add that the media arts centers are part of Career Tech education for secondary students are they are credit-bearing. They're getting mentorship from industry professionals to support of that that that pathway into opportunities post-secondary. And this is the way the city has invested in supporting a gap that young people identified themselves and that we were seeing but that they were like, yes and the Paul Allen Foundation also stepped up to support that work. And can you tell me is the media arts Skill Center? The only one that allows drawers from other schools know the way that the skill center programs with an education are set up in Seattle public schools. And it looks very different across many different districts in the state is that any interested high school student can enroll in a course and will be supported to travel there. Another thing we're doing is our continued work which is cross-departmental around connecting art to careers career day is especially music career day have been around for a long time. We've expanded that to include film career day literary, you know career day visual arts career day. This is a way for young people and young adults to really learn from experts in the field and to come together between, you know, one real our office and other Community Arts organizations to support young people to learn workshops from workshops, but also learn with pasta. from each other another project that we've been bumping up support for is our partnership between Seattle public schools Seattle colleges and the city 2 support try a trade which is a way that community community college and Community Partners are supporting exposing young people and young adults to sort of post-secondary Pathways. So it's like, okay. Well you're in high school. Now, these are ways you can continue to extend that learning here and here are some of the places locally where you can do that here are some of the teachers and teaching artists were doing that. And in many ways these days are really exciting because the students are also helping Minnesota college level students are helping high school students learn about what they're talking about their Pathways day-long workshops how to have a structured healing workshops and we work together with the district to identify different schools that have been mentioning. They wanted that transportation to get them. Yeah, they're really engaging. I just want to underscore from the vantage point of like the future of our sub cabinet, which I'm pretty involved in to upstairs between skill center of Career Tech add to the Seattle promise and the colleges around really creating accredited High Level Training for that such a transformation opportunity for young people. And that's how you change the game around who gets those high paying Creative Tech jobs that are right now over over represented by white men, but how do we level that Plainfield and provide more access to more tools or more people know pathway an intentional conversation around not just the language that the skills workshops how many how many different trades knowledge that the trial trade partnership has really been Realize through the work of our office and Ava Freakonomics development and osm so it's an example of a ways in which were working cross-departmental e to drive this work forward this past year. There was I believe there were has been to so far. The first one was in 2018. And the second one was this past year and media arts graphic design and Apparel Design total. I think we have supported upwards of about 200 to 250 students and the students that are coming to this particular event. Our students are enrolled in CTE and skill center program. So this is an opportunity for the students who are engaged in this morning during the school day to then come to the Community College meet fellow students hear from Professor and explore these different disciplines and we can also follow up with exact figures on all of these things. A couple more slides excitedly. We did a sort of Deep dive and exploring what career connected learning look like an out-of-school time and in Creative Youth Development. So we had the idea to pull together some very amazing Arts education organizations that are already on the Creative Advantage roster. We knew are doing high-quality work. We had them applied to be part of the creative careers. Co work or idea was to convene them over a series of about six months learn from them about how they're talking about creative collective learning in the creative arts in the out-of-school-time. So we're trying now to connect how we talked about this work in the school day to the out-of-school time programs that also a lot of young people are accessing. These organizations are phenomenal. They're talking about career connected work in a variety of ways. We wanted to inventory some of their best ideas and have them learn from each other so that there is some parody a lot of what they're talking about. The higher level thinking skills that they're trying to get young people to access around communication collaboration and critical thinking as well as perseverance and growth mindset with your things School. The school day is also concerned about of course. They also want these young people to have access to skills that they're not getting in school. So this is an out-of-school-time way that they are being able to access that we learned a lot from this group of six and will continue to sort of them for some of their best thinking some of what they're hoping to do is you know, and they are doing is training young people to be a journalist training on people to be music Executives to be making podcast to doing a unit learning immersive technology. Is there all-around AR work Some of them are training young people to be teachers in the Arts specifically around these mornings. This has been an exciting group to learn from an inventory and we're pulling together the information we got from them now. And then we didn't we were asked our office was asked to support homeless in unsustainably house young people we decided that we did some research around where unsustainably house and homeless youth are really going to school and we focused our efforts on interagency schools. So we've been doing this amazing program which were the Arts alternative high schools and we're really focusing it at Southeast interagency school with a program called print for Life young people are learning already from an amazing teaching artist named Greg Thornton about printmaking. They're all so many bad and Market their work and they're selling their work at Marketplace at the Columbia City Farmer's Market to support their ideas and they're learning. So it's a way that we were exploring again using Arts education to support career connected work, especially with our most marginalized people. I would say just for them to wrap it up and then we can talk further if there are additional questions that our work is really rooted in Partnerships and relationships. I think we'd like to brag sometimes that we have a really great relationship with set up all the schools in the visual performing arts department. I'm Community Partnerships apartment that has weathered all of these changes and I think having a collective impact model where you have resources are from your respective institutions as well as committed to me Arts organizations towards this shared goal means that it live beyond some of the leadership a transitions that take place also with the career connected learning that part of creative economy effort that were working on with a weedy and osm. It's an opportunity for us to think critically about what are the ways in which we can support young people during the school day out of school time during the summer support young people who are still enrolled in high school as well as young adults only think about the future work in the priorities at the city has between young people ages 14 to 24 that has become an area that we're focused on and how come we pilot some programs and do some research and collaborate with other departments like deal and a weedy and osm and getting some of these things off the ground and then find ways to move that forward into the long-term and I think that's where we're at right now with a lot of the crate of Workforce Development effort. Brandy you'd mentioned in the beginning that the original Grant set as a goal to have. Creative Advantage in all public schools by 2022 2020-2021. It's probably more like something that we learned along the way was that there wasn't a one-size-fits-all solution for different School communities within the district. So what the essential pack Central Area Schools needed was different than what the southeast or Southwest Airlines based on what you define as the needs in each school and you're focusing person with great need is greatest. So I am what North End schools and helping them walk through a conversation around equity and access looks and sounds really different. Thank you again for joining us and thanks for all of your fantastic work. Thank you for 12 a.m. And the meeting is adjourned.", "end_time": 5729.3}]}