{"format": "raw", "annotations": [], "confidence": 0.948411212972373, "data": [{"start_time": 0, "text": "Headline news morning everyone and thank you for joining us. I wanted to tell you that this is May 13th. It's a special budget committee and it is now 10:57. Thank you all for being here. I want to recognize council member Pacheco Gonzalez O'Brien and Juarez for being here on time. So this is going to be our first committee meeting of 2019 and I believe it's probably the only one that we're going to have until we get into full-on budget coming way to go here council president hero and Council. Yes. We are all the way our way council member Harrow council member Let's see. We've got counts members who want council member herbold here? Thank you. So we're going to first receive the revenue forecast in an economic update for the year where it's will be presented by Ben Noble and are others in our city budget office and then second or second item of business is going I'm sorry. Oh, we have an agenda to approved. I will get to that second. We're going to hear from the office of our city auditor about the most recent finance and the condition report and I believe it's from the data from 2017, but we will hear about 2018 as well. So apparently called this meeting to order and I have to approve the agenda. I need directions to approving the agenda. All right, we will continue so I've identified with the items of business are going to be at before we hear the presentation from the budget office. I believe Eric son is going to give us an overview here and it would also like to mention Eric and been as you talked about this you might describe the fact that this is the second year of our 2-year biennial budget and what that actually means for the council and I know that banned from the forecast that you were darn accurate for what you expected revenues to be this year. And just for those who may be new on the council to recognize that that means that we don't have a ton of money that we're going to be able to spend over and above what we had planned in the second year. So please Eric. Thank you cheer Bagshaw members of the budget committee. I am Eric sunde of your Council Central staff. September is a ways off and departments are already hard at work throughout the city putting together the first building blocks of the way. I actually held back that up a little bit on your note about the buy new budget fall along with the 2019 budget the council endorsed a 2020 budget which provides I guess the first of several building blocks for the 2020 budget, which the council will adopt this fall but departments are hard at work on the development of the Marist proposed 2020 budget or at least the elements of it. It is typical in the off years. We might call it where we're at. The council will only be adopting a budget for next year and using the 20/20 endorsed by Resolution from last fall as a basis of comparison and not looking to a second-year endorsed budget but it is typical to have some revisions that are made made by any of them. And there's also a requirement for Emily to adopt a one-year budget for 2020 as well this fall as part of the process for putting together the marriage proposed 2020 budget Department again are working on some of their proposals for revisions defrost are going to get three revenue forecast Updates this year as is typical this this the first four 2019 will provide the revenue base for developing that proposed budget. And so if you know, it's this is not the sole forecast for rather the first of several stages of building towards the one that will ultimately back. It also provides you the budget Committee of kind of a sneak preview of not the content of the mares proposed budget, but of sort of the sense of expansion or contraction in terms of resources that will be available for that budget. This forecast will be followed in late Summer by a second Revenue forecasts that is used by the city budget office and the mayor's office to put together a like the last steps of building the proposed budget for 2020 and ensuring that it is balanced and consistent with state law and that they will be made available to the council along with Ameriprise budget in late September worth remembering always I think that any additional resources that are identified in this forecast or in the late summer forecast are not necessarily directly available for programming by the council because they will form a part of the Does budget and so that that proposal of course is subject to inflationary and other pressures that are external to the mayor's office as well as being available potentially for programming to Merrill priorities Council can of course reprogram funds as it sees fit during the adoption process, but it's in those little bit of extra resources available at this point. It's a little early to Start program news all I like to remind people. Sure, I guess the really short way to say is that the mayor will effectively have the first bite at this at any apples that are that are put forth your in the revenue forecasts and they will be available to be programmed in the proposed Council May and typically does make revisions that these are not funds that are going to be directly necessarily left on the table for the council to program in the fall. Now, of course that kind of works both ways as well. If there is a revenue forecast either if there were today which is not the case or if there were later in the summer a forecast that showed a reduction in expected revenues or even growth in revenues that is less than what is necessary to sustain expenditures the dove Rd basic basically been programmed then there's also the first to have to kind of deal with the Fallout from that reality third revenue forecast is prepared in October and typically transmitted to the council in late October early November. This is typically a smaller-scale update of the revenue forecast. Bennett plays a very similar role to the second forecast for the mayor in that they provide to cancel the opportunity to make sure that the budget that they're adopting in November. He's in fact balanced. Tell us something that we have today that we did not have last spring when we had revenue forecast is a presentation from Cindy Drake and change Uncle Office of the city auditor who are going to provide us with kind of a different look at City finances via the financial conditions report presentation. The requirement for this report is relatively new it was established by the council May 2016, and it provides kind of a big picture long-range. Look at the city's Financial Health rather than like a component of building next year's budget specifically look at comparison Sun City Finance Financial assets to its liabilities that levels and a demographic factors like population growth property by using that's what a bad thing. And so again and that is part of providing just a larger picture for financial decision-making to support all the different kinds of decisions of the city makes about resources in the long-term rather than a part of the 20/20. Pacifically said that right before you turn it over Eric. Do you have anything based upon your analysis to date that you want us to know specifically? I would say that the best fart while the the particular details kind of vary from revenue source to revenue Source the picture appears. Not entirely unlike last fall in that there is appears to be a broadly consistent special level of resources and to continue along the course. It was laid out in the endorse budget resolution last fall. It is very possible that there will be some additional resources available to program to hire priority items does broccoli look like a really substantial increase in the amount of funds that are available at this point. There may be some exceptions in particular areas. And so with that a lot will depend on what happens over the course of the summer and the second forecast as well as with the with them are put forward as I proposed starting point for the council's deliberations. Thank you very much. So Shelly turn it over to your colleagues been do you want to begin and introduce your colleagues? Obviously, we know them but for the record City budget director turkey Revenue sources will start by giving you a sense of Bob overall economic conditions at a high level of state and local market and then I need some facts on on revenues as highlighted already by your staff had seen in the fall on the budget will not start a couple of Revenue sources on the which flow into general fund technically some the witch known that are actually slightly off from forecast below forecasts that will create some challenges as well. Let's rather than give you a chance to ask questions in this specific context to the numbers. Traffic, so we'll go through this but we have are some us slides and then some Regional local slides illustrate why they don't have a lot of new money to add to the budget. So the first slide is about at the US level is about annual USA employment change as you can see on the left hand side. The green columns are actual in the book on the books numbers and moving to the right. The Reds red columns are about our forecast from our national forecast for which is IHS markit and if you'd look at about 2014-15 you see the peak in about 3 million millions of jobs added annually in this and then you see who goes to the right. You see a decline down to a trough and then you see a little a little blip up there in about 2018-2019 before it moves into the red columns, which then show a continued decline. We believe that that that flip up there in 2018-19 is due to the federal stimulus which was Eartha tax cut and an increase on spending caps and that it was significant enough to drive up employment and but if you sort of removed out what How to use a general decline from your left to your right and we believe that and actually our internet are National forecast for believes that it will just continue to decline as we move into the future with that decline generally have is slowing GDP growth. What they're projecting was that we had in 2018. We had 3% GDP growth 2019. 2.4% is what they're projecting and twenty 22% So with declining GDP you get declining employment and a sequence of other events at go on now this forecast if they're showing here, is there Baseline forecast which they attach a probability of about 60%. 60% chance of occurring they also do a pessimistic forecasts which they have. Put out at about 30% chance of happening. That's up from 20% about a year ago. So the recession talk is increasing more more comments in this next slide shows that a Wall Street Journal survey of more than 60 Business Financial and academic Economist 49% of those surveyed indicated. They thought the recession was going to begin in 2020 another 40% indicated that they thought it would begin in 2021. And so upwards of ninety percent believe we have a recession and it's going to start in 2020 or 2020-2021. Now Economist inotorious about predicting recessions and they're probably not all that great at it and some respect. So you take this with a grain of salt, but the talk is increasing that the data is beginning to show that is slowing down and so Help me with this. We know that it comes in cycles and oftentimes 10-year Cycles more or less and we're well past that now could you just described within that box? The IHS colon probability recession is 30% talk a little bit about that. I think what they do is they they look at the data and they trying to figure out the likelihood of these events occurring leading to a certain string of events employment loss of income to for families consumer expenditures would go down what's going to happen to the stock market was going to happen in the housing market if people perceive a loss of value in their home in their homes and in their asset portfolios, they may begin to contract spending and so to the best of their ability, they attach a probability to doubt those that sequence of events occurring and right now what they're saying is that they believe it's a 30% chance. Stood by as early as the first quarter of 2020 we could begin to see a recession which would be a negative growth in GDP. Not just a slow down but it will be a slow down but it would go negative. And so they're saying there's about a 30% chance of that and I think that those two indicators are both really interesting survey facts, but or circuit opinions I guess but there's a little distant that when you first look at it because the the one question is asking basically do you think is going to happen within time certain? That's where you get your 30% and the other is saying assuming that it's going to happen when will it so you don't choose like never so that's how you get the timing and the severity that way that's all up in the air. Next slide we thought it'd be helpful to put ourselves in the context of where we are in terms of our recovery in the in the region in which is generally typically, do you know the Puget Sound region King pierce? The whole lot of our data is from King and Snohomish County county is only we saw the recession occur. And then what we saw is some employment growth coming out of it largely led by going in Amazon in the early stages coming out of 29 2010. So forth the strong employment growth least of population increase people move in to take those jobs that employment growth tends to stimulate demand for housing and we've all seen that and we got slides that I'll show you that that will show all of this but demand for housing for office space. You've seen the boom obviously down in South Lake Union and so forth, but what that does is put a lot of pressure on the existing stock on the prices of those both rinse and the Facebook purchase lower the vacancy rates and Spurs construction and we have seen a large construction. Boom is all the cranes of the indicated and so forth and currently where we believe we're sitting is that we've had a weird word near the peak and moving into it a. Of slower growth and part of that shouldn't by the fact that we have been building new housing units for example, and that we have seen a leveling off of rents and home prices. And in fact a decline and that is in combination with employment growth starting to slow down Boeing put back on hiring there go out Amazon is pulled back on hiring will show a little bit of that but that generally leads to the sense that the growth of the economy is slowing and it will continue to slow and so as a result of Revenue growth will slow. Meaning. We're still at a pretty high level, but we believe it's the growth rate will slow. So moving into a pictures at the annual climate change in the Seattle metro area on the next slide. You can see coming out of the recession at the far left in 2010. You see the growth and employment in the Seattle Metropolitan Area, which is King and Snohomish Counties. And again, this light is designed with actual numbers in the dark green on the left and then the lighter shaded forecast on the right and we show the slowing their you see a peaked in 2016 2015 2016. We then saw in part due to some Boeing layoffs and so forth A Drop in 2017. What is somewhat interesting here is 2018 and 2019. The curiosity is how much of that sort of stability there in a relatively high levels due to the the federal stimulus. We don't know but otherwise you can see again the trend growth is is to a slowing level. Construction is a big part of that. This is a view of one particular sector of of employment its retail trade employment. This includes Amazon and an online sales. You can just see the Epic ramp up there from about 235,000 jobs in Seattle Metropolitan retail trade sector up to over 190017, but then it levels out as you can see in and we have state-level data that substantiates this but we believe about two-thirds of that growth of that long ramp up is due to Amazon at the leveling is is what's interesting sense of where we're going. There's a broadcast the message usually on the right side of the Scribe for you conceive before seeing a relatively stable now level of employment ridiculous in this sector and an overall. We're seeing a stalling in the rate of of job creation within the region. Area and we got a couple sites to show that this is from the Washington State Office of Financial Management. They put out of work an estimate of population in cities and counties with an April first day. We expect to get the 2019 estimate by July and we'll see what it shows but we believe it will show a decrease in population growth, but you can see the 2017 was the year of growth into Seattle of over 25,000 people and they all told between 2010-2018. We added about 122000 people to the city of Seattle. That's that pressure on housing and so far they were talking about you. Thank you. I'm back on the slide six related to retail trade employment. Can you put a little bit more detail on What proportion of jobs are represented by this particular sector? Scott to get a handle on okay is 2/3 of growth in this sector. How does that play out over 150 to 550,000 jobs in the city and send it to all of its a substantial factor of that population growth is slowing rate of growth so it again and that similarly with population in the likes of what we're we're not forecasting recessions an absolute decline. But all all indications are that we are at a slowing the rate of growth has slowed. We're not adding to maintaining a level that we're not adding to as fast as we were before. Of population growth in the we thought this is a little interesting. These are Washington drivers license this day to come to the Department of Licensing moving into the state. So these are people moving to just this isn't Seattle air. This is moving into the state of Washington from other States or elsewhere. Let me see the data goes back all the way to January of 2019 Fair number and if you look to the right you begin to see 20 January 2014, January 2015. You see that rapid ramp-up that corresponds that population growth in Seattle that I just showed you a new licenses and of interest is the more rapid rate of decline there at the far right edge of this of this chart. You see it with week. We came down from the 2016-2017 in terms of new licenses issued, but the decline is starting to increase there at the far right side of the graph. I'm likely looking for work or having secured a job. So did you get in folks who work for out-of-state who are now in the state of the Dead are available relatively timely way so I can see pretty good indication of friends are in that space. Thank you. I'm a little confused about what utility we are ascribing to slide eight. I think it's just another indication of the the pattern that we're seeing is is being shown by various different patterns of population growth of growth of discourage us from using this as one of the data points. And I think as we continue to first of all not everybody gets a driver's license. So if this data point is going to be fully inclusive of an analysis of population growth, it would include identifications that are not utilized strictly for the purposes of driving a vehicle and and you know, on top of that there are many people who are moving to Seattle in particular who are beginning to rely more on our transit system and I think that in my in my office alone out of my for legislative aides three of them do not own cars, and so I think it's there's no reason for them to have a driver's Because they don't own a car and so I think that this is could be misleading. I'm just leaving data point in terms of our ability as a city to accurately estimate. What population growth I just think this is a very out of context outdated way of viewing data sources that could give us a perspective on what are anticipated population growth and those Trends might be given data source, but I think if it has an attractive this is that a population day to take longer to get reported to us, but I think your points are well taken. Do you want to move to housing market sure as we talked about the increase in population puts pressure on the housing market and we've all been living this and what this chart shows is median rent for all rental unit. So that includes apartments condos single family homes, whatever is being rented the state of comes from Zillow. We've lost our main rental of data source, which is Dupree and Scott and so we're here but again what this shows is the rapid increase as you move into 2017-2018 Peaks and then what you see is a decline it and and sort of the leveling out and we will continue to watch this obviously very closely. But we are interested in in thinking about is that we've added a fair number of housing units about 28,000 since January 1st, 2016, and there's another about 18,000 that are on the books. Construction and what we would propose is it her theorize is that increase Supply should bring down rent should make it moderate to some degree and we are seeing some moderation and will be very interested in continuing to watch this. Next fight is about single-family home sales. When your bullet points is roughly 1 and 10 apartments are vacant and I'm I'm surprised at that number heartened because one of the things we've been trying to do is to create this landlord liaison program so we can get more people into housing that need housing and I talked with Robin Kowski from our office of housing just last week. So I'd love to know more about data for the lower-income or at least middle-income what we can do with this. So if you would follow up with me after this presentation to learn a little bit more about one-in-ten is high-end medium. Is there something here that we can really point to to help us with our forward. Hi, and I'm wondering does Zillow is there research different than to have a different approach than the former are former bacon to reports which we used to obtain from Kane and Scott and they I think Focus specifically on units that were vacant and that the property owners are actually seeking to rent. I don't know if Zillow is doing a broader. Look at not only units that the owners are seeking to rent but units that are being held as vacant for maybe investment purposes may be using That point yeah, we can provide more than that. And I think this is the read a lot of new units and this this is nothing about the price of those units in the sense that many of what they can might be high price units for low income. I'm looking at the next slide. This is the single family home sales from Northwest Multiple Listing Service of these are clothes sales and you see how the actual price of a single-family home W Century from the 2011. To the 2018. But then over the last several months about last eight nine months. We've seen some of the clients at month-over-month and year-over-year. And again, we're watching this closely because this is a huge Factor. One of the things all of this housing is based on is construction industry. This next slide shows value permits issued for construction and you can see the ramp up. My usual pattern is left to right with a pecan 2017-2017 is a bit anonymous because they were some rule change of policy changes that led to a lot of developers trying to Applications in by the end of 2016 until there was a lot of applications in 2016 that then is playing out in 2017 and 2018 in terms of permit issuance. And so that that number is a little a polymer 2017 little high on what we are seeing a 2019 though is is about approximately 5% below 2018 levels in terms of permits issued the value of permit issued and so we are seeing a Slowdown as well in our permit data. What are the factors that we are concerned about and I think Ben may have more to say about this a bit later. Is it when you think about construction and revenue we have become increasingly dependent on construction-related grabbing his hair done or contacts dream. And so when you look at the chart, you can see that 2018 was the peak year at about 116 million dollars of of construction industry related tax revenues. And so this does not include things like Finance in real estate B&O tax revenues or sales tax revenues. This is just the construction industry the builders and so forth. So this is sort of understates our dependence on construction rupnow at about 8.6% of the of the general fund in 2018 was related to the construction industry, and that makes us a little nervous. As opposed to coming up, you know, we were down in the 40s and 50s 60s. Oh, that's that's a fair thing to worry about. What is not in there is real estate excise tax example in 2018. We saw a 77 million dollars in real estate excise taxes, which was the record high Beating Heart 2007 record at 72 million. I believe in the forecast is is going forward it for it to remain pretty high and that what we have is a fair amount of commercial commercial transactions occurring I am in some residential activity starting to take the place of commercial activity. Thank you so much in terms of the data reflected slide 12 as well as slides 13. I just like to make sure that this these forecast include perfectly for some of the outer years include and are taking into account some of the legislative changes that occurred in our Washington State Legislature regarding condo development for example, and and some of the modifications made to the real estate excise tax framework. I'm like the real estate excise tax won't change the city's revenues. I think it'll be effective for the state but not the city as far as factoring in some of these other legislative changes in the forecast that leave Tom has that in there to the extent that he thinks it's it's going to make a huge change in this forecast. Versus moving forward appreciate it if in follow up we can get some additional information of what factors were taken into consideration as a specifically relates to some of the legislative modifications. We saw around some of these tax revenues that allow us a perhaps a little bit more of a window into understanding what factors were taking into the forecast, but also give us a higher level of confidence that they are more accurate forecasts. So if I met briefly on the as far as their Re-Tech specifically the state has moved to the the progressive rate read tears, but that is that is for the state. Portion of the tax, not the local option half percent of REITs. However, they did also make some modifications that don't affect the amount that the city will collect but provide some broader authority to utilize a half of the revenue the Ritu category for Investments related to housing for the homeless. And so that doesn't drive the numbers that there that they're putting forward and it how much but rather what can be done with it and create some potential interesting questions about Choices between the newly authorized uses and some of the things that would otherwise be done with the money. Thank you. That sort of my recollection from the legislative session as well. I suppose it that leads me down another path which is whether or not the forecasts are subject to having that level of granular detail that you just described. So given the amount of tax revenue that we anticipate being able to be subject to local collection. If we sort of layer on top some of the legislative actions that occurred then how much can we anticipate now being available for some of those competing priorities that you laid out but in my mind, you know, how many I'd like to get a better sense now how many dollars we think we might have available for discretionary using appropriation for affordable housing in particular. Tips to show annual growth of the general fund tax revenue increased significantly beginning 2014 through 2018 up above 5% each year. This is from the black line with the diamonds in it that that's Seattle CPI. So well above sea floor. Wichita may or may not reflect the total City cost the end of the rate of growth of City cost with health care with wages etera. But it just gives you an indication of how we're doing 2018. We want to point out that there's a few factors that led to those who have large outside is growth 8% above 2018. The first is obviously a little red bit of column there which is a sweetened beverage tax. We added that added about 22 million dollars to revenues last year the other changes similarly our policy changes of some sort. We increased the tax base because of the of the state that the Wayfair decision which increased taxation on internet sales. So remote sellers were obligated to pay sales tax associate Washington in there for the city of Seattle that's increased revenues, maybe 3 4 to 5 million dollars beginning in 2018, and that will continue forward. And then we also increase the B&O tax rate by by 2% and that in 2018. That was the last of a series of increases. It got us up to a maximum B&O tax rates. I'm just a suggestion my senses. This is telling us a little bit about how revenues relate to CPI and are we kind of keeping up and so obviously inflation is one measure that the the growth of population is another one. That's really big. I think of the things we do, you know number First Responders play field areas Library hours and if there's a way to combine those two to see how population growth and CPI are relative to in other measures that would be useful thing for me to pretend to population, but they certainly outpaced the reasons you describe many others out case I'll pay CPI. So this is really Notion of that but it's important to descale a critical as well as you're looking at items going forward a couple of the areas that I'm very interested in it were always and my colleagues who ever been up here for a number of years will know that we are so often criticized for how we spend our money and I hear it from you need to be doing more with less at some point where the population is increasing and we are responding to ever to people's rightful demands and interest in things like what counts my bro Brian just brought up, you know better or Library hours whether it's more parts more parts hours for the road conditions are better and particularly. Now as we are responding to people who are homeless and trying to get facilities open that are meeting the needs and responding to the demands for a no cleaner city streets and so on. I would love for us in the next few weeks to begin to collect that the revenues are coming in are good. But what we are spending our money on particularly around responses to homelessness, and I know we'll be talking more with HSV with o h we've got the emergency response setup. We now have many things to our fire department for the work they're doing around lower cutie, but I'd like to get a list of that so we could actually come back we do it every October but I'd rather have it before we're dealing with a budget so we can see areas that Investments are the working areas where we think we need to do differently. So I'm going to ask the four of you to be working with my office on that so we can have a real good handle on how we're spending those monies and what are the underlying policies? Brittany give it some contacts, but absolutely pump for the sweetened beverage tax in 2018, but not a subsequent one for 2019 and 2022 dollars are still there and they are growing but they're just growing in a much smaller rate. So they're not adding as much of a percentage growth change sweetened not sweating weird. Call random really put us into the nannies, projected growth, which I appreciate a sort of on top of what we already expect to have is this like conservative estimate is it he just talked to me a little bit more about the methodology in the forecasting cuz I think in the past yours will in the last couple years. There's been criticism about how the city had initially made forecast for estimates about what we would know what we would receive and revenue and we have far exceeded those revenues and I think that argument has been utilized unfortunately as a as a argument against on the sweetened beverage tax and in favor of you know, we're appealing it someday cuz it's not meeting its intended policy. One of the stated policy goals of reducing dependence on sweetened beverage has the day been directly involved at a high level 222 million dollars from the sweetened beverage tax that represents. You can see on the graph overall and revenue Source we did systematically under forecast what those revenues would be and the reason to put it succinctly is it until we started to text soda sweetened beverages. We had no idea what level of consumption occurred in the city. There was no there's no way no, we collect sales tax, but we don't people don't report what that sales tax is paid on and Videos of sweetened beverages are sold in Solvang restaurants, Oregon. We don't necessarily, but we don't have an itemization. So we didn't we didn't know I was being consumed in the city if you think about that that's both residents at home and an end and it restaurants but also our entire daytime population of employees. So some National Data that was indicative of the total volume of soda sales in various communities and we had a little bit of information from California in particular where they had such attacks in the pattern of consumption are is potentially different day because it's different people and because their balance between if you will nighttime population and daytime work population are different, I mean employment center, so it's not like it's completely different but it's the proportionalities could be different. So weird about the forecast of about 15 or 16 million dollars if I recall and what we see now is that it's closer to 22. What we do not see or have no reason to conclude is that the soda tax is somehow not just not had its attacks in Syria had to express a desire to discourage the consumption of soda. It was essentially a few Willa syntax of a form. We don't know what level of consumption of soda was before the tax. We know the level of consumption now if you were still at the taxes being rolled out if you will ever know what you're into that but it was a complicated tax cuz it's actually a cyst on the distribution. So we setting up the channels by which the money was paid to the city took a little while in case we have no reason to think that the soda tax is not discouraging consumption, but we don't have data to prove it either and I'm getting into the reason of the forecast is that we were conservative in in estimating with those Figures were that is our bed because we don't want to over-promise and then she will under deliver. I'm at this point, but the years experience We think we've got this just about right but I I don't doubt that it does you could continue to slightly outpaced and you'll see we have a provision as a result of the final numbers for 2018 as well over simplified what the policy intent was around the the sweetened beverage tax purposes of framing up a question that I just asked you and I recognize that there are the this is a multi-faceted. This was a multi-faceted effort that was fueled by a lot of different policy motivations one of which was not necessarily to you know, immediately see the reduction of sweetened beverages, but certainly to provide a revenue source that would allow us the opportunity to better educate and inform consumers who ingest sweetened beverages at a disproportionate rate that has some really disparage Public Health outcomes. Of course, there was a lot of other until There is well along with it, you know, alongside Early Education Investments and also, you know food insecurity throughout the city, so I don't want my question to be perceived as as as one that is squarely focus on just a reduction of conception cuz I recognize that was an oversimplification of what the intricacies of the policy actually appreciate the clarity on the the budget fiscal reality of us not really understanding or not knowing how much is consumed and then the complexities and how we going to collect it. I just want to flag though for the public that the public health perspective there is extensive work being done to maybe not it will be informative for Budget purposes, but not totally telling to really establish a baseline of consumption and monitor that overtime and they went out to some surveys after was. Pause before was implemented again. It may not be comprehensive enough to dictate budget, but it's more to look at the public health Trends to see what's happening. And so as those numbers continue to come in that might be informative to have the state as well on and you will all said they'd run proportion. I'm population going to try to help scale at it. So as we see Trends over time, this will be actual revealed these winter mission to have going forward for my colleagues here. We've got three more pages discussing revenue and forecast risks and the general fund update. We also have after this a financial condition report from our Auditors and we have public comment after that. So please Play so we can go quickly to the stable depending on how many questions you might have. This is the table. We generally presented shows three years 2018 19 and 20 going across the top and the property tax in sure. Probably take the tax instruments and revenue instruments are down the left-hand side. We show actuals or revise forecast in the non shaded columns. And then the Shaded call into the change from our November forecast, which was the basis of the 2019 adopted 20/20 indoors budget. I think the the the big story is the grand total row about halfway down the page where you can see that in the gray shaded columns protective 2019-2020 for emphasis here adding about 3.7 million in 2019, and about 2.8 million + 2020 over the previous forecast exactly. As you said at the beginning cast member that shot. There's not a lot of new revenues being added here. We need to just dance just under 1.4 billion for each of those two years that the difference between you now as it is less than $49 a year and actually, you know in total are just over six. The 2.8 billion and expected revenues over all that same time. Same time. But in the dryer tension to 2018 in that grand total line uc30 for almost 35 million dollars most of that as you can see his coming from that other generals of fun Revenue category just above that the thing to know about that line and it's important is that most of that Revenue has direct expenditure is associated with it. So these are grants that we receive or reimbursements for payments for services delivered or the transfers from one Department to into the general fund and what have you for services rendered. So it's it's it's not really new available discretionary Revenue to spend It's already been a recall on it. Diaper in particular supplemental old included a bunch of time. So that's every time there is this big bump in that category? And again, it's really most of it is Grants or else it's so it's not it's not net money available to the general fund of the figures for 19 and 20 that doesn't come in a box of those however are forecasting originally expected and it don't immediately have a call on them in a moment. I'm going to give you a sense of what I see the impact on overall general fund fund revenues. Not Unusual I'm going to give you a sense of what's changing the projections he reminds me of that the Council made last year and I think we've got a an initial response saying we didn't have enough information and that relates specifically to the short term rental tax as customer backside notes. This looks like we might be forecasting a reduction in what was previously forecast could you provide I intended to have an effective date of October one 2018 which would have meant we would have had a quarter of Revenue that we would have seen in the first quarter 2019 implying that we would get a full year of revenue for 2019 the Department of Revenue move the effective date of that tax back to January one 2019. And so what we've done is we've lost a quarter of Revenue since what we originally predicted that about 10.5 million is reduced by that loss of a quarter of Revenue just because of the way it's being administered. And given their time. It's shifting out of 2019 into 2020. So given that the council asked for the sly report and under the leadership of count. Are mosquitoes not here today. The interest was specifically focused on whether or not there might be Revenue that the council could consider using its Bond authority to bond against for housing in the future and given that the the projection is less to do with an accurate forecast in more to do with the timing. I'm wondering if we could go back and I think the Spy report that we got a couple of months ago said that we didn't have the information it seems like maybe we we do have a little bit more information than we thought we did if we could go back and take a look at that. We was time to responses and we didn't have this information. I am all the more interesting development. I don't think just so you're from a policy perspective. It has significant impacts week this money, as you know, a significant share of it is is dedicated to Apple development. And then also to affordable housing given the timing on the likely draw the demand for those resources, think is really just a question that will be able to handle this year. We weren't expecting to put the money out the door. So don't think of force policy shifts there and should be able to answer that question. Cancel before we leave this page to talk about some of these other ones head and you highlighted one of them house number for a little bit. I did also want to know if we shift below to the greenbox. It's the first of all beverage side. So the line directly above I want to know that for the comments. He made a couple moments ago we have once again revise those forecast in revise them upward. So there will be some additional resource flowing into the revenue stream. He's purposely not listed in that grand total because although it is technically a general fund Source has a number of dedicated purpose or purposely keeping those out and we are going to bring you legislation extra for both this and a short term rental tax with the budget that will act formally move the key sources out of the general fund and put them into their own special funds going forward. That was another request in a Sly and all the way I asked for you and unresponsive with a budget cuz it just cleaner for my accounting perspective not to switch mid-year, but the other point about segregating the funds and keeping track of the make sense to us. Well, that'll be someone time resource available in 28 so that the 2018 money is on the sweetened beverage side. I think the way to think about them is one time cuz I thought just wanted to be that is not sitting is a fund balance, but for 19 and 24 million that will be ongoing revenues that will be able to program and started initial consultation with the citizens Advisory board about the potential use of those revenues. So I get home bring your proposals on those we mentioned already short term rental tax receipt one-time drop their moving to the green and these are funds are really not in the general fund already there track separately. So real size scuse me real estate excise tax. There's something to change at the state level overall not to are these are specific revenue streams the city gets directly to a quarter percent taxes on real estate one is Route 1 in the other is to what we saw. Actual for 2018 fell so much shorter forecast and given what we're seeing in the prices in the market stabilizing. We're reducing the forecast for 19 and 20 until about an average of 3 million a year as those funds were appropriated. So we have appropriated more money in 19 and 20 from read then we no longer delete any longer expect to get so we're going to adjust those Appropriations and we're looking at that now and look at where we can we can make suggestions for you to reduce expectation here again, so maybe opportunities at reduced Appropriations to project that weren't actually going to write checks out the door this year so we can minimize impacts on the ground. But now that is a real issue that we are we are dealing with now commercial parking tax on commercial. We had projected growth in 2018 and Beyond in that stream and what we saw it to a significant surprise at 2018 is that there was not not an increase in actual revenues from the commercial property tax late flattened out there, but we have brought the forecast for the US. It's actually sort that we have issue debt against so we're going to do some work and bring you some proposals on how to address this shortfall as well and then a small change in the commercial. Excuse me in a school zone camera fun, but read and Commercial going to require changes in Appropriations for 19 and 20 in the negative direction. If you will then we will bring the proposals for those with the budget if not before. All right. Not what we want to hear of course, but thank you for that forecast risks and then general fund update. So I'm not on the risks. I don't believe we've talked to most listened at the national level. I was going to refresh not the way we should be doing forecast. When I checked a couple minutes ago only to say that there is a good deal of uncertainty at the national and international level in that. That was a sell-off that was triggered by developing trade with China trade dependent region. I'm not telling you anything. You don't know if this is real time concern out there. So and specifically cited are tariffs and trade War we're projecting a flattening but not a dramatic drop in construction activity locally, but that we can share of revenues Amazon has been a driver of the local economy through its simplest retiring. There's nothing else we expecting that to have to have slowed and flattened and obviously going is going to be difficult circumstance right now and impact of the 787 Max issues on local production and employment. So much to be determined that are clearly not in the positive direction bowling is a smaller share of Our Kind has been in the past but it's putting in those are high paid jobs that have important impacts overall. So we talked a little bit about what supplies on the on the budget side. So this is the general fund in in all end. The fund balance is that we are expecting such on a walk you through this and give you sent the bottom line and how tight things remain and some of our from the budget office perspective response. So we we started the year with just under sixty four million dollars that included some significant reserves in particular related to the the police officer Guild contract that was that was settled in 2018 retro payments that went out accordingly and we took in 1.34 billion the budget total expenditures. We're just over that again required to rely on some of the fund balance. And then this last address and number of outstanding issues among other things. We are negotiating with the city's unions around wagin and compensation for 1920 N B & Beyond so bottom line, we ended 2018 with a fund balance in the general fund of a guy on reserve fund balance of R 22.5 that's within a half a million dollars of what we had projected. So we are spots on their back or not in excess. I candidly had hoped that we would finish of money we finished at the end of the year. Like we're not even Eighteen with with those kinds of fungible one-time resource. We are the 22 million is exactly what we need to carry into 2019. Revenues about 1.4 billion expenditures some of what you see in this line is not yet reflected in the budget. We're about to bring you the carry forward ordinance that will take some of the budget Authority from 18 and bring it into 2019 in particular unspent Grant resources are some of that. We carry forward so and then again, we're starting to build up this reserves for unanticipated expenditure to see that build up in 19 and 20 the bottom line. If you fall asleep when we when you adopted the budget in the fall, we expected the fund balance at the end of 2022 B 0 this would show that there might be as much as five million dollars available 4.9 and again relative to expenditures / 19 and 20 of of 2.8 billion that margin is very very thin. It's not red. It's not negative so I can take some solace in that but any small change in the situation So we are on a very thin Edge as we anticipated cost of this process in which we do in January February March apartments that they should consider their doors budget to be their budget we so we have not we're not running a budget process this year that is trying to see if you will throw open the full range of of of expenditures and policy issues at that the Department's might be facing we have it on your budget you formally adopted 2019 and endorse 20/20 without a significant shift and revenue which again is what we're seeing. It makes sense the 2020 be the basis for our budget. So we have only been asking departments for situations where they need to change oil filter 2020 and almost all circumstances. We have told them if they Need to change the location. They should assume that they're going to have to find the resources within their existing 2020 projected allocations. So we can we don't see significant new revenue on the horizon budget process on the executive side is is being money to pay too much in an hour away then perhaps otherwise and relying on the decisions that underlie 20/20 which are largely to reproduce What was done in 2019. I was there someone time issues and don'ts there's some things that are ramping up to give you an idea. I mean no Financial pressure is the office of the Ombudsman was budgeted a relatively low-level recognize and it probably needs to get staffed up some in order to be effective there the internal employment move the investigation functions employment investigation functions internal investigation functions that had been last individual departments into a centriole function in a jar that's going to require some juggling. Resources and potentially some investment and resources as well continue into moderate judgment and claims Oregon news is not is not wonderful from things that have already been put into motion that we are managing but managing a very thin margin. Thank you. Cancel. The exercise that you go through every year it would be helpful for me to understand what exactly I mean, maybe this is what we've we've been talking about this whole presentation about Productions around winter receptions going to head but this time last year you were projecting a negative fund balance of 28 million for 2019 and a -53 million for 2020 is it's just simply a recession that has not yet started yet or is there more to it than that revenues probably came in somewhat higher than we had forecast and there were expenditure risks that we have been managed able to manage in different ways. So we are by definition obligated to bring you a balanced budget. So when I showed you those those figures this time last year, I give you a sense of the challenge. We are facing then that we knew if we could try to reproduce everything that was on the table. That's what it might have caught. We then took took a chapter from both directions about how do we reduce the expenditures that are bitter been proposed and then also as appropriate are the opportunities and revenue side either legislatively or because Local Economic conditions are changing. Thank you. I'd want to acknowledge one thing and then councilmember Gonzalez been what I appreciate about this. I know that it's always challenging and we always want more like everybody else but I'm appreciative of the fact that your revenues and the forecast have been so close to spot on that. It's very helpful for us to be able to rely upon that and know that we're not going to have to know what we would love to have to spend coming up. But thank you for being so direct about this and a clear and I acknowledge your team and David George Eric to it's been very it's great working with you and knowing that we can count on these numbers being as after his absence Tom Kern who is normally went one of the Horseman here if you will and has been the author of our regional forecast for 10 plus years. Vacations in the blast last meeting with you. All I just said I do really need and want to honor the work he has done he is George and Dave buddy is Ben Hur The Rock upon which our forecast has been billed for some time. We're in the midst of hiring a replacement and creating opportunity for there to be a smooth transition, but it won't be the same and give Tom our thanks and best chance. So we are well into May and our first quarter ended in March and I'm just curious as to why we don't yet have quarter one supplemental budget before us and can you talk to us a little bit about why and when we might be able to anticipate it Your backs on The Eccentric cetera. We're not sending a first-quarter supplemental. We're going to send a second quarter supplemental cover a request for 1st n and that is being prepared as we speak again given where we are with resources given that we have the 20/20 endorse as well as a 2019 adopted we weren't in a position to really into typically require supplemental is is request for additional funding it really entertain another pieces. If I grant Acceptance in the life, we thought we could largely postpone and take up in June in particular. There was a real DS stand acceptance 4S. Is a taken enough money on an in a timely way that we needed to handle separately. But I'm Kendall budget is the budget of the resources that are available in and spending needs to be managed within that rather than the assumption that there will be an opportunity. Revised forecast are indicating that there are additional Revenue. Alright, well, thank you. If there are no further questions will say thank you for this for this projection, and I'm like to move forward right now with the financial condition 2017 report. Thank you very much for all of you. Who came? Thank you and welcome, and if I may ask for introductions because David Jones told me last week that he wouldn't be joining us. So please go ahead City auditor Jane Dunkel office of City auditor. Thank you for being here with us. Thank you for having us here today. I'm just going to provide a little bit of background and then hand it over to change Uncle who did all the work on the project go ahead and switch to the first. The report is required by city ordinance in the intent was both to provide a general context for Council Members when determining a making budget decisions, and it was also to provide the public with information about the city's Financial condition. One thing I wanted to emphasize up front is where is you were just hearing from the budget office forecast and projections going forward. This report is Looking Backward and it's providing a picture of the city's Financial condition as of the end of 2017. And the reason we cut off our analysis A 2017 is because that's the last year for which the city has audited financial statements and that's the primary data source, which were using for for work. And then the last thing is that the report includes data on 30 different indicators and it also presents 10 years of data for several of these indicators with the goal being to provide some long-term Financial Trends, but for the sake of our discussion today James just going to discuss a handful of these if there's some you'd like some more information on or we can provide you with something else outside of the meeting. We're happy to do that in the battle. Turn it over to Jane. Okay. Good morning. Let's see. We're going to start with our conclusions just to make it easy through 2017. Most of the financial indicators That We examined for the city of Seattle or positive and there are examples of those on the sheet and I won't go over them cuz I'm going to talk about the first foreign more detail. The first is that the city's General government and that think non utilities everything except Seattle Public Utilities and Seattle City Light their sources of revenue are fairly Diversified Alma although 72% come from taxes, the types of taxes are different. So that's a good thing for the city and there's also some revenue from charges for services and grants and contributions. Another key indicator for us has is short-term liquidity and the way to think about this chart is just in your own household budget. I'm all we really saying is that the city needs to have enough cash on hand to be able to pay its bills such as or have within the year and that orange line is a one-to-one ratio that shows that you would have enough and so you can see that the city over the last 10 years has done really well on this indicator. We have more than enough to pay our bills. Annexed critical indicator is our bond rating for municipal bonds the city borrows money for major Capital Improvements as you well know spreading the cost over many years and in 2017. And as of the time of this report the city had maintained the possible highest credit ratings from the three major agencies AAA for both its voter-approved and it's Council authorized bonds. And this is good because strong credit ratings decreased borrowing cost that's considered less risky for investors. So that's good. Another good indicator is that we have to reserve funds and these are the balances over six years in our to reserve funds in millions adjusted for inflation. When is the rainy day fund which is a is money that set aside in case the revenue projections were not to come in as anticipated and the other and that's governed by city ordinance. And the other is the emergency is governed by both state law and city ordinance. And that's for natural disasters you so this is the way back machine but it's in my recollection in 2010 and 2011 when we were really having some trouble meeting our Revenue forecasts and just paying bills that we dropped down to like five million dollars in that rainy day fund but it was really just a bare-bones as I recall. I don't have the date on that right here. I just went back to 2012 cuz I think some of the definitions of the accounts. Change which is why we didn't do the full 10 years for this, but we did want to make the point that even though, you know, it's comforting to see these grow. They are there for the purpose of being used if they're needed. Someone would expect some variability overtime in the. I don't recall what the minimum balance that was reached, but they're there were those funds were actually utilized some real problems and Beth was our budget chair at that point and just trying to make sure that we can have the balanced budget relied upon That Rainy Day fun, and I know we're always trying to think about tapping it for different purposes and but just how important it is to have. Thank you. And we are just for both of these funds. We are in compliance with state and local laws for the statutory cats. So that's good as well know this next chart is due west of interest. It's so if you are a city of Seattle property tax payer and you were paying $100 of your tax 28, if it would go to the city the rest of it goes to the county state school Seattle Public Schools. This is what $1 of that 28 would power it would be divided. So it's just to give give you all an example on the right side are all voter-approved Levi. So those have to be spent for those purposes things like the move Seattle Transportation Levy family and education and on the left side of the general property tax that you all authorized through the budget process. So just do an underscore here 28% of Seattle property taxes come back directly to the city and you mentioned that of the 72% Go to the county and the state. It's interesting to me that so often we find her in the legislative session that people are angry at Seattle for one thing or another and if that much of our property taxes are going to help fund the rest of the state. I'm always curious about what we can do and how we can do better to make our friends and neighbors elsewhere in the state understand that we could be considered to be a bigger friend than often times. They think we are because we're funding but they need for education for roads as two example Statewide. Yes, that is true. It is also true that 23% Another 23% does go to Seattle schools and 15% goes to the county to to the Port of Seattle. So, you know, what is divided up the 22% goes to State schools and some other 3% of Sound Transit 3% of the park district. So so that's where the rest of that goes. But we want to just focus on what the city gets in their budget, which is only a percentage of this as well and they are things that we rely upon. Right. That's that's good point another important indicator for the city of Seattle Financial condition are as our pension liability and our main pension plan is the Seattle City Employees Retirement System the most recent Actuarial report for that was produced on January 1st, 2018 and at that point our funding ratio of 69.9% that is basically the the percent of it takes the value of the plans assets and divided by the amount that actuaries calculate the city would need to pay employees the benefits we owe them. So that means we have right now about 70% of what we need. However, the Seattle City council did commit to fully funding Sears by 20 42 and you do that through approving the employer contributions that are made every payroll along with the employee contributions, and we just wanted to say that we support that decision and hope that the city will continue to fund Sears at or above the Actuarial Determine the rate. That and there's just more more about Sears funding ratio. This is the funding ratio over 33. 33 year. It varied over time as you can see it wasn't even 100% from 1998 to 2002 lowest 62% in 2010. So slowly since 2013. It's been growing again since that commitment was made. Okay. Now I'm going to transition to some demographic and economic indicators because there's one way to look at the city of Seattle Financial condition is to look at how well the city government is managing finances and them and through 2017. The news is pretty good on that. But another thing is just look at how well people in the city themselves are doing so this first slides. We just have some selected data Army. We thought you just might you probably know this but just to confirm based on the data we have and in 2017 53% of Seattle households were Runner. So 53% of the people were living in renter occupied homes in 40% an owner-occupied and then in terms of property values, this is based on all the value of all the property in the city of Seattle regardless of owner. It's in billions unadjusted and it's from King County King County Assessor someone 2008 all the property in Seattle was worth 137 billion dollars and in 2011. It was worth $213. Dollars, so it's just kind of give you an indication of for those people lucky enough to be living in there owner-occupied homes. They've seen some substantial appreciation as we all know. Oops, I'm just because I wanted I like this little factoid but I think there's a little bit of a Nuance that sometimes people messing the city auditor got it. Right and I just want to highlight it cuz it's a fact that we use a lot. It's not that 53% of satellites are renters. It's that the housing 53% of the housing occupied by satellites is occupied by renters. And the reason why that that number might differentiate between the 10-year of individuals versus the occupancy of household is because of the household size. And so the actual pure number of renters is actually I think a little bit below 50% the percentage of households occupy physical structures occupied by renters is higher than 50% Thank you for the clarification it right. Okay. No next we wanted to do a poverty in Decatur, but we didn't just want to go use the federal poverty level. We thanks to the city demographer Diana canzoneri. She was able to connect us with dr. Diana Pierce from the Center for Women's welfare at the University of Washington. And Diana Pierce has been calculating a self-sufficiency in, measure since for 20 years. She calculates it now for 39 States the District of Columbia New York City and what this does it's a measure of income adequacy that's based on the cost of basic needs for Working Families. It takes more cost into account than the typical federal poverty measure. It takes enough to account housing child care food Healthcare transportation and it's also geographically specific. So it's much a much more realistic and terms of what families need to get by however. It's still a bare-bones budget. So in other words the food in this it's allocated in this budget is for gross. The only does not include any restaurants or take out Foods even one latte. So it's a self-sufficiency income and what we want to bring your attention to on. This one is they do it by family size and configuration. I want you to know that I'm a single parent of two children depending on their age in 2017 needed from 70000 to $82,000 a year. That's what they needed to make to live in the city of Seattle. Then we're going to take you to the next slide where we have median income by again household size and configuration in 2017. And we really just pointing out here is who's vulnerable in the city of Seattle. If you look down you see a single single dad with children the median income was 64 and a single mother 36 so you can see that you know, that's that's who's vulnerable in this city in this economy and then a few more slides with more demographic information about this. This is by Age of household and head of household. And again, you can see that the people that are at risk are young adults in our seniors. And then finally, we also want to do this by race and ethnicity for this we had to go back a few years because we had to use data from 2011 through 2015 because otherwise the sample sizes aren't big enough. And in fact, we really should look at that native Hawaiian or Pacific Islander the some other race alone because they have very high are rates on those. So we probably should have taken those out but with but the other ones are reliable estimates and we just wanted to point out like for two of them the household overall median income for these years with 70,000 and for American Indian or Alaska natives alone. It was 20 6004 black or African Americans alone. It was thirty thousand so we can just kind of showing you who's vulnerable in the city. So finally I'm too kind of loop it back to the revenue presentation that you had. We just wanted to offer a few ideas on what you might want to consider moving ahead. You might want to be aware as you pass new budgets of monitoring revenue streams that are most sensitive to changes in the economy. And that are your those are your sales and business taxes. The property taxes are a little more resilient. I'm consider whether Revenue sources for especially for new and expanding programs are sustainable monitor the pension funding ratio and continue to fund it at or above the actuary really determined rate and then anticipate increased demand for services as the economy slows, especially from these populations that are vulnerable Cancel that is our presentation and we're happy to entertain questions. Thank you for that. I really appreciate your good work. Do we have any other comments on this? Yes, please cancel my windows. Can you check? can you check a public comment sheets on the previous slide where you're talking about potential impacts of a slowing economy, and I'm taking these a sort of For lack of a better term recommendations from the city auditor's office in terms of what to watch for on the first point where you talked about the need to monitor revenue revenue streams that are most sensitive to changes in the economy. I know that both of you sat through the previous presentation. I just want to make sure that I have an understanding of which revenue streams from your perspective you are referring to specifically sales tax real estate excise tax and business and occupation tax. Those ones would be more sensitive than the property tax at least in the short-term arise and cuz there's usually on the impact of a property tax. So when you're flagging this particular issue for us you are flagging the traditional what news sources that we typically get from some of our bigger tax basis that exist within the city of Seattle. That's correct. Thank you. But thank you for that Jody just announced that they're has no one has signed up for public comment. So if there is nothing else for this the meeting is adjourned.", "end_time": 5061.8}]}