{"format": "raw", "annotations": [], "confidence": 0.9355605610526434, "data": [{"start_time": 0, "text": "Great. Good afternoon. Everybody. This is a special meeting. And so normally we do our meetings Wednesday at 2. And today we're going to start at noon council members back. Sean. Gonzales will be joining us shortly. This is the meeting of the Civic development public assets and Native communities committee. The date is Wednesday, July 17th. And the time is exactly noon, even though you have to on here as I said later bye cast member back Sean Gonzales. We will move to approval of the agenda and I just under an objection to the agenda will be adopted and I'll go into the chairs report. We have four items on the on our agenda today at we're running on the kind of tight schedule which includes three pieces of legislation buy a parks department followed by a presentation or first item up is a duwamish Waterway Park acquisition just cancel Bill 11958 to which on request authorization for the purchase of a parcel of land located. In the duwamish Waterway park that is currently owned by King County this land sits in district-1. I understand the cost is about 1 million is 1.2 acres in the address at this property is 7900 10th Avenue South. What I understand is that the city staff perform due diligence which included obtaining soil samples that revealed low-level arsenic in soil below the grass and some discreet hot spots with high concentrations and soil at the north side of the end of the site. The sea will probably perform a remedial action on a position of the parcel to remove the contamination, even though the locations in concentrations currently do not present in media public Hazard King County was notified and they've agreed to reduce the purchase price by $100,000 sufficient funds for the siege of Reform of the remediation. This is compliant with the requirement to pay fair market value for the property while the city rains responsible for any park remediation cost exceeding Thousand dollars the results of the due diligence investigation indicate that exceeding the cost estimate is very unlikely in addition City staff with the assistance of the Law Department negotiated that King County retains all liability associated with the contaminated releases from the property that are being remediated through epa's lower duwamish Waterway Superfund sentiment clean up camp and all that was very long-winded thinking again between all those facts in there are second item is cancel bill, but one 19588 is called the sun park donation sun stands for saving Urban nature. Welcome casero Gonzalez. This is a piece of all this is an ordinance that authorizes acceptance of a donation of real property and cash to the sale of Parks and Recreation Department. This is in the heart of the U District 40 on North East 43rd and 9th Avenue destination is from our friends at for Torah Ohr Torah Northwest and the donation is to be used for open space Park and Recreation purposes, and I look forward to hearing more about Opportunity the cash donation is allowed under current law and prior legislation relating to the park land acquisition fund and building for the future. Our third item is a bill that authorizes the acceptance of another gift from Friends of Christy Park pieces of artwork to be installed in Christy park for public. Use Chrissy park is located in the University District. I look forward to hearing more about the background of the art pieces friends of Christy Park are represented by a group of Taiwanese Americans in this donation celebrates their culture and friendship between two people Seattle in Taiwan. Did I get that right on the first one on the address? Yeah, I just got them cuz there's two two two donations that were going on and the ordinance for the property. And finally we will receive a brief presentation from Outdoors for all our friends for Magnuson Park a local program dedicated to enriching the quality of life for children and adults with disabilities through outdoor recreation. So if that will that's debrief chairs report will start with public comment and today public comment is limited to 5 minutes. So how many people do we have signed up if two people signed up, so I'll know if you could come forward and state your name and speak to an add-on item on the agenda. You have 2 minutes for being here today. So come on up and we'll start the clock when you begin speaking. First we have Leslie, right and then Janice camp. Good afternoon. I'm pleased to be able to be here today on behalf of the founders of sunpark amick and Dixie Porter, its steering committee and friends and supporters. This park is located at the corner of 47th Avenue Northeast and Northeast 47th Street in Seattle. Sun stands for saving Urban nature in 2007 sun was the vision created through the purchase of a small City corner lot from a developer who plan to replace one old original Farmhouse and its remaining Orchard with three new houses funded in part by a $15,000 neighborhood Grant neighbors and community members for participated in a design process as well as tireless fundraising from which a unique native plant garden was designed and built. I need an official overseer. The property was deeded through an agreement to Cascade Land Conservancy now for Tara. I'm sorry. That's what I thought. I did catch that. I'm sorry. I apologize. I had him in Reverse. I thought I did. Thank you for correcting me. Cascade Land Conservancy now for Tara with the hope that sun park would be acquired by Seattle Parks and Recreation at some point in the future and that time is now in addition a significant maintenance fund of $100,000 was raised by son volunteers over years and is being offered to parks for the purpose of future Acquisitions over the 12th pass tiers. The sun team has envisioned Bill tweeted refined nurtured mulched and we did some more volunteers than men at least once a month to weed and sweep and some people have met several times a month to weed and sweet to keep the screen corner well-maintained and visibly cared for in an appreciative neighborhood sun is directly across the street from the Laurelhurst Elementary School and teachers have used it as an extended classroom a laboratory of native Pacific Northwest plants. Small children from the neighborhood's many Child Care Facilities. Enjoy wandering around this mini Green Space on their walks teenagers waiting early in the mornings for their school buses off and hang out on the benches there as do the parents and grandparents waiting to pick up kids from the elementary school. We are so pleased to be able to make this gift to Seattle Parks and Recreation friends of Fun Park will work closely with parks to ensure its Continued Care and enjoyment for all thank you. Thank you. Thank you so much for all your work. I know a lot of folks in Laurelhurst have done a great deal not just on that part, but on other so regards and thank you very much. My name is Janice camping. And I'm a member of the steering committee for the sun park and I'm speaking with regard to cancel Bill one 19588 the sun park donation. I just wanted to reiterate what Leslie had to say that this has been a source of community Gathering and community-building for 12 years. Not just for the people who are on the steering committee, but for many other people in our community, we have a commitment to continue to work with Parks maintenance to keep the park looking good over the next foreseeable future because it's so much fun fun for us to weed and go and meet there. So we will continue to support the park the fundraising efforts over the last 12 years is Leslie's mentioned raised over $100,000. It has helped us maintain the park and we're happy and proud to be able to donate that to the city so they can acquire Park. And other neighborhood so they too can have a community building location. So thank you very much and we hope the city enjoys Park. Okay. So with that we will go ahead and close private comment. So we'll have our first folks to come on up here on our items of business. That is the duwamish Waterway acquisition. I know that we were briefed on that. I know that my call is before I want to hear a little bit more. I shared a little bit. So I'm going to let you guys state your name and read into the record Nikki you want to go and read into the record or you want me to? Both of your presentation. Go ahead. Item one Council Bill 11958 to an ordinance relating to the Department of Parks and Recreation authorizing the acquisition of real property commonly known as 7900 10th Avenue South authorizing acceptance of a recording of the deed for open space Park and Recreation purposes and ratifying confirming certain prior Acts. All right, go ahead and Tracy Russell Council Central staff. lease Ford senior Real Property agent parks and recreation parks and recreation I'm actually at least go through presentation. But as you said this is an exciting opportunity for us to acquire the spark that we've actually been working in for over 40 years in the park. I thank you for your time today. This is a its while it's not adding a a new park to the city. This is permanently protecting a park that's been operating in SouthPark for over forty years. So we're really excited about that. There's a pending Redevelopment project that kind of drove this process to sort of solidify our ownership. This park is 1.38 acres in size. And as you can see on the picture of the large a large very large portion of it was actually owned in fee by Kane County all of these years that we've been operating a public park there. So the development project drove this opportunity to negotiate with King County to acquire the property in for just about there. It's still learning how to use this thing. So it's it's significant acquisition in size. When .26 Acres. The purchase price is a million dollars of Park District Fine Arts council member where is described earlier King County reduce the price by $100,000 to cover the cost of its sight reading remediation and will be able to consolidate our ownership for permitting purposes for the development project and provide a part to the South Park Community for years to come. Drain water access therefore the beaches is on the bottom part of the slide there at those sort of the right-of-way. You can see the Sandy area there. This is just a kind of develop schematic showing what the community and Seattle Parks foundation and park staff have been working on for several years now. Seattle Parks Foundation has done a fundraising campaign to help raise money for the improvements to this park. They have all the money for the improvements. They're virtually there yet. Question, I assume the neighborhood's thrilled that are absolutely thrilled and of course they want things to go faster, but gaining the momentum now, and then certainly acquiring the property is going to be the big milestone that helps Drive things. Okay, Jessie, when I add Max that's perfect position. So I will move forward on that. I am right now, so I moved the committee passed cancel Bill 11958 to all those in favor say I know the eyes have it and this passes and we're beautiful cancel Monday. So what we want item number to Belmont Street to the record is cancel Bill one 19588. This is the sun park donation Sun standing for saving Urban nature. Did it against her? Okay, so we can go ahead and say it again for the record your name and then we'll go through your presentation on this matter as well. Seattle Parks and Recreation Be towards Seattle Parks and Recreation. Cast members thanks so much for sharing this item today and has the community community members introduced item. We're all thrilled to be here. This is a great story of community building and developing a space that really has been a community Gathering and it's just wonderful that now turn it over to the park system, which was always part of the vision. This is a well-loved community neighborhood park and the S as we talked about the community as an amazing job of not only Gathering that the donations and working through a grant to acquire the property in the first place, but also develop it in a really beautiful wave got a picture here that you were doing a lot of work with it maintaining over the years and on top of that developing a significant War chest for originally were talking about future maintenance of the park will be ultimately thought the better use of that money was put it back into the park district acquisition fund so that we can fuel Acquisitions another neighborhoods. So I think that's kind of the essence of this transaction that is if parks department is thrilled to be to be taking this into the system. It's a wonderful place for the community and for the the larger City and it's a really nice model. Do any questions from my colleagues? Again, very thankful to the Laurelhurst neighborhood for doing this. Yeah, I'm sorry. I got the address wrong. I don't know why I got it in my head that this was near the U District 1. This is just down the hill up in Laurelhurst. So I want to thank the people that came and gave public comment and give us the information cuz I know you guys have been working on this for a while. Is there anything else you want to add before me forward? All right. So I move the committee pass. Cancel Bill one 19588 all those in favor. Say I suppose no eyes have it in this passes. So we're just getting all this land and park and money. Thank you. Thank you. Let's move to item number three. Okay, go ahead and green Council Bill 11958 7 + events relating to Seattle Parks and Recreation authorizing the acceptance of a gift of three art pieces and art titles entitled Explorer Voyage from the friends of Christy Park to be installed in Christy park for public use great. Let's go and do introductions again always for the record and it will move forward. chitty bang Capital project coordinator, Seattle Parks and Recreation This is the one that I was looking at. The other one was an exciting but I was thinking this is right in the heart of the u-district. I know exactly where that's at. So I'm excited to hear your presentation on this. Okay. Thank you very much. Thanks for taking the time today to hear. This piece has the Christy Park art donation. And this art piece is in a collaboration with the expansion of Christy Park. Christy Park is currently it's in the U District. It's on 43rd and 8th Avenue. It was the old at Seattle City Light as substation the Mimi substation, the park development is going to increase the size of the park to fold. So we have attained a parcel to the South the artwork is in collaboration with this design and I'd let you know the project or not to bid on Monday so that the capital Improvement for the park is currently. Under bed. The Explorer Voyage art piece is a celebration of the Taiwanese Community. We have a very active Community here and they've been really great. I'm working with us through this park development. Who is James Christie? I'm sorry James. Christie is the namesake of the park as well? And he was an Explorer. So the Explorer Voyage concept comes from the time when he's community and the bad boats that are associated with Taiwan in the way that they travel and then exploring as well Kristy Parker James Christie was in the Explorer and Explorer Voyage concept comes from the University of Washington and the campus nearby the concept came with the community the students that are there are kind of an exploration stage of their life. So that's kind of the threefold part of the Explorer Voyage asking to the heart. Please. For canoes. Are they going to be climbable for kids can they get in and out of them? Are you going to finish them off? So it's so they are not going to be fenced off just the idea is that there are benches that are collaborative and used as benches for the park. Paul story is the artist if you guys are familiar he did on salmon waves at Ballard Locks. He also did a coffee pot for Glen. He's done a lot of local art for the city. So his main media is stainless steel. I'm very durable. So we've been working very closely with Armenian Center shops as well for this donation. Oh, okay. So that idea of the art are that we have these three boats and then they have them they're going to crescent-shaped kind of reminiscent of about witches from Taiwan and then they have this wood sliding on them too so that they can beat them suitable and behind that you can kind of see these walls. There would be some cultural representation of Taiwanese culture with some tiling there on the back. I should say to that. It's a $50,000 donation and Claire Chen on Friends of Christy Park. She was the owner of the lots of the South. So the reason we're coming to this Council today and it's part of this is that in the deed of a property the donation of some sort was part of that written in the deed to the sale of the park for the South parcel. Oh, okay. So we don't always have our donations but and then we have a maintenance and down in a $6,000 time to the parks department for maintenance. This is showing the public Outreach process and the collaboration with U District partnership. They are the fiscal sponsor for the donation and four the maintenance. We had three public meetings to go over the park design as well as the art Eman. I like I said of the classification with the friends up group as well. Very active great support. And that's all I have any questions. I think I think we're okay. Unless one of my colleagues have a question. We can move forward the pictures and then page numbers in front of an ongoing joke. We have earbuds are points of each time. I move the committee pass. Cancel Bill one 19587 all those in favor. And so it passes and wings Temple committee Monday. Thank you again for the great work on City Hall Park. We just walk through it again today yet again. And all of what you promised to do is being done. I want to say thank you to you polikoff who's here and Christopher and folks and my next ongoing request of course is on the Prefontaine Fountain. One of the things I sent out yesterday was something that's Seattle Center is doing around one of their big fountains and the effort they're doing is sending out a survey to everybody in the neighborhood around saying what do you want to see? How would you like to see this? I think I would be a great first step that we could do to start collecting information that on top of what we did just last month on the public use survey that starts doing what turned up is that from Public Safety Public Health public good everything is that if we can move the fountain so that the sight lines were improved that would be just so important and I'd really like to see us have a plan for that this year. We have our friends introduced themselves and then I'll say a few words and then we'll start the presentation with the outdoors for all Foundation quite so I should add that. These are friends for Magnuson Park and I've had an opportunity to come out and see the work that you guys have done and actually get on the bikes and do a torso. Thank you very much and thank you very much for being here. I wanted you guys have an opportunity for the community and the public to see what you do. I know a few of the council members have been out there as well. So I'm looking forward to your presentation page numbers in the bottom right corner, and I know there's stripe sometimes in our city. We are here Alicia and I are here to talk about some really good news that's happening in particular our collaboration with the city both the Parks and Recreation Department and the Department of Transportation in 40 years ago here in Seattle for a nonprofit and our mission is to enrich the quality of life for children and adults with disabilities through outdoor recreation why we exist Going to get my we started in 1979. We were teaching skiing to children with disabilities because their friends who did not have disabilities had opportunities to go skiing and if the kids with disabilities did not so the organization started at the ski for all Foundation had 35 children that first year. We've gone a little bit. 2924 Unique Individuals with disability active in our programs this last year the activities we include Alicia will reference a little bit more of that. If you go shopping at REI, those are a lot of the activities that we do. We particularly appreciate the fact that we're at Magnuson Park where we offer both experienced expertise and enthusiasm the work that we're doing experience in that we got 40 Years of not only helping recovering veterans people born with disability people encounter disability there in life, but that experience goes with an expertise. So folks like Alicia who's a certified therapeutic recreation specialist. We have multiple ctrs is on our staff. There are physical therapist there occupational therapist there also Recreation therapist, and we have a credible dedicated team of folks were committed to doing this work importantly. We have the enthusiasm to do this work as well. Our programs are supported by over 850 volunteers each year. These are individuals and group members that come from all different corners of the greater Seattle region greater Puget Sound region that how to give their time and talent to our participants in many cases. We see returning volunteers coming season after season, and we have a handful of volunteers that have been without doors for all are really whiskey for all sins are foundations for over 40 years. We support individuals with all types of disabilities ranging from physical disabilities intellectual development. Dempsey's main developmental disabilities and sensory impairments and tire age ranges. Well our youngest participant this year has been three and our oldest participant so far has been the leaves over the age of 90 in our cycling program. I was on one of those bikes and that's not easy. He was be happy to know I actually got on the bike is hard. I heard your bike's okay, if a bike sit there and I didn't want to leave it alone struggle with Ms. So I was a little my balance is really bad. So and it was really good to me getting on the bike that day plus you had some other people there that are struggling with much more disabilities in myself and they were whizzing by me. So I quit being a big fat baby so you shamed me into a pretty much so While our programs are mostly supported by volunteers. We do have a full-time staff of 22 individuals that support the planning process and it's during year-round time during the year round. We have Four Season 22 staff members throughout the summer that we also employ an additional 28 individuals to help support our summer season. And if you take a look at the photo on the screen what you may see is just a gal out enjoying kayaking what you don't see is Her diagnosis. This is an individual with visual impairments. She's also an older adult but in our programs that's not what we focus on we focus on folks abilities and what they can do and getting out on the water and are getting out and really any of the programs that we offer. And in this case. She's okay. I can't get in this it's highlights the diversity of where our programs are also run this photo taken out onto it sound. So we're not just in Magnuson Park. We are delivering programs really truly throughout the greater Seattle region and hopefully more places throughout Western Washington in years to come. As you can see in our 40 year history, we have grown exponentially in the last few years by the graph on the screen and threw a new capital campaign. Our aim is to continue to double these experiences and programs provided to people with disabilities through activities and sports like downhill skiing snowboarding cross country skiing snowshoeing cycling hiking kayaking rock climbing and really anything in between. I'm really impressed with all your partner's to I know you share this was nice to see it in a in a slide with everybody's in Seattle Children's there and some of those other folks Cascade bike, of course, so that's great deal Public Schools. It's a nice thank-you. It's a nice mix of both for-profit not for profit and Municipal partners are not for profits focus on Partnerships as a buzzword. We don't exist as an organization without a partnership with a ski resort that started 40 years ago and continues a day for two years consecutively to sustain that partnership. I've heard management at the summit at Snoqualmie say that we are in their DNA and our collaboration with Seattle Parks goes back more than 30 years and programming as a tenant goes back to the early 2000s, but well, we're based in Northeast Seattle only about 10% of our service delivery happens. There are the majority Happens throughout the region and it's because of these Partners while we were waiting in the audience for our agenda item to come up. I might add we had a pretty cool thing happen and it's with respect to a partnership. We have not just with Seattle Parks because we're basing our cycling programs in this one Hub location, but also because of the collaboration we have with the Seattle Department of Transportation, which I let Alicia come in on this summer through partnership with the Seattle Department of Transportation. We are representing Seattle's adaptive Bike Share Bike Share program. We have over 240 different types of adaptive bikes in our Fleet that allow us to get just about anyone with an Adaptive bike need out peddling it on the roadway. So as a partner with s. We were aiming to support a hundred Unique Individuals and over 400 cycling experiences between the beginning and the end of September and we are happy to report that as of today. We hit that 400 experience Mark about 10 minutes ago. Our staff is still two months left in our . And Roth remainder of the summer and we have blown this go out of the water because there is a need for it after biting and I need to get people with disabilities access to Adaptive sport equipment. And what's the cost for the program of the bike to do a bike day rental acknowledge your partnership with us. And remind us. How important it is that we have these connected bicycle networks. It's great that people can get on the burke-gilman trail. They can't get off with the Adaptive cycling unless we've got to save separated space for people to ride deliberate all throughout the region another free demonstration day. It'll be with a small sampling of our Cycles maybe half a dozen but handcycles side by side tandem bikes will be Saturday, August 10th at a community. In North Seattle at the live in D5 event. I'm a citizen and resident of the five. So I'm glad to be representing both where I live and also why organization at that event so free bike rides come out and play you had a booth last year and I would not get on the bike then but by one time said, okay, I'll come over there. If you said this I really liked and learned a lot about the scheme program. You have to amend the picture that you showed me the Young Folks if you let you bring up with disabilities and lying people to go skiing, which is amazing. It's an extraordinary experience for anyone of us to conquer a mountain or go out on a bike path and just be able to do things and for too many people with disabilities. The idea is just out of range and yet if they if there's an organization that has expertise if there's an organization that has experience that there's no organization that has equipment and there's an organization that is committed to Partnerships to make this kind of thing happen. Wouldn't it be pretty magical if that could happen even more? There is one anyway and thank you for the plug of Life a d v on Saturday August 10th that you will be there again with your booth. Currently our operational budget is 2.5 million dollars and this allows us to again be incredibly active in the greater Puget Sound region. But as we grow we are aiming to increase the budget and deliver more programs throughout Seattle and more programs throughout the rest of Washington Wilson, 10% of our budget comes from governmental sources. Grant with the US Department of Veterans Affairs helping recovering veterans. We have a grant with King County Metro for accessible mini buses and vans to help us get folks around and then we have support from Seattle apartment of Transportation, which is new this year. We welcome Government funding. We don't expect it. We recognize what we need to do is help people disabilities get out and Rec rate and that's were called to do this is one graphic example. This is just some of the communities that we're delivering our programs in. Yes were based in North Seattle. But because we have the system of trailers we can pack. Gear either our kayaks are bikes Snowshoe ski, whatever we can take it all over the region and deliver programs not all throughout the city on the way up throughout King County, but throughout the state. What we've come to as an inflection point there was an organization we know that the community is growing and we know we've got to get more people out in active. We know we've got the right equipment as far as we know we have one of the world's largest fleets of adaptive Cycles anywhere / 240 Cycles in our Fleet. We don't want them in our warehouse. We want people out writing them. We want people about rock climbing with us. And if your Paradigm view as I need a two-wheel bike to go ride a bike know there's so many more options and Weed-B-Gon this campaign all about people programs Partnerships in places. It's about people with disabilities first and foremost. We want to give them more opportunity. We want to give them and their families an opportunity to get out and be active we want to use our programs that are already highly effective. We want to make sure that the Partnerships we've been using for 40 years or a key strategy to make that happen and ultimately that will have a place that is worthy of these individuals as a gathering Center. That take place as Alicia noted. Our goal is to double our experiences by 2023 our goal by 2017 was to get to 8502 campaign began early in that point. We actually reach 10900 + end of 2018. So we're on track to get there but we have a key factor that's going to get us there and hopefully I can get this video to play. Outdoors for all enriches the lies of thousands of people with disabilities and their families. My older son was diagnosed on the autism spectrum and started as a participant in overtime. He and his younger brother became volunteers. We love Outdoors for all it gives kids like Ramon the opportunity to actively participate and fun outdoor activities they get to show what they can do and they sure can do a lot all along the way the outdoors for all staff and volunteers are there to provide support and expertise for our participants and family members say there's a volunteer for so many years because of the difference outdoor scroll is made in my own life is really our success doesn't everyone deserve to experience the power of the Great Outdoors. Hi, I'm at bronston executive director with the outdoors for all Foundation since 1979 Outdoors for all has been enriching the lives of children and adults with disabilities through outdoor recreation Outdoors for all has helped people with disabilities. Enjoy the mental and physical benefits of an active Lifestyle the expertise of our staff and dedication of our volunteers has allowed us to keep pace and grow with the ever-increasing need for impactful programs from our start as a small adapter program called ski for all reaching 15 kids with disabilities to the thousands of Lies. Me and Rich today Outdoors for all has become more robust organization poised to do more much more the diversity of disabilities. We support matched with the vast choices of outdoor activities. We offer has made us a national leader in adaptive and therapeutic recreation for children and adults with disabilities. We are proud and humbled by the impact of our work. We are now at a critical point of capacity. To meet the growing needs of our community. We're embarking on the launching possibilities campaign with a goal to enrich the lives of thousands more children and adults living with a disability. Our organization is unable to reach thousands more individuals who deserve to experience the joy of outdoor recreation. We've expanded and struts to meet the needs of our community. Our current physical infrastructure is no longer adequate or Central offices in a terrific location in Seattle Magnuson park, but we're crammed into a former military prison building. We do not have enough space to officially grow a teen programs or Partnerships are current space does not offer the welcoming place. Our community deserve one that is fully accessible to people with and without disabilities. We deliver programs throughout the region, but without more support we cannot deliver on the requests from other organizations to add Outdoors for all to their programs. We do not have sufficient space to train our essential volunteers which limits the number of people who make our life enriching work possible. We have one of the largest fleets of adaptive Cycles anywhere in the world, but we can't fit all of the equipment in our facilities is causes Inn efficiencies with maintenance and access with your support Outdoors for all reach thousands more children and adults living with disabilities each year will do so by creating a destination worthy of our participants working together. We can shape a center around the specific and diverse needs of our community us-based. It reflects our values improves our ability to deliver programs on and off-site a place with curated amenities and details our new base camp will include multiple users Recreation and education rooms. It will include a state-of-the-art first-rate adaptive Cycling Center will incorporate sensory-friendly Technologies such as Microsoft soundscape where individuals You're blind or visually impaired through sound can receive directional information via their cell phones on how to negotiate a public space. We've been competitively selected by the city of Seattle to renovate an Old u.s. Navy Firehouse at 90th and park your support will help us turn this building into a launching pad to take our Recreation programs to scale and enrich the lives of thousands more people with disabilities across the region, but we need your help. Our goal is to raise 10 million dollars will expand our mini adaptive Recreation programs and leverage are highly effective Partnerships to do so + will invest in a first-rate community recreation center for people with and without disabilities. We have the opportunity to double our impact within the first three years of opening our doors. We will increase the number of Life enriching experiences. We provide annually to over 17,000. With your support a child with Down Syndrome will learn to ride a bike a person living with paralysis wilsky again. A veteran with post-traumatic stress will connect with others and reach their Fitness and gain Rehabilitation through outdoor recreation. A family will have access to extraordinary program and won't have Financial barriers preventing them from participating. A volunteer will match their lifelong passion with helping others and expanded partnership with the hospital will help reach a high need demographic of kids with disabilities living with limb difference your investment will Propel Outdoors Falls ability to reach thousands more people of all ages. You can create thousands more life transforming experiences through the power of outdoor recreation. I fully endorse the launching possibilities campaign now is the time now is the time. We've seen the transformative power of our mission. Now, you can impact even more lives through our community. Thank you. I know it will be soon. There's a couple of weeks. We're still making to the video, but the sorry. Forward when I find the height at we're just making some final adjustments you folks are the first to see the video publicly. We want to close with our Marks here in just the next 90 seconds, but it's critical for us to have a better base camp. If you're going to climb Mount Everest. You need a good base camp. We have a tremendous track record with the city and with the community for the private fundraising or working on we are looking to Lobby the mayor's office for support for what we're doing here as well this building the firehouse we are in lease negotiations with the parks department. They've been very supportive what we're trying to achieve. It is a public asset that for 25 years has been left to almost fall down and the city was able to save it a few years back. It is a historic building is incredibly expensive to fix because of asbestos and Lead an earthquake issues, but it's an incredible location and we have to do much do the Mountaineers. What does renovate a building that was used by the Navy and in this case turned into Rehabilitation Community Center for people with and without disabilities. We raised to date specifically Renovations of the building and a half million dollars $1000000 in the state of Washington $1000000 from King County roping building at the city to step up and match those dollars and then we'll complete the rest of it through private dollars. As many know the history of this park is important. It is an incredible collaboration Center. But our goal is to turn on only the space for children with disabilities. But as a former military base to turn into a base of Rehabilitation for our nation's Wounded Warriors. As an army brat, I can speak to the high need of helping to support this generation of veterans and Veterans to come. So rehabilitating. This building to support veterans is a continuing part of our mission is a name that we have just to continue to add stability and transition to Veterans entering the civilian world. There are two other things will close with one is that Not all disabilities are visible. And number two is disability does not mean inability. Case in point, which of these two women is blind. You don't see this ability first when you see Hannah and her mom Ali you see two women who were going to be out in active. So photo I took in January. They were out cycling and my bike that we got councilmember wise to sit on and then eventually pedal and then she's like I kind of want to ride this bike. It's overcoming those barriers overcoming of psychological barriers and utilizing resources that are in play now and bringing them further to bear. So thank you very much for your answering questions. We have we going to be respectful of everyone's time. And you and I met about 10 years ago, and I was amazed with your program then then it's wonderful to see how far you've come and the idea of getting that fire station renovated and having you in it is very inspiring and I hope we can participate. So Ed and Alicia. Thank you very much. Like I said, I've been out there a couple times and I wanted you to have the opportunity to be a committee to talk about what you're doing in the effort that you've made the success that you made the money that you've raised cuz people don't know how much you've you've connected with it with the private sector and raising money and you have a phenomenal board. And so I want to thank you for that and what you bring that only obviously to the city of Seattle, but what you do Statewide is significant from bran judges the park manager to just the community folks want us to be successful. So this is one of those Universal good connections, and we sure are driven to draw this forward. So thank you very much. So with that. Thank you very much. Thank you, sis, Tooele City Alicia. All right. So with that I think we've come along all four matters. And before we adjourn let me share that the next meeting of the Civic development public acids and will be Wednesday, September 4th, and with that we stand adjourned. Thank you.", "end_time": 2811.9}]}