{"format": "raw", "annotations": [], "confidence": 0.9460049526205341, "data": [{"start_time": 0, "text": "Good afternoon, everybody. This is the meaning of the Civic development public assets and Native communities committee to date is Wednesday, July 17th in the time is 2 p.m. I'm cancel membership rewards share this committee time joined by a council member Gonzalez and counter to approval of the agenda. Is there no objections agenda will be adopted. Okay, let's go to the sheriff's report today. We have one appointment 1 presentation into ordinances for review will be joined by or or applicant j-rich for a reappointment to the Seattle Public Library Board of Trustees. I'm glad you're here Jay. Second or a chief librarian ourselves Turner will leave the libraries 2018 race and social justice initiative report. This is a long time coming. I understand. It's a 19 page PowerPoint. So we're we're looking forward to that stirred Seattle Parks and Recreation will present an ordinance that maintains and underground overflow pipe line and channel for the King County owned Reservoir within Discovery Park. This is a technical yet significant bill. So we will hear more about how this preventative measure will serve us and our water supply in the event of an emergency shutdown. And lastly I'm excited about today Seattle Parks will brief us on an ordinance authorizing the acquisition of property for open space Park and Recreation purposes. The property is located on 125th Street in district5. I'm very excited for this acquisition for the extends the goals of the 2000 Thornton Creek master plan developed by Seattle Public Utilities. As I said, this is the north for Of Thornton Creek, which is a watershed Jewel and D5. I've been driving by this property for over 30 years and we have a lot of people to think and I will hold some of those things but I do want to thank the Thornton Creek Alliance a council member dembowski at King County Council in our 46th State Legislative delegation. They all work hard with us moving forward and Rec in Seattle Public Utilities. They have partnered on several projects in the Thornton Creek Watershed that would include the South Park as well as part of their effort to protect and enhance water quality and Associate a natural resource values in the Watershed and of course for the city of Seattle this property represents a unique opportunity to reconnect the floodplain along the section of Thornton Creek to provide additional salmon habitat increase the flood retention ability of the Watershed. My understanding is it's about almost 1 acre and I think we're buying it for a little over a million, but we'll learn more about that when you do your presentation, so We are going to move Jose to Castro Bradshaw you so let's move to public comment in the game. We have how many people we have said that one person said, okay. So what's Barbara? Hey Barbara, go ahead state your name for the record and thank you. My name is Barbra Finney and I'd like to acknowledge that we are on the traditional land of the first people of Seattle to do Amish people. I'm I live in District 5 and Broadview is my branch of the Seattle Public Library and I do occasionally fall asleep while reading a book their tails rules of conduct on which pure last reviewed in 2013. It's a violation quote lying down or appearing to be sleeping in the library. But the ninth Circuit Court of Appeals ruled in April 2019 and I quote lying down to sleep is so fundamental and life-sustaining its cities Kent bar people from doing it on public property unless there's somewhere else provided indoors for people to go. A 27 year old black man, his address for Union Gospel Mission was arrested at the Greenwood Branch library on March 9th, 2019 buy a speedy a friend of mine witness the arrest and spoke to a librarian who said it started because he was sleeping. SPL security was called things escalated SPD was called and the man was arrested and taken to jail. It's time for the Seattle Public Library to revise the SPL rules of conduct to be a moral document in line with a 9th District Court of Appeals ruling. Thank you. Thank you Barbara, and I we will follow up with that. I think you're talking about the Boise case. Yeah, okay. We are familiar with that and I will follow up with that. I'm in Marcellus was here and obviously heard what you shared with us today. So I promise we will follow up with that in the game will make a note of that. Alright. Okay, is there we're done we're done. Okay. So at this point I will close public comment and we will move two items of business and if I could have the folks up here for the regarding j-rich and our appointment process. You guys want to come on up. Item number one of her appointment 01377 reappointment of Jay a rich as member Seattle Public Library Board of Trustees for terms April 1st 2024. So guys want to State your names and then we have a few questions and then will will will forward sure. I'm currently the president of a Seattle library board and we're here because it is time for Jace reappointment. As you know, Jay has served out one of the terms of his appointment. They have two-year terms of service at me really are both as a member and then stepping right immediately into the role of president of the Board of Trustees. I think that his record stands for itself has been very diligent and leading the organization. He has the full support and complement of the other four members of the three now members of the Board of Trustees. So we're all pleased with the work that he's doing and leading in the showing of very good representative for the library. So he's here so I'm honored by the Reappointment it's a it's a humbling experience and I am sort of a fully committed to the notion of the library is really a Bellwether of Civic culture. That's exactly what term I used to have a flight of rhetoric but I use it to Seattle Times in the context the levy renewal because it seems to me that given everything at the library does being a free and open space for all citizens regardless of age or background or ethnicity or income. They free space. It's really seems to me fundamental to our democracy and to what we think of ourselves in the pride. We take as a city and that's why I support the library and an honor to serve even in this capacity in any way that I possibly can. Well, I don't have questions but I want to say thank you. I'm Jay. I think I've known you since 1987 you worked both as an attorney for Metro at that point. But also we met after you were a White House fellow you are a reputation around this town is Stellar the fact that you want to do this very impressive and I'm grateful that you do and thank you Marcellus for all of the work that you've been doing. What do we call it democracy University or supposed to use the Central Library regularly and just appreciate all of the changes that you're making and Godspeed on your leadership by true about you. So I want a few things. First of all J is been an absolute pleasure working with you since I got this committee three and a half years ago and all your hard work on the Levee the re-imagination of the library's how we've been going about How we address what issues needed how Libras need to change in the 21st century? And what kind of services at library should be providing, you know, I did not know this from looking at your confirmation packet that we have the same boss Governor lock we did indeed. I did not know that you were his Deputy Chief of Staff when he was when he left the governor's office and went to DC to be head of Commerce. So we may have crossed a wonderful job great experience that way. So with that I think if there's nothing else we'll just go ahead and move. Okay. So this is the reappointment of Jay Rich and I need Anita Nikki nor do you read into the record? I remove the committee pass appointment 01377 Ocean has been moved and seconded all those in favor. Say aye aye aye was a favor know the eyes have it. The confirmation will move forward to full counsel Monday. Thank you for coming down again for your hard work on the Levee. Let's do that. I'll have and she just is my meeting a hold on you into the record and then we'll get started on the fun stuff item to 2018 libraries race and social justice initiative report, please disregard the 5-minute timer Ark you have 25 minutes. How to join us for that and other approaching the table, I will share with you that the library is are reviewing its rules of conduct starting September of this year. So for the patron who was interested in that we are doing a rules of conduct review starting in September of this year. Good afternoon. My name is Andrew Harbison on the assistant director of Collections and access. In-house chair of the RNC I changed him at the Seattle Public Library on the head of marketing online services and I'm the current co-sponsor of the rcit. We first of all Mt. Thank you. I know we've been talking about your presentation to us on the rsji report for a while. So we're excited to go through your report today while we're excited to be here and talk with you about the work that is occurring at the library to address race and social justice. I am happy to be joined by Jay the president of the board because he can represent the interests of the board in this topic and I'll give him some time to speak first grade. Thank you. Council members. I'm here representing the board to demonstrate the boards commitment to Racin social justice equity, and I can say with conviction that That commitment is deeply stitched into the fabric of the library's culture and I say that not as empty rhetoric, but because of the actions in the outcomes that we have pursued in the hard work you were doing I think those of you who have been involved in racing and social justice Equity understand that it is difficult working off and on comfortable work, but I subscribe to the notion that unless it's really uncomfortable a bit. You're not doing the work and we have engaged as a board itself. We have developed and pronounce to policy to not only demonstrate leadership in the issue for the whole institution, but also to demonstrate a commitment to its implementation in among other things beyond the words, it acknowledges that the policy is not just a feel-good thing but is really rooted in the unfortunate and tragic history of institutional racism and it has to be understood in that backdrop and it come it's not only are working that effort. Resources to the extent we have to make sure that we make progress to that and I would say, you know, it's an elusive goal that requires work every day and every year so I think it's totally appropriate to have an annual report on the progress that we've made and I turn it over to Mt. And the staff to give you a summary of that progress. Thank you Jade. So I know that you received the copy of this so I'll walk you through it at 5 very self-explanatory, but I'll add the tidbits and highlights as we go along. So just to give you an idea of some of the work that we took over in 2018 as Jay just mentioned we'd had a board-approved rsji policy. One of the other things that we are quite proud of his our relationship with the Seattle Public Schools where we've created a library link library card, which is an electronic library card that we make available to all grade 6 through 12, and we are proud to say that we're in every Junior High and high school and the Seattle public school district. We've also really work to address. Digital equian Outreach programs with a Somali Community. We've added FPL hotspots at City permitted Villages. We've made new an acceptable come a community informed website. And we also have libraries been program Services has been to make sure that we are being Equitable in our work and then we've had some really great programs this past year to highlight some of the work with are prioritized population. They include legendary children beyond the frame indigenous artist-in-residence a youth incarceration in our aides Asian and Pacific Islander communities and cultural celebrations and more. So these are just some of the programmatic things that we've done over the course of the year. With regard to our library approaches to our work a senior management team and our leadership teams combined identified several goals that we wanted to make as a priority. The first one is to always bleed with Rafe butt into in terms of leading with race that required us to do some active engagements on a part. One of them was that we would be open to continuous learning and listening at all levels of the organization, excuse me strive for equity and access services and programs represent and invest in people of color. Another prioritized audiences + communities and steadily works by closing the opportunity gap for children of color. With regard to the package that we were asked to speak to we've identified for toolkits to wear rsji with apply to the library work in 2018. The first one has with regard to the library restroom policy that we had to address back in June 2017. I know that you as members of the council were involved in this has the information made its way to you well over that time. & culminating in 2018 on the board approved a new restroom policy. We had to spend some time doing a lot of work with this particular lgbtq and trans Community, but it was a statue of an effort to establish a restroom policy affirming gender-neutral access for all and I'm happy to say that all of our restroom single-use restrooms are compliant. And we also had our changed him engaged with transgender Staffing Community public services staff and managers to regain the Community Trust that created that harmful experience. As you know, some of the recommendations coming forward were more single-use restrooms across the city and our libraries in as you might imagine that comes with quite a few challenges to implement, but certainly as we look at opportunities for to reimagine we try to address those as much as we can. I just want to thank you because when this all happened you literally called me that day of day and we met and responded. So thank you so much because you are on top of that and thank you for your support. So that was very good for us II program we wanted to talk about is our Fresh Start program in a Fresh Start program is actually a real energize rejuvenated program that we've had in place for a little bit of time. And that was where we work with teens who had eyes on their account to help them remove those fines on their account and that was such a successful program for us. But over the years one of the things that was still challenging about it is that Hafiz were still attached to these records so this past year working with the foundation and our circulation and borrow services staff we were able to create a new program that helps to re-energize the Fresh Start program so that it energized the program with an opportunity to remove feces from a patient's record. And so since 2018, we've had over 1,100 team patrons who've been helped with this 71% of teens. I have cleared fines and fees have checked out a physical item or digital item in the last six months since that occurred and all of this work is privately funded through the foundation and the community as excited as over 80% of donuts to the program are first-time donors. So we're really excited about this program and getting liberating some of these patients to use the library's again and I think our teams are really appreciative of his effort. But that is the foundation. Yes. Thank you. The foundation is the fundraising arm of the library and they are recognized as the Seattle Public Library Foundation. They're celebrating I think like their 39th year of existence. So really dedicated people who are putting forth an effort to help the library extend its reach into the communities. The 30 area that we are going to speak to is the library's effort to death update its current diversity and inclusion policy. We are working to have that put forward in front of the senior management team in the next couple of weeks for the weekend and take it to the board, but it has been an effort led by a change team staff. It is taking a little bit of time because our staff wanted to be diligent in their effort to understand the interest of Staff who are looking for opportunities in our organization. They did some focus group staff survey the 525 respond. 10 informing the effort which is quite remarkable for its staff 700 the recommendations that came forward are improved data collection on a Saturday element more staff training prioritizing Career Development and increasing participation in equity work at all levels. So that should be moving forward between our Union and the leadership and management teams of the library such that we can get it in front of the board. And before the year is out. Can you talk to me a little bit about how does the Board of Trustees and the library foundation and are Levi oversight committee? How did those three entities work coordinator or communicate with one another way in as well? So the three there are actually three boards and I should speak to that to there is a third board which is our friends of the Seattle Public Library, which is the advocacy arm of the library. The three boards come together through a 3 presidents meeting on a quarterly basis so that the president's come and keep informed of what is going on in the work and efforts and then there's a three boards meeting once a year where they all come together so that we can all be on the same page about what the program of service for the library is with regard to the levy the library Board of Trustees have served on the current Levi as the governing board for it. So they are responsible for the implementation of the Levee ensuring that the library adheres to the components of the lady that are called out and ensuring that we are being stuck great stewards and judicious to its of the reserves and resources that have been brought to the table you might recognize also that they have to manage the levees dollars with the general fund dollar. So it is a delicate dance that they have to take on each year to do that with regard to that then the foundation and the friends serve as a fundraising armoire. Christian to support the efforts of the Levee and they are in a more active position or role of being able to Advocate on behalf of the Levee. So hopefully that gets it important think I was just wondering whether the three entities also work with you on that rsj. I would ask about that as well. So one of the things that I will say is that we presented the policy to the Board of Trustees three years ago when we were working on this and they in turn asked us to develop it a bit more. So that is how the staff moved into this position in the change team with regard to the foundation and friends. They did not have as an act of a role in the development of his but they certainly recognized some of the challenges that must some of our prioritize communities lack and have a certainly direct their efforts to that cause of Summer learning program where we give away free books. We make sure that they will give him away first in the prioritize communities. Those books are funded by the foundation's so Any of the programs and services that we offer are funded by the foundation and that helps us develop a stronger policy and procedure around is because we're recognizing all of the community and I know also that I believe it was a foundation maybe it was a Board of Trustees that agreed to fund a social worker case manager and then also addressing some of the concerns we heard earlier about people sleeping in library because they're sleepy but her any places to Beach and but yes 2 years ago or 3 years ago. We were fortunate that we had a donor who wish to support the work of the library by providing us with a Community Connector, which is a person social worker who comes and working with d e s c to provide a social worker in our libraries to help address many of the concerns of our patrons and daily readers Who coming are libraries everyday with issues that go a little bit beyond. Traditional Library needs and activities because they had a donor who is willing to support that that receive favor from the van Administration such that they were willing to have the library board approved placing that position as a funded position through the city, so that was supportive there. And then under this current Levi as you know, their support from the council to add an additional social worker for us to address some of the needs in our branches and along with special needs of our lgbtq + teen communities. So guess I should make a note that we should thank councillor Gonzalez and have her bagshawe who were very supportive of me pushing that and adding that and and with your recommendation this all of you were quite helpful for you. Thank you. The third item that we really focused on in the last year. It was really advancing our summer of learning program. As you know, we are the program has been formerly known as the summer reading program, but about five or six years ago. We changed it to a summer learning program to recognize our efforts to incorporate stem and steam into the program so that the learning expand across all of those Arenas. I should also say that this is the 100th year of summer reading summer of learning. So we're quite proud that this program has held up for 100 years and continues to go strong are out of time. It went to work of Helen's team in marketing. We created an activity book this year that was created with seven languages in mine so that we could appeal to more of our diverse communities and prioritize communities. It was created with more input from you that supposed to the Librarians designing the pro the activity book and South One of the things that I just referenced was the giving away of books and materials. We ensure that 78% of the give away books weren't to prioritize Youth and Families. Excuse me, 24% of our performers and programs were lured by where they buy persons of color are individuals or organizations and 77% of our marketing budget was spent in the bipod community. So we were really quite pleased that we took a very end the lead for that ain't white O2 the very concerned that lead to do that but it was also with the help of Helen and her team in marketing need to know if that is my D5 Library when I plug-in therefore I should have known that if I might I wanted to just to amplify a couple of thoughts on this that prompted by your question as well the summer learning program, which is giving away books for many many years was done in a in a without erasing social justice lens at first and what the analysis showed is that a lot of the people of a lot of the kids that got the boy I have lots of books actually come from relatively affluent family were reading and books are a tradition. They have them at home. And we the library to its credit saw the analysis and said we really ought to try to move the books to those where the books to be actually more valuable. They would make a difference in the family. It wasn't maybe the first book they could take home and not only do we use a racing social justice lens, but the program is funded by the foundation. So to your point about how the foundation and Library works and race and social justice and Leverage is Levi dollars. This is a perfect example of that and I was they just whispered in my ear that they we all think. That's a no I'm not going to take credit. They think this is High Point library and I'm excluding myself just in case they're wrong, but we will make sure that we find that out. But again, that is the work that we were doing with that with regard to Workforce in Contracting Equity. I wanted to give you some statistics on what are Staffing component looks like this is the work that we are always continually trying to improve upon but I think that we're making Stripes in that what you noticed in the chart on the laugh is that that is the census of the 2010 census information and what the city of Seattle look like at that time on the right hand side, you have the chart of a staffing at Seattle Public Library annual fee that our numbers are in many cases a little bit better in some cases. We are equal and we have dropped in a few places, but that is a result of a continuous effort to improve our representation of our staff. One of the things that is very important is that we have a staff that reflects the community and so we really strive to add positions that I needed and make sure that we are in bing inclusive in our recruitment. Does this decision include and I'm sorry I should have looked at this quick sooner. Are we going to be looking at languages? Well, I know you did race distribution. So we did not we do not have language on this chart and we can make sure to get that information to you. I know that there was an effort LED last year by Marie tooth in your shop to identify all of the languages that we have on staff and if I'm not mistaken, I think we have about 50 50 some languages spoken by our staff so that we can ensure that we can get access or service to a particular patroness fix the language. Now that does include that we do have some that are one staff member only who speaks our language and that's where we need to shore up some of those reserves as well, but we can make sure that we get that information included in next year's presentation of the language is represented. The next couple of charts speak to the current Staffing patterns for 2018 and I will tell you that the key to the right changes a little bit in each one. So it'll be important that we know that but in this particular race distribution presentation the blue recognizes all of the staff who work for the organization and the gray represents our supervisory staff. So you'll note what 2018 look like for us. And I'll move it is quickly. One of the things that will do for next year as well as well. Make sure that we have a way to represent we a comparison of the previous year so that you can see the changes over each year. What we are able to show right now is just what 2018 looks like with regard to this particular scream. This is our hired and promoted staff. We hired 89 status should have mentioned the key at the bottom to be hired 89 staff and total number of promoted staff is 64 promotions represent. Any number of spaces we have for La classifications in the organization in La meeting library assistant and they can move from a 1/2 a for we have stas who are students who can move from a student assistant to an l a i want though. It might look like we have a lot of opportunities for promotion. But sometimes they are in from a student graduating from college or High School in deciding that they wanted to continue working with us. Is represent some of our movement into our supervisory positions as well. I'll looking at a staff turnover. In this case. The left bar is on non supervisory staff and our right bar is our supervisory staff and I think what you're recognizing here is one of two things. The first one is that many of our staff are of an age or of a position where they are ready to retire or change our transition to another career. So you're seeing a high incidence of that. You're also seeing a representation of many of our newer staff who are also stepping into positions, but have opportunities to take jobs elsewhere as well. We do lose a great number of fat to the out of class program here in the city where a staff member Works in one department and then an opportunity shows up in another department and they may pay more money than we do and we lose them to that. So, how are you doing? Are you like going to so we take a lot of efforts to do recruitment? We're working with the library while in for two different ways for a librarian's we have to work with the library schools because that is where the graduates will come from with regard to our efforts to engage. Our non-mls degree required positions for doing a lot of things. A lot of them are really nasty a program and asking them to if they'd want to continue their work as a permanent staff member in the library. So that really gives us a great deal of turnover, especially with flexible hours that we keep for part-timers. So that helped the second thing is we rely on word-of-mouth. We really do ask our staff to help carry for that conversation. And then the third as we try to advertise in the communities newspapers and media formats that really speak to those communities inevitably when I go out to do a community conversation. There's always someone and said, how do I get a job here? So we took a look at those advantages and Opera? Send a text to speak to that as well always can open to new ideas. So if you have no ideas, we'd be happy to share them with you. I know that many of you carry blogs our newsletter. So if you want us to have you send you information when we have openings our happy to do that as well, but if you have two additional ideas were happy to use those. Gender distribution all of these Agana our requests that were made to have in our packet agenda distribution. In this case. The blue is a female population and in the gray is a male population, and we also have a percentage of sad who chose not to identify so that comes at .6% The other item that we were asked to include in this is our wind be purchasing and Consulting a new MB is one of the places where we are always trying to do better, but we certainly struggle if he were to look at you'll see that we are increasing our goals each year, but it always becomes a challenge to increase the buy a major amount. But what you'll see in a 2018 targets is that we offer purchasing we look for a 12% increase and I would set a goal of 12% and we made 17% and then Consulting we ask for 11% and we reach that goal for 2019 weeks at a time. Of 18% and Consulting for 12% One of the things that I will say that we are working on right now is that in our summer of learning program a lot of the local programmers and performers that we use our persons of color and one of the city's procedures in one of our procedures is that there is a 30 day wait to be pay where look. And how we can trim that because many of our performers need or would like to have their payments sooner than 30 days weight. So we're working internally to figure out can we cut the checks in the much sooner process to pay venmo on it is something that we are really focusing on because as you might imagine, sometimes they're having to rent their equipment and so they have to make that payment they are using some others. I need to be paid. So anything that we can do to address that we think will go a long way to having them qualify and participate in this more. And then the kidney stone is moving forward. And I'm going to turn this over to Helen because as they are in their introduction Andrew mentioned that he was the past chair along with Ludi who's in the audience the past year of the race and social justice committee and we transition to a new sponsor this year and Helen is in that role and she's going to talk with you a bit about what is coming forward in 2019 and Beyond so one of the things that we did in January, we had a equity work at the library full day conference for attendees of the Allied American Library Association that was held in Seattle and say stuff at the library about that program Services collections marketing across the board and they did a full day. And in addition to that role than just doing it for a small group of Library employees. We will seek creative print peace and a webpage on our website so that we can be transparent to our patrons about the Accountable to what they were doing and that web pages are being updated with the new project that would doing as we go through the air. We this is an old neighbor. I just wanted to mention this because Marcellus talked about the shells of sum of learning being a hundred years of these are some of the action guards for this year in different language in the Translating languages, including English as well. And the autistic that is featured on this early learning guide activity guide is a female or a local artist s'pose McCullough. So one of the things we're trying to do is use more inclusive imagery in these these am activity cards to and then one thing that we did with the race and social justice team itself with its rights Lodi on the structure of it. We identified the we could do better of encouraging more stuff across different classifications that most of us talked about the different levels of the organization as well as geographically and then also including people from across the parliaments within the organization to Administration as well as public services. So we have a more representative group. People in the common are Str team and we also change the structure in the timing of meeting the little bit so that there was less Perez for people to participate as you know, we have 27 location to Epoch change the schedule a little bit to allow for time for people to meet but also time for people to actually do work related to RSG. I work so we have changed the framework and we have also currently working on setting a strategic goals and we're looking at the off of the office of civil rights strategic plan for 3 years. We are Astro up to my back to that man walking through goals and setting goals for the library based on those strategic goals and we are looking forward to also employing strategies such as working with a committee Advisory Group to also help make sure that we all have an outside perspective from patrons and pollen as we will with to make sure they're out Equity work is over. Thing as well throughout the year Helen, I want to thank you. I think this is the first time I've ever seen in print a territorial acknowledgement of indigenous people ever except for an Indian country, but this is really probably it may seem like a small thing to some people but I don't believe any of our other City departments leader and with this territory territorial acknowledgement Salish folks, so I want to thank you for that. This is very special. I will post it. Or the way, I do when I share but I don't want to steal this just so you know, this is the first version the next 10 PC say it will also be translated into the suit suit cheap on a website. If you go to the website page about you'll see it and we leave without language. So we're evolving even the work that was thinking about now. The other is a student that language and did you see where they took all the Metro buses and they put the actual to shoot a word for the location of where they're going like Alki they they they called and it was really cool. What's up? I can't see everything. Okay all of the book. I'm just here. I'm just here that's the trends about that. Yes on this. I'm a bunny. I'm black feet but the training that we've been doing we have lots of opportunities at the library, even though it's quite complex with so many people in different locations. So we take advantage of using a annual stuff they to do training Xander the lost your training. We it's Apple trading concluding a transgender Patron training on the standing and visit implicit bias and sexually 101 institutional racism. And so we continue to do those kind of training at our old stuff. They'll put unity and throughout the year. We have a serious code our way which is curated and created by stuff. And so we've done recently and I always thought trading at Tuesday at Central in the one of other are the phone's location symbol stuff can join Asian American experiences at the library and then the rsui change team she writes a training as well and this year. We're doing it in September will working on that right now. And then as an organization we are committed to doing I'm at the harassment training and so the bystander training currently has been planned to roll out in September that moment as focus groups going on to make sure that we represent a mold inspectors from the library. So the HR department is moving forward to that, too. Thank you. I think with that that is the end of our presentation. We realized we needed him to run the show. I like to hear Jay Donahue who runs the Wimpy program for us as well as Ludi Mars who is our employee relations director and was the coach here with Andrew of the racing social justice team anything for my colleagues? Okay, great work. Thank you so much. Good luck. We trying to say good luck to them. So let's get our folks up here for the Discovery Park outfall easement. I will have to gain read that into the record and then we'll start we also have an amendment on this which I'm affectionately called the earthquake Amendment, but that's what it is. But I'm going to let you guys introduce yourselves to do what you do and then we'll we'll get to it. I am three Council Bell one 19569 and ordinance granting a utility easement of surface surface and subsurface rights to King County through its Department of Natural Resources and Parks wastewater treatment division to maintain an underground overflow pipe line and channel for the King County on Reservoir within the Discovery Park which serves the regional Wastewater facility to meet federal guidelines for a potable water supply separation in the event of an emergency shutdown and backup of the incoming water supply. Thank you. It's a good morning or good afternoon Tracy rats live cancel Central staff Parks and Recreation and wastewater treatment division Alton Gaskill. I'm with the King County Wastewater Treatment division Real Property Services. What do I start things off here? I'm going to introduce the legislation on behalf of a Jesus seguire. You couldn't couldn't make it today. So I'm going to hand off shortly to Richard is going to give the background of the details. So just a couple key points. Obviously, we all know that we haven't made our major Wastewater facility in Discovery Park. And with that comes Associated equipment. And this is what we're here to talk about is we have existing equipment has been on the South Bluff for years that actually predates ownership by the city and is update of futility regulations needs to be updated and As part of that update. Let me know. We we do work with our Utility Partners. We try to minimize impact the parks, but if something needs to happen, especially underground utilities are an acceptable exception to our non Park use policy. So we've had a great partnership with Kane County hear this some will nessus necessitate a new easement to accommodate some of the underground pipe. We want to thank our partners think he's been great on the public Outreach aspect of this and partnership with us on developing the the agreement and I will hand it off to Richard. Okay, thank you. So first off I wanted to point out. What is the project should mention the project is to update and to meet code for an existing Reservoir and also to add this overflow Channel, which is also required by state code and also spu requirements the planets to install a 460 ft pipeline within is easement. That roughly runs Southeast from the reservoir. And again this pipeline is going to be for the Emergency discharge of freshwater pipeline will be roughly 15 ft below the surface in most cases. And again, it will keep overflows from happening within a treatment plant or flooding other areas. You can see a picture there and it sort of shows the pipeline alignment again, it's going Southeast from the reservoir which sits up on a bluff. This is a location of the reservoir. It's basically in the western quadrant of Discovery Park. It's a little red star. A quick question. Where is Daybreak star on that map is up and I may be wrong if Northwest right? So how was this? He's been work. Most of the pipeline is Subterranean. It's basically invisible, does not create a barrier to park users. It does not interfere with the natural. Look at the park King County is also going to restore the property impacted by the pipeline restoration. They anticipate having to remove some trees and I'll get into that later but those who will be replaced two-for-one the subsurface presence of the pipeline again will not inhibit Park use nor vegetation planting so we can plant vegetation over it. It doesn't have any I guess some restrictions that way and of King County needs to access this pipeline since it is an easement and I do it by foot. They don't need to get a permit from Parks. But if they need to drive equipment to the pipeline for maintenance or in any way impact property outside the Houston area, they will have to get a permit from the First apartment before doing so it was also a praise. It was appraised in 2018 and the market value is $156,000. The need for the easement there's a brief history. Again. It's per state code and the wac is 246 - 290 and again Seattle Public Utilities this also explain the easement is for an overfull pipeline, but there's also going to be modifications made to the reservoir itself to again meet State and spu code and improvements that way the Overflow easement is within an area that was identified by the county as sort of a natural Bowl. It's also has quick draining soil. So in the event of a discharged, we don't anticipate an accumulation of water will quickly dissipate and also they would be able to shut off the water supply before it became detrimental just to give you a bit more history the treatment plant and Reservoir were built in 1966 which predates city ownership of that section of the park. Eric currently serves more than 700,000 people. So it's it's definitely a vital utility the reservoir decided on property that was conveyed to the city in 1973 from federal ownership. Activist days. Okay, right on those days are over each other improvements again. They're going to remove 26 trees will get 52 my trees size. We know that if you take out 26 mature trees and you plant seedlings we behind what we're trying to accomplish. Can you just talk a little bit about what the agreement is, right? So are requirements are the replacement trees are at least 2 in in caliper. So they're not exactly ceiling still there in a good-sized trees in that sense. As far as the species go that would be something that our operatives with shoes because there may be too many trees to go back into the amusement area. So some of those trees could be moved to another part of the And that might be in a different species than what was there before Seattle Parks and Recreation on we will choose from that pallet itself. Which one point you just made. I think it's a good one, which is we may not plant exactly at these men. If there's a pipe underneath maybe you know, and maybe a root issue through with your life. So sorry Forest other areas of the brain when you've got the final plan, maybe you could come back to the committee or just send us a note and provide us with is going to look like okay. I want to see pictures. Okay, all native plants as Discovery Park is a natural park and it is being restored with natural planting the appraisal. The pipeline again was completed December 2018. And it's just been a great coordinated effort between King County and ourselves to get to this point. So so we have the existing structure and on the very left is the actual portal to the existing Reservoir and to the right of that is but it's going to be the new structure and I would say that it's an improvement. If nothing else below. We have the existing conditions for preconstruction and to the right of that is supposed construction and planting sold again the pipeline as shown but it will be buried and so will the patches there is a Terminus. It's a diffuser at the very end and that will be covered with some type of either rock or whatever and you know, hopefully most Park users won't even see it or not exist. Did Katherine Gonzalez has a question about she like the deer? So can you tell me was really rigorous and Republic notification? I mean, I'm not going to even go through all of the things that the mean things did it. Yes, they did reach out to Daybreak Star as well and also friends with Discovery Park and so far. So there was there was quite an Outreach with this in the last decade replanting indigenous plants there, which is been phenomenal actually longer than that after we lost Bernie Whitebear that was one of the things that he asked us to do that we did. Thank you. Park Community Center, first of all, they asked how deep with this this overflow pipeline being again. It's 15 ft in places. How is the pipes pipes alignment selected? So that was based on a technical study and survey and they were careful to avoid as many big trees as possible. And also of course to follow, you know, what would be a natural alignment topographically so you would get a good flow and then how will construction impact the loop trail in the newly-established Capehart Trail King County's going to keep both pills open don't have flaggers and park users will be able to continue enjoying the park. questions at one thing I do have to mention is there is a proposed amendment to one of the attachments and it's to the easement agreement itself at the earthquake amendment. That was that was something that I had and our attorney had looked at and we agreed to remove that but for some reason that version got into the system and I take responsibility for that. But yeah, so the amendment will be section for we're taking out if you look at to buy an act of nature including seismic events prior acts of vandalism or civil unrest obsolescence or changing code specific here in We do have some of that still in this but as far as acts of God and seismic events players know that from that was opened. It was in every kind of Act of God and the other change and it's a very minor one would be on the following page. So it's under number 5 and we have to correct except that's from A to B and from B to C and then will when will move forward to change an accuracy on one of the exhibits that in addition to what he just talked about. That's the only other change, okay. Is there any questions for my colleagues know the county know you're good? Okay. So what we'll do then is Will vote on the amended first. We have to move version to a out the attachment. Okay. So yeah. I know you do that. Well, that's why I was just going to do I'm so sorry. I would love you if that's supposed to be thank you. Oh, we will as amended now, we will I will move the committee pass. Cancel Bill one 19569 as amended. All those in favor say aye I suppose no eyes have it and then it passes when we forward we are assuming liability if there's an earthquake. Thank you for being a great. Okay, sweetie. Story on Discovery. Why don't I have a sheet for this while we do? Okay, go ahead and gave me you just wanted to the record high temp for Council Bell 11957 0 and ordinance relating to Seattle Parks and Recreation authorizing the acquisition a real property commonly known as to 318 Northeast 125th Street South Rising Acceptance in recording of the deed for open space Park and Recreation purposes and ratifying confirming certain prior acts. Okay. So this is what we're very excited about. So I'm going to let you guys introduce yourselves and we'll move forward. Go ahead with lyric. I work for I'm a planter for drainage in Wastewater within spu Seattle Parks and Recreation all thank you. We are also very excited about this and you get such a great introduction about it. I am not sure I have to do much more to tell you about it about a 1-acre property. It's it's on the North Branch of Thornton Creek. It's located in Northeast 125th and 23rd Avenue Northeast and it's been owned by the same owners for about 45 years. The North Branch goes right through the property. Most of the property is actually in the floodplain and it looks like a park. It looks like a pastoral Park and a matter of fact when we were talking to that the owners they remember when they bought it and they were young couple that all the neighbors would come over and picnic alongside the creek. So they are super excited about it being protected for the public as you know, and said earlier Thorn Creek is a wonderful resource. That's why it's a priority for the city of Seattle for the parks department for spu. It's got the highest fish diversity in the in the city and we have spent decades protecting the stream. Most of our protection has been on the South Korea South Branch where we actually of the city has over 50% of the stream in a public ownership, which is awesome. This is a great opportunity because it allows us to start protecting more on the North Branch and I will let David speak a little bit about what's so great about the North Branch, but we have to know that we have a 1 and we have Jackson golf course, which has storm Creek the North Branch going through it. And then we had a little piece of property at the intersection of Lake City Way and then North Branch and other than that, there's a lot of law. Ownership's not dissimilar to this one with the creek running through there. So there's lots of opportunities on the North Branch and this is an obvious place to start for a lot of reasons. I just want to share one thing though and two things. Like I said, I've been driving by that property for over 30 years. That's about seven blocks from my house. But second of all you guys are doing a great job as well as parks and I'll do the thank yous again and not only for the North Fork for the South Fork in the South Fork is what got daylight it by the Thornton Creek and Lyons folks, which is great. That's worth Thornton Creek Northgate densities happening there phenomenally protecting it s p d as in a great job with the Beaver Pond and put it in those clothes that are the closest Wells the North Fork of Thornton Creek is still very pristine and it's still salmon bearing and I don't think people realize that and it's a major Watershed that comes out of the up by the golf course. And so everybody this is like a really big deal for everybody. Everybody's been cuz we went looked at the property in like three times. So I know customer Bachelor wants to say something location on 125th to 323rd at close to the library library library. So wherever I mean this project been going on for quite a while, I think actually it started last summer when councilmember Dombrowski was interested. And if you didn't know went back and forth and ultimately it made the best sense as a partnership and that's why we're really excited because we didn't have any other ownership around here, but we had done projects in the South Branch in partnership with spu that were very successful. The Kingfisher is the one that comes to mind and sell that ability to to do another project like that was exciting. And so that's really when we finally realize that it meant both of our goals and got the go-ahead from both departments. That's where it really seemed to move forward so that we have a signed purchase agreement for 1 million $50,000. 3.9 acres is got two structures on at one main house and one carport / apartment both of those after after we acquire the property and then I'll David speak a little bit about s to use plans. We are scheduled to close sometime before September 15th. They have been I think I mentioned this earlier discussions with you all of it. They're in their mid 90s. And so they are eager to get this closed just to make sure they can see it happen. So will try to accommodate that and we are right now with us to you working on them away. What kind of Define roles and responsibilities both now and moving into the future? When will it have to give me exactly where you're actually helping to get it and mostly finished before the closing. So I think we're at we've got a pretty good draft. I can let David speak to where it is in sbus going down memory lane. But when a number of years ago, we were looking at Magnuson Park and the Seattle conservation service there have been some some questions raised about when we buy a piece of property like this that actually has a house on it thats habitable whether or not that could remain is sort of a caretaker's house a manager's house is there hasn't been any conversation around that just preserving, you know, for more units of places for people to live. Actually we've had we had quite a number of discussions both with the community and with a nonprofit's like dirt core and plant amnesty about reuse of that building. Because it's would take so much to upgrade it code wise for City use that really financially doesn't make sense in addition as you probably know. This Parks is not great at managing the auxilary buildings. And so our preference would be to to manage it as a natural area and there's asbestos ammunitions not you could build in the 50s with no EPA. No C but none of that stuff. He is is just that would never have gotten built today directly in the floodplain to the idea of investing a lot of money and rehabbing something that's I'll let you go. You could see bad idea that again Dave Leclerc spu. I manage a program is focused on green infrastructure in urban Villages and reeling emphasis of this is upgrading drainage and Wastewater systems in and around our densest neighborhoods in in particular doing it in a way that provides additional Community benefits and I do leave through partnership. So this really this is this is an ideal project for a scent in many ways and terms of near-term spu interest in this site, I think because it is such a large site with the creek Channel moving through it. It really creates a great opportunity for us to do floodplain restoration. It's not a terribly degraded site, but the channel is definitely cut down below the floodplain. And so this project gives us the opportunity to widen the creek Channel restore some of that natural. I'm playing function and that decreases Downstream flood risks and also really produces some good water quality benefits Downstream. So that's in the next couple of years. That's that's what we're excited about pursuing a longer-term. It puts us in a good position to do Culvert work the Culvert that goes under 125th street is undersized that prevents a fish passage barrier. Eventually. We're going to need to repair that Culvert. That's a much bigger more expensive project, but it's much is underneath 125th street down the road. It's not it's not in that on the top short list of culverts that need to be replaced but it will need to happen eventually end by if we have control of this site and manage the site makes it a lot easier for us to do that. Cool works in the future. We're all so excited about this really echoing a lot of what chipset already but we're excited about this as a an opportunity to partner with Parks we see A lot of potential going forward for projects requiring co-developing sites between parks and spu and this is a nice in a relatively straightforward project that has clear when when benefits for both of our departments finally as a community center utility. We're really interested in how all of our projects lineup with priorities that we already heard from the community and we know that from past planning work in Lake City people are very proud of the creek people want more visibility of the creek and more access to the creek. So we know that this lines up with things that neighbors have already said that they want and we also know that this could present a really good opportunity for partnering with different local organizations, including Little Brook Youth Corps or Midtown fishery enhancement group their number of partners that we hope we can bring into the process of restoring this site. What were we talking to them about that I have spoken with Derek Carr who would really like to use it as a training ground for some of their interns, but bank is pretty Limited. Anything else do we envision a partial transfer of jurisdiction on this one eventually to give it all that. Thank you for bringing that up. So the Emma way to right now this is going to Parks jurisdiction because we are putting in all that we're putting them in the funding right. Now. The expectation is that do the mlu that spu will be providing their share of fun and down the line and depending upon what type of funding that use and whether they need to actually have property rights are not we may come back and do a partial transfer jurisdiction of the streambed of the up to the high-water mark for them. We just don't know that what that looks like right now, but it is the intention so that if we come back we are we should not have to deal with i-42 or anything because we bought this with the explicit intention of potentially transferring some of the rights to spu. Right. Now the money is 50% conservation Futures funding to King County Conservation Futures and 50% Park District funding. I will say that when I took the oversight committee for the conservation features out on a site visit, they loved this property that they just couldn't believe that we still have properties like this. And so it was kind of reaffirming that this is worth protecting. So was that a just want to share quickly and then we'll will close out here. I'm thinking spu thinking you guys and parks and a really big shout-out to cancel member debowski our council president. Now who helped secure of the phones and work with us in our office and parks and spu in the county. That was we texted today and I told him I want to give him a big thank you. This is a good example where when we work with the county on these Run Preserve any type of land that really makes a difference in our 46th state delegation Senator frog and Ava Senator asks a senator or representative Valdez and representative Paul at we're all involved as well. So I want to make sure we think those folks as well. And of course the store in Click Alliance, they've been around for about 30 years. I could be wrong on that cuz they did the day lighting of the South Fork which was a big deal and so on. Anyway, I'm excited to take the vote on this. A path Council Bill one 19570 in motion has been made and seconded all those in favor. Say aye aye full Council Monday. So thank you very much. Congratulations. And thank you for all your hard work. Thank you very much. Okay, so I'm getting ready to do my little adjournment. Speech. Okay, the next meeting of the Civic development public assets and Native communities committee will be a special meeting schedule for Wednesday, July 31st at 12 p.m. With that we stand adjourned you guys.", "end_time": 4257.8}]}