{"format": "raw", "annotations": [], "confidence": 0.9446560898795724, "data": [{"start_time": 0, "text": "So good afternoon. Thank you. All for being here. Today is Thursday, June 27th, 2019 and the special housing held energy and workers rights committee will come to order. It is 12:02. I'm Teresa Mosqueda chair the committee. Thank you so much for being here council members, some want very excited to have you and thank you for your announcement as well and support of the legislation today. We have four items on the agenda items are related to the hotel worker protection legislation. These are Council bills 1195 +549-555-119-5956 and 119-5057 really happy to see a full audience here today. As you many of, you know, we have been having ongoing conversations over the last two or three months. I want to take the folks from the hotel managers who came forth under the table the folks from the The workers who presented at the table on people who come and hosted events at the Seattle library to talk about some of their I'm experienced as well. So thank you for doing that and just as a reminder, we'll talk about this a little bit later. We will have to at least two other opportunities for folks to provide public testimony today or throughout the next few weeks and is coming up on July 2nd at 5:30 here in council chambers as we'll talk a little bit more about that before the end of the meeting. Those are the four items on the agenda and comes number someone is I couldn't build you if there's no objection. I will prove today's agenda. Okay, no objection. So why don't at this time before we get into the meat of the details in the legislation when we go forward with a public comment if you have signed up to testify we have a 2 minutes for each person, please note that we do have a lot of folks sign up and we hope that you can stick to the two minutes script recognizing that there will be many more opportunities to come and testify. In the next 3-4 weeks here. So, the first person that we have to testify is from hotel Nexus. I'm sorry about your name pronunciation. Please help me followed by Kevin Norris from Parker Smith feek. Welcome and please correct my name pronunciation. You're correct. My family is on the hotel Nexus in Northgate. We are small business and I sit on the mayor of small business advisory Council Seattle hoteliers including myself have supported Progressive legislation such as a minimum wage increase paid family leave and panic buttons for hotel employees as an immigrant business owner. I'm fully vested in making the city and region a Vibrant Community for all however, the medical access portion of the proposed HHS legislation is a tolling of the death knell for family and locally owned businesses in the city of Seattle as we came out of the Great Recession our hotel revenues began to rise to pre-recession levels. However, every dollar of that increase has gone towards increase labor costs and other expenses. Every single Dollar in 2019, however revenues are down again Seattle hotels overall are down double-digits. Our hotel is down over 15% in revenues this year, but the impact our bottom line is considered considerably higher because although our revenues have gone down our labor and other expenses continue to rise substantially the full cost of this proposed Bill to the hotel Nexus would be $850,000 per year. This is not an amount. We can afford the cost increase to an average midscale hundred 50 room hotel in Seattle will be $500,000 per year. This will be the straw that broke the camel's back. I know the cost of health insurance is excessive, but the solution is to work with the state to offer more affordable option to the public option. The solution is not to impose a completely arbitrary and capricious dollar requirement on only one industry. This isn't going to solve the problem of healthcare costs the hotel Nexus and other Seattle hotels were already exceeding the ACA Obamacare requirements, and we will continue to do so without this legislation continue to offer gold levels gold standard Healthcare to our employees the medical access filtered targets only one industry and requires payment of Health Care based on exorbitant specific dollar amount without regard to income or employee contribution. I have tried to go over the last few years to remain positive into work for to Seattle that is open to Economic Development and job creation. She's summer clothes legislation does exactly the opposite. Thank you. You're summarizing as I interrupted you. Thank you for your testimony. Kevin Norris followed by a lever from Hyatt. Hi, welcome Kevin. Thank you. Thank you. Cancel. Why didn't Kevin Norris I'm a health insurance consultant in the Seattle area with Parker Smith and feek where locally owned friend has been here since 1937. I'm speaking with regards to the city's proposed ordinance on the medical access provision my colleagues and I represent a number of hotel and restaurant clients in this area in their pursuit to purchase and provide the best level of benefits to their employees. We consider both employees and employers are clients in pursuit of helping to help with the cost in the complexity of benefit programs are clients demonstrate year after year their commitment to providing employees with attractive in competitive benefit package is particularly in this competitive landscape of the employer and the labor market Provisions the medical field that require employer's to pay the money on a gross dollar basis to ensure their employees and their dependents does not seem to have much basis in the reality of the marketplace in which we work. It ignores how underwriting takes place from players of the size affect. How to spell their premiums are set by the level of the benefits as well as health status of employees reflected in their claims experience. The price of coverage does not necessarily equal the quality of the coverage. It seems to be a blunt Hammer approach and turn to setting the requirement for employer contribution towards the cost of coverage the ACA under the Obama Administration determine are created a actual guidelines based upon a metallic tears to assign quality of coverage of four different levels of benefits placing an arbitrary value does not properly measure the real value of this coverage. I'm interested in understanding how this the monthly premium ausward arrived but looking at several of our hotel industry clients, these premium amounts are in excess of 100% of the full cost of coverage for all enrollment tears employee and dependent. We do not see any other vertical or industry vertical in which employees have no cost-sharing even most public entities require some premium sharing. Based upon the proposed employer contribution levels. These employers would not be in a position to continue the current levels of benefits that they offer. If not, take more drastic steps, and we'll happy to take your public comment as well. I know I had to rush you there at the end. Also a we will be following up either. I did hear some suggestions around the calculation interesting conversation to be had about individual Market versus large group market sell happy to follow up on that and thank you for your presentation Moon. Hialeah Lamar and I'm with human resources. I represent 7 hotels in in the area. Thank you for hearing us. The first thing I'd like to say is that the health and safety of our team's is of the utmost importance to me and to us I'm here to ask you the drafts and their vastly different than what was initially shared. We're asking for additional time to review and provide feedback on these initiatives. Thank you. Thank you and that is a good reminder for me to remind felt there was some confusion. I think some folks out there with a vote today. This is not a schedule for vote today. So I'm we do have some time as we mentioned about 5 weeks or so five to six weeks. Hi Anna, Association. We represent Hotel operators router City including immigrant and family owned properties and this legislation impact all of them including their gas and their employees. Every member of the team is critical to bode hospitality and that means making sure each employee is safe in the workplace. The Seattle hotel association has and continues to support Panic buttons as an important component employee safety. We were proud to support state legislation this year that addresses the Statewide by requiring Panic buttons and hotels throughout Washington. We've been committed to providing feedback to ensure that any legislation protects our employees. I will also considering the complexities of Hotel operations. We believe they're still work to be done. For example, as you've heard the required Healthcare expenditures for employees including part-time employees in the current draft party the cost of actually providing high-quality health coverage, and that's an issue that we need to continue to work to resolve. I will also question your decision to include non Hotel employees and small businesses and this legislation simply because they might be a tenant of a hotel. This legislation is moving quickly. I'm including special meetings like this one today and I deserve so you and we together take the time to make sure we get this right. So we look forward to continuing to provide feedback as part of this process to ensure that the final legislation furthers our commitment to our employees and also our ability to provide world-class Hospitality here in Seattle. Thank you falling by Isaac organista and at Washington Camp welcome, and then there was a group from Unite Here will come Isaac. Hi, my name is Isaac and I'm with Washington. Can I last summer? I worked with Hotel here in Seattle and where I quickly befriended the housekeeping staff because I was the only Spanish-speaking a fun test for the workers were wonderful as they reminded me of members of my own family, but they're kind and playful personality yet hard-working demeanor. All the workers always gave it their all never complaining about the physical toll this work has on their body and they can testify themselves. It is intense work at quick pace. One of the housekeepers there Norma Wentz got injured on the job. She had slipped and Fallen while cleaning the bathroom hurting yourself, which made doing this physically demanding job even more call and pay inducing the rest of housekeeping had to keep clean the room. She was assigned. She took the next day off. But then you go see a doctor cuz you can afford to do so. She was already working full-time at the hotel and on your days off was working to clean individual houses as an extra source of Revenue yet. She still couldn't afford to go see a doctor Norma story is an anomaly. In fact, it's a story that many hotel workers can resonate with this is why we urge the members of the housing Health Energy and workers rights committee, and the city council has a hole to stand with hotel workers and support this legislation in its entirety along with any necessary and proper word by committee chance of us together. We thank you and the council member Gonzalez for your continued leadership and support in the truth from Oma and defending these hard-fought rights for Seattle hotel workers. Thank you. Thank you very much. The next group we have signed up is a group from Unite Here Local 8 and as per custom will give folks a 5 minutes if there's more than two people. After that, we'll have Marcia bolzer. Welcome Marcia high and then will be Grace hung. Welcome. And pulled up microphone real close to your mouth. Arrow counseling council members. My name is Lola Riley. I am housekeeping of Edgewater Hotel and I a member of Union hero accolate with 2004 rock on giving a lot of support and thank you for the law you are taking about what teams has housekeeping. I watch I sold by Hotel guests assaulted by Hotel guess I have told a story of what happens to me in order to fight to making thinking better for hotel workouts, but it was it was very hard for me. Meaning of my fair that people would not believe me. We'll just say it was my sweet coming through. Zedd have time after the court off of that. I do not have hope we have had to fight so hard at my hotel just to get panic button that wall light it feel like normal. Nobody was thinking about our right to get to work and safety it feel nobody was doing anything to stop what happened to me for happened to other worker. Today I am full of hope and pride to see this was introduced when we share our story immigrants woman and woman we need you to do have us to us. And today's city is doing. Thank you very much. Hi Alyssa, I come from the Philippines Embassy Suites, Seattle. Yeah, I'm moving here in America to make my better life for my family. I'm a single mom. So my insurance is we all know it's too much expensive. I have a daughter. I want to send her to college to her puter to make a better life. Yeah, that's why I'm over here in Seattle. Thank you. Captain in Council Members Abby Lawler with Unite Here Local H. And we're going to think the council for stepping in the void left by the really terrible Appellate Court decision on initiative 124 and things are muscadine councilmember Gonzalez for your leadership and training that these protections once again become Seattle law legislation being briefed on is to really important goals for as approved by 77% of Seattle voters incorporating insights that we've learned a from the two years that the lie was in effect and also from the Relentless litigation that we've seen from the hotel industry and Evie Clair. We don't expect those legal attacks to ever go away service cover for the city to back away from the incredible incredibly important strides. They've been taken in particular on the issues that leaves unlu a highlighted on protecting workers from workplace violence and on expanding access to health care for more workers and their families. Send to address the real lives experiences of hotel workers Define it again to rectify the fear the Discrimination that harassment the violence the stress anxiety. The pain is women immigrants and people of color who make the hotels in the city run that they face in their work. I'm so really grateful to the committee for scheduling a special public hearing on Tuesday after the end of the housekeeping shift that you're about to hear after many more workers that day, and I'm hopeful that you all will be able to attend in and to hear from hotel records for members that day at thank you again for bringing this package of legislation forward. We look forward to working with a committee to strengthening it and making sure that we get these protections back in place. Thank you. Thank you very much. Marcia followed by grace. book of Mercia Carnival council members thank you so much for my beginnings of activism in the 1960s. I have served or started a number of organizations and I know that when we pay the highest I'm the best Protections in the best Healthcare it works and we win and over these years of mutual projects that have the name did better in our community. I have learned that I now fully and holy believe that our objective and our goal is always and always should be more happiness in the world. Justice is part of Happiness. We know this we know that Justice and Equity or sure guide sure Companions and any Hope For Better Lives and is it just or Equitable to leave hotel workers without the decent protections that match the times that we are in now? No, it is not and for that matter, it is not a moral act either will Hotel owners by denying their employees safe workplaces healthy workplaces to their own or our communities happiness. They will not increase the real Justin Equitable happiness. Yes and a great many Community workers and members lgbtq included Hotel guests included and in truth, the owners themselves will experience that happiness most assuredly they will thank you. Thank you Marsha. I love your enthusiasm Grace. Thanks for being here. And if there's anybody who walked in late and wants to testify you're welcome to still I will put an extra sign in sheet at the other table so you can sign it, Grace. Hi, my name is Grace. Give me a scientific Institute on gender-based violence. Thank you for the opportunity to comment in support of the four proposed ordinance is supporting the safety Economic Security and House of Hope Hotel workers in the city of Seattle ization is a national Resource Center providing training technical assistance research and policy analysis, and advocacy addressing gender-based violence in the Asian and Pacific Islander community. And so we are here in support of these measures given the significant number of Asian Pacific Islander individuals who work in the hotel industry. I want to say, you know had the opportunity to work with a few review for decades at this point on the issue of gender violence in our community and it's heartening to see that this ordinance. I mean the the initiative that that Encompass the measures covered in your ordinances were supported by 77% of the city. I'm in the in the elections, you know, and that there is recognition of the vulnerability to violence and the healthy Who's facing hotel workers often due to limited English and job-training limitations API and other immigrant women face barriers and speaking out about abuse and injuries on the job. So we along with various Partners across the country and end with Unite Here have been promoting safety from sexual and domestic violence in the workplace. And so in addition to the panic button and the the measures relating to preventing abusers from returning we also support the health care and economic Protections in the bill relating to the ability of survivors of domestic violence and sexual assault to be able to recover from injury and leave abusive relationships and recover from abuse. So these pieces are critical at along with the the Panic buttons in making sure that hotel workers accessed have access to Safety and Security. So we asked that the council members passed. Measures and recognize the importance of the state health safety health and outside of me for this group of workers and thank you for your leadership. Thank you very much. We will take that second sheet and excited to see more people signing up. The first person I'd like to call is if I share saved from legal voice Abraham and then Michael Clarke from the hotel cistercian. Good afternoon council members and thank you for the opportunity to testify. My name is spectracide to bring me my work at legal voice of progressive nonprofit organization that litigates for women's and lgbtq rights in the five Pacific Northwest states legal voice has been providing analysis and support to Unite Here Local 8 and older Community Partners on the rulemaking related to eye 124. And now on this ordinance given our long-standing focus on gender-based violence and economic Justice for everyone all workers. We are particularly focused on the draft ordinance protecting hotel workers from guest sexual assault and harassment overall. We can mend the city council for the ordinances strong sexual assault protections for hotel housekeepers in room service workers and we think chair Mascota and councilmember Gonzalez for the leadership and defending these rights for all workers. Simply put the streets looking for permission from city council to continue to accommodate guests sexual harassment and violence at the expense of hotel workers. We cannot stand for this the legislation has proposed and sends a strong. Fish that we agree with the hotel workers should be trusted all workers should be trusted and when a hotel guest has perpetrated violence action must be taken to prevent that violence and protects. The workers are policies must recognize that it does not the workers responsibilities to avoid violence or harassment workers are not to blame their assaulted or harassed and they should not suffer health or other consequences in order to accommodate the her the consistent with that we would recommend that in the immediate aftermath of a workers Survivor report of harassment at the ordinance require that hotels relocate guess two different floors as opposed to putting the burden on workers to find another assignment and further. We suggested the legislation include a regular study by the city to study the effectiveness of the sexual assault and harassment protections. We urge the committee and the city council of the whole to Stanwood hotel workers and support this critical like legislation. Thank you. Thank you very much Michael Clarke followed by Cindy Domingo. Welcome, Michael. You'll have to forgive me. I just come from the dentist. So I'll try to get the microphone a little closer to your hotel. And I also sit on the Seattle hotel association board. So I've worked in the hospitality and specifically the hotel industry since 1986. I started as a dishwasher in a Hotel Impossible a waiter and work my way up over the years. I'm very proud to support an amazing team of 250 employees and when I say support them, that's what I mean. I don't think of myself as overseeing them. I think of myself as someone that's there to protect them to help them to make sure that they can be the best that they can be interested in them personally professionally and their success is our success. I believe that I believe that ever since I first became a manager and I consider it a fundamental. I love my job without them. We are nothing we have nothing to see if the obviously is a top priority. And again I said that I cared deeply about all the folks that I work with we committed to. We've been committed to providing Panic buttons for employees at my hotel. They been in 400 for about 2 years of legislation as proposed impacts far more than the hotel staff and safety issues the ancillary businesses that have been recently address many of them are small businesses who lease space and provide services in our hotel. It could put many of them out of business. It doesn't make sense to extend the requirements simply because they are tenant or provide services. I've had a chance to review the health care revisions the cost requirements that portion of the legislation is far beyond what most businesses in the city offer cost-wise My hotel provides healthcare insurance very high quality insurance for employees. The required expenditures in the legislation are significantly higher than what it actually cost us. All right, it's important that we get this right and not just push it through. It's important that there's more dialogue between our industry and the council and we come up with solutions to draft ordinances are mutually beneficial. Thank you very much and we're happy to take your written testimony. If you'd like to leave it because we had to cut you off at the end. They're welcome Cindy Domingo. Hi Ashley. This is my first time to testify over here in 25 years that I work across the street. And this is to tell you how important this issue is to myself as well to King County council member Larry Gossett who I'm representing here today. And as well as the Asian Pacific American labor Alliance, which is a National Organization that has a Seattle chapter that organizes and works for the Asian Pacific Islander workers their needs and their right to organize and to advocate for better working conditions for themselves in a fair wage. So thank you for this opportunity to speak before the housing health and energy and workers rights committee. I know that all of you on this committee are strong advocates for workers and especially for those that are most disenfranchised like the hotel workers. I come here today because these women that we're advocating is API women of Taino women the African American women are very important to me personally and to council member Gossett antipala. My family had many hotel workers and their families who faced much more harsher conditions because they were unrecognized and fortunately for these women, they are courageous and have stood at the front line to win their rights as an organized labor force. Sodas with the mission of Apollo and councilmember gossett that have come here to speak on behalf of women Hotel employees who always seek to be safe on the job and free from Violet a harassing contact. In other words what these women hotel workers are wanting is there basic human rights to work without disrespect fear and physical harm. That's so often comes with their job when I think about my job at the county. At in the legislative Arena. I can only imagine what would happen. That's so often happens to Hotel women workers. If someone was to expose themselves to me if someone was to continually come to my work site after harassing me and then proceeding to harass someone else and all of those examples severe actions would be taken legislation has occurred at the county to protect us workers from that type of activity violence and sexual harassment. But expect our hotel workers to be without those protections why because they're women because they're women of color because they're immigrants and refugees and this audience today is here to speak out for these women to join with them on the front lines in their fight to get that respect and their human rights. So I support Apollo support and councilmember gossett supports the passage of this legislation. Thank you. Thank you very much Cindy and please extend our appreciation to council member Larry Gossett as well for his support of this. I want to just jump Stella check to see if there was anybody else who wanted to testify who hasn't had the chance to Okay, so I'm seeing no one else signed up to testify I want to acknowledge before I get into my comments that the council here represented in 2016 and before and before in the years since 2016 was very supportive of initiative 124. You all passed a resolution and today is an extension of that conversation from 3 years ago. I'm happy to open it up as we go down the line I come from Irma Gonzalez. You are a co-sponsor and then if there's others that would like to chime in if given your pass work on this we would welcome that before we get into the meat of this sure. Thank you. I appreciate the opportunity to just make them brief remarks and I won't make them too long because I really want to dig into is briefing and give Campbell Central staff and the city attorney's office an opportunity to really walk us through the the meat of what we're here to talk about, but just wanted to extend my gratitude to you for your ongoing. Operation on his issues. It's been I think a long six months process over the last several months to really continue to engage the various stakeholders of workers and and hotel owners and property managers in getting us to this point now and I'm really excited to continue the conversation over the next six weeks. And I know that there are some policy issues that are yet to be discussed and debated and then he does a good opportunity for us to do that and inserted the spirit of transparency and wanting to have the conversation publicly. I know that you and I felt it was really important to introduce a set of bills to begin that conversation and really excited that we're finally here and looking forward to I'm continuing to work on these issues together to make sure that we have the strongest protection is available to hotel workers. Thank you very much. The workers who have spoken up here. And also you have been speaking for yours and unites your age the union that the workers are organized with it is a really powerful example that unites your normal Unite Here Local 8, but unites your Nationwide have shown throughout the last few years that the best way to push back against the attacks on workers rights and especially the ramping up of attacks on workers rights to the Trump Administration is for workers to be unionized with strong unions that are willing to carry out a concerted electrified bag. And I absolutely II everybody who is spoken here and in the past about how we cannot compromise on the question of sexual harassment of a workers and especially given that this is an industry that is most represented by women workers Asian Asian Pacific Islander and women of color as a whole many Women who also faced other operations in society. And so that is why it's really important to the council take a strong position on this especially in light of the fact that 77% of the voters voted in order for it. And yes, it is a terrible ruling that has come from the cold and I just wanted to know that as soon as that happened my office was in touch with you Nigerian letting them know that we will of course be with them every step of the way and I'm really thankful to Lisa and Lola who share their stories which is not easy to do. So, I really appreciate it. Anybody else comes in the marble door, Brian. Okay. Well wanted to acknowledge that you're here. Thank you. I didn't say thank you yet for being here Council. We are joined by customer O'Brien and councilmember horrible. Thank you customers want and councilmember Gonzalez errand before we get started. I should go ahead and read items once before in the record and then we will introduce our panelists year. Hey, we have Council bill 11955 for an ordinance related to employment in Seattle requiring certain employers to limit room cleaning work clothes for certain employees. Cancel the 1 1 9 5 5 5 and Ordnance related to employment in Seattle requiring certain employees to make required Healthcare expenditures to or on behalf of certain employees for the purpose of improving access to Medical Care Council Bill. 1 1 9 5 5 6 and Ordnance relating to employment in Seattle adding a new chapter 14.29 to the Seattle municipal code and a man in section 3.1 5000 and 6.208 o 2 0 of the Seattle municipal code and Council Bill 1 1 9 5 5 7 and Ordnance relating to employment in Seattle requiring certain employers to make certain actions to prevent protect and respond to violin or harassing conduct conduct by guess. Thank you very much. I'm what we do introductions and then I have a few opening comments before we get in a deputy director for Council Central staff staff quality manager Office of labor standards. Excellent. Thank you. And I want to see the first time you've had the chance to come to the table in your new role as our lead on labor policy issues for essential Staffing excited to have you all here and I want to say a special thank you to our Central staff but also to the office of the labor standards for your ongoing analysis and working with us, then the a lot apartment over the last few months as we've been crafting legislation really appreciate your work is out of the labor standards and appreciate the executive for continuing to engage with us. So just very few comments. I want to reiterate that today's conversation has not cropped up out of nowhere the today's conversation as you heard from Council Members a Gonzalez and others is that this is a continuation of the work that was initiated in 2016. And just this year alone, we've had dozens of meetings with stakeholders. The office of labor standards are legal teams Council colleagues and executive and we're very excited to bring this forward to continue the commitment the will of the voters which was 77% in support of the measure to send job protections to hotel workers. The initiative that went through then was followed by intensive rulemaking that happen at the office of labor standards. It was implemented and so we're in a really interesting position right now where we have the benefit we have the fortune of looking at how it was implemented and and also learning from some of those issues as I've said before any piece of legislation and it's advised initiatives as well. We get the benefit of looking back and seeing what we can do to make it more implementable workable and the to achieve those goals that were included in the initiative. Unfortunately that initiative has been held up in the court and is pending legal challenges and while we got good news earlier this year that the Supreme Court is taking up the issue. Later to the initiative Incredibles city attorney's office. I want to shout them out. I'm have done a great job of continuing to argue the case to ensure that the city of Seattle voters will is implemented and uphill and well, we wait workers remain unprotected and while we wait for that decision, they continue to face extreme conditions some of which we've heard today and many other of the knowledge some of the hotel managers have also said that while the issue is being debated many of them have continued the implementation which we appreciate but we don't want there to be any gray area or anywhere. So the intent of this effort is to make sure that individual the house cleaners those who are working at hotels on the property. Anybody in that area is free free from harassment intimidation discrimination. I'm has reasonable work standards in place recognizing incredible nature of that hard work. It is to be working in a hotel that they have adequate health. Does I mentioned earlier today at a press conference there's an incredible a report that was put out in 2016. I Believe by some of the partners at Puget Sound Sage that looked at data from the Bureau of Labor Statistics and saw that hotel workers house cleaners have higher rates of injury than coal miners. And those who work in the building construction trades. In fact hotel workers have three times as much back injury claims as those in the general population. So there's no question about why I think the voters wanted to ensure these protections for workers. This is a very strenuous type of work as a rule and Lisa said as we were just closing up earlier today, this is really hard work. You guys do very difficult work everyday and so the continuation of the protection for workers is incredibly important in the race and Equity analysis that were applying to this work has been credibly important. Let's lift up again that these are mostly were women workers mostly immigrants mostly cheap. Color and we want to make sure that we are extending the protections to this industry that we would anticipate and expecting any other Industries. So again, a special appreciation for those who've been engaged with us and bring forward the legislation here today one of reiterate. We've had three committee hearings best for on March 21st, we heard from Central staff about the provisions and initiative 124 on March 3rd. I'm sorry April 4th, we heard from Unite Here and hotel workers about the impact of the health and safety concerns on May 2nd, we heard from leaders in the hotel industry's about their experiences was implementing initiative 124 and how to make some improvements if we were going to move forward. I had the chance to hear from them in the meeting that and it should have 124 was pass and you know, this really did help advocate for them to push for the Panic buttons at the state level which was initiative Senate Bill. I'm sorry Senate Bill 5258 and we want to underscore appreciation for the work that you all did this legislative see Turn on the panic button and we talked about some of the feedback that we've received so far in front of us today underscoring again that this is the first draft of the legislation there will be more conversations to have on July 11th. We will be continuing the discussion on the legislation and potential amendments. So please you know, as you hear items come up over the next two weeks. Keep in mind that we'd like to do is issue identification on the 11th. I please let us know if you have other ideas that you could present to us on next Wednesday that way when I think given the holiday we will incorporate those into a memo that would be very helpful on July 18th. We will be discussing the MMS and holding a potential vote and we have also held August 1st for potential vote is needed on the amended legislation. So looking forward to today's discussion a special thanks to all of you and I'll hold them things to spend on but this has been an intense process to come up with these on four pieces of legislation today. So let's go ahead and walk through it if we can let 9554 and then go from there. I'll turn over to your day on to help us understand more of the general context before we go into each one if you'd like. Casetify might we also have the memo the central staff memo that was provided for us. I'm going to I think it was like 11 pages as we have copies of that on the desk if anybody wants that and we will also scroll through so that you can see where we're at in the memo. Thank you to a mosquito. And I know that you referenced is also linked on the committee's agenda for those who are not physically here. I can see it on the web the chair already covered. A lot of the materials that are in the first couple of pages of the memo is essentially the orientation about how we came to be here at the table today. What steps the committee has already taken and what some of the next steps are. I think we are prepared collectively between Karina and I we will walk you through attachment a which is a multiple page Matrix that shows the provisions that were included in the initiative 124 that are as the chair mentioned are now on hold pending legal Challenge and comparing and contrasting the provisions that are included in the four pieces of legislation that are on your agenda today. For discussion not for a vote. I think we're going to start with Karina is going to do some of the overarching issues that cross all of the the provisions and the bills that are before you and then I'm sure she's with a church permission. She's going to cover a little bit out of order of what you just suggested. She's going to Cuff. She's going to cover a couple of the bills and compare and contrast with the initial F and then I will cover a couple. Write thank you. So to begin with overarching topics initiative 124 was one ordinance. Now, we have four ordinances. And as far as Employer coverage in maintains the same definitions of hotels 60 + rooms for some ordinances 100 + rooms for other ordinances. It continues the requirement for contracted premises or contracted services to be covered. However, it gives it a new label is called answer Larry Hotel business now and three of the ordinances and one it's just contracted services and we go through each ordinance will also specify some additional modifications where and tillary hotel business and two of the laws has an employee threshold as well. And that recognizes the impact on small business is it those are those ordinances have more of a economic impact on business cameras? A lot of time on this chart so we know exactly what the parts are to it. But I just wanted to let folks that sort of the far column are the topics that are included in the various pieces of legislation. The next column is says I 124 so that represents what was initially in the initiative that was voted and approved by 77% of Voters in city of Seattle. And in the last column is what what kills worms Kata and I are proposing that is reflected in the relevant. Inappropriate Council Bill. Thank you very much for that guide. It is a very comprehensive chart could follow along with the comparison is here and thank you. Lulu. Sure. Okay, so the next overarching Change is regarding enforcement still maintaining a private right of action initiatives office of labor standards had a limited enforcement roll. The office could conduct investigations in issue administrative rules. That didn't have the authority to impose a remedy or a fine on a non-compliant employer unless that particular requirement happened to overlap with the wage theft prevention or an Enzo that ordinance broadly covers any situation where an employer owes an employee money. So before office of labor standards could only impose a remedy if the employer didn't pay the amount of money for a medical care or didn't pay the premium for cleaning going over the maximum square footage. So with these all four of these proposed ordinance is the opposite of labor standards has a full enforcement roll. As is true for all of our other labor standards, so it's maintaining that consistency. Not in this chart but something that's noteworthy is that the initiative had a collective bargaining agreement waiver for the entire ordinance for these proposed ordinances? The CBA waiver is continued for all of the ordinances except for the ordinance addressing workplace violence and protections against sexual harassment as well. So going on into the individual ordinances mosquito has stepped away. I think I wanted to start I'm taking her. Would you like to continue with the protections against workplace violence and harassment or go on to workload maximums follow along as a reference understood so to begin what employers does this ordinance cover? It covers hotel with 60 + rooms. That's the same as the initiative and an ancillary Hotel business of any size so that very much mirrors the original initiative as far as employee coverage. Again, it's maintaining coverage of employees who are covered by minimum wage and working for a covered employer in Seattle. So it's covering workouts with in Seattle's Geographic boundaries, the initial ordinance had a requirement to work at least 2 hours and any work week in Seattle that is actually been struck as an overarching change. About all the ordinances a change in this ordinance is that there is no exclusion for managers supervisors and confidential employees. So these particular protections will cover all employees that work at that place of business or for an answer Larry Hotel business that are covered by minimum wage. Similar to the initiative employers are required to provide a panic button. It does have a slightly expanded definition of panic button to reflect the need for employees to receive assistance directly to wherever they are in the hotel wherever they are experiencing that alleged violence or harassment. So there are some additional protections written into the law for those situations. The panic button is also required to be provided to all employees who work in a guest room or make deliveries to the guest room in the initiative. It was just for employees who were alone in an isolated situations with this new ordinance, even if there's a team cleaning or team delivery, they're going to both be given a panic button. Next is that employers are required to develop a policy against violent and harassing conduct and distribute that policy to the guests and two employees and then if an employee reports an allegation at that a guest participated or engaged in violent harassing conduct the employer must take a series of actions and prescribed behaviors if they determined that the conduct did or didn't occur so for this particular part of the ordinance, it is quite different. It has the same goal of protecting the worker immediately, but the way it unfolds is different from the initiative. So now after receiving an allegation an employer must take immediate steps to safeguard the employees during an investigation conduct an investigation make sure to inform both the guest and the employee of that investigation and then issue a prompt written determination of their final conclusion of the employee's allegation does not need to be accompanied by sworn statements about broadening the the ability for the employer to make the investigation without that information. Gangnam on item number 6 the Protections in the chicken just go over it a little bit more in terms of what the initiative say said versus what's being said here. What are there any specification about what the investigation or what would constitute an investigation and I'm asking that because obviously we don't want the intent of the legislation is not to set of go to go go back to an HR base model meaning of Marlboro. It hasn't worked enough of workers in general. I don't mean just hotel workers, but the whole model of in the workers going to the human resources department saying hey, you know something happened but then and then in name, the investigation was conducted but it didn't really benefit the worker because the role of HR has actually not to look out for the workers. Settle it somehow I make it go away. So what what approach are we using here? Yeah, thank you for that. So what's interesting about the initiative is that the employer's obligations after receiving an allegation automatically jump to post investigation. And in this initiative there it actually prescribes Decks that need to happen before even reaching that conclusion of whether the contact did or didn't occur. So in the initiative, it just said if the employer decides this happened this is what they need to do here. There's a full investigation that the employee needs to be apprised of the stops. The gas needs to be apprised at the steps. It does say it's a fair investigation. It's impartial and that they're actually needs to be a written determination. So again that is giving information both to the worker and to the guest of what do employers final conclusion is so in the initiative after receiving the allegation that the Lawyer needed to document the identity of the guest in a list that was retained for 5 years, and now there's no requirement to keep that list, but the employer doesn't need to do to take certain actions for a certain number of years. The employer needed to warn all employees who were assigned to work in that guest room for 5 years and then Depending on the nature of the allegation if it if it included sexual assault sexual harassment or assault the gas the hotel must decline service to the gas for 3 years. I'm not right. I wonder if I could make sure that I did, but I must want to emphasize in the initiative in your accusation was sufficient to require the hotel to take actions that could involve Banning the gas from coming back to the hotel the legislation that's before you includes the potential repercussion of a gasping band, but it does require that there be some level of Investigation doesn't lay out exactly how that investigate every step of what an investigation must include but there must be a notification to the guest and to the employee that an investigation is underway. So they have a fair opportunity to provide their perspective of what happened it could Other staff spoke, but they're not specified in the legislation at the end of the investigation if the hotel determines that the allegation was credible then repercussions flow depending on what kind of action or conduct place. Did you want to add something probably the one thing that I would add in this area that I think is important for us to have a conversation about his to fold one is some of the points that Dan made around the lack of specifics of how like how the investigation pursues. I think we are of the belief that those are issues that can likely be considered and addressed in rulemaking to they said that they need to be so I keep in mind that we still have the path of rulemaking to get into some of the more granular details. The second piece is that there is a discussion that we can have around what the standard of proof would be required in in the investigation process. So that again we are addressing any potential due process concerns and it's something that we've initially talked about assertive. How can we make sure that we have Clarity around what the standard of proof is? So it's not a you know beyond A Reasonable Doubt, but Like leaving not for example, and right now the language of the ordinance that we've introduced is silent on the issue and I do think it would be prudent from a policy perspective to be clear on that in the rules are in the Ordnance. I think there's a question about whether we put it in the rules or in the ordinance. But either way I think we need to we need to sort of directly answer those questions. I just wanted to just raise that. So is Dan was saying depending on the results of the employer's investigation certain repercussions will follow depending on what the outcome was. So if the investigation determines that the violent or harassing conduct occurred and also involved physical injury bodily injury and other unwelcome touching the hotel must decline service to the guests for 5 years invested gation determines that the conduct occurred but did not involve that unwelcome touching then the hotel not bandhas the guests or the client service, but they will not assign employees to work in that guest room or make deliveries for 5 years. In the situation where they investigate the best vacation didn't show that the conduct occurred the hotels still must not assign the employee who made the allegation to work in that guest room for 5 years. And then in all of this against can appeal the hotel's determination to the city's hearing examiner and the rules and process for that is in a separate Seattle Municipal Code chapter 3 .02 Keep on going. I'm trying to understand how the investigation of that investigation plays out. I mean do we have we have some vision of what that looks like or how long it takes and who's involved or is it is it really just pulling what we have here is about the detail of what we have at the moment. So this is what we have at the moment and going to what council member Gonzalez was Saint talking about rules that can be a place that can identify requirements for how an investigation might fold certainly office of labor standards questions and answers could also provide guidance. But as to the detailed requirements, this is what we have in the lower right now. I have a I have a couple different interests here and I'm trying to figure out how to navigate them. When I absolutely believed it that if a hotel worker says that they've experienced any of this type of conduct that we need to have rules in place to protect them immediately and in the long-term. I'm also concerned about a hotel Running an investigation. I don't know that they have the expertise to do investigations. I'm you know soon as we get into an investigative body. I would want to ensure that that the types of biases that often creep into all sorts of discretionary decisions that there are you know that these are some some awareness or expertise or level assurance and I I just I have concerns about a disproportionately certain types of guests being a treated one way in an investigative process versus another possibly intentionally in a kind of bad actor situation, but even just were kind of unintentional bias starts creeping into this know if there's a a body that has expertise and doing investigations and is building expertise. But if this is, you know any given hotel in town May conduct an investigation You know every couple years and there's different people doing it. I'm worried about how that how that place out and what happened. I appreciate the appeal to the to the hearing examiner. I'm but I'm wondering if there is there's another body that would be doing these investigations Beyond just the hotel cuz I am worried that they don't have that expertise and it end the word has one level the way that without that expertise that we start treating different gas differently again want to support the workers and allegations have been made but a worker again, you know an allegation against a wealthy white individual in a hotel might have a different level of Investigation than a you know, lower-income person of color who gets an allegation of them and their ability to defend themselves and stuff like that. So I learned about that so I don't care if you have thoughts on that. I do have some thoughts on that until after council member Herbalife. She may have some thoughts as well. You know, I hear what you're saying, but the fact is that owners of private businesses can currently expel and trespass people off of their property without any investigation. So the fact that we are we are creating these standards or as they may not be as clear as we'd like them to be there right now. And so the ability of a private business owner to use bias to make decisions around exclusion of their gas already already exists. So, you know, I think we should have more of a conversation around this and then try to potentially use rulemaking to create a digital Clarity. But given that I almost feel like we're we're tightening up an area where there's potentially a great deal of bias particularly for this kind of activity is moving us in a direction that will reduce the bias in those decision-making one thing. I did want to flag on the on the hearing examiner side. Is that I recognize that appeal processes are typically and but again, this is an appeal process that doesn't currently exist for people who are being excluded from private property. So this is like a new I think I knew. Serve not not a protection, but it's a safeguard right that doesn't exist currently for people being being excluded from from a private business. But I do recognize that the city has data that shows a disproportionate use of appeal process is used by people of color versus Caucasians. So I just want to want to think about the usefulness of the appeal process given that sort historical disproportionality that we know why people use the appeal process more than people are going to continue to do some more research were the policy implications as has been an outline right now and some other possible solutions. We've heard from some of the folks that office of civil rights Folks at Unite Here at the hotel association as well as kasimir bags. Who wanted us to look How STD could get involved we did have some of the initial conversations about that. I think it's important to note specifically about who this population is, I think folks are going to be more fearful potentially of calling the police if they experience retaliation and harassment and we don't want to create a disincentive for people to call if there is a concern around harassment and intimidation and I think we don't yet have a clear recommendation for how this could potentially be amended but it does sound like there's interest around the table and making sure that we get this right recognizing especially who the population is and I wanting to ensure that people feel absolutely confident about coming forward if there is something that's happened and also recognizing that if somebody is cleared it's a violation hasn't occurred and the accusation wasn't found to be accurate that those individuals also are not continue to be I'll called out so that that's the I think the sensitive balance or working on. Part of also, the issue is that if somebody does feel like they were harassed and that was their experience. We don't want them to be in this situation the futures of trying to find the right balance and policy to get there as what we're going to work with you all on and you all on in the next two weeks here. I should say to six weeks here, but I want a flag that this is an issue that we are continuing to look into this might not be the final language. So let's all put our heads together on this. Customer O'Brian when one thing that I don't know the implications of this, but I'd be intrigued to explore I hear the concerned that that a hotel worker may not feel comfortable calling the police about a certain type. I assume similarly. They may have hesitancy to go to the to their boss is about it too and wondering if there's a path to have you no doubt State Standards about civil rights be the body that adheres these concerns. I'm not there's an immediacy thing where you know, something is happening and you know, I need to finish my work day and I can't do that with someone here were you know, if it's a no 24 or 48 hour delay to go to the city that that's going to cause problems better. But as far as an investigation appellate process that has a little more oversight I'm interested in if those options have been explored. Cases are of that versus disc I as somebody who practice employment law on employment discrimination lawyer representing workers for 10 years. I share a fair amount of skepticism about about at HR processes and who they're designed for and it's pretty pretty clear that there is a standard in the industry to limit risk limit liability and therefore protect the employer as opposed to advocating and and engaging in corrective behavior on behalf of the worker. So recognizing that that's the environment. I think there's an opportunity to Tina recognize that we need to be conscientious of that sort of hesitancy to report which exists in all work environments regardless of what the industry is and I think that you know, the obvious opportunity here is for those hotel workers who actually are represented currently by Unite Here. They'll have us a shop steward to go to for someone else at the union to go to directly to help them with those potential complains. But I also think there is secondarily to that. I think there's a there's an opportunity for us to have a conversation about what it would look like to create certain Advocate position that would represent the hotel worker in this instant instant. So what you know, what would it look like to work example require that there be a third party who has the workers interest in mind during that investigation process and Reporting process to ensure that the workers rights were being protected and Mike's. Most employers who have HR departments, you know ordinarily have an HR representative a lawyer or a lawyer on call they're generally very well resource in terms of understanding the fundamentals of Law and how to structure investigation and employers. Generally when they do get a report of a violation of law like this one the the already have an obligation under state law to do an investigation of that activity. So if there is ever a claim of a potential violation again, that would violate the Washington law against discrimination which would cover this type of behavior. The employer already has an obligation in a duty to conduct an investigation if they want to have any sort of legitimate defense to civil lawsuits. So there's an opportunity for us to again addressing the concerns that you're bringing up in a way they could be reasonable the details. Obviously, we'll have to figure out cuz the devil. In the details, but I feel pretty strongly of it in these types of settings. It would be really important to provide the worker with the appropriate. Advocacy resources that that he or she would need to feel comfortable to first and foremost report and second feel like they're being guided through the Civil administrative investigatory process. We see this ordinarily in a lot of criminal cases, for example, so Casa program is a good example of that where we're folks are, you know assigned an advocate who helps them understand what the legal process is and what the next steps are going to be in search of the bureaucracy of that investigation. So I think there's an opportunity to perhaps explore that model here. If there's interest thank you so much. So we have no to this. I know everybody's kind of circling this issue on their papers and we will come back to this and work with you all in the next few weeks here at the final point will make about this particular ordinances that the initiative required a hotel to provide what's in quote sufficient paid time for an employee who made this report a violent sexual harassment to consult with the counselor or advisor. And so in this ordinance that sufficient amount of paid time is defined as up to eight hours of paid time within 7 days following this report a violent or harassing conduct. So that completes the description of that particular or an incident safety protections against workplace violence in harassing conduct the next ordinances protecting Hotel employees from injury. And this is the work load cleaning maximum limits. That's the more I'm I don't know if that's easier to understand or not, but it's another way of referencing it. So as far as Employer coverage at this has a larger threshold number of rooms for coverage. It has 100 + rooms in order for a hotel employer to be covered and instead of using that new term. Ancillary Hotel business. It is at limiting the coverage to do contractors who provide services at a large Hotel employees again or those who are our later covered by the minimum wage. And again, there was no requirement to work at least 2 hours and any work weekends Seattle and again, there is no exclusion for managers supervisors and confidential employees and this proposed ordinance all of the initiatives requirements that employers comply with the Washington State industrial safety and health act are removed because that already exists under state law. So this or dents doesn't repeat that. Again similar to or similar to the initiative. There is an established limit of 5000 square feet of guest room space that a hotel employee can clean. And that limit is for what hotel can require an employee to clean a hotel employee can request or consent to clean more. But with this ordinance does is definitively codify. The employee's ability to say. No. I'm not interested in cleaning more codifies there their right to decline that request. Room cleaning. It has a specific definition in this proposed ordinance and it specifically excludes something that I believe was excluded in the rules. Is that right? And that's what is commonly referred to as turn down service. So if the beds already made and the hotel employee is simply turning it back with maybe a mint on the pillow that is that is not considered room cleaning. It won't count towards their 5000 square foot maximum. A strenuous room cleaning. It has was defined in the initiative. It does have a tweak to it and this proposed ordinance where it is the same to you include a check out room the same to include to stay over room that the new change is that the state of her room is not have received a room cleaning for more than 24 hours. Council member herbel, thank you as a relates to the issue of room cleaning and its definition. I understand that some hotels break up the functions of room cleaning. So they'll have somebody one person who goes in and is responsible for only making the beds and I don't think this is this isn't the exclusion regarding preparing already made the Lexus IS up. How do we handle that issue where some hotels have sort of bifurcated the duties? I think probably for efficiency's sake or signing maybe somebody with more physical strength cleaning component of the overall room cleaning. So I'm going to posit an answer and I'm going to look to my colleagues to make sure that I have this correct my understanding is that if A housekeeper is performing a single Duty regardless of that. But if that the whole room counts towards that workload maximum. So, is that correct? So if the housekeeper is only taking the sheets off the bed and that is all that the housekeeper is doing that still 300 square feet if that's is the size of the rim to count towards their workload maximum that correct. I think yes, and no, I think that there's a an additional provision you haven't gotten to you that was added related to team cleaning so depends on whether or not we believe that sorry that those functions so I think they're commonly called as strippers or Hausman if that is considered a team clean. So they're cleaning the room at the same time. I think there could be an opportunity for the room to be split among them. But I think if they're doing I quietly independent of one another that there is room that that it would be the entire square footage that would count. So they would be subject to those square footage limitations as well. So that's a single employee going into a room and only removing the sheets. Therap subject. Yes, I would be 300 square feet if that's the size of the room towards their maximum. Where is another employee might go in and remove the sheets and clean the bathroom and vacuum the floor and that's 300 square feet towards their workload maximum correct definition of a stay over room is the idea that if someone doesn't have a room clean one night or one day and skip a day that that would be it. That's what's trying to trigger. It cracked. The green cleaning shelves. My concern would be just about the 24 hours have strict that is if someone got the room cleaned at 10:30 one morning and in the next day at 11:30 or 25 hours, I don't know that we would intend to say that is a stay over it. So maybe like a 36-hour rule would capture the typical variability. If that was the intent. It was really good suggestion and one we've also heard that 36 hours seems a little bit more reasonable with the current practice. And I think we'll look into that for sure. So you can anticipate that that one will be on rhoa identification. Thank you for bringing it up and for being really specific about let's explore 36 cuz that sounds like it's the number that's resonating with a lot of the parties involved. So Janae already teamed up the change for Team Cleaning, the initiative didn't address situations when there's more than one employee in a room performing the cleaning the proposed ordinance does the proposed ordinance allows hotels to divide the square footage by the number of employees in the room. So if it's a 300 square-foot room, there are two employees in there. It's a hundred and fifty square feet towards each of those employees square foot maximum. However, these employees have to agree to the team cleaning. And the reason for that provision is to address situations where it could be a team cleaning, but maybe one of the employees knows the the style of the other cleaner and maybe they know they're going to be in there doing 70% of the cleaning rather than 50% So it does have to be a in agreement to do that Team Cleaning company. Do we know what kind of? Numbers are in terms of you know, like how What proportion of cleaning in hotels is done in on an individual basis or Indian. Do you have any indication of that? And I'm also I mean this is not the main point but just it just made me think about whether it has any bearing at all on the incidences of sexual harassment if there was any indication that team cleaning, I don't know what all that does is but just a thought that occurred to me that does it is it is it Anyway I did or another proven to be adorned. We have any numbers. I don't just mean in Seattle, but just in general in the hotel industry or in in in workplaces of this nature and I oh yeah, I do think that is a good point about Employees having to agree to Team Cleaning. Is that also. Generally observed Norm right now by employers that they when they steam cleaning that it is when employees agreed do it. What was the standard now, or is it something going to be somebody new or is it just go Define what's already done or so the quick answered all of your questions as I don't have all of that information. So I don't know if it's the norm. I anticipate that it probably is not the norm to obtain employees consent before signing Team Cleaning. I have in the back of my mind a thought that there are some places and I'm thinking maybe New York that required Team Cleaning for the safety of housekeepers, and I don't know the impact of that and what studies have been done to see if there are reduced instances of reports of sexual harassment a New York, I believe so Next one. Yes. I'm just going to jump in real quick to point out that on page five of the bill and it's a 11955 for section 14 27050 covers the room cleaning work load limits and also described as I'll give you a moment to fit so I can get on page 5 roughly in the middle of the page if it describes what arena was just talking about that an employee must opt out that's already has an ability to opt out of Team Cleaning. I bet there is a provision at the beginning of the last sentence in the first paragraph that says except when required for employee safety or by law. That's the exception an employee may only be assigned won't answer an employer may only assign multiple employees to perform a room cleaning together. If the employees have agreed to perform cleaning with other employees presented pursuant to the rules that will be issued by the director and I just wanted to point out that that goes to the point that you were just mentioned council member that there is some question about how one determines when it's required for for safety and and I goes to I guess the very heart of the question about whether Team Cleaning does promote safety. I don't know how to independently evaluate that but wanted to just point that out. Then we have various iterations of the printouts appear. So can you say the section again? It's 14270 500 the title is room cleaning work load limits. That's paragraph a of that section. And I was referring to the last sentence in that paragraph. What is the purpose of that Clause if we don't If we don't know when it would be required for safety or by law. What is the purpose of of those words being included from the perspective? I believe that this was ported over from the initiative. I think this is no it was not I was working correct there. Janine ever you'd like to take a look. You sent that I can Venture a response. I think the bylaws probably the easiest to explain which is if for instance the Washington industrial health and safety act requires an employer to prevent to do certain things to ensure the safety of an employee under those laws. We want to make sure that there's no conflict between ours and theirs with respect to the when safety or when safety is implicated be added that because we have heard from folks over time that they do assign in teens for safety purposes for instance at night when there are less staff in the building. I'm so wanting to acknowledge that that is a situation and that we don't want to necessarily put them in a worse off place in terms of safety to dance point that probably requires more conversation about what we mean by that either through rulemaking or further further conversation here and information and also background from other Sources unit other cities or states matters definitely, but I was also wondering if you like your and the inside if they have inside from their members about whether it does make a difference to them when they are assigned him cleaning shift vs. Individual shift, even the feeling or the perception of the confidence of that. There's a special night time. Obviously, it's of more relevant or just in general it would help to have some cuz it's hard for us to speculate, but it actually work experience would help us, even if it's anecdotal evidence. I think it would be helpful, and then that's a great point Thank You customers want and just for the viewing Public's knowledge. We did have the schedule till 1:30. I think why we know that we are probably going to go beyond that in case supposed to have to leave. I totally understand how I thank you. Bye but in case you do have to leave I understand and sorry that we didn't have more time planning, but I'm planning to stay. Tell him to the folks are able to that works for you. Okay, we're hoping for today and we'll just go ahead and continue will go ahead and turn that clock off that was more for my knowledge to know how much time we had but if folks are okay. I know everybody has a tight schedule we're going to go and continue on for the next half hour. So we still have a lot of ground to cover in the next half hour or so. I'll try to be quick about the remainder of this particular law. So under the initiative hotels were required to pay employees more when they exceeded that 5,000 square footage of cleaning. And so that continues with this proposed law. It's subbing the term regular rate of pay with normal hourly rate of pay which is going to make it easier for workers to understand and for employers to calculate it's not circular like the regular rate of pay is and then There are some exceptions to that payment that I believe we're in the rules and that now are codified into this law. So that's already been subject to notice and comment. Among employers. So I thought I think we can move on to access to Medical Care. Don't think that's me. Hey. All right, so just begins on page 8 of The Matrix that again is attachment a to the staff memo. The employer coverage that were talking about access to Medical Care Health insurance or equivalent payments for employees. The employer coverage is functionally the same as it was in the initiative this applies to large hotels as defined by a hotel with 100 or more rooms and ancillary businesses with a physical presence in the hotel. The change is in this employee coverage is that we have introduced an exemption for ancillary businesses that have fewer than 50 employees worldwide. The next item employee coverage is labor standards, especially here in Seattle. So 50 employees worldwide. Where do we use that in other locations? So for paid sick and safe time, it has three different sizes of employers. It's based on full-time equivalents rather than employees. It is the only ordinance that is based on full-time equivalents, but it has a thresholds of up to 50 ft. He's up to 250 ft he's and then more than 250 ft he's and then our secure scheduling law and our minimum wage law has thresholds of large employers 500-plus worldwide employees. And then under that is a small employer for minimum wage are commuter benefits law has a threshold of 20 employees worldwide. The commuter benefits log. That's the law that requires employers to provide pre-tax commuting benefits to their stuff out of our laws. I'm guessing that's thinking that's for that have an employee threshold requirement. Okay. The other change under the one change on your employee coverage. I wanted to call you or attention to is that the initiative applied only to low-wage employees in the hotel industry I know is defined as those who whose households have an income that is 400% or below of the last of the poverty line the bill that is before you would change that to remove the requirement for low-wage employees and it would therefore apply to all of them otherwise covered employees who work in large hotels or covered ancillary businesses. Mysterio questions, I'm going to move on. the I'm going to describe the initiative first. This has to do with what kind of pay is required to employees by their by their employer on the initiative had an approach that was specific to the circumstances of each individual employee and it had a calculation for what kind of affordable level of insurance the employer needed to pay to each employee that was based on the type of household income basically said that the employer have to provide a gold level plan and that the cost to the employee could be no more than 5% of the employees monthly pay. In recognition of some of the reaction and testimony that employers offered at the time that the initiative passed that this isn't a burdensome means to calculate for each different employee their specific circumstances where they were a smoker with a what age they were the addition to a variety of other circumstances the Bills take a different Tack and they try to establish a composite dollar amount that is now called a required Healthcare expenditure that an employer a covered employer has to pay to each covered employee on a monthly basis. That dollar amount ranges from $560 per month for an individual employee again, no matter what their age and no matter whether there is smoke or other kind of particulars that would affect their ability to get health insurance at different dollar amounts and ranges from $560 for an individual who doesn't have a spouse or domestic partner and doesn't have dependent children to $1,680 for an employee who has both a domestic partner or spouse and dependent children and there are four four categories. I've mentioned that the bottom and the top tiers. Those are those dollar Figures were arrived at by doing an Actuarial analysis of the the individual health plans that are the Private health plans that are available to individuals and their household is The the name right at the Gold level plan that are available on in King County on the Washington State Health Benefit exchange. So that's that that's the price of health insurance to people who are going themselves to go go by the health insurance an employer can meet the required Healthcare expenditure for each month either highly an extra pay to the employee. or providing health insurance that meet gold level equivalent standard or all and health insurance and it doesn't have to meet the gold standard me any kind of health insurance, but the amount has to if I can only be in health insurance that has to be an amount that exceeds or meets the required Healthcare expenditure or they can provide health insurance and then top off to meet the balance in extra pay so they can do a combination of health insurance and extra pay I know that's a lot of information is and other any questions that I'm going to continue to do some research on two components that really stood out one is we really want to make sure that the workers in the hotel industry have high quality health insurance. Will we heard from some of the workers today? And then previous meetings is the amount of injuries that are sustaining one person did they talked about their shoulder others have talked about their backs at 1 meeting. We went to we heard about one worker one workers who had two miscarriages in a very short. Of time do the string come out of work, which we are addressing through the workplace requirements. But also access to quality affordable health care is is critical for addressing and preventing some of those into injuries. So I wanted to be high quality the big the big area of concern that I had was that they're potentially was a disincentive from some of these workers to take the health care under the previous initiative because Is the cash option and we have seen in other Industries under the Affordable Care Act some unscrupulous employers basically waving the dollar amount in front of the low-wage workers versus Healthcare. We want workers have health care. And so my desire here is to strike the right balance between incentivizing creating and requiring a high quality Healthcare and getting away from the disincentive of the cash. That's that's a really important balance to strike. I'll also say and this should go without saying but I'm going to say it. Anyway, we wouldn't be in this situation had we had universal healthcare employers wouldn't be in the situation of constantly. I'm trying to figure out how to pay for the healthcare and workers especially those who are union workers wouldn't be in the position of constantly having to put Healthcare on the bargaining table and trade that away for wages. Have we had numerous a healthcare? So I'm hoping that you know, this continues to underscore that commonality there for why we need Medicare for all at universal healthcare single-payer. And in the meantime I'm not quite sure that we have gotten that right formula yet. I'll just signal for myself as you were explaining it and as I was reading it again, it does individual spoke this morning that actually there is a difference between the individual market and the large group market and in sort of hearing the explanation. I think we need to go back and double-check on cost for individual Market vs. Large group of very real distinction between what the cost is in and as we were thinking about this language and the four categories, I didn't think about that some music not acknowledge that this is an area that I'm interested in continuing to explore other policy Solutions are policy solutions that meet those goals but not compromising on the high quality Healthcare the accessibility and they affordability of it and making sure that there's not even an unnecessarily or unintentional disincentive to take the health care. Yeah, I would I would only add to that that I think your record your verbalization of the realities of our health insurance Market is an acknowledgement of the fact that we recognize that it is expensive both on the patient side of equation and certainly purchasing the product side of the equation. And so I think one of your just to be really clear, I think one of the other policy priorities that we have a need to address is to also recognize that we don't want to create an undue burden in terms of cost on employers who actually want to provide Health Care coverage. And so we had some conversations around. Is there an opportunity for us to continue to have policy conversations around where we set that limit and what were they? Generate unintended consequences in terms of the ultimate policy priority which is to make sure that we're providing this segment of workers access to high-quality affordable accessible health care, which is which is really at the core of it all made white. Also, we should be having a fit because it's possible to do it and Newman California was attempting to do that. And I think that that it should be an actual topic of conversation and I totally agree that should be connected to all of this and also in terms of the what the legislation weather in the language of the village so far to the rulemaking either way what it says about the health-care. I was wondering also have done could just go through that a little bit because it was like I couldn't quite catch. What it would say and also if we can and I think we all agree you're at the table that also keeping in mind that many of the workers were talking about she or are and guard me if I'm wrong but there are employed by large employers who I think compared to very smart employers are able to afford decent do babies and healthcare workers fighting keeping that in the mix as well. In order to come at come to the board meeting is the appropriate measure of health care for the workers. That would be mandated by the legislation through its to the Bell or through the rulemaking. I think that keeping that in mind is also important through the first time I'll probably fall through the second time. I think you said the insurance would not require to be gold level. That's where I required Healthcare expenditure amount is keyed off of how much a gold level plan would cost on the exchange recognizing that employers are not buying their health insurance on the exchange. We still needed a tie to some kind of a benchmark. Are we tied to for composite rates for a gold Level Health Plan on the individual Exchange in King County for people who are seeking Health Care in Kane County again at the Gold level and it depends on whether they are an individual. It was stay or an individual who has no dependents, but does have a spouse or domestic partner or has only children but not a domestic partner or has both. So those are the four different categories and they range from about $560 for an individual dollars are $952 for an individual plus a spouse $1,120 for an individual + S. + a + dependent children were 1684 employee who has both categories. I'm so that's the that's the dollar amount that the employer is required to spend. Deep wave of the employer response is the employer's choice. They can either provide entirely extra pay cash to the employee or they can provide some kind of healthcare and they can take her they can buy their own health care at and it can be bronze. It could be cold. It could be I don't know. The other choices are with silver or they can pay a combination so that they can pay some of their required dollar amount that I talked about 562-1680 in extra pay and some in some form of health insurance set up to the employer. And then the chair was describing their then opportunities for the employer to opt out and say I don't I don't really want that kind of insurance and there are different Provisions for what happened in that circumstance. But only if it's equal or better insurance if it's already have opted out of the entire Bill if they already have a gold equivalent plan themselves, and then there are other Provisions for what happens if the type of insurance that the employer offered one of the options they have for meeting that are required monthly expenditure level if it is deemed to be unaffordable to the employee and that is a calculation which is provided in the ordinance. So just checked on this. This is a very important distinction between individual Market vs. Large fruit market in when we talk about the gold standard for the individual mark We're really talking about an 80% Actuarial value. Right? So I do think that this is an area for us to do additional research. When we look at the large group markets plans that are currently offered for example in King County. There should be a way for us to do an analysis of which of the plans are being offered in the large group employer coverage are meeting that at 80% actually about you and we use these and coding in a metallic tier names over and over but but intent is to make sure that it is reaching that actual value many of our large employers for example prior to the ACA. They were offering health coverage at 90% Extra Value Inn on the unintended consequence was that for example in some of the grocery industry as we heard of examples where people were going into the bargaining table throwing down pictures of President Obama and saying was it was an actual value was good enough for your president, then that's what we can offer. Now that was the unintended consequence but large group employers actually have the benefit of pulling together more workers more employees. And a larger group is good for raised that will decrease red is also part of the premise behind medicare-for-all has asked me to do work on the individual who was actually who came and spoke and some of the folks who've been calling us in the last few days who have brought this issue up. There is a real I think analysis that we should be able to do around large Fruit markets with the with the equivalent percent actual value in the large Meat Market in our region. That's more than gold versus things the dollar amount per say so your folks in full transparency. This is an area will continue to do some more work to reach that better quality threshold. Unintentionally, we don't end up allowing the employer's to to the hotel industry to do the more specific. We are about the language within the language setting in the better for the workers. I think that's right. And I also don't want to have a number that was based on a separate Market that is maybe not in comparison Apples to Apples to what it actually cost to provide health coverage at that hire quality 80% Extra Value than is currently being offered in large real possibility for the coverage to be provided and and so everything that we can do to generate that. That would be great. I haven't eaten in the public testimony even I didn't hear anyone say carte blanche. I don't want to provide my workers health care. What I'm hearing employer say is nervous that it's that the cost is going to be sober. That I won't be able to do that. And so I think there's a way for us to sort of do the analysis as suggested by our subject matter expert chair Mesquita and to serve how do we create that password to make sure that it is going to be ultimately fulfill what I think the policy goal is here, which is making sure that the workers actually have access to this. I'm coverage I come from a verbal. Thank you. I just want to make note. I I mentioned this yesterday when I received a briefing from Central staff, but for our other committee members purposes, I am a little bit concerned about the way the the create a disincentive for an employer to offer cash the way it's structured. I could see a scenario in which somebody an employee is the the result is that they have to pay. For a plan that they can't afford because of that 20% Mark that see that 20% out-of-pocket be an awful lot of money to somebody's monthly income. So I'm Diane. I have an interested in looking at that number. Does it help to provide clarification getting that point? Okay. Do you want to do that? Would you like me to understanding herbal to be discussing is an option or situation where a hotel is not required to make this monthly Healthcare expenditure and that can happen if the employer offers a health insurance plan. And if the plan is Dan was saying it has an affordable premium than the ordinances saying if the employee says I don't want that plan and I don't want to pay that affordable premium. Then the employees opting out of everything the employers is that the employee is giving up their rights to get the cash instead. And so this opt-out is it then incentivizing employees to say yes to the health insurance. But what cast member herrbold is questioning is why is the employee's contribution set at 20% of the monthly Healthcare expenditure rate for a single employee. So what the way it's it is now the for a single employee to employer has to pay $560 a month at least 20% of that is $112. So as long as the premium is $112 and the healthcare insurance plan is meats that 560 Mark than the employee has to say yes or forfeit the right to the cash. So what I'm hearing you question is how did we buy 20% Why not a different amount that I guess you're thinking that we should be lower answer that I would also offer is the actual value of a gold plan is 80% 80% paid for by the employer and through the plan 20% picked up by the patient or the consumer sale in the ideal world. It would be more like a 90 95% actual value, which is a Platinum Plus plan, but at 80% is basically employer with the insurer will pay for and then you as a consumer pays the other 20% and out-of-pocket expenses premiums deductible is excetera still sort of where that never comes from. I'm sure you though because I think it's less about the actual value amount and the more on the impact on the end of Night and the percentage of income. Couldn't charge him of a hotel worker. I think we should take into consideration in before the ACA was you know, not that it was as robust as people believe it was in the beginning cuz it was already a compromise before that was even got it used to be that you could not offer a health plan that was more than 9.5% of the individual's income that that was deemed unaffordable. And so then the employer would get dinged on that know some of this has changed but I hear your point and let's continue to look at it. I'm especially as it impacts the individual worker so we have about 10 more minutes. I'm always happy to continue to extend but can you tell us a little bit more about what's left to cover here are the one remaining Bill to cover and I think it'll go pretty I can cover pretty quickly and answer any questions. As we go forward, okay, so page 10 of the Matrix covers the hotel employees job retention bill. Both the employer coverage and the employee coverage are largely the same in the bill compared to the initiative initiative 124. There is one the change that I call your attention it similar to the discussion for the previous Bill. There is an exemption for small businesses from from the bill if they are ancillary Hotel businesses that have 20 employees worldwide or fewer. 20/20 yeah, that's different than the in the healthcare one. It was it was 50 in this bill. It is 20. All of the other Provisions are substantially the same as in the initiative a hotel for an outgoing employer that changes hands and there's a new owner. Must provide a prevent preferential hiring list to the incoming employer that the new owner of the business. There's no change there. And the incoming employer my tire from the preferential hiring list for. Of 180 days if the employer accept a job offer the employee much with helium for you for no less than 90 days and can discharge the employee for Just Cause during this time. I think there's no other substantial changes. That's the end of our review of the four pieces of legislation. It's just us laugh. So there are no questions or overarching comments. Customer Gonzalez before I leave so to wrap us up anything from you sure I would just again thank you wording through this conversation before on this conversation a new committee schedules are all really busy. So thank you. I thought today was a really good conversation. And this is I think exactly what we wanted to see happen is begin the public facing process of in a really discussing and debating some of the remaining policy issues and some of the policy choices E-40, you know, he's been having six months worth of back room conversation that included hotel workers, but also internal stakeholders from mayor's office to LS to the attorney's office to our office staff. I mean it kind of goes on and so I think to me It's really important that make sure that were having these conversations in an open setting like this and that we can we we have sort of an opportunity here from abroad or set of group groups and stakeholders Shepherd this work through and I hope folks that are in the audience heard both of us signal that we understand that there are more deeper policy analysis conversations and exercises that need to be completed in order for us to get this over the finish line to the next 6 weeks 5 to 6 weeks and and you know, we're both very willing, of course to continue to engage in those conversations and those conversations will be first and foremost. I think Guided by the ultimate policy goals and values that we have articulated multiple times at the table and then the press conference before we came in here today. So looking forward to those conversations and next steps. Absolutely and thanks to all of your you I mean you guys you all have been so amazing and working with really really hard on this as how I have that Brianna Thomas in my office and say it'll freak in your office. So huge shout out to all of you who have been really rolling up your sleeves and spending countless hours. I understand that you have all met together at least 22 times in the last six months and it's probably lowball number so really appreciate all the time you all are spending together on this issue. I'm absolutely so I wanted to first. Thank you cousin arbert Gonzalez and your team led by Brian Thomas for all of your work on this stage of free fire chief of staff and lead on labor has spent endless hours on this with you. Also. Thank you so much to your team and to the FAFSA my team as well, especially sejal. I did just want to give you additional things. So things to Dan Peter deputy director of central staff janae's and policy manager of the office of labor standards. Thank you guys for being here at the table. And for your first day and walking us through this document are we did see Adrian? Hi, Adrian or still here is Ryan Thompson, Kyla Blair Sabrina from the mayor's office. Thanks to your team as well for your son in this policy issue area, and also the entire city attorney's office. I understand that the entire office at some point has actually been engaged with art. It's on the legality and the various questions that we brought forward to think so much good job, as well as helping to be at previous meetings talked about the rollout of this legislation. So thank star Communications team and external stakeholders that we heard from today. Thank you Unite Here Local 8 by the hospitality Association ACLU, Washington r e y OneAmerica Puget Sound Sage the Martin Luther King County labor Council, there will be more things coming up but you know everybody who sticker stuck around for a full two hours early preciate it and want to underscore what you've heard from us today. We will be again discussing this on July 11th, and then July 18th on with the possibility of another meeting if we need to, but I think we're where were some of the issues that we're hearing are overlapping nicely and will continue to do some research with all of you. Just a reminder. We do have a public hearing that will be just focus on Public hearing and we'll have these materials available will have staff on hand in case I aren't for my team in case there are questions. But really this is a chance for us to hear directly from the community involved and want to hear your thoughts. If you do need childcare, please let us know Ashley. Harrison at seattle.gov can provide us with childcare that will be free. We also will offer discounted parking and at Sea Park, which is on 5th and James for $5 beginning at 4:30. And so let us know if you do, you need to park. We're happy to get you that just kind of parking that is a special Committee hearing just to make sure that there's folks who can come in the evening as you heard from the hotel workers. I'm in I'm sure for the managers as well or very busy during the day. We want to make time in the afternoon in the evening to have that conversation translation available to me. I'm in real time. And then just for the good of the order of the next regularly-scheduled housing Health Energy workers rights committee was on July 4th my birthday but we are not due to the holiday America's way of celebrating me has fireworks birthday. I did used to think those are all for me. That was a sad day when I wouldn't I wouldn't say that they aren't we will have a few items on the agenda including the hotel worker industry standards legislation in discussion of possible issue identification is our way of talking about possible amendments to come there will not be a final vote that day. Just want to underscore that for anyone who was concerned about that. But in addition to that will have the domestic or a standard board appointments domestic workers standard for the update and roll making an office of Labor. Senators race and social justice initiative possible vote on the provider wage inflation that inflation adjustment and legislation and the notice of intent to sell ordinance that sounds like a full day's worth of activities. So what we will try to make sure that everything is timed well, and if we need to adjust other items we will do so with that so, you know their comments. Thank you for incredible Works walking through this presentation and we're getting me out 2 minutes early according to my new time. Thank you everybody for being here really appreciate it and we'll see you on Tuesday night at 5:30.", "end_time": 7013.6}]}