{"format": "raw", "annotations": [], "confidence": 0.951440189511348, "data": [{"start_time": 0, "text": "Good afternoon. Today is Thursday April 18th. 2018. It is 2:03 p.m. This is a special meeting of the gender Equity committee. I'm counting my blood and I went out as chair of this committee and join me at the table at this afternoon as my colleague has emerged that has a mascara. Thank you for being here comes on. Today's agenda first. We will consider a vote on six appointments and one reappointment to the community police commission consideration of these appointments Jen's one is a partnership agreement with Seattle public schools. And the other is a partnership agreement with Seattle colleges and then discuss the 2018 families education preschool and promise Levy implementation and evaluation plan for the third and final time concluding with what I hope will be a vote on a package of amendments and a vote on the floor lamp. Station plan for a final consideration by the full Council on Monday April 22nd at 2 p.m. Before we can hold our regular comment. I will call out each individual's and name and the order that they signed up each individual is asked to begin their public comment by reminding us of their name and by speaking to an item on the agenda for today. Each speaker has up to two minutes to provide us public comment after the two minutes. I'll ask you to wrap up and your microphone. I will be turned off. So we will go ahead and proceed the first person that signed up for public, today is Melissa Westbrook followed by Sandra Taylor. My name is Melissa Westbrook and I write the most widely read public education blog and Washington State. I have some questions about the mayor's implementation plan for the family's Levi. If a charger is not part of a group. It is its own District why then is only Seattle schools required to have a sign partnership agreement in order for their high school graduates to have access to the promised funds Charter Schools. Do not that is on page 103 number to why is all the mention of serving homeless students centered around Seattle public schools that is part of charter schools responsibilities as well. Also, I assume this plan is fairly recent but I note on page 72 it says Seattle School Source 2000 homeless students. It's more like 3,000 number 3 on the previous point. I do want to know that when you're measuring outcomes. It is important to remember that Charter School can limit the number of students in their schools. They can control who comes in and they can exit students if they do not want to serve them. It's easier to have better outcomes when you can control your student body regular Public Schools cannot Despite the frequent use of the phrase Charter Schools. It is not defined in the glossary in the charter law passed. It was voted down in Seattle by a wide. Margin Charter law does not require you to include Charter Schools. You were doing this as a the mayor is doing this as a purely political move campaign. I asked if we have access to these K-12 and I was told we're waiting for an opinion from the city attorney after it passed. I asked the city attorney's office. They said there is no legal opinion. So clearly there was no legal opinion to be waited on at all. During the campaign. I called everyone's office and I got a variety of mostly walking answers about your support of Charter two schools face-to-face. Both of you tell me you did not support them. If you off on your support for charter schools in this plan, it will not serve you well Cory Booker and that the Aurora car going to find this out in their presidential campaigns how much charter schools are not part of a progressive agenda and if you aspire to how your office I suggest you consider that as well, thank you. Thank you. Next person is Sandra Taylor followed by David Haynes. Hi, my name is Sandra Taylor and I am the Seattle preschool coordinator of a child care resources and I just want to speak quickly to a few points first. It's important to point out the uniqueness of the family child care model FCC providers cultivate and maintain much deeper relationships with both the children in their care and their families largely due to the intimacy, but in home environment with fewer children, this deeper understanding of children's needs and family situations combined with a nibble Nets of a smaller program impact how a provider customized has her teaching caregiving and parent involvement. These two unique strengths definitely contribute to the positive outcomes. The pilot participants experienced. It was it was easy for all six of the providers in our Hub just passed two years to identify differences there programs prior to FTP pilot compared to their games today for significant improvements to all of their programs include one evidence-based curriculum to guide daily learning activities to assessment tools to better track children's development and progress towards Milestones access to third-party health screening that identify learning barriers such as Vision impairments or developmental delays that need medical intervention for biannual observation visit from the u-dub assessment team to track the outcomes of the tools and just from a personal testimony of one of our homeless families. I think that's where one of our biggest impacts have been we had a case where young mother was homeless. She did Couchsurfing was with parents for a while. Now. She's at a shelter. Unfortunately. She was out of the city of Seattle, but we found out we can still get her in she was extremely ecstatic for that reason. So I just wanted to applaud this program is a great Pro. And I look forward to what will happen in the coming years and Cassandra. Thank you. Remember that Seattle legalized proper growing marijuana exempting crack meth and heroin pushers undermines the family Levi Levi Investments of destroying innocent. So pleased with this community police commission. Let's keep a sober mind. In fact that you know, there's some rage and hate that we should not be exempting low-level drug pushers who are destroying other people's lives and that there's a court case that was thrown out last Friday after 20 months basically denying innocent person's rights and the police. I've been taking payoffs from the bartenders in overtime payments in Belltown, and they're literally lying on police reports and causing innocent people to be jailed and screwed with for 20 months. And so you know, how It'll be a great surge of accountability on all levels of governance starting with one of the most important this committee the guarantees that the police will be kept honest in their efforts to guarantee that justice will prevail. Good luck. Thank you. We have signed up on the sign up sheet. Is there anyone who's with us today? They didn't get a chance to sign up but would like to offer US public testimony. Can't say no and I'm going to close out the public comment period and we are going to go ahead and begin the items of business on today's agenda. So if you are here for appointment or reappointment to the community police commission, I'm going to ask that you make your way to the table and well that is happening all have Roxanna Reid the let's see it in the items one through seven into the record appointment appointments 1294 through 1300 appointments of Natasha Moore Mark Mullens and Alanis Auntie on as member is Seattle Community police commission for a term to December 31st, 2019 and appointments of Brandy Grant Esther Lucero and karisa morikawa. As member is Seattle police commission Seattle Community police commission for a term to December 31st, 2021 and reappointment of Joseph. As member Seattle Community police commission for a term to December 31st 2019 for briefing discussion and possible. Great. Thank you Roxana. Okay, so I think we've got everybody. All right, so a quick round of introductions just your first and last name and then I will hand it over to Cody who will pick us off and then Cody after you will be definitely brightness on Great American Solace inches of Cu police commission officer Mark Mullens in Seattle Police Department. Natasha Moore Brandy Grant karisa morikawa Alina son TN great. Okay. So just when you speak into the microphone, you got to make sure you have it really close to you and a green light on the stem has to be on if you want to say something. They are very sensitive microphone since you get them cuz she is so just keep in mind that it is always a hot is that green light is on my staff likes to remind me of that on occasion and all right. So among the seven appointments three-pointers. We have the table four of them are being made by kung's Burgers Austin to Seattle City council and get introduced those poor nominees, but I want to quickly acknowledged before that the gaps in Cedar Park completed by CPC in February 2018. It was a guy to some of their representative apps that were not represented on the board and it was really helpful for us in doing work. And selection of ignominy. So thank you for that. So among house members, Gonzales nominees. We have Brandy Grant of Brandy is currently the program manager at the alliance for gun responsibility Foundation there. She works to build a network of Advocates and allies to help promote education awareness and Recovery Services for DV survivors. Brandy has 20 plus years of Kimmy work in organizing mental health and program management friend to earn her bachelor's degree at the University of Tulsa and her master's degree at the University of Oklahoma. Natasha Moore works as a program manager with choose 180 a restorative justice organization Natasha. Also previously worked for the YMCA of Greater Seattle in multiple roles including as an Outreach worker Natasha's a board member of the Beacon Hill Hub and is currently enrolled at Seattle Central Community College. Chris Moore, also works at choose 180 as a cedar Navigator there she supports Youth and their families when facing a felony charge previously. She worked as a case manager for ccyha slink intervention team while being employed by the YMCA Young Adult Services are in her bachelor's degree in social work at the University of Washington, Seattle. Our Lady of Alina Santillan in the new role as the Director of racial equity for saddles in our cohort support in Seattle Center organizations to strengthen the racial Equity strategies and practices previously Lena worked at kexp 90.3 FM and several roles including has Community engagement Manager degree from University of Southern, Mississippi Right and we'll get to a point where you opal get to identify yourself from getting there right now about the mayor's office nominations. It is my great pleasure on behalf of your Durkin to to nominate Esther Lucero for for the to the community police commission Esther as many of you know, is the chief executive officer of the Seattle Indian Health Board in the International District Seattle Indian Health Board is a community pillar helping to support our native neighbors and they have a big Operator Treatment Center Thunderbird Treatment Center is 65 bad residential treatment program in Rainier Beach. They also a host the urban Indian Health Institute one of twelve tribal epidemiology centers in the nation as results of the co-chair of the Hill. You're here governing board and is proud to be a delegate for the American Indian Health commission. Great, and now we will hear from executive director Lopez. Good afternoon. Am really excited. We are all really excited. So we are we welcome them with open arms. The CDC has seven positions to those positions are reserved for Seattle law enforcement Union Representatives one from the Seattle police officers Guild and one from the Seattle police management association. And today I'm officer Mullens officer Mark Mullens will be feeling. Spock Seattle police officer killed the position. That was formerly Kevin Stuckey's officer. Kevin Stuckey's Farm position officer Mullens was born and raised in Dayton, Ohio and received his political science degree from Central State University afternoon. And then for Microsoft in Redmond even officer and I went SPD in 1990. He's worked in South Precinct for 29 years where he spent several years on the anti-crime team. Was one of the original mountain bike Patrol officers where he's told me back then they didn't really put those bikes together for them. I just kind of got on a bike and rolled and then as a community police police officer in the last position, he has worked closely with those Central data processor and the community at that Central Housing program as well as other community groups in 2015. His car was selected to not answer it 9-1-1 calls cuz he's on patrol but to instead right around in the community to engage with residents with you. So he is actually a patrol that doesn't he actually talks the folks and engages and makes relationships. He was voted officer of the year for South Precinct in 2017 Lobster Mullens also currently serves as a shop steward for spa. He believes in the power of diversity and believes. He can Aid in restoring Community faith in the police. Fishes for bed bath on his boat weather permitting. I'm also also here with us today is actually here for reappointment. He is the director of youth services at New Horizons. He's also our new was chair of our community engagement committee and has done quite a bit of work. He has recently went with her. I can't Asian of s p d Seattle Police Department and and CPC folks who went to Denver to go do a site visit on the kids and cops program and does quite a bit of Youth Development work. He's also aboard co-chair for Utopia denied the territories of Pacific Islanders Alliance, which is a queer trans add queer and trans people of color LED Grassroots organization at the next committee meeting Reverend Harry at Walden will be a reappointment and we can introduce her at that a tough time. Great. Thank you. And I'm just here to lie. Welcome all the I knew live pointy side too as a coach here to the Seattle police commission and we're really excited to have new people coming on and I and end that's I just want to give you a big welcome in this a thank you for saying yes. Yes. It's so important in today's world. And you said yes, so thank you for that. Thank you very well then. Okay, so why don't we start where we ended with the community police commission nominations and one appointment when reappointment so I'm assuming that because Joseph is here you all continue to be happy with his work and want him to continue to do side work. Chair the position size us a little bit about your experience thus far on the community police commission where you think the community police commission is headed or needs to head and how you hope to be able to facilitate that through your appointment has been an honor to be part of the CPC in the past year as part of the community engagement team. I've seen that work being led by Roxana CPC grow in so many ways and just grown accountability with our partners and in ways that is not always reactive. But how do we continue to to strengthen those Taissa with meaning of profits and also with other systems partner, so I'm looking forward to serving again for another year. Great, excellent. Any other questions customers get it for Joseph in particular? Thank you so much. We have the chance to visit Southwest doing community or that they really excited about the work you do. Can you talk a little bit about yourself? And what does nobility mean then look like to you a question. So I used to work there at Southwest you can tell me Services San Antonio institutional racism in our collaborative with 16 youth home serving homeless youth homeless serving organizations and concerns is have interactions. I have that we have with police and shelter services and emergency emergency services what their young people are young people often the most institutionalized? The ones that are picked up and are very much involved and so our work we want to bring some of those challenges that happens right there at the front lines of we're above the youth homelessness World meets the police in the world. And what is it? What is it that we can offer that can improve and how can we listen to each life? Some of those improvements part of that is how to increase trauma-informed care and all of the points that young people are are kind of intersecting with right and it's a lot of City dollars $50 Kona police or city dollars going through our agencies and their pain points in where the city dollars kind of meat, right? And so how do we on the ground? I'll give that's inside back to these systems. So they are able to serve our young people mostly young people of color mostly young young queer. Lgbtqia young people indigenous young people. That are suffering right now. So Thank you any other questions or comments? Okay reverse order since you were reappointment, I'm going to go ahead and move for your reappointment bursts and I'll move it for the approval of the reappointment of Joseph seia as member Community police commission for a tournament December 31st, 2021. Otherwise known as appointment 01300 seconds any further discussion. And you posed there's nobody else to opposed his habit. And your reappointment will be considered on Monday April 22nd at our full council meeting at 2 p.m. You are always welcome to join us and Chambers, but you are not required to do I have to move it has been the rules 29th, April 29th. Keep me honest. Okay, so it was April twenty-ninth. All right. So let's move on at 2 officer Mullens. We already heard a little bit of an introduction for officer Mullens from executive director Lopez and Austin was just wanted to give you a chance to share with us why you are interested in serving the community police commission and what you hope to be able to bring to the conversation. It's a very simple. I've always believed that the police and the community should be one seamless when I worked in community policing. I I learned that even more I had to come out of control and started to work with the community police team and I worked Beacon Hill I was to Beacon Hill officer. And I would I attempted to do was to empower people to basically police themselves in that they were having problems with a lot of things in the area mainly some problems with homelessness some problems with the people in the Greenbelt that were causing them problems and a few apartment complexes that happened to be a little bit out of control. So basically I said this is your house. This is your community. This is your area where we are going to take control of not I I'm not going to die. I can't be there all the time. I can't I can't see all the things that you see so you've got to help me. So basically in that I was able to form a union in which we could work with the landlords in the area work on programs to help the people in the Greenbelt so that we could calm down some of the effects of some of the things that we're going on in the area and it it worked pretty well. So I've learned early in my career that the police can't do their job without the community and I've also learned that the community needs to be informed about the things that police do some tactics that we use. The community doesn't understand sometimes what happens sometimes police will come and take someone away and and and people will be standing there going what what just happened. Why did they just yank that guy off the street? There has to be someone that lingers by behind to say, is there any questions you guys might have about what just happened? Cuz sometimes we don't have time to explain that's only one aspect of the reason why I want to be in this commission is I want to help to bridge that gap of understanding if you just talk to people about what we do sometimes that clears up a lot of things that clears up a lot of situations that doesn't have to be a problem between policing and in the community and we got some work to do. We we understand that and and I'm going to help with that. But understanding being here to be able to explain some of the things that we do some of the tactics that we use might help bridge that gap between police and and and the community so I'm excited information from the the non-sworn members of the commission back to the police department to share what you're hearing from directly from community in this phase. How do you think that that bridge gets built in the other direction and I attend a lot of meetings. So I would be able to communicate with a lot of my fellow officers and In South Precinct. I also have the various ways and various meetings in which I meet with a lot of my officers to be able to get information out to them. So I believe I can start that way great. Thank you. Thank you. Thanks so much for the overview of the work that you've done. I also know that the nomination came from Walden and I wanted to talk a little bit about your work with the mothers for police accountability and your ongoing efforts around these collaborations and how you said that inform your work today. I know Reverend Benjamin Reverend Harris poem from various Community meetings that I've been to over the many years, but I haven't really worked with her organization. I've been very aware of them. I've been very aware of her of her organization and her And her presence and end a lot of times maybe sometimes we don't see eye-to-eye, but I love her dearly and and I always thought that she was a great part of the community. Any other questions, okay there being no further questions. I will go ahead and move for this appointment as well, which is an appointment has been Advanced by the community police commission said his appointment 01298. I will move appointment 01298 the appointment of Mark Mullens as member Community police commission for a term December 31st 2019 second. I was in favor. Say aye aye eyes have it. This will also be considered at full Council Monday April 29th, 2018 at 2 p.m. Again, you are not required to attend, but you are welcome to attend if if you wish to do so over to the mayor office mayor's nama nama, sorry nomination for Community police commission. So we already heard a little bit about You can talk to his little bit more about your interest in serving on the community police commission and what you hope to be able to accomplish sure. He just say that it's an incredible privileged to have Americans confidence in my nomination today. And is it with two women that I didn't respect so much. So thanks for having me as we begin to think about maybe thinking about Atmore Community Police models that Health Care is going to be a tremendous value when we have these discussions and really thinking about how we can address the needs of our community holistically with the police department being only one component. So I think the fact that we operate a 65 bed residential treatment program and the fact that we have run and epidemiology Center we can do a couple of things one is to really support the needs around addiction and addressing those challenges and then also thinking about more Community guided data collection and about Malaysian efforts that can be really beneficial. I also think that the integrated model that we've developed at the Seattle Indian Health Board is called indigenous knowledge than form systems of care is really a spin-off of trauma-informed systems of care because we recognize that we have as many strengths as we do challenges. And so I think that we are the city really didn't need to think about the strength that our community already has and build upon the strength so that we can come together to create change its great battle with what does accountability look like to you. And how do you define that? What does it mean for you? And also as a den a woman who are Lenny I just carry it through our moms and a grandmother since I'm accountable there and as a CEO for a federal Call Zion Hill Central Reserve all people and that means that we serve all people in the native way. So our patient populations typically stays between 65 and 70% American Indians last Natives and we are now seeing increases in the number of African-American folks were serving. I'm very proud of that. And I think all of that is changing and transforming because of the trust that we've invested in building in the last I've been here almost four years now. I think I have a unique position in the fact that I hold quarterly Community discussions where everybody is welcome in my intention is to bring the information that comes from this commission out into the community and listen to them and bring their voices back. And so that's what accountability means to me. That's wonderful. I really appreciate all the work that you have been doing in our broader Collective Community. I don't mean to restrict that just to City Limits but I but I think that this particular perspective around the intersection between people experiencing homelessness and folks who struggle everyday with with substance. Use disorder is is is a really critical issue for the city right now and I think that the community police commission plays a really important role and making sure that our police department and that our accountability systems are acknowledging that that intersection square on it and there's a great opportunity for us to make sure we are influencing those trauma-informed approaches through the community voice and the specific intersection of both the need for Public Safety Services, but also the need for Public Safety Services that aren't going to Traumatized communities that are currently experiencing trauma so really value your perspective and your expertise in guiding those conversations amongst the community police commission in the city as a whole. So thank you so much for your willingness to serve. Thank you. I think that's that's it. No more questions here. So we'll go ahead and move the appointment as well. So I will move appointment 01295 the appointment of Esther Lucero as member Community police commission for a term to December 31st. 2021 appointment will also be considered by full Council on Monday April 29th 2 p.m. Same field you are welcome to attend but you're not required to attend the full council meeting. All right. So let's move now to consideration of the nominations from my office and from the city council as a whole really. And about each of these candidates at as a relief to Natasha and Carissa. I promise that we did check with Sean good taking two people from a from a cheese 182 serve in this capacity and really excited that Sean is very supportive of both of you participating, Can you please go ahead and start with Natasha and you can just talk to us a little bit about your work and how and why you're interested in serving the community police commission and what you hope to be able to accomplish and then I'm sure Catherine skated might have some questions here as well. But and I will say for the fueling audience and the benefit of a counselor mosquito that I did have an opportunity to spend some time with each one of the four nominees that we put forward and I want to thank them all for coming into my Office on a Saturday which was the only time I could find to do this and I really appreciated all of your thoughtfulness in terms of our conversation discussion about what you hope to be able to accomplish and your own lived experiences. And and how those are going to show up in this role still really appreciate that thank you. So I grow up in Seattle the Rainier Valley Community and I've seen with good policing looks like and what bat policing looks like and when I was doing gang intervention were working with at-risk youth and wasn't until then. I realize that the relationship between the police and the community was broken. And I did that for 5 years. And now I'm at a organization called choose 180 and we offer programs to keep you thing in the dots out of the justice system and keep them in school. And so do the experience that I have had with that working with, you know, people of power within the system and also working with families and youth in the community. I feel like the experience I have will be an asset to the commission. And is there anything in particular you hope to be able to to work on as part of the community police commission? I think the first thing is, you know, kind of mending the relationship between the community and the police because I feel like there are some very powerful people in the community that you know want to act on certain things, but they don't know how to really go about it and you know, they're kind of scared because of the things that have happened in the past and then just holding the police accountable for how they deal with our people great customers getting any questions. No, I'm sorry. I had to sneeze with all of your work with the youth in the past as you have any other comments about accountability and with that looks like even though you know, we have our community at large that we want to be accountable to stay in Campbell to the uses often something. I really think we need to continue to lift up is that part of what is determined as a t who you're accountable to? Yeah, definitely. And I think you know, it's just not the police. I think people in the community need to know that they have a voice as well and some people need to step up because I mean the commission is great. But it's going to take a larger group of people to really come up with Solutions long-term solutions that are going to you know, positively affect the systems. And if our I really appreciate again your perspective particularly working with youth populations, I think it's a really important voice at the community police commission has expressed to us. They are really interested in hearing more from that voice and I have huge respect for the work that you've done and he's respect for the work that she's 180 does so, I'm really excited to have you join the CPC is also thank you for accepting the nomination and being willing to Thank you for having me. Okay, so next up. We will hear from Brandi Brandi. You want to introduce yourself again to us in your own words and then let us know why you are interested in the community police commission and what you might want to focus on Four Non responsibility Foundation. I am originally from the state of Oklahoma Southwestern girl. And the reason why I wanted to apply for the community police commission is 2 Reasons partially it's personal but it's mainly professional as well. I'm raising a wonderful son. He's 13 years old and the way that he presents to the world. I have to use the platform that I have the resources to make sure that he's able to navigate through this world safely and know that he is the king that he is and be able to use his voice so I have to be able to model that for him. Call is your son. He's 6 for he's 13 years old, but you know, my mother's parents when you look at him. You can tell he's a baby outside of things is I'm at work and Community engagement mental health for over 15 years. And where I come from Community has family, right Community has family there on Tuesday or uncles or cousins. I'm in the metaphorical sense and sometimes in the relational sent and I hope to be able to bring that to the community police commission by helping bridge that gap between the community stakeholders the real unsung heroes that are in the communities people like Reverend wild and people that she's you know, people that have model themselves after her just to make sure that we're having up being able to have a seat at the table. I've been in great company since I've been here five years ago. I've been in the likes of organizations like she was 180 Community passageways and obviously my organization who has made A concentrated effort to make sure that they're showing up for impacted communities in a way that they may not have in the past and so collectively we wanted to make sure that we do that and so when we're putting together initiatives and policies and the bills and agendas, we want to make sure that we're having the people that are the most impacted represented in that language when we're passing those bills. So that's why I'm here. I just want to be a part of what makes the most sense to keep our family safe. Right? Cuz Community is family. Thank you Brandy. And one of the things that I think is really impressive about the work that you've been doing since you've been here, it is around gun safety and addressing gun based violence within our communities and we fortunately know the statistics all too. Well that it is communities of color low-income communities who are the ones who are most disproportionately a negatively impacted by gun violence and having that really strong so Instead of experience around what it means to collaborate with law enforcement with Community with with harm reduction Public Health Advocates and experts to really take care of our community in that way is I think I really important perspective to bring to the community police commission and hope to be able to hear more from you through the community police commission on how we can have them we can really send her that importance of Public Safety that is safe and feels comfortable for all communities as part of how we do policing here in the city. Thank u s late over here. Not not that the other ones are impressive. Okay, so we will go ahead and move along to our next nominee. So we will go ahead and hear now from karisa. Hard act to follow the same question a little bit about yourself and why you want to serve on the CPC and if there's anything in particular that you would really be excited to focus on would love to hear that as well. Thank you and working with people who been highly impacted by policing and the criminal legal system at large. I'm starting with Foster Youth and then working with young adults experiencing homelessness for a number of years and then working with I used to have gang affiliations and now working with youth who are facing their first felony charge and I think that largely why I initially wanted to join us commission was to bring an amplify their voices while I'm constantly asking the young people that I work with what they think Justice looks like what could have happened in that situation that would have held them accountable but still felt just what kind of Stone could be imagine without the one that we currently have and I I hear so many remarkable answers and so much wisdom from them and I would love to be able to bring that forward. I'm in terms of kind of specifically what I'd be excited to work on would be too kind of take the the non formal way of me asking them, you know when they're sitting in my car is making that more formal and doing community Roundtable specifically with young people who are so highly impacted by policing in the justice system and being able to empower them and amplify their voices both one because I think their voices need to be heard and I think that they have that wisdom but also because I think that that would increase like Civic engagement for communities that are often under-represented and to be able to really have them feel empowered in that process. Great. Thank you ever get any questions or follow up. You know if you guys are all so impressive I'm just really said I had one of the questions I had to ask was around the intersectionality and everyone of you were brought up intersectionality in your opening, So I don't have any other comments or excellent. This is this is a good sign for you all. Okay, and last but certainly not least is a little bit of yourself from your perspective and excited about working on thank you for having me. I use both pronouns he him and she her and we're proud latinx queer non-binary person of color. That is a major reason why I decided to join the community police commission. I'm very focused on how are we Central and elevating the voices of community historically left out of tables. Like this left outer space is like this making sure that the communities who have generational and historic drama. Be perpetuated by state violence in our communities that does voices are elevated and centered another piece of that too though is not in my work on the director of racial equity for a coalition of organizations on Seattle's. Campus that are rooted in an Arts. So theater music dance. How are we using those as forms of social justice and one of the things in that work is how are we holding her and making sure that both sides feel heard. I believe that when you provide people opportunities to be better at their jobs and thank you officer Mullens for for being here. I think it is a Braves. Space to be an especially with the current political climate. I want to also make sure that Acknowledging the power Dynamic that exists in communities were most impacted by state violence or heard an elevated and nausea not partying in it. And also making sure that police officers to also have families who who are also carrying generational trauma and may be present drama in their bodies that they also feel heard. I think people want to be listened to and created space for and I think that's an important part in healing and bridging Community. Thank you and follow up for Alina. So I'm one of the things I was excited about seeing your summary was the work that you've done with the black prisoners caucus and can you talk a little bit about any takeaways you have him that experience and how that might inform some of the work. They helping to lift up on the CPC. Yeah. What's interesting is that I've been working with folks who have already had interactions with the police department and acknowledging how slavery in this country has turned into mass incarceration and how that has impacted the black community indigenous Community communities of color looking at the population of specifically Black and Latino women for mothers were in prison. I didn't have a personal connection to that and knowing someone who was incarcerated until someone provided me that opportunity and honestly the honor to go and meet with folks and I learned so much from that experience. Part of the work and how that intersects with the work that I'm doing it by prisoners caucuses. Are we using art as a form of social justice to make sure that our young people don't end up in places like that. They were addressing systemic issues as well that it's on a Band-Aid issue or banding fix that we're putting on issues but really censoring and uplifting a population not people forget about unless you have a direct experience with someone who is incarcerated. You've been incarcerated with yourself for not having that conversation with those with those communities. It is a privilege to be on the outside and I carry that responsibility in that way and I'm also looking forward to bringing those voices to the table to Thank you. Great. I think you are you really bring a strong perspective of experience in general and I think that's important part of the work that that the city was as a whole but that I know is really important to communities who are who are dealing with trauma and negative experiences and restorative justice is good for the entire ecosystem right folks who we both like Azar Mullins who we who we really respect and appreciate providing at critical Public Safety Services to members of our community, but also people who feel like that. Sometimes it doesn't always happen the way that they would like for it to happen. Right? And so I think those concepts are super important really appreciate your willingness to bring that expertise to the community police commission and really looking forward to seeing how you advance that conversation. So thank you for your willingness to serve as well. All right, so we will move this appointment all of the four appointments. So what we will do I will move appointment 012-940-1296 01297 and 01299. And what's the appointments of Brandy Grant Natasha Moore? Karisa morikawa and Alina Santillan as members of the community police commission for a term at 2 December 31st, 2019 and in some instances December 31st, 2021 confirmations will be considered at full Council Monday, April 29th 2 p.m. Here in council chambers again not required to attend, but you're welcome to come. I'll just end by saying. Last thank you to all of you for your willingness to serve on the committee police commission as it relates to the nominations coming out of my office. We're really clear with each of you what the level of commitment would be and we squarely focused on individuals who we believed would receive organizational professional support to you be able to show up and fully participate in the activities in the work of the community police commission in a large part that is because this in my mind is one of the most important and most powerful Commission in the city of Seattle as as an organization. And so I think it's it's really important to make sure that we have Commissioners who are going to be a hundred percent 110% dedicated to you on this body of work because it is a lot of work and really appreciate the collaboration with a community police commission and the mayor's office on identifying I just know I have folks and being able to present this wonderful slate of individuals. I understand that your first meeting will be on May 1st. So I'm very excited about that. I'm probably not as excited as the current Commissioners and staff over at CPC. But really want to acknowledge your all's willingness to serve and also really want to acknowledge and pay respect to the work that you do outside of outside of City Hall in outside of the community police commission. Each of you do a tremendous service for the people of our city. So thank you so much. I'll just think I could be a writer for my office for for helping me do all the scouting and coordinating and finding each one of you and then I'd like to thank Kyla Blair from the mayor's office if for helping us out with the mayor's appointments as well. So thank you so much. You are free to go. Thank you. Alright. Thank you. Alright, thank you so much. Okay, so we are going to do a quick little switch-a-roo here. Thank you all who are viewing for your patience. Really appreciate it. We're going to go ahead and move to our next agenda item which is agenda item eight and I will go ahead and invite our presenters to join us at the table. If you're here to present on this particular Bill and then mean while I will have Roxanna Reid agenda item eight into the record and Roxanne feel free to read the short title. Cancel bell 11948 0 and organs relating to the 2018 families education preschool and promise Levy approving it implementation and evaluation plan as required by ordinance 12560 for for reading and discussion and possible. Thank you so much. Why don't we go ahead and do some introductions and then I will hand it over the UN Office cast members of Atlanta consalus previous meeting on March 27th, the committee discuss the potential issues in education preschool and promise Levy what we refer to as to accept letting at to its implementation and evaluation plan. It's about work on Dining Plan at following that meeting and I work with council members to prepare requested amendments in the direction of committee chair Gonzales 9th Amendments have been prepared. Have all been Consolidated into a single proposed substitute. I need plan that substitute can be found. Its attached to the memorandum in the materials as a one and it is shown with markups. And those are provided in red and green text and underline strikeouts. So I'm asked Council Central staff to do is presented in a consensus package as we are moving along if there is a particular amendment that is of concern to you. You are welcome to request that be pulled out for individual consideration. Otherwise, we will vote on the Amendments as one full can consensus package after after Brandon Ali have reviewed them. I think your Facebook. So number one would expand the overall outcome for the Fete Levi to incorporate additional groups of prioritize students would make the list of Prior consistent with the letter e Ordnance that the council passed in 2018 and it showed up there on the screen, but then it would add essentially for additional prioritize the troops to the list homeless English language Learners and lgbtq students in a few other places in the plan. We're the same list shows up and specifically related to the intended recipient of K through 12 Investments and also for that privatization process for Seattle promise tuition funds I just one quick nap while we're on item number slide everyone here in the Blue Ribbon at the bottom of the screen. You can see a list of page numbers. So these numbers represent all of the pages in The Plan proposed substitute. Can you find documents that have been amended. Changes for this amendment? There are some page numbers that are shown in bold and underline on them. And those are the ones that are the most representative change. So if there's one page you want to look at for each of these amendments he want to look at the one that's bold and underline. Thank you. Any questions or comments about this moment? All right, let's proceed to incorporate Levy strategies and activities that are beyond the scope of college and job Readiness experiences. So it adds three more elements to the goal with the proposed increased academic preparation expanded learning opportunities, social emotional skills building and college and job Readiness experiences that promote High School graduation. Great, and this is another edit that is in line with the original ordinance that the city council advance to the ballot for voter consideration of a 2018 correct? This changes in my mind really important because although we want to make sure that each graduate from the case of health system is ready for college or job Readiness. We also want to acknowledge that there is much more to learning than just college and job Readiness and that includes the other aspects of the amendment that are included here. So I really wanted to make sure that we allowed the Department of Education Early Learning and this and that are Partners the opportunity to also central air work in these bases as well. Thank you any concerns or questions. Emotional scales building as a component of this work. So thank you great at a new section to the plan that identifies modifications to the plan in the future that will require approval by Council via ordinance require written notification by deal to the council and identifies topics are programs for inclusion in regular reporting by deal the plan as proposed by the executive contains language that would allow deal to modify program elements without Council approval during the seven-year term of the Levee this amendment clarifies work on Celebrity would retain control it. Also I'm where they wouldn't show in certain cases. There is a request that certain changes would require approval by the city council by ordinances includes changing the funding level tuition requirements for the promise program tuition requirements for the preschool program another modifications of Eligibility requirement for the promise program. And then it also identifies some components that require a I need a notification to cancel things like modifying the spp's child selection privatization. The 60-day notification. Is intended to give counsel Advance warning that did that deal intends to change the implementation plan and in most cases should provide adequate time for the council to consider whether or not they're comfortable with that change and if they want to take legislative action to modify it in a different way. I'm in addition this amendment add specificity to topics Council expect to be included in regular reporting. I'm so deal will be preparing an annual report the companion resolution to the ordinance. I'm for the Levee requested that that report be delivered to the council annually in addition to General reporting this as a list of very specific requirements on things like detailed information on participants and the benefits of the Seattle promise program any questions at this particular brings the implementation evaluation plan language more in alignment with ham at what council's role has been as it relates to these loving Investments and felt that it was really important to City council's ongoing function as an oversight entity is the legislative branch to make sure that we communicated very clearly our expectations are At what we believe on the department has full flexibility around modifying and and what are some things that we aren't quite comfortable losing oversight of and so really appreciate the willingness to incorporate these three different categories a requiring approval notification for potential of approval and lastly the category around making sure that we at least receive some annual reporting for purposes of transparency and accountability. So really happy to incorporate this amendment back into the elevation plan for a sliding fee scale for the Seattle preschool program for SBP as a quick reminder. The fee scale will be used for those families that comes above 350% of the federal poverty level and the scale determined each of the families are responsible for So the cement it would make a few changes to the scale and Ivy plan at first, it would bass family tuition amounts on a percentage contribution to the cost of a preschool slot and this percentage contribution increases along with increases in family income hot sauce on the side. You can see you this is very abbreviated table similar to the one that is included in the appendix of the plan. So we're just showing the first to step Rose here and then the last two step that's just the top of the bottom of the scale, but for step one, you can see that a family that's making 351% of the federal poverty level would be responsible for contributing 8% of the preschool spot cost and just for context in the 2019-2020 school year. The estimated cost is estimated to be $11,000. So if you did 8008 percent of $11,880 Which works out to be $88 per month for a 10-month this means that every family in the program would receive at least a 5% subsidy off the cost of the preschool slot. So this can be seen in the final row of the table and 4 level 30 and a family about level of income or any income above that and just for context at the 728% That's about $187,000 a year. Would they be required to contribute 95% of 20 school year would be $10,450 for that for the annual cost. This is also consistent with FCPS current tuition scale and would maintain the program's policy of providing some families. Inelastic demand, it would increase the number of steps in the scale from 25 to 30 so has proposed it had 25 steps that you can see we go to 30 on this one and that essentially has the effect of reducing the tuition growth between the steps as you work your way up the scale any questions or comments. Amendment number five with a descendants 2 the Seattle promise section of the plan describing an existing option for students to attend school temporarily on a part-time basis. So the promise program as it's currently setup requires full-time attendance, but students are able to request an exception to that requirement on a quarter-by-quarter basis under limited circumstances and some of the hardships with any full-time or being able to enroll Discussion on this so thank you for this amendment. I'm a timeshare so prior to the inclusion of this amendment if there was a situation where a promise student needed to be available to work part-time and couldn't go to school full-time if they needed to attend the family obligations or take care of a loved one who was on family leave or something. They wouldn't have been able to participate in the promise program. And so you're creating opportunities here to make sure that there's flexibility built-in option was to attend full-time. So this is simply recognizing that this appeal process which does currently exists a lot of times. It's specially for women and communities of color in Folkston more vulnerable situations. If it doesn't expressly allow for certain activities than many of us make the assumption that we shouldn't apply. That we wouldn't be eligible and that it's not going to fit our daily needs. So this is a great addition especially to make sure that the target population of women people of color members of lgbtq community that folks really feel like that. There's something that comes up where they have may have taken themselves out of the mix in the past that they clearly see that there's flexibility. So thank you. Absolutely and we had at Parchman hearings heard some pretty interesting data around the percentage of students graduating from public schools who enter into Seattle colleges, but do so only in a part-time status and the number remind me Brian and Ali is 43% about 43% of the graduates from Yale public schools that go to Seattle colleges that 10 Seattle college on a part-time basis and really appreciated the information that we received from sale colleges that in practice. They are absolutely Desiring to be flexible and making sure that Part-time students can be accommodated and wanted to make it roll plan to ensure continuation of that practice. Excellent. Thank you. Next number 6 would insert a new paragraph into the Seattle area section to find certain additional topics for deal to include in its racial Equity toolkit analysis of the of the Seattle promise program of two things first being program program expansion to students wishing to enroll and promise program on an exclusively part-time basis for the one that we just discussed was kind of temporary part-time basis. So this would have them look at it for a part-time and the second part of that is the impact of the satisfactory academic progress requirements that are applicable of students that receive some type of financial aid, that would have been include that in the rich life as well and inconsistent with Can I buy Alli for a minute number three they would require deal to speak to write recommendation of Levi oversight committee prior to propose in any policy changes that stem from the racial Equity to analysis. Any questions and this is just another one of those areas where because the Seattle promise program is a new a new formal too much bigger scale program dinner 13-14 year scholarship program. We wanted to make sure that we were approaching the funding and the structure in the model of Seattle promise in a way that wasn't going to result in unintended consequences particularly because it's a list of phrases for last dollar last dollar in program, which means that those who have the greatest will receive the least amount in terms of direct tuition assistance, even though they will also be supported through the equity scholarship which provides the much-needed assistance around being able to Pay lab fees and books and all of those things and so this is this is our intent to make sure that the racial Equity toolkit analysis will will help us identify any unintended consequences. Should they begin to happen? Great Mex Amendment Amendment, 7 would provide additional specificity regarding the types of referral in connection services, that would be provided to students by Seattle College advisors to support students lives outside of college. The plan has proposed notes that students will have access to non Levy funded supports to prepare for Life Beyond college, but does doesn't really describe the range of programs and services that may be applicable to this amendment add some of that specificity at a somewhat high level and recognition that program names and types of services get changed and expanded over time, but I also asked that deal work with City Hall Seattle colleges to develop and maintain a list of resources. So advisors have that at their disposal and then this also connects with amendment 3 in terms of the annual reporting and ask that they be tracking on the referrals. They're making and how successful students are in obtaining those services and it-related another way to amendment 3 in terms of reporting back on any success deal has Trying to streamline application for at least city services that are provided so that people aren't having to apply to in 15 different places for you know different types of services like child care or food supports and housing in that sort of thing any questions. I want to replicate this and almost everything we look at. Great next Amendment. I'm in the number 8 without a liver Harmony components to the list of methods that deal will use to evaluate RFP and RFI responses. So the plan as it's currently drafted states that deal with the results of leadership to freaking out comes the means and methods proposed. And of course the cost of the proposal and understand it would add the phrase adherence to labor laws and a commitment to labor Harmony to the list of the evaluation methods excellent. Any of this is an amendment that our office has worked on together and happy to provide you an opportunity to speak to it for your offices engagement with with us as we crafted legislation or I'm sorry. I meant to the legislation. This is really exciting to make sure that our city dollars are being in the providers who and organizations who are providing best practices in terms of our labor policies and that our city dollars go to fund those organizations that support and versus oppose a workers Collective. You know, I think part of what South American salsa and I have continued to bring to the conversation is that when workers do well everyone knows better our kiddos Do Better or Worse Community better? When we invest in things like scheduling like you let on and minimum wage. These are things that are based on Baseline investments in workers. And we want to continue to make sure that when we have the opportunity to hold the purse and invest in strongford priorities that we're really putting forward what is best for the public and in this case labor unions Collective worker action is very much. The Roberts is an opportunity for us to show that we have a high-value that we associate with labor protections and hire labor standards, you know, we know that labor unions and Collective worker action has led to things like safer workplaces Banning child labor having the ability to have a weekend having labor laws that at least let us to have a minimum wage and you know also that losing an arm And as it goes release education many of our providers are out on the line putting that their lives on the line to buy for smaller class sizes, for example, silver really proud of the work that they've done with us in Partnership. And I think especially in a post Janice world the national attacks the national dialogue against unions on this gives us an important opportunity to show that we stand with workers and we stand with our commitment to basic labor protections. So again, I applaud you I applied at you. Also. We should note the the mayor's negotiations that she did on the memorandum of understanding with our Coalition for City unions to show what it looks like to be a good employer and to work in a post Janice world to create more opportunities. So that workers can continue to have a collective voice. I think a great example of us leaving by Leading by example as an employer. So with that I'm excited to put this forward to make sure that we continue to see workers standards lift it up and let's not forget. This is also Good investment. There's a higher return on our investment when we have higher unionization rates and stronger worker protection in our community. People are healthier longer longer retention less turnover and excited to see this included. So thank you for your ongoing work on this. I totally thank you and I and you know, I think I really want to make clear that this is really intended and designed to signal to our partners who we do work with it. We do value we do value their relationships with with labor unions who provide these critical services to come to our children and I want to continue in the tradition not just of signaling that value but also of addressing sort of the practicalities around what happens when we're providing City taxpayer dollars to funding a lot of these programs and it's our expectation that those Services continue to be provided and lastly I'll just say that this language is not intended to Inject ourselves as a city into the labor relationship that exists between employers and their employees in in that collective bargaining agreement. I'm relationships. I just want to make really clear to our our partners in this work that it's not the city's intent to inject ourselves as a third party in that good face leave a relationship and in those are good faith labor negotiations. This is really more about making sure that those Partners they do have labor unions are understanding that we take that we value that relationship with labor unions. Okay, next one and it would simply make some technical corrections to the plan and the first a wood insert the word fees and to the list of eligible uses for the Seattle promise Equity scholarship. He's or something that deal has been considering makes an explicit within the planet's all I second it would break page numbers both in the table of contents and Independence number 2 at 3rd and wood crack the procurement terminology for public health. So right now the fuses are thighs and actually use a different process applications. So just make that correction and then for that corrects a couple of typographical errors in ages, and that isn't great. Excellent any other questions for Brian or Ally? How long have you been working on this today's on a combination of how much time I think we started this in 2017. Yeah, early 2017 Barry. It's been awhile to get here are some very excited about that. Congratulations on the cusp of a vote. So I will just move this is one whole Amendment or do I do amendments 1 through 9. A boy that is not the language that I was given. I will make it up on the Fly. Okay, you eat you first it's like it's basically one Amendment year proving the substitute and then you'll approve the bill is amendment Hazard that plan as amended. Okay, I move for the adoption and approval of version 3 of council Bill one 19480 which is a substitute for version to did I say that wrong attachment 1 to the bill the substitute the proposed subsidies version 3 I want you make the motion say the sentence and I will say so moved. So move to amend attachment 1 to the bill as shown in the substitute version 3. Of counsel Bill one 19480. Yes. That's my emotion. Excellent. Any further discussion really like what you've done to attachment one can any opposed non opposed at motion passes now, I will move to recommend that the full Council adopt Council bill 11940. As amended as amended I second that any further discussion a I-80 as amended will be considered by full Council on Monday, April 22nd 2019 will need to move to suspend the rules to refer the we're going to do that later after the two resolutions. I just so you all know. It will be on April 22nd final remarks about the whole thing. Once we have more Folks at the table. Okay, let's move on to the next agenda item. And if you are here to present an agenda item at 9. And 10, I'd invite you to join us at the table. Agenda item 9 resolution 31881 a resolution relating to the 2018 families education preschool and promise Levy approving a partnership agreement between the city of Seattle and the Seattle College District for briefing discussion and possible vote and agenda item 10 resolution 31882 a resolution relating to the 2018 families education preschool and promise Levy approving a partnership agreement between the city of Seattle and the Seattle School District number one for briefing discussion and possible vote. Excellent Arendt I think everybody has their their their name tags except for Brian and V. We know who you are. Okay, if you're in public can see your names as well. All right. So let's go ahead and do a quick round of introductions and then Am I going to hand it back over to you Bryan or am I heading over to director spell learning? Denise Juneau superintendent of Seattle public schools Seattle Central College Seattle colleges Public Schools across Alejandro Morales policy office. Thank you all so much for being with us this afternoon. It really appreciate the ongoing partnership and work. It is taking us all collectively a long time to get to this point where we are considering resolutions that would approve the partnership agreements between the city of Seattle and Seattle College District and the Seattle school district and want to make sure that the viewing public also knows that both. Is it really still the count the previous Council Bell Witch approved the implementation and evaluation plan and these two partnership agreements that the fat Levy oversight committee has reviewed all of these materials and issued their consensus with regard to a recommendation for City council to approve all of the above. So really excited to have you all here. Thank you so much for your willingness to join us this afternoon and for your willingness to continue on in this partnership. So with that being said, he'll take it away. Thank you for the introduction and just we are here today with our president of central Chancellor pan president of the college in dr. Diane debacker. And so I'm going to be doing today is really just sharing some highlights of our partnership agreement and what you see up here just just really are out presentation outline. What will be going through? So ultimately what the just want to kick it off and just really tell you the purpose of the partnership agreements. My deal is for the bus to have outlines and Define roles and responsibilities for each of our partners and our partners. Being Seattle public schools and the colleges as well. So does that those are the two that will be speaking to when I talk about the partnership agreements shortly? As you mentioned earlier, so here is a brief timeline of the history of the partnership agreements or actually I'm started back in 1990 before any of us were born and what is bringing us here to today where we have a new partnership agreement. So historically has been deal with the city of Seattle with Seattle Public Schools. But now I'm with the new addition to the Seattle promise. We have another amazing partner to table which is our colleges. So as you just kind of take a glance at the Timeline really just wanted to share with you all I won't go through all of the bullets, but I'd I will start at the law or should I say end of the last bullet of where we are now, which is says April 2019, and I wanted to thank superintendent Juno and Anna Seattle public schools for our last night their board voted to approve the partnership agreement, which is now bringing us here. Son of you wanted to thank you with that and really and I've a little into some of the ordinance text you mentioned earlier. So based on the we are required to develop a partnership agreement that as I mentioned earlier will establish the roles and responsibilities of each entity and will really just talk about how we're going to achieve our desired outcome and what the ordinance also mentions is that the proceeds that maybe only leverage to support the Seattle schools district and the Seattle colleges programs are functions with the existence of the current partnership agreement. A little but I would also want to share with you is as in the partnership agreement. We have sections and a few sections that we just wanted to really I'll just share with you now really are of start off with section 2 of The partnership agreement and in section 2 of The partnership agreement really it just highlights the commonalities between both colleges and I'll Seattle Public Schools partnership. And so I'll just go through a few of them some of our coming out of these one is that we're looking we all are at in intending to invest in our Seattle children and students and families and communities who have and who are historically underserved we all plan to use data driven in and out come in space decision making And we all plan on implementing evidence-based strategies are promising practices. I'm to achieve these goals and we all want to make sure that we're providing access to building capacity or opportunities with our partner organizations, basically to improve Quality Inn quality infrastructure and instruction and so forth and do you know the as mentioned earlier the loc what uou, I borrow a member of actually shaped and the initial investment in priorities and principles that are established in the ordinance. And so just wanted to know that we all are committed to investing and implementing these funds as recommended by the loc and Ordnance. So what I'll do now is is ask superintendent Juneau to I'll speak to section 9 a little bit of the partnership agreement. I'm thank you. And thanks for all of the hard work that's gone into this. I really have to come in DL for their strong partnership and the work that their staff and our staff have done together to make sure that we get to this point. So super appreciative of the continued partnership with the city on these efforts as a Dwayne said last night or School Board unanimously voted to approve the partnership agreement. And so I know that they are looking forward to Growing this as well and making sure that were making the investments in the correct place and I think that really speaks highly of the work that's been done in the past that there's some trust being built there that the governments are looking to work with each other and that we are all in on making sure that we're all doing the work that needs to happen on behalf of Seattle's Youth and of course movie and promise is going to be a great benefit as well. Destino as you all know the past I mean, we are looking forward to continuing to building on our high-quality preschool programs that are located in our Seattle Public Schools. They been he know the idea that we can create those types of programs right within our schools for the transition to kindergarten so they're ready to learn when they step into our K-12 system has been really strong the K-12 investments in the past have been really helpful particularly. The Investments that have been made at the middle schools of hockey croci ASA Mercer and Denny International those school. I'm as a result of the partnership. Happy, Ward winning Gap closing schools. And so that's been really important to our district as well and family support workers in the wraparound supports that have been put into place have really been helpful to families and students in our system. And as you may be aware, we are district also just recently adopted a new strategic plan. The district and looking forward and putting our efforts. In riding in the car on the correct priorities and a lot of that is around making sure that we are including students and families and communities of color. I'm bringing them to the table making sure they have a voice focusing specifically and intentionally on students of color for this from educational Justice with an intentional focus on African American males and I think Partnerships like the one that we have here with the city really is going to help us move that dial. So I'm looking forward to continuing those efforts and making sure we do everything that we can so every student and our system is successful. And of course that goes right into the saddle promise and the potential of that to create a work for assembly. We have the potential now for every South Harbour school student to step out as a prepared graduate. Stepping into either to get a college degree or work credential and that is super powerful for the city and I think the great things that can come out of that doing it with the city and making sure that we're moving forward together is going to be a really strong partnership. It's unlike anything. I've seen in the country actually going forward the idea that we can create a Pre-K College seamless system. That is in partnership with everybody sitting at this table is super powerful. So I just want to thank you all for your leadership and the partnership going forward thinking superintendent. Really appreciate those remarks in your perspective, and and I've been really pleased and inspired by this work as a as a as a person who graduated from public schools myself, not the Seattle Public Schools, but public school now and have really appreciated the opportunity to continue to build on a good relationship with with Seattle public school district, and at that has been in large part because of you and your staff and your willingness to continue to engage with us, and I just want to thank you for your willingness to continue to to build this relationship for the benefit of our youth. Thank you. So next up wheel will ask dr. Pond or Chancellor pain and dr. Sheila Lane to they'll be sharing a little bit more about what section 9 is in the partnership agreement for them as well. Thank you. After noon. This part of the should be my money. It's really very historic City U Seattle colleges have always had great relation. But this takes up to a different level. If not this partnership is really about distrust of an owl Mission really drives very well is about getting those who use coming to set up up Seattle colleges to prepare academically for jobs for career for transfer for completion. So we're preparing local used for Seattle jobs. That's the vision of the city the man. The last two years. We've been working hard many meetings men in great conversation sometimes difficult conversation, but it's great to be here a moment to thank you and councilwoman Gonzalez and Robert Johnson your leadership to instrumental to get us here. We are the Seattle College is very excited for a committed to do what we can to make sure Lok for use regard his hero Academia background academic preparation have a good chance all of them to come to Seattle colleges through this program for people not in the program for frankly to have a very good chance to get a college credential so they can transfer the can get a job or get a certification. The content of the partnership is the wisdom of work of many people. I want to consent during Chappelle the deal. Has been wonderful crude in the city council staff have given a lot of great feedback and the mayor's office increase Kim cell has been instrumental in getting us here. We are very excited committed again to do everything we can to take the lessons. We learn from searching your scholarship, but also National Best Practices to do what we can our strategic our strategic priorities our new Mission Vision Values again integrate with this very, well. It was laying has been very instrumental soaking in this group. Let me turn it over to Sheila to ask additional comments. Thank you. I also want to thank you for your leadership. It's it has been a long haul getting to this day and hopefully on Monday we will be able to have a full Council passes and then but you have to spend a tremendous partner in this and one of the things we're signing me partnership agreements with the city and the colleges and then with this with the city and the Seattle Public Schools, but what this has done the process and and the the way we have laid out the Levee and implementation plan is really bought and partners together to create a system for our kids and we know that if we see all of this Prosperity happening in our city that there's huge disparity and who's getting access to that and prosperity and so for all of us now to be on the same page and putting Equity first, and and I love the way that our new superintendent has outlined at those students who are furthest away from National Justice and we have equity and diversity and inclusion in our strategic plan. It is now at the heart and center of the Seattle public school and it's always been at the Heart of the City does in Sulphur now all three of us to come together to say this is what we want for our children. It's a really a historical moment in our city. So thank you for your leadership. Thank you. Thank you so much. I really have enjoyed the opportunity to work with both of you over the last several years since I've been on the city council first in the context of just re-upping the funding for the Thirteenth Year and then the transition into thinking about more sustainable a bigger a product and really want to thank Seattle colleges and the foundation for their willingness to step up and also establish the endowment and continued to grow the program. I think that's really important in as a as a graduate myself of a community college. I certainly understand the power of being able to Uaccess education in a way that is Affordable and it's at home and close to home. And I think that I hope that many students who have similar live experience too experienced to mine and to those of us were sitting around the table and I continue to see this as a wonderful opportunity to be able to be literally anything. They want to be so very excited about continuing the partnership and having it be more formalized in this way and looking forward to the ongoing lessons and learning opportunities that we're going to have together as we as we launch the Seattle promise in a much more formal and a much larger way. So thank you all for your continued partnership and work so much about Foundation. We are excited just hide a new Vice Chancellor for advancement and that person will be introducing her working wisdom. We need to go. How to raising funds to suspend the program for long-haul be on the Levee great wonderful to meet the new vice-chancellor great anything anyone else would like to add her or dr. Chappell you want to perform so this is actually the last slide I wanted to share with everyone is is pretty exciting and section 10 of the partnership agreement is really speaks to what we all have been just talking about. I'm a section 10 basically highlights our approach to working together and I were mutual commitment to collaboration communication or should I say better communication and supporting each other in our shared goals and ultimately looking at strengthening our shared voice and messaging regarding the program enrollment from MSP all the way through promise. We wanted to really share on this piece with you. I'm as well because we know how committed not that we are too that we are to working together, but ultimately dissection right here is I'm highlighting. That is well great any other questions or comments? Chris did you want to say anything on behalf of American colleagues and dealing superintendent Juno at the district chest pain doctor laying at the college's I don't want to miss out on what is essentially the pre-function to the celebration on Monday with hopefully the passage of the plan as well as the agreement. And again, thank you to your leadership and scared as well and former council member Johnson who else may be watching on TV for your guyses leadership that has been indeed a journey together and I'm just happy to have been apart of it to see sort of the $11 in Investments and approaches that we've developed really come to fruition in the coming years. Thank you. And so with that being said Two would like to thank you all for what you've done appreciate the learning that I might have experienced some working with you. I'm looking forward to it. We know this is just the beginning. I'm thinking about the loc and moving forwards but also wanted to thank my partners and I'm at the table and also the folks that really were grinding behind the scenes of the Monica. The Tim's Marissa's and James bushes and end-all Marcus shells and people at Seattle Public Schools really want to just specially thank them for for helping us move this along so well covers get some additional thank-yous of already thinks all of you here. I'm also want to think Brian and Ali from Kendall Central staff on all their help also from the very very very Inception of when we started working on this at Brian. I think you actually worked on a couple of at least I promise I love you in that was first to instituted in 2014 really have appreciated Ali and Brian's guidance and really solid policy analysis and work on a lot of these issues and and making sure that I was using Brian very strategically to answer all of the questions that I had and we continue to poke at deal with all of us commission. So I appreciate your all's willingness and entertaining our questions and continue until want to work with us. And then I also wanted to thank the new inform my office who has been working on this also since she started at my office and has been doing a tremendous amount of work in advocating for some of her own personal priorities through the including at making sure that there are strong investments in an increasing the diversity of our Educators within our system which is of course as we all know a really clear Strategy Torrance at closing that opportunity Gap and an event has really relied on her expertise to make the case for why that's an important Investments through this Levy and excited about seeing it play out as well as some of the other things that we advocated for that. I'm really excited or included in this implementation evaluation plan also include at new and exciting Investments around making sure that we're addressing students and their families who are experiencing homelessness and in both the Pre-K system put us on the K through 12 system and really looking forward to working in partnership with many folks around the how we get that model just right so that we can best serve those students there their needs outside of school so that they can I show up and be ready till it to learn all so that was another priority of his V Nguyen that made its way into the Levee and And then lastly, of course at making sure that we are being very conscious and deliberate about any potential unintended consequences as a result of access to the promise program and how we structure the program. I think it's going to be a really wonderful amazing program and we're going to yield tremendous results from it and because of that I want to make sure that a at those a student to meet at the most of the ones who are being prioritized in terms of access to to that that program cuz I know how powerful it is to be able to go from from high school to college. So thank you all so much for that. And then also wanted to just think all of us daffron deal. I know they're they're sitting back there. Just waiting for this to end. Really want to appreciate your all's at Staffing on this and your preparation for Levy oversight committee meetings your preparation and intolerance of of my interrogation during meetings about things that I care about and that in the Levee really appreciate your willingness to continue to work with my office and with me and too and to be really receptive that and then directions to Powell. Thank you so much for your partnership your leadership in Your Vision in this space is really appreciated getting to know you better over the last couple of years and working with you closely on on getting us to this point and I am very confident that we will have Support in full Council on Monday and and if we don't have to answer to me. Learn as you said, we'll learn together. We grow together. That's right, I'm not out of line one to just once I want to thank the doctor and I will promise director Melody McClintock. She's carrying the baby will be Seattle supporting someone has baby and they also qualify for Seattle promise. So that's pretty cool District as staff for all of your partnership and work on this and negotiating the agreements and the and I also want to thank our counterparts over at the Seattle school board for their unanimous approval of partnership Agreements are really excited about being able to move this forward and excited about presenting this these resolutions in the final overall package to full Council on Monday right after Make these motions. So be here to watch you. Take it over the finish line. And no thanks again to you and can remember Johnson even though he's not here. We see his work reflected in the work you guys did previously so thanks to all of you for your incredible work, but for allowing up me to play some small part in this as we move this forward. Thank you for all your support as well. And of course thank you to our former colleague Health number of dots and who was really instrumental and helpful to me in being a partner and thinking through how we're going to Shepherd the process and how we were going to navigate relationships. And ultimately what priorities should be in place. So definitely if he's watching thanks to him for that and we'll make sure that he's part of the after party next Monday 2 to make sure that he's also acknowledged for the tremendous amount of work that he has contributed to this level as well. That being said I'm going to go ahead and make a motion. I will move that the committee recommend the city council resolution 31881 II AI recommends that the city council passed resolutions 31881 by a unanimous vote and next. I will move that the committee recommend the city council a resolution 31182. d118 did I say something wrong? Before I call the store. It's not 31182. Okay. Okay. It was it was I was looking at a different script in the number was incorrect. I move at that the committee recommend the city council about resolution 31882 second day. I opposed the committee recommends by a unanimous vote of this coming. So now I will move to suspend the council rules so that Council Bill 101 9480 and resolutions 31881 and 31882 may be considered this coming Monday. April 22nd supposed rules are suspended and the suite of legislation will be considered on Monday April 22nd 2 p.m. Here in council chambers by the full Council. That is a that is a trap. That's a wrap for this. So congratulations to everyone. That is the last item on our agenda there being over their business before the committee. We are adjourned. Thank you.", "end_time": 6362.5}]}