{"format": "raw", "annotations": [], "confidence": 0.9369238163973834, "data": [{"start_time": 0, "text": "All right. Good afternoon. Everybody. Can everyone hear me? Okay, good mic is on so I will do a call to order good afternoon. This is a special meeting of the select committee on the library Levy. The date is April 17th, when the time is 2:38 a.m. Council member Juarez chair the committee and I enjoined by council president Harold counselor Mosqueda casserole. Bryan. Thank you all for being here today. I'm going to briefly make some comments and the chairs report. And I'll start with last week. We held a public hearing and a big thank you to everyone who had an opportunity to show their experiences concerns and support for a library programs last Friday. The final Amendment proposals were sent for review by Asha are Central Stafford and the Law Department by one of at this time. Thank you very much for the great work that she's done as well as Nikki my staffer. I want to thank my colleagues and working so diligently with us to prepare and bring for this legislation in the proposed amendments quick background. Again, we were working with the library and talking about the four major categories and this history goes back to 1998. Of course the level that we had in 2012 and now we're looking at 2018 and we should add that in 2018. The library did do an assessment survey. We want to thank the library Board of Trustees. It's a volunteer Board of five members who dedicate their time and effort to making sure that they give us policy and Direction and for the public so the lie on my focus and make sure there were clear that the library Board of Trustees has exclusive control over Libor expenditures and allocations changes in intense scope and policy regarding the use of funds for a specific purpose and subject to board approval there to other organizations. I want to thank as well and that is the friends of the library and the Seattle Public Library Foundation these three amazing volunteer organizations help again guide our city and our elected officials on how to best plan and use one of our most valuable and public assets. That is the Seattle Public Library system in which we have 27 of them today. We have three critical amendments to the base legislation. So I want to thank councilmember Gonzalez council member O'Brien and counselor mascara for working with our office and nausea for coming forward helping us draft and I'm actually put together. I think some pretty good amendments and some pretty good legislation. And after that I understand we believe we possibly have to we do have if all goes as planned we'll have to propose technical minutes to reflect any changes that we make today today is the fourth and last committee meeting for us to deliberate on these proposals before I conduct a committee recommendation in its entirety for the April 22nd city council agenda for a final vote, which is Monday, right Monday. I can do the whole recap. I'm just going to add this cell in the last 2 years or sale Public Library hosted at least six major Community conversations or town halls and meetings and they have ran a survey that help more than 26,000 responses on neighborhood priorities Citywide and also several meetings with the city that are firm the following priorities again for investment open hours and access collections technology in maintaining clean and safe buildings. I see you took out the word seismic cuz you know, I kind of really can't say that earthquakes and say it thank you the proposal continues critical operation and expands on services to keep up with growth. This proposal is based on these four criteria and encompasses 25% of the entire Library budget before we discuss amendments as chair is important for me to remind everyone our role as a legislative body in the levy process a final Council. Determines the final proposal for a library levy on the August 6th ballot for the voters to decide whether or not the Levee is implemented. I want to thank everyone again for their hard work and their hard work to find ways to improve this Levy. So with that that's the chairs report and again, can you please read the first item into the record? Cancel bell 11949 1 and ordinance relating to regular property taxes providing for the submission to the qualified electors of the city at an election to be held on August 6th, 2019 a proposition to lift the limit on regular property taxes under chapter 8 4.55 RCW and authorize the city to Levy additional taxes for up to seven years for the purpose of sustaining investments in Library operating hours collections technology and maintenance while expanding access to opportunity through additional hours Library materials and technology and undertaking seismic retrofit SO3 Library Sicily's authorized in creation of a new fund and ratifying and confirming certain prior Acts. Is so what we're going to do today is once you read into the record, we are going to have Asha TS up, correct? And then after that we are going to defer to the council member whose Amendment where we will be discussing so I will hand it over to usher for a moment or more than a moment and then I will have cancer and reconcile House address for a minute. I'm Awesome, north Council Council staff. I'll just do a quick overview of what we discussed a previous. Committee meetings and then speak to some of the Amendments. So on March 28th library presented its proposal after the renewal of the Levee to collect 213.3 million dollars over the next Bobby. On April 8th. The committee discussed issues that were done by by Central staff in addition to potential amendments that were considering bringing at our last meeting on April 11th. And we again discussed more potential amendments that council members were considering to propose for a vote at the last meeting. There was some discussion about understanding the role of general fund versus love you tons and how those to support libraries operations and it's all just be quickly to that general fund has not been displaced as well as a large. For the most part by Levy funds over the past seven years. There's been very little displacement intentionally made from General fun to Levy funds for the most part that the general decrease in general funds has been through reductions to allocations to general fund rather than displaced by Levi funding. So if no one has any current questions, I will just provide a quick summary of the five proposed amendments that are up today for a vote. There are three proposed amendments from Council Members one to expand the play & Learn program by consumer Gonzalez to add more hours system-wide as Bounce Back cast member O'Brien and want to expand the community resource specialist program a sponsored by council member must Kayla if any of these amendments move forward will have to make to potential technical amendments 1 to update the amount of the tax rate as so it's reflected accurately on the ballot and 1/2 potentially add 11 category with that. I will turn it over to the sponsoring council members. Yes, go ahead. Thank you. So as it relates to the issue of the proportion of Levy funds to the general fund contribution. I understand the answer to the question that was asked last time is that there hasn't over the previous Levy been a displacement of Levy funds with General funds with Levy funds in increasing the portion but this proposal both the marriage proposal and the proposal that might result after the council's actions today would in fact result in significantly more funds becoming a percentage of funds coming from from the levy was Prior. We were around twenty-four 25% of funds coming from from the levy we would be looking at between 32 and 34% Would increase the amount of funds coming from the lobby, but it's that's not associated with a decrease in general fund. It's just that there are more services are being funded so that the increase in the proportion is proportional to the services that are being provided by the levy funds. So my follow-up to that is is there is there a policy behind the previous mix of Levy funds with General funds. It was did the set that concept of 25% of the library's funds coming from the Levee did that originated from some policy that we decided that the 25% was a good number because if we're going to change that proportion I'd want to know that that is not that there aren't unintended consequences resulting from that. I believe the board has has stated that as long as it's under a third of the overall funding that is the number of proportion that they are okay with so and I believe that is the case moving forward even with the added amendments. I think you're fit. Okay before we move forward and I apologize Katherine Gonzalez, cuz I know you would cheat up to talk about your Amendment. We neglected to do public comment. So let's go ahead and have how many people we have signed up to people signed up and please state your name. When you come up and please address your two minutes to the item that is on the agenda, which is the library Levy the first person we have signed up as Alexander man than and szczesny. Because my dirty truth and that's it. Got to be true. Wreck-It you a criminal. And who you are? I kill her station taxation is better for government. Exactly for the people like you can make under $30,000. In minions is simple. It's a multi-millionaire. So Taxes is very stupid from Vegan Fest enough money in government right now is a double money for another six or seven years open Comcast Comcast a monopoly and I'm 30 and Comcast service suck blood in my life, said no one no one talking about in negotiate contract with Comcast is very simple. So going to be negotiated with this a Monopoly Deluxe Corporation with your fascist together with you psychology Library. I would like to ask him to stop stop the car for one second. Mr. Zimmerman. Mr. Zimmerman Comcast is not on the agenda. You have 42 second Mysteries ever been you have 42 seconds to speak to the agenda item. I'm giving you a warning now and now I stop the clock on your behalf to accommodate you. We were talking about the library Levy now when you're ready to talk about the library Levy, I will turn the clock back on we are here to talk. Okay. Are you ready? Are you ready? Okay, go ahead. Wait, hold on. Go ahead and start the clock and now you can go. BMW is a stupid idea. And I'm against this we can do a different way and I talking about with this many time when we give 50% of people who live in CT right now if you make less than $40,000 $10 for internet for another 7 year will I need library in first place in for many year compared in a talking about this in every statement. What is a go for the election? I told him you'd stopping Comcast for $10 was for everybody. Thank you. Mr. Zimmerman. Excuse me. If you okay I want the d Mister Zimmerman's Behavior disruptive. He just said f you to the entire city council, so let's nothing on the record and let's make sure we report that because again our job here is to allow people to come here in a safe space to have dialogue to talk about the matters on the agenda and my job as the officer in the chair of this committee is to make sure that people speak to the items on the agenda for 2 minutes and to enforce the rules pretty simple pretty straightforward who is our next individual ancestry next. Ayan tell us when you're ready. I'm ready. My name is I am the President of the Seattle public libraries Union and I'm a librarian at the Central Library. I'm here on my own time in my capacity as a union member to speak in support of the amendment to increase the social service presents in the library. Thank you very much for putting on Amendment forward as a library and I can tell you from experience that is very difficult right now balancing stresses that we face in our community with a traditional Library services that we provide and you can imagine when you're helping somebody with a report on black holes or to start their business or to find a good book to read and there's another Patron who's in crisis in the building right there. You can't do both of those two things at the same time. It takes credit bit of time to adequately serve somebody who's in crisis, whether they're experiencing a mental health issue, whether they've been waiting in line for hours and hours for new ID and then we're unable to get it looking for housing and are fearful about having a safe place to sleep having an integrated Network in the library where we can meet people Social Service needs through Social Service program assistance our security team and their libraries such as looking for a job finding a good book and getting a little escape from those problems is extremely helpful. And I really appreciate your entertaining idea. Thank you. Thank you with that. I think public comment is closed. And again, I apologize for the error on my part and I will never yield to our sponsor of the amendment cast member Gonzalez. It's all yours. Great. Thank you. Jerry Juarez. So this amendment is the first amendment for our consideration that today. I'm really excited about being able to be the sponsor for this particular Amendment which would provide resources to grow early literacy programming at Seattle public libraries specifically in the play in their in groups area. So this is just to be clear in existing a program and service that is offered at Seattle public libraries. And my interest in intent here is to allow for the expansion of that program to continue to promote these really important early literacy opportunities particularly for kids in that 023 space. So that is what the intent is here. And I'm really excited to be able to advance us a really quickly. Just wanted to talk about what Play and Learn is and how this is an evidence-based practice. And also speak a little bit more Ted that usage in the importance of this programming across the city and so compiled some packets for each of you to take a look at that includes all this information. So what is Play and Learn Play and Learn is facilitated play time for very young children from birth to age 5 that is done and provided by a trained providers. It is intended specifically to serve young children and their caregivers or parents as a whole family and whole Community model for early literacy and Child Development Play and Learn and at its fundamental core is as I mentioned earlier in early literacy program that is specifically targeted to provide young children with development and developmentally appropriate learning experiences with their peers and caregivers is also designed to build connections friendships and supports for families with young children as well as their And it provides family friend neighbors and caregivers as well as young parents really important Child Development information and resources that support the optimal development of young children in their growth and ultimately in their Readiness to learn when they arrive in kindergarten. So the top sheet is around the Kaleidoscope Play and Learn program a partnership that has existed between kaleidoscope and the Seattle public libraries for over 10 years. It's program this type of program is is found in many other states Play and Learn groups have consistently help caregiver support the Learning and Development of young children with 78% of those who participate saying that they feel better equipped to help young children be ready for kindergarten and that's why in 2012 our state legislature directed the Washington State Institute for public policy and the University of Washington's evidence based practice Institute to identify evidence based research based and promising practices. Says for preventative and intervention services for children and juveniles and a child welfare Juvenile Justice and mental health systems and to No Surprise the Play and Learn group model has been consistently identified as one of those promising practices that merits additional investment next behind that page. There is some information related to to be used by our community members of these early literacy programs and the type of committee members that are being served. So you'll see that there is a sheet here that talks about the demographic information related to those people who participated in the existing five groups of Play and Learn other of 649 children that participated and 564 adults that accompany those children current branches exist. It leaks current programs exist at Lake City, Rainier Beach Columbia. Columbia City, Beacon Hill and Broadview and as you can tell from the data, it's an incredibly diverse set of people who utilize these Play and Learn programs and really importantly there are significant number of low-income families that also utilize the Play and Learn a program. And of course really important to me is the fact that in most instances a primary language that spoken at home by people who take advantage of these early literacy library programs is is really really high. And so again at currently SPL hose female groups Play and Learn groups in two districts only that's District 2 in district5. I've already mentioned the number of children that serves investing and expansion of the Play and Learn groups would strengthen programming in these districts two more libraries as well as expand the three branch locations in District 1, so it would also give the library to pass. Increase the number of plane land groups in a different types of languages just learned that it is incredibly heavily utilize program and one of the things that I found really remarkable is learning exactly how the story time and Play and Learn groups are used and I provided information to Folks at the very back of this packet that talks about the number of programs that are done through the existing funding in 2018. There were 2866 programs that were completed in 2018 with a total of 106740 people attending these these various a storytime programs. I also break it down by district for folks so that you can get a sense based on your own districts. How these a story times and Play and Learn grapes are actually utilized at your local libraries in your districts in it. And it is definitely used very very intensely and many many districts with District 5 being the one that is the highest user of the services with 28,000 20924 people who have used these programs in 2018 in District Six is the second highest user of at the services at coming in at 20,000. So again, really popular programs, I believe that the families who are asked to and the voters who are asked to approve this Levy would see this is a very wise investment of their tax dollars to continue to invest in expanded in these really important services that will really Provide an opportunity for both parents and caregivers and children to continue to focus on in language culturally competent literacy opportunities that are supported by by promising practices and evidence-based strategies. So again in the you know, really honestly in the absence of accessible in the horrible infant care how many folks are turning to their networks of caregivers family members and in neighbors and friends and we know that it's really important to provide as many resources as we can to those caregivers to ensure that the development of children as they get ready to enter into preschool and kindergarten will be best prepared to do so and in this instance, the Research indicates that these playing learned groups actually increase by a significant percentage the number of children who lack Transition from these types of programs into Pre-K and eventually be ready for kindergarten as well. So really excited about this particular proposal and excited that we can invest in the significant meaningful way at an average annual cost to median household of $0.84 on top of what the current Levy is currently structured to cost taxpayers and the argument I was going to say something but So you stuck in this working so closely with the library folks and nausea putting together the demographics breaking them down by District. It's just it's it's a wise investment. So thank you for the work that you did. I really really appreciate that. So we have it so moved and we haven't seconded. So so I asked that we moved the committee pass the proposed amendment number 1 second. The motion has been moved and seconded again income from Gonzales anything you want to say in conclusion. I'm just really excited about this and it continues to do I think I reaffirm this council's commitment to making sure that we continue to invest in our littlest Learners and this is a really important Way for us to continue to do that. Not just there are families and education Levy but also by investing in a libraries were all of the literacy materials reside and then again, I think this will also invite and what we have heard from library staff is that these types of programs have allowed people who have who wouldn't ordinarily take advantage of Library Services is attracted those community members take to use the library and and I'm really excited about the opportunity the entry point this provides two new families to be able to experience the joy of reading and the the joy of using our Public Library System of this amendment say I suppose note the eyes have it the motion passes in the comitia. Men's Council Bill one 19491 to include amendment number one thank-you councilmember Gonzalez Okay. So now I'm going to actually follow my script and not throwing again off again. I shall can you please read the amendment the next Amendment member to to the record and give us a short briefing on the stipulations and then I'll yield to our sponsor counselor O'Brien recital to the ordinance that signals council's intent around this funding. So it reads in the 16/8 in attachment 1 on the first page doesn't want them, whereas Council intends that by increasing the amount of the Levee by $2000000 120. Sorry to 120,000 $760 over the 213.3 million as transmitted funding will be allocated to support a new Levi category for supporting children, including one expanding Play and Learn programming for children to there are several options provider. This is a atom Amazon Speck on summer O'Brien that has three options. The first would be to open the Central Library for an additional hour Monday through Thursday option b would be to open all the branch library's by an additional hour Monday through Thursday and both of those options include Staffing upper Rick Soto Staffing an option C would open both the central branch and the 26 Branch library's by an additional hour Monday through Thursday with the appropriate custodial Staffing. Thank you. Thank you for preparing us for me and I'm either use a couple numbers here. So please chime in if I get them wrong here my recommendation Collingswood be to go with option 3, which would be to extend initial Hour 4 days a week at all libraries that would come at a total cost over the life of the levy of about 6.2 million dollars which translates to the the median household homeowner. Is that the XO meaning home owner of $2.47 per year. I look at the cost to the to the average homeowner compared to the benefit we get and it seems like for the someone said for the cost of about a bus ticket a year, we could have additional service for writing folks across the whole system. That would be Isn't it be curious to hear folks are supportive of that an alternate that I would propose is option b, I believe that the 2nd of them which would be to do they send the hours at the branch library's only at a cost of a little under 2 million dollars and to the mouth about to get a little over $2 a year for the median household on the back. I would not recommend doing exclusively the downtown library, but not the branch library. So option when I would not put forward for consideration. I guess I'd invite discussion from I got to confirm. I just put an amendment for it and see what happens with some discussion might be nice to just as much as possible. I'm also concerned about ink Sing the amount of this Levy. So I am inclined to help the branch library's not that I wouldn't love to have my own Library, which is the Central Library open. But if we're if we're trying to make a balance here and make a decision and be wary of getting it up the library total amount of too high for the levy. I would recommend and would consider option be at this point. So I'd love to hear from my colleagues and comments that you have anyone before I speak any other option b as well again, love the Central Library, but I also think that this is a Citywide lovey that is designed to make sure that there is access to our libraries across the city. And so to me it makes sense to focus on the all Branch library's option that is represented in option b to ensure that the voters and Residence Inn users of Library System feel as though He's lucky dollars are going to be equitably distributed throughout the city and that they will see the return in terms of additional hours at their Branch library's if anyone else if I speak Health River mosquito. Thank you very much. I really appreciate what you've put forward here comes when will Brian including option. I think that as we look at trying to increase taxes, especially to one of our highest utilize libraries in the downtown core. I'm you've Incorporated not only that the central core but even cortical Incorporated all branches. I too would love to see that approach. I think if we're going to go down the route of having to scale back to be socially responsible. I understand where you're at in terms of option b being out there. Of course, I would love to support the full extent of your amendments are happy to support option b if that's the the the direction of the body Okay, I'm sorry about why the library considered it but not did not include this proposal in the marriage proposal. I believe it was the mayor's office decision proposed proposal. So it was actually the marriage decision not the library saying hey, we don't want the pain of amendments. Thank you very much. I appreciate all of them and also giving me a menu of choices after having discussions with the library folks and the foundation folks and my colleagues and hearing the comments of councilmember bag Sean. Kazmar Gonzales. I too am concerned about the cost of the Levee in the taxpayers and voters and what we are and trying to keep to those for Boys that are most important to us into all obviously to the people that hopefully that we're this Levy will pass so I am too going to ask that we look at option b that is what I would be recommending is option being this is what I would be voting for anyone else. Okay. so I move that the committee Papa Kaminsky. I haven't heard from others less folks have strong feelings additional hour at all of the branch library's but not the Central Library. Where is Council intends and theft by increasing the amount of the Love You by 2512000 dollars / the 213.3 million as transmitted funding will be allocated to support open hours and access by one opening the 26 library branches for one additional hour Monday through Thursday with appropriate custodial Staffing. Excellent. That is my motion. So with that I know you're on crack if I get this wrong, I move the community pass proposed amendment to which is now option b, correct II okay. The motion has been moved and seconded cancel my brine. Is there anything else you want to add? Thank you. Sure. There's no further discussion. All those in favor. Say aye house. Now the eyes have it the motion passes in the comitia. Men's Council Bill one 19491 to include amendment 2, which is affectionately known as option b Thank you. All right. I sure you want to go ahead with the third one proposed amendment 3 and it would expand the currently existing community resource specialist program to add youth service support that would come at a cost of 1.1 million dollars in addition to the proposal. I thank you very much my timeshare. So I want to first start by thanking you madam chair for the work that you've done with our office over the last few weeks. I'm really excited that were able to contribute to that these minimum desired benefits that were including in the Levee this year as we move forward. We know that we would love to scale up on so many ideas that have come forward and you're with your help and with the Lord's help. I think we're trying to stay within a certain frame work so that people understand what's both included in the Levee and that is a possible number. So we had initially right forward for your consideration a feasibility analysis of trying to see which of us. Are libraries across the city could include a childcare facility. I'm not bringing that for today. Look forward to working with our Council colleagues and through the budget process in the future to see what's possible in terms of a feasibility study on that are we had considered bringing forward to additional security guard. So that folks were both working in our libraries and also patrons are libraries continue to feel safe accessing all branches again that something I look forward to talking to you all about and the folks were on the direct directly working within the library is as well to ensure that we're getting the information we need as we think about additional budget items and then lastly was really underscore by one of the individuals who came to testify at your committee last time we met and that was Paula Becker who talked about her child and the love of libraries. I'm growing up having her kiddo a go with her to Story Time and always having a love of libraries and unfortunately, I'm due to addiction ended up using our libraries at the day Centre as many folks do if they are both experiencing homelessness or having a The health situation unfortunately, sometimes coupled with addiction we want to make sure that as folks access are libraries. We have the resources necessary to connect them to the services in the community that can help stabilize people get them house and get them back on the road to recovery. So this is really exciting. I think blending both what we've heard directly from the Librarians. Thank you very much for presenting. Thank you to the board and to all of the work that you've done over the last few weeks to try to really help us cope this effort. I think this is the top priority of the ones that we brought forward. This would allow for 1.5 ft. He's to be added to the resources as a community resource specialist program to identify one use focus social worker and a half time. Use Focus caseworker currently has you know, the library contracts to ensure that there is some roaming staff both at the central library and the Rainier Beach library and having her directly from the folks are working within the light. There is a deep desire to make sure that in high-need locations like in dollars Lake City and and and you in University District that we treat a safe and accessible environment and meet the needs of our patrons love the idea of connecting people with programs and books. And in this case also with the life-saving services that are city is also offering so I'm really excited to bring this forward. I think that this is both continuing to enhance the type of services that our library is maybe not known for cuz we always think books for the types of programs in the connection in the community that they actually create in the walls of our public libraries across the city is a tremendous asset to our community. Our residents are families and out with your Indulgence that I'm sure I'd love to move the consideration of amendment 3 option which would only be $0.04 a month to add this incredible new resource. Haitian council member O'Brien, are there any more comments for my colleagues? Okay. So then she might like Walmart getting us to this point of having a really tight proposal that also having it be robust in quality and I want to sing Asha for your quick work with our office my office. FM Aaron house for working with us and really the direct Librarians the folks on the front line. So I asked me Council to for your identification of what you'd like to see to help make sure that our library continues to serve our residents at our patrons and our Workforce very excited to work with you and I'm sure to bring this forward today. So with that I'm going to forward and was the committee pass proposed amendment 3 by council member mosqueta, and I want to thank you too. Cuz I know we had long talks about how this is going to work and I am really appreciate you and your staff working with us right up until 8 last night. And then this morning again cancel a mosquito was calling me to make That we had this nail down. So I moved between E-Pass proposed amendment number three have the second the motion has been moved and seconded Catherine skated, you want to wrap it up and then we'll go to the to the actual vote really did that. Oh, okay. All those in favor. Say aye for Asha. It was your doing great. We just need to put it into the record. Oh, okay. I'm sorry. I don't have said the proposed language that for a vote is a motorcycle cost is whereas Council intends that by increasing the amount of the Levee by 1149992 dollars. / the 213.3 million as transmitted funding will be allocated is Bart open hours in Access by to expanding at the community resource specialist program with support for youth. Okay. Now, I can move to a vote right in the game. We okay. Thank you all those in favor. Say aye. What motion passes in the Canadian men's Council Bill 11949 one to include counseling mosquitoes amendment number three well done. Thank you. Okay, so we're going to move forward on the two technicals. And now these are my understand we have two technical amendments about changing the Olivia amount which I'm understanding that Asha has been doing a calculator down there. And also I'm in at number five and be adding the Levee category and I sure I'm going to let you kind of take over on this part cuz it involves math and I'm not going to so in the ordinance as it is currently drafted and the tax rate in as allocated in section two. So this is on page 3 of attachment a in section to the sentence of being amended is the proposition shall be limited. So that in the first year at the city shall not Levy and additional tax rate of more than 0.119 cents $4,000 of assessed value. The amendment would be the change that to 0.1 to $0.02 per $1,000 of assessed value. And that same change would be made sorry that same change would be made on page for under Section 6 at the Levee and this is what will go on the ballot and the sentences the 2020 tax increase up 2.119 per thousand dollars of assessed value, and that would be changed to 0.122 the both of those are proposed amendment for just so I understand then so we're going from 0.119 to 0.12 to a discussion. I'm with the committee pass proposed amendment 4. poches Boudin second then any further discussion All those in favor say aye those opposed know the eyes have it the motion passes at the medium. Men's Council Bill one 19491 to include a minute for which change the living room out additional tax return more than 0.119 to 0.1 to 2% with that. We will move to our final technical amendment number 5 adding and Lennie category and I show the floor is yours. So this amendment section 4 of the ordinance first, it would expand on the central says love you investments will be made in five categories of Library services at instead of 5 lb 6 and then the next sentence program an element's and subsections 48034 e e that is change to M subsection 48034 F and at the end of page seven, you will see the addition of eleven category, which is a subsection 4S supporting children. Program elements include support for programming targeted towards children ages 0-2. Sorry, that should not be 3 that should be 5. 0 to 5, okay. Can I ask you a question Tasha? So this is reflecting customer Gonzalez's which we passed. I love the committee passed. Would you have to say anything else before I move? Okay. I just want to make sure the game doesn't interrupt me hear. I move the committee pass proposed amendment technical amendment number 5. Oceans moved and seconded any further discussion I seen none all those in favor. Say aye I don't suppose they know the eyes have it. The final action is the motion passes in the comitia. Men's Council Bill one 19491 to include the technical amendment number five. Alright, so now that we've done the Amendments we are going to go to the actual final passage of the amended bill of the original base legislation. So I don't want to start even read into the record. We need to do it again. I don't feel it's right in there. I could refine go usually all got opinions. As long as you're okay. Good. I don't want it's been read into the record cuz that's what my script says convenience as a man. I'm getting there a move the committee pass cancel Bill one 19491 as amended motion has moved and seconded any further discussion for any of my colleagues regarding the library Levy. Councilmember Gonzales. Thank you. I just wanted to Echo cast members get his thanks to you Jerry Juarez for your work on developing and shepherding through this this piece of legislation. And I also want to thank the folks over at the library including the Board of Trustees for for your ongoing stewardship good stewardship of these really important investments in our Public Library system. So really excited about the next step and and really honored to be able to be able to advances to the next to the next face anyone else. Okay, so if that there's no further discussion all those in favor. Say aye aye one 19491 as amended. And without a think we're done. Wait. Wait, don't leave yet. I got one more thing to say, so I'm just glad this is over. It's been a pleasure working with my colleagues. It was really nice working with Asha Asha great job and all your research. Thank you, Auntie and your staff. Thank you. Jay. All of you. Folks have been great getting this information, and I want to thank the council members who did the Amendments cuz their staff was phenomenal and getting back information and working with us and editing editing and rewriting and I'm always proud when we all work together and things get done. So with that before we adjourn I look forward to discussing the proposal in its finality to the April 22nd city council meeting for a final vote to be placed on the proposal on the August 6th ballot and was that we stand adjourned. Thank you. Thank you.", "end_time": 2842.0}]}