{"format": "raw", "annotations": [], "confidence": 0.9369150045278826, "data": [{"start_time": 0, "text": "Good morning, and well and welcome to the special meeting of the elected leaders group for the West Seattle and Ballard link extensions. This group includes Sound Transit board members members of the Seattle City council the Port of Seattle and is a meeting of this city of Seattle Seattle City council's sustainability and transportation committee. I also want to make sure that you realize there are interpreters available. I've been looking forward to this meeting because we get to do a deep dive into two key areas along this project Corridor the communities at that surround chinatown/international District station and the Delridge station. Both of these communities were called out in the racial Equity toolkit. And we the elected leaders group members felt it was necessary to spend this additional time understanding the alignment in station Alternatives in these neighborhoods particularly informed by Community feedback. I have the privilege of representing both of these communities on the King County Council to chinatown/international district is a unique cultural Community both in the city and in the larger region, and they have endured a disproportionate share of impacts from infrastructure projects over the last century in Delridge is truly a community of smaller neighborhoods stretching from North Delridge where we where we will be discussing a location for a station include Youngstown North Delridge High Point Rock Hill South Delridge, Highland Park in White Center, which will all be served by the station and cord or Community participation is crucial to the success of any project in critical and essential to this project. I look forward to hearing from members of the public who are here today to offer their public their comments and testimony as well as from The Sound Transit staff who will summarize the feedback heard through the community meetings and I'm work process that has been I'm going on since the last elected leaders group meeting engagement has been robust and there's a lot to do to be ready to move forward. I want to thank everyone who's made comments thus far and remind everybody that scoping. Is open until April 2nd and thank you for participating in this transformative project. And before I turn it over to my co-chair Michael Brian with the Seattle City council. I'd like to also acknowledge that this is council member Rob Johnson's last meeting the Leaders group Rob we wouldn't be as far as in this working Sound Transit in any sense without your involvement in your support both figure out to get see within Transit and st-3 in particular as a board member and Ella member this elected leadership group, but your advocacy and work as a public servant throughout the region as a Seattle City council member I've championed and I've appreciated I want to thank you very much for the leadership you provided. I'm with that mic. Thank you Joe. I want to start by asking for interpreter would like to make an announcement about interpretation is available. Thank you both so much. Jose thank you for your introductions calling to thank you all for being here public. I want to just remind Folks at today's meetings this combination of a number of conversations that have happened over the past 16 months highlighting key opportunities and challenges that we face in this project Corridor the racial Equity to kid help highlight the stationary as we will discuss today as key areas to dedicate enhanced engagement in an analysis efforts. We were here today about Community concerns and inputs to help us decide what to continue to look at as we move through this process building Light Rail and are dense and dynamic city brings many exciting openings to address Mobility change, but he's opportunities are not without near and long-term impacts. The elected leadership group is sought to determine how to maximize the promises that light rail brings two communities Mobility housing community and Civic development will also maintaining Community character and the Deep cultural historical character of the neighborhoods. The train will serve I think everyone for the engagement and Analysis that is cheap. This project to this point there's more work to do but so many possibilities to explore to make this project one that will transform our city will maintaining the assets that we love about our communities want to thank all committee members who spend time talking with us and Sound Transit by participating that project this far we're going to get into public comment in a moment before we do that. I've been handed over to Peter rogoff how to make some comments and we're going to go through three or four slides as a high level overview is part of the introduction and then in about 5 minutes or so, we'll jump into public comment and I have about a dozen people that have signed up for public comment. So sit tight if you wait until public comment and Peter take it away. Thank you. And thank you coach Arizona Brian and McDermott and really thank you to all the members of the elected leadership group. This is been an extraordinary commitment of time and effort around a very very important project and I are particularly want to thank on behalf of the staff of the elg for scheduling this meeting today as we're discussing to The more vexing challenges in figuring out the right future for Transit through through the city of Seattle these two two communities that chinatown/international district and Delridge obviously have a very rich history a very rich culture that must be recognized honored and respected through this entire process at the same time. We have a requirement to be mindful of cost and schedule in moving the project forward and delivering it to the people so that all communities could actually enjoy Light Rail service, but importantly those to imperatives deed and not be in conflict. But that's where this work comes in its figure out how to deconflict any challenges between cost and schedule and what these communities really need to succeed through this process. So I really appreciate you scheduling this meeting so we can do just that and gather all the facts here from the communities in their entirety and I will just say I know I'm among many on the Sound Transit staff that look forward to listening intently on what we're going to hear today. I'm not just obviously from staff and most importantly for members of the community. Thanks very much. Good morning LG members. My name is Diane Adams. Good to see you. All again. Thank you for coming in this morning just for our benefit. I wanted to just review our agenda for today. Our meeting structure is a little bit different than we can flow from there. Just so we all have the same expectation. The first thing is that we're going we have until noon today and a fair amount of content to get through basic, you know, including feedback on the Chinatown International District station planning process until Ridge station as well. So our structure this morning, if you look at your agenda will get to our welcomes Cahill and Lita will provide just a few slides to set the context for where we are in the process and where we are with equity and inclusion Outreach, then we'll move into public comment on the Chinatown International District station planning process. Then we'll move into at 9:50 move into the the presentation material from Cahill Lita and Sloan, then we'll close out our discussion and presentation review around chinatown/international District. Then we'll move to the Delridge station process while we'll move into public comment open with public comment and then repeat the same kind of presentation feedback process there and then hopefully adjourn by noon that makes sense that that process. Okay and just a note for today. There is a lot of content Sound Transit is not looking for recommendations from you today. This is kind of a special meeting to talk about the station planning process Within These two neighborhoods. And so while we want discussion, we do have content to move through and so will want to make sure that we're able to share all of that with you. Again, interpret interpreters are available for the public comment period is needing I think that's where I'm gauging that so with that kale. Just remind you where we are in the process. This is an overall look at a project about on processing the green you see the planning phase which extends from 2017 through 2022. And as you can see, we're right at the start of the planning phase. Did you go into the alternates development work over the last year? They already scoping we're just Kearney of the scoping. And of course, I'm moving towards Port identification of a fertile turn to another alternative is that would then be studied in the environment review face, which is coming up next time which which which which would extend through 2022 after that we get into design from 2022 to 2026 and then we move into construction from 2025 to 2035 at spending on the project at the overall goal is to start service to West Seattle in 2030 and about a road in 2035. This is a look at our chart which Ipsy many times explaining our communication and collaboration process over the last year. It's basically broken down into three sections the first part of it if you look at the top is level one alternative screening which was in the first part of last year. Then we moved into level two alternative screening through the summer in the fall and now we are in level 3 alternative screening and as you can see along the left there we've been doing Outreach in various ways. We've had updates to the community along the way to open houses to Neighborhood forums. We've had a stakeholder Advisory Group, which is matched pretty much monthly through this process elected leadership group, of course, and of course I breathe The Sound Transit board. So we went to an alternate has our little one alternate screen process made our level on recommendations back in April of last year. I was followed by going through the same process through the middle of last year and level two recommendations in September in October time frame and now we're at that point over on the right of this chart where we're moving towards Going into making the next set of all X level three recommendations next month in April. But today as was described as a special meeting to dig into some of the issues specific to the Chinatown ID and stationary. Mm. Building upon the opening remarks and to provide additional context for this morning's discussion. I'd like to once again review an important aspect of her work at Sound Transit and the planning process for the West Seattle Ballard link extensions are work on equity and inclusion as we shared before we're pleased to be building our partnership with the city of Seattle during the alternative element phase to apply the racial Equity tool kit together with a cross agency team to this project representatives from the West Seattle Ballard Sound Transit team both from external engagement as well as the technical team have been meeting regularly with the city's team from the including staff from the office of civil rights office of planning and Community Development S. As well as Department of neighborhoods, we've been engaging regularly and our structure has focused on data analysis as well as Community engagement with the idea that we'd like to strive to provide information that data alone cannot provide. So just to take you through the year during level one evaluation. We did data-analysis Maps the concentrations of communities of color along the project Corridor, you'll see from the map on the right. This map is demonstrating those populations and it taken from the American Community survey, you'll see that the chinatown/international district station area is the one stationary along the alignment with that level of intensity in terms of communities of color. However, we looked at the Delridge station as well and there are communities of color that are theirs dense populations of communities of color further south of the Delridge neighborhood and that would be served by the Delridge station through bus or bike and other sort of modes and connectors and that's informed our work over the year. We also determine shared outcomes, which I will share with you in a moment as well as updated our screening criteria. So that was in our first phase of work. These are the racial Equity toolkit outcomes that we've been working towards we looking at enhancing mobility and access for communities of color and low-income populations creating opportunities for Equitable development that benefit communities of color avoiding disproportionate impact on communities of color and low-income populations and meaningfully involving camisa color along, populations in the project during level 2. We share this memo with the public with the stakeholder advisor group and they elected leadership group that captured both how we measure connections potential impacts and opportunities as well as Community feedback about those options again with the idea of trying to provide information that data alone cannot provide about these Alternatives and how they might benefit or Britain these communities And all of that work through level 1 and level 2 has really informed what we focused on in level 3 in the Chinatown International District. We heard repeatedly themes about for the chinatown/international district station in about limiting harmful impacts maximize and connections for all users and how to support a hundred your vision for the station. And additionally I'll add that the idea that the station is serving from Pioneer Square to the chinatown/international destruction to Little Saigon that the station is really an opportunity to potentially renege communities Delridge. We heard repeatedly about bus real immigration again that idea of serving those communities of color looking for their South as well as Equitable transit-oriented development. with that Public comment so folks we are going to jump into public comment specifically focused on the Chinatown International District right. Now. If you have general conference, this would be an appropriate time to make it if you hear the comment on the Delridge alignment. We will come back to that when we're finished with his chinatown/international district presentation folks will have two minutes to comment. I'll call names you can come up to the table as your name is called Alexander when you're going to be first, you'll be followed by Justin Clark and then Micah Winkler chin. Zip code of my 30 shooter get stopped up pig. My name Alexander man. I'm sorry. I called you pick because right now everything but the step in here in exactly and see you at though in caen Contee. I Look to me like a animal farm, you know, what is men big and chicken? So it's exactly what's happened about look up and right now it's all internal Chinatown. Go to another Chinatown, you know, what is a billion dollars this finds you could use this money or Corporation in Council is very simple how we can change this. Can we change this exactly we can but not right now why because everybody cuz it in this room right now or criminal or support criminal, for example, I give you classic example. City council Gonzales bail a constitutional or five times in court recognizes why she said care in make decision with another couple. We have a constitutional law in open public meeting up and you also possess people this reflect your decision is it's exactly what this I want speak to you. Are you listen to me? You know, I am a nobody. I know they're 2700000 you listen to know right now now I speak to everybody, listen to me first before we start to use our money for people for government for better life being it cleanses Dora chamber totally went to be able to answer is maybe after 6 we can make a good decision stand up America stand-up she at though Justin I'll try to keep the energy going here. I'm just in Clark. I'm an engineer on the Seattle design commission since 1999. The commission is served to advise the mayor and City Council on the implications of zesty projects on the book room in neighborhoods in February. We have a joint commission with the Arts and planning commission's to discuss El Cid investment could Elevate the goals of equity placemaking Intermodal connections. Here's some of our observations first construction and impacts of the Fifth Avenue cover alignment will cause significant long-term economic social and cultural impacts on the CID the 4th Avenue and Lambie substantially reduces the technical engineering benefits of the Fifth Avenue line important with the likely long-term displacement in gentrification of the CID is too great. This is equity expensive expensive adjustments to the North and South ends of the represent of alignment are being made to reduce conflicts with the port activities because the poor can't move similarly neither can the culture and energy of the CID and Little Saigon be replicated a relocated. We need to show that culture Community Place recorded the identity of the city just as we're showing Industries important as the city's partner St. Must study environment impacts of all options for the CID including the Fourth Avenue Viaduct replacement and development of an intermodal Hub. Union Station is the ideal Intermodal Multicultural had this use best Meats Estes purpose States purpose and needs Damon's on Equity multimodal connectivity. It's part of the city's responsibility to Advanced equity and it also means fda's expectations about enhancing connectivity where Light Rail buses streetcar commuter rail in Amtrak converge more broadly to the Seattle LG Seattle must develop a vision for the CID station area that creates a unique entryway to the city with all due respect St. Should not set the vision based on their infrastructure needs the city needs to lead SD to follow. It's critical that the communities of the Cid in Little Saigon are not just your stakeholders with division dictated to them but equal partners and leaders and casting and implementing the Further St. And see in the city need a partner to hold Rebus public my last comment before I get kicked out. Finally. We think that the city the county PD is an Amtrak me to create a partnership to leverage development opportunities that elevate culture place in community l&dc did this with their Union Station to Denver. We need to do it with our Union Station. Thank you. Thank you Justin and thanks to all the design condition Freon going attention to this project. Look forward to a future comments to my co you bet so so he's ready Pappy and then Larry Oak. And following the speakers will be Kathleen Johnson and then Tim Lee. Never be ready. Good morning. The green light good morning elected leadership group. We all three of us were serve on the stakeholder Advisory Group and representing. I think we're identified with the chinatown/international district. When we started the process with the stakeholder divides regroup we understood that our role was to review information come to consensus on key decisions and work through project issues as a group. But I'm to be clear the issues around alignment decisions are very complex and have lasting implications as a volunteer Advisory Group the issues in Choices put before us increasingly feel outside the scope of our advisory role. We have not been elected by our respective communities to represent their interest on the SAG. We do not feel empowered to speak for the communities. We've been asked you by sound transit to represented to represent. Where where does working folk and we don't have the time or resources or language ability? I barely function in English as you can tell right now with all the committee members and gather their feedback. We can advise you on the issues to be studied and the outcomes we're advocating for in our communities. But we ask you the elected leadership group members to take responsibility for Consulting with the communities you represent in owning key decisions in the best interest of the people who elected you to represent them and be accountable for those decisions. your buttons on you can go see the will get the timing right. Good morning. My name is Savita ready pasta and I'm on the stakeholder Advisory Group and have been a trustee at the wing Luke Museum since 2004 and I ride Transit almost everyday Sound Transit has asked the SAG to explore level 3 Alternatives and recommend to Preferred Alternatives one that's on budget and one that may require a third-party funding the information on benefits and impacts of each option are limited at this stage of design. So it's difficult to determine which is preferable. Without Clarity or consensus on priorities. It's also difficult for sag members to compare benefits and trade-offs. For example, an option of better access for Transit users versus substantial construction impacts and displacing neighborhood businesses and residents. The SAG has not received enough information about budget project cost and impacts to make this recommendation. We believe that all Concepts presented in the level 3 Alternatives should be studied in the ER is this will also give Sound Transit more time to refine the concepts to include Community feedback meet the project purpose and need and meet project budget requirements. We asked for better understanding about what causes a project element to become a candidate for third-party funding from what we can infer is it simply that elements are over budget because all level 3 designs appear to meet the project purpose and need if third-party funding is required. We ask send transit to design it further study it in the Eis and look at opportunities to reduce cost then we will have more confidence in the numbers. Thank you to be elected leadership group for Consulting the communities you represent for these key alignment decision. German members of the group I think the challenge we faced on the stakeholders group and I'm on the stakeholders group. I'm also a trustee of the way is that we've been asked to agree on a group of Alternatives alignments when in fact what we have are a number of Interest specific to each station and the consequence is that if we are as a group required to come up with an alignment, we run the risk of hitting one neighborhood against another the issues that are important to them having to be paid it off by the issues of another neighborhood tonight. I would argue that that's not really the role the stakeholders group. It's about giving you information about what the stations and the communities need until I would ask that rather than focus on an alignment place before you focus on the needs of those communities and no stations and then let the Tactical staff the engineers Sound Transit come together with that alignment. They're very competent people have been very impressed with the work. They've done in support of the stakeholders group. I think they can make that happen. My father ran a chop. Suey house before 2 years and our menu had fixed combination plates and we also had column a column B in Collins seat. Let me argue that this is an opportunity for us to make some choices between column a column B in, and see if you get all three together you get Eggroll Thank you. Thank you all. Applause is fine. If you get a positive and Larry and all the others who are serving on the stakeholder Advisory Group, I want to thank you for your time and commitment and I really appreciate your comments today and helping us think about how we frame these decisions that are becoming before us in the next month or so. So thanks a bunch. I'm Kathleen. Good morning, and thank you very much for hosting this special CID Focus DLT meeting. I really appreciate the time that you're taking any organization that went into bringing everybody to the table today. I want to do address the Fourth Avenue Alternatives and specifically the impact of the cumulative construction on the pathet potentially on the viaduct. I'm at Saint Clair with the city's plan is for the 4th Avenue Viaduct and structures related structures that are in the area that might be impacted by the construction of the light rail line the infrastructure around this neighborhood is old and it will need to be replaced potentially within the Horizon of the new train station here. If so Sound Transit in the city of Seattle could minimize the pain experienced by these two neighborhoods by completing by completing the two major projects at once when Sound Transit Compares construction impacts on the 4th Avenue and 5th Avenue Alternatives with the Fourth Avenue the Fourth Avenue alternative looks like it will take much longer and have greater traffic and construction impact but these comparisons. Consider the additional impact of the city coming back at some other point in the near her eyes near window Horizon of replacing the Fourth Avenue Viaduct and related structures. We ask that sound transit compare the impacts of constructing a joint link extension on 4th Avenue with a Fourth Avenue Viaduct replacement project to the impacts of constructing the link extensions followed by the replacement of the Fourth Avenue Viaduct or other infrastructure pieces in the area, even though the city has not developed a formal plan a timeline for replacing the Fourth Avenue Viaduct and other structures in this area transit should consider the construction impacts of this replacement and its cumulative effects analysis. Whether the Fourth Avenue Viaduct is rebuilt as part of this extension project or not. The city needs to provide Sound Transit with the information to consider the Fourth Avenue Viaduct project as a reasonable and foreseeable project finally in these two historic districts. I would ask you to make your decisions with an equity lens and also a 100-year lens to build. System that maximizes its potential across the generations. Thank you to move can be followed by listening and then a coyote bong. Good morning, the readership sand city councilman in mirrors for holding who sings this opportunity for us to put in put in this public comments and my name is Tim Lee and puppy owner and a business owner and not chinatown/international district. And I tried Community appreciates all these Imports and other information that was provided for us last last week. That's two weeks and so are trying to hang community supports the Fifth Avenue constructions that having a train car stops below the Fifth Avenue for the following reasons. Number one is a Texas accessibility for the elderly which is it from the last time when there is a slice that if the car is put on the 4th Avenue, it would it would take about a normal young men like a healthy man person to walk 7 minutes to the car from the Fifth Avenue to the Fourth Avenue, but Chinatown has Fifty percent of elderly and when the elderly on Walkers and Canes walking 7 minutes that means 21 minutes or maybe more for them. So is a burden on the elderly. So we hope that the station and the cost be put under the Fifth Avenue and the second reason is a efficiency Inns in timing to complete the construction and armed committee would like to enjoy the use of public transit and a new car radio stations chunar compared to 7 to 15 years and the 30 is the budget feasibility of a city and also the Sound Transit we can use that extra money that was like billions of dollars into other projects. And for the owners we have on the position owner, and I'm not rich to to the business owners on the Fifth Avenue the four owners. They are all willing to move because the building is old and they are happy that they did they'd be relocated and be willing to relocate it back. So we location. It's not a problem for them and I can verify that and therefore so we hope that the stations or the cost be put under the Fifth Avenue. Thank you very much. And thank you so much. Liz next NFL expansion common want an interpreter just let us know and we'll make sure we adjust the time to accommodate that. Thank you for the opportunity to speak today. I'm loose Denning the public realm director of Alliance for Pioneer Square the lion to the nonprofit organization leading the revitalization of the Punnett Square historic district your advocacy program in marketing entry action. We work to help preserve. What makes Pioneer Square the most authentic engaging and dynamic neighborhood in Seattle. So the CID station sits at the edge of Pioneer Square which serves all of our constituents daily this project matters deeply to Pioneer Square and we are dedicated to being fully engaged in the process through completion at this time. We argue to keep the fourth and fifth avenue Alternatives all on the table Pioneer Square needs time to be engaged in the process. We are still as you know, in the midst of more than a decade of public Mega projects including the Alaskan Way Viaduct replacement project the Alaskan Way Seawall replacement project the Washington State Ferries Colman dock expansion. Expansion of the first Hill streetcar in Center City construction and replacement of the water main under Force Avenue, which just happened this last year. So by allowing time to fully studied alternative will give us the opportunity to be engaged in the process so that the end we can all have a project that engages everyone and we're all proud of. Thank you. Is immature is Kaya or Korea? Terraria until you be followed by Betty loud and then Alvin Ang. Hi, good morning, everyone. Thank you so much for your time and the opportunity to speak and I my name is Kiri a wall and I'm with Chinese information and Service Center CISD has been serving the Immigrant communities in the King County for the past seventy seven years as we are providing essential supporting service for immigrants to fry is equally important for us to advocate for social racial economic and the environment Equity. I really appreciate the opportunity to share our comments regarding to the construction of the Chinatown International District station for a lot of immigrants because of Language and Cultural and babies recent immigrant families, especially for parents with children who need to work multiple jobs to meet the and it's of the family they won't be able to participate much however historic only we know that immigrants of colors are often miss in the decision-making table yet. They are often. Yes, they are all in the last to be informed and the first to be impact play. This is it. This is really important for the committee members in the CIP area to be engage and Empower throughout the process material and information should be available in the language community members will be able to understand even for the high-level and Technical information of the construction project and community members regarding All the Rage erased ages and Country of Origins should be included and their voices to be heard and I'll give you an example for a lot of people that we serve is not that they don't want to participate is all them because they don't understand and they don't have the time and there's not enough time for them to learn. So it's a really important them for those people to be engaged. Thank you so much for your time. Ukiah Betty Lau Hi, I'm very loud. And I'm from the gioi Moi benevolent Association one of the lead organizations of the Chinese Community First off. We would we're really happy to see the Chinatown ID station. We have lobbied for about 14 years for that name to be corrected to match the Seattle City council ordinance 11929 7 where the official name is chinatown/international District which includes the neighborhoods of Chinatown Japantown and Little Saigon regarding the Alternatives many of us prefer the Fourth Avenue in contrast to my colleague Tim. We prefer the Fourth Avenue. I'm one of those elderly people with mobility issues. My parents had a laundry here in the 40. In Chinatown Orwell on the edge and we would ask that you add to the criteria of the Eis study the community impacts. This was asked by one of the other community organizations and I haven't seen it happen yet. I have been to every single one of the meetings and I have learned so much. I know it's a difficult decision. But I hope that criteria will be included for impact on the community and with regard to the prior person. Can I have some about 30 seconds of your time Alvin? Thank you. I would like to suggest that there be a meeting in Chinatown proper. So that things can be explained overtime as a previous speaker had said to the non-english speakers. It is really difficult to interpret all these new ideas new vocabulary and New Concepts and it takes a while it took me a year and I was born and raised here. It took me about a year to really grasp and understand what what is happening on this project, and I think when it's done it's going to be super, but I hope it's according to what you said to minimize the impacts on a non-english-speaking community of color. Thank you. I'm actually going to pass on my terms. So you have to sign up to comment and arts and Anna. I'm with rooted in rights for a program of disability rights Washington. Our offices are all right on 4th and Jackson and I just want to say that no matter what option you guys decide ultimately I think it's important for us to think about the future and planning for the accessible future we want and not just designing a station that meets the bare minimum requirements under the Ada for accessibility. But one that actually is a station and is designed a sweet design that will work for people with disabilities will work for the larger community and will allow everyone to have that access to transportation that we need. Thank you. Thank you Anna. and how not here seeing Anna come forward. All right, we'll go ahead and close public comment. Instagram My name is Nora Chan, and I'm from Chinatown and I you don't see me much but I do very happy. Okay. Thank you to the city government and County Government. For giving us this opportunity to voice our opinions. I've been working very hard for the last 2 months because I didn't know that I created many opportunity for the people to voice their opinion 4th Avenue, 5th Avenue. We have over 20 ideas and those ideas he is from all these local people. They don't speak any English and yeah, they care like putting a restroom in the in the station. Do you ever think of that but the thing of many different things that I did not even think of it so we are we are we really happy about this opportunity to have the station close by to us to Chinatown International District, but I know that it will you have many bodies like I went and talked to Fifth Avenue, you know, you are the business over there and they saw me more than they see their husband or wife. But anyway, I wanted to say that this is a great opportunity. You know, I was born and raised in Hong Kong. So I know that the transportation is how important that is to a city. You know, how come Hong Kong is such a little praise. And yeah, it is such a financial district for the world is is very important for transportation and I'm the one that have to get the the free Waterfront shuttle you into Chinatown and every day I go to the station and have and every day the driver told me mr. Chan. We have more people coming to Chinatown and I'm really happy. So I'm looking forward to this this project because it probably is not for me. I'm 72 years old, but I'm sure it will be for my children and grandchildren and I welcome the idea and thank you very much for all your hard work. Thank you. Is anyone else? Is there an else who didn't sign up but would like to provide public comment on the Chinatown International District alignment? All right. See none will go ahead and close public comment and I'll invite the presenters for dinner. Just reminding folks in the public will have another opportunity for comment on the Delridge station in about an hour. Thank you. So I'd like to just start with an overview of the engagement. We've been doing in the Chinatown International District. So we've learned as we've gone along. There are many different ways that work better for some to engage. And so we are looking at all the different ways to engage community members through briefings meetings of listening sessions in Resident buildings, Georgia door Outreach with our community Liaisons with businesses. So in language Community Workshop open houses neighborhood forums and social service provider and Community organization interviews. Here's a snapshot of the engagement we've done for the Chinatown International District station. It's included 30 Community briefings, 24 door-to-door conversations 9 tabling events engaging over 700 community members. So being at festivals or in community places a social service provider interviews five of those for listening sessions engaging more than 125 committee members and a number of on for neighborhood Farms workshops open houses. But I just wanted to highlight, you know, we talked about the free things in the community meetings and sore. What does that really mean? I'm to give you more of a sense of what those 32 me three things are here's a snapshot of those and many cases. We are meeting with groups many times through the year on such as some of our commenters mentioned it helps to continue to come back to groups. Whether it's a CID Forum or the capital project coordination work group or with a group of community members that make up the South downtown group coming back and meeting the folks throughout the year has been very helpful to this process. We've also done listening sessions in Resident buildings. We've offered this opportunity the number of places and we were able to have four of these on in January and February end in March 8th presentation some conversations there in language. Thanks to a Camellias on facilitator from Department of neighborhoods as well as our own a staff being able to do the conversation, but the presentation as well facilitated conversation in language We've also done a social service provider interviews. These interviews allow us to get a better understanding of both the communities that we are trying to reach out to you in a better ways to potentially reach out to them and get their perspectives on potential challenges are opportunities associated with the alternative that were looking at. And then we've also been has mentioned at various tabling event. So being where the community is that Dragon Fest at celebrate Little Saigon in Pioneer Square actually tabling it a real change vendor day. So being able to talk with vendors. I'm from real change as well as recently as Lunar New Year celebration and the Publix building. So just being there as residents come in to talk with them about the project. And what we've heard throughout the last year consistently and what has as we mentioned before I shaped our scope for level 3 is that folks are interested in improving connections between different modes Sounder Amtrak Light Rail and bus has the streetcar and others. How do we support the Community Edition contributes about long-term Vision activating Union Station as a component of that and how do we minimize construction impacts on the Chinatown International District neighborhood? All of that feedback also shaped how we conducted the community workshop on March 13th, and we have hosted that here in Union Station and we had over a hundred and thirty attendees and I think in part because of community members like those that spoke here today getting the word out to their neighbors to those that maybe don't speak English or get notifications in the usual way as we also did blanket on the Pioneer Square chinatown/international district and Little Saigon with posters flyers and language did door to door Outreach. We advertise the event at various other tabling events, just to try to get the word out about the project as well as about the community Workshop. Sorry for this my voice review the Alternatives in the Chinatown ID area this information that you some somebody seen before in a lot of work through at the workshop that we had a couple weeks ago. I'm just a look at the hid station Area Agency. Obviously the Chinatown International District on the right Pioneer Square on the left and the stationary in the middle. It's not rectangular area, which is really at the connection point between the neighborhoods. I should know in level 3, we have three end-to-end Alternatives. And as you look at the second and third option is there you can see that we got station options in the Chinatown 80 area 5th Avenue both cut and color and mind. So that's shallow and deep options and also on 4th Avenue again shadow of Mind couldn't cover and mind auctions. This is a look at the all of the options showing up on screen. They said there are five Alternatives that were looking at right now in level 3. The first is in green. It's the representative project. Then the brown alternative shows the Fifth Avenue alternative which again to be shallow or deep station. And then the blue is a 4th Avenue Station location again, looking at shallow or deep station. So five Alternatives all together. You've heard us reference the term cut-and-cover. So just a very briefly explain what that means essentially when you do a cut and color Station construction, you dig a trench initially you cover over that trench, which is the graphic in the middle you provide temporary decking and then when the temperature in is a place as shown on the right of the screen you construct the station below that so lot of the station is construction is going on why the street is still operating with mine Station construction. What you do is you develop an access shaft, which is what's showing at the top right of the screen and that's the way that you get equipment and materials down to the steps of the station and then you start to mine out station from there as shown by the graphics in the bottom right-hand horse left. So those are the two basic construction techniques that we've been looking at right now cover stations are generally shallow mind stations are generally much deeper. So just explain the Alternatives individually, first of all, the represent a project which was our starting point. When we began this process last year who generally be a-goin along Fifth Avenue with a station immediately adjacent to the existing Chinatown ID station. Is a graphic that explains some of the impact associate with this alternative. So if you look at the top-right, it shows the area along 5th Avenue, that would be disturbed during construction. Is that orange band which extends extensions from Seattle Boulevard up to Main Street. This is where we be doing a cut-and-cover tunnels along this stretch of 5th Avenue. If you move towards the right, you can see that the overall construction duration will be about 7 years at about 1.5 years of that would require traffic detours blow that is a cross-section give you an idea of where the station is the new station shown on Greenwood be in relation to the existing station in Union Station and so on. The second alternative his second or third alternative. We be on Fifth Avenue Showtime Brown here at this would be a bored tunnel. That would go along 6th and 5th Avenue to the Chinatown ID area. The area of Destruction is shown on the top left again at this graphic. It will be shorter area that we can starve the as mentioned. This will be a board tunnel, but the station self will be kind of cover and the area of disturbance would be about a block and a half or so south of Jackson Street overall construction duration. We've got six years and the overall traffic detours would extend for about 4 months or so. We also have a deep option on 5th Avenue. And with the Deep option would be able to have our access shaft potentially off street. That would be some property affect associated with that and then the construction. Will be about 7 years, but because the access shaft will be off speight. You wouldn't necessarily have traffic detours with the Deep station option. Let me have the Fourth Avenue options again. We have shallow and deep options. The area disturbance again is showing at the top left of this graphic would extend again from Seattle Boulevard up to Main Street this time along 4th Avenue, and as was referred to in the public comment, this would require Demolition and rebuilding of the existing 4th Avenue Viaduct before you would build station the overall construction. Will be about 10 years. And with the shadow station option you have detours are about seven and a half years and to explain that in more detail with the current shutting down about half a Fourth Avenue at a time and half of that traffic will be detoured onto adjacent streets for. Of about 7/2 years. With the Fourth Avenue deep station option again. The areas disturbance is showing at the top left and then dick construction duration would be about for 9 years with traffic detours. We just made for about five years in this case. The trip detours will be Borat more substantial because we be shutting down the street entirely while we be doing the Deep station. So that detour would be destroying all of the traffic on 4th Avenue. Little bit about transfer times. This is skin looking at the Fifth Avenue options on the left is the shallow station option and then transfer time between the New Link station and the existing link station will be about a minute or so is represented by the blue number on the left side of the screen the transfer time between the New Link station and Sounder would be about 4 minutes for the Deep station option transfer time length length would be about 5 minutes to transfer time link to Sandra would be about 7 minutes. For the Fourth Avenue Station options. The length length transfer time would be about 4 minutes for the shadow station option and again 4 minutes for the link to Sounder transfer time for the Deep station option on 4th Avenue. The length length transfer time would be about 5 minutes and the link to Sounder transfer time would be about 7 minutes. Very briefly you seem to ask a question to the shallow Fifth Avenue. The trains are stacked is that is the design would it be a Northbound and southbound would be on top of each other as a as a specified mask a follow-up to that? Mr. Chick Cairo. Can you explain the stacking and why we aren't able to do for a side-by-side mezzanine connections, like like you one might assume we could do with us shallower station. The reason it's stacked is so that we can fit it within the street right away without hunting property effects. It allows us to narrow. Our area are cross-sectional disturbance. So it's beneficial from that perspective. So we still have to work to the details of the mezzanine connections and so on it with that area, but they attend to such as have a direct connection. If I'm a permit if you'll permit me a follow up, but we still stack it with a mezzanine on top and you know, there's really not an option that we've analyzed because of engineering constraints to have a direct platform to platform connection for one of those tunnels and then at mezzanine connection to the bottom now, we're working two different, different ideas about how to make that happen right now. Can you also explain just so people understand on the board tunnel why it has to be so deep. Further the reason that you have to have a very deep stations to get down to good soil conditions the soils in this area or are not great. It was previously title Flatlands getting down to a showing of the right here. You have to get down to about 200 feet are soaked to build the station to get down to store that you could actually mine and I'm just explain some of the trade-offs the key considerations with each of the Alternatives starting again with the represent of project which is the green box. Obviously with this alternative you have a couldn't cover tunnel as well as a cut and color station so has greater construction fax to Chinatown ID along 5th Avenue and also affects the washed-out ramps and Foundations Salon around I-90 and has some effects to Ryerson bus Pace with the brown alternative which is the board tunnel option that you only have cut a cupboard in the station areas of construction defects are more limited at the Mind option would be less convenient terms of access and transfers and also with pasta take longer to construct. It has effects to Future essential base expansion. And also the Mind station option has some operational issues with train acceleration and track crossovers with the Fourth Avenue option in blue. This would require rebuild add existing Viaduct tattoos explained before so therefore, it has complexity in terms of construction traffic diversions schedule delays and potentially requires third-party funding. The Mind option for that also have issues in terms of increased traffic fix that's convenient access and transfers and impacts to Ryerson base. I also with deepmind station that it also does not offer pocket rack still has operational issues. Is this a look at the key differentiators between the alternative once again, these are color coded. If you look at the first row there is a station access and transfers obviously with the shadow station options at what is represent a project r v shallow off for shallow. This would be higher performing in terms of access temp to construct a project would have the most construction effects V shovel option with have more construction effects as well. But not as significant to along 5th Avenue to 5th Avenue dethaw option would have to lease construction defects as a Mansion Elan Fifth Avenue 4th options, whether they're shallow or deep would have more construction traffic affects traffic detours. That's why they spoke about Propertysex obvious you have some property effects long Fifth Avenue in China Heidi and also has some effect Ryerson base with a brown options. You have property effects at the tunnel portal in Soto as well as long Fifth Avenue in CID and it affects future essential base expansion with a blue options. You have some property effects long 4th Avenue and some effect Ryerson base take me with the fourth deep option which would require displacement of Ryerson base turn to construction schedule. The the option meet the st3 schedule V deep option would have to hire schedule risk and then the 4th options would probably potentiates play the schedule due to the viaduct rebuild and then you also have a comparative estimate the saddle option would be less costly the options of 4th Avenue would have we potentially more costly overall. Thank you. I'm just a little. Little bit of definitional assistance here construction effects. You're not just talking about the length of construction. There's obviously something else in that measurement because the Fifth Avenue shallow is a shorter construction time. Then the Fifth Avenue deep. So we're looking at duration of construction were also London. We're looking at a traffic diversions would have potential property tax. So it's combining a number of different measures into that one thing. Thank you. So we want to acknowledge of course that we are introducing a new station new, new connections into existing communities and really take a moment to look at how that's how that project intersects with the context there been a number of planning efforts, of course focused in the neighborhood hero chinatown/international district and in Pioneer Square. I most recently the Jackson HUD planning effort, which is a community-driven looking specifically at the two-block area that we're looking at station sites on this Ford Explorer or actually put out a number of goals and priorities for guiding a division of the Jackson Hub. These are some of the key principles that came out of that effort. I'm really enhancing the safety and comfort level of this of this block in the station area. Creating engaging and inviting public realm are really connecting the neighborhoods together a Pioneer Square and in Chinatown ID and really then ultimately embedding this place in these two communities with iconic architecture and public realm Expressions. Also a lot of focus really on how how this station how this new investment. I could really transform this block and really create a compelling hub for these communities. Of course, there are a lot of projects underway in this area on we will be introducing new light rail service in 2035, but between now and then there are number of major projects on of course the Waterfront by the Colman dock replacement to the Westin Pioneer Square, the Center City Connector streetcar project on ongoing work on 3rd Avenue. All of these projects are essentially intersecting in this area on and how we Design This Hub is really going to influence how these different systems work together, but it's also important to know the course at Eastlink on one of the reasons why the buses have come out of the tunnel on mr. Provided the opportunity to connect Eastlink buy into the Chinatown ID station. I'm so this is going to be an area undergoing a lot of change over the next few years. I'm a part of that change really is found in the Intermodal connections that are happening here. You have ferry service to the West you have Sounder an Amtrak serving King Street Station. Just just to the west of us across 4th Avenue. Are you of course have new light rail that we're bringing in along with the existing Light Rail service from the central Link and from Eastland coming online and 2023. Are you have major bus corridors on 4th Avenue as well as on 5th Avenue, and of course the streetcar on which will be connected and extended to serve First Avenue in Pioneer Square. I'm so a lot happening this area, but it's also really important to note that this is a really important on point of articulation between different communities and our ability to think about how we design our the new station and kind of enhance public realm here Bears directly on our ability to connect these communities together on Are incredibly culturally rich and diverse areas on from Little Saigon to Chinatown proper to to Pioneer Square. I'm in this diagram just kind of shows some of those key destinations in the connections that we want to be mindful of into foster. I'm in our work and in partnership with the city. A quick question. Yeah in public comment the gentleman from the design commission mentioned a couple other Transit hubs and I'm just curious from the agency's perspective. Are there examples were looking to they were bringing in multimodal connections that things like the Jackson Hub concept would look to that we could go online and look at pictures or if we happen to be in the city visit him. Are there other examples in the transportation or Transit world? Do you say I hate these are a couple of the kind of great things that happened around the country that we should be thinking about it later on one of the offside presidents on for the kind of vision that Jackson had my presence is Denver's Union Station on an example of having an activated of a commercial area. I'm really thinking about development is kind of integrated into the transit function on but then also can advise entering. Are the station itself as kind of a public asset or Park almost done Plaza today expression? I'm so few of a few things to note about these two station locations on 4th Avenue. We're looking kind of a high-level at Transit integration and non-motorized access issue on and then also thinking about going to the integration with land use and development. I'm in this kind of summarizes some key takeaways from henefer early assessment at least two sites 1 West 4th Avenue on probably the most obvious opportunity here is to provide a much better and direct connection to King Street Station on Emma's we've laid out to the high-level the station. We seen an opportunity to Simply cite a station entry on integrate. Into the Weller Street overpass on so that would provide that kind of direct connection to the Amtrak and sound Art Center Trax the trade-off though. It's a little bit of a longer transfer time between the Light Rail stations that you noted that Cahill noted earlier on a slide and slightly longer. Watch a bus zones in the streetcar stop on Jackson Street on but also really close to the Fourth Avenue bus sounds from a land use and development standpoint. The positioning of the station is ideal to integrate transfer flows between the Light Rail lines on in a way that can support the activation of Union Station that kind of goal of a of a of a repossession Union Station in in hub for this community, but the trade-off potentially less potential for Equitable agency Tod on Plaza improvements associated with project delivery since we'll be really focused on the west side of Union Station in the viaduct as part of the project. I'm with Fifth Avenue of its kind of some of these talking points in River. So you're a bit further from the 4th Avenue bus stops, but you're closer to bus stops on Jackson and then Steph arms a slightly longer walk to King Street Station. You don't have that kind of direct opportunity to integrate with the Weller Street overpass or provide that connection over to King Street Station on and you have an opportunity to opt initially have a station entry site on the east side of 5th Avenue by providing more of a direct connection and orientation to Chinatown. From a land use and development standpoint. We see an opportunity still to integrate the transfer flows in a way that can support activating Union Station take a different character, of course, but are there still that potential there on and also some higher potential for Equitable Tod in Plaza improvements associated with project delivery since we'd be working in Fifth Avenue. I'm in really needing to think about reconfiguring the connections between that Fifth Avenue Station in the existing Link light rail station. I will turn on my mic and then I will talk about what we've heard. So as we've done our engagement as I outlined before and level 3 we have focused on those three key areas the Community Vision connections and the station and impact so I'm going to go through each of those what we've heard both at the workshop as well as some common themes throughout. So what we said is in which we plan for the light rail expansion. We want to better understand how Community Visions priorities and values relate to the new light rail station and connections that are coming through the neighborhood. So I'll go ahead and go clockwise. I'm here and starting at the bottom left. We heard that went to maintain the connected diverse and historic Place supported by an intergenerational multilingual business and residential Community interest in Chinatown International District is the station named improve connections along Jackson Street connecting neighborhoods from Little Saigon to the Riverfront activating streets and buildings around the new station including Union Station in a culturally and community-based manner writing more green and Open Spaces culture reflective art public restrooms and local Market vendors and that the station could potentially bring more foot traffic to CID business as we then also have asked about how to maximize connection. So asking community members how they get around now where they like to go what barriers they face and making those connections and here's a snapshot of what we've heard. So can we members are excited about new opportunities to get two more places faster and easier with the sound transit system expansion work. They're concerned about limited parking interested in convenient and reliable transfers between Sounder Amtrak Light Rail buses streetcar that connections needs to be improved across 4th Avenue and also across 5th Avenue and Central barriers that multilingual signs announcements and improved wayfinding could address in barriers to using the Link light rail system that we need good Street lighting security and safe pedestrian experience to safety as a common theme there enjoy connections to family deaths and destinations in Beacon Hill u-dub the east side in the airport. So places people go to unlink now, And finally in describing the station Alternatives in options, we've asked, you know, first two folks understand the options share the information about that and then how come these options best serve your community. I'm in what concerns you have about potential impacts. So we've heard mixed opinions on the station location some prefer the Fourth Avenue station locations to reconnect Pioneer Square and a CID neighborhoods King Street and Union stations and limit potential impacts in the CID neighborhood some prefer Fifth Avenue station locations for easier access from residences and businesses in chinatown/international District and due to the shorter construction duration. There's been more interest in the Shell station options for accessibility in the sense of safety protect local businesses during construction by maintaining operations provide Fair compensation and continued operations in the CID after construction for those businesses protect the Chinatown Gate and then I'm going early in life. Which notification about detours and construction impacts is very important. Thank you leave it. So we we do have Kevin O'Brien about 15 minutes. If we want to have some discussion amongst elected leadership group members if I can start with just asking a question read it to you or any of the team up there. I'm in public comment we heard from three of the stakeholder advisor group members and I really appreciate their points and if I understood him correctly, they never pretty clear that I heard two things at that as individuals. They didn't feel like any of them have the right or authority to speak on behalf of a diverse community. So they wanted to bring opinions the table but didn't feel like they're in a position to be making decisions on behalf of a community that has a variety of Interest some of which we heard public comment Ellsworth today and a second piece. I heard was that that they built individuals have a really good sense of some of the community needs but the engineering Transportation needs What can be done to meet those needs felt like it's a technical approach that they they didn't have that expertise. I did hear that. They really appreciate some amazing work is being done by Sound Transit and it sounds like there is a high level of respect for folks in the agency. They were continuing to refine options and convey that to them but I heard a request a shift the role as opposed to saying you want us to bless one option to move forward and we didn't feel like that. Can you comment imagine? This is not the first time that's been spoken and talk to us a little bit about whether I'm accurate or not in my characterization there. And also what we're thinking about moving forward if there's an opportunity kind of pivot a little bit I'll just speak to the sort of the role of the stakeholder Advisory Group members. We have asked a lot of them and we've been incredibly appreciative of the amount of time that has spent with us over the year, you know in bringing on the stakeholder Advisory Group is she will pointed them. We worked on a charter with them about what their roles would be. Understanding that it is a lot to ask any of the stakeholder face your group members to be the full voice and representative of their Community. They're not elected officials. They are wonderful volunteers. However, they all have very unique perspectives based on where they live work on the communities in which they work with and one of the benefits of having that stakeholder Advisory Group has been that we've had deeper engagement and communities through their leadership and their engagement and their perspectives have helped shape on how we've moved through the process as well and they can bring that to bear as we move through the level 1 and 2 and so forth screening process. So with that, you know and understanding that we have a very robust engagement process that's outside of the stakeholder Advisory Group and I hope is that by bringing those perspectives in as much as we can as it is our job as an agency to bring those perspectives then and help them make their recommendations. Let us know what they feel like they can make Recommendations on and then also share that public feedback with you as the elected leadership group. I think one of the issues that were that I'm struggling with at least his is a timeline because I would love to see you open this line to Ballard in the next six or seven years as opposed to 15 17 years and it feels like it's so rushed right now and so the life of leadership group and the sickle advisor group, I believer in theory coming to an end to the next few months, and yet they're still a lot of decisions that are going to be made in a lot of what I assume they'll be a lot more opportunities for input. And so I'm curious what thinking has been about as we get through the scoping process in the end of this process, but they're still years of design work how have we continue to move forward to that? Can I see speak to that point in? I guess we anticipated that question but essentially yes. We are getting a lot of feedback right now. They're having the community workshops. There has been a lot of scoping meeting is and so on and disrupt you you've seen all the different ways that we get feedback or next every is just to share all of that feedback with the state code of ice cream. If I'm seeing that I could leadership group next month and then with the board and May and what we're trying to do, as you know is not identify the project that's going to be built or select that project. But you identify those Alternatives that we should continue to study moving forward in the draft day. I suppose that's what that's the reaction that's before us so that that should inform people thinking as they approach the recommendations next month. I'm we will then be reporting back. It doesn't end at that point. That's what do you need to start of the environmental process. All of this is what we where we are right now would typically be the very start of a process everything we've done over the last year-and-a-half is already being preamble. Get the poor thing going. I'm so we will be reporting back to the community has to go to the drafty is a process on what has come out of Alternatives development while we are continuing to study and what we learned through the process that would be an ongoing conversation and we've learned a lot over the last year about how the better engage the community as they described as we've learned a lot about how to be more effective in our engagements and so will continue to use those are in Eastern Gateway Community. I'm as we get into the is Sun is reflecting on the third bullet here would really be getting into conversations about some of the things that really matter to people what are the impacts will be signing those things that he is one of the accused in packs of other projects as well in this area and getting into the dead in more detail the station itself the station planning efforts. So as long as described we've done some work on that over this past year, but we're going to get a lot more intensive about that over the next year as we go to the draft Eis process. I know the fight of both are it's not just looking at the station itself and Sound Transit infrastructure for look. More broadly at the Urban Design Concepts around the station area will be part of our efforts as well. So it is we're the only the beginning of a multi-core processor to go to the environmental process soda said something to that briefly really for emphasis Cahill is right and identifying as what we ate says what what the board of directors is anticipated to do in May with the roloffs of all of the good work that's been done for the stakeholder Advisory Group in the elected leadership group is to decide what to study it is not deciding the project to be built into the comments made of an earlier witness. It is anticipated in this kind of customer through that process that we might mix and match between various aspects as we get to know the details better of different alternatives to come up with the ideal project to be built to bring to the board or what one witness talked about as having. Some from column a SIM from column B and some come see that that that is not at all. Uncommon. So there's there is still as putting out a lot of Engagement to do but we're not the board will not be taking the project be built in may we anticipate them to pick preferred alternative but that is all studied in the context of a range of Alternatives were a number of the options are still on the table. Thank you, mister chair. I appreciate the Segway and opportunity to talk a little bit more about project delivery timelines. And I think in my conversations with constituents, it seems to me that there's a difference of opinion on an understanding on how the the different alignments and station location choices that are being considered her on the table might affect the project delivery timeline. So I was hoping you would take a moment to share with us in the viewing public how these different choices do or don't impact the delivery the delivery times for the for the for the overall project. Essentially right now with the representative project if we just speak about the Chinatown ID area and course. There are other aspects to this project in another motorcycles that also have some implications as someone with some of their choice that are being looked at. But with the representative project are the Fifth Avenue alternative the shallow Fifth Avenue alternative that we think that can be accomplished with an existing schedule at my for looking at is deforestation option on 5th Avenue. We have some concerns with the schedule, but we would need to look at that more to reflash that out. It's just a risk area right now. We're not necessarily saying they would take longer but it is more work associated with that with the Fourth Avenue Alternatives. Of course, we do need to demolish the viaduct and rebuild the viaduct. So that would be we would expect additional schedule associate with those alternatives. And I suppose I'm asking the question also because in one of the slides on that is included in today's presentation or series of the slides included in the presentation make it begins around age. 29 of the presentation. There is a huge amount of variation in terms of the impact of the number of years estimated for construction versus detours. And and I guess I'm worried that in presenting the information in that manner. It seems to imply that that means we're going to get stations faster than what we have understood that to be true under under even the overall schedule delivery. So so for example on the 5th Avenue South Shiloh station on face 29, the construction estimates are 60 years detours are four months. I think it would be easy for folks. Aren't as entrenched in the technical matters here to believe that so if I go with Fifth Avenue South shallow station, that means I'm going to get a station in six years. So so that's what I would like for you to talk a little bit more about the new ones related to these numbers these time lines that you're giving us as it relates to the various options. I don't want the public to be under the assumption that we're revising timeline such that we should be influenced to pursue one option over the other because we now somehow believe we're going to get this in 6 years. Which means yes. No, this is sumption is that we would open the Ballard extension and is trying to find a stations part about extension in 2035. That would be so that's a long. Of instruction not all that time will be spent on constructing in this area. If you were to go with the Fifth Avenue saddle option that you noted the. Of construction in this area only would be approximately 6 years. I'm but that does not mean that the project as a whole would be completed in six years. We would still be trying to reach the dead lineup 2035 what I noted about what some of the other alternatives to see went with 4th Avenue alternate you talk about a large construction duration in this area of 910 years, but and there is potential risk to the overall schedule as well with that potential extending Beyond 2035. Thank you. Thank you. I want to underscore their conversation. We've had about their yolks and Allergy from the menu about columns a b and c in for as much as we will move the the board at the end of May might move a very small number of alternatives for word. I hope that in and I think we're hearing and needed to be able to continue to have some design Alternatives around that work that particularly chinatown/international district will need to be able to continue to to work and so as we go forward both in the elected leaders group and board level and and continued conversation. I hope we can make sure we know what alternatives in pieces and design Alternatives can mix match one within the nut one with another and make sure we know what continues to be an alternative an option for that mixing and matching and I'm if there are Scenarios that don't work. I would also I'm asked I'm if we can explain mitigation and talk about what kind of opportunities we have for mitigation. I'm here in chinatown/international District and what challenges that are providing that mitigation. I'm yes, I'm obviously as we go through the draft here as a process will get a better understanding of what these Alternatives HDR and will be able to study about the impacts of these Alternatives we have about some information over the last year as we described about potential construction durations potential Drive traffic detours and so on will get down to a lot more detail in the draft. Eis will be a better definition of what we're studying. Once we understand what those impacts are. We also in the draft day is supposed potential mitigation linked to those impacts. So when we publish drafty is at the end of next year in 2020, you will see both the impacts and potential mitigation associate with those impacts that information is presented in the draft is it made available for public review and people can respond to that and make their comments both about the impacts and the medication at that time that informs then the finally is development. Thank you. Cancel member herbold. Thank you. I'm just drilling down a little bit on the next steps. Pretty immediate next steps are the summary of the key themes from scoping and a level 3. I'm ret memo to be available on April 15th. I'm just I'm concerned that the SAG meeting where there's some expectations that there are level three recommendations based on this information is just two days later and I'm wondering if there's a way That there could be more time between that information being available and the SAG meeting. I'm at we can do our best to have a say this going. Extends at until April seconds. We have will be getting a lot of comments. So we have to do my very best to try and collect those comments and get them out there as quick as possible. So just as a follow-up are is your thinking that the sad meet the SAG meeting on April 17th. What are you what are you expecting to come out of that from from the stapler Advisory Group articulated to him prior meetings to the stakeholder advisor group is that we are asking them they have the level three alternatives are there to find right now and we explained it to them several times. And we also explained to them that there are opportunities to mix and match between the Alternatives that are on the table right now. They don't have to accept any given alternative exactly as it's defined that's been consistent with the process through level 1 and level 2 as well. So be expecting them to try and think about what are the alternate That should be looked at for words that we can see should continue to be looked at in the draft are assigned. We buy stamps think of it in terms of to Preferred alternative is an alternative that would move forward in the event that there is no additional card party funding so they can mix and match between the alternatives to try and identify what that alternative would be to receive direction from you. The elected leadership group will be presented to you and Eddie February to try and work to identify what that option would be. What would be the higher-performing alternative that is still compatible with the overall scheduled budget and scope of the test that was identified a nasty three. A big one task for the stay close by so group come forward with and then to also identify a second for adult alternative in the event that were additional third party funding and those recommendations then we'll go for it to you along with all the feedback that we received rain is coming. It would be informed by the scoping. Absolutely. Yes, I see my concern that the scoping report itself isn't available until after the SAG meeting and there's a summary of the key themes just two days before that meeting. We will we will try and get the essence of the Scorpion summary report in front of them. It may not be completely finalized by that date, but we have to do Americans and then, thank you. Thank you and thanks to everyone for all the work you've done here. And I want to thank all the members of the public who came to provide testimony and their opinion. I think it's really important to have an engagement. I know that sound transit all of us feel as Fierce sense of urgency. We've missed transit for decades. We know we have to catch up and even at the best schedules when you hear 2035, it seems can't we do it before then? And I want to thank mr. Rogoff. We've had a lot of discussions. We're doing everything we can for the city of Seattle to work. What sound transit to have joint planning committees so we speed things up but I really want to urges. You know, I'm I'm reminded of the phrase, you know measure twice cut once we have to not only get the best Alternatives we have to make sure the public feels included and they believe they're the best alternatives for each part of their communities and I think particularly when we're talking about chinatown/international District that Community together with Pioneer Square, I think have suffered the brunt of so many Transportation projects over the last many years and going forward will continue to do that and chinatown/international district is one of our most culturally sensitive areas that has suffered from Decades of government policies that were racist and inappropriate you talk about the you know, the Chinese Exclusion act's the Japanese internment the immigration from Vietnam all those things together. And so I think we owe it to our community to make sure That we study what we need to study and we give ourselves the time to bring Community along to listen to them because whether it's two alternatives are 10 Alternatives in the between now and environmental impact I think is that is a distinction given what we need to accomplish over the next two decades. So I would urges, you know, you will be hearing me at the board meeting that we should default to study more. You know, I'm reminded that when we we were Bellevue we studied, you know, it's before is on the board, but there were dozens of alternative study for various segments of Belleview and you ended up synthesizing to get the best mold. So whether you call them Alternatives or design Alternatives, I think we have to be very sensitive. So the community understands exactly what the impacts are and we're thinking about how to get this segment right? Because we will not get a second chance to do that. And if we push forward to quickly on this phase we will get resistance at all other face. Susan I think that that could jeopardize the project more I'm reminded yesterday and Sound Transit just two members of one of the north things one of the new with the condemnation meant for their properties, if you think about the number of condemnation acts, we will have to do both in chinatown/international District and in Delridge each one of those could slow things down if we don't get it right at the front end, so that's just a comment not a question. First I want to thank mr. Robot for the narrative the framing of the challenge we have I thought that was very well done on what we're trying to do. So thanks for setting the stage for speak. I had a few just a few questions and that is I'm I'm a little confused on the mix and match approach really what that means. When I look at it seems like we have whether it's fourth or fifth or deep or shallow or mind or bored are they all present some great things about them some great positive characteristics and of course the challenges and when we talked about the SAG looking at maybe a mixture match Approach at the end of the day. You can't mix match fourth and fifth and so what do we mean by that because they're like a 4th and a half Avenue or something that I don't know about. So, can you say a little bit about that's the first question. I may just get the Puma touch-up. I just didn't fully understand that that's really my question the other pieces we continue down to cancel on her bold Point looking at continued Community involvement. I think you're getting from the community the community the alignment is obviously critical. We understand that there are also these other factors like we heard about restrooms where you know, what's what about the restrooms? What about wayfinding? What about cultural preservation? What does it look in order to feel like I really like the coming from the design commission that on there saying Less on the Seattle city of Seattle side lead with that vision and not lead with infrastructure. Right? And so what does this look like in so I am assuming that the thing was a third bullet point in one of the slides? She need engagement on some of the specific as Statics and functionality of the Stations of that's going to continue because we're short of I don't stay stuck on the alignment, but we're we're right there trying to figure out the location first. And so can you tell me am I right on that those specific things that will come out in the community. We have a more time to figure that out because none of the alternatives are going to exclude some of that good stuff. We hope to have two to achieve and then the last question I don't have any questions or implicit my conversation every dude is Tu Casa Hermosa Pointe at the next stakeholder advisor group. I hear them. I hear them that they don't feel like whipped. There's a lot of technical information and in the physical impacts, they don't feel like I don't feel like wet sometimes make these decisions. So my fear I suppose is that even after that last meeting that I can say OK it's going to be V shallow or fourth mine or whatever the one of those going to be and when we come out with our recommendations are selected leaders. I'm still a little unclear on how many, you know, we could punch and I we were not trying to pot but really what are you looking for? One of the five two of the five? I'm just a little unclear on what in a perfect world what we are to decide. Okay. I'm paying attention to the time here. Okay, I'll try and keep it brief mix and match. Maybe I'll head over to snow in for the second question relating to ongoing station planning or consign work. But what relation is next match at the way we've described before right? I were talking about the Chinatown ID second up a project. I'm and there are but there are other elements of this project to there is to do Amish sex and West Seattle and to the North's going to downtown Interbay and Ballard. There are all turned is there two different alternatives on the table right. Now, we have strung together Alternatives within each of those segments into end-to-end Alternatives. And that's the purpose of Ava having a conversation and discussion, but will you could mix an alternative from 101 segments within a different alternative from another segment that the conversation that can happen and overall you made end up with a different end and alternative than any of the alternatives are we currently have right now? So that's the conversation this been going on throughout the year regard to the second question smelling you want to talk to them as we move into the is FaZe. We're also going to be advancing our design efforts and so that'll include more work on station planning. Thinking about Urban Design some of those precise on issues that you highlighted. I council member Harrell on so I've and that's going to be in partnership with the community. And with the city has well, I'm we're working at a staff level with the city to think about a construct for how we engage in station planning on in the next phase and Beyond and that's in partnership with the external engagement folks are thinking about how the community is going to be able to weigh in all on the way. Little cats are third comment about the Saginaw and then the number of Alternatives that we are expected to come out of this. We have a course throughout this year articulated the goal of I had to find a preferred alternative but also recognized in that there may be other Alternatives that still need to be studied through the draft day is the process. So we hope to make some progress and narrowing down. The number alternative is ultimately they were looking at in the draft day is not essentially what we've been doing over all of this year. We had many many alternatives are now down to a subset. Ideally we get down to a smaller subset, but that is really up to the SAG on you to decide what you're comfortable with in terms of narrowing it down. Thank you. Thank you everyone for the engagement on that. I want to just make a couple points just to remind the public that elected leadership group again is not the ultimate decision-maker hair that will be the board of directors. Now half of the eight members elected officials of the arc leadership group are on the board or happy to hear today until there's obviously a lot of overlap and similarly the stakeholder Advisory Group has been put together not ultimate to make decisions but to advise both Us in the board. I'm really interested in thinking between now in a month from now when we make our set of recommendations to figure out how to incorporate some of the things we've heard from the stakeholder Advisory Group both about, you know, a specific Alternatives, but also about process going forward and how they're going to be included in. So I know that that an ideal situation would be that the board gets clear consensus. Community this is exactly the alignment station location we want and that would be ideal. We're not going to be there. Although I will say that it's amazing how much work has been accomplished in the past year in narrowing the choices down in Nevada locations as mayor durkan talks about the challenges and opportunities in the chinatown/international district. We all recognize that this is a particularly Unique Piece of the alignment that are being done. We want to spend a lot of extra time and so I'm calling. I will be interested in entertaining your thoughts in the next month on how we make a set of recommendations. That is both. I'm consistent with what we're being asked for by the board but may also try to Encompass and ask the board to you know, brought in some of the ideas or entertain some other Concepts from communities. We move forward with that. One of the quick question is funny about this up a little bit though. You said that through the IRS process will be Work to advance designs. I take that to understand when we get to the end of this process and we make a recommendation and it goes into the ask the engineers and Technical folks. It sound transit. Don't stop there working for 2 months waiting or two years waiting for the IRS to finish. Oh absolutely not working very diligently through that whole process as you continue to make refinements an advanced design and we're in this is. Which has a very, you know, federally defined there will be a draft and then a common. Will respond to those comments. It's a it's going to be a long. Of time where I Maginot going to be some information going on in the shop how I'm interested in exploring how community members can continue to interact with folks through that process. It may not be part of the family. I asked but recognizes the reality that work we're doing this working currently sure. Absolutely. So I think we Dimensions that we're going to be coordinating very closely between the technical work that's happening. Halsey external engagement, we don't have a actual work plan formally designed yet. We're kind of in the process of doing so on but we acknowledge that a critical aspect of this first phase has been the ability to bring technical information make it public Foster the discussions and so we will continue that's absolute commitment on our part to continue that and the next phases and Beyond what we are going to want to get into a little bit more in face in the next phase of design is thinking about going to that of the Urban Design framework were Master planning framework in some of these station areas where the infrastructure investment is going to bring a substantial change into a major component of that is visualizing it on exploring it further in kind of more collaborative charette design environments as colleagues as we get to a point of making a recommendation the next month. I'd love to work with the agency and consider at least making some requests about additional feedback opportunities. Casi you know, like there's a lot of projects is a 10% designs right shoulder and we might just ask for commitment it when there will be other community input options. You are all the experts on there. So I love your feedback on what we could ask for that would be appropriate and I'll be working with committee members on that too and see if colleagues wrote support of it. That is a co-chair. I want to respond to some of the comments. You just made a compliment bro, Brian and particularly. Take care not to speak for the Sound Transit board. That would be terribly presumptuous of me. But to speak for myself in saying that I do believe that we will find the board very receptive to the wreck to the advice and recommendations that the selected leaders group meet a makes regarding and I'll turn is it multiple of ternative and design alternatives are multiple pieces. I think the board will recognize the work that the community has put in. We certainly realize the two pieces. Dealignment that we're meeting about specifically today have specific issues and complications which is why we're having this very conversation and I think the board will be ready to engage in a conversation in an understanding about why more than what we initially thought or might have said would be moving forward. Collings I suggested we pivot from the chinatown/international district to Delridge if that's okay don't see any opposition to that. So I believe we're going to start with public comment again for the Delridge station I have about a dozen folks signed up. You'll each have two minutes Alexandra Men followed by Justin Clark and then Scott Caldwell. Inez hooks are getting South. I want to thank everyone who showed up for the chinatown/international district portion of today and for the continued work you're all doing within the community. So thank you for being here this morning. Vehicle my daughter theater. I'm not sure you stop a pig a criminal Aquila. My name Alec Zimmerman and I'm against everything. What is doing Sound Transit did your support and I explained to you. Why look who is this chamber or everybody be alone 2 on party system. What is a colonizer Social Democratic? Mafia is exactly who you are. No one and I come to this room for me anytime and many a year. No one who sit in his chamber have something against Sound Transit like iCup in probably million people what is in bed this very unique situation. Wake up. You have one-party system is a beautiful. She is Miss not surprise me right now. So from east coast to West Coast from Atlantic to the stranger, you know, what is mean of 300 million American dollar right now Seattle can countries are number one sheet in America. Simple how is this possible? Not to Social Democratic Mafia who talking about color black brown for support support build a bridge for 4 billion dollars. What is driver by car car people in right now? We're talking about a billion dollars Ponzi scheme is don't have since I spoke right now finds this camper country billion dollars have something in his chamber cook have different opinion. It's America. Come on this many people have different opinion. So I speak right now with you everybody listen to me. It's only one chance cleanses do people Cinco de Mayo Justin you signed up second. Sorry twice. I hope you're not a I don't know. You're just a couple things here. I think the diverse population of communities of color are south of where the station is going to be and so they're not directly being served by by the station. So I think from our perspective seamless integration with the H line is a huge priority to make sure that these folks are served by this investment. So the integration begins with the placement and orientation of the station, but it continues through the design details and also robust agency coordination. So that's something we really want to see another aspect. We want to see his leveraging strategic staging areas and to affordable housing opportunities and I think the last thing you touch on this council member O'Brien is when do we go back to the public? And so we think that St. And the city need a partner to have a robust public engagement wants to 10% guide way. Station designs have been developed if we wait till 30% It's too late to to really engage the public to have any real meaningful the changes to the design. And so we think it's a disservice to the community especially culturally culturally sensitive communities like Delridge in the CID. So that's something that I applied hearing from you and something we really were really pushing for. So thank you. Thank you Dustin and all I'd love to engage with you and design commission members along with sound transit to maybe grab some language and something that we could consider defining the what that looks like in the in the coming for lunch tomorrow, or we will talk Scott. And Scott's going to be followed by a mirror set of four and then Pearl Chan. Good morning. Thank you for having this meeting. Thank you for listening to us. My name is Scott Caldwell. I am a resident of North Delridge. I've lived there for 30 years. I've watched that neighborhood settle down get calmer get more vibrant more diverse and I'm proud to be a member of that Community. I appreciate especially what may order considered a few minutes ago about measuring twice and cutting once so, I'm going to offer you what might seem like a radical idea here this morning. I have been impressed by your racial Equity toolkit and I am looking specifically at one of the criteria would says to avoid disproportionate impact Community such as Delridge. When I look at the three alternatives for Delridge, including the station sighting I see what looks like disproportionate impact on that on that neighborhood. It takes out one block of residential housing for sure traumatically impacts another block and has impacts the green spaces that are a vibrant part of our community. So here's my suggestion to you. My I strongly urge you to consider putting back on the table the Yancey Street West Seattle tunnel option that was eliminated in level one. I know that was a long time ago, but I think that option would preserve the neighborhood with dramatically diminished the amount of housing that's displaced small businesses displaced would greatly Finish the impact on the green spaces in the neighborhood and it had while it has some issues that were raised in the level 1 evaluation. I'm about to finish the mix and match method. I think they can pull elements from other alternatives to make that option worth considering for the Eis. Thank you very much. I just got here. Hello, my name is Amir Southport. I'm a resident of West Seattle in January of this year. If he has to propose an elevated line that lease places more than a hundred families in my neighborhood. I wanted to discuss a few of the major concerns. This lined with lead into demolition other about a hundred 250 houses based on our estimates that this in the midst of housing crisis doesn't make sense. Most houses affected are currently single family housing that have a significant potential for growth the new proposal with lead into permanent loss of tax revenue revenue for the city and loss of transit-oriented affordable housing. The new proposal is an attempt to make future extension of the light rail possible. However, it's evident that future extension lead into decimation hundreds. If not thousands of additional houses in the west Seattle leaving a permanent scar across the area Light Rail is a generational decision. We should not be tempted by quick and easy alternative. Spot instead build something we can probably pass on to the next Generation. Thank you. proton here program be followed by Y2, and then Chris Contreras Hi, my name is Pearl Chan. I am a very recent eye transplant from New York City and we just bought in the west Seattle area 8 days after we moved in we got a flyer saying that we might be displaced. It's actually the third proposal does run through our block. I live in 24th Avenue and I guess what I'm the short time we've been in West Seattle. I'm kind of I feel like I'm kind of a purple unicorn you we are fortunate to live in the area that we live in but as we've got to know what Seattle when you're talkin about Equity it really a south south of where we are and in terms of accessibility. It just seems to make a lot more sense to have it on Delridge. That's where all the transitive and I mean except for the fact that we've only lived in her house for a month and then we might be displaced in a few years. That's one of the biggest reasons we bought there and it ends. we weren't part of level 1 and level 2 because we were in Seattle yet, but I just know that my husband and my daughter and I went to the phase 3 meeting and As I look around the room. We were very much under represented. I would say that my daughter is half Chinese. We were the there's only one and a half minorities in the room for what I saw and so I was a minute if you remember that would be most affected by this. Especially my immediate neighborhood were not represented at that meeting and so I do want to speak for my immediate neighborhood because even on our 2 3 block radius, I would say about a search of a half of us are people of color, and I didn't see that represented in the phase three of them going to assume and maybe it's that, you know ignorant assumption that they were not represented Phase 1 or Phase 2 either so I do want to speak to that, but that's it. Thank you so much. Thank you so much right away and would love to follow up just to make sure they were we are connecting with folks in the neighborhood. So we'll be in touch. Thank you. Hi, good morning. My name is Wei Chu thank you currently move in just a couple minutes before Pearl. We were not privy to what was going on. I feel I'm just against the 25th Avenue. Asian cuz it's going to displace a lot of us minorities and I'd like to thank you for coming here to share about appreciated. I'm Chris. Chris has a new father by Dennis Nolan and then Chris Coulter and Deb Barker is the last one I signed up today. I have I'm a resident to Delridge as well. I bought my house in 2011 when we decide to have kids. We didn't find out twins so we couldn't even speak to that enough. But we did anyway come with the idea that we would keep our property here in Seattle and use it as an investment property so we can either put our cut suck his school or also, you know, I'll deal with our student loans and are the cost of a healthcare. So we just want to Have the information of how we going to be compensated for that if if that is taken away from us. Not just for what's there but for the potential for us to build on it and what would you like to have some information on how you know what that can be taken care of. That's it. Thank you. And that's a concern we've heard from a number of folks. This is a multi-year process, but we understand that the decisions were even contemplating today have an impact on what you can do with your property or what you may want to do to property. And so it's it's something we're aware of and we will do our best to get some clarity as soon as possible so you can be planning accordingly. Thank you. Thanks. I'll make sure we reach out I'll make sure that we reach out as well and have more conversation with you and connect you with real estate office in town transit to while it's very premature to do this. There's plenty of public information about how we compensate people and what goes into that calculation, so that should not be hard. atenas Good morning. I'm here to speak on behalf of my Youngstown North Delridge working-class neighborhood many or most of my neighbors are at work then two square blocks or 90 + family homes many residents are low income and people of color the mix of affordable homes with easy reach the city core superb Transit service increasing House housing density is exactly what the leadership of a region professors. We need more of its a neighborhood. That should be served by Light Rail not destroyed by Light Rail because residents and property owners were not notified in early 2018 by u.s. Mail as we should have been our input has not been part of the year-long St. Weaning process. We are in a drastic catch-up mode supplying input and pushing back. St. Level 3 Bose 3 Alternatives, but in reality there are no Alternatives all three decimate our Youngstown neighborhood. We are requesting that other writings be included in the environmental impact studies specifically the purple pigeon Ridge Tunnel and the Andover Yancey Avalon route with less than 5% of the required engineering completed these routes to serve for their study in addition the Mandate and openness to New Alternatives for studies such as use of Open Spaces open channels to both the North and South of our neighborhood if you the lies would minimize impacts on Residential Properties. On another note. I request part of your discussion today address the IRS process. We the public don't know what's happening with our scoping submissions. We want transparency. You may receive more than a thousand scoping comments. We want to understand how these documents we will be processed who reviews and evaluates the material and makes decisions. What are the evaluation criteria is adequate time being allotted weird you to allocate more time and move forward. It doesn't need a dates for the SAG and you don't see routing and station placement recommendations review of Eis scorpion submissions must be deliberative and Cyril. Thank you for listening. Is there some way to submit my comments? Yes, you want to hand it to the folks here on thanks tennis. Chris Hey Everybody Hate Chris, Delridge for a resident with some of my other folks and some of my folks are working right now, but I got I got out of work to come here. We recognize it light rails coming in the neighborhood and we recognize there's going to be winners and losers and some of us are going to be dispossessed of her house as we get it and we recognize light rails going to change your neighborhood, but it sound transit delivers right Light Rail projects. We have it observed it. Nip and Tuck itself in the neighborhoods around the region, but really I have not observed it really Pushed in a way where it's decimating an entire neighborhood. And I think that's what I'll call the the Blue Line alignment Del Rey station does there's 94 90 + families there that wind is going to displace and it's not 90 properties Along on mile of track. It's 90 families right in one place. And what's sad is after that. I think Sound Transit wants to use the remaining land for transit-oriented development. So I read that as condos and coffee shops for Tech workers. Well, Delridge doesn't need more coffee shops. In fact, we still go over each other's houses to have coffee in the my neighborhood and I'm here to ask elected leadership group to push the Sound Transit board to reconsider the Delridge a blue station in to actually look at some of the real other Alternatives that seem to be called there in level 1 or level 2 such as the Purple Line Station or the Yancey Street Station. We were like many of us. We never heard about the level one and level two things because we didn't get notified while the people up the hill might get a tunnel and Beacon Hill got a tunnel and Belleview get to the tunnel. I'd ask that we do as mayor durkan said measure twice cut once let's look at our options. We got the planning and Engineering talent to do that right behind me here with Sound Transit, and I just asked you to think about our neighborhood carefully. Thank you. 7 That's the last person who signed up on my sheet at their other folks. They would like to fight, you can come on for it after Deb has finished. Thank you very much. My name is honored to be a West Seattle representative to the stakeholder Advisory Group might have a few brief comments and I'm going to ask her I had my list of folks that my comments are directed to SoCal summer Johnson accounts are already left. If you could pass them on to them so councilmember Ryan and mayor durkan my comments are most attracted to you because we do have a lot of West Seattle residents up at the end is right now, but this kind of goes to everybody they say they say that a picture is worth a thousand words and a one hour tour actual visit with your eyeballs on West Seattle is especially the proposed Light Rail station areas and the alignments And these within the area as well worth your time and you owe it to yourself prior to your decision actually in West Seattle. It's an anomaly and I really need you to keep keep a hold of this fact within the alignment of the West Elder Ballard alignment only in West Seattle are there proposed impacts to actual residential areas, single-family residential areas are multi-family residential rather just spent all the other impacts within the alignment are going to be to commercial areas to existing industrial areas. So West Seattle is an anomaly and you owe it to yourself, please do it Port commissioner Bowman did she went on a wasn't a 3 hour to work? But she went on a tour of the Delridge area and I think was very useful. So please I'm asking you to make a personal visit to the station areas and the rain Alignments in lovely West Seattle. Thank you for adding the Delridge neighborhood to this ret discussion today as well. Thank you. Please introduce yourself. Yes, of course. Thank you for hearing us today. My name is Ty Aurelius. I'm West Seattle resident. I hadn't planned on making a public statement but based on some of what I've heard here today and the lastic holder Advisory Group. I've observed an opportunity and I felt that it was my my role here today at least speak and share it with you all from what I have heard both from council member Harrell and also from the stakeholder advisor group and their public comments today there seems to be an opportunity for outside technical expertise Within These groups as currently set up. It appears that all technical analysis is being run through Sound Transit and not that that's necessarily problem. But I think that if there's technical analysis three members of the elected leadership group The stakeholder Advisory Group and the board those can also interface directly with the community. So I just wanted to share that observation with you. Thank you very much. Make use anyone else like fight public comment. mentored Good morning. My name is John McAlpine. I just thought I would build upon push the Green lights on. Okay. Good morning names John mcalpin. I just thought it would build a pond with Deb Barker was just stating. I know we're here for the Delridge day. So we also we need to understand beyond the Delridge station level 3 design came along what's called an elevated 41st Avenue came into the picture and not only like the spoken earlier. Will there be a positive 90 Holmes families? Do you know we moved for the Del Rey station, but there is a recording to Sound Transit. They asked me to 9220 homes destroyed removed for the elevated 41st Avenue Station 41st Avenue route when that comes through we need to understand that. I don't know where that came from. And of course it goes to north south facing station if that chosen elevated and face for 4 St. For that goes through in the future. They plan on going elevated on 41st Avenue Southwest and taking out. They said they would just buy the homes on each side. Place where you heard the other gentleman state that Debbie the removal of hundreds and hundreds more homes. Heading out heading south from there down 41st. So I just want you to look for that. We're here for the Delridge, but also, please be a tenant pay attention to the fact that that elevated 41st that was introduced. It's just it's not a good idea, which if you move to me home with which mayor durkan has said that you'll just have the right way to go or not looking to destroy homes, and if I got to go in the west Seattle, keep it a tunnel you thank you. Thank you. I see no one else will go ahead and close public comment. And if I prisoners for this next phase a couple, so I'll just make in response to public comment one. Thank you for the invitation to come out west Seattle Delridge. I was out there a couple months ago on my own biking around looking but I have not done a formal to with neighbors know I know but I will work to see and I really rely on my colleagues who live in represent that area to provide a lot of feedback on that to everyone who sang or a number of comments about folks saying that they're able to take time off from work today to be here but that there are a lot of folks in our community of can't be here today and we recognize that when we have meetings during the day, that's a reality. That's why we try to provide multiple opportunities including the workshop 6 like comments and I just want to make sure the people understand it's not about the most people who show up today when did We are considering comment from all sorts of the presenters at some point in your presentation. We heard some questions about how the scoping comments will be used and transparency around that. So if you have a chance to touch on that and help folks can can see those and and a little bit of time and I'll be really helpful to Okay, I'll I'll kick it off with an overview the engagement we've done in the Dell Ridge area and West Seattle. So just as with the chinatown/international district station, we have looked at multiple different ways of engaging in Delridge and West Seattle free things meetings attending Community briefings there maybe 3046t folks their Community meetings events Community workshop at door to door Outreach open houses neighborhood Farm social service provider and Community organization interviews. So in West Seattle and we've had 27 Community briefings, 20, door-to-door conversations 7 social service provider interviews 5 neighborhood forums workshops open houses a number of tabling events and Gage a more than 1,200 community members and over 20 property owner meetings, as some mention there are a lot of property owners who had questions and we've made ourselves available to them to have conversations with folks in the neighborhood. Say more specifically here's a snapshot of the West Seattle briefings that we've had over the last year. I just know, you know, we've been out to Pigeon Point neighborhood Council for example, in terms of thinking about the Delridge Community the Delridge neighborhood Development Association. We've even been at ounces for a drink and Link where we talked about the light rail alignment. We have done a feet first walking tour where we looked at all the stations together with the feet first organization, including the Delridge station as well as a community briefing at Youngstown Cultural Arts Center with community members from the neighborhood. We've also done a number of social service provider interviews where we've met with actually social service providers right near the Delridge station, and those that serve communities all in the west Seattle area such as Southwest Youth and Family Services downtown emergency service center Cottage Grove Commons Delridge Community Center the White Center Community Development Association as well. I will try to be where folks are so we were at Delridge day in August as well as at a partnership with s. Metro rapidride H open house and at the Delridge Community Center. Actually, I'm as folks were there for the basketball games all around West Seattle in the Delridge neighborhood being there to let them know about the project and opportunities to engage. But that'll hands off the Cahill. I'll just briefly review the alternative processes and going on to the last year it started with a telescope and then we're going to a level 1 level 2 process. We went to they already scoping. In February of last year. We had open houses neighborhood forms Emily representing at that time with the representative project which is shown on your screen generating elevated structure would elevated say sit down right to Avalon Alaska Junction. That was our starting point story year from now. You're go I coming out of the artist clipping. We got a lot of additional ideas about Alternatives. We should should continue to look at so pleased to find what where are Level 1 Alternatives and you can see in the screen here at there were various options for Crossett duwamish on the North or South side of the existing West Seattle Bridge as well as the alternative that much further south which is referred to as the purple alternative. You also add various ways of going through the Delridge area would options along the west Seattle Bridge and blue dark blue the Yancey alternative which is shown in pink several options that go along Genesee and then of course the blue alternative that goes more of that to the West Seattle Golf Course like the alternative there. We got a lot of public feedback. All of our level 1 information was presented publicly again, and we got feedback in May of last year at this is the same slide you would have seen in previous LG meeting summarizing some of them feedback that we got at that time. So their concerns about and I stated Delridge station with a blue wall to dark blue alternative. There was support for shifting zelrich Station South. They're mixed opinions about consolidating the dalraida Avalon stations are also mixed opinions about usage of open space. There was support for the purple alternative and the was feedback to consider Shifting the golf course alignment further north light blue alternative. Coming out of the level one recommendation process from the EOG the recommendations were to not carry forward the dark blue alternate West Seattle Bridge fauntroy alternative to not cry 4 at the pink alternate the Yancy Street West Seattle alternative and then to modify the light blue alternative to be a tad less effect on Section 4f resource date the golf course. So that then to find what we looked at in level 2 and that's showing on the screen you can see the alternatives are mostly concentrated along the Delridge way and Genesee Street car door. we can do the level 2 analysis of those Alternatives and this public feedback is the same slide you've seen before when presented level 2 results the was support for a lower height guide way along at Genesee does General support at that time for the off-street Lower Haight Delridge station to light blue alternative that have more development potential which only concern involves two tunnels the recommendations coming out of level two were to not carry for the brown alternative which went on Argonne Street in Alaska Junction in Tonasket Junction area to not carry for the Orange Alternative which again was an Oregon Street alternative but elevated to not carry forward the purple alternative, which is the pigeon Ridge West Seattle alternative. But to add a new elevator alternative in Alaska Junction area oriented north-south and also move to tell Rich station further south. So that is defined the Alternatives that we are now looking at our happy looking at in level 3. And if you seen before we reach only have 3 and and Alternatives and speaking more specifically about the West Seattle segments, we have to represent a project which of course we've had to throw out the evaluation process. We have a second alternative which we call the yellow brown alternative and this is different than the representative project in a cup of ways. It moves to Del Rey station further south than was identified in the sd3 plan and also Orianthi Alaska Junction Station tubing in north south configuration in elevator configuration. So that's the second alternative the third alternative hits on a blue here with have a north crossing of the duwamish instead of a south crossing. It also moved to Delridge station further south, but also West furtherance that residential Community Youngstown area and then in the Junction area assumes tunnel options with sewn stations on either 41st to 42nd or 44th. So the key considerations with the Alternatives in level 3, they're on the table right now. We're up said the project obviously, there's too concerned with the East-West orientation of that alternative and that I could have complicated future extension a further south. It also is a more constrained location for the station on Alaska Street. It would result in a high guide way along Genesee streets. It would have some Park affects us to go Salon Genesee and that's to the West Seattle Golf Course and it location of Del Rey station was noticed a problematic for the proximity to the freeway and you corn with the orange alternative it would result and as we noted in public comment with more displacement between Alaska Junction and Avalon station that but it would have a similar number to Spaceman sindel Ridge to the other Alternatives would have a greater instruction to the neighborhood around Alaska Junction. It would result in the high guide way along Genesee Street to Delridge area. I would also affect Park area along the Ridge area that sell Golf Course. What the light blue alternative they would be sure to space in the Alaska Junction area, but similar number to space vents in the Dell Ridge area. It would have a lower height Delridge station at a ton of facilitate slower guideway alarm Genesee Street, but I'll stay at the tunnel could increase the schedule and quietest no funding and it would have effects to the golf course again. Some of the key differentiators with the Alternatives in this area if you look across and these are clear coated with station location. If you're just looking for Alaska Junction, there's differences in terms of proximity to California Avenue. There's differences in residential effects of this is broken out in Seattle on Junction area. And also in the Dell Ridge area speaking to a specific it's Delray's the residential effects would be fairly similar across all of the alternative terms of property effects. Again, just focusing on Delridge area that you can see that it would be greater property effects with the blue alternative to that area with with a business property effects of the new alternatives to that area. I got you a height with the red and orange alternates. You would have a higher guideway going through the Delridge area with a blue alternative. You would have a lower guideway height going through the desert area. And then of course you can see their comparisons in terms of cost estimates in a pause for 1 second. Do you want to ask a question? So the Or the residential property affects you are identifying that the Delridge households displaced are pretty much the same across all Alternatives. And the number that you're using is less than 41 of those. The number that we heard from community members was more like 90 households. So that's that's one question. My other question, is it regarded regarding specifically the business displacements would like to just know a little bit more about why the business displacements the square footage or so much higher for the blue line. Yes right now and again to point out. This is very early stage of analysis. But as we look at the Alternatives right now, I'm based on how to find we think the property has basements residential impacts are fairly similar across the Alternatives. We will learn more is it go through this process of us this out, but at this point based on analysis, it looks pretty Blue alternative in that potential business a spaceman's that's what he associated with whether you across the West Seattle that do Amish area on out of the North or the South side of the existing West Seattle Bridge. So that's why you're saying difference. Is there any thoughts as to the disparity between the 40 households in the 90 households in the community estimates? I don't know. I know what were your number came from Mike Kennedy say where the other number came from be great. If there's an opportunity looking both the Sound Transit and community members just to it is a difference of opinion that be great for us to know and if there is just some information that has been shared that can be clarified that be great to know to I'm just to speak a little bit about to do Amish Waterway Crossing cuz it does have some applications for what goes on in Delray to swell with represent a project and with the orange alternative. They would both be on the south side of the way system West Seattle Bridge. They would have effects on the Pigeon Point area the steep slopes around that area which is also a green belt. So that does enter into the equation. I'm also if you're on the North side, however, you're avoiding Pigeon Point and the steep slope issues in the green belt issues. But you're having a great effect on Port Port Terminal facilities rate. So on as some of the key distinction that area as a touchdown you are their effects are devoid Pigeon Point sleep slope on the Greenbelt property effects are fairly fairly similar in terms of the effects on Harbor Island soda. Would you have greater effects in Delray Beach area as you make that turn off Delridge way. After effects of asea to fix more if you're on the north side of the duwamish to the existing Harbor Port facilities, and then you also have greater potential is basement to order dependent businesses and a big city for South Acosta differences that area. Another question. That's why I think you on side 79 as it relates specifically to the construction along Spokane in a Southern Crossing. Could you talk a little bit about how that might impact access to the peninsula. This is a concern that the West Seattle Chambers recently raised. Certainly, whatever alignment we pick a long-ass across to Amish area. There's going to be a construction effects and we're going to have to assess what those are more specifically to go to the property is processed at this point of time. We wouldn't be able to distinguish necessarily one as being better than the other based on the information we have at this point. Okay, so I'm to get a better sense of kind of the contacts Community planning and Community contacts for the Delridge station on this station is going to be a key intercept for the future rapidride h on a plan line on which essentially converts the the current Route 120 into rapid ride service on it's also going to be an important intercept point for a service to South Seattle College on so this is really going to have a really deep travel shed into West Seattle into the Delridge neighborhood and specifically the communities of color are the are rat analysis A highlighted further down the corridor. So it's really important that Transit integration be a key design principle at the station when we zoom in on North Delridge itself a little bit more some of the prominent features that we know. Are the West Seattle Golf Course to Delridge Community Center and Playfield. And then the Amish Greenbelt also phenomenal a kind of set of different public park in Green Space uses on that really kind of form the heart of this neighborhood. So a lot of art really Outreach on the project we heard get the station a bit closer those amenities on to the heart of that neighborhood. So there is an existing a body of planning work done by the city of over the past several years recently published actually in the fall for the north Delridge neighborhood on North Eldridge action plan on and that that planning process and document yielded a number of ideas about how to evolve the neighborhood on it was also thinking or anticipating the potential arrival of of Light Rail kind of assuming the representative project location on but this is where a lot of pain as ideas that that we've heard an early out reach around kind of reinforcing arts and kind of really bringing art as an expression into the station design and planning on as well as thinking about Equitable transit-oriented development fordable Housing and Community amenities come from I want me to think about the current kind of zoning contacts and how the how the station's interacting with the community about 66% of the zoned land use in the station area. The broader station area is either single-family or low rise, so it's really important to note that as Deb Parker pointed out earlier very much of a single-family residential a kind of character on this neighborhood on another important future is the street Network when you look at the different station locations from the representative project in red to the blue as you move farther south. You have more of a street Network you have a larger walk shed. And that's what those are dashed lines are indicating his kind of the geometry of that walk shed, which is a function of the street network of topography on so, I guess you generally move farther south you serve more destinations of the station becomes. accessible by foot I'm so as we've looked at the three different locations and kind of develops the station Concepts a bit further on this is kind of where we are in the current level of design thinking the representative project. North of Andover on would have entries that could spend on both sides of Delridge way, you'll see you can have generally in these Graphics. The green lines indicate existing are the solid green lines indicate existing non-motorized facilities, like neighborhood Greenways and dash green lines indicate potential connections that could be made from those facilities directly into the station on the blue rectangles are around the different station locations indicate where buses could stop so as we thought about how these different station locations with interface with these different networks on the connections that you can make and how that affects bus operations and circulation while restoring to get of a little bit of a higher. A picture of how these stations work on. But first maybe I get a little bit more contacts for you to the station location. So the north of Andover location on would essentially be right near the on-ramp to the West Seattle Bridge. I was just have to be dramatic transition from a neighborhood arterial to a freeway, but it's also an important commercial note with the Nucor steel plant to the West in a couple of on Commercial establishments right at the corner of Andover and Delridge. She thought about this particular station location. Are we seeing opportunity on to have again direct bus integration from both sides of Delridge, but its location creates a more challenging pedestrian bike environment due to the proximity of the West Seattle Bridge on and that kind of traffic pattern and utilization pattern are really in influences the ability of passes to to easily serve on this area as well from an operational perspective us. It's a pretty challenging constrained site on from a land use perspective given the adjacencies to Nucor steel steep slopes on in the transportation infrastructure first nearby relatively limited development potential with this particular station location and specifically on more challenging to think about affordable housing in a Grecian into future going to station sighting and in development due to the site conditions. Remove Southland cleaner for one second. You mentioned that there is there a good bike facilities here but it still proposes a challenge because of the proximity on Rams. Can you can you elaborate a little bit shorter? So there's an existing Greenway Auto on 26th Avenue southwest it's just a little bit outside of I am still in that a little bit outside of this image and I at Greenway kind of dogs over on Andover on so it's an existing facility. It's not fully separated or protected. So that's something that could be explored later and design along with the city of how could be potentially upgrade the facility to make it an even safer for for cyclists on similarly. There are neighborhood Greenways a little bit up the the Hill from Andover. So the issue there just as is the the the nature of the the traffic the traffic volume coming out of Nucor steel the fact that on top of that you'll have a station. So I did there with buses. I'm stopping and integrating and then people Also picking up and dropping off. So this is going to be a it would be a congested condition and us raise the Specter of conflicts. Thank you. I'm so as we move South Orange Station location would be between Andover and Dakota streets on Delridge. Currently, the the alternative contemplates. It would be cited directly in the right of way at this point. You're a little bit south of that. Andover. No do your bit closer to the community amenities of the Delridge Community Center and Youngstown Cultural Arts Center. You're also next to an area that has currently commercial zoning including an office building recently Redevelopment project at Youngstown Flats as well as to the east on some undeveloped Hillside on can critical slope area. I'm in with that particular station location. Again Dove the opportunity for direct bus access from both sides of the street is pretty notable with this with this locations of us could stop right essentially beneath the station people could circulate up on it would be a higher station about 60 feet or so high. So you you would have vertical circulation time that you have to account for with that integration, but Builddirect on Direct Transit integration. It's a bit closer to the neighborhood destinations of the south on Genesee Street and again kind of a potential for connections to that 26th Avenue southwest neighborhood Greenway on Dakota Street and potentially even thinking about a potential Hill Climb that could go out to Cota and unimproved right of way there and serve the the Pigeon Point neighborhood from a land use and development perspective. There's some opportunity for smaller scale Redevelopment given the given the likelihood that we would need to acquire some property for staging in that vicinity on particularly and then come the commercially zoned area there between Andover and Dakota on but there still an effect from the guideway as it makes the turn to go uptown to see on the Youngstown neighborhood on and as a result. There are there fewer opportunities just because you have no columns and and and a guy to a different kind of footprint care. Rustic going to station on so there's less potential to translate those effects into Redevelopment opportunities in the neighborhood. The Third location of the station to Blue north of Genesee between Dakota and Genesee sites station as we've heard from public testimony on in an existing single-family neighborhood on residential neighborhood. Very intimate scale on so the introduction of a station here would be a transformative transformative move for this for this neighborhood. on as we kind of obsessed with that means I might be I guess I'll start with this one from kind of a land-use and development perspective that has significant effect on the existing residential neighborhood scale and fabric, but with that comes and an opportunity to kind of really really Envision on what a potential station in transit running Community would look like in this particular area and it's really the only opportunity that I'm the only station that has an opportunity to think about development at a scale that you could that you could really introduce some of the community amenities like a grocery store on that kind of required density in order to support those amenities on so it's a choice we made her choice with this with all these station location in Tranzit integration perspective are there is up slightly longer connection to the station for bus transfers unless buses to vert and we have explored with Metro that it would be possible to divert us. Consolidate the zones on in a way that kind of provide more of a direct access but assuming that didn't happen and buses remained on Delridge. There'd be a slightly longer walk and I need to cross Delridge way to access station. So it's important to note that there's an opportunity to think about bringing the 26th Avenue Greenway or directly into the station. I really can create more of a public realm around the station and also important to note potential opportunity to expand Delridge with a pedestrian bridge and an essentially go up into a Dakota Street hill climb on a house with the orange alternative. Thank you. I'll just wait to go back to the previous slide real quickly. So under land use and development that were the first bullet is largest effect to existing residential neighborhood scale and fabric. So I'm having a hard time squaring that statement with the earlier statement that it would be approximately 40 residential households displaced across all three. Word station options. Yeah, I think what that speaking to is that where is if you look at the other station options already on Delridge way, primarily the guideway itself. However, it does go through the residential areas that would be the effects with the guideway that manuscript SE have summer number residential affects overall. Not the same residences but similar magnitude arrested effects. I think what this bullet is talking about in this case with this particular turn the station itself is what in the residential community. So it's going to have a more direct effect that the station will have more direct effect on that neighborhood as it exists right now. Would you change that neighborhood what it is right now? So when you're saying largest effect to existing residential neighborhood in fabric, it is not focused on the question of displacement. Also speaking to the character of that neighborhood. Hey, so we did also have a community Workshop in Delray Beach on March 12th, and we had 94 participants with us and from that Workshop as well as other engagement that we've had through level 3 at we've been asking about Community neighborhood vision and values what people love about their neighborhood today and why and what they like to see in the future when the new light rail extension opens on here's a snapshot of what we've heard. I'm so folks really value the neighborhood parks green spaces the diverse topography Birds views and Longfellow Creek would like to maintain a sense of community and diversity which speaks to age income and housing type improve integration of all modes the walking biking buses and Light Rail some support for more small businesses restaurants grocery store family-friendly amenities. Another thing people have shared as they really like how it's affordable. That really close to downtown and that the future light rail station should fit within the current scale and character of the neighborhood. We then also asked about the level three Alternatives and station location. So keeping in mind the vision and values that we just talked about what community members like about these options and what they dislike and they're concerned. So here's a snapshot of what we heard. We heard considerable concern about Neighborhood Impact than residential displacement some interest in a station location close to the existing bike path near the West Seattle Bridge concerned about height visual Aesthetics and size of future station concerns that the station that represented project station is far from the neighborhood center and more challenging to access a smaller walk shed and in a more congested area in terms of traffic concerned with visual effects along Pigeon Point and slope stability with the south crossing at some interest in blending that represent a project station into the hillside minimizing visual impact with potential pedestrian. Directions to Pigeon Point, there's some preference for station location South of SouthWest Andover Street to avoid the traffic and congestion that's closer to the West Seattle Bridge. I'm interested again minimizing residential and business displacement and encouraging development that fits within the character of the community. Finally, we also have asked in terms of looking at the level three Alternatives if there are refinements to the Alternatives than station locations that would help those options better meet Community Vision and values. And here's what we heard a snap shot. So interest in using the street right of way along and ovary NC Avalon to minimize displacement and avoid Green Space and pack some interest in station location near the new core steel plant some interest in north crossing to reduce potential effects on Pigeon Point some interesting to station location further east to minimize residential and displacement in Delridge system terms that representative project interest in the purple alternative from Level 2 to minimize residential displacement and prove bus connectivity and serve the central part of the neighborhood and some interest in pursuing an alternative through a portion of the golf course to minimize residential displacement again, I again in terms of next steps. This is same slide. You see before this is where we are today in terms of the Alternatives. We will be reading all of this feedback and speaking to the Arid or comment about how the feedback will get captured. We will be cut documenting all of the feedback that we receive during the scoping. Into are scoping summary report on providing high level overview of that in our side meeting in April and then we will support after this process after we go to the Austrian stop a process that we actually identify work continues look at in the draft. Eis will still be continuing to engage the community moving forward just as we would be in the time tonight to the area and everywhere along the line meant will be reporting back to the community at what alternatives around the table and continue the process of refining this altered as you go through the process. I'm as we get into the is we're going to have a lot more information about impacts. We talked at a high-level about what the potential residential effects in this area are for example, or traffic effects are construction defects in general will have a lot more details to go to the IRS process MO. Do you think Ace comedian. And it's the station planning processor to be going on in parallel with the is just like in the Chinatown ID. The area will also be trying to engage the community in those station area planning discussions that anymore probably about the design Urban Design around the stationary is moving forward. Thank you, and I will lead off some public discussion. I'll let our facilitator Diane Adams know that I'm councilmember her Bolden. I have conferred and we can each keep our questions to 20 minutes each. My first question would be really around the neighborhood that were affecting here in North Delridge. I've walked the neighborhood with constituents and sat down and talked with many others. It is a fairly dense single-family neighborhoods couple townhouses, but divided lights affecting a pretty vibrant dense neighborhood. Do we Ascend Transit have experience in going through such a dense residential neighborhood with Ariel track or with alignment in the past? Restarting had residential effects. What are projects in the past? I'm trying to think. I have to think of the MARTA is pink eye specific examples of whether there's anything exactly Harlow to this control turned of I think it would be valuable to contemplate the density of this neighborhood and threading light rail that is very much desire to hear in North Delridge and the overall alignment into such a development Hood 2 degree. We've done it before what time have we learned that can inform our work here into the green that we haven't done it before what do we need to be considering? How how can we best think that through we also have some comments and some question in public testimony today about the purple line and As we have those those questions in that conversation. I'd like to know more about how confident we are in the financial numbers a lot of the concern that led to not taking the purple line further was financial and yet we were very early in design and we see very big fluctuations in cost estimates. Now as we do a little bit more refinement, in fact the North and South alignment over the duwamish Waterway flipped by hundreds of millions of dollars in comparison to each other. How confident are we in Woodmore study of the purple line further inform? Solid estimates I think with the purple line survey cost was one factor, but the way I see it was a lot more going on with a particular alternative that informed the analysis for the president able to I miss your call. There were a number of engineering constraints without alternative major issues a long. Of chicken alternative for example in DeSoto area. Is it going through South Soto door number of high power transmission lines that would need to be Real Madrid located with a particular alternative. We also have to cross the u p r goyard area which would have caught a very long span. It is the longest crossing the widest crossing point in the duwamish still would be a very extensive structure over the duwamish. It would go into a tunnel into duwamish Greenbelt. So would affect the middle of the Greenbelt and unstable slope area, which will be challenging and then of course it involves a tunnel is to involves two tunnels. So none of those things are like to eat them and they're not going to change. Those are still factors that informed our cost. Dismiss before at that time or estimate at that was that that the ticket alternative movie about 1.2 billion dollars more than the represent of project perhaps we could finish that alternative a look at it more detail, but would like to find out it's going to be all of those dishes that I described the still of the same issues that we will encounter if we were to evaluate it further. So it's still like to be very costly alternative those issues would still exist, of course, but our cost estimate a cost estimate Smite fluctuate like we saw them in alignments north or south of the West Seattle Bridge, I would imagine he breathed up the Dead the factors that we're dealing with here. It's a what like I said, it's an unstable slope. It's an extra tunnel. It's a y crossing of the duwamish to all of those factors are are still going to be very major cost drivers of the key cost drivers and That's the purple line. I think is the option that best address. The concerns that we've heard the issues highlighted in the what we have heard portion of this presentation. I do understand that the cost constraints are our concern as well as the engineering constraints. I'm assuming that the cost estimate include addressing those engineering constraints and I also want to so this is more of a statement than anything. I want. I want to speak to the fact that whereas the purple line was judged largely on cost because again at from my understanding the cost of 1.2 billion more included addressing the engineering and construction constraints identified. It was judged as compared to other options and people sell 1.2 billion, but I think one of the things that people Did not fully consider is that 1.2 billion included the 700 million dollar title for the junction. And so it's it in my thinking. It's a $500 Edition and I think it should be measured that way and weighed that way in in consideration with the race and social justice Equity issues that we've discussed here. Cast member Johnson, thank you. We sat here this morning and heard from many members in the neighborhood. I was reminded a lot of the board discussions that we had Ron way back in 2004 with the Roosevelt neighborhood who started chatting with the sound transit board a full 16 or 17 years before their Light Rail station with set to open about where potential station locations could be what property in packs were going to have and really started getting proactive. So kudos to you guys were still a good twelve years away. So stick with us, but know that there's a good precedent here during that 16 + years the city's undergone a couple of planning processes in the Roosevelt neighborhood adopted at least two different sets of lenses changes and probably will have three by the time the station opens and at the same time I thought a lot about Bus rail integration in that vision is changed a couple of times to so while I'm grateful saint that we've been spending time and energy thinking about what those things might look like. I also want to recognize that those concepts are likely to change and evolve over the next Dozen Years as we get closer and closer to a station location and closer to what we might understand Metro might want to offer in the corridor comes out. So I think that I'm using all of this isn't platform to say, there's a couple of things that I'm hopeful we will continue to take into account one that what exists there today will fundamentally change once we actually do pick a station that that's going to fundamentally change the economics of the neighborhood and that for a lot of folks were concerned about displacement one of the best anti displacement strategies. We might have is the actual construction of new development in the neighborhood so that people who may be displaced can still have a place to stay and then secondly, I was a little surprised that during the Decisions. Nothing was brought up about the 5-year force transfer at the Soto station. I recognize that that is not unique to this just Delridge station itself, but I think it goes without saying that that is a pinch point in the system already and will be as we open up trains all the way to Federal Way and Beyond we I think really need to continue to sharpen the pencil about the operating characteristics of that force transfer and I would hope find other alternative than what we have on the table right now, so wanted to offer those moments of history before I disappear from this group and knowing that a majority of sitting around this table are West Seattle residents that I'm sure that the folks out in the audience fell will represent. Cast member O'Brien first kale. Can you walk through the mix and match potential of the station locations in the Dell Ridge in this neighborhood and how does may impact a north or south crossing of the ship canal? And do they have any impact on what happens in West Seattle Junction are they all fully interchangeable their Call of Duty war machine West Seattle what happens if it doesn't start have a bearing on the duwamish crossing and you could be on the North or South side of the duwamish the existing West Seattle Bridge and accommodates any of the station options they were talking about in the desert area. Is that include the the red line? We can't get there could be the same profile and things like that, but And some only with the junction the main differences would be profile again. If you're in a tunnel in the junction vs. Out of 8 in the junction will affect the profile and outrage, but the alignment could be sounds like a lot of flexibility on the mixer. Second question Nucor steel was mentioned a couple times specifically does a comment about of interest in location being near the Nucor steel plant. What are we heard from Nucor steel is it was that were they saying they like it near them or do they have have they weighed in? I have not heard from Nucor steel. Most recently. We do have someone from new car on our stakeholders ice regroup when we've met with them early on their concerns were largely around the traffic impacts potentially with a station that would be north of Andover and how much their truck traffic moves through there. And that might be a challenge with hooks trying to get to the station. But beyond that I haven't heard anything else since the last point, I want to just lift up and councilmember Johnson touchdown this too is the reality that if at least Seattle's policies, give me a sound transit think so much that we would do this and coordination. But if we're going to make an investment high-capacity transit in this neighborhood, we will almost certainly do significant out of zones in that neighborhood to and dinner to the folks in a community that that are interested in what the alignment is indeed the direct displacement. In fact that I have that's obviously a very real concern on a variety of levels, but I want to I think through how he is a city can also be engaging that Community the same time about what are the type of zoning changes that we would likely due now, obviously a zoning changes very different than someone condemning your property to use for a rail station. But our goal is my goal would be to significantly increase their and now that we've recently passed the mandatory housing affordability that would come with additional unlikely significant requirement for affordable housing to be built in that neighborhood to as if he develops and so it'd be good for us to Think Through how we at least talk about the type of zoning changes we talkin are we talkin about neighborhood commercial dough rise? What are the heights of folks there can think about what that means as they're trying to figure out property values property Investments. They might be considering and also at that time. Can I do an add-on to that? I think one thing that you get a real appreciation for when you walk 25th. Is that although it's been described as a single-family neighborhood. It has the type of infill that we always talked about in our plane. Discussions is wanting so it is it is a very dense neighborhood already as it is. Cahill as you went through each station location you touched on one of the things you touched on was but bus integration. Can you speak a little bit more about how each one of the Alternatives integrates with bus integration that's being so important in reaching people further south through the duwamish valley. out the progression too slow Let me go back to business connections are really imperative at the station. Absolutely. So when we look at the three alternatives on you'll probably from the standpoint of keeping bosses on Delridge having Direct on integration from both directions of travel not needing to deviate buses the Orange Alternative performs really? Well how far from that regard the assumed kind of profile of that alignment is a bit higher so you have no more time essentially spent in vertical circulation is going up stairs or elevators on butt from kind of a a location and your convenience offer buses and bus riders. That's that's really strong on the blue north of Genesee again, unless you route on buses off of Delridge on the Genesee, which Metro would consider that would require a crossing of Delridge way for Northbound buses and train. I'm going slightly longer walk. I'd love to get a sense. I don't know how far along we are on this bed where ridership would be coming from to the station in particular. I appreciate the block shedding is we talked about obviously is land use changes that will change the the ridership trip generation will come from residential but I assume is significant force will be doing bus transfers from further south on Delridge. Absolutely. Yeah. And so this on this image actually shows you the slide 81 shows you the full extent of the corridor and the can of red line on that intercepts. Delridge is the proposed rapidride H routing which goes all the way from Burien on and is projected to go ultimately into into downtown via the 83 bus way, but we have also initiated conversations with Metro about possible a chef to that to that route once station comes online potentially even having that bus deviate and serve. The Admiral On Alki neighborhoods on but from the station South it's it's serving all of those communities White Center on Delridge Highland Park I even in town to be ran. The the I'm imagining they were talking about thousands of of potential transfers a day. And so as we think about balancing the needs of a variety folks. I think this is a stationary that I imagine really important to get that bus transfer right and you know if you need it or two Conversations so I know we've come in the other order in the past and as we consider West Seattle and chinatown/international District that we not feel rushed. I'm impressed in those conversations without Diane. Thank you so much any closing remarks Cahill and we talked about the the next steps on the when we closed out Chinatown International District, but there's one less. I just I guess a reminder that the the next elected leadership group meeting is on April 26th here in that at that time. We'll be looking for level 3 recommendations any closing remarks O'Brien? I'd like to as we started I'd like to thank everybody for coming off for their insights and comments today the issues facing serving Pioneer Square chinatown/international district and Delridge have unique set of challenges and interest that necessitated and precipitated this conversation. I want to thank you for coming to participate and provide this knowledge of your communities to us and I want to thank my fellow members of the elected leaders group for dedicating the time to have this conversation and look forward to the continued work we have in the next month before our next meeting. We're will be making receiving the recommendation from the stakeholder Advisory Group and making our recommendation to the Sound Transit board. One thing I don't recall if you mentioned Caleb how the agency plans to take this golden comments. As noted on this graphic. Actually, I will be some reason the key teams everything we've heard will be documenting the scoping some reports which was the movie will be presented to you before the next before you need to make your recommendations. I will be available publicly as well. Is it safe to assume that all the comments will be available to public in the summary document of people be able to evaluate yes to feel the uterus some point. So I just want to acknowledge that there may be a short. Of time. So I'll thank you to everyone a couple things that I will be focusing on in the next month is continuing to engage with a stakeholder Advisory Group and think through what are recommendation may look like obviously working with all of you between now and then in the course at the next meeting to Think Through in addition to Preferred alignment car alignments that we might be recommending some process things. We might be requesting and love to work with the agency on Picking through that how we continue to have Community input as a designs continue to advance come and parallel to the IRS. And also what if we want to think about formal structures for Community feedback similar to the e l g and the single Advisory Group, which will I'm a Believer plan to Sunset when this process ends, but is there something else that should carry on and what that might look like? So it made prescriptive or may not be prescriptive. We want to acknowledge that as we move forward and then there's some work to be done. I'm continuing with community members in the city of Seattle has a role to play along with the agency and so want to make sure we Foster those dialogues and make sure they were providing the support to the neighborhoods over here today to continue to work over the coming years to really refined this to get some options that can be really support the community. I'm in the ways that we all share those values. With that is nothing else. We will adjourn this meeting and thank you all.", "end_time": 10504.5}]}