{"format": "raw", "annotations": [], "confidence": 0.9544221532755884, "data": [{"start_time": 0, "text": "Good morning, everybody. This is the July 1st 2019 Council briefing meeting at Seattle City council chambers. The time is 9:33 a.m. I'm joined by council members Juarez Bagshaw Pacheco, Mesquita Gonzales and O'Brien. Thank you for being here in the absence of present Harrell. I will be serving as president pro temp today. And if there is no objection the council briefing minutes of July, June 24th will be approved. You're no objection. The minutes are approved today. We have two executive sessions and these combined sections are allotted for about two hours. And it's likely that at least one of them. If not both will go a little longer before that. We have a preview of today city council actions Council and Regional committees, which we hopefully can complete patiently there no items on today's council meeting agenda from the Human Services Equitable development and renters rights committee. The next meeting of the committee is scheduled for its regular time next week, July 9th at 2 p.m. We had a very successful meeting of the committee last week discussing with megido Argo and her fellow tenants at Bryn Mawr apartment building in Skyway. Bridge was facing eviction notices from Their landlord for no calls and she and her fellow tenants and Community supporters spoke up about this spoke up about their landlord terminating their tendency or wanting to terminate the tenancy with 20 days notice with no cause or explanation are organizing to are organizing. We demanded the landlord retractors. What would be considered an immoral the station and Ocean County to pass just cause eviction protection to the people living in unincorporated King County regions could be protected from these in justices. I'm delighted to report that as a result of this renter organizing. The landlord has retracted the eviction notices. We will continue to organized to promote just cause eviction protections Beyond Seattle including the cities and King County, which would have to be there on Just Cause legislation and also as in front of my Presley's my office will also be submitting legislation to close some of the weaknesses that we have in Seattle's just cause eviction protection. That's all I have in council member Juarez will be reading for council member harbold who is unable to make briefing, but I will pass it on to come Summer Wars. Hopefully everybody has a wonderful Fourth of July issues plans events lined up selling fireworks Sullivan to say anyways, so I got a bunch of stuff here and I got my stuff and I got counselor her build stuff and then we got some exciting other stuff that we're going to do together. Okay, so we have a public assets and Native cuties meeting on Wednesday, July 17th at 2 on Friday my district office for my district office. We met with five of our community center Recreation leaders or who are members of teamsters 117. We discuss their summer program upcoming needs for a community centers in the Parks budget. That's the Metropolitan Park District budget as you all know, I appreciate you being able to hear the concerns and lower about learn more about the work they do to serve our community. As you all know we met last week, but the Metropolitan Park District and we also received the report of their 2018 activity their financial report. Thank you counsel members who attended seal Parks District MPD will be transmitting their 6 year plan. I believe summer of 2020 next 4 councilmember herbold. I have two items. So the first one is the Civil Rights utilities economic development in arts committee has one item on today's full agenda the reappointment of Byram Simpson as a member of the Seattle lgbtq commission. And lastly. This is exciting. This is a lunch and learn for the AIDS Memorial pathway promo. If you remember a while ago, we work with former council member Rasmussen on this matter and I'm happy to see it come to fruition exciting news. I'll be co-hosting a lunch and learn with councilmember herbold in the Civil Rights utilities Economic Development Arts to enshrine the historical and current efforts of Advocates fighting to end HIV AIDS. Termination this is otherwise known as the AIDS Memorial pathway, which will be held next Tuesday, July 9th from noon to 1:30 members and members of the interdepartmental team will be presenting. It would be great and important to have as many council members present to participate there be an email invite from Dimitri and councilmember herbo's office questions can be directed to him. And right now I will pass out the information for the lunch and learn and that's it for me. Thank you. Thank you so much and good morning to be here with everybody in this short Fourth of July week. We've got two things on the agenda this afternoon at first is a landmark designation for the Ainsworth and Dunn Warehouse, which is the Old Spaghetti Factory for those who aren't clear up where it is. We're also going to be voting on an ordinance. That is a Proviso lift on the esler Crescent Improvement funds. We talked a lot about this at the committee the other day and I'll speak more about it at 2, but I'm very pleased with all the work that's gone on with City Hall park with Prefontaine Fountain area all day on two Forts and square so that those are what we're voting on today. Bobby Humes who is our designated Human Resources Director nomination was also voted out last week unanimously, but he's not going to be here for the next two weeks. So his designated appointment will come Council on July 15th, that's two weeks away. So colleagues. If you have any expectations for human resources that you would like to add please let Allison to my office know we'll make sure that that's on expectations letter. So I know that you're all really excited about budget and finance issues, but we have a number of things that are coming up on July 10th. And that's obviously 10 days away from today. We're going to have further discussion and possible vote on the sweetened beverage tax and short term rental tax ordinances councilmember Brian. Thank you so much for all your hard work on. So if there are issues amendments anything that you want to discuss, please make sure we get them this week. There are several that are in the queue right now and councilmember over and I'll be back in talking with you about it. So you've got an alert this week now also back to exciting budget ordinances and budget updates we've got on Next several like the next six weeks. Actually we're going to be having budget oriented items. The 2018 exceptions ordinances you things that happened in the last few weeks of December. We are also have a 2019 carry forward forward ordinance will have a 2q second-quarter supplemental. We will have a second quarter Grant acceptance and a 2019 capital of Bandon meant those are projects that are done, but are in the budget that will be transmitted to us this week. So we'll probably be having special meetings on July 31st. My office has alerted your offices as well to get on your calendar to hold August 9th and August 14th. We hope that we won't have to have all those meetings, but we want to make sure that they're held so that we have an opportunity to talk and fold Council and have them voted on prior to our recess. So Alison MacLean in my office is the person to have your staff talk to you if you got any questions. Thank you very much. Thank you guys work for Jacob. Good morning there. No pleasure way to Adams in the full Council agenda today the next bus committee meeting will be the next plus meeting on July 3rd has been cancelled and the next meeting will be on July 17th. I am very excited people doing the 80 legislation this afternoon as a heads up on proposing an amendment to the legislation a full Council today. It would incentivize bike parking in dadu's by allowing up for up to 35 square feet of by parking to be Exempted from the square footage limits subject to certain requirements. It would also request that opportunities to expand public bike parking in single-family zones. Last week. Please feel free to touch with touch base with me or no on my office if you have any questions, and that's all that I have for today. Thank you. Thank you. I think you Thank you madam, president. Good morning. There are no items from the housing Health Energy and workers rights committee on today's full Council agenda energy and workers rights committee will have a public hearing on four pieces of legislation tomorrow evening. That's the four pieces of the hotel workers legislation that comes summer Gonzalez and I are co-chairing and that many of you showed up to hear the public testimony. Thank you very much for coming over Salon. Dye comes out of a chetco council member. We had a folks weren't working full-time. So we are having a hearing tomorrow evening. I want to clarify it is at 5 p.m. 5 p.m. Tomorrow night. So if you need childcare my office or directly to Ashley. Harrison at seattle.gov, we will make sure that you have your complimentary child care spot reserved. If you do show up we will also make accommodations also want to Use public transportation. If you do need to drive we're going to have a subsidized parking at the seaport garage located between Sherry and James Street on 5th and 6th Avenues and it's going to be discounted for rate of $5 that begins at 4:30 p.m. And the garage will close at 10 p.m. To will try and get folks out of there before 10. Our next regularly scheduled meeting was going to be July 4th this Thursday and for obvious reasons that's been canceled. So we will be meeting next Thursday, July 11th at 9:30 a.m. I want to know if your folks that there is a along my list of items that we will be discussing including the domestic workers Sanders board appointment the office of labor standards recent social justice presentation, a possible vote on provider wage inflation legislation, the hotel workers industry standards discussion, and I'd the notice of intent to sell or none. So ever are regularly attending committee members were going to be checking in with your office to see if there's a possibility of extending that it a little bit more 4. Thursday July 11th and always welcome everybody to attend as well. Today is the first day of the implementation of the domestic workers Bill of Rights. And we're going to be taking off around just before noon to go celebrate is out with a handful of domestic workers themselves. Just as a reminder for phobe minimum wage rest and meal breaks the right to take a day off. If you're working consecutive days in the eye protection from retaliation harassment and protection from having your documents withheld begins today. So office of labor standards is going to be doing that enforcement and we will make sure that that information gets out to both workers and hiring entities so they know their rights and responsibilities under this new law. For the good of the order we are going to be working over the next week or two with our friends and you don't mingle which many of you have organized with her in the past. She is the leader of the effort to bring delegations to Cuba every year. My parents just went on when this year. Some good friends have gone past years. I know many of you have friends and colleagues and maybe have gone yourself with Cindy Domingo or other delegations down to Cuba to ensure that people are having the chance to learn directly from the Cubans there about health care and education and workers rights and the history of the Revolution. It's been a great collaboration with Cindy and others and what we've seen across the country is Mini City standing up to support the Cuban people and also to call for reducing the Embargo and if the impression that they impose so one of the things that we're really excited about his bringing forward a resolution this month that will be similar to what Saint Paul has done with Detroit has done I was being called for in the capital of Minnesota. Is to support the folks in Cuba's will be bringing that forward and look forward to working with all of you on that Michael Maddox. He also has a birthday on Friday July 5th. Thank you manager Madam president. Thank you. Thank you. Good morning. Everyone. Happy birthday to you. He's having a birthday on July 4th. So I have that's a real reason for fireworks. By the way is her birthday and we only have one eye on it this afternoon the gender of from the gender Equity safe communities near Americans and education committee that is agenda item number 7, which is an ordinance related to the Community Service Officer program. So this particular ordinance will lift a Proviso that the city council place on a 2019 budget in order to allow. What the Seattle Police Department to engage in some Community engagement to better to find a program and two into also at take that work and create job job descriptions job posting and give us a better sense of how that program would be re-implemented in in the new iteration of the Community Service Officer program. So this afternoon's action on full Council will lift the Proviso and will allow the Seattle Police Department to move forward with hiring community service officers. For those of you who attended committee will last week. You heard that I'm in about a month-and-a-half the police department received three hundred applications for 12 positions, and I just got word late last week that the Salem Police Department decided to read open applications not for a lack of applications or quality of applications. But because they feel it's really important to just continue to take applications on a rolling basis to make sure that they have the best qualified pool of candidates. Bring if you were interested in the job description. I will bring a copy of that to this afternoon's full Council. They are prioritizing folks who have experience in social work. For example, I'm in an inter of other soft skills and including Community engagement to make sure that this position is really going to focus on addressing a lot of the conflict resolution issues that sometimes come up that don't necessarily require a law enforcement approach. So really excited about taking this final action, and that is all from my committee. My friend. Thank you. Let's see today. This is your transportation committee does have his energy and item I've been anxiously awaiting this agenda item for I don't know for years or something now. So so this afternoon's agenda we have legislation around the backyard Cottage Adu and detached accessory dwelling unit legislation. Thank you for all of your engagement over the years and it's pretty clear the last couple months as we've really got into the legislative work on the final final drafting. There are three amendments that I'm aware of how the first is simply a guy clean up amendments. So we'll just introduce a substitute that cleans up language. There's nothing substantive in there and his Amendment which I support you mentioned would allow a little bit extra space for bicycle storage, which I think is a great thing and I really appreciate your work on that the person that was in committee. I think what you're trying to do and I I had kind of given up as a thing that can happen and I appreciate you you and your team digging in and finding a path that actually makes a lot of sense. So I think that's a great Amendment. And then finally, I have amendments just as some language would end of the audacity to it builds on was already in there about asking the city to look at how these accessory units are being used specifically short-term rentals vs. Long-term rentals and stating that that if it turns out that a significant portion of them are being used for short-term rentals going forward that the city council would consider modifying regulations to the ship that are hoping that we would like to see the mostly used for long-term rentals and I believe that's what's going to happen this and see what happens if I would love to hear about that, but I'm not aware of anything else on that the sustainable and transportation committee also meets tomorrow on our agenda. No, we have not see if I can pull the same back up. We have a couple appointments 1 to the sweetened beverage tax Community Advisory Board 1/2 the urban forestry commission. We also have a couple Grant acceptance ordinances one specifically for Delridge the rapid rise H1 project. And another is a series of projects. I believe they don't have a presentation on commuter benefits smokes me recall we passed legislation. I think it was last year did require Employers in Seattle over circumcised to provide pre-tax deductions for bus passes a Transit passes for further employees. And we want to talk about what the options are there and so will get it and then I'm going to have a briefing on congestion pricing in the budget a year-and-a-half ago. We set some money aside to study some of the Congestion pricing would impact folks that study was finally released in the last month. And so this is a chance for the executive department was in that studying. It's the first of what will almost certainly be many as you go down this path, but it's so important as we go along to to be up to speed on that the last thing I'll just mentioning committee. I talked briefly about 35th Avenue Northeast Saint another video. S. Has gone out and put some backup second watch the a helmet cam video in committee about a month ago after they're done the redesign essentially illuminated Elena parking to add a traffic travel Lanes. There's no three lanes in the video showed was a lot of high-speed illegal passes. The people are making it a center turn lane. I saw a video that was put up over the weekend. I think it made The same writer with the helmet cam appears that I started going to put some barriers between the center turn lane in the the travel Lane to prevent that this one particular video shows someone passing in high speed through the intersection and then coming back before they hit the Ballers to get back in the lane. And so it's a really tight pass and it just unfortunately at least enough video it makes it look like the solution has made it less safe. And so we're taking a couple steps on this what was not a great Street to buy time to begin with m. Now. He's made two sets of Investments to make it worse each time. So I'm in a sheriff's report will show that video and just have a discussion about that briefly. There's no particular action about that, but it's really disconcerting and I we have such a great track record of doing some really good safety work in the city and I just think we're getting it wrong. Seem to be doubling down with some bad Investments. I've not gone out and looked at it since the bollards went up. Can you tell me I have we looked at the neighborhood Greenway expansion. I know that there was an extension on 39th, but you know, that's four blocks away and down Warner Valley there and what is there anything? Is there anything going on right now with the uphill streets? I think 34th. Maybe do we know whether they've been discussion about having a green way there off of 35th and whether that's even available. Yeah, those are great questions. I don't have the answers. I don't believe A lot's been done on 39 and I know people have said that there is a green way there but there haven't been with any improvements as part of the package. Is it ongoing question of 1500 my belief and I believe it's any policies that we make are Cheerios safe for folks to buy Khan and we give them Alternatives. It's not an either-or to both and and I know there's been discussion about 34th. I don't I'm not a we should have stuck to the table to address those questions. Turn off for the comments. We will move to the executive session scheduled for today. There is a standard good for executive for starting executive session, which I will read now as presiding officer. I'm announcing that the Seattle City council will convene an executive session. The purpose of the executive session is to discuss pending potential or actual litigation the council's executive session done an opportunity for the council to discuss confidential legal matters with City attorneys as authorized by law illegal monitor from the city attorney's office is always present to ensure the council results questions of policy for open sessions. I expect the executive session II end by 11:40 a.m. If the executive session is to be extended beyond that time, I will announce the extension and the expected duration.", "end_time": 1345.3}]}