{"format": "raw", "annotations": [], "confidence": 0.9435227817677437, "data": [{"start_time": 0, "text": "Good afternoon. This is the regularly scheduled meeting of the Human Services Equitable development and renters rights committee of the Seattle City council. It's 2:02 p.m. On June 25th. 2019. I am, 7000 member for District 3 I am unfortunately I it is far as I know not going to be joined by council members Juarez and Harold were committee members who haven't found my office if they are not able to attend today's meeting for our first agenda item. And this is something that we just had a press conference on we will be discussing the lack of Just Cause protections outside King outside Seattle in King County in Seattle. We have a just cause eviction provision, which means that a landlord can evict a tenant only if they have a real reason and the real reason meaning illegally justifiable reason reason that is mean documented in the law. So it could be the tenant it something wrong. If the rent was not being paid or if something else happened that that's being legally recorded as a problem or if the property owner wants to do something different with the rental home, which is demolish it or none of those situations are ideal for tenants, but it is important to fight for every law that closes existing loopholes. So here in Seattle. We have just cause protection we don't have this as far as I know in any other part of the state we would we have people here to talk more about that are more knowledgeable about it, and hopefully we'll have more inside. The case of beer talking about today has affected tenants in unincorporated King County and we are asking King County to pass just cause eviction protection to cover all people living in unincorporated regions of the county and I believe that Nick Jones will stopping my office. Can you tell me that we have copies of the letter a reason to King County? For those who are here, please make sure you look at the the the letter that I sent you the King County Executive in King County Council urging them to pass just cause protections for all tenants in throughout King County, which would impact all tenants who live renters who live in unincorporated regions of the counting. We also have sent a letter to the landlords and we'll be talking more about this in a second and I will share some some of the contents of the letter we are we are going to be discussing more about that in a second and for a second agenda item. We have a presentation from all home about the results of this year's Town point in time. I really appreciate you all being there are presenters for the first item are already at the table. But before that we will have public, did anybody sign up for public comment? There are currently no known sign up for public comment. Please go ahead each person has 2 minutes and make sure you sign up. So we have your name for the record. I want to salute people that are bravely coming forward when are being evicted for other people and not themselves and putting themselves on the line. And that's what we need to do in this country right now, you know, we're living under a fascist regime and the most the most marginalized people we know are being demonized like the kids in the concentration camps that are being abused. And so we all have to be in solidarity with all the people who stand up for people that are being evicted. It's adjust a nun cruel thing that's happening and I salute the people that are brave. Thank you very much. Can you please state your name for the record Bridges? Thank you. Please sign up. So we have your name. Hello, my name is flora and I'm here to support my good friend great leader in our community manager to argue and the tenants who are facing these 20-day notice. I'm here also because I want to say thank you to Tenants Union for helping and supporting our families and our communities when they're I needs not only when people in that building are facing the 20-day notice better than is necessary to start doing something in me really because their families in the tenants on the mount Mountlake Terrace is also facing in doing that 20 day notice things today mayor of the city of Mountlake Terrace. She's supporting and I'm on board on wagons to work in a fordable housing also, so I think like my sister we need to be United in these because it's affecting our only one group or one Community is affecting every single person especially people with low income housing. So I'm here to support everyone because we all We going to be in this situation one day. So thank you very much. Thank you, sister, Florida. Sign my name later. My name is Sarah Stillman. And I'm only here to speak from the heart about in case people aren't aware of what it feels like not. To have housing I almost didn't and luckily I was able to get in subsidized senior housing here in Seattle. And what I want to say is the moment that you feel that you're safe in housing. It is huge. I don't think people who have that. Have any idea what it's like to not have that sense that there is a space where you are safe to be yourself, and that's all I wanted to say. Thank you for your time. And thank you for what you're doing. Thank you, Sarah. Assuming nobody else wants to speak. I will close public comment. Amazon are all presenters, please State very brief just introductions for the record and then we'll start the discussion. Hi, I Renee Holmes and I'm here to support Magee to and all the residents of Seattle who are facing displacement. I'm also here because I currently reside at the Chateau and my aunt lived there for 30 years and a developer has decided to tear the building down and they want to build a small efficiency unit. So Sean's team came and helped us organized and now we're organizing and developer said that they're going to give us more time and they're offering US money to move out but we're still waiting for them to put that in writing. So I'm here in solidarity because we have to do what's right sometime. I am filing all the time for the tenants Union of Washington Mo Housing Advocate. I'm also a director and for advocates for tenants rights. I'm here to support not only our friend and she's a social justice sister. But also what is happening right now in our whole state not only in just King County. We want to bring like to some of the things that tenants are facing these 20-day notice is My name is Metal Gear 2. I am one of the people who got the 20 days notice and South King County and I'm here today not only to advocate for myself. I want this sufficient to stop. I don't want anyone to face this anymore and King County and Washington State. Hi, my name is Devin Silvernail. I'm with B Seattle. I'm also a member of the renters commission but here in personal capacity here to support monkey to and everyone in her building who are facing the same issue and then also to reiterate with Violet had said that 2020 date notices are a Scourge on Washington State and they are waiting we'll talk about soon. You know, they aren't they are used to discriminate and sit to retaliate and they need to end not just in King County but all over Washington. Thank you. Thank you all and will get into the discussion in a bit. I just wanted to frame the discussion by bring the discussion by echoing some of the point that were made by flora and violet in others that murky to Argo herself is a and being a long-standing and highly respected Community organizer. She is she is currently employed by the city of Seattle and she's doing Outreach was Seattle democracy voucher program before that. She worked for years both for one America and seiu775 defending the rights of people facing abuse and discrimination and for working people and the fact that she is now facing the same unfair treatment from our landlord that she has been two years defending other people against is the irony that illustrates that The only Justice we can get as regular people in this world is what we organize and fight for and so on that note. I wanted to give more you do some time to talk about how does upholding came about and how you ended up reaching out to my office. The first of all I want to thank councilmember kshama sawant and her stuff for helping me even though I work along with this office for a while. I didn't even think this will happen to me because I've been advocating and organizing in South King County not only residential business owners to stop the displacement on June 10th on time. I've never got any notice that and paper for close to fourteen years last for how long I leave there Monday morning June 10, if I'm not mistaken if it's Monday afternoon when I went home received a letter on my door hanging and I open it the seis 20 days have to leave this tent and tenancy if I don't stay will evict me. I was nervous. Awesome. Are there single mother of my daughter is coming back Friday from college Western Washington College and I didn't know how to tell her we're becoming homeless. Any race the manager May 1st this year. She doesn't even know me to give me a notice 20 days notice. So she did not answer the phone. Sometimes she pick up I can tell because I live there for a long time is supposed to go to that voice message, but it doesn't so I walked into her office this person ever see me. I don't know how she figure out because she map out the three people who got noticed we all immigrant McGee to Muhammad. You can tell just how different names. So anyways have as soon as I walked to call you and see how do you know who I am? Can you tell by listening to your voice message? Who that person look like so this is just very sad and try to play a game because my name is Margie to I don't speak English. I can't fight for my right I do she's messing with the wrong way. But thanks to other people who knows my work. They did send a letter includes kshama sawant office and it wacp one America. The tenants Union of course and then try to call never answer she pick up one day. She said I'm busy. Can I call you back and she never called her back? So this is what has happened to me and my other people who couldn't be here today. She is also from Southeast Asian single mother at least I'm better than her because my daughter is grown up horses. Only 8 years old. Do you have to take him to school in the state of looking for apartment for 20 days? Thank you for listening. Thank you. Maggie do it's difficult. Can you tell us according to the landlords notice? When is your date to vacate today's 25th and 5 days the 30th, which is this weekend? Unless I said I work everyday 9 to 5. Right eye ups and here I have not noticed that you got from your landlord and I I don't think it is at I think it would rather to put it this way. I think it's completely unconscionable that this that you and your fellow tenants are being activated. We don't think you should have to vacate without any real reason that the landlord has given you that is why I wanted was wondering if a violet could you as a in terms of your experience as a leading the tenants unions work? Can you confirm that Seattle is the only city that has just cause and what happens when you don't have such a law on the books. So yes Seattle is the only city that has just cause when you are on a month-to-month Unfortunately, in other cities If a landlord gives you at the beginning from the 1st to the 10th a noticed it is legal to vacate at the end of the month. They have to put the notice in between the 1st. And the 10th Seattle is the only one that has the just cause laws some tenants don't even know that and so when they call the tenants Union, we refer them to sdci here in the city and then it gets the ball rolling to help them which is the city Department as easy as a city Department City Department of the Just Cause laws is really good. I mean it's not the greatest but I can say it's really good because they're the only ones that got in Seattle the the tenant and the landlord has to if they want the tenant out they will be they will be giving 90 days. They also have to have a good cause to be asked to leave also if their income Qualified everybody's income-qualified when it comes to Seattle because it's outrageous, you know some of the rent still so they're qualified they can get moving cost fees. We always get calls on the 20th day notice. We're not just getting it. I can honestly tell you this is not a unique case this happens every day. This just happened last week on Mountlake Terrace tenants there in another city. What we're doing is making sure that we're bringing light to these notices because it increase in homelessness. Thank you. Thank you Father Devin you I was just going to add that in the last legislative session in Statewide. There was a lot of activist and organizers were asking the state to reform the eviction laws and they won some good things. Like they won the four people that are facing an eviction for not paying the rent that Used to be a three day notice and now it's a 14-day notice and that's really good for people outside of Seattle want to think that they did not win one of the things that the state legislature completely they considered it and they failed to do it was passing just cause stay wide. So if landlords outside of Seattle can still say 20 days notice you're out for no reason at all really quick. 5600 is the 14th days now, it will go into effect in July 28th because of that that law ordinances that passed we're seeing more and more frequent 20-day notice because now it's turned into 14 days for the tenant to find help. So thank you for bringing that up. Thank u n n Devin. I know you're here. You're you're you're on the right destination, but you're here in person capacity. But nonetheless can you tell us about the the sum of the principal things that the rental commission is advocating for and that you took a unanimous vote on and I believe some of those issues. John what's happening tomorrow get to another fellow tenants what's happening here? And what's happening almost everywhere in Washington violets. Absolutely, right? You know, I've actually talked to people who've gotten 20 day notices for things as little as leaving their windows open, you know em, and they can get they don't even need any kind of excuse to to kick somebody out. But here in Seattle at the runners commission recently. We've been working on MeetMe Louis Pasteur recommendation off to this committee for rent control, which coupled with Coupled with just cause is needed in all of Washington state could save millions of renter's in Washington state. We also sent a recommendation to this company for a hundred and eighty days notice for rent increase has obviously it's not necessarily the same thing, but I think it falls into line with the idea that more notice is needed for anything when it comes to our housing 20 days is not enough 30 days is not enough 60 days is not enough especially, you know, when you have a family when you work and said that most of the things that were working on at the moment and then obviously I think as renters on the renters commission, we all live in the city of Seattle and have benefited. I know personally myself. I benefited from from the just cause laws and things like that so I can't speak for everybody else, but I bet you if you talk to any renter in the city they have benefited from that. Absolutely and Maggie to how long have you lived there in in your apartment? And also can you tell us a little bit more about your fellow tenants how long they've lived there and also haven't they spend their own money. Do I fix some of the things in the apartment and all that? I first moved in and 2003 and then leave there until 2012 for a 9 years or so and then I change my car. I've been doing a lot of different things to change in the house, but I was not able to change the whole time. I asked them they didn't want to that I moved out so and then my daughter drop their she always say mom, lets go move back there two years later and 2015 earlier. I moved back so all together close to fourteen years. Every time we have better than this new manager, the owner is the one who tell their managers or managers are trying to change the carpet or make a good living for the tenants. They will get fire. So thinks is the owner of the property and my other two tenants that is got the eviction they live there for three years. And they also one of them she live in single-family home not like me an apartment. So every time she have to change things broken down. They don't go change it because the owner what them not only the manager have been bad or the maintenance and recently the person who told us who got the notice is the long-term maintenance guy who live in the property. Also first time they cut his hour this new property manager. The second thing he he he was talking to me and talking to other who got noticed to connect us because he works in the office. He knows who got it. He got fired. So the maintenance person is our ours got shot and then was fired was fired in retaliation. Yes, and also they want to evict him from the mobile home that he's leaving next to the owner and you can all search Steve Harrell. That's the owner name owner of the land the land but the management they try their best to accept this new manager who came and she the couple moved down here from is Eastern Washington, so they're very racist. That's all I can say. Thank you. Did you want to eat something? But yeah, that is so true. You know people don't like to use the word racist in housing but housing is racist. It's not a Quality Inn and housing. This kind of notice is the norm that we see almost every other day at the tenants Union. If you're a month-to-month you can be asked to leave for absolutely no reason and that's why it's vital that we we plead and we asked the King County council members to take action right now to set in motion to help more people stay in their homes. I hate to say this but this is the norm. I see this all the time and I write really I write letters everyday to landlords. Some of them they get mad at me. I actually don't care but I'm asking them. It's his immoral. It's there more out, you know, it's immoral for them to do this because people say the landlord's always say to me Will Turner property. How about fairness? Would you like to be served with the 20-day notice if you live there 20 years, that's the importance of the Just Cause laws in Seattle, you know when tenants call us. We are just we just share with them to just cause low and we tell them to contact the city. Yeah, I'd like to even at Kuwait Violet is saying so the eviction lab which is studies eviction across the country. You know, they found the common narrative is with eviction that it's the last resort. You know, it's the last thing that happens the landlord's try that's the common that's a common narrative but the eviction lab found that normally with evictions. It's the first Resort for landlords these days and and violet absolutely right and and and Marty to subtly right that are housing policies are rooted in racism and they always have been and landlords will use that to to retaliate against folks. But what's even more Despicable about the 20-day notice is it you don't even have to go through the eviction process. You don't go to court you put this thing up on someone's door and then and then you expect them to leave. So the landlord isn't even even going through with the process because they know that they would have nothing that would hold up. Absolutely. I think there was a very important point to add the event that and and the eviction lab has done some incredible research to show us that it's not evictions are not the last resort for for landlord to deal with a trouble trouble tenant. It's it's it's the first result. It's part of a completely exploding housing crisis. You were you doing our fellow tenants are facing, you know, they they have this notice to vacate and they have a few days left. What do you think? They should do based on your own experience of having to fight a carpet developer? Well, they're doing some of it calling press conferences put it shutting the light on the owner because you have to shame them and make them they can do what they want. But morally is it right and make them think what you like is if it happened to you or your daughter, you know, you have to because these days are a lot of developers I think or just thinking about money but we really do have a soul and I hope they haven't lost their soul yet because what does it a profit if a man to gain the whole world but lose his own soul. So everyone that they need to do some soul-searching continue to fight organized with the other tenants shed the light so that everyone knows what's happening and it's it has helped us at the Chateau that other Cadence real estate is slowing down now. I just wanted to tell you when we talked in the office yesterday to some of the other some of his neighbor's some of the other tenants who are facing at this and one of them at the landlord gave him a rent increase and then less than a month later served give him the 20 day eviction notice for people that don't have the piece of paper in front of them. I think that it's worth people knowing just just how little informations on it. It says you and each of you are hereby notified that your tendency of the promise is located at blah blah blah blah blah is terminated on the 30th day of June 2019. And on that day, you will be required to surrender possession of the premises to the owner to do not search trying to prove possession of the premise of these premises honor before the date set forth about judicial proceedings will be instituted for your affection. And that's it says nothing else doesn't give a reason it doesn't give ever anything then the one other thing is Are you too you're mentioning somebody from this building that this happened to previously. I was wondering if you could share that also. Person that I know for a while because I leave there and she is also from Africa like me I live there and that she was evicted last year. I didn't know that I was working last juneteen weekend. She came by my table since I received this later. I asked that I received a return and what happened? Why did you move out what she said? Yeah. I received a 20 days later also and I become a homeless the mother become homeless the daughter found a place with her husband somewhere else and they threw a lot is not only that she mention to me they have to pay the apartments some money and they still making a payment. Rights, do the presenters here to have more points to add. I was thinking that we are close out this again item, but with a call to action clearly we have several fronts to fight on one of them as McGee to and Muhammad Al and have joined us at the Times Union and ever and other organizations who are alongside our office Council Office urging the city council of the County Council to pass just cause and we will keep at it and I hope everybody in the audience to support us and knows everybody's watching this will support us in demanding that King County do this immediately just a couple of things on that as far as We Know. It was when they do pass this law and we will make sure that they do it will impact it will it will enable just cause a reduction in all unincorporated regions of income. So that means that the city Incorporated cities under King County also need to pass their own laws because the state that has not been edited pass the floor then it would be the easiest thing but the but I said was mentioning unfortunate the state legislature failed to do its political duty this this PATH station. They didn't lift the ban on rent control either and it's really an application of responsibilities at a time when millions of people in our state are facing a deep housing crisis, but we will we will need to keep fighting ourselves. So we need to keep doing this so well, I just wanted to let everybody know that we will make sure that thing County does this but at the same time my office would also be sending letters to the city council and the mayors of other cities in King County as well. Bring them to do just cause as well so that it protects hundreds of thousands of renter's in King County. In addition to that. We also have to make sure that monkey doing Muhammad Al and another are not evicted. They don't have to vacate and as an emerging to said we have a very very short timeline. So does everybody agree with me that we have to do something this week? We have to fight this week to make sure that the landlord renews their leases and Racine's the notice to vacate more to make make sure that happens but we should all understand from the example 040 apartment building in the Central District the way we are winning victories against the corporate developer is not by trying to get the city council to pass some esoteric ordinance. What we did was actually fight on the ground. So we will need to engage in some sort of action outside the building in the coming days. So I really hope everybody supports us. And in the meanwhile in the next several days, I hope you will all join my office in a call in campaign in a write-in campaign for the landlord. We we have the in the address and the phone number for the landlord. We will be sharing that we want to make sure that the landlord hear some hundreds. If not thousands of people that you stand with Maggie to and Muhammad and Len and you do not want them to be evicted from the premises. Do we are going to have to move and we will not have attained justice. So we have to urgently move forward doing that. We also have to fight on the front of the just cause we should just one last question for you to you and your fellow tenants and a representative from the tenants Union visited a King County council member yesterday. Can you report from that meeting quickly? Yeah. We had a meeting with the David of groups council member from King County even though he's not the council in my district Larry. RI District are we had a good meeting and we going to follow up he's going to do some check up and then get back to us. They didn't have any information about the 20 days notice how they affect people so they going to do some research and get back to us. Okay. So thank you all for being your please. Make sure you look out for an email from my office, but we will share all the information so that you all can join into calling campaign. I really also will not be able to attend potential Union and be Seattle to also share that with your own mailing list so that you know, it's it's the message goes out far and wide and we want to make sure that all the tenants have their home and then you know in the coming years. We will Kia keep following up a King County and I also just wanted to end it on and on this note a debit card. He said at the renters commission has made it very clear and you know, this issue has come to our committee renters rights committee is Seattle have just cause like you said Violet is important, but it's clearly not enough that is not enough. There's an eviction epidemic in our city and region and that's why we need a comprehensive set of policies to address this housing in justice as the rental commission and said we need a 1.120 day notice we need the we need also rent control and that's why I am really happy that I represented some Tenants Union BC a larger because you stood strong on the question of rent control and Renee and murky to are shining examples of tenants, you know, women of color working-class women of color who are fighting back and as McGee to set and I'll close on this they messed with the wrong person. So let's fight You to everyone for coming. Our next item is a report from all home. So if our presenters could please join us at the table. Hello. I don't know. Good. How you doing? Good. Thank you. Thank you for being here. Thank you doing. Jackson's Council Central staff I am sure that was for acting director for all home the Continuum of Care lead in Seattle King County. And Jennifer coldiron the chief of performance measurement and evaluation for the Department of community and Human Services. Yep, least you have to go ahead and do you want to introduce Jeff? Presenters are from all home and I'll be presenting on the annual point-in-time count. In this case. We label as Countess and it's a requirement that that continues occur regularly do a point in time count to take an estimate of the number of people experiencing homelessness in their region. And this is the latest report from our region then and allow them to go into further detail on the data. Thank you so much. And I really thank you for the time and thank you for allowing us to expand the topic even further than Countess and this year. I come alongside Jennifer coldiron from our performance measurement evaluation team at King County because we want to talk about multiple sources of data about what we know the scope and scale of homelessness in the county. So will present a little bit about count us in but first will actually go into the revised home assistant dashboard that we wanted to I walk through in more detail important thing. I want to start off and saying is that we know we have a crisis in this community. We've been in a crisis of homelessness since 2015 formally but we have thousands of people Outdoors without a place to be at night. I know you know this well and so we want to know as much as we can about that crisis. We do see some signs of progress that we want to build on in this year's point-in-time count on but the reason and were sharing both the point in time count report as well as the dashboards is so that we look at all sources of data quantitative data that We also need to be talking with our community understanding the needs of people experiencing homelessness by speaking with community and understanding those needs of the quality of information is just as important as what we were sharing today, but just as contacts, I'm going to have a Jennifer kick us off in talking more about the home assistant dashboard that we've launched at the same time as the point in time count. Thank you so much for allowing us to expand the topic and imprisoned on our dashboards. I want to really give credit where credit is due to my staff to Sarah. Are they all and Christina McHugh who spent many months working to prepare? Lots of other people have also been involved in getting the dashboard where it is. So I'm really excited to have a chance to Showcase it here. There were really multiple reasons why we undertook a redesign of the all home websites portion that talks about system performance and homelessness data and that was released in response to feedback from stakeholders. I'm that want to do. It was more intuitive more fully encapsulating the the situation on the ground and as we developed our Data Systems, we realize we had a lots of desperate dashboards that we really telling a cohesive story. So we went through a process of redesigning this dashboard to pull together all the day that we could bring to bear to better understand not only who is experiencing homelessness. But also, how is the system responding to the homelessness crisis? So I think you'll see something that is a little bit more cohesive and we think that it's really important to release this now we worked really hard to really sit alongside the point in time to count to send numbers especially as our community is having conversations about how best to organize governance around homelessness we can get this is another very good dataset and and way of informing the conversation, so I am here just to show you the dashboard. The dashboards are exactly where hopefully people are used to going to look for homelessness data. So it is at all home kc.org. That's not going where I wanted to go all home kc.org. So this is the all home King County website and I in the same place where the system performance dashboards and dashboards used to be found under our progress. You will now find our landing page for updated dashboard. So I wanted to show you that that's where the data that people normally would have navigated to for the system performance is still here on your program performance, but most of what I'm going to show you today or actually a new visuals and new compilations of our data all of the data comes from the homeless management information system. So from hmis and so that only speaks to households that have touch The homelessness system so that the homeless crisis response system. So as if Kira will share the point in time count is another piece of the puzzle but also helps us understand who is experiencing homelessness, but might not yet be accessing services. So they're there different different datasets the landing page here. You'll find it has four main tabs overview currently serve the crisis response and program performance, which will go into in a little bit but it's really designed for somebody who's coming to this website and just wants to better understand homelessness. Maybe, you know hear something on the news wants to better understand. It's really designed to pull a viewer through a series of questions. So the first step is just what is what am I looking at? I'm at Orient people towards the data. We've been pulled out several dashboards, which I'll get back to the key questions that people often have That the public or the media have then we talked about. How are we addressing the crisis? What are the key parts of the homeless crisis response system. So prevention crisis response and housing that often leads to questions, but what's causing this crisis and so we wanted to make sure that we had something about root cause these are the five areas that one table explored as root causes of homelessness and then below people might ask. What are you doing about this? How are we doing as a system? And right now, we have a rapid rehousing dashboard highlighted, but we plan to have this be a slider of different dashboards as we develop them out question. Do you do you on your terms of the traffic you get on the website do you track? What do the original like what kind of people are accessing the website is it other service providers? Is it people who are facing homelessness or family member of people whose family members or friends are facing a better. Look. Do you have any insight into who seeks the theater? Because it. I would find that inside folder now. I'm we do I attract some analytics of our website. This is again hosted on the all home website on those are the entire regions data. I couldn't answer the specifics about exactly who that's not track in the analytics of just the the tracking of of how long people spend on her page. And what pages they are going to though. We do have analytic information about who is part of our listserv who's engaging in all homes media and newsletter on a regular basis generally touching really all aspects of our community the General Public public and private funders service providers people experiencing homelessness. I couldn't say to what degree but we definitely are engaged with all those communities and others. I'm so I'm going to show you a couple of the key Pages some of the newer visuals. The first one that I wanted to highlight is how is homelessness changing over time this relates specifically to the data. That secure is going to talk about with a point in time. We wanted to have a space that was able to was able to help people understand the difference between the hmis data that most of the dashboards are built off of as well as the point in time count data. So here are a four years worth of data are the top line are the the household accessing services in the homeless response system at the last day of January each year and we chose the last day of January because that most closely approximates the day that the point in time count is conducted so you can see that the the top line is it varies from the bottom line, which is that the point in time count. Of them have increased in the past 4 years the major differences between the lines is that the top line with hmis data is about households. So units of people coming could be a single adult. It could be a youth and young adults or it could be a family with with minor children on the bottom line. The point in time count are individuals so that that's the difference between the two addition as I highlighted before of the households accessing Services is based on hmis data, which means that the household has to have been served by the homeless crisis response system. Whereas in the point in time count. We know that some of the people who are counted are not accessing or engaging Services yet. So there are some major differences between the two but as they relate to one another and sort of look at Trends over time, it can be useful to understand I one of the other things when looking at this that we wanted to highlight. Is that over the past 4 years. We are seeing more people or more households accessing services with a homeless crisis response system compared to how many are being counted in the point in time count to us. That means that this that the homeless crisis response system is scaling up to meet the demand. We are obviously both are going up there are more and more people that are experiencing homelessness, but the system is also responding and serving their needs. So that is one of the the main new visuals that I wanted to highlight. The second one is on its currently served and this is where we look at homelessness ever time and how many how many households are a being served by the homeless response system. So again, this is a snapshot of the last day of every month of the year. I wanted to highlight again. Just like what the visual that you just saw the trend is increasing but obviously there is some seasonality and some changes over time. We have one major change here in September of 2018. And this is due to a change in how we are managing the coordinated entry for all Q on September 7th 2018 households that were on the Q but had not been active in the homeless crisis response system for more than 90 days were removed from the queue to better align with best practices nationally. And so that resulted in a drop of people or households that were on the Q by about 3,800 households. So another words that should not be interpreted as exactly it's an administrative change. I'll see that Ripple through the other dashboards that I'm about to show you. I'm so I really wanted to highlight that that that's one major change that we can point to a specific thing happened on this day. And that's a lot of why we're seeing that particular dip. Can I ask you I know that I with so if this is based on hmis data and individuals experiencing homelessness have some privacy rights and can make some decisions about whether or not they want to provide that information. Do you have any sensitive kind of the margin of error? You know how how accurate these numbers how how accurately these numbers reflect the real kind of on the ground situation. So this speaks to the number of households being served speaks to the number of households being served whether or not they are identified or not about 30% of households coming into the homeless crisis response system locked out of providing identifiable information, you'll see that that actually impact one of the other visuals and I'm about to show you where we are looking at episodes of homelessness where we need to be able to track one household through may be being served by multiple. Graham's, but from the time that they first enter to the time where they have left all services. So with that were not able to match across those households if they are if they have opted out but this is a this is a count of everybody in the in the system. the next one I want to highlight the currently serves we do breakdown by multiple demographics and other other factors like veteran status. I wanted to show you some of that here though because it's it's a little bit more condensed. This is the same information but shown in a more easily digestible form. So of the 12705 household experiencing homelessness on April 30th, 2019. And again, these are experiencing homelessness and receiving services in the homeless crisis response system about 51% of those households were sheltered 79% of those households were single adults about 11% families with children 10% Youth and Young adults 9% of the heads of households were veterans and 40% of the households were white compared with 28% of how did peasant households being black or African-American and on this bottom graph. We have included the King County. Population estimate so it is estimated that about 61% of King County residents identify as white and 40% of the households experiencing homelessness and receiving services from the homeless crisis response system or white classify the data. If it's a family unit that does not have children you just down to my single adults. The reason I'm asking is we have actually obviously families with children are counted as families, but we've seen a lot of Community member to face homelessness who don't have children, but are either a married couple or are a couple, you know, who would like to gather and some often the crisis their faces that they don't have shelter space that takes both the husband and wife often. This is a bigger crisis for people. Of opposite-sex obviously because offended is gender-based shelter space and so it's a specific thing that I think tiny home Villages are addressing where you can stay as a family unit. So I just was curious in the data. Is there any space to record a family of the family but without children, you know? I don't know how to answer answer that in terms of data. We do have that information. So where you're saying individuals this is truly representative. Just if it's an adult-only household, they will show up in the adult. I'm just not seeing it there because I think they would be in here counted as adults but it's an interesting question that I can work with my team around how to tease that out. But this particular data is an individual state of household page, right? Yes. So if this is based on the status of the head of household because we're talking about households that could be a single adult. So they're their own head of household. But when it says, it's a family with children, then the the racial breakdown veteran status in and whatnot is based on the head of household status. Okay, if we are able to separate that out as well because it seems like this is The real issue that people face having the data according to that would be good. Yeah. I woke up with a point in time count as well. Okay, good good to know the other is if a person is a result of orthogonal to family status and all that it is the head of household status which when you think about it that the adults the single adults and then the head of household for the families would be likely maybe a few of the view thing in adults, but given the age you count the mess and not in veteran or do you just not count them at all in the breakdown? It's a fairly complete data, though. The other piece of that is a lot of importance Eng highlights of a brand new methodology is what we're calling our inflow outflow dashboard and this is the crisis response. So this is really one of the key features of the updated dashboard is a way of talking about. How is the system responding? So a lot of the dashboard that you just showed you is specific to households and individuals within those households this section of the dashboard is about how is the system responding? How are how is essentially the demand for services being met so we have created logic around what is an episode of homelessness and that includes if from the time that a household enters the system for the first time either we haven't either they have exited everything previously. They have never been in the system before or they've been completely inactive for at least 90 days. That would be if they come back that would be the start of an episode. They could be served by many programs during that episode and not until again. They have a The exit out of all of those systems or services or they have been inactive for over 90 days. Would it be considered an end to their episode? So this is looking at households entries and exits and in 2016. You can see here that there were 20 or about a little bit less than 21,000 new entries into the homeless crisis response system coupled with about 18,000 exits. It's about the same but increasing the same proportion in 2017 and 2018. You see that the outflow bends towards the inflow. Some of this is due to the see a change that I highlighted before. So about 3,800 households were taken basically were exited out of the system, but we did do an analysis without that change to to see what Happen and we are pretty confident that the outflow would still Bend toward the inflow, but wouldn't cross it. So we are still again encouraged that we are seeing some progress in terms of the rate at which were resolving a homelessness episode. And that even though we are seeing more and more entries into the system. We are still able to respond at scale. I just want to emphasize that this look at entries and exits is a new methodology for looking at this impact of the system and it is truly our most effective way of understanding true system-wide Regional impact knowing that it's not based just on a funding source or just on a particular intervention but truly system-wide. What is a household experience and what is our systems ability to meet the demand of it? It's one of the main ways that were able to relieve D duplicate the data. So by looking at an episode and figuring out how to determine what an episode is were able to Not Duplicate them and count them multiple times, even if they were served by multiple programs, so it might have taken multiple programs to help them stabilized and exit the system. Yes. Yeah, I'm sorry if you already specified this and I miss this but this this Instead of a lens into the data to entries and exits it is it counting episodes and you're trying to avoid duplication, which is very useful what you just said. But over time is it is it accurate to say that there might be the same individual who had an episode got it resolved. But then again fell into crisis and then had another episode. Yes, and and presumably I mean just speaking just from I mean, I don't have statistical numbers with me, but I would imagine that is not an uncommon occurrence either just because people were on the brink facing 9 episode then maybe something resolving it but essentially the situation not being resolved in in such a way that you're totally out of the woods and that is why we say entries and exits and not households as the Baseline. There. It is. Definitely true that there are some households that experienced multiple episodes of homelessness even within one year worker. I'm doing some analysis about like overtime how much that is evil within one year. The average episode per household is 1.07. So it is actually fairly rare for the same household to experience homelessness like a habit of completely new episode within that year, but obviously those are bounded by artificial calendars. So it is something that we're looking at is that flow. I'm so this methodology is really helping us look at more of the Dynamics of the system in the interest of time. I'll just highlight that we do break down on the exits by episode. So where people or households are coming from and where they're exiting. I'm sorry. This is very difficult to read up here. The Highlight here is that 79% of the new entries are newly homeless in the past 24 months, which means that that household has not been served by the homeless. system in the past 24 months for the past two years. We really have no way of knowing if they were ever homeless people could have experienced it many years ago and other places. So that's why we chose the 24 months at 29% of exits are exits to permanent housing 6% are to Temporary housing a very very small amounts are deceased and 46% are exit destinations not reported that is for many many different reasons. It could be that we have lost touch with that household. It could be that they've self resolved and didn't choose to walk back in and say hey I'm fine. Now, you know, they've moved on there are many reasons why this is the case. We've done a lot of work to improve our data quality in that respect. Last but not least we have any more timers. Then I will show you just the last one. if you can go back to the by episode in Indus River counting if you are so 29% existed to permanent housing and the 6% is temporarily housed. Situations all types of shelters and does it also include in formally organized options? Like if somebody found a family member or friend to take them in is that is the two categories temporarily house with friends or friends or family temporary or permanent solution found a space? Are tiny homes? I think that might still be a program a service but I don't think it depends because there are different categories of sorry. I just wanted a permanent housing isn't permanent Supportive Housing. It's just any permanent housed Arrangement so big it could be that they are with their mother and they feel like that's a permanent solution for them. Last but not least to go back to the landing page and again highlight that we're trying to answer a series of questions here. The final one is how are we doing? This will likely change over time in terms of what we choose to highlight and I don't know why it's not resolving. Sorry to hear. It's a it's a lot of data. It's pulling. I'll just speak to what's supposed to be here. How many exits or how many household exits to permanent housing in there are each year. So we just talked about the the proportion of exits that are two permanent housing and that's one way of looking at it turns of proportion. There's another way of looking at it in terms of just the wrong numbers and again speaking to the system scale and what the system is having to do here and year-out scaling up and being able to meet the need so, you know in 2016 4.9 thousand households were permanently housed in 2018 6.8 thousand. That's what I have. This was just recently updated in terms of the quarter data. We will be updating the monthly data every quarter in the same way that we did for the system performance, but obviously some of this will only be updated once a year and we will be adding new dashboards over time. To the slide decal we can do questions on anything at the end all quickly go over the point in time count. I want to tie the two of it together to note that for one that point in time count is an estimate. It is just a snapshot of one given Night Jennifer did a great job of outlining the key differences really hmis is it is only able to track information on individuals and households touching the system in some way shape or form and with the point in time count. It's just one given night. So it's just that point in time. I'm in it also is able to capture in and count people that are potentially not connected to services at all, but not all of those individuals and I'm so we know that it is still a baseline. It is an absolute undercount. There's no question to that. We're not saying likely another account is another account. And so while we see progress in the point in time count this year that I'll talk about and we also see you just threw the hmis system that we are scaling up as a system. We are doing more and more. Connect people to Service as more households are connected to Services every year and we see more permanent housing placement through our system every year but that is not scaling to the degree that we need. We also learned from that data that we know more more households are falling into homelessness in our community than we still have the capacity to support. So we continue to see that Gap and need to address the crisis just a bit of background technical background on a point in time count. This is a federal and state requirement. Federally-mandated every other year. This 2019 count was a mandated reporting year for HUD and we will be doing the count in 2020 and I can talk a little bit about that as well as 20/20 is a census year most communities across the country Bolivar carrying out their point in time count because of that and can you give him that it's a hard brake line. But as you said, can you tell me how in recent years especially since the crisis exploded in the Seattle region? How to point in time numbers here compared to the Bay Area or other other hot spots for generally speaking we've seen a trend of increasing homelessness particularly on the west coast and particularly in unsheltered homelessness. So we are not alone and many of the trends that we're seeing both in and children homelessness increases also with increases in vehicle residency and just that the challenges that we see changing unsheltered populations and needs of people who are experiencing on homeless shelters homelessness. There are a wide variety of reasons for ranges of results in the point in time count for one. There is Broad requirements from HUD about how communities carry out the point in time count but not a chosen methodology. So every Community does have a slightly different implementation methods for our chosen methodology and implementation of that methodology depending on the scale of homelessness in their Community their region that the This is will be the third the results that were sharing here is the third year of carrying out to the same methodology for three years in a row prior to that. We were doing what's known as a hotspot counting really honing in on areas where the people were known to be experiencing homelessness. But again throughout the entire King County region starting 3 years ago in 2017. We began a full enumeration of King County. So animation of all 3398 census tracts in King County previous to three years ago. That was when Seattle King County Coalition on homelessness. Did the did the cow tripe crack a subset of people not capturing people who are couch-surfing or doubled up temporarily or permanently staying with friends or family. It is really covering unsheltered and sheltered homelessness and on the sheltered side it is I only estimating people who are in Emergency Shelters safe havens and transitional housing so that the sheltered side of the account that you see in the hmis data really is even a broader subset knowing we're capturing folks who are engaged with any type of service in the system and in the shelter during shelter the people who are the cooler, how do you call it a vehicle residence and I'll get into details about the components include the observational Street Count which is what many of our committee members get involved in as volunteers or the guides with lived experience to help their expertise in form a how we carry out the account but that's the to 2 a.m. To 6 a.m. Hours on one given night this year January 25th and really going out into those regions of the county to do an observational count only additionally there is a Youth and Young Adult within account within 24 hours of the general street count. And then there is an effort to D duplicate those numbers. That count is really heavy heavily Reliant. When are you service providers and system Partners to really go to places where young people are accessing services and conduct a survey on with young people during daylight hours following an account. There is a survey conducted. This is a sample representative survey. So we surveyed this year approximately 1170 individuals where we get more information on demographics and characteristics of people experiencing homelessness, but that the full enumeration is only an observational count. So this is intended to supplement that information and then the sheltered count is captured through hmis as well as a survey with programs that are not currently participating in each room is Thanks for the birthday. I mentioned methodology changes. The methodology has not changed within those three years. We have continuous Improvement efforts. I'm getting feedback each year from volunteers from guys from those who have helped conduct the count on to try to make improvements over time, but those improvements did not change the actual methodology in 2019. We had more than 600 volunteers and approximately 130 paid guide Physicians desert. Again people that lived experience offering their expertise into the count itself and a virtual 100% Can canvassing of all regions in King County. That was true in the past also. The three-year the past 3 years before that. It was just a hotspot counting. So hot spots within the area and not all senses track. There are things that I places that we think are not part of the census tract. So I come to the green belts and that's through thing that sometimes people so we do work with some Partners in a community to have some specialized efforts around particular regions of the county that might be difficult to count by volunteers or maybe less safe for just general volunteer members to go out and count encampment locations of sanction and unsanctioned fall into that category is over the past couple years. We've been able to track the sanction encampment sites through each of my ass, but with the unsanctioned locations or self-managed locations, and we've worked with either the leadership of those locations of those sites or without reach teams and or without reach teams to make sure that folks that have relationship folks that are part of those communities are helping estimate those particular areas. That's where there's a particularly a large number of structures or tents in Canton. Because it would be difficult for a volunteer team to simply walk by and count the number of structures in that area. There's additionally special accounts for The Late Night Bus zones or bus routes and for unsheltered families. We have a particular centralized process for a lunch of helping families are connecting to shelter we use that as a proxy for this. The overall results. I'm sure you're familiar by now and then speaking about this a lot in the community, but the overall estimation in 2019. Was it 11199 individuals were without a permanent place to be getting that is both unsheltered in unsheltered individuals on that one given night this reflected in overall 8% decrease a 3% increase and those that are sheltered again an emergency shelter transitional housing or safe havens and a 17% decrease in unsheltered homelessness. And this is the first decrease that we have seen in seven years. We look to the point in time count again as for Trends over time, we want to understand the direction of our system. The decimation is not perfect and what we look for is sustained Trends and so we are course hopeful about the directionality of this unsheltered count going down but also want to see that sustained over time and know that we have a lot of work ahead to make sure that that is the case and we have the services to address that need. In your estimation is it accurate to say that now that you've shifted to covering large? We had all of your senses drives and you're not missing any hot spots either look so it's like Annex a superset of what used to do and we're not excluding any I think there's a better likelihood that we are capturing all hot spots again. It is known that this isn't under count their individual stats. We are not able to observe and just a street count. There's also people that don't want to be counted in and make their best effort to be out of line of sight. So I do think that we have and I think before this three years, we did a good job at our Coalition partners and partners rather. Can you do a good job of the hotspot approach and yet this is still an imperfect tool. The thing I want to point out here in particular is looking at specific populations on so we report both 210 our local community specific results for families for Youth and Young adults for vet. And what we see is an overall decrease across all populations weaves now seen decreases for families with children for 4 years in a row. I will say the point in time count is a very difficult to specifically to measure unsheltered homelessness for families. So I say that with some caution but it is also a continuing Trend and so we we do again find hoping that we've also seen a veteran homelessness decline now two years in a row unaccompanied minor homelessness has declined two years in a row now to 63% since 2017 and Youth and Young adults and total decrease by 28% over last year. That's the first overall decline for Youth and Young Adult homelessness, but we also have a lot of effort underway right now. It should truly collaborate and strengthen our efforts on the youth and adult homeless system. I know that our partners at all home in the city of Seattle our youth action board and you care came and spoke to the select committee on homelessness about that yesterday. So again, these are successes that we want to learn from But also continue to measure against what we see in the homeless management information system and continue to track overtime. Some specific information as you had asked about we do not just track sheltered vs. Unsheltered locations, but where people are staying outdoors. And so we generally saw the shelter population living outside or intense and unsanctioned encampment increase in this last year while vehicle vehicle residency decreased in the 2019 count. This is a change from what we from the results that we saw in 2018. It was pretty much a flip from that there was a decrease in in tents and unsanctioned locations in an increase a sharp increase in vehicle residency. And so this is something again we need to learn more about when you try to attract all sources of data. We have been tracking information about who in hmis is reporting as staying within a vehicle when engaging and services but that's just started. I think mid-year 2018 and saw something that we want to look too as we get more data captured in multiple systems on to better understand this I'm we have sub Regional information that we learn. We always want to emphasize that this is a Regional Crisis and that the it's important to look across all areas, but understanding a little bit more about what's happening region-by-region most regions of the King County area saw decreases in unsheltered homelessness the exception to that was Southwest King County are Partners in South Southwest King County have shared that they felt that they had a more comprehensive volunteer pool and approach to their account this year than they did in 2018 and thought that this number really represents what they're seeing in their Community, but again better accounting in the southwest region in particular So in terms of disproportionality, I was here for at least part of the earlier presentation. I used to work in a tenant rights and really care about that topic as well. But they mention about racism and discrimination is of course true in our homeless system in in the experience of homelessness. What we see here is continue disparities and even increased disparities and the point in time count results particular for black or African American communities Native American Alaska native and Hispanic Latino. We did see a sharp change and the results for American Indian Alaska native. We work really closely with our partners in need of organization see disturbing organizations over the past year to improve our efforts and how we conduct account within the native Community to make sure that we had surveyors in need of serving organizations surveyors that are native people and we need that same Equity lens truly across the entire count. So I would say that this year's count of 10% Representing American Indian Alaska native is more reflective of our community. It does not necessarily indicate indicate a sharp increase of native homelessness. It's more effective. And then again, we need to take that approach and all of our data is a community that is compared to 1% of the overall population experiencing homelessness for the homeless system and what we see in terms of intersection of race and homelessness. This is the impact of hundreds of years of institutional racism, and we know that because it is consistent not just in this community, but across the entire country. for the same populations additional disparities at approximately 64 and 64% of people surveyed or living with one or more health condition behavioral health conditions be the most frequently reported. This is in comparison to 6.4% of people in the general King County population reporting living with a disability. I do want to know. Cuz we've had some questions about this that we saw some decreases and the number of people that reported having a mental illness or substance use disorder in the count this year. Those are very difficult day. It's typical data to estimate its dependent only on the sample survey. And so there's limitations and fluctuations in that type of reporting and it is depending on multiple questions within the survey. So I'm not just whether people are experiencing a health condition, but if that is a disabling condition Categorized as a disability and also the above the one above is talking about behavioral health condition than this is all the population that under 65 that has any disability so it could be physical disability as well on that among the homeless Community as we see to our measures anyway, in terms of what kind of disabilities are most often things, you know, I would not listen to speak to that. I don't have that data off hand, but we can certainly provide you with more. There's a there's more detailed information in the fall account to send report and then of course the date of that we collect in each of my ass will offer an additional information to share a w grade if you can have because I know I really appreciate you including the slide specifically because we know We know that people with disabilities are again disproportionately impact boundlessness, but I don't think it is recognized widely enough that this is a particular population that experience is it just because the chart brought me to race. I didn't want to miss the other piece here that we also know that people who identify as lgbtq our experience homelessness at much higher rates particular young people who young people experiencing homelessness report identify as lgbtq at about 34% compared to 20% of the general homeless population and just 5% of the overall population probably all in under counts as well. But that needs our attention and and both on all of these disparities. We need to be explicit better solutions to truly address the crisis want to lift up just an advocacy moment here that has recently released a proposed rule around Changes to the equal access rule which would actually challenged protections that have been in place for people who are transgender and and their access to housing and we have been speaking with our federal partners and we had all home at Kane County City Seattle and our Housing Authority Partners. We're all really lifting our voice to that issue in and help others do as well. And I think that's it. So any other questions, I think that was the end of the present a lot of questions, right? Great & Final. That felt I feel the question of the Trump Administration that I think that is really important. And obviously we are continuing to update these dashboard. Those are live the point in time count happens annually, but the dashboards are live data updated quarterly. And so if questions arise as we want to navigate through so you get a sense of what you can find. So please do Explorer and let us know. What are the questions come up. Remind me I need to officially agenda meetings.", "end_time": 4926.3}]}