{"format": "raw", "annotations": [], "confidence": 0.9552711786135383, "data": [{"start_time": 0, "text": "Good afternoon. Everyone. Today is Friday April 26th 2019. It is 12:03 p.m. And today we are having a special meeting of a gender Equity safe communities new American Education committee. It is a lunch and learn and I am very excited about being able to host this. I'm council member. And I've on Sundays chair of this committee and I hope to be able to be joined by some of my colleagues later on in the presentation several of my colleagues are actually over at the Union Station having a conversation around the alignments for Sound Transit between West Seattle and Ballard. So that conversation is you might imagine is going a little bit longer than we had anticipated so they are running a little late, but hopefully they'll be able to join us in due time. So I am on today's agenda and I'm really excited about this item. We will be hearing from Puget Sound Regional Council on a presentation of the work that they have been doing a revision 25th or the vision 20/50 plan and we'll also have some Community Partners joining us at the table including transportation choices Coalition futurewise climate Solutions and Housing Development Consortium to also provide us comments on how we can better incorporate Equity into our regional growth strategies across the across the region. So normally we have public comment at the top of the agenda when we have items on the agenda for vote because this is just a lunch and learn in a briefing and discussion. We will have a public comment at the end of today's meeting. So without further Ado I will have them Roxana read into the record the first agenda item and I would invite all of our prisoners who are with us today to join us at the table while she does that Agenda item one regional growth & Equity Vision 2050 for breathing and discussion. You guys can sit any you all can sit anywhere if you are most comfortable. Alright. Hello everyone. Thank you for being with with us this afternoon. So we'll just do a quick round of introductions. You can tell us your name and your affiliation and then going through the slide deck. External ear. Hi. My name is Liam is sick and I am the Washington Transportation policy manager at climate Solutions. Hello, Maggie Mormon associate planner with the Puget Sound Regional Council great choices Coalition program director for our livable communities program if he dries who's going to pick us off on a presentation? Okay. Thank you for the play do move. They are not as sensitive as some other microphones are other public venues. So so what I'll do is I'll provide a brief overview of the plan Vision 2050 plan who psrc is what we do with why we're updating this plan as well as how we're looking at Equity really centrally in the developing the plan and then I'll turn it over. I'll do that quickly and turn it over to Maggie and Brian to talk about some of the data or developing some the analysis tools that we think are really improving the plan and we'll be even more helpful in this implementation. So first off we are the Metropolitan planning Organization for the central Puget Sound region. That region is King Snohomish Pierce and Kitsap counties a region of about 4.1 million people 82 cities and towns. So abroad large region. We will never around the country. We talked about this region. And the size of it compared to smother metropolitan areas were about the size of the bigger this state of Connecticut of an area that we're planning for a little smaller than Massachusetts. So we're really very landscaper different types of places. I'm as part of our work we maintain the Region's Regional Transportation plan, which were required to do to in order to use federal transportation dollars. And so we Grant out federal dollars for Transit and other Transportation projects, but we also under the state growth management act maintain what are called multi County Planning policies or coordinating policies under that growth management act that I'm help to guide the development of County comprehensive plan to and City comprehensive plan. So ultimately policies in this Regional plan, which is called Vision 20/40 right now, but we're updating it to Vision 2050 will happen if factoring impact on the city of Seattle's comprehensive plan in that plan this map depicts what we call our regional growth strategies. I'm orange and neon green areas on that map or the urbanized area and we look at different types of jurisdiction. So the city of Seattle is a metropolitan City. So is Tacoma so is Everett. So is Bremerton the main Civic and cultural hubs of each of our four accounting is also add that the city of Bellevue for a variety of reasons is also considered a metropolitan City, but they are the cities that are intended to accommodate the most growth over time the dots on this on this map represent designated regional growth Centers Seattle has six of them and those are areas within the major cities that are intended to really be hubs of growth. So that's the basic planning framework. We're updating this plan and those policies and expect to to adopt Vision 2050 about a year from now. So presently has Maggie, we'll talk about where in a environmental review phase looking at various growth Alternatives that will help guide the update of our policies. We started out this update in a scoping on process last year about a year ago, and we heard the loud and clear from the community from our members from discussion at our boards that Equity race Equity social Equity need to be a central theme of the update of our policies and that we need to look at our existing policies through an equity lens. Look at how they are encouraging or helping to ensure I could go out comes on a variety of topical areas including Transportation housing the way that land is developed access to open space access to jobs and so far. We also were we we heard from the public and from our members that we should be identifying strategies to mitigate disparities in outcomes, gross outcomes and in particular as we expect to accommodate / 1.8 million people in the next 30 Years. Affect existing communities and what are the potentials for displacement? And how come you look at that? As part of that we then have developed a work program at psrc to really hiding the tools and the understanding that we have of equity to help our members again 82 cities and towns around the region. I'm all with different capacities at the local level to put staff work to issues like that. So just Define equity and have a common understanding for all of our members as they do local planning work minutes. I mentioned before 2 Center equity in Vision 20/50 in our other on Transportation plans. So I mentioned 1.8 million people. This is the lighter green is the historic growth in this region as everyone knows we've had a very dramatic boom. Over the last decade. I was added over the last decade in the region over 400,000 people to think about a half of us Seattle within the existing urbanized area just in the last decade dramatic growth that's having impact throughout the region. We expect a similar trajectory of future growth. And so we need to get out of it. One thing that we also have recognized is a with that growth what times are pretty dramatically different demographic changes right now about 14% of the Region's population are over the age 65 expect that to increase to about 18% 4% doesn't seem like a huge number but 4% of 6 million people is is 8 or 18% increase in the Region's elders. I will be much more diverse about 80 over 80 per-cent of growth in the region since the year 2000 have been people of color and that's throughout the region as well show later that is especially evident in some of them or Suburban communities and our households are getting smaller and that implies some differences in housing need housing location Choice need and how the jurisdictions throughout the region will plan to accommodate growth in and House people with that. We also recognize that we wanted to dig deeper into demographics and what the change of in the region will be until all turn it over to Maggie to talk about some of that analysis. When to dig deeper into some of these demographics in the change, we've been seeing so here in the map on the right. You can see that this is for people of color in the region by census tract. So those census tracts which are the darkest blue are over 50% people of color in the year 2000 and then as I switch it over to 2016, you can see that that those census tracts because they're becoming more of them and they're more dispersed throughout the region. So it's been mentioned more outside of the really urban areas such as Seattle and into those Suburban jurisdictions. So we go back and forth. You can really see the growth in South King County up north in Snohomish County along I-5 and then down south into Tacoma as well. And so in two thousand people of color represent 24% of the Region's population and in 2016, that's 35% and many of our jurisdictions are at or near 50% people of color So Cal City such as he talked in Tukwila or in the high 60% There are many cities which are at or near 50% such as Kent and Renton Bellevue and Redmond the city of Seattle for this data set is at 35% people of color similarly for census tracts, which are low income. So we Define low income as being at or below 200% of the federal poverty level so you can see the difference here between 2000 and 2016 and similar to the change in people of color the people census tracts which are at or over 50% people with low income is increasing and becoming more dispersed throughout the region and so it in 2016 people with low income represent 24% of the Region's population and that's nearly 1 million people of our regional population make you remind us in terms of dollars with the 200% of the federal poverty level is I am not sure at that number it changes for household size. And then has been mentioned we've been using this demographic information in a lot of the data. We produce that psrc in the implementation of our original plans. So 2050 drop supplemental he is out for public comment now for a few more days and this plan evaluates environmental effects of the three regional growth Alternatives and those Alternatives RL review them briefly because they'll come up again, but that document really goes more into stepped on them. So the three alternatives are stay the course, which is a continuation of vision 20/40 is are no action alternative. There's Transit Focus growth which puts more of the Region's residents around high-capacity transit station areas. And those are Light Rail stations commuter rail, Ferry and BR30 stations. Then there's reset Urban growth which disperses growth throughout the urban growth area and puts more grows into Rural and unincorporated areas in the other alternatives. Miss part of this and he is we also have the equity analysis which is an appendix and this includes demographic information similar to what I showed but also a lot more of it. I think they're over 30 maps in that document. So there's a lot to dig into and also measures impacts on specific geography switch all going to in the next few slides and it introduces some new and updated tools. Which Brian we'll talk about a little later. So for the equity analysis, we look at the impact in areas with high concentrations of low-income and Resident Residence Inn people of color. So these Maps show those census tracts which are over 50% low income in the map on the left the pink census tracts there and then the map on the right the orange census tracts are those which are over 50% people of color and then so this is present-day demographics. We can't look at demographics in the year 2050. So we use these present-day numbers to look at what the impact on these communities may be with this additional growth under these three alternative. So here is an example of one of the measures that's included in that Equity analysis. So this is looking at the percentage of population and employment in proximity to high-capacity transit in the year 2050. So break this down a little bit you can see in that graph. We have the three alternative stay the course Transit Focus growth & reset Urban growth. The green bar on stay the course shows that 48% of the population and jobs in census tracts which are greater than 50% people of color or incapacity in proximity to high-capacity Transit. So this isn't looking at specifically the people of color who live there. It's all of the people and jobs in those census tracts so you can see under all three of these girls Alternatives the people and jobs in the census tracts with your greater than 50% people of color. There's a higher percentage of them who have proximity are in proximity to high-capacity Transit. So this is a little complicated. I'm in a lot to look at so I'm used the exact same measure to show how we did this analysis also for those census tracts which are greater than 50% low income in. This one has a similar result the people in jobs living in census tracts, which are greater than 50% of people with low income have a higher percentage which are in proximity to high-capacity. I would remind everybody that is based on the assumption that demographics do not change and it's also based upon that work. We will Implement our plan transit improvements, currently in our long-range Transportation plan. So that full implementation of Sound Transit 3 obviously sound transit to all of King County's bus Rapid Transit lines and so far kind of a proxy for looking at demographics for using present-day information. I'm which is one reason why we've developed her updated some of our other tools to look at these analyses. So Brian is going to talk about that. Great. Thank you. You can leave it there for now. So what Maggie describe is basically an explicit consideration off areas today where there are concentrations of people of color and low income residence as part of the 20/50 work in addition to that Focus. Are we develop to a mapping tools basically to help Advance our understanding of disparities at the regional level as well as well as to help Focus attention on places in communities where we would expect medications and improvements maybe meet at the first tool that will look at called opportunity mapping and this tool basically assess the amount of opportunities that exist in neighborhoods today this tool first developed in 2012 as part of a partnership call the growing Transit communities where we analyze the range of factors that represent access to Opportunities which represents which research has Dennis. Two-player important role on positive life outcomes as you can see on the slide. There are five factors. There are a range of factors grouped into five areas education jobs, housing and neighborhood qualities transportation and health. So as part of the 2050 work, we updated this index that was first developed in 2012 with the most recently available data to basically refresh our understanding of who has access to Opportunities rich areas and who does not and wear them and beanies for improvements in Opportunity poor areas. So this map is the updated index where the darker colors are areas with very high opportunities in the light of colors are the ones with very low opportunities relative to each other. So these are places today and enable planning applications. We're basically looking at considering the three scenarios and Maggie described and where growth may take place in each of the three alternatives for an hour in the draft supplementary is other applications that we've used it for is to help facilitate board discussions and to help develop Regional policies to mitigate and provide additional access. This is also one of the factors in consideration for a project project station in our transportation funding as well as I criteria for selection for funding and then lastly is also Play a factor that's used in the Washington State Housing Finance commission program for multifamily housing bonds with low income housing tax credit. The second mapping tool is a a new one for us call this place and risk analysis with a tremendous amount of growth expected and we wanted to help ensure that I could. That growth can occur without displacing existing residence. So what does tool does is to identify areas that are at greater risk of displacement based on today's neighborhood conditions. We reviewed a whole bunch of tools that were developed across the country. We looked at Best Practices and what we found were similar approaches that vary depending on data availability and what the stakeholder values and ultimately we decided to piggyback on something. That's the city of Seattle did in the 2035 growth & Equity work we found out it was a very good piece of work and it already has a lot of components that are relevant to us. We are basically Because of this and Bartonella ongoing collaboration with the office of planning and Community Development here to help each other anything that we can get our hands on as far as data is concerned to be useful for the city and the methodological advancements that the city make could help us keep our tools up-to-date and so on this slide similar to the opportunity mapping there are five areas in which are considered to be indicators of risks of displacement for people living in those areas first. We want to know who lives there and some of the characteristics of people who are at greater risk of displacement the transportation and neighborhood qualities some house and characteristics as well as Civic engagement. So what this map shows are areas where the green have lower risk of displacement of the yellow is moderately higher and then the Orange is the higher level of displacement the risk of displacement doesn't mean that displacement will necessarily happen, but it's their areas in which there are certain qualities where the right conditions occur and the amount of growth that we may expect or concentrate in those areas. There may be causes for concern and where we need to focus on medication so I can slide and I think if we were to lay over the the areas of opportunity that you all identified in previous lives, we would see that the displacement risk is most significant and pronounced around those areas where there are also High opportunities and obviously that's a huge concern for for a city like Seattle that really wants to Make sure that we are making room for new residents while also not inadvertently displacing generational residents from our city. So I appreciate the Deep dive on the risk analysis and I hope they hope that maybe we can get us live. It incorporates sort of that lingering over of of the opportunity areas and relative to what we're seeing this map show in terms of the the risk of displacement sure. We don't have that looked at in isolation or not as powerful as when they were considered sat together. Thank you so much. I appreciate that being used in our vision 2050 plan and we're providing technical assistance to local jurisdictions. I've met with King County various arms of King County including King County Metro and the long-range planning. King County Housing Authority in terms of someone's a planning exercises that they're doing where they're concerned that Equitable concerns as well as concerns for displacement. And then the last like that I'll go over or some of the draft policies Within mission 2050. Where were using these tools to specifically call out item set up our interest for Equity reasons. I were explicitly I kind of considering the displacement of marginalized residents and businesses were calling on local jurisdictions to engage inequitable a community plan. And also when we were considering access to opportunities with respect to Transportation, how do we connect low areas with low opportunities to places with high opportunity that they do so in ways that we can maximize that access while minimizing and preventing negative impacts on marginalized populations. Don't close out there before. I do one thing it's important as it's not that it's important to see people think of the fastest-growing parts of the region like Seattle as having the most potential for displacement as growth continues to occur. The one thing for us is a regional organization. It's important to talk to all of our members and just say one if if people in Seattle say are being displaced one, where might they be displaced to and then also what pressures might that pose for some of our other member jurisdictions. If you look at the map Tacoma which has and struggled over the years but is beginning to really have its own boom. A lot of development downtown campus downtown has completely transformed. What was formerly a fairly derelict Warehouse District into a really vibrant new part of of downtown Tacoma. You can see that those parts there if you know where your jaw graffiti those parts of Tacoma The communities are living there today are also at high risk of displacement as growth happens over the next several decades. And so it's important for us is Brian mentioned in the policies that he throws draft policies that he reviewed very briefly to think about how throughout the region of this is we need a regional response to these sorts of pressures Regional tools Regional resources, as I mentioned earlier some jurisdictions are very small. I think our smallest jurisdiction index is about 180 people, right? I don't know that there's much risk of displacement they are but they have their own issues. And so we need to think about what does Regional responses and resources are in a roll that we have a psrc is to to highlight these issues to encourage that conversation amongst our members to to research best practices and to that end. We're really trying to institutionalize this approach to being explicit and how we evaluated or are considered Equity at PSR. We've already mentioned that we're sending this with an original plans and policies but very importantly right now we have we're recruiting for a new staff position a managerial staff position to be the lead person. I'm at psrc to Shepherd these sorts of conversations amongst our members and to leave the work across our agency in developing new tools and data and working with Community Partners and engaging with our member jurisdictions. So we're really excited about that. It's a it's a huge of advancement and hat is that has not only the full support of our of our management Golf Course of our boards. This is one thing we heard back in that scoping process for vision 2050 was that you need to really Center this end and resource it and make sure that there are folks that I'm have the ability to have. This is their portfolio at psrc and also mentioned is part of that where I don't know if How many people are aware of this organization, but they're it's an initiative of race forward formerly of the center for social inclusion. There's the governor Alliance Andresen equity and it's a Time National Organization that works with members of the public sector to create love to conduct trainings to create peer learning cohorts. Are they have national resources available in somebody recently become members of gare and will be participating in the Northwest learning cohort. There are members who can see listed on the second pull. It is the ones we know of right now who will be participating in this work for those include King County on the city of Lynwood Port of Seattle city of Seattle will participate the Seattle Housing Authority city of Tacoma Inn Tukwila, but also this cohort will have members from Oregon as well. So Metro, which is the equivalent organization, Portland, Oregon. I'm too psrc. Lane County and others and so we're really excited to be part of a cohort that will learn from one another and have sessions like this talking about tools that they're developing or issues that they are identifying it there in their jurisdictions. Also, just explain why some non psrc folks are up here. Is that a couple years ago TCC some other organizations work with psrc to develop his face and a group that we've been calling the Community Partners which brings together Advocates from a range of sectors and throughout the region that really are focusing on Health Equity in the environment. And so we've been meeting about freely and has given us time to provide feedback and really dive deeper on some issues. I think a lot of folks for a lot of folks psrc is kind of a mystery to navigate and it's hard as kind of a person from the general public to engage and if you're not lucky enough to have a seat at the kind of the board decision making tables then there's not necessarily a lot of ways to engage. So one of the things that he has given us Staffing time in a really good chance to kind of dive defense of the issue, so, Working on these things along side, and then the second is we were really pleased with par that work the psrc hired an equity consultant for help on this Vision plan to do some research at the focus groups is that was really nice to see some dollars invested into that effort and maybe at some point. You can also talk about some of the recommendations that came out of a couple and so we hired a group to look not only I'm at what we were doing at psrc what we have been doing in terms of our approach to analysis or what our policies look like, but to look around the country and look up your organization's, you know, how has this been tackled in pure regions like Boston and the San Francisco Bay Area the Twin Cities La San Diego other places around the country and one thing we were pretty gratify was too to see that we weren't Too far behind are pure organizations. We've been doing good work and pursuing pads that are pure organizations are but they also then looked at some places where we could improve and one of them was to have some dedicated Staffing. So to date we've of three different projects with different people at psrc have have taken the lead with her before date our policy and now to have a dedicated and resource position a permanent position with him psrc to mind this this topic and this this issue. I was one of the recommendations another wish to continue to engage with Community Partners in a regular basis and really make sure that we're hearing from people themselves. I think of some of the other recommendations you may have them. Are you remember me remember? Foundation was too that mainly came from the focus groups that the Consultants put together. What's make our data more available? So psrc produces a lot of data and sometimes even a staff it's hard to know what we have available and where to find it. So trying to make that is easily accessible as possible. And that's something we're working on moving for it, especially with this opportunity mapping and displaced making it available to remember jurisdictions who may not have the same amount of staff who can make these tools themselves, but also to different stakeholders and Community groups around. Oh, sorry. Better OK with around at how do we not just have Equity dedicated staff at really Frontline Community representation and input throughout the whole process. I think the group is Canaan Partners is groups that are kind of well resource to do this work and not necessarily working or representative Community or Based organizations, but I believe there's some recommendations are in having something like the regional Equity Network that was in place during the Grinch where we could have have dedicated space to have those conversations and really have Frontline Community experience. I also think, you know advocates in the staff and the board really looking around and seeing that we're a predominantly white group and figuring out ways to ensure that the folks that are there are well up to speed and versed in these kind things. I think it's awesome that that board members long and then continue to oversee diversify within the groups that are doing this work just to the build on that one point is that with the great new tools that are coming online and being made Oh, yeah, I'm turning Martin and this is Pastor Sarah brand. She's with transportation choices Coalition and I'm with futurewise. Why don't you why don't we thank you for the audience to transition from the presentation and provide the Community Partners and leaders at the table and opportunity to talk about how they've been engaging in the work. And and and from what space they are entering into that work. I think that would be a really this is a good opportunity for us to shift. So so turning you already starting so why don't you go ahead and start with you you can tell us remind knows who you are the organization that you are Wes and fundamentally is or what is the the the the goal they are trying to accomplish and any sort of other remarks you'd like to share with us here. I'm turning Martin. I work with futurewise, which is a environmental nonprofit organization that works on land use planning throughout the state of Washington so our organization started Back in the early 90s from the state's growth management Act was enacted and we have started Plata shepherding and student stewarding role for that particular law over the past. Nearly thirty years. My role at futurewise is to support our Urban work and a lot sometimes that takes the role of like data analysis. Sometimes it's more Community engagement work other times. It's providing policy expertise. So to work with a regional planning organization like the Puget Sound Regional Council is something that's very high priority for us and the opportunity to sort of collaborate with other issue Focus organizations. Like climate Solutions transportation choices Coalition the Housing Development Consortium and others is something that we are very eager to do and it's been a really good experience. So far the workshops that Puget Sound Regional Council has put on I think led by members of Gerry and the past were really excellent for the Clearing Houses for the different ideas of how to pursue racial equity in Regional planning. And so we've been very supportive of that were continuing. We're really happy to see that. You're hiring an equity manager and we're curious to know sort of what their scope of work will be what they're sort of budget maybe but one that wanted to tour the comments that I wanted to to point out. It is related to the displacement risk analysis, one of the strengths of the method that you all used as it takes lots of different. Indicators of displacement risk and combines them together so we can have a very clear picture of where the risk is high and wear it slow. One of the downsides of that is that you might have displacement being driven by different things and different communities in one place. It may be that there's a light rail station coming in and there's a big development boom around that in another place. It may be a new employer just move there or or at lots of other reasons. And so I would hope that in addition to making those great Maps available, you'll help jurisdictions and the communities that they represent. Analyze what particular displacement mitigation Solutions are best suited to their conditions and I think that key role in that while having be having a dedicated staff member but it will also be about making inroads into those communities and working with their Community leaders who really understand the on the ground conditions in a way that you know, frankly census data is not ever going to be able to reflect and so while it is great to be part of the Community Partners group, I would really be interested in seeing ways that we can expand the membership of the scripture include some of those Community leaders who have you know, a place based on understanding of what they're facing cuz futurewise doesn't really excellent point at the regional scale things look very different then say the Seattle application of is this place and risk analysis and then what tournaments are referring to at the neighborhood level. So when is That's fresh in my mind is that I recently that's what planners from King County who are looking at sir in unincorporated areas and the technical assistance in the Clearing House world that we play as sharing the data, but then assisting them in understanding what went into these measures and how they can augment while we have with their on the ground information for their specific purposes for the community center specifically looking at and so what we would try to do is provide that technical assistance that combined with their knowledge for their specific plan and goals and what we're hoping to do is with other communities that are interested in this topic. I'm really producing the data is one thing but then trying to figure out what do you do with that? How do you interpret at how do you analyze it and how do you For lack of a better term manipulate the data to to Really sort of begin the process of identifying someplace Bay Solutions is is is really an important part of producing the data in the first place. And so I appreciate that perspective. Is there anything else you wanted to add before we go around the table call a council member O'Brien who I'm sure can assure us in a moment that he is fixed. All of the issues related to the alignment on Saint Transit between West style and Ballard. I knew that I left things in good hands remarks reaction suggestions comments, and he's anything else that you think would be really important for us to tell learn and understand is part of his body of work. I mean, I think I gave some of my comments already but just for the record, my name is Chester transportation. Ocean, we are a Statewide Transportation. Advocacy group. We really focus a lot on Transit but also healthy sustainable agriculture transportations are really trying to root our policy recommendations and advocacy in transportation Justice and we do again work at the state but also largely in Puget Sound region Sound Transit District King County Seattle. So my name is Liam is like I said earlier and and the Washington Transportation policy manager at climate Solutions, Solutions is a regional on environmental nonprofit. And as her name suggests, we are interested in finding solutions to The Climate crisis that we are facing on we work in Washington and Oregon and our mission is to accelerate Justin Equitable on clean energy solutions to The Climate crisis and one of our values is Justice and so As we Face the climate crisis we want to make sure that the policies that were advocating for help with the transition and make sure that we leave, you know, we're creating a system that is not just on better for the climate be better for everybody. Then it has been before and so, you know this work obviously intersects a lot with what climate Solutions does and what I personally do with a focus on Transportation in that kind of long-range planning obviously has huge social climate and environmental implications and we just want to make sure that as we're talkin about prigs ample displacement in the environment these things interact with each other really closely and they create feedback loops actually and they can create a negative feedback loops that have even further negative consequences for climate for folks for folks are being displaced for marginalized communities and sew in a world where in Dalton he's discussion just because they want to make sure that we have both the qualitative and quantitative information to address this in to make sure that as a region grows. It's going to be more sustainable and more equitable. Great. Thank you. Do you have any comments or reactions you I just share with us. I know that you are both on the executive board for psrc and Omar are lead here in the city on transportation and sustainability. And I know that you're sort of also leading the efforts to draft a letter of comment as it relates to the vision 2050. So I wanted to provide you an opportunity to share some remarks with us as well. Thank you for my job away from the job a little bit and I have been involved in the process of drafting letter. I will be honest with our amazing. Stop folks are the ones that are putting together those points who I'm relying on to really help guide to this. I'll just say that the work around Vision 2050 is critically important and Confirm Gonzalez. I really appreciate you holding this form hear people for whatever reason tend to not always see the conversations we have down psrc. And I think it's important to be able to do you like that here and it's great to have so many aliens here today too. So well and hopefully tracking Along on TV, the the there's a lot of girls coming to the city, you know, we talked about the big numbers. It's great to look at the graph and recognized it. We've actually been growing pretty consistently pretty rapidly for you know, 40 years and what we're talking about is like, oh that's just pretty much the last forty years. And so, you know, we'll have lumps than chunks in all those things. It'll happen that it's a desirable place to live. There's a lot going for it and it's a lot of challenges and I think what is critical in Vision 2050 and I really appreciate the agency psrc in the Great War began and I also want to emphasize having like what he helped. Framing that and that they're hiring actually director at the agency is an outstanding step and then also recognized at the end of the day that agency is led by elected leaders throughout the Four County region. And so there's always a tension between staff leading the electives in electives leaving the staff and I think that they stopped as an amazing job down there and working with local jurisdictions to the vision 2050 is an opportunity for us to really understand what has worked well and what has not worked well in this recent. Of growth and pivot and I'll just say that it's been amazing to be in the city that the growth there is no doubt that there has been a ton of opportunity generators and massive amounts of wealth created. And we look at the day to hear. You know, low-income households have continued to increase and you look outside and it's very clear that there's a growing obviously learned poverty and the risk of displacement the fear of displacement and actual displacement is happening at an unprecedented level and this idea that we can be an inclusive city with a bunch of opportunity in a bunch of prosperity. That's shared. I think we're failing at and we as we look at where do we go as a region in the future in this isn't just a Seattle thing that affects everyone in the region getting a ride is really important. Now there's a lot of things psrc is probably not going to drive national tax policy, but we know that where we make how we choose to grow is a region. How we accommodate that growth housing has a lot to do with access to opportunities as does a transportation Investments and how you access his opportunities, whether they're walkable or across the street on the light rail to a job or education or clean air or whatever it is. And so this this work is really fundamental to what's going to happen and it gets a ton of attention from a lot of people a lot of amazing organizations in town that really work on this including the government agencies. But often times, I think the general public isn't aware of this going on. So I don't have anything more specific cuz they live and how important this work is. I think it's heading in the right direction and I think one of the challenges at the elected level and I'm going to look official who will definitely be here next year. He won't be here next week. You know how we continue to show up at those those various board meetings? And make sure there were continuing to elevate voices that often will certainly most people just don't know if you're not aware and turn it all the time and capacity to come down and testify there but is elected officials. How do we make sure that our fellow elected officials throughout the region are quite believe sharing our values really will commit to them for this council member who will continue to be here in the next year or so. I appreciate all the work that you've done cast member Bryan to really make sure that the city of Seattle's values and perspectives are being advocated for in this Regional contacts and the United continue to believe that it is it is really important for us when we look at the maps around the opportunity mapping which was slide 16 of the presentation and we compare that to And look at also slide 18 around the displacement risk analysis. It really does paint the picture of how Regional this issue is around both in the impacts potentially negative impacts of the growth and the opportunity that our region continues to do experience and when we talk about the region, we are talking about for very large counties in the state of Washington Kitsap Snohomish County King County Pierce County having spent a lot of time and all of those in addition to a lot of counties on the other side of the mountains, you know, you can go to places in Pierce County that are very different than two, and you can go to places in Kitsap County that are very different than in your Bremerton. You can go and two places in Seattle that are very uniquely different than North Bender Issaquah, right, but you're still in that county and same as trees for Snohomish, right? And it but I think what is common in true is that The entire region is is at risk of building a future for people who might not crew who who are your currently now but might not be if we don't plan accordingly and and that is really an important value for us to continue to talk to other member cities and and throughout the region to make sure that we are all understanding how this impacts all of us and it's our shared responsibility to really struggle with it. And I really want to thank you all for the work that you've been doing at the council. I've been on a member of the operations committee and an alternate number as the executive board since I was first elected in 2015. However only went to my first executive board yesterday and side right handed in my cashed in my alternate and actually attended and I think to can't remember O'Brien's point. It was remarkable to me that Out of all of the folks who attended. We're all elected official sitting at the board table. I was by far the youngest person and I was the only person of color and and it's interesting to be in those faces as a as a woman of color who is definitely on the younger side who relies heavily on all of the things that were building and constructing throughout the city through this Regional planning to be sitting at a table where where that's not necessarily the representative mainstream experience. And so I really appreciate the staffs willingness to engage with me around some of these issues that are really important to me that I know are also important to you all and I want to continue to commit to being a good Regional partner to all of these other jurisdictions who we share this responsibility with and who I believe I have hope that we will continue to be able to work together to relate identify solutions that work for our individual communities while still having that Common shared vision of what we're trying to accomplish for the whole region. And then lastly I'll just say that I really want to thank the Community Partners Hester in particular from TCC who reached out and said, hey, I have thoughts about tsrc around y Vision 2050 is important and why the work around the equity space is particularly vital and critical to to any identified Solutions through this process. And so I really want to make you hotter ntcc for for making sure that I was aware of the importance of this issue and that I was paying attention to the to the granular details. She can provide me a chart that broke down exactly what psrc does Which was amazing and I really appreciate all the work that you all have been doing in the space not just in this context, but I'm just a broader context for many many many years the work that your organization's have been doing to push us as elected officials to be in as government employees to be radical thinkers and more radical thinkers in this face is super important when I think about the vision 2050. I'm always like gosh. I hope we're still here in 2050 and I think we have some clear opportunities to be more radical to really save not just our planet, but to save the people who who we love and ourselves from formerly destroying ourselves by not doing planning in a in a more sustainable way. So really, thank you so much. I really appreciate you all take Time to be with us into I'm sure with the audience all of the worst that you all have been doing and looking forward to continuing to partner on this issue and Beyond. Any other closing remarks from you all thanks for the opportunity to be here. Of course. I see that our board members are taking it very seriously and that this is it seems to be a shared value across all of our board members and they've asked for it and so we're just excited take to keep moving forward. Well, thank you all so much. It is just a yes, ma'am. Sure, go ahead. We have a question from the audience about how the opportunity mapping is out. I just have the opportunity mapping the correlates with transportation planning. Enzoani into account explicitly as in the development of this opportunity mapping. The opportunity mapping is more outcomes beso observed data about positive life outcomes and look through things in there like housing quality crime with a neighborhoods proximity to parks and things like that, but we don't look specifically at the zoning that might create might have created those conditions on a transportation is definitely part of that evaluation. So what kind of type of access to Transit does a community presently have what are the costs who is walking with her neighborhood and so far it's so there's a relationship there to Transportation outcomes, but not to even necessarily this is looking at of condition. And what that means for how people are experiencing their lives within those community. Thank you so much. Okay, so we're going to go ahead and end out the presentation because I have to do a public comment and I have committed to end today's meeting at 1 so we only have one individual who signed up for public comment and that is Teresa Barker. Torso, thank you very much. My timer is there cracked. Okay. So my name is Teresa Barker. I was in a residence Seattle. I was born in Tucson, but my dad moved here when the family here when I was three for job at Boeing in the early 60s been helping organize a group of 80 to 100 North End neighbors hundred and twenty that have been meeting with City Representatives on the mayor's office on social equity and Justice issues in housing and I've been following the the council select committee on homelessness and housing affordability sessions, which is great work. So I house also I have a doctorate degree and my work is in engineering and we did Research into environmental sustainability in manufacturing. So at that time I reviewed the city council zero carbon plan, which I'm not quite sure what the name of it was a few years back and I just wanted to comment that I one of my comments is that I supported him excited about the direction. Thoughtful growth with regard to incorporating social justice issues as well as climate change issues, and I before I heard the presentation today, I wanted to stay at the importance of local and block wise services in reducing carbon emissions. So groceries dry cleaners the kinds of things we used to have along the stone way and a long Roosevelt Way & Perth Amboy Still Standing Ridge in Columbia City. Wonderful just to be able to have more than just brew pubs in day spas in Pilates studios. So walkability being the key. I think someone mentioned here and then after hearing the discussion is concerned about kind of a larger issue of displacement. We're having a homes and low-cost multi-family residence knocked down in our community, and I just want to want to continue to support thoughtful and sustainable approach to development at the council is working on now. Thank you. Thank you Teresa. I really appreciate your engagement is always a scary to show up for the first time and then just dive on in and give public comment. But I think you've done you've done you've done a pretty good job today for sharing your your comments with us. We is elected officials and just members of the general committee really appreciate hearing directly from folks who care about these issues. So thank you so much. That was the only person we had signed up for Pella, Is there somebody who didn't provide us some comments. We got lots of hands up in the air folks to come on up to the microphone if they're interested. You can begin by sharing your name and then providing us for Testimony. My name is Keri Campbell and thank you for this day. This was great opportunity. I just want to invite you when you're looking at equity and your plans for the future that we consider art in some of those areas. You're looking at your opportunity Gap that are actually touches every one of those areas that you're looking at art house with house art is important in our economic growth More than 70% of people that have moved here in the last 5 to 10 years indicate that art is one of the reasons they moved here. It's also an employer of this area. It improves the health of certain areas in your housing. So bus stops Corners that are getting trash people. What do people do Bring art to that area. So I would end art education. So I would just argue that it's missing and I would love to see it included Canary appreciate you bringing that we know we talked a lot about the creative economy. And that is definitely hits a lot of the Bells around living wage jobs many of those creative economy jobs are union jobs and and they pay pay living wages, and I really appreciate you highlighting the fact that we have as a city. We have an office of arts and culture and we really prioritize recognizing the contributions that the creative economy has interstate and certainly in our city. So, thank you. All right, we have another person coming up and just because we need to make sure we have the public record of folks who have signed in to give public comment. If after you've done after you have given your public, if you can sign up on that sheet that be great, but let's start off with your name and we'd love to hear from you by the station and I came to this meeting because I saw psrc and I wanted to come and see what they had to say it the add Equity to wrap their forecasting work is an enormous undertaking I get people to criticize me. Young lady to see the forecast forecast. I'll leave my coordinates because some DF First Forecast number I believe in the previous forecast was 2020 which was way in the future so sometime and that's what my table talks about. So I'll be looking forward to run more information. Thank you. Thank you all for joining us happy to have rocks and other clerks takes whatever information you like to share with us. All right mixed up. Should I wait for the timer should you all verses I guess concern around how you look up low-income data moving forward especially if ideally were going to pairing these strategies with bringing people out from Sardis. And so I guess I just kind of have a concern around how you can track the difference between low-income households being pushed out of City Limits versus low income households rising out of that status. I think that's something that gets easily lost and census data and something worth looking into and also I just want to kind of make a note that I think other people mention but the difference between psrc use board Vision on Equity versus Frontline Community decision on Equity. I think it's great that board members are pushing for that but it might not be the same outcomes that people who are actually impacted want and so just making sure that you are building relationships with community and making sure that those people's comments are Incorporated. And then just how to make the vision 20/50 more Nimble because I think as we bring in new strategies on income and like if you have guaranteed basic income between now and then if we have major mass transit that changes everything before before 2050 are in the meantime, how can you kind of change that document make it more of a living document and be able to change strategy in a way that makes sense for the actual outcomes that we see over the next few decades. And then my final two cents on the third option psrc option for resetting Urban growth boundaries. I think is really dangerous because it can really encourage spur have Urban growth boundaries set up from decades earlier, and I think we need to focus more on Equitable growth in our city limits rather than pushing people and taking away a rural areas in our farming communities. Thank you. Thank you. Just spoke futurewise language preventing its talk later great questions. Thank you so much. Hello, my name is Erica Thomas. I am a relatively recent graduate within the past few years and I have worked in retail up until recently but I'm now an archaeologist. I wanted to actually first agree with what what Polly said about the third option being dangerous. And I think that the second option is really the the best option. For for growth and I think Transit is incredibly important especially with my co-workers in the retail industry and the food service industry who can't always afford cars or don't have a place to put a car. It's very important to have access to public transit and access to public transit with enough capacity for everybody when people are all competing at same time. Another thing I wanted to say was that in terms of opportunity mapping and economic health. I think that it's really important to think about food service jobs and retail jobs and also temp jobs or part-time jobs within an office setting like the kinds of jobs that Amazon Microsoft off an offer that are part times that they don't have to offer benefits in terms of economic Alyssa and I do think that there's been some great work done in terms of raising the minimum wage in terms of acquiring sick days in retail jobs, but I think that that's really important to remember There's this group of jobs that a lot of people especially recent graduates with bachelor's degrees are getting that are lower than what we would all like in terms of benefits in economic health. Thank you so much. Alright commissioner caucus to Seattle and I just want to say thank you for this work. I serve at the psrc on the transportation policy board and the economic development board. One of my colleagues serves on the executive board and another on the cross management board. So we are deeply involved in this working. And as you noted earlier, one of the things you notice on these boards is that the folks at the table don't look like our community collectively and so actively engaging this is really important at the Port of Seattle. We have just recently we're in the process of hiring our first senior director of diversity equity and inclusion in over the last two years. We have instituted two programs internally to try to address issues of diversity Equity inclusion, including a diversity in Contracting program, or we can start to examine disparity in our Contracting and address that with more affirmative actions to to take in that regard and also A priority hire program or we look at zip codes that are disenfranchised and say how do we get more employees? Not only at the Port of Seattle but also with our vendor contractors and I think there's a really important next rest of the federal government that the psrc plays and so another kudos to the city for leading on efforts and the county around census 2020 which really impacts the work that psrc. I'm very concerned. In fact sign on to an amicus brief to the Supreme Court around the question on the census that has been proposed by the Trump Administration to ask about citizenship. Unfortunately. It looks like the Supreme Court is leaning towards allowing that which just makes this work much more important. And so all of us Community Partners especially need to be engaging those communities that will be systematically undercounted to find ways to make sure those communities are represented because the four counties that are included in the psrc will be systematically undercounted because we are More more music higher than that then the areas that will be over counted and so in order for us to get our fair share for these for this region in all those Federal project one of the ports especially important for all of the transportation and Freight mobility passenger movement projects that we are working on. We need every Federal dollar that we can get. So thank you again for convening this and I hope to be a partner in working with you on on these efforts really appreciate it and more about residential components, but he's not Regional Council and certainly these growth issues currently impact our Maritime and industrial industry and we spend some time talking about those issues within psrc. So appreciate you being with us. We got one more person. One more person. My name is Robert Weiss. I have been a resident of Seattle since 1975. I'm here right to because I have a business interest in Puget Sound Regional Council data, but I feel I should put in a word for my age Coral cohort and that in regard to transportation and this comes from I've done a lot of campaign work doorbell link for District 4 candidates and in North Seattle, it just seems that for senior citizens for elderly people. Crosstown transportation is becoming more and more of a challenge and I'm reminded of one particular older lady that I talked with that her door who said nobody seems to be thinking about and she's in Northeast Seattle thinking about Crosstown transportation. And you know, we're also north-south but perhaps we need to take a look at more flexible transportation for older people in terms of Crosstown. Thank you. Thank you so much for being with us as we can to build a system that is for all ages and all abilities and you know somebody who relies primarily on public transit. I am not yet in the older side of the spectrum, but I certainly can appreciate the struggles with is East-West connections. I think we can all empathize with that sentiment in that took difficulty and we're going out I'll keep working together. Make sure that we continue to make those connections. So that folks more folks are incentivised to use our wonderful public transportation systems that will have a great benefit for Mobility across the area and obviously for climate change reasons as well. So and that appears to be the last person who is interested in giving us some public testimony. I want to thank everybody for attending in the audience everybody at the table again, and I think I Roxana Gomez from my office to a clerk to today's meeting an organized the whole thing. You did a great job. She is very eager and excited about the area transportation policy as somebody who doesn't own a car. So I really think her for her leadership in this base. And with that being said we are adjourned. Thank you.", "end_time": 4240.2}]}