{"format": "raw", "annotations": [], "confidence": 0.9424696245552164, "data": [{"start_time": 0, "text": "Good morning, and welcome to the May 14th, 2019 meeting of the Civil Rights utilities Economic Development and arts committee. It is now 9:36 a.m. Lisa herbold. I'm the chair of the committee as well as council member representing West Seattle and South Park District 1 honor agenda. Today. We have public comment and the items of business following public comment include a report from the city auditor on a second phase of ongoing review of the city's handling of hate and bias crime, then we will follow up that briefing with a discussion and possible vote on a piece of legislation that we have been working on since I believe it's summer 2017 2018 on repeat that error and then we will have a discussion and vote on the lifting of a Seattle Public Utilities. Budget Proviso on the ship canal water quality project and we will have an initial discussion with the appointment to the office of Economic Development Robert Lee and review some of the answers to questions that he proved that the council provided in the answers that he provided in response and then finally will wrap up the meeting with a update from the office of Economic Development on our ongoing efforts to develop and Implement a legacy business program. So with that I will approve the agenda and move into public comment. Thank you know we got to folks signed up for public comment Newell. Keep time. You have 2 minutes and he will let you know when your you have a minute left when you're 30 seconds left. And when your time's up to keep your eye on him, please give Dennis axman followed by Damon's. I believe it is theirs on antenna Saxon from Capitol Hill and I'm here to speak in favor of the malicious harassment reform and it's just that I think you should add a Some Proviso or provision that City officials will be held to a higher standard because I'm in a situation now with the city Department iPod to Grievances and it seems to be getting worse. I've had disparaging comments made about my race my gender my sexual orientation. I'm astounded I've been told that this this person said I've spoken with numerous City departments who said you are a Serial complainer who never has anything constructive. To offer and your office knows that I got 2779 more people on the UDP program based on my activism and I got this Council to change City policies Southard HIV positive people will qualify for housing. I've been in this program for nine years with the city. I cannot believe the weather harrasment has stepped up and made Department of neighborhoods of all places in the Pea Patch program, and I'm just putting the city on notice. I think your city officials should be held to a higher standard and it's really hard to figure out what's going on because you know how people love to dissemble in this city, and I am really bad at love. Thank you. Thank you for testifying the second person signed up to testify again. I believe it's correct me please Damon's durozone. My name is master. Ramzan. I came before this committee a couple months ago. I had asked for some follow-up and I still haven't gotten any follow-up regarding some of the issues. I'm experiencing. Thankfully one of the things that is here today might actually help in the long run. And that's the new hate crime ordinance. I've experienced discrimination at the hands of City contractors and then City housing in a lot of ways and it's been very hard feeling. Like I'm being ignored a lot of the times when it comes to these issues. I call I come in person now again for the 3rd time on this specific issue hoping to get some attention and some assistance and it's it's really kind of disheartening when it comes down to feeling like you're being ignored when you're being dismissed in your you're not really being hurt and I know hopefully, you know with some of that the city council seats coming out that maybe they'll pay attention. Martens. It's getting closer to that time. So I'm asking you if you can, you know connect to follow up more on Sunday. Music reading civil rights discrimination and working with me, you know to work on some illegal actions by City contractors and hopefully result from the issue several staff with the office of rights in the room today. We aren't the council isn't the enforcement body, but we would love to put you in touch with the folks who are who do enforcer civil rights law. So I'm sorry for that not happening before. All right, moving into the items of business. Djarum one is review of hate crimes prevention response and Reporting in Seattle Phase 2 report. She knows right there. Greetings, thank you for joining us around Police Department oversee the homicide assault unit and oversee the bias crime investigations body of work and thank you for in particular spd's collaboration with the city auditor you as mention. This is an ongoing body of work. It dates back to the time when I was not on the council led by council members Licata and Rasmussen and I think the the value of the Auditors recommendations combined with the implementation of those recommendations by mspt is part of what has brought us here today. So again, I really appreciate that it would like to get off. I want to thank you. Can't remember her both were asking her office to do this work. I think it's really important work and with the advance in the country and the increases in the least reported hate crimes. I may not it's just a good good thing to focus on nowadays. I want to thank you for your leadership role and I asked him to do that work. I just want to remind the viewing audience that they want to see our report. You can go and our website at www.seattle.gov City Auditor in this report that Melissa will be talking about as they're so without further Ado it like to turn over and all this all to send the auditor in charge of this project. Picture of this is the last phase of our audit of hate crimes in Seattle. And before I start I just wanted to acknowledge. The people that we worked with on this project. I'm particularly detective Beth wearing from SPD senior Deputy prosecuting attorney Mike Hogan from the King County prosecutor's office and then the city attorney's office. These people do really important work for the city batting and Prosecuting hate crimes in Seattle. And we appreciate that the time that they spent with us on this project. Also shout out to my colleagues Claudia crochet Turner and Jane gunk out for their collaboration. So this slide shows the five things that we're going to talk about today first. We're going to look at hate crime statistics then prosecution data than a geographic analysis of hate crimes in the city. Then we'll review some results from a survey that we did and then finally look at a couple recommendations related to Data Tracking. This graph shows reports of hate crimes and hate incidents in Seattle councilmember her body requested decided because hate crimes have increased in the last few years and we can see that increase very clearly hear the colors on each each of the bars represents the three different kinds of categories that SPD uses to track hate crimes malicious harassment at the bottom also called hate crimes and bias crimes and I'll use those terms interchangeably in the middle are crimes with five elements. And those are crimes that involve biased but bias was not the motive of the crime and then at the top or non-criminal bias incidents those are incidents involve is but no crime took place and that's usually in the form of derogatory sense of comments. We don't know how much of this increase is it because of an increase in the communities willingness to report these crimes or how much time is actually an increase in crime taking place. We know the SPD particularly detective that's wearing has done a lot of Outreach to Immigrant communities and other groups also Officer Jim Ritter has been a lot of Outreach through SPD safe place program to the lgbtq community. So it there very very could well be an increase in willingness to report on but then also we know that in major cities in the United States they've seen an increase in hate crimes are also in the state of Washington. There's been an increase in hate crimes as well. So it's possible that this increase is due in part to both of those reasons. This graph shows the top four offense categories and by that, I mean the underlying crime that took place since I hate crime is essentially another crime like a salt or vandalism that has a bias components. So here we can see that assaults accounted for the largest offense type and within that category of assaults a racial bias was the highest percentage and then of that crimes against African-Americans were the highest Can you help me understand how that 524% corresponds with the previous slide? Which look like a it looked like crimes of it, unless unless assault. Which of those three cats which of those four categories are considered crimes? This includes all three of the previous categories that you saw on the previous slide so of those four categories What which of those four categories are considered crimes included on a glass slide in the category, which is a crime with a buy-sell. Yes. It would be a salt or a stand-in threats would be crimes. And then this last craft shows the top four bias categories for the time. That we looked at and then we can see that crimes with a racial bias accounted for the largest number and then also again crimes against African-Americans were the highest within the racial bias category. So I also wanted to mention that the data that we used for the last three graphs is all publicly available on at Speedy's website and it's updated about once a month. It's fairly granular and it is interactive and it is it has enough data in it to answer most common questions. That one might have regarding hate crime reports and also the result of a prior set of recommendations that there is a public-facing dashboard. You guys wouldn't have been something like that before but it is part of this ongoing body of work. Transitioning to prosecution data unlike spd's five times. Ash Board of we did not find that prosecution data was as easily accessible. We wanted to follow the path of hate crimes through the system to see what the end result was. And so did you that we had to review case records for all the cases that were referred for prosecution within the period of our review and this is mostly King County prosecutor's office data as most of these crimes were prosecuted at the felony level. So that's 398 number at the top or the total number of hate crimes that were reported to SPD. We can see the SPD referred about a third of these and then moving down at the end. We see that there were 37 convictions of malicious harassment. 37 is a long way from the 398 reports that SPD started. There are many factors like most crimes that can affect the prosecution and the ability for prosecutors to prosecute. This can be related to evidence even the ability to identify and locate a suspect because we know a lot of these crimes are interactions between strangers. It could be delayed so witness participation and then victim participation as well because hate crimes can be very traumatic to victims. They may not be interested in Prosecuting. So of the 398 SPD reported cases of malicious harassment, do we have information that So all of these cases have an underlying crime in addition to the bias element do we have information that shows of the 398 cases how many prosecutions for the underlying crime occurred? I'm just be a be interested to see how that tracks whether or not what's dropping off is the malicious crimes prosecution or the entire charge including the underlying charge is dropping off as well. Yes. That's a very good point in our population. We only looked at crimes that were referred or prosecuted as malicious harassment. So it would have not it would not have captured crimes that were marked as much as harassment by a speedy, but then referred under a different crime category. I'm not sure. I understand. Answer it is is it true that the 398 cases here have an underlying crime associated with the bias element? Yes. So all those 398 cases what percentage of those receive convictions for the underlying crime not the not the bushes harassment charge but the underlying crime. Well, the data that we looked at were crimes that were referred as much as harassment not as another crime. So the way that would include for example would include an assault but it wouldn't be have been fur referred as assault. It would have been referred as much as harassment. What's I don't know just something in here that 87 number because I know some never prosecute his malicious harassment. I know there were some that. The prosecutors actually decided to to convict the person but not on the basis of malicious harassment right didn't send those change change in mainstreaming maybe detective wearing can offer some insights on that had a couple of clarifying questions. So the 398 number that we see up there that represents all cases that could possibly meet the statute often times are cases where we have no suspects and no leads. So just because they land in that category either categorize that way does not mean that they're solvable basically question that I have free. Melissa is often times and we may have a case that does not go over the malicious harassment because ultimately upon full investigation. We don't actually have probable cause for that particular charge. So sometimes those go over as a harassment as a threat of the malicious Mischief any number of other crimes probable cause Write a my other question is so where those included and my other question is with your numbers when you talk about a case of being prosecuted malicious harassment or Center for prosecution. Are we talking about cases that include not only those malicious harassment cases, but also those cases where they've actually been charged with a different more applicable crime. Does that include our cases? Were they plead guilty? Does that include cases where you are? Malicious harassment charge may have maybe of taking a plea on it on his fault. So there's just there's a lot of There a lot of outcomes. I think I want to know if those were also address to lie Craig there are it does get a little complicated. There's are there are a lot of outcomes and we tried to simplify it here but in doing so we lose a little bit of the new ones of that process yet. So the Inn in the second bar there where it says 10 of these were referred is another crime that would that represents the 10 cases for that. That SPD referred not as much as fast as a different crime and then the prosecutor's office decided to prosecute as malicious harassment. Your the challenge for us is to prove the motivation of the intent of the offender and when you deal with the state level charges race color religion ancestry national origin other applicable State charges, there's no counterpart in the municipal court system lost a lot of parliament to charge those. So then if you sent it over there, maybe I'm up by us motivating factor in the Underlying crime that would have to be addressed at sentencing and the prosecutors have a way of doing that and I'm sure that happens more often than not. I'm so for all the reasons that we discussed on the other given the complication of this data. We can't look at these results alone and evaluate how the city is handling these crimes. I just asked for the viewing audience should go to page 9 of the report. There's some text there about our cases and referred for prosecution that are not accept that you know their whole there are a lot of reasons why that hackers. We make three recommendations to SPD the city attorney's office and the King County prosecutor's office related to improving the quality of and access to prosecution data, and I just want to let you know that these are abbreviated versions of the recommendations, but you're not report and the first is for SPD to improve how they document which cases were referred for prosecution and they're at old records management system. There was some limitations on how they could display that information. And so now that they're implementing a new system. They have the opportunity to make that Improvement. The next recommendation is for SVT to document the reasons, why cases were not referred for prosecution. So this would help give the city reasons on YouTube behind the two-thirds of cases that don't ever make it to the prosecutor's office. I don't know. Why is recommendation on this site is for the city attorney's office and the King County prosecutor's office to publish prosecution data, and they'll need to make some changes as to how they documented in their system such as including bias category and some other fields, but we believed that providing prosecution data and summarizing it on a regular basis would provide value to the agencies involved in this work and also be of interest to the public should since the wreck there's a recommendation that SPD document why hate crimes are not referred to prosecution. Should we also have a similar recommendation for the prosecutor side both County and and City for documenting why it in those cases that are in those instances that cases are referred by a speedy why the prosecutor might not take them? My understanding is it s p d and a city attorney's office and the King County prosecutor's office collaborate very well on that part of the process. There are not very many declines that we saw and they are understanding is that the prosecutor's office would return back that information to SPD as a feedback loop. So I think he knows why the case is not going to move forward. So then is the idea again. This is some of these recommendations are about transparency and having good information available to the public and advocacy groups about why certain cases is known as well as victims aren't taken. So should it be instead SPD should document why I hate crimes are not referred for prosecution and why in those instances that they have been referred? Why they weren't prosecuted I just I feel like there's your we're missing a piece there. That's really important for the public. Yeah, that's very fair yet. We also make a comment about recommendation number to document why crimes are not referred for prosecution. We have codes that indicate why a case was closed if it wasn't assigned. This investigation can B-Complex so we do document that off and it's often times. It's in the detective's report why a case took a particular track it almost always if arrested or a detective is assigned to it. There is a reason that it may not correspond to a a button or a code but it's there so is the recommendation I get that you're that the you do documentaries and for why not Prosecuting is the recommendation though that those reason sort of BT's out of the reports and publicly reported in a in a way that is digestible. But true. We do report out to the chief of police and public facing document. The thing that people have to recognize that Sergeant's assigned cases based on solubility factors the severity of I am back to the community and and they determine which cases to pursue a lot of times. It's on the willingness of the victim to go for right and they're participating in the in the criminal justice system existing witness statement statement by the suspect video physical evidence and a law in the filing standard really weighs heavily on our ability to send that charge over in jurisprudence requires us to make sure we have the elements of the crime. We can't just send everything over that would be subjecting someone to Alyssa's prosecution that we can't be in that situation. So we have to have solid cases that are winnable. I want to make a little bit of clarification based on his fifties response to that recommendation would I would just says and reading Chief Carmen best response written response which can be found in the report. We were pleased with the police part is going to try to do everything they can to provide more information to the public about you know, that funnel explaining why it goes from 398 to 37 so that I know part of this had to do with your system the the the mark43 system. I believe that the police department is switching to the records management system. Hopefully, we'll be able to help in that regard. So and that I know as the detectives are pointing out, you know, if things get really complicated when you get in the weeds and but we're going to continue to follow up on this recommendation to see you know, what happens with it. So that way then, hopefully, you know we Work out some of the technical details can be worked out so that can be as transparent as possible in public. Police Department is really appreciated participating with the city otters officer The Phase 1 and Phase 2 of this review tickle, his gives us an understanding of what you know, any concerns might be to have a little more understanding of what the what the decisions that are made in our out reporting to the public. It's easier to look forward and maybe improve the product going forward then spending many hours going backward. I I believe I love that the focus here wasn't on underlying crime but statistically there's a farm far more numbers of cases prosecuted and charged and convicted based on underlying crime than there is the actual malicious harassment charge itself. That's the thing. I was trying to get out. I'd like to mention that we have no reason to believe that that 1/3 number is a bad thing either and so hopefully, you know, we are recommendations. We tried to provide more information so that in the future we can better understand what you know, if if that's an actual good place to be if 1/3 is what it is because of the different barriers to prosecution. The third body of work that we did was a geographic analysis of hate crimes in Seattle and we contracted with dr. Tim Thomas from the University of Washington to analyze hate crime data and what he did is he took a SPD reports of hate crimes of hate incidents. He combined it with Census Data land use data and neighborhood racial data to understand how hate crimes are concentrated in the city. His full report is attached to our audit, but I'll just highlight a couple of his findings here. This is a map of South Seattle. The dots are hate crimes and incidents and the background colors of the map represent the different land use zones in the city. And we can see clusters and we can see clusters along California Avenue here along Delridge and then over here at Rainier Avenue South. Dr. Thomas found in about half of hate crimes are occurring in mixed-use and multi-family zones, and he thought this was significant because these two zones that are typically located next to each other and as we can see on the map, they tend to follow along major streets and Transit routes related to that when we looked at prosecuted hate crimes, we found it almost a quarter occurred on a bus or at a bus stop. I'm so we know that that's an area that we should be aware of. Dr. Thomas told us that these high traffic areas where people are living in apartments are going shopping or writing Transit sees a lot of interactions between strangers and diverse group and that could lead to more hate crimes. The other finding I wanted to mention from Doctor Thomas's analysis as related to Neighborhood racial diversity. This is a map of North Seattle and the background colors represent the racial makeup of different neighborhoods in the city. Dr. Thomas found that hate crimes are happening along the edges of racially diverse neighborhoods in so that would be were two different colors on the map meet up with each other the exceptions to this are in dense parts of the city like Ballard here and Greenwood and the district but in less dense Parts at the city, that's where dr. Thomas saw this board rain effect. I'm so his full report is in an appendix of our report. And dr. Thomas said he's happy to come present the council in more detail if there's interest. Yeah, I think this in itself is a fascinating topic. I'm really glad that we were able to find somebody to do this work and I feel like I'm not sure whether or not the recommendations of the city auditor address is any of these particular finding but I know my interest in an asking for this work to be included was really to begin a conversation or maybe continue one that SPD is already been having about how to use this information to do hate crimes related enforcement prevention targeted in areas that are identified as at high risk because of these socioeconomic factors. Colliding I think it's really interesting working in my my original request about this was related to the changing demographics of of community. So communities that maybe you were once predominantly people of color whether or not we see more activity there or is that were once predominantly white neighborhoods whether or not we see activity there and whether or not we really need to strategize our policy making to consider the impacts of development on These really heinous acts in our city. I want to thank you cancel number for inviting this review. It's really important and when you talk about neighborhoods, I think the one factor to that affects everyone in the city are the social dynamics of mentally ill or chemically addicted folks. And so this is one category in other crime categories as well. We're at least on a monthly basis. There's more than 40% of the offenders who identify that have those those challenges and so if there are chemically addicted or mentally ill or author medications they're acting out and it's not an excuse for Behavior, but it is an underlying Factor. We have to consider when we talk about resources and Community response. I really appreciate these maps in the analysis. On the surface. It feels like the the living situations are are driving some of these interactions but the situations we described there may be triggering these things are the exact. In a wine up with the plans were trying to encourage for the city, right? We we want to see less segregation in our city as opposed to more. We're certainly doing a lot more mixed-use types of development. And so assuming that we will continue down that path which I see no reason I still think there's a lot of benefit all that and recognizing the that as the demographics of neighborhoods change what we see is that hate crimes go up. What are the things that do? We should be doing to their to become that City. We want to be without putting a ton of people and I heard, you know, I heard one thing saying that there's a disproportionate amount of these are happening from certain segments of population for other conditions. And so we have an ongoing body of work to do to tell make sure we have the support in the treatment for folks that are in the 40% identified that are there. There's a research talk about like, you know as even in places that are historically Barry White You're still very white but we also know the demographics are changing throughout the country including these neighborhoods. What should we be doing as a community to to recognize that these tensions may come up and how do we act and respond to that? And how do we how do we how do we look at these singles at these bars are good to continue to increase if our development patterns continue the way that we're designing them to continue. What are the interventions that we can do to the question? Just from our perspective what we are focused on your couch bulb rhinos information because and you need information first to see if you have a problem, you know, and then once you recognize your identify the problem, then you can think about the intervention so, you know, so I don't think our office is really not allowed to defer to Melissa if she's done any literature research that might touch on some things that can be done enough to address the situation that you've described by all or leave it to a speedy to see if they have any ideas but I think and what we really try to focus on as I do we have our problem and you made a really good observation like, you know as we get more dance and we Embrace density, we may see more of these situations that doctor Thomas's research has shown us. So what are we going to do about it? Because it makes it more probable that going to have these issues. I'll just mention from doctors offices report. He has some thoughts and theories from research as to why we might be seen some of these patterns and that he acknowledged that more work would have to be done in order to confirm if the reasons behind those clusters that we were seen and then once we understand those reasons, then we can maybe focus on chafing prevention efforts tailored to address those. I just prefer guard to prevention. I texted that we're talking about crimes that occurred over a. Of believe it was four years, correct. For five years one of the challenges that we have for prevention and this particular category of crime. If we isolated is that the frequency of primes occurring within a compressed time span or in the same location are actually very small that was a request that I had of our criminal justice unit. And I received a report back that indicated throwing more police officers at this particular type of crime in this particular area wouldn't actually prevent cry. So I think it was one of the things to put in perspective. However is a lot of that the hot spots that were showing are hot spots where we have lots of other types of crime where additional enforcement is occurring and I am I also want to point out enforcement When we do get a malicious harassment crime, I believe is I think three times the national average if I'm if I'm not mistaken. I think you indicated. It was something like 12% and I think we're at like 30-35 are average rate that that I believe what you're talking about is the percentage of perpetrators that were arrested after malicious harassment case. So we protected those types of crimes. I think we're we're doing a good job of following up with the reporting that we do get an are reporting rates are very high. I'm certainly compared to other jurisdictions all around the country. One of my goals in this position that I'm in is to ensure that we're getting the maximum amount of reporting that we can get which is tough because one of the things we know about why is crime statistics if it's almost always the tip of the iceberg and what I'm doing these all the data collection and ever gation and Analysis, should I do I'm looking for holes. I'm looking for places where they know I'm hearing anecdotally that we're having additional crimes groups targeted in particular and I'm comparing reporting and I'm really trying to Taylor Outreach. To ensure that we're reaching as populations that might be less likely to report. So if there are things that we can do to prevent crime or if we have a particular offender that we can hold accountable. I want to make sure that we're doing that the detective wearing her position as a blast Prime coordinator heads in a lot of Outreach to the Immigrant community and not speaking. People in that way they understand how to report and what's important to report. This is also opened up a door to do our victim population that's homeless and including Mary at Mary's place and I do need some intervention work there. I believe that is also contributed to the reporting a place and is well-known and that's kind of spread throughout the country so detective Jim Ritter and and that effort has really taken hold here in Seattle as a as a way to protect potential victims. Like some of the problems in our society that ultimately end up on the on the police department's radar. They are created Upstream by so many different areas where we're not we're not doing the good work that we need to be doing. And so I want to just acknowledge that I I really appreciate your efforts to help us get the state at and obviously when there are individuals are hotspots in the police can do things to help minimize exposure folks are having that is, you know outstanding and want to figure out ways to support that but I'm also really interested in looking forward to take out one of the things for the broader things we can do you mentioned is a tip of the iceberg and I look at these numbers and you know the absolute numbers, you know for a city that's you know, three-quarters of a million people, you know, aren't a lot of other things that are happening in our Leave it to maybe don't even price level of crimes that are still discomforting to individuals. And how do we is a city? You know, I'm really interested in what are the types of interventions we can do to recognize that is our city changes demographics changes people from around the world come here with different cultures and backgrounds. How do we get along together? And if we can figure that out better we'll we'll have fewer crimes cuz they'll be few incidences that help clear eyes that level but it will also in the process. Just hope we make our city much more welcoming City and live another tensions that show up in different ways router community. And so I'm interested. I appreciate David your comments that they will be done today just really try to understand what the date is telling us where it's going and I feel like I feel like that there seems to be a pretty clear Trend and there's there seems to be some analysis that shows what we think is maybe driving that and I'd be interested in figuring out what the city can do to put some resources into a We're on our work plan to understand. Okay, now that we understand what's going on. What are the things that we should be thinking about? How do we get there best practices out there that weekend programs we can Implement let's let's replicate those if if it's like this is kind of a new field and we need to find some people to do some research to help inform some things. You may want to try. Let's figure out what that is to The Source body of work that we did was to serve a community organizations I'm asking them about their views on hate crimes we had 53 organizations participate and this included advocacy organizations, faith-based organization service providers and from their responses, we had three main takeaways. The first is that hate crimes are a big issue and that some people are not reporting them about half of the organizations that responded to a survey said that hate crimes are a significant issue to the people in their community and the people that they serve and most of them said that they knew someone that had been a victim of a hate crime within the past 6 months at 35% said that at least one of those of hate crimes that they were personally aware of it was not reported to SPD. And then at the bottom of the slide we list the most commonly reported reasons for not reporting a hate crime. So as it relates specifically to those those reasons that are listed here. I feel like our community has done things both has as far as policy and as far as resources to provide support to victims to try to ameliorate some of these issues for immigration status SPD does a great job of letting it be known that is the law of the city that please do not ask about immigration status. We have victims support organizations that help provide some assurances the support necessary to you know, not guarantee that somebody isn't going to be subject to retaliation. But to lessen the likelihood of that You know again as it relates to translation services, what are we not doing that we need to be doing because I feel like we have knit knit together a bit of a framework for support for more more people to come forward but it's not it's not Landing home with people. I mean that's a 19 of the organization survey. No people that did not report victims in to not report a crime that's significant. You're right. I should mention that end with hate crime. There will likely always be Under reporting. There are there will be some people that do not feel comfortable reporting to law enforcement and so perhaps in those instances, we at the city should provide other ways for people to report those crimes through Community organizations through maybe other departments or so. I think that the survey that we did. And the results from that show that there are opportunities for us to do more and perhaps in a different creative way. Can I would just say this is like a lot of Complex public policy and public policy issues that you just got to keep working out of here. You're never going to get a new CD rare to get Perfection. But you know just keep working at 9 o detective where I know it's been a lot of time the community talking to communities that traditionally may have been resistant to reporting law enforcement. I think you just gotta sbds just keep doing that. The city has to keep doing it Opposite will write essay, but everyone has a role to play. We just have to keep you know working the problem. Did I'm just interested in particular on the immigration status the peace did you find that of the 19 organizations of of of those that said that they knew victims who did not report a hate crime because of immigration status where those organizations aware that SPD it in investigating a crime and talking to a victim of a crime does not ask about immigration status for the sort. Those advocacy organizations are aware of that because if those are advocacy organizations don't all universally spread that to the folks that they work with and that seems like a really good place to start. I'm not aware if they were aware that. But again Getty that message out, I guess, you know, the more that you read about public official in this for another forums, you know. Just keep trying to get the message out and hopefully people respond. The second theme from our survey that we saw is it some people can be especially vulnerable to hate crimes organizations frequently mentioned people with disabilities people who are homeless people who have limited English proficiency and people from immigrant immigrant communities as having an increased risk of being a victim with also increased barriers to reporting to law enforcement there. For example, eight of the organizations that responded to a survey were aware of an anti disability hate crime occurring within the last 6 months, but in the past 7 years SPD has only received 10 reports of anti disability crimes and we know from the US Department of Justice that people with disabilities or two and a half times more likely to experience violence. So this is definitely a population that should receive particular attention. People who are homeless can also be vulnerable and in in Seattle reports of anti-homeless crimes have increased from 4 in 2017 to 17 in 2018. And I'm finally people from immigrant communities were mentioned as being targeted. And as you mentioned Cosmo purple despite a speedy not ever asking about a person's immigration status. It was still listed as the top reason for not reporting. The last thing I want to highlight from the survey is that many organizations requested more help from the city and combating hate crimes and I'll just mention a few of these on the slide here people ask for a better understanding of the reporting process and what is involved and they asked for a follow-up information on how reports get resolved tips on how to prevent hate crimes how to respond safely if you're a witness or if you're being victimized yourself how to recognize that hate crime is things and then also support for victims that may be hesitant to report because of fear of retaliation of the offender or fear of revealing at private information about themselves. Looks like we have for victims of domestic violence. Is there a potential for somebody within the police department working for you to talk to wearing to act as that role as victims advocate? Yes, actually get out of the homicide assault unit where I work we have two excellent victim Advocates that get quite a workout actually on these bias crimes cases to do a really good job of making sure that our victims are aware of Crime Victims compensation resources, you know that they can only get medical bills paid but that Crime Victims compensation can also cover things like counseling so I also try to do in these cases is to problem solve a lot of these cases happening housing BSU Housing Authority housing and sometimes that that means making a couple call the case managers to see if we can't get people apart enable the victim to move away or relocate an offender, so we do definitely utilize our victim advocates in this world certainly So as we discussed earlier, we know SPD does a lot of Outreach, but still we wanted to include a recommendation that address the three themes that I mentioned from the survey and that shown on the side here. And then finally we include a recommendation on evaluating hate crime efforts as I mentioned earlier. We can't look at any one metric like hate crime reports or prosecution data and see how we're doing as a city. So we recommend looking at other sources of data other metrics combine them together and we can use that to evaluate how are responding and Prosecuting hate crimes. And then I report we have a list of possible metrics the city could could use to do that. And I think that is like any performance measures, you know, if you just relying one it's like statistics, you know, they can always lie so that if you up, you know several measures you make it a more accurate more nuanced than a story. And then the fifth and final section of a report has two recommendations related to Data Tracking as I mentioned earlier SPD is implementing the new records management system. And so they have an opportunity to just make a couple improvements. The first is to make a policy around managing cases in the system instead of using hard copy files or other methods and the could make it difficult to have accurate information and Reporting and then the last recommendation is for SPD to formalize and document their policy on recording heat graffiti just to make sure that it's included in their online buys X dashboard. Any other thoughts? just have to add that in our overall goal of improving communities response and Department response to hate crime is is always At the Forefront and before I forget to say I wanted to thank the auditor's office for the comprehensive review. And for the council for inviting it is an important dialogue. So on behalf of cheap, Best Buy, thank you for the discussion. Thank you. I really appreciate again of the work that SPD has has done and increase their attention to this issue. I'm hiring a detective wiring and instituting the the dashboard and look forward to talking with you about your needs as it moved as it comes to moving forward on implementing some of these recommendations one other point before we closed there was an item from the last audit that I know I kept asking you about their problems moving forward because it related to the need to have a convener. This is you know, we are not in isolation here in Seattle with this rise. Crimes, it's happening nationally and it's happening in our state or it is our state that is being the greatest increase in the last reporting. And one of the recommendations that you'd made in the last report was to have a regional convening and I know we didn't move forward on that because there was some question about whether or not I think was Department of Justice Office local office. That would be focused on this was was even going to exist anymore. I don't I don't recall whatever happened with that but I I think it would be important to identify if if they're not there to be a convener. I think it would be really important to identify somebody else to to be that convener and perhaps that's the state Human Rights Commission or some other Statewide bodies that's in another item. I really would like the city auditor support. And again councilmember real will be following up on all the recommendations are not been closed down with that. We're going to be issuing our annual recognition fall, of course, I think tomorrow so but you know, once we have a recommendation, we always follow it until it comes to an end to this one cuz I think it's on me appreciate your work. Thank you and him to know. Add an item to is Council Bill one month 9288 an ordinance relating to the city's criminal code removing the separate crime of malicious harassment and creating a special allegation of hate crime motivation and amending Section 1 to a point 06115 of the Seattle municipal code. Expunge. Do we have anybody else to bring us a table now? And do we have somebody from ATL here as well? Do around to introductions. Thank you. Sorry, I'm the kind of locks from the Council on american-islamic relations. Thank you for joining us who would like to kick us off. This is we've had a few discussions about this bill over the last several months. Maybe I should do you want to give us a quick overview? So we're discussing this Council but which was heard for the first time in this committee last year in 2018, and we had discussed the proposed changes. This is this would make to the carnival just harassment out with the bill proposes to do is to to start the crime itself is essentially the intentional and malicious Act of property destruction assault or harassment because of a person's perception of another person's protected status and I'll go through this. Front protected classes are between the state in the city. But essentially the state protects protects classes including race color religion ancestry national origin gender sexual orientation and mental physical and sensory handicapped and that's at felony-level the city prostitutes misdemeanor level offense says I'm against the remaining classes classes that the city protects but the state does not protect which include homelessness marital status political ideology age and parental status. So what this bill proposes to do as a couple things first is to change the time of malicious harassment to a special allegation of hate crime motivation, which essentially means that instead of having to prove property destruction of salt or harassment in addition to proving that the that it was bias-motivated now, the discussion allegation can be added to The underlying crime so that the allegation of self is easier to track. The second change would be to remove the element of malice from the misdemeanor crime as it currently stands both the felony-level and the misdemeanor charge require a proof that the City attorney Tucson City prosecutor prove Beyond A Reasonable Doubt, there was both intent and Malice this bill would propose to take out the the element of malice which would then allow the city council to add back in protected classes that the state currently protects but the city does not and so those are the the maintenance of the bill itself and then there are a variety of amendments that I can go through in further detail. So I'm I'm currently engaged to what this will change is the ability of the city attorney's office in terms of the elements. They should prove for a crime and so even as it currently stands if the city attorney's office where to charge malicious harassment and they didn't succeed in improving each one of those elements. Then the person would not be convicted of Marcia Strassman in change special allegation. The city attorney's office could still charge property destruction assault and harassment and then add in the special allegation of hate crime motivation if they were unable to prove Beyond a reasonable doubt that the allegation existed if they were unable to prove special allegation, the person could still be convicted for the underlying crime of property destruction of salt for harassment. And and just to receive these are crimes that there is this is a charge if there's an underlying crime for the the other implication of changing to a special allegation structure. It would be that currently the sentencing range for assault and harassment and property destruction around misdemeanors, which is 364 Days Inn in jail or up to $5,000 of a penalty. It's it's not often that that maximum is reached in just an underlying crime of assault horizon or property destruction. And so if the recommended sentence for those crimes was on the lower end adding special allegation in would mean the city attorney's office could ask for a higher sentence with in the the rings of the misdemeanor limitations. Are the second item that I described was removing ballast from the the requirements that the City attorney would have to prove and as I described the the reason that the state and the city's most recent laws are different is because an act can't be charged as a felony and as a misdemeanor, it could be interpreted as being serious enough to reach felony-level charged or not serious enough and be charged as a misdemeanor, but both of those those charges can be made and sew in changing the elements of the misdemeanor crime. It means that the charge could be made then at the misdemeanor level and I know that's that's a technical change. It allows for the Third change in the bill, which is to add back in all the protected classes that the city for tax rather than just the classes the city lucidly protects, right? Tell we're adding in the classes that right now. It's it only covers the classes at the city exclusively protects and now our adding in the classes that the state protects and so in those protected classes essentially what that means is that when when a city has a friend that they believe is a bias crime that is less serious more misdemeanor level crime that is based on race color religion that the remaining protected classes as it currently stands. They could they could prefer that Prime up to the King County prosecutor's office. But if the the prosecutor's office doesn't believe that that is at felony-level the city is unable to charge that that crime as an associate of hate crime so they can still charge for property destruction, but they couldn't charge it as a crime. In this level of these protected classes would allow the city attorney's office to prosecute this these crimes as hate crimes themselves. And so the issue that we're trying to solve isn't that King County doesn't see that there's Merit to the hate crime allegation. It's that it doesn't rise to what they consider to be the legal standard necessary to be a felony or the the crime to be to be a felony and so they would kick it back to the city attorney's office. And as it stands now the City attorney can't prosecute on that added charge of malicious harassment a crime but not with the added element of bias. Is it so that is the bill as proposed and there are a variety of proposed amendments. The first is just adding in some recitals that incorporate the findings of the city outer space to report on bias crimes which includes the large percentage of increase in reports of malicious harassment crimes crimes of bias elements and then non-criminal bias incident. I'm Just Fab Four definition signal Strassman is when the criminal act itself is motivated by bias crimes of five elements are criminal acts that involve by us, but we're not necessarily motivated by the bias Itself by assistants are essentially offencive Vice comments. The second second set of amendments is updating terminology as it currently stands the the city law refers to mental physical and sensory handicaps. This would change that terminology to disabilities. What's the more up-to-date term used and also has to reflect changes that were recently made in state law the state legislature just passed and grow substitute House Bill 1732 with me a couple changes. It renamed the most distressing fence to hate crime offense, but it also updated that terminology from handicap to disability and it suddenly serendipitously. This is one of the items that separate from the track taken on a state law that advocacy organizations came to us early on in our discussion as to make make an adjustment to so I'm glad we're all doing it together. The third set of amendments would broaden the scope of the city attorney's Authority in that currently has lost lands the most recent only covers property destruction or harassment and assault restructuring to the special allegation would allow the city attorney's to to apply specialist Gallatin allegation 2 News. Just those three three three crimes, but this amendment would broaden the scope with that to allow the city attorney's office to apply the special allegation to all misdemeanors or gross domestic misdemeanors. The the intent is to be able to do ab special allegations to crimes that are closely related to a Saltgrass in their property destruction things like phone harassment unlawful use of a weapon to intimidate and stocking cyberstalking. And so that would allow this the application of the special allegation, but technically it would allow the theaters office to apply it to any misdemeanor. That's good to hear. We have heard from again folks in the advocacy Community about concerns about SPD and law enforcement in general the criminal justice system and their ability to address cyberstalking bias crime. So it's good to hear that maybe from the tweaks that were making here might help with that. What set of amendments refers to sentence sentencing condition or diversion requirements? So essentially this new subsection would direct the court to require as part of those that the person that allegedly commits the offense participate in the program, of course of training of some kind of community service that educates the person about the negative consequences of hate or bias crimes against the the victim and the victim's protected class and it would it could be waived if the opportunity itself is unavailable or impractical or the court waves it for a good cause and the it's not entirely clear what currently exists in the community in terms of those programs or trainings. So it may be worth reaching out impacted to to determine whether those programs do exist. What potential investment might look like to be able to further that kind of work. There are some really cool programs and some other. and then I've been in ongoing conversations both with organizations external to the city as well as folks within the city about what we can do to support the development of some sort of a restorative justice program. It is really focused on the harm that's done victims and to offenders around by his crimes. I just note the one the one additional thing. Here it is. This is the requirement for this kind of specialized sense and saying doesn't necessarily replace a sentence of a fine or incarceration could it's it's just a judge's discretion as to what that sentences. The Fifth Avenue men's ads in a reporting requirement and asks that there is an annual report from the city attorney's office that reports the special allegations that are filed including data on the demographics of both since the defendants and the protected class status of the victims. And then lastly there is a suburb of the Clause added into ensure that even if one part of the bill is found invalid the remaining forces. The bill will remain valid and then one one more technical set of amendments is just updating the the dates from 2018 to 2019 in the Bill of self. I really appreciate the work that was done to part of the ordinance that he often doesn't get the attention. It deserves and it's the recitals the recitals. I think really tell the story for the need to assess the City attorney in addressing what they're saying as an address unaddressed need and maybe Kelly could you talk to us a little bit about I went up I should should start off saying this thanking the city attorney's office for bringing this issue to me in the first place last spring. Talk a little bit about the perspective that you're you're bringing to this this work one of our vision to concentrate on in the mid part of what I was explained to him was our hands were tied when it came to certain types of cases that we were charging a lot of cases that we get because where we weren't allowed to have the same protected classes at work that the state use we can only charge that underline the fence. So when we do when we tracked that case, we see it as an assault. We see it as a a probably just destruction but we don't know once it enters our system that it had that hate crime element to it. I don't know there was some discussion in the last session about being able to track those cases through the system. There's a hole there if we can't track that and within this new legislation would allow us to track those cases that we get either sent to us directly from SPD, cuz they don't rise to the level of felonies. And because the other line fences and rice that level or the ability to prove malice in that situation, this is more difficult. We get those cases and then when we get them if it falls into a black hole in terms of how its designated case will get prosecuted as an assault her as a property destruction, but we just don't know about that. Hate crime element and its allows us to the boat rack that better and it allows us to focus our our recommendations in our nation's to the root cause of that underline the fence. So that's why we hope to Park Community groups to have just like we have the domestic violence designation mean in a sexual motivation designation and allows us to send people to certain types of counseling or certain types of groups that they can work through those issues in order to get at the end. We kind of put the brakes on this last summer is because of concerns from folks in the Civil Rights community that although you know, 100% of the victims of hate crimes 100% of them are members of protected classes. Some offenders are members of protected classes as well. And so we kind of wanted to use information that we received from the city auditor to get more of a of a sense of that. We wanted to do some more granular research of the types of cases that way that we've seen and I appreciate Kelly the hours of time that you spent with Detective wearing pouring over individual cases in order to come again get a handle on what it is that were that were looking at. Can you speak just would have generally to the concern I mean and I appreciate your willingness to report on the results. Prosecutions under this new allegation or I should say new allegation cuz it's an existing allegation but only for certain protected classes, but can you just talk a little bit about how your office intends to address the concerns that people have about furthering disproportionality in our criminal justice system while I was a track that much better just to see if it if there's going to be some disproportionate effect on the way. We use this special allegation. I don't think that it will show that there is a significant change because these cases are cases are going to be filed. Anyway, they just won't have prior to my bill would not have the special designation. So I don't see a reason for the increase in those levels disproportionality. We would just be able to track what kinds of cases those are better in the I want to be transparent that that there is evidence of disproportionality on the underlying crimes are being prosecuted that exists. But you're explaining is this this is my glock going to increase it as it relates to the findings in the audit for the County's prosecution. Correct me if I'm wrong. This is the County's prosecution of hate crimes, correct? They found that 85% of offenders prosecuted or men's 77% are white and 19% are black. So there is clearly disproportionality there. But again 100% of the victims are members of protected classes as well. So I am interested to see what we find after some some time with this, but I'm also really interested in lifting up our ability to support new programs that Really work on healing our communities and can be I think really game changers for these issues nationally. So I'm hoping that we can all work towards developing song again some restorative justice programs focused on particularly this area of the criminal justice system. If it was close to a third of those cases were the victims were African-American even though those numbers are disproportionately African-American being charged on the line offences the victims in the vast majority of cases are African Americans. So wow. We do recognize that that that disproportionately does exist that something that we going to look at in track. But we also don't want to lose sight of the fact that the victims of these cases also people color. What can I do you want to share with us? You were a really important stakeholder on recent changes that were made at the state level. I would love to hear your perspective why these kinds of laws are so important in these particular times that we're living in today and thank you so much for all of your efforts on this issue and with this legislation our chapter, like many other community-based organizations and advocacy organizations across the city and Country. I have been witnessing disturbing trends of increases and harassment intimidation and violence over the last several years care National in 2017 recorded a 17% increase in anti-muslim bias incidents as compared to 2016 and a 15% increase in anti-muslim hate crimes over the same. And so we would are really here to encourage and support action that are said he can take to address address and fight hate crimes in Seattle and serve as a model for the rest of our country. Kerry Washington, we're seeing hate manifest itself in many different ways our seeing the consequences that this has on school bullying with children as young as five-years-old routinely being called Terrace at school our seeing the consequences when Muslim families are walking around in their own neighborhoods and told to get out of their Town told they don't belong there or worse yet. We've even seen in and since I swear people are punched in the face when extending a welcome to a new neighbor increase observing these increases in our own chapter here in Washington in 2017, hate crimes and hate incidents comprise 12% of all the reports that we received and last year that went up to 15 and a half percent of all cases that we received it. Again. This is an earring trends that were seen from other organizations and agencies including the FBI's report that in 2017. 17% of all reported hate crimes in Washington state or incidents were victims were taught Headed due to their religious identity and even in Seattle or seeing that we're not immune to such violence and in the same report from the FBI 234 hate crimes were reported in Seattle, which doubled from its previous are recording. We strongly believe that we have a responsibility to protect and support our neighbors and fellow human beings. We owe it to the Muslim women who have been we've been working with who are who ride the bus to work and are attacked because of their choice to wear hijab what other stand by doing nothing. We owe it to the Muslim student who was attacked in her parking lot who worked with when a man poured gasoline on her and try to light her on fire. We have a responsibility to shift our culture away from accepting this as normal and pursue Justice for the victims of hate crimes. Are we in Seattle and Washington pride ourselves on our passion for social justice and commitment to creating a more Equitable society and we're hoping that are said he will build off of the momentum that we've been seen at the state level with the passage of house bills 1732 by which demonstrates a commitment to supporting diverse communities by calling hate crimes by their true name as you were mentioning. Their creation of a working group where they will work with different different government officials and with community-based organizations to research an advocate for Best Practices to prevent hate crimes increase reporting and hold a fun offenders accountable and we strongly believe that our City's leadership also should work with community-based organizations to create these best practices and increase our confidence in the reporting in Prosecuting processes for hate crimes acknowledged as you were mentioning also that our Criminal Justice System disproportionately impact communities of color and we want to make sure that any legislation does not contribute to this trend and we support their proposed ordinance is focus on restorative justice for that as well and also heard that his son Inc in collaboration with Community organizations, like the other aspects of the legislation as well. We also support the city Auditors recommendations to increase training for SPD to better record. Identify and prevent hate crimes to improve coordination and document and documentation for hate crime referrals and to increase transparency and hate crimes prosecution's and further support reform efforts to ensure. They hate crime charges are sought and applied accurately and evenly I thank you so much for having us here today. We're really really interested and excited to work with you on the on this ordinance and on more efforts that we can do in the future to to ensure that our city is accurately and effectively addressing a thank you so much for taking time out to share with us your advocacy across to stay on this and your successes and really want to involve your organization in the voices the people that you represent in their lived experiences and working on implementing not only this policy should we enact it but also the recommendations of the city auditor customer Brian. Do you have any questions or thoughts? Now just appreciate the thought for work that but I'm missing all your contributions to this. It seems like it's the right thing to do to move forward and try this out. I think my understanding from your information. There's a lot of outside just making these changes and we can continue to monitor to see if there's anyone that saying so so so moved all those in favor of the substitute, but I I got a potion of staining great. I just want to before moving on the the motion itself when I refer to a letter that we received from the nearest office this morning and she urges us to consider and move quickly on the bill and makes the point that we all have today that Seattle in the cities across the country of seeing an increase in hate crimes and it's important that we as a city make our position clear that we will not stand. We will stand against and we will protect our residents and visitors from bias-motivated threats harassment and violence and she you know speaks to these issues as the first openly gay us attorney having experienced bringing hate crimes prosecution's against those who attacks seek neighbors and worked up protect a range of civil rights, and she's also reached out to me as an advocate for for her own community and urging us to act on this on this legislation. So I it's important to not only have the support of the mayor but have her advocacy and I and her own lived experiences. And so I wanted to take the pills up as well. All right, nothing further. I will I need a council bill here lost track of all my pieces of paper. Thank you. I will move passage of council Bill 1192 88 Allison favor, but I will go on to full Council on Monday. Thank you everybody for all your work on this and there's much more to do. I had a genda item three is countable 119515 and Ordnance relating to Seattle Public Utilities amending ordinance 125475508 adopted the 2018 budget lifting the Proviso and Section 8 regarding expenditure of funds appropriated in a combined sewer overflow budget control level for construction of the ship canal water quality project storage tunnel at Seattle Public Utilities has completed 100% project design and it's met the requirements for reporting to the city council civil rights utilities Economic Development and arts committee instructions. Please like to start us off. All right. Thank you very much for the opportunity to speak hear about the Ship Canal water quality project weave. Pleated what size are as you know, the 2018 City budget contain the Proviso that required spu to obtain Council approval to proceed with a tunnel component of the ship canal project after we had completed 100% design. We have completed the requirements of the first flight. So and we're here to request approval of approval to proceed and Keith will present information about the five major construction projects and the tunnel package. Fantastic. Thank you. Yeah, just before we move on the council placed Proviso on not the entire project, but the element that we're going to hear about today, which is specifically limited to the tunnel. We've been receiving updates and no spoiler. Thank you. So mommy said today I'll be providing a brief project overview and then I'll spend most of our time discussing the storage tunnel design construction package cost and risk management. So the Ship Canal water quality project as a storage tunnel to reduce combined sewage overflows into waterways. The project will improve water quality by keeping an estimated average of 75 gallons of polluted storm water and sewage out of Salmon Bay Lake Union and the Ship Canal each year in 2013. The city signed a consent decree with the US Department of Justice EPA and the Washington department of ecology about combined sewage overflows into the Waterway. And this is a shared project with King County. They also have a consent decree. The project will address five of the city of Seattle's out Falls and two of King County's out Falls and we have a joint project agreement with the county which includes a claw split up about 65% for the city 35% for the county and there's some cost that are not shared. So this project is addressing the five combined sewage, I'll falls for the city. Then in 2018 shown here on the right. They represent about 84% of the city of Seattle sewer overflow volume, which that year was about 54 million gallons, once operational. This project will provide a significant water quality benefit to the region. This is a plan b r the project the project includes a 2.7 mile-long 18 foot 10 inch diameter storage tunnel from Ballard to Wallingford and construction is in 5 divided never had shown here including 5 drop shafts to take flows from the existing pipes into the tunnel. The tunnel will a sloped back to the west of the Ballard site where will happen Pump Station and then we also have a second tunnel and 8 foot diameter conveyance tunnel between the Fremont and Queen Anne site underneath the ship canal. Our design and construction schedule is critical to project success and this shows are design and construction schedule for our are five major construction packages, which are shown on the left. These packages are in various stages of design which one light blue and construction and dark blue the Orange Line shows where we're at today and the purple line shows are construction complete regulatory deadline when the entire system must be operational by the end of 2025. Are the red star shows our current projected date to complete construction, so we're in good shape to meet that deadline and our first major construction Packard package The Ballad of the packages shown on. The first row is in construction. So over our schedule shows that were on track today. I'm here to focus on the storage Tunnel construction package, which is road to shown here, and we've just completed design in the project begins pre-construction later this year. So the storage tunnel design is 100% complete. This is the project largest construction package includes the 2.7 mile 18 foot 10 inch diameter storage tunnel, which is shown in the blue hear the bottom of this graphic. It also includes the five drop shafts in R5 neighborhoods that range from 10 to 80 ft deep and diameter includes three conveyance projects to connect into the existing system and also includes that second tunnel that I talked about between Fremont and Queen Anne so that all those elements are shown in blue which step is part of that package. The package does not include our Ballard commands project our Ballard Pump Station project on our Wallingford Can Dance Project, which were the other three projects shown in that earlier graphic. So almost all of the project is underground shown here on the left is the drop shaft in Queen Anne on the south side of the ship canal near Seattle Pacific University during what weather it brings flows from cabannes pipes to the 8-foot diameter tunnel underneath the ship canal and into the storage tunnel. It's it is 85 ft deep and 25 ft in diameter and include the pipes that run through the 8-foot diameter tunnel and into the Fremont shaft, which is shown on the right. The Fremont shaft has an inside diameter 40 ft and an inside depth of about 100 ft or 8 ft or eight stories. Its purpose. The purpose of the shaft is to get flows from Queen Anne into the end and the Fremont Cab and systems into the storage tunnel, which one runs right next to it didn't include safety systems for our staff including stairways lighting and ventilation. Our current project cost estimate is 570 million with a 70% confidence and we discuss this cost estimate in my previous previous previous visit to create o in March. Some of the good news is previously when we came to you last year our confidence on that same budget was about 65% So we're improving our confidence and just to clarify that confidence at at 70% is that is that the likelihood that cost will be at or below the estimated cost to 570 million? And again when we were here in Spring of last year was 570 million at a 65% confidence and we've moved upward to a 70% confidence. And this is the Lark. This is the biggest part of the overall product as well. So we can ho that with a high confidence rate on this element. We we may be getting to a point soon where we have a higher confidence rate on the entire project is what actually are estimate on the storage tunnel or Engineers estimate is 218 million. And so when the bids come in for that we already have the early Works project that's in construction and the Storage tunnel at that point we'll have bid prices for about 80% of our overall construction costs or uncertainty on those cost goes down dramatically. I just said because this is the conference rating for the entire project. Not just a ton of us went through this just that's still it's that's great news and we were in the bid process now until we should have some more information relatively soon. I'll get to that schedule just a second. So this estimate was built through our cost reconciliation process with our engineering teams cost estimating expertise. We've had this review by outside experts and a benchmark with other agencies as well and was also done significant contractor Outreach to promote competitive and inclusive beds. So here's the schedule we were just talking about this is our 2019 schedule for bidding and pre-construction processes on the storage tunnel. We cumplir 100% design in January, which is the first Milestone on the left. We began our advertisement processed with the bidding community on March 6th, and we expect open bids on June 12th and after evaluation award the contract in July. Sao opening bids as I said is an important milestone for the project will execute the contract in August or September and expect to provide notice to proceed with the construction in November of this year at which time the contractor will begin mobilizing most likely at the Ballard site because they'll need to put in start installing a deep shaft there in order to start playing in 20 20 or so. That'll be the first element. They may also start work at some of the other neighborhoods. And any predictions on whether or not goods are likely to be coming in around the Mark or it just to sit up straight. So, you know, we're constantly managing uncertainties in wrist to reduce them. As this is a key to ask for our project managers and management team. So uncertain uncertainties just to clarify the difference in certainties are things that will happen. We're going to get a bid and we just can't predict how much they will happen wrists are things that may or may not happen. So for the storage tunnel Biz, there are specific uncertainties and risks that I want accent here. We're uncertain about where the bids will come in. They may be higher than the engineer's estimate. But over time. Our Engineers estimate has been trending downward. So r90 part of the difference between a hundred percent estimate and our 90% assessment was about 10 million dollars lower. We could have issues with contractor quality design issues and bid protest or bids could come in above the engineer's estimate uncertainty range, but I really feel very good about the advertisement to date and that that goes in line with how we expected to come in. We've had over a hundred Contracting individuals attend our to bid walks. We received a lot of good questions about the overall package and continue to get those none of these questions have found fundamental issues with the design and these really help us all so when we going to construction, we look at issues changes during construction and things so we're looking forward to opening bids in June. We can't predict the outcome but feel good that those bids will come in within our budget. Do we have a sense of how many contractors there are out there that are capable of such a large project? Out there that would be capable across the us or specific to our project. We believe that based on you know, what we are looking at who has signed in as a prime contractor. We believe that there are somewhere between 5 to 7 contractors or teams evaluate in the project and the bits and as you say for me for me teens to make themselves more competitive to be able to do the whole of the whole body of work and there's also a significant Outreach with these contractors within the local subcontractor community and also women minority business owned firms becoming part of those teams as well that's been part of our effort is to help link them all together and we also have goals related to those areas for the project as well. And I'm assuming that those goals are closely along the prior to hire policy that the city city has four. Not just windy utilization but also the use of apprenticeships and this project we have the project labor agreement that we're utilizing in those conditions are part of that as well. So last night we were pleased to present the Ship Canal water quality project storage tunnel hundred percent design to you and fulfillment of the Proviso as we move into construction for the next six years. I'm looking forward to working with you about the ups and downs of construction and ultimately celebrating when this work is preventing sewer overflows or combined sewer overflows into our waterways will continue to communicate with you on a regular basis about this important project through our semi annual reports and bright by presenting to you at Key Milestones, which are shown here and is scheduled to be completed in 2023 and ground for the tunnel when I walk her late this year. We expect actually Excavation starting excavation of the tunnel shaft in Ballard right after the new year. any questions he's going to work on this project and I really wants to express my appreciation for all of the pre-bid work that you've been doing. I think it's been critical the Outreach that you've been doing answering folks questions recruiting folks putting together those teams or encouraging those teams to be put together. I think it's we're going to see it pay off dividends those that work that you've been doing and I have a much greater deeper understanding for how would we do that work on the on the front and it really impacts our ability to meet our marks important. Thank you questions. I will so again we are voting on legislation that will lift the Proviso that the council placed on the tunnel prior to after completion of design and prior to I'm releasing funds for construction and the bill before us would would love that provides them. And so I will move Council Bill 1195 15 I wasn't there, but I an opposing abstaining this will go on to full Council on Monday. Thank you. Congratulations. Thank you. Items for is appointment for 30134 5 appointment of Robert wonsung Lee as director office of Economic Development. Hello. Good morning greetings. Sorry that were running late. But thank you for sticking it out with us. It's kind of held this committee roles. We start off with introductions place. Okay, thank you. I think properly introduced sensor bungs a little late. Thank you greetings. I can council members. Yeah. Yeah go right ahead. That's okay jump into introduction. Fantastic, we are here to discuss the heirs nomination for the office of Economic Development and since senior Deputy Mayor follow you are here to present. Mr. Lee. I will just hand it over to you director Lee very shortly for small. Just wanted to acknowledge. We are extremely pleased and excited to be able to present to you Bobby Lee is our nomination for the next director for the office of economic development director Lee and joins us most recently having served in a very similar position at for the office of economic development for the city of Portland. Tired of that. He had worked in there to gubernatorial a Governor's administration's in Portland, Oregon governor kitzhaber and Governor Brown working on a range of initiative. Associated with essentially cutting red tape through government bureaucracy for businesses prior to that. He worked in the private sector for several years and and and prior to that was part of the senior leadership team for one of the largest Workforce Development organizations in the Portland Multnomah County area. So we are really excited about the experience that he brings to this body of work and look forward to engaging with you over the next couple of weeks with his leadership and approach for the office of Economic Development and hope that he can be confirmed as quickly as possible and get to the important work that I that we share for our city. So with that council member, I'm really excited that you want to do this work. I'm excited that you want to do it for Seattle. I've already seen you out and community and in infinity and in particular With your participation on the public safety walk and your engagement with business Community stakeholders their share with us your experience in your your interest in helping Seattle. Go to to address some of the challenges that we have in supporting our business community and supporting the development of the priority sectors for for the city while doing so in a. Of great growth and making sure that we're not leaving people behind. Thank you and the council for joining us know, that's exactly right. If you look at the macro social economic indicators here in Seattle is clear that the economy is just extraordinary and it is the knowledge base economy. That's really taking hold and that has really improved the per capita income. The munin family income is the number to pretty clear Seattle is doing extremely well, especially from the Great Recession that we faced and that is similar for many of the cities on West Coast. And Portland is the same the challenging part is while we're faced with Incredible Prosperity poverty is growing at the same time. And it's the Paradox that we need to solve and that is a purpose of old ladies room and that Paradox exist because there are multiple different economies coexisting at the same time while middle-class job is eroding away and so will get into more details down the road once I get situated but that is a growing concern that I have and many of you have and that you were seeing prosperity and poverty going at the same time and are different theories around that but we won't get into the specifics but that should be the focus of what we do and so inclusive economy really is a central component of the mission of the department and the vision of the mayor and many of you going through the door. It's pretty clear from the neighborhood is dropsy in Chinatown ID Capitol Square South Park, Soda Creek Georgetown downtown Ballard Waterfront Fremont. The business is there are very very concerned about their future from the global competition. E-commerce industry the the livability challenges and exit the capital issues are really pressuring small businesses in ways that we've never seen before and so you hear those issues loud and clear star office role is to provide different scenarios and solutions to addressing those issues in the new economy. So I'll leave it at that and open up the questions. Thank you. Thanks for joining us as well. They're your appointment has generated a lot of interest from from council members and I recognize that our house is also created a bit of work for you because that interest was demonstrated in the way of a lot of questions that were shared with you last week that you very quickly responded to a really appreciate your efforts there and Highlight the fact that I have distributed the answers to your questions to council members, but we will also be making them available online for the for the public to reduce. So given the fact that I hear that you're interested in having a deeper conversation about the causes of this Paradox Scituate. Anafi, what are your ideas for making sure that in light of that reality time regardless of the causes what we can be doing more to protect and protect our business owners as well as preserve our businesses that are owned by communities who do this work in areas that are rapidly gentrifying Well, thank you. The problem statement to me is as you had the economy is constantly evolving. And so we D when you have a service-based economy and knowledge economy coexist at the same time at the same place, but we're noticing is that the middle wage jobs are eroding away and there's tremendous pressure for small businesses. Answer the question is when the economy is continue to evolve. What is the cost of what what hole Seattle to be the Seattle and a lot of it is our Legacy business has is our Urban environments. That's exciting for a Workforce that the young Talent moving in the Urban Design the urban experience the excitement with an urban environment is really driving Talent move here that's driving the economy but their trails to that and that is that as people with young people account moving in. It rises does the cost of the cost of living and the cost of the land price and all these things are signed rice. And so the cost of running small businesses is enormous. So the role of oud really should be about addressing those issues and their many ways to do it, but I'll just highlight for fry now one is making sure that the neighborhoods are supported and their commercial corridors are support having an economic development strategy does neighborhood-based is one of our strategy second is Small Business technical assistance. Third is Workforce Development, making sure that people can compete in the new economy and forth is targeting T industries that have propensity to invest in local small businesses and higher from diverse communities as the four elements. And I want to encourage my colleagues to have answer question. I asked questions if they have them as well take a pause. If anybody has first of all, I really appreciate the chance to be with you. It's always great when he is still someone from Portland to come up for a city to carry on some great work. Are you said it not me but there are a lot of similarities between Seattle and I also really appreciate your framing of the kind of fundamental challenge that you see for the office and frankly. I think that fundamental challenge really underlines a lot of work. We're doing across the city and all departments on this Rising prosperity in the same time Rising property in this disconnect of what you know, that used to be American dream is turning into some nightmare of sorts in our streets. It was yesterday. I guess we had a special budget meeting and the auditor reported some data from different time periods. But one thing that struck me was median household income is this going back to 2015 was $70,000 or $70,000 on average across the city American Indian Alaska native was $26,000. If you're black or African-American $30,000. I mean the massive racial disparities. We know that the median income continues to go out. We're seeing that are affordable housing work without the housing where you know, we talked about and who is this? You know, what is this unicorn who's going to be affordable portable someone work earning 60% of average? If that income is going up but it's not spread equally, it just makes even are subsidized housing more more Out Of Reach of low-income household because they can't keep up with the rent increases that they're facing that is subsidized be so hard. So I'm curious City certainly strong and talked for a long time. You look at the demographics of was access to this tech jobs in my know. We're pretty pretty poor job. So, you know any ideas on how to rear the future for so many folks actually available to a broad spectrum of the population. That's what you're absolutely right on. I just had my staff do some analysis. I didn't print probably as much as I should have but I'll just I'll just come clean out to you and I'm sorry is that It's clear that knowledge jobs are the dominant jobs here in Seattle. The middle wage jobs like manufacturing is a way behind in terms of national and Regional average. I mean what I say way behind it is way behind wages are percentages products by GDP in the local level. And so it's clear that if you look at the behavior of our economy in Seattle that knowledge jobs are really booming while middle-class and Louis jobs is the lowest drops actually going up to the middleweight jobs are eroding did we talk about is a blue collar worker have access to these are living wage job just right in other communities are more Diversified and we have is Gap. College to participate in an OSHA inspector exactly only have the low wages Maryland Industrial and conversation as an example industrial and is supposed to produce middle wage jobs to Blue Collar jobs, but the landmass is a routing and does a lot of Temptation to flip those lamps for other uses for knowledge jobs to be frank. And so it wasn't public strategies that we need to focus on an alignment with the mayor's Vision around protecting industrial and another strategy is a commercial portable commercial space program because it's something that I worked on in Portland. I was a sponsor of the very first affordable commercial space program the tools here in Seattle different or if the state of Washington compared to Oregon and so you had some learning this as I'm transitioning so your tools are going to be different so we have to be a more creative and how we approach our Public dollars in house infested but my goal is to provide all of you with different scenarios and how we address the middle class jobs issue and affordability for commercial space programs and is a way to address this issue in terms of skills that issues. You all have passed the great ballot measure to invest more in 4/4 trading that's really going to help you need to do a lot more of that because education really is the best way to create self-sufficiency for the emerging or Force larger ones that I have the potential to bring someone in it, you know an entry-level job and move them up over the course their career into a highway that job and make sure you know, obviously this is not just and then we need to providing the the base to the housing the transportation the access to education but so often I find government hear stories of government that comes out if the night How we're going to turn this around and you need all these people at their graduation ceremony. They're so excited and it made me realize you're not like anyone hired those jobs went. There are three programs in Seattle colleges where they're getting people into manufacturing jobs welding jobs those types of things, but you know, what? What is there an opportunity for the tech industry in Seattle to to step forward and show some leadership on I'm not just recruiting the best people from around the planet but but creating opportunities are folks right here in our own Community. We had I had extensive discussion with the mirror and mr. Fong on this issue and that is inclusive hiring of local talent. Now the argument that can be made from demand-side is that the supply side is not producing enough knowledge workers there for to have to recruit from outside H-1B visa and so forth. I've been in the high-tech business, so I've been The middle of this. So what we have to do is make sure that our education system is an alignment with the future demand of workers and incentivize the demand side to hire locally whenever we build roads stormwater system painting a benefits those employers. There should be a community benefits agreement that they would hire locally and also once they're in the door that they have accelerated upward Mobility opportunities 3 incumbent worker training programs. And so those are the kind of Workforce Development program that we would we need to really focus on but the key thing is that our education system is demand-driven is so that it makes sense. Once you graduate. You can actually get a job. So the medium size and large businesses they have to be in alignment with that strategy and debtors Community benefit programs that I've started here within actually in Portland called Portland me to progress and that's an initiative. Private sector hire locally and investing small businesses locally for sports is it has something called Force First Source hiring agreements and as a result, then you get benefits and investments in their infrastructure and so forth and so on basement for local hires and Public Works projects outstanding work really changing the the the path for folks and there's not enough of those jobs to lift. The people we need up out of poverty, but that's fascinating him that we focus on for a reason and write its creates a healthy economy when you're not investing completely in a single sector, but it also Diversifies your Workforce as well and across across different incomes and it makes it so that you're not losing your middle class. And so if we could be more intense. Not just about saying that we have these inspectors, but about really investing in them and creating those Pathways eye but not just it's not just about creating Pathways right? It's also as you say about creating expectations for for employers to hire out of those Pathways with you. Thank you for being here. So this time so much about you spoke about this morning has the same as the driven a lot of investment to make some changes the Washington State opportunity scholarship Washington initiative. And so I'm curious where can I get a little bit more of your understanding of just how you see the office of economic development in trying to empower communities of color in small minority-owned businesses as well. The r1000 is I'm sorry you feel so there was an initiative several years ago called i-200 and it restricted the state's ability to have affirmative action programs recently. There was another initiative to undo it called i1000 and rather than having it go to the ballet but our legislature in its wisdom decided to enact it. And so now we can look at using race and other factors related to people's protected class as a consideration and making hiring and Contracting decisions. Thank you for the clarification. So when we apply Equity lens to Economic Development programs, we have to ask who benefits from these programs. And she's look at the model that I worked on in Portland at least 70% of our investments went to small businesses owned by people of color. If you look at the cluster industry programs that we had in Portland, we targeted medium-sized and large side businesses owned by people of color. If you look at Workforce training programs is by far probably 85% from underserved communities and so with limited dollars that we have it all wedi. We really should be asking ourselves who benefits from these programs and that is we we need to make the Investments two words on this earth population. And that's the direction I intend to take with the with OED often comes up within the context of the city doing the work that the voters have asked us to do with the passage of various levies publics Works. Levi is a prickly as it relates to Transportation projects as the impacts that large Transportation projects have on small in some cases vulnerable business. Can you talk a little bit about your approach to helping those communities be resilient but also acting as an advocate with the capital departments that have a responsibility for delivering these projects. Thank you for the question. For small businesses for traffic is a like blood. So anytime we invest in public works project and we're stepping on the oxygen hose for the small businesses is Our obligation as public aid by Solutions. The question is how do we generate the capacity to do that? And how do we do it and there's a couple options. What is in Portland? We pass a 1% construction tasks to support small businesses technical assistance and Workforce training. Every time you have a public work project like the one you just prior to 1% of that funds go to build capacity for underserved neighborhoods small businesses. So they can mitigate the construction that will is coming down the pipeline that's going to affect her long blonde Improvement program. An Outreach and small-business mitigation. And so that the capacity should be sprinkled throughout all of our Public Works program so that we have the capacity to address head-on. That's that's would be some of my suggestions but this is got to be an ongoing program and not a one-off right and that's why Portland past 1% call c o u p program 1% tax on profits rather than being surprised and then all we have to do something about this little bit into the project. So we have to plan for absolutely. So this is the first of two discussions going to be bringing you back at our next committee meeting as well after the other council members might want to join us next time after having a chance to review your really thorough in and helpful responses to the questions that we put you on my anticipated about in the next next committee meeting. But unless there are other questions. We are as as we usually are behind times my fault, but I would love to the next and last attend item which will have Legacy business program update. It's a good transition of imagine that must be somebody who wrote that agenda. Reading Writing a screenplay every agenda I'll go ahead and open the South Valley. Is that okay? Can I defer to the chair? Yeah, I would love it actually if if if it's okay, if I only could just quit quickly give us a thumbnail sketch of where we've been and how we've gotten to where we are now and then extra leave and take away. Great. Thank you. Cousin members. I'm going to have them talking. I think the memo that the office of Economic Development prepared wasn't attached the agenda and my memo service Peaks that I brought copies for the committee members. I think I have enough there. So I wanted to just first sort of provide some background on the Investments and decisions and policies are Action Council Members have made in preparation of creating a legacy business program. So over the last three annual budget process review process is the council has added resources to the office of Economic Development budget to support a legacy business program in the hopes of both helping to support these businesses long-term presents in the city as well as to recognize their contribution to the cultural to the history to the fabric of our neighborhoods. So in 2017, this was first brought up to the budget process under the leadership of councilmember herbold. $50,000 is added to a wee-dee's budget to conduct a study to help inform a scope and definition for implementing a legacy Business program. So that work included interviews looking at case studies looking at the office the city of San Francisco's program and provided some framework for development of a legacy Business program in 2018 resources were added to provide Consulting and staff resources to design and Implement a legacy business program and develop technical assistant tools and in last year's budget cycle $110,000 was added for the 2019 budget to really get the ball rolling and implement the program to develop in Mantua nomination and selection process develop a marketing and branding plan and to promote technical assistance tools, which have been designed specifically for legacy business as in addition to looking to other community organizations to partner with to provide financial assistance or other supports for legacy business is And then in addition the twenty20 and Doris budget included $60,000 to support the ongoing program needs for a legacy Business program. So that all of these Investments have resulted in several studies and has informed the ongoing development of this program including development of key technical assistance strategies. OED will go into more detail about some of the tools and some of the pieces there they're working on but I just wanted to highlight sort of the number of steps Council has made over the last several years to get this program off the ground and then following a lady's presentation. I have some policy questions cast members may want to consider I think you appreciate the background and the 2017 the Legacy business study was completed. That was a foundation for peace in the front are the design and implementation report an outage report was completed and now we're on the implementation mode. That's the phase that we're getting into and there are really three components to this one is succession planning what we found out in this is a program that also exists in Portland. And so we call it something different we call it a program tools are different. The program that we that I oversaw in investing on Legacy business has the succession planning is a big part of us because folks are retiring and the next person is coming on board by have different vision and different approaches and that that transition is an important trust transition in preserving. Legacy businesses and then of course the lease Agreements are big part of this as well. And so in the last part of the marketing and branding of these Legacy business is to provide more foot traffic. That is the key for many of the small businesses. And so those are the three different dimensions and rotten as part of our implementation phase and with that. I'll turn it up to Michael unless you have any other questions. I'm just curious. How do you define a how did you define your version of Legacy business is in Ireland, right? I think it was at least 10 years. But I think it was a range, but we also prioritize Legacy businesses are owned by women and people of color is it was another criteria as well, and they're also have to be geographically located in certain parts of the city by the city y program to Bethel. Thank you. Actiondirector it's a pleasure to be able to work on this. It's been a real pleasure to be able to rise these tools to discuss the round small business important survival tools in the city of Seattle. So as director the indicated we have focused our initial work after the many studies we done on the technical assistant education tools the two tools that were Primary in all the studies. We thought we're both succession planning and a commercial lease piece. So we have worked with legal service to come up with a commercial lease toolkit. It's a very thorough simplified legal document for people to understand their leasing options while we're not advising people on lease options. We are trying to educate something about the best possibilities and with the displacement. Tensions in communities around Seattle. We know that education around rights and abilities in terms of Leasing and buying a new locations are of utmost importance to many long-term business. So we have created that to look at which we have now turned into an infographic to take out to the community for easier access. We've created a working for graphics are really kind of great pass around a copy very simplified version of this that will directly go back to the falls commercial lease to a kid. We will also be including one on one consultation with those were created by to look at in language. So we've started with Spanish simplified Chinese and Vietnamese. We will be using culturally competent Outreach folks to go out to the Legacy business is to talk through these options. Now that we have this under our belt will be able to produce the same product for succession planning toolkit. And right now the real estate issues rise as a priority for education. Legacy businesses, but we are just getting out of start of the marketing and branding piece of the program which is a little more fun perhaps in the legal pieces of the program. And so we are beginning to contact marketing firms about the possibilities of what we could do those possibilities include and online directory or map to Legacy business is certainly Brandon social media campaigns. We're still determining what I love those factors will be but education and technical assistance and Market in a brand of the way we were gonna work and we're looking forward to adding elements to all of those pieces as we go along we've already had other issues of Interest around education for small businesses come to the table the real estate conversation, I think is where to start the education too old and the market and Brandon will offer the kind of support through our department working with professional marketers to really tell the story of the importance of the Legacy business is the importance in our economic story as well as our cultural story in Seattle. So So it's good work. We're pleased to be doing it. We do have some complications with some of the services we are available to offer as probably as pointed out given our state constitution, but we are working with that to find the best memes that we can back on the succession planning peace a question for acting director Lee just because again, you have some experience running a program like this in Portland. What was your experience with doing succession planning to people who because again people businesses that are loved clothes for lots of different reasons in and sometimes it is not as simple as a we're being pushed out because the rents are going up in some cases. It's because there's a business that's been in the family for a long time and the owners are aging and perhaps their errors are not as interested in running the business. So as it relates to succession planning if you there are some Options here that include things like transitioning to Cooperative ownership tenancy in common or nonprofit structure community-owned crowdfunding. Do you have success stories where business owners did not necessarily want to continue wanted to wanted to wanted to retire but somebody else kept the dream alive because of tools in Oregon. It is fundamentally different than the options the financial tools that you have in Seattle. We didn't have a succession planning function because I only use for Capital One thing. I like about the fact that you added in that Dimension. So there's a pipeline of owners and frankly. I wish we did that more. That's one thing about this approach that I do like but the tools were finally different. I think that we didn't have a way to fund that it very accurate are lots of different reasons. The business is closed one of them. Sometimes they the air is made. Be interested in continuing the business but there are other models if the business is well serving the community we're looking at Cooperative ownership the the best pub program more than a pub I believe it's called is about Community ownership so that when businesses go up for sale and they can't take away the community actually has a mechanism with which to purchase that land of business. There are that's not something we will be looking at but but there are other models and there are other ways of translation of business. I can again speak to my own experience as the successor to Barbara Bailey at the bookstore that we own we were family business. It was a different family model then traditionally is left. On the Family's business model, but we made it work in a way that supported that business in that Community going forward. And so we want to be able to support books to do that too. So even if there is a lack of interest on particular blood family relatives if the community and there's ownership there that we would have tools available for those people to continue your your own personal experience dealing with these exact issues around ownership. So thank you for the invite him just makes me all the more happy that you're at the helm this one. Even though the tools are different. What we did is we use our fordable commercial space program to actually attracted Legacy business into this program. So once we Master Lease a building than the criteria for taking over to the affordable commercial space is for businesses that spend in the community for long time. That's another way to address. This is well right now, so as it relates specifically to some limitations that we have or we can get creative around supporting the capital needs of some of these commercial spaces. I do want to highlight the fact that we do receive or we have in the past though. It's unclear whether we're going to continue to receive them that we have in the past received New Market tax credits that this last round we have earmarked for for commercial improvements and properties that are designated as like Legacy businesses, we've also talked to folks who are CBS who actually have access to funds for that don't have the same restrictions and I think one of the work plan items that we have lifted off his how to create agreements with those organizations that are already supporting small-business how we can create a link with the small businesses that we identify as needing support to the resources that they have available and I will be drafting in memorandum of understanding or directly on exactly that issue. We want to make sure that we offered that we make sure those services are known to the community. Sometimes it's as simple as making eye contact. So if we can lift that up all the better if we could just with the time we have shift the conversation to part of this effort that I'm really excited about which is the The designation in nomination side of things and I appreciate it's sort of a chicken or the egg a weedy has been focused on developing tools for legacy business is while I've been encouraging also that we develop designation and nomination process as well. But I appreciate that they've been purposely pushing back because you don't want to you don't want to designate a legacy business without having something to offer them because as I've been reminded by small businesses, they don't just want another sticker in the window. That's true in front of you will see what we have nomination the designation scenarios one piece. We would like to point out that conversation. We will be looking to our professionals that we bring another contract to help us think about this as we see this is a primary marketing tool in the program but there are different scenarios for which we could raise these names. We believe that starting with the neighborhood business district support organizations is the best way to do this work. So we'll be trained or many partners across the city in neighborhoods a business Improvement associations Chambers of Commerce Merchants group and then in neighborhoods where those those organizations are less solid or perhaps suicide compacity OED will be stepping in to help with that imagining a system where we see a first round of nominations coming directly from those folks so that we are here in specifically from neighborhoods and communities about the cultural institutions that matter in their particular District. We don't pick up top down approach on that is a good idea we What every district has its own unique personality is own unique history and I want those people to be able to raise that to the surface. I think once we have that and who is making a final determination to receive the products were looking at we have a couple of different possibilities one is the mayor of small business advisory committee, which was formed just a little over a year ago now made up of 27, I believe for a small business owners from all around the city different sectors different neighborhoods a different ethnicities and cultures genders city council at this committee or largest city council vote could be up mayoral vote. It could live in the office of Economic Development. There's the possibility of a public vote. That's not our highest recommendation only because we have some some questions about selection by us about you know, multiple doting those kind of things are the things that come in in play when you're talking about that kind of Publix out. So those are the options were looking at the moment, but we will be looking for Guidance for marketing professionals to help us make that final decision to it. Looks like you're heading out swing around with you. Yeah, I can I can follow up. I think there's an opportunity here as they're moving into the development of the nomination doesn't Nation program for council members to provide some guidance on how you think the community should be about the nomination and selection process at the council should be involved so I can Circle back and we can follow up with the office to provide some guidance and continue to work with them as they move through the process. Alright, thank you. Thank you for highlighting is opportunities. I think the best way to address, thank you for asking for feedback on this part. It's a really important element to and it's important to get it right. It's also important to me to make sure that that they are these decisions are being made. These recommendations are are coming up through the neighborhood business districts, but it's also really important to me to figure out how to give a voice to the patrons of the business because sometimes it is the patrons who are the strongest advocates for those for those businesses. And so trying to figure out a way to incorporate their voices is it that this whole notion of Legacy business program came not from a business owner, but for from somebody who has studied these programs in other cities and has documented The loss of of Legacy businesses in our city and it's really important to emphasize. I think that our Legacy Business program is not simply about the number of years that you've been around but it's about the value that that business has to a community and to Our Roots and and serves as a sort of a bridge to our culture and that is going to be different from neighborhood to neighborhood. So into the place is evaporating to business in their own communities. Thank you that earned.", "end_time": 8481.7}]}