{"format": "raw", "annotations": [], "confidence": 0.9392122256494787, "data": [{"start_time": 0, "text": "Good morning. Thank you everybody for joining us here for the regularly scheduled March 6th, 2019 meeting of the Seattle planning land-use and zoning committee. It's 9:30 in the morning. I'm Rob Johnson chair the committee soon to be joined by my colleagues council members of Ryan and her bald with one item on today's agenda. It's a briefing and discussion on Council Bill one 19469, which establishes environmental requirements to mitigate the impact of development on displacement. We will not be taking about on this item today, but just sharing a little bit more about the topic itself. We're going to start with public comments. There are nine people who signed up to give public, today. You'll each be given 2 minutes and then we'll move into a discussion of our own the agenda item. The first person is Alex Zimmerman followed by John Lombard and then Dennis Saxman. Hello, my best and lovely cancel Johnson. What's the weather in my car have explained to you why I sent you is to bed in too early for make this decision because next year it will be totally differences chamber in possibility or corn so you'll be out all 9 maybe all night cuz it's very important decision right now. What is you make you never will be exist. You months from now this paper from east coast to West Coast societal is number one Factory city in America is so special in the newspaper reason what is icing in your decision? Field notes ugly for these people and number three what is absolutely unique cross Constitution and open public meetings act in exactly like Gonzalez is 5 * 5 * 5 * 8 Constitution open public meetings act 5 times supposed to be moved right now. She did this for me, but it's a very big difference right now. I speak to everybody who listen to me because he had a right now is number one in more console right now. I'm supposed to be kind of it. I know what are Capricorns. So is this situation I thinking is to Airlie makes his decision stand up, New York. Lombard you're going to be followed by Dennis Saxman and then Abdi Yusuf. Thank you so much are good morning council members. So I'm John Lombardo. I'm a candidate for city council District 5 and I'm here to support council member herbold's ordinance. In fact, I believe doesn't go far enough. Why not applying all Urban Villages and higher at high risk of displacement including Lake City and Northgate in District 5 if the legal principle is sound why not apply across the city. The stock of unsubsidized affordable housing in Seattle is enormous Lee valuable resource in these times. If a one-for-one replacement ratio is too rigid why not have a very sizable payment required to go through any destroys this resource. It could be on a sliding scale or a greater compensation for the loss of more affordable units. The market does the exact opposites it incentivizes the destruction of the most affordable units since they provide the biggest jump in rents for the nice new market rate units if the legal basis is there for council member her Gold's ordinance of the market that is manifestly against the public interest. Please do all that you can to disincentivize the destruction of our very precious affordable housing. This is crucial for mha to be the positive Force for good but the council seem to believe that it is. Thank you. Thank you Dennis. You're going to be followed by Abdul Yousef and then John Fox. My name is Dennis Saxman. I live in affordable housing on Capitol Hill. I am several thousand dollars below the extremely low income level of Hud. I think I support this legislation, but I think it needs to go farther. And because the people who really need housing are at 50% and Below of income not 80% of area median income 80% of area median income is $82,720. That's $6,983 a month. Surely if those people need assistance then people far below that need even more. I regret the council member. Mr. Johnson does not feel my comments it significant enough to listen to them. I'm familiar with the group and he's on board ruling that we have a right to comment, but we have no right to be paid attention to but it's pretty rude. What concerns me in this bill is section where it says that compliance with? The soreness will be compliance with all the displacement relocation assistance and other anti displacement features in Seattle law and I'm wondering like what does that really mean? It seems to me it had the potential to gut this entire ordinance. and you know, it's been I've been coming here for years and I've heard this. Well, I'll give you an exact reference there. It is 25. 05. 675. 1 or I 1 B3 except as otherwise provided in section 25.06 75473 compliance of leave ordinance Provisions relating to housing relocation Demolition and conversion stickiness recycling. Good morning council members. My name is Abdullah Yusuf. I'm a coalition organized for Budget sausage and organized organized outside call in about 20 community-based organizations. We come together to be unified voice for Community Control uninspired deformity in the Rainier Valley console Melissa. How old is proposal 2 adequately mistreat them back to of new development that would demote demolish housing affordable. How tall is Aaron 80% of Ami and Below by requiring those developers to replace the units demolished in addition to comply with MHL requirements. We think this policy could be strengthened by increasing the affordability of the new units too much damage requirements at 60% Am I an expensive the neighborhood is with both hype displacement risk and high access to opportunity where we we are losing the masked Market profile. Horrible units. We have seen the impact of displacement firsthand in the Rainier Valley with the arrival of the lights. He'll come and increasing disability to live in the neighborhood grants for housing on a commercial space are icing a new development is not accessible to low-income people and people of color. We have seen multiple family brobots turn down to make way for electric Department's landlord is increasing friends across the border. Orlando landlords are in the face in building tenants. We believe that this policy father is strengthened by the expanding High displacement risk, and high assist opportunity will help keep household is living in affordable units from Vince playlist. Thank you. Thank you Miss Theresa John Fox followed by David Bloom and then Steve Stella. John Fox coordinator of the Seattle displacement Coalition from 2016 through 2018 the city of Seattle experience to record number of demolitions of existing. How is saying over 200 scuse me, 2690 units were lost to demolition. We surveyed tenants residents who live in those buildings and more than 7% of those who lived in those you units were people with incomes below 50% of median. That means over 1800 and 80 units were destroyed serving those most in need in our city over three years by comparison. Let's look at the city's housing production figures over the last three years the city spent a hundred and seventy-five million in public dollars to produce 2500 and 60 units, but only 1434 of those surveyed those at or below 50% of median. That's a net loss over that 3 years of 455 low-income units 175 million all to come out at the other end with a net loss of the stock. We most desperately need in the city their applications pending right now for removal of another 910 units of housing stock over a thousand units of existing low income housing in those areas that have been up zoned recently in the last 2 to 3 years have been lost due to speculative activity the buying and selling of property. And you can't say it wouldn't have happened without these ups owns. The u-district was up zoned out their projects resulting in demolition, but the app that was not does not include there's been no demolition of those 200 units we support council member for both proposal. It must be strengthened to require one for one and it should apply to all neighborhoods and replacement unit should be at fifty percent. End of medium please strengthen this law. Thank you. Master Thank you Lisa herbold for moving this critical piece of legislation forward. Good morning council members. My name is David Bloom on the founder and board president of the Seattle displacement Coalition. And I want to Echo the remarks of previous speakers to support council members. Remember her bolts Amendment and in an to strengthen it in a stating her purpose in presenting the amendment. She's she writes this word Authority granted under the State Environmental Policy Act create a requirement for developers to mitigate the impacts resulting from the loss of affordable housing the mha framework legislation passed in 2016 States the council intends to consider whether to include higher performance and payment amount subject to statuary for those areas where the increase in development capacity would be likely to increase displacement risk. The council intends to consider a range of strategies to increase affordable units sufficient to offset the affordable units at risk of demolition demolition to new development. If that is the case if the council the serious about this then councilmember herbold's Amendment needs not only to be passed but to be strength the current proposal only to limit a developer's responsibility to 5% of replacement of lemon come units to 11% is good as far as that goes if it should be higher but more importantly as we are aware and has heard from some of the other speakers this morning. We continue to lose more affordable housing then we replace there should be a strong one for one replacement requirement in any legislation guiding the development of our City of the future. Thank you very much. Thank you. Mr. Falker by Deb Barker and then Bill Bradford. Well, here we are again. The city continues to move towards making this a more and more difficult place for people who make less than 80 or $100,000 the web and you do a great job of adding to the homeless problem. When you have your emergency what you have done now is almost claimed you're not responsible for the fact that there is some homeless since there has been for a long time, but you are pouring gas on the fire. It's time to take a look at what you do. This committee is done more to promote homelessness than almost any other committee. With the help, I might add to the full console. So let's go the other way around and let's take a look at the whole city. When you up Zone in the highest and best use you raise the taxes you make many of the properties which are affordable no longer economically viable and that's why we keep losing affordable units. Now are you going to do anything for the people that are just placed and it's not just people of color who are just placed. It's just not in the Central Area. It's just not in the South End. I see it in the North End. I see it all through the city, but when you replace a white person with another white person, it's much harder to prove it. So visual in part of the city that that's happening everywhere, but it's it's so visual and yet you ignore it you act like this package to the Which is the main purpose of this seems to be to raise their profits since there's a reluctance for claw back, even if this is declared unconstitutional if they should have to pay then we continue to give them more and you make the city lasted less home for a diverse group of people. I really don't want his sign behind me. I'm going to go over here. Okay? Thanks. I support council member her bralettes anti displacement measure. It's a vital step to having developers realistically share in the cost of replacing the low-cost housing that they remove without this measure you are doing many many many existing low-cost units that could be in historic buildings that have many small businesses. You're doing them to the wrecking ball. I urged the committee to have the guts to strengthen the anti displacement measure by increasing the developers affordable housing requirements and expanding this measure Citywide. My Urban Village of Morgan Junction has over a dozen existing low-cost housing complex that can never be replicated a high-risk areas of Othello South Park Rainier Beach Bitter Lake and definitely Westwood Highland Park are critical to be sure but they aren't I displacement measured that you should support needs to make up for a devastating impact to the city's affordable housing you Play support and strengthen this important measure. Thank you. Bill Bradford you are going to be followed by David Ward and the Natalie Williams Baha'i I am speaking on behalf today of the central Ariel and Juice Review Committee. I'll skip the boilerplate. It's in the end of a letter. I believe the submit to you about who we are and what we do but as you know, the central area has had in the last couple of decades extremely high rates of displacement and it's gentrified significantly is experienced growth far beyond that contemplated in Prior years City Planning documents. We expect this pattern of growth and change to continue and therefore we need to see the city Implement stronger policies to prevent the ongoing displacement in our neighborhoods while we can soon as he has to lose support the intent of council member her bolts displacement mitigation legislation. We would like to see them mended in a way that helps to address the impact that are directly impacting Our Community First all high risk of displacement communities need to be included is a high opportunity areas that are seen the greatest amount of development in the correlated displacement that comes with that the price of the area Avenue 93rd Avenue, Urban Villages among those identified as being high risk. Displacement reactions to opportunity that such a strong demand for housing in Rensselaer higher-than-average. Mha pretty is only produces 268 affordable units in 20 years for the whole Urban Village. We do not believe that this will stem the tide of displacement and we want to see added protections of this legislation second. We would like to see stronger 141 replacement policies. San Francisco has a replacement just one for one replacement policy has too many other major American cities notably. We see the Cadence apartments that are being replaced 21 Section 8 affordable housing units are being replaced with 73 Sea-Doos. That's micro unit. That is not helping our affordable housing stock in the central area for one on-site replacement of lost units in addition to the base and HSA contribution. Search cheapest specials are generally too high for most projects in the central area. We would like to see the displacement mitigation policy apply to project with his fuse 20 units. Finally. We believe that more fine-grained analysis needs to be made in the underlying Equity analysis that underpins mha data analysis, which is the basis of all of this is clearly states its own limitations in terms of each in terms of the accuracy of what it is saying and so on its analysis. Thank you miss your from thankful for everyone and all you've called you before debility take your time is up. David Ward followed by Natalie Williams is everyone else who spoken here today has said I support council member herbals Amendment and would like to see it strengthened throughout the city. Has John Fox from the displacement Coalition said we are losing more affordable housing than we're gaining. Just why it's essential to have one for one replacement. We need much stronger one for one replacement policy. So that its Citywide so that everyone who is being displaced who is low income people of color are able to maintain their housing. Henry said you saw environmental impact statement. It showed that 60% of the Redevelopment of properties are in the south end where the which has the highest percentage of people of color and 85% of the largest properties are also in the South End nose of a properties that the that the developers are most likely to want to develop because it's got the largest property in most potential for for profit. So again, most impacting the south end in terms of displacement. Southeast Seattle also had the highest percentage increase in the percentage increase in rents during that time, which is also in the in the environmental impact statement and also the highest vacancy rate. So people are already being removed from from the south end of let's have the highest vacancy rate of any place outside of downtown and South Lake Union, which had the highest rent increases because they had the the most new buildings which created the highest rents. So again, I would support council member for adults amendment. I would like to see a strengthened and I hope the council passes councilmember herb ultimate. Thank you. Thank you Natalie Williams. You're going to be followed by Julia to shoot him. Hi Annette, Lee Williams. I am a resident of district one and I support councilperson herbold amendment. I would like to add that I would I wish it went farther and speaking as a resident of Seattle that does not live in an Urban Village but is highly impacted by what happens. In the Two Urban Villages that I live between there is I've watched a lot of displacement happened over the last couple years the last few years a lot of the affordable housing between Alaska and Morgan Junction has been mowed down and replaced by high-rise condos, and the people who have left my area include my favorite Barista and bakery assistant at little Prague and the childcare workers at the elementary. These are people who do not make enough to rent in my neighborhood, and I would like to see that remedied. So thank you again, and if you can make it stronger. Be even better. Thank you. Good morning. Council members will be short and sweet. It's very clear from everybody's testimony today. And they experience that we've had organizing with community-based organizations in the Rainier Valley as Puget Sound Sage that displacement is happening and that we don't have a full Suite of tools to address this placement for working kind of many different strategies, but one that we have not been able to crack yet is Preservation of low income housing. We believe that at its core councilmember herbold proposal gets at the goals of both preventing displacement and fully replacing units lost to direct displacement as my colleague Abdi. You said earlier today. We'd love to see the strengthened. I'm to apply across all high displacement risk areas. I'm cuz we think that I'm both low opportunity and high opportunity neighborhoods. I could benefit from something like this. Thank you. Thank you. Mr. Should I include the books that signed up to give public testimony so will close public come in for today? We have one item of business while mr. Freeman join the table. No, will you read the abbreviated titles agenda item one Council Bell one 19469 in ordinance relating to land-use and Zoning am ending the Seattle municipal code to establish environmental policies to mitigate the impact of new residential development on displacement of lower-income households in areas with a high risk of displacement. Hold on for one second before we do introductions. There was somebody waving from the crowd. I'm sorry. Would you wanted to give public please come forward and state your name for the record. Will add you to the list? You can like either one. I moved to Seattle in 1952 from New York at the age of 2 and I lived here most of that time since I'm shocked to see how Seattle has changed. I went to Madrona Elementary when it was about 65% black 10% Asian in the white. I was usually the only white girl in my class. That was a great experience for me. No. I don't think there are any children in Seattle that get to have that experience. Also, Franklin High School 65 to 68 was wonderfully integrated. A lot of us were politically active been in terms of the Civil Rights Movement end and the beginning of the Vietnam war protest. So Seattle used to be a great place to live and now it's just disgusting what's happened and I get my health care at Harborview. I was walking in the neighborhood yesler Terrace. Is there yesterday terrorist is evidently in the process of being torn down and what's replacing high-rises apartments with apartments that are in the you know, 1702 2500 a month range ridiculous prices, which nobody can afford unless they work for Amazon or high up and blowing her. Well, you know the story This is not okay. It's not my town anymore, and I really want to fight to make sure that we let this be a town where everybody can live and not just the Upper Crust. Thank you. Thank you. What I move on to the central staff memo associated with this bill, please start the interaction Raymond Council Central staff. Good customer Brian's office office. So today we're just going to be doing a discussion on this bill. Mr. Freeman that you've presented to council Council simple staff memo associated with this and if you would mind why don't you walk us through the memo and the contents of the bill sure. So today the committee will have an initial briefing Live cast member got to mention of the council but one 19469 which is sponsored by council member herbold. This bill would have been the city zycie po ordinance which essentially codifies our version of the state of Iowa auto policy to provide additional authority to the Seattle Department of construction and inspections to mitigate displacement of lower-income households do demolition under certain circumstances. I'm so I'll describe those circumstances are and then talk about two key aspects of the Bell Witch of the mitigation areas in the mitigation options. And then I think there's some next steps on the council member Herbalife may have in mind. I'm better discuss briefly at the end of the villain. Discussion for the committee. Can you include in your overview review of the findings in the Bell? Because I think they serve as a really important foundation for why this is necessary to describe kind of house and then we can talk about the findings and go to the Fonda medication area. So I think it's a good segue. I'm that I'm part of the committee's discussion, but it would be applicable to projects that are subject to the mandatory housing affordability residential program. I'm better not categorically exempt from review under the state of our mental Policy Act and categorical exemption. I'm levels in the areas that are currently contemplated a relatively low for Frontier the table from chapter 2505 it is they they range My last from 4 to 48 units up to 24 certain types of zones, including Seattle mix sounds and mid-rise out and there are few of those in the areas where to put apply the threshold level at which he could apply would be time for projects that exceed State Environmental Policy Act categorical exemption level. So essentially a project that would build somewhere between 4 to 8 units depending on the zone. How the products have to be located in Urban Village has identified as having a high risk of displacement. No access to opportunity at least is currently drafted and the project would have to involve the demolition of existing units that are rented. I might rent a portable table two households with incomes at 80% of area median income. It is not only related to the thresholds in States Epoch. Correct. It's also for those properties that are not categorically exempt under City seat by which I think is up includes low income housing for senior housing. Is that is that right call incorrectly. I'm off top my head. I can't recall if they're different exemption levels for certain types of projects. We differentiate based on geography Sol and say Urban centers for example there a much higher categorical exemption levels in the end and outside of urban centers, but I Off the top of my head. I can't recall if we have different time categorical exemption levels for affordable housing projects. Just to refresh your memories are 80% of area median income is about $56,200 for a one-person household and $72,250 for a 3-person household. You said that was 80% of very mad at 80% of those are 2018-2019 here and then this additional Authority could apply. I'm so the findings on reference a few different reports including the growth in equity analysis that informs some of the mha proposal on and also the Seattle 2035 on this growth Equity analysis was prepared for on the update the 20 update to the comprehensive plan. And it sets out of typology of Urban Village is based on just placed at risk and access to opportunity the the findings also referenced the 2017 city of Seattle and Seattle Housing Authority during his house when the fair housing I was something that was done as part of our compliance compliance and is necessary for us to get to me development block grant funding from the federal government and among other things that study identifies areas that are racially or ethnically concentrated areas of poverty. There is some overlap between the areas the medication areas in this bill and those areas and the Recaps identified in the 2017 assessments. Play moving on here. Also references a few reports that we're done for the central Puget Sound up in the Puget Sound Regional for PSR. See if you have including Equity opportunities sustainability in the central region geography of opportunity in the central Puget Sound region by the fair housing act assessment for the central Puget Sound region to 2014 document and a housing background paper for vision 2050. I'm among other things those reports identify out of migration of communities of color and low-income people from Seattle to know the price of an County opportunity parts of King County. And I finally it the one of the findings references the Seattle residential affordable housing impact medication study. That was a Nexus study prepared for the council by David Rosen Association 2016, which establishes a maximum. I'm supportable fee under the blanket reprogram. The council has one time considering. Thank you. Thank you. Mr. Sure of one of the analysis of that I continue to look at is the city's own ESI analysis and he is sorry analysis alphabet soup here. What I'm wondering is this ordinance account that the fact that the study showed that there was a strong correlation between the number of people who are being displaced actually having more likely have to be displaced because they were rent burdened not because of demolition. So this is a map that in the middle on this is actually from the ER is this is from appendix m to the Yeah Yeah Yeahs switch has a host of results from different regression models that Burke & Associates ran using that accept opportunity displacement typology many of those regression models indicated that there was there is a statistically significant relationship between development and certain types of displacement but not all of us regression models show that AB statistical significance and I can't remember off the top of my head which do in which down but some do and some don't and is part of the next committee discussion we can highlight for you which of those models indicated. I'm a high risk of displacement for the record the city's analysis of displacement showed a strong correlation between new homes being built and lower numbers of low-income residents and Residences. Are moving out and that the direct displacement from Demolition Petty relatively small impact on changes in population by think that's important as we try to figure out the right puzzle pieces to dress all of these issues if most books are being displaced because of the cost of housing the fact that we don't have enough housing stock not necessarily disco demolition that I made as an important finding Frost of continue to know. and happy to talk with you more offline about this customer must get up, but That analysis grossly underestimate the number of demolitions that occur in the city and the numbers of people who are displaced because of those demolitions that analysis relied on the tenant relocation assistance and the households that are determined eligible that was their proxy for people displaced because of demolition the tenant relocation assistance ordinance people who are between 50 and 80% of Ami do not qualify for it though. So those people who are who are displaced from the city. We're not counted also people who live in group houses and their income is pulled. They perhaps are have a roommate situation. They also don't qualify. So those people weren't counted further. This ordinance does not rely on. And on what the cause for displacement is what it does is it says that because of our obligations under Fair the Fair Housing Act have an obligation to act two stops placement and to address it with our own regulatory measures regardless of what's causing it. So whether or not it's an economic impact or a an impact coming from from demolitions. We have an obligation to try to correct those wrongs. That's that's the foundation of the legislation situation here. I am happy to talk to the good counselor offline. I think that part of our analysis over the last year plus have been to try to figure out what is the root cause of displacement. What is the root cause of an unaffordability and it is also imperative imperative of us to make sure that as we look at Solutions. We're helping to mitigate any I'll cause of displacement. So I agree with you to the degree that we are called to act. I also just want to make sure that as we look at findings the gis analysis is fully reflected and that was one big takeaway for me. So happy to talk with you offline. And again, I want to reiterate that my questions are really just to get to a better understanding of what it is that we're trying to add to our what it look. What should we say a recipe for how we're going to dress all this because there is no one solution. There's no one ingredient to dresses. I'm so my questions are going to be the focus on how this as a degree. To the bigger picture that we're all trying to solve is going to help us address this issue, which is the first point. You mean in the majority of the findings are just recognizing that displacement is occurring are there additional findings would like to cover? Mr. Freeman know that's what I feel like a recognition of this council's prior statements on our intent to address this issue. I think are important to recognize the there were two prior actions of this Council both in the framework legislation in 2016 where the ordinance itself in the framework ordinance stated that the council was going to consider whether to include higher performance and payment amounts for those areas where the increasing development capacity may include increase displacement risk and then further in resolution 3 1733 this was a it was a resolution at the council passed after the the draft Eis opcd to go back and do additional work because of the deficiencies that we had identified in the in the draft. He is as relates to displacement. And in that resolution of it said that the council indicated its intent to consider a range of strategies to increase affordable units sufficient to offset the affordable units at risk of demolition due to new development and strategies to address displacement resulting from changing socio-economic conditions that may potentially displace vulnerable populations. And then finally we've talked about this little bit before we have seen some of the work that opcd has done about displacement. There are some results that don't really. Comport with what is actually happening on the ground the number of units in the University District that are slated for demolition in just a year-and-a-half in the University District since the the passage of mha is nearly a hundred units to be demolished in an area that opcd had given a range of on the low-end 60 units in on the high-end 200 units and that was over a 20-year planning. And so we're already we've already reached the Midway point of the high-end in just one year. And then we also of course have the the instance that is in the news today or this week with the Cadence property in the central area. Where there are 21 units of affordable housing housing that people have lived in for decades that are going to be demolished and replace was 73 units and only five of them affordable. So Relying on mha as a displacement mitigation alone is not sufficient and we really need to look at those areas where we already have naturally occurring affordable housing and make sure that this program image. Hey allows us to produce a net increase of affordable housing. I would I think it would also. be useful to talk a little bit more about get moving forward. We've heard folks in the community say that they feel that the the we should discuss expanding the scope of the the ordinance from only high risk of displacement low access to opportunity areas to actually include the high access to opportunity areas and keto I don't know if you're prepared to do so now but if if you have a little bit of background about how opcd did that analysis I think that might be be helpful as well. I'll take that as a as a Segway into I'm talking about where this bill would apply and I can talk to him at a high-level about the the indices that inform the growth inequity requires Parts sale 2035, but I'm not going to get it perfectly there a lot of different variables that are used to identify displacement risk, so but returning to the bill here, so Bill would apply in five organ Villages who only within the boundaries to those are competitive. So if its development that is subject medication and within the boundaries of the others, Urban Villages has drafted are there be additional authority to ask to see I and those are burned Villages are within areas that are red up here on the map red areas or areas that have a high displacement risk low access to opportunity purple areas areas that have high displacement risk. I access the opportunity blue areas areas that have low displacement risk, I access to opportunity and brown areas areas that have Lotus play some Rascal flow accessed opportunity. So I'm as drafted the bill would apply to Rainier Beach Urban Village the floor Urban Village the South Park Urban Village the Westwood Highland Park Village and The Bitter Lake, Urban Village. And it appears as though the south end of the Columbia City in the North End of the Lake City. Urban Villages are are fit within that category, but they are not apply to start the bill to understand that correctly. Yeah and what this map does this is an app that is from the FBI is in Burke took the displacement typology and applied it to censor tracks and it is an ongoing problem necessarily but it is a fact that our Urban are planning geographies don't necessarily correspond with a sense of track boundaries and so on there are places where they don't need the overlap. And what were there is some mismatch and I think so I think reflected in some ways and that doesn't nation of high medium and low areas for the purposes of mha implementation and Lotus. For example that Crown Hill is in both a Lotus place. Where is Kai access to opportunity and Lotus play some restful access to opportunity area. That's a medium area for the purposes of mha so their way Asian waitress or judgment calls have to be made about so what would apply wear but you're right. There's not there are some places that may be indicated as having a high display some rest, but are not included in this bill such as Aurora, So just a lover Lake City. Is is that just a kind of policy decision is hers what to include or not or is there like a algorithm was applied to how many square footage was inside or outside? The census tract vs. The Urban Village? I don't know. I mean that there is there is the index that that opcd develop that informs a cop planted that in Texas fight on a census tract level does the index I guess that is the algorithm then there lies. But cast from Herbalife thank you asked me to talk a little bit about the about the girls and Equity analysis and there are a variety of variables to go into the displacement-time Risk. Index race is one of them cost burden is another percent of a number of parcels that RV developable is another I'm not going to name all them here cuz I probably won't get them off top by happy there by 20 or so housing tenure is another so those are all variables that go into identification of an area as being either a high-risk area or low risk area. And can you also talk a little bit about how in practice this mitigation program would work? Sure. Yeah, so it's it would be additional authority to ask UCI. So there's a project that is subject to see Pro review the land use planner at sdci who was reviewing the project would I determine whether not there any units that are portable to a transom above 80% of a mine is actually a portion of the bill that I'm direct sdci to begin collecting that information. I don't think it's actually something that is currently collect about. This is a this is a sip of baseball. And so presumably that collection what happened through the checklist that applicants would have to submit to MSG C is part of their cheaper if you for the project and so if there is a project that that meets the different thresholds for a review on to this than the SEC iplanner could require additional replacement of units that are demolished 80% of Ami or the or a higher. Mmha obligation is the lesser of those two So do the one that is I guess least onerous to the developer and some ways and that decision if it's combined with another type 2 decision. We're getting a little bit Arcane hair barrettes hair design of you to say something like that would be an appealable decision to the hearing center. So if the fstc I chose not to use this medication on that could be a subject of an appeal or STC. I did choose to use medication and developer didn't think it was warded that could also be subject to an appeal. I just I wanted to turn it over to Susie and Alex to go through the short presentation that they are giving on behalf of Julia with Puget Sound Sage low, hold on for a second related to that. I had a couple of questions to me. I thought you were to bring me to move it on but I have a couple questions related to this and I want to say that it is not my intention for us to actually have the presentation be given today. I'm we all have discretion to run the Committees that we have ownership over in the way that we choose. It is long been my practice that we don't have external presentation either for or against a particular bill or set of policies. And so I don't while I recognize that there is a good work that has been happening in the community associated with this. I will say that it is not my intention to offend anyone. However, no one approached me and asked for the ability to give this presentation and if they had I would have very clearly said that it is not the practice of the committee to allow folks externally who either support or oppose an individual piece of legislation to get the opportunity to make a presentation that's been a long practice whether we were talking about individual zoning changes in neighborhoods, whether that was about the design review program short-term rentals, we had several complicated pieces of legislation where individuals external to the city have requested the opportunity to come and sit at the table and have a longer conversation and make a presentation and a facts and figures either for or against any of those pieces of legislation that we long said that is not part of the policies of this committee or other committees that operate differently, but that is long been sort of my processing part of colon, and I'm reluctant to change it at the Point I just want to say for the record that when you told me this morning I did let you know yesterday afternoon of the fact that I was inviting this presentation and I did not hear back until after 5 that it was not. Okay when you told me this morning that Puget Sound Sage could not have their representative be at the table. I did not realize that you also meant that the presentation could not be presented by our own staff. So bring in just a couple of questions related to the underlying piece of legislation. So I understand that the city used to have something similar. Can you talk about the differences between this approach and a similar approach that we used to have on displacement mitigation issues? Yeah, and I I'm not I don't have. Think what you are referring to. The housing project is the housing preservation ordinance tonight, and I'm not too familiar with what was exactly and that bill but I think most folks are at least how much Mayweather but there was a time. I believe it was in the mid-1980s properly 1990s where the city had a housing preservation ordinance bill, which required replacement of demolishing Edison hadn't had an MVP option if it's units were not replaced... Ordinance was subject to Legal Challenge on Constitution. And so it would be helpful for me as we move forward to understand the differences between this approaching that housing preservation ordinance approach so that we can understand how does differences may be met in order to preserve that we're not walking down the same pathway of legal fraud. cast members have gotten advice from legal department on this there's a will there's a territory of talking about things which could be attorney-client privileged and you all of course cuz I could wake up early, but I think you have to decide to do that and and an executive session but the difference the primary difference here is that is that this has become the state of our little Policy Act Authority, but the city has supposed to on the authority that the HP over an inch of base 10 Customer would have brought up earlier data associated with the estimates in the U District are around mha implementation. Do we have hard data from either St. Cir opcd on the development patterns post. Mha either in the U District or another neighborhoods where we've applied emma-jane to have a good sense about that. You're my colleague Ali penuche did the analysis for counseling for her bowl and I don't know exactly what she looked at. I think she was looking though at permit data. So it is kind of donut exactly sure what you mean by hard data. I don't it it was I think it was I got you two can't recall if it was building permit information or Master use permit information. Obviously, there's a little bit of a difference between the two I have somebody has has applied for a building permit. Then it's pretty prom that they will build because there's expensive permits. I must use permits are sometimes speculative. So Somebody may not know whether they'll get financing for their project so I can I don't you don't know if it was Matthews Perimeter Park building permit data. Can I just real quickly touch on the seabed authority and I just think it's important to identify it sort of where this policy is derived from and in the grounding for it RCW 4321 6.060 specifically says that actions may be conditioned to mitigate specific adverse environmental impacts, which are identified in the environmental documents prepared under this chapter mitigation measures must be reasonable and capable of being accomplished and then further the wac specifically 197 11444 specifically identifies, housing as an element of the environment. Until you know again this ordinance realize both on seba thority as well as using the obligation to affirmatively promote fair housing as a as a defense for any other questions about the authority of under the law to have a little better understanding both of in U District and another the other five Deborah heads or replied. Mha and further. I think it'd be helpful to understand if we do collect that information based on whether it's a building permit or Master use permit about the demographics of the building itself. Do we have a sense about who lives in the units that are proposed to no longer exist what rents they might pay The problem that we're trying to solve here and who were trying to sell that for would be helpful to have informed by data if it's available. The other question for me is the layering question around mha the applicability of this program and the interrelationship between the program the proposed program in mha is important to me. Do we have any analysis about what kind of impact that this might have on either proposed projects within the neighborhoods that are being proposed in and you clearly there's an interest both from community. And also I think from your council member herbold around applying this to a broader range of geography than what's what's a sign the bill now, so I'm curious about what sort of analysis might have been done around the impact that this might have on the development of either new units new. Mha units are the both. Yeah. So I looked at a dad the short answer that question is that we haven't done any sort of economic analysis. I did look at the 2016 Community attributes report which looked at feasibility under mha And as proposed currently most of it already would apply and want to call the bike considered low areas for the purposes of mha as you all know that one thing that they cancel alarm has indicated tend to do to the mha legislation is to revisit the boundaries of those high medium and low area sometime this summer but at least using the current boundaries in ca ca eyes analysis most projects and low areas are determined by Cai to be invisible except for a few different project type. So I saw the rise Tempe Town House Development in Denville rises in Cottageville didn't rsl's Islands had a positive residual and value. I'm eating that Isabel, decides. Where is most of the development police in 2016 using 2016 data would not not feasible. So at least at a facial level using the somewhat dated information Projects that are currently in fusible in those areas would continue to be invisible even with this out of obligation, but there is some projects that would be feasible. I'm Hunter 2016 Ranson biscuit presumably have an impact on those projects another or financial impact on those projects another outcome. Potentially. We don't really know is how this might affect developer Behavior to help her developers may just choose to develop sites that don't have a so-called market-rate affordable units on them. And do we have a choice here buzz on the analysis that you might have done based on the CIA data about the council's intention with mha units to get about a 50/50 split between payment and performance. What's the word intending through this bill to have a similar approach about payment vs. Performance. Are we trying to calibrate it so that we got a similar outcome of a 50/50 approach to That is that is future work on the movie star is currently calibrated without this additional medication option. The developer should be indifferent has between paying and performing. In fact, there's a little bit at least a theoretical disincentive to payment and that there's kind of a 10% premium that is added on to the fees on the way to the fees are currently develop without it's what we don't know is that there's an option here to perform at 80% of a lie that may be close to Market Branson some of these areas. We don't have that information may have better information by the time we do have the update to the boundaries the summer. I'm so you know without knowing that it could be the this is a disincentive financial disincentive could also be that it's his not at to Princeton to perform under the obligation. Like what sha has Donnie yesler Terrace river right of first refusal refusal for folks were living on the property. I know many in the audience who testified about this topic suggested that folks who are living in a building that is being replaced should be given the right of first refusal. Is that included in the legislation? Are we are we legally allowed to drive to return that's not part of the legislation is it would be probably wouldn't be something that would find expression in the seafloor denser and land use regulation and the mayor's executive order which I was just reading it to the person but it does look at to an income our rent range that that person was paying. Yeah I bad. So it's a swimming somebody performs are or even pays and replacement units are built in the area that originated the payment then it may make it somewhat more. Likely that somebody could return to that area the community preference policy and the mayor's executive order might be a better tool at to allowing somebody who is displaced from an area to return to that area. But that's that's three more in the nature of a policy as opposed to a regulation. I'm sorry for mentioning that I know that reference policy is something that all of us I believe as support. It's something that the office of housing is currently working on and I just want to fly for folks. We are going to be taking up that reference policy in the anaplan discussions coming up this spring. We want to make sure in addition that has one additional ingredient into our cake that we're trying to mix here to create affordable housing for all that those who are truly getting displaced from any new development. Actually those individuals are able to come back in the door. So it is a little bit more time one for one. Terms of making sure that those individuals are that family unit is able to come back. And so I think that's an important note for this conversation that that is a critical tool and we're going to bring bringing that up this spring. So just feel like I maybe should sit back a quick second and say I really appreciate that. We're having a conversation around medication displacement in in other folks at on Puget Sound sage and others have been really clear any tools to address displacement and just looking at some of the materials they had created tenant protections rent stabilization preservation of affordable units in commercial space building affordable housing and commercial space Community stewardship of the beginning of a list that we all are interested in looking at in to out to me. The question is really are we are we adding to the right balance of those tools? I feel like we spent a lot of time obviously with mha a talking about building a nut more affordable housing units. Despite the legal predatory. Play so we had to go through and the delays on a doosan that we're currently facing now move forward on our land disposition policy to make sure that the city is prioritizing using affordable land to build housing and the spring rolls will be adding to that list making sure those communities that work directly with communities that are at risk of displacement are first in line to get access to have a site control and build affordable housing and commercial space health clinics in childcare. And then we also talked a lot about Community benefits agreement making sure that the community is actually getting access to good living wage jobs as we create more tool. So in my mind, this is 8 a.m. Important conversation that we're having about whether or not we can add to the list of tools to help displaced displays to mitigate displacement. And I also think it's important for the viewing audience to remember what we're trying to do is disrupt the market right? Because the private Market the market as is has not developed enough housing. They have not developed. Affordable housing. They haven't prioritize our lowest wage workers and they making sure that folks are able to get back in the door. So for me, this is really about making sure that we do have the right mix and your point. I think you mentioned earlier. I think I was actually you can remember we also want there to be a net benefit answer the questions that until summer Johnson asked about how this impacts Maj are going to be really critical for me to have a better understanding of so circling back to some of those questions and in your future research at wondering if you could help us understand like a few scenario examples how would this impact potential development project was to not move forward because we were trying to for example, I protect a 12-unit apartment building. Let's say that apartment building that had 12 minutes was to be torn down in a 50-unit building at you know, Mark was to be creative with X number of affordable units because of him AJ. How would this Have an impact on that could we get a better sense of either the dollar impact or the unit impact that would be super helpful for me to hear and then also just the better, you know want to underscore more clearly for folks. I also agree with come from Emerald. Mha I don't think is a mitigation displacement displacement mitigation to all I think I made. Building affordable housing to land. So as we think about adding additional policies. I also don't want to do anything unintentionally that would harm our ability to build those additional housing units that I think mha was attempting to do. So to me it having some scenarios about where and if there are Maj units that would not be helpful for me to figure out and then if that were the case are there other tools that were thinking about we talked about any preference one of the other things that we're doing the spring is so David Tennant opportunity protection act. So if units come up for sale and they're affordable units changing the existing policy is to that tenants get first notice of that so that are also Community developers can get notice of that so we can protect those units if the folks in that apartment building instead of on a creative Co-op, so it's it's really exciting. But again, it's not each one of these items is not the answer. I'm just trying to figure out a better picture. Call these pieces Adam. One additional question that I would love to understand a little bit better. Mr. Freeman is we built the mha program off of similar programs that have existed in pure jurisdictions around the Puget Sound weather. That was a Redman's zoning proposals that require a certain percentage of affordable housing payments or other similar propositions that other local jurisdictions in Washington state have implemented be helpful to know if we're basing this requirement off of other jurisdictions either at the local level or at the national level. And if so to have a better understanding about how those programs and what impact that they've been shown to have on either the creation of new units of affordable housing the relationship around displacements another intended consequences of of the legislation. I don't know if if there is an answer that you have on the top Your head but if not, I'd love to know what we might be basing this off of in terms of other jurisdiction. I can come up with some comparative information. Please call to link the existing option in the bill that includes replacement housing to also include a right for a tenant who was displaced from them from from that previous building to return to that replacement unit. I don't I don't know if it's something that could be done. But I think it's a great idea. Also. I am interested to know how In the implementation of this Authority. How does the how does SDC I determine which is last because is there a is there like a financial calculation that they that they would do the obligation to do replacement units at under 80% Ami as you mentioned may not be in some cases depending on the market in a particular neighborhood may not really be a costly requirement and I don't know how they how that is going to be waiting each site specific case number of total friend restricted units, right? So if they think I forgot if I have a developer's I'm required to perform at the higher mha level and low cost areas that would be 9% of total units. And so you could you compare iFit would say 5% of us and them ones out and they replace those units going to be easy to do a percentage comparison in that building. Although some of those units to 80% units would be rented at a higher level than the 60% Ami MHL units, but essentially they are for the developer to self select the least costly option for them and some of it may depend on what they're what what type of a developer they are not they are a portfolio developer and are comfortable holding on to 80% units for some long. Of time, maybe because of the financing in their project or something else like that and then that might be a better option for them. But there's a there's a there is a choice. It is not imposed on the developer by ICICI is a choice of the developer. Which is similar to the way we approached payment and performance in a mansion a piece. Thank you for getting back to us on the feet the fee versus direct unit replacement options. I like what council member herbold asked about what options exist regarding actually in trying the same tenant that were displaced have access to the creation of any new building also given where we're at right now. It doesn't seem like if a unit were to be preserved. I'm sorry at the apartment complex for example, or to be preserved that there is a guarantee that they would continue to be maintained at a certain affordability rate. Is there any way for us I know we have rent control limitations on a test right now, but is there any tools currently that would allow us to ensure that those rents could be maintained? Affordable amount either if apartment complex were maintained or in the creation of a new unit not through this if this if this additional medication already replied to her project could be because our project is his his would-be demolishing his portable at 80% of Ami. I think that you're there are some this is her Harkens back to other affordable housing incentives that the council has discussed in the past and which there are some limitations in state law. But there may be also some opportunities available to the council, but they know D Inside of The Suite of incentives at least those that have been identified I'm fine. I can remember all of them one is changing state law around the multifamily tax exemption program to allow Preservation Hall tax abatement for preservation of affordable units. I think that would require a chance to stay low and that's not something that's currently available to counsel. But something with the city could Advocate at the state level for I'm others might be looking at it again at the multi County tax exemption program to see if there are opportunities when there is development on a site that includes a building that has not clear portable or naturally occurring affordable housing on it to somehow. I have a an incentive for preserving that I'm in exchange for some tax abatement or something like that. Those are just kind of Blue Sky ideas, but mine would require change of state law. I want a I want to I just really appreciate the conversation that's happening here. And I appreciate the form for it at customer herbold. I know this is something that that you've worked on for a number of years and I think that It's Tricky given state law, but it's critical to do more than we're doing today. I look at the displacement that's happening in our community. And I from my framework. I think it's largely driven by growing income inequality and a world where there is a chunk of people that are making more money every day and then took a people whose wages are stagnant or don't have access to Opportunities, and the housing market. We're all competing for the same housing market and the pressure of folks are making a lot of money put on that Mark. It means that a lot of folks were left behind and we're feeling that and The drivers for that income inequality are largely beyond the scope of the policies and laws. We sent here at city council and yet there's an obligation on us and we feel to make our communities strong and undo some of these damaging attacks. And so we often can't go to the root of that problem instead. We have to work around the edges of the things we do control the try to undo some of the negative impacts were seeing from these policies that are driving these problems in our community and that leaves us that things like this that are messy and complicated and you know, each each individual property in each policy is going to play out differently and trying to understand what the unintended consequences are going to be is really complicated. And we have to do the work. So we're going to have to dig into that messiness and figure it out. I wanted to save it as as we continue to do this. I am going to be looking to organizations like Puget Sound sage and coalitions like southcore. Who are made up and run by and represent the people who are most impacted by these policies and I have a sense of how the economics work. I have a sense of how our policies work, but I am not directly impacted in the same way that that lower-income communities of color are impacted by this in the fact that we have organizations in our town and coalitions built to help us do this. I'm really grateful for and they understand the complexities in the trade-offs as well as I do that they get to see how these different solutions may impact them directly may not until their leadership is going to be really important for me as we work through the but I think is a shared objective the complexities about what are the trade-offs and how we think this plays out. And so I just think the folks in Puget Sound Sage. I really appreciate Folks from South core who have been thinking about this and frankly informed my thinking about displacement and gentrification over the number of years based on the great analytical reports. They've done and look forward to option is to work with them as we continue to refine this Concord. Michigan with giving you a lot of additional work to do our next committee meeting is scheduled for March 20th, if that work is completed between now and the 20th. I love to have an update about what's what you've learned if that's not possible. Then we'll look forward to having this back at a time when you had a chance to do the analysis necessary in order to answer some of the questions so far today. The police have answered them and I may have just missed one other thing that I think folks mentioned is the worth of going around around various other incentives, especially mfte and would love to hear more about some of the other mfte options that we are potentially considering as well in this city this year. I think probably bring up but I can check in with my calling Tracy about that. But yeah. Okay, that concludes our meeting for today. We'll see you back here on the morning of March 20th for drugs.", "end_time": 4600.7}]}