{"format": "raw", "annotations": [], "confidence": 0.9320710782821362, "data": [{"start_time": 0, "text": "Good afternoon, everyone. If I can have your attention this is the regularly scheduled meeting of the Human Services Equitable development and renters rights committee of the Seattle City council. The time is 2:05 p.m. Garden City council chambers, and I'm joined by contact president Bruce Harrell. Thank you for being here. We have two items on today's proposed agenda the Seattle Department of construction and inspection or sdci has completed work on their renting in Seattle web portal, which is a place that renters and landlords can visit to find information about their rights and responsibilities in the city. The portal also has the new dedicated phone number the rent that renters can call to report violations and ask for help. We have been discussing this at the last couple of years and I really appreciate the department at 4 on this because their staff are overworked given how many renters need support in Seattle and have needed so in recent years. We also have time on today's agenda for our Central District community members to talk about the tragic shooting incidents that occurred. Lost weekend and on gun violence in general. Obviously. This is only a very initial discussion on this topic but my office decided to rapidly organize it in the last couple of days because we wanted to begin responding to the incidents. So it will be an opportunity. For those of you who are here to make your voice is hard and present your ideas for what you think could be done in terms of Community Based solutions to address the problem that we are facing over the weekend my office also spoke to several people who live in the neighborhood and some of you are here today to resent Statistically speaking reducing inequality has the greatest impact on reducing violence and crime and I'll talk about that in a little bit. But for now because we have several community members who have urgently make time out of their schedules to be here, which is greatly appreciated. If there's no opposition from my fellow committee members. I will amend the public agenda to put the second item first and the first time sex and action Beeville. The agenda will be voting on would be the initial discussion on community input on gun violence at the first item and the second item would be the Seattle discussion on renting in Seattle. If there's no objection the agenda will be adopted. Thank you. The next item in the meeting is public comment. So those of you who signed up for public comment will get 2 minutes each and if you haven't signed up, but you wish to speak in public, and you're free to speak and then sign up and Denver down from my office would be reading the names of There are four people signed up for public comment David Haynes followed by Cathy aussi followed by dimaio's durin's Enfield by Miss Richard. Renters Revolt be a lightning bolt do what you're told renters Revolt. We need city council to make it illegal for King County property assessor to continue inflating the perception of value in the dilapidated run-down rental housing market built on the side of the road back in the twentieth century lack of Commonwealth quality-of-life issues have a press this city with capitulation to The NeverEnding celebration of supply and demand squeeze housing markets while speculators parking on the back of the working class sold out to the banks that politicians complain about yet still pull punches as they authorize more money to nonprofit status with using money to pay someone else's rent at the same inflated artificially created cost. When is the city council going to take the pain and up in the bank's abuse and force the bank to finance a 21st century housing filled out. And when is the Department of construction and inspections going to stop capitulating to run down housing never judged as being the modern 3rd road conditions many buildings in Seattle are in a perfect example of why Department of construction and inspections should be improved is the building in Ballard next to Carter Motors with a restaurant. Senor Moose is located. It's sent people to the hospital because of the gas that comes up through and they were never really properly like in force with the first word interpretation and yet the rundown ghetto building buys off the government with yearly property taxes in order to continue gouging and oppressing first world quality-of-life issues. Allowing an oppressed tenant 14 days for 3 Days To still pay the artificially inflated rent isn't enough. So God bless the renters Revolt in the 21st century housing filled out. Kathy Rossi hi there, I'm Cathy. Aussi. I live in the corner of 21st and East Columbia and I've lived there for more than 30 years raise my family there and provided care too many children at Adventure daycare in our 30-plus years living in the Central District. We wish we have witnessed gun violence prostitution and Drug crimes and we've also experienced so many benefits of living in this beautiful city. Our neighborhood has changed a lot to longtime families and elderly neighbors have been displaced services such as the post office and affordable groceries are being replaced by upscale housing and services are block and the blocks adjacent to ours have seen traffic improvements to including parking on the east side of the street traffic circle speed bumps and stop signs and the terrible scary gun violence continues. Gun violence is a symptom of system systemic racism, not of traffic patterns. I honor and respect the work and effort. My neighbors and friends have put into solving this terrible problem. We all want a safe neighborhood. I'm wondering though. How can we ensure that the unheard voices of longtime residents and people of color are being included I ask that the evaluation of any proposed solutions to the gun violence problems in the Central District include the voices of longtime residents and people of color and that these Solutions be looked at through a social racial and economic equity lens. Tamia my name is restaurants on before this committee a few times before the last time in February at that time at asked Mr. Harrell's office was able to help me with some of my issues what I wanted to dress as some of the issues going on with the Human Services Department in their contracts and some of the renter rights associate with that was a previous employer share. I've actually be in the middle of a lawsuit with him regarding a fair pay housing violations and other issues a sec. I and others did not even take care of the courts are looking at it by failing to meet some of their basic requirements for their mission goals in their behaviors and some of the failures by hsd to overseed. They are Contracting Partners been very difficult for me to be able to maintain stable housing and work with the city to find solutions to my issue again, I'm going to ask council member can you know make a commitment to get a hold of me as you did last time? Ashley follow up with me. I'm hoping that I can get in contact with these departments that you you know, if you have this chair on the committee for I really appreciate your time. Thank you for the efforts. You have made. It. Looks like there is some change and I know what this election, you know coming up soon. I hope that also you can help me show the constituents what we can expect from you. Thank you. Yeah, I like folks looking at me. Just thought they looked at Fannie Lou Hamer back in the day. I miss Richard you feel me? This is human services. This is just a little bit. Okay, cuz when the folks that really like to put the word out about what's going on, they like to see evidence, right? They like to see how black people are really being treated in the United States of America and to the Republic that we better pray is going to stand okay for you all doing what you doing to us as black people. Okay, and he said yeah you always complaining about something you always eating from the crumbs off the table and there's various other things that you can say negative about us because I don't like the fact that there was shootings over there and it's Central District either because I'm a product of the Central District, although I don't live over there. Okay. So I'm trying to figure out about the equity standpoint that a lot of people are asking for us to have as a people and then we have to come down here looking like we begging for something. Why should we even be having to live in the next generation of Jim Crow you at you tell me that you give me an answer and read the book Coretta and when you see me again after you read the book, you tell me what that black woman had to suffer as a result of her husband being assassinated here in America was something that you were able to benefit from because he was killed and every other single so-called leader, or maybe you think they are some leaders around okay that are doing something worthy of getting your little grant money your little petty change and this guard here I dare you for you to do something just because you hear me raise my voice That's what they do. It's not only us killing each other, but the police is killing us too and you know it. There that's why I prefer public comment. And anybody else who has them? So didn't sign up would like to speak. public comment Singing River Flows public comment or first item on the agenda is a discussion. As I mentioned on the recent video of gun violence. There are a few people my office has spoken to you over the weekend who have been available to come to discuss with us. And we really appreciate you all making time. I also should let members of the public know that my office reached out to several additional organizations and individuals who are unable to come because obviously this wasn't very short notice and they said it's an initial discussion. I just wanted to share with everyone that we reached out to the Seattle King County n-double-acp leadership to rev Jeffrey of the New Hope Missionary Baptist Church in the central district and rev. Walden who's being a long time long time activist and member of the community police commission. In fact, she in fact was unable to make it because she's at a community police commission. As we speak so we will continue our Outreach and we will have subsequent discussion. I think on some American dollars would have a discussion in her committee. We're awfully report back from the Seattle Police Department. So we will coordinate on all those ongoing efforts. I wanted to share with everyone that our office has been closely following the developments that have happened in the central area and the recent days my staff and I send our deepest condolences to the family of Royal Lexington the young black man who tragically lost his life to gun violence on Friday. We Stand what's Seattle's black community and morning this huge loss and with all community members who want to end gun violence my husband and I hear the gunshots where we live in the central district election neighborhood also and one of the recent shootings this weekend took place just to block block from where we love I personally understand and share the anxiety of my neighbors and desire for safe neighborhoods for our families, especially for our children, we need Common Sense gun control measures like Banning semi-automatic weapons to prevent gun violence incidents like the one that happened at 28th and Jackson in the Central District on Friday night Several City residents have also reached out to us with proposals to address the incidence of gun violence including concrete changes to public space usage and be cooler traffic which they believe could have a positive impact and help reduce the incidence of drive-by shootings. For example community members are advocating for traffic calming measures like a raised flower beds or speed bumps on 21st Avenue rather have been three drive-by shootings during the current school year that is alarming my office is at the Seattle Department of Transportation to use their expertise to review and Implement these measures and other potentially effective suggestions we have heard and we'll be hearing in the future as cat DLC correctly said we are aware that environmental design on gun control measures will be insufficient if the overarching problems faced by our society remain unaddressed. Statistically speaking at Nationwide studies that systematically shown reducing inequality has the greatest impact on reducing violence and crime and improving Public Safety for working people. In Seattle, this means the escalating affordable housing and homelessness crisis needs to be addressed with both policies. Seattle needs rent control to stand the skyrocketing of rents. We need to adapt Amazon and other big businesses to fund a massive expansion of social housing just publicly owned affordable housing and to fully fund public transit and Social Services to fight the alienation faced by our young people. We not only need for them to have stable and affordable housing, but we also need to tax the rich to fully fund public schools and you jobs programs young people regardless of their race or household income have the right to high-quality public education fully equip schools with access to Art opportunities after school programs counselors libraries and internet access. We know that youth violence plummets when teachers have the resources and support they need and when parents are not worried about choosing between rent and medication. A massive expansion of social housing by taxing big business would also mean a Citywide public sector jobs program with priority hire an apprenticeship program so that young people have access to living wage unionize jobs. My office alongside the people's body movement has successfully fought for and won millions and funding for the Youth violence prevention initiative and Courier bridge bridge rehabilitates formerly incarcerated people in two jobs and housing and reduces recidivism. We also fought for in one funding for the law enforcement assisted diversion program or the lead program a safe consumption site and City sanctions safe and self-managed homeless encampments with city funding services like trash removal for our homeless community members. All of these problems actually have a proven track record in data working. Well, the problem is that many of these programs continue to be nickel-and-dimed and underfunded by the political establishment. We need serious funding to address the opioid and Mental Health crisis also in our society. Some community members about our office would an increasing police patrols or including the Central District in emphasis Patrol to help the central district has in reality being one of the major areas already designated for summer emphasis patrols. I am discussing with community members, especially in the black community as to their views on the patrols. However, regardless of the fact remains of the recent gun violence was not reminder despite the emphasis patrols State sadistic evidence demonstrates that we will not be able to police our way out of this crisis because it is fundamentally rooted in the arrows of this broken system spending more than ever before on a grease policing set four hundred million dollars for a year and the United States have the highest prison rates at the present rate in the world with 724 people 400,000 incarcerated, and I also wanted to share a thought from to commute. Members who were unable to be your and then we will have our speakers at the table. One is a message from Shirley Henderson who's the owner of the squirrel chops coffee shop in the same neighborhood where these incidents have happened. She says a quote as a small business in the Central District. We are morning with a community over the loss of life and the impact of violence. We recognized the root of this violence stems from Deep economic inequalities and the lack of affordable housing and from systemic racism small businesses and working people are suffering under the weight of big business and corporate greed refusing to actually put money behind real solution to the problem instead leaning on increased police language only moves the violence away to other neighborhoods and does not deal with the root cause as a small business owner in this community. I am dedicated to fighting the root causes by pushing for affordable housing and economic Justice taxing big businesses in order to fund livability for all of the community in the city. This is a letter from Reverend Jeffrey who wasn't able to be here. He says my name is Reverend Robert L. Jeffrey senior. I live at 1914 East Alder. I have lived at this location in the heart of the Central District for over 30 years like many I have been 4 years appalled at the rate and the consistency of the violence of this plague this community. This is not a new phenomenon. This is rather a reoccurring tragedy tragedy played out each year for at least the last 30 years that I've lived in this community. Everything imaginable have been tried to eliminate this horrible waste of human potential in addition to the threat that it poses to those who live and work in proximity to these off an indiscriminate act of violence. It's my firm belief after having given over 30 years of Todd and having participated personally in countless efforts to stop the violence. These are some of the underlying problems firstly we have entirely too many young people in Seattle who have nothing to do with your time during the. When school is not in session many of the summer programs are either not relevant to the needs or desires of the target of Youth or they are too expensive that for them to afford young people should be able to design their own summer programs or at least to the schools give suggestions as to what they would like to be doing rather than have these program design for them by uninformed professional. Secondly many of these young people need jobs career path jobs the city must get serious about seeking help in providing these jobs for youth up to the age of 18. It is my firm belief that every young person who wants to earn money should have access to a job Charlie existing Community institutions need to start by Learning Centers for young people who want to go to learning friendly places during the summer. Fourth I believe the city needs to reach out to the street leaders those who have credibility on the street. They are the ones who have the clock needed to bring peace on the streets. Finally, I realized that in times like this. There's always a tendency to put this problem into the hands of the police. I feel like we have had behind the police question long enough. It is evident that if they could solve this problem, it would have been solved years ago to weed and seed or by totally dismantling the community and imprisoning thousands of young people. Especially black people on drug charges only to then make the drugs legal. Don't think that this hypocrisy goes unnoticed among the black community. This problem must be solved by us by the community. Those who are criminals must go to jail. However, those who are simply innocently caught up in the cross wires of the social crisis must be saved sincerely. Dr. Jeffrey appreciate their messages and we will be taking more input for now. We really warmly welcomed the people who are here's will. If you could please come and join us at the table. Yeah, we want we want as many community members as possible. Besides whatever you would like. Yeah. Looking at the movies. I just wanted to recognize a k l Shannon who's a long time and dedicated activist is also here in Chambers. And we will of course be discussing with her another community members as well symptoms of Delray. The committee goes committee goes. Could you all please give very brief introduction of each of you as a just as a matter of record and then we can start the discussion. Pedricktown customer service office, name is Garrett Weideman. I live in the Central District live in Seattle since 2010 meteorologist. My name's Emily Lieberman. I live on 21st Avenue in the central district and I've lived in Seattle since 2001 and I'm in a switch sides of the table, so I don't know. I'm Kathy Yazzie, and I live on the corner of 21st and East Columbia and I've been there for a little bit longer than 30 years. Joanna Cullen, I live just south of Union on 21st Avenue. I've lived in the Central District since 1977 and in that house since 1985. Twilight sad before I greatly appreciate you all making yourself available at such short notice. I know you have families and work obligations and I wanted this to be just a free-flowing discussion. So it's not like I'm going to you know, we have a specific you want to hear from you all about first of all how you feel it has been going and also what things you feel the city should be doing. So just please feel free to jump in and Vanity want to start first. I I want to say that I know the community has a lot. There are a lot of people in the community that are concerned and it's a very good variety Francis this morning before I came I I talk to a woman who's part of the Desmond Jackson foundation and she might have, except that they were going to Katie's coffee because there is a meeting with this man named Vernon Vernon who has been homeless in the central district for sometime and apparently his situation has gotten much better. And so that some residents were going over there to meet with him and talk to him. I've been active on several committees for some time and in terms of the feeling of safety and the Environmental Solutions, I realize it's only one little piece of it. None the less. I think we have to recognize that fear and anger really affect everybody's brains including adults but ability for children to learn so having some feeling on perception of safety and to have real safety in our neighborhoods is essential in order to stay on the gun violence and I would say that this woman that I talk to is as concerned about gun violence if not more because her nephew was a victim and I would also I know you Londa Emily's reached out to is also very concerned. So I would say that every will all the new residents all the people live there for a long time have Equity equal concern and have been one want to work on this together. Yeah. So, I'd like to point out that as as she said a lot of people on the Block would be here if they could be here and like I can only be here cuz I work a weird shift schedule and it happens to work with it. So some of the points that I've got it down her mind and some are on behalf of neighbors both homeowners and renters. So one thing that I think we need your guy's help to fix is to remove the ability to commit a drive-by shooting at Union and then be able to speed. Feh Lyon impeded straight all the way to Cherry 21st of the only streetwear where you can do that an R Block between union and Marion is up to nap times the length of the other kind of standard blocks around there. So if you will 50 60 miles per hour in a few seconds your tune up blocks away from the crime scene your scott-free and those that had a plan to have a gun battle. I guess have clearly learned that this is where to do it if you want a clean getaway, and so I don't think that this is going to Stop until we make it so you can't can't do that Marion and Marian is a super long block and Ryan pretty much go. You can go straight to Cherry and then you're leaving the neighborhood you're gone and all the other blocks between like 17th and 23rd have something stopping them. So. I think there's a good chance that if we were to do something there so that you can't speed through that it wouldn't just move the violence. I think people would have to do a rethink or delay or maybe and then eventually reduce the balance cuz I don't I think this is known as Dez place to do it and if we get rid of these easy place to commit a dry by then that can reduce violence. And collect some of the points as well. So when we had a first shooting about 18 months ago, but then we've had four more in the school year at that one intersection. And so we had a first one and we thought we were really unlucky there on our block and M&Ms is a second. We were hoping like maybe the shooters would avoid the area because it would be Yeah, this is a school year and then plus 180 months ago. So yeah there been five including 182 months ago just on our intersection and R Block that's 21st and Union 21st and Union 21st South of Union on the southside of Union and then to Mid to the mid lock. And so when I was a third one, we thought we would do something and it was the shooting when they're about fifteen shots of in front of my house tonight at hit the deck to my stomach and wait out the shop in my dining room. And then when there's a foot shooting we thought you know, there's going to be a 5th and there was a V and I think I mean you'll just know that that's where where you can come in and shooting and they weigh So when I went to Emily sent some of these points about 21st Avenue we did. contact us. To ask about that and I mean obviously it's not a lot of notice but the council as there's a liaison in that start to Castleton calling that person said that They basically said that the people and ask. Have expertise about about traffic calming measures for the sake of traffic calming. But in terms of its impact on gun violence in that sort of thing. They don't have that expertise within the department. So more than thing so high that something that that was kind of the initial response that we got one. We reached out obviously. And we did ask them to join us at the table you are but they are unable to be able to follow up with them make sure yet so please of gun violence in the Central District. I think that these you know for incidents on our block in the last 8 months plus I brought actually 5 articles about the five different events in the last 18 months that have been as Garrett said like all the way down our block with smashed cars and full of holes and that if there has been a recent escalation in this one specific spot and This the shooting last Friday. I don't know the gun terminology but used some kind of automatic weapon shooting is 75 bullets in some very short amount of time. I think is how many bullets they said they found them so that at this moment in this when spot there is this escalation of violence and you know, there are various potential reasons for that problem. And when is that that street I've been repeatedly told by different people is like a historical edge of the gang's territory and another potential reason. Is this shoot that it's the only Street between 17th and 23rd that doesn't have physical concrete traffic-calming barriers. So it makes it the one straight shot going south and I really appreciate that. There are many different ways that we need to work on this problem any of which I've already been addressed but one that really hasn't been addressed yet is this concept of crime prevention through environmental design, which is a way to Seek to prevent crime that has been proven effective that doesn't involve more police thing, which is not welcome to everyone in our community. And we feel that we have done at this point what we can we put our community to put in planters and a spot where people were parking on the sidewalk to sell drugs and put some big beautiful Planters with trees there. We offense was removed so that the security camera could have a better Vantage a tall hedge was removed to improve visibility and have more of a sense of like eyes on the street. We have worked with the healthy use Central Area Network to commission a mural that will be painted on our corner by there actually 30 children who live on this block who will work together to paint that mural this June and we've done a lot of advocacy to help make that corner pedestrian-friendly including working. The safe routes to school folks who are going to put in a crosswalk with a flashing Beacon this summer and we put up Crossing Flags. So we feel that we have done a lot of what we could we have had three big meetings of our community people on our block and people surrounding including I put like a flyer on every door on our block. I was met with local business owners. We've had two meetings that the police department has come to two times council member mosquito has been to our block. We really appreciate the opportunity to come here and speak to you today. We based our concerns that eastpak. We have sent many many many Communications to the mayor's office to city council members to the Seattle Police Department to ask. To Seattle City Light and other City agencies. And what we are asking for is for the City 2. In addition to all of the efforts that you are making the effort that our Police Department is making them to use some tools that are policing to address. What is happening in this hot spot now and last September they made it sound really easy like this the you know, it has been in the East Precinct has some new community policing officers. They're focusing on that effort. They have trained them to conduct these step crime prevention through environmental design septet is the acronym they've trained them to conduct these except Ed reviews and they say, you know, all we have to do the police department says make it safe by putting in a year or the mayor's office can just pick up the phone and ask. Could you stuff like this but we've gotten the same response that you did witches as dots as well. We don't know how to do that. So I appreciate it that Seattle City Light came out and put up when new street light in a dark spot on our block. But the other thing that we are asking for is some kind of traffic calming on our block to prevent this, you know driving by because all five of the incidents that we are discussing here. I'm pretty certain haven't bought some flight down 21st, which is the one, you know, Clearpath going south. So I mean, what we would like is for us. To engage with our community to come out to speak to the people who've been there a long time to speak to the people who want to speak to them to develop some plan about what could make our Is there a physical changes that could make our neighborhood safer or attempt to do so or at least provide like a visual barrier close enough to Union on 21st that is clear that you can't just buy a way down here. And that was like the concept of the flower beds that you mentioned and these are just you know, they're different things that the said that different cities have done at different times. And I'm sorry my photocopier stopped on me. So I don't have multiple good copies, but These are just a few thank you so much. These are just a few Concepts. Like if there were a few planters that would create the kind of diversion that every other went down. So it's going to be just a drive-by ask blocks around us have built-in but the concrete Planters or and not because you know, I would divert traffic at the end of the block or they could put you know in conjunction maybe with one of those things put in speed bumps. Although I don't know that alone. Those are going to feel backed up. So the request is for us. To come to the table and for the city to direct s. To do so and look Beyond, you know police thing as at other solutions that our neighborhood would really like to engage about and have been asking to do since September and I absolutely as I said before My office my stepdad and other staff members will absolutely be following up with that. And then I just have a question. How how has s. Directed? Would you all like like in water to what extent like have they sent staff members to the blog to visit you alongside you do, you know 2017. I didn't some advocacy about safe routes to school and the safe routes to school person came and walked with are middle schoolers to Washington and we think it's going to hurt me. So in that case they were happy to come to the Block in this case when we've been talking to them about violence reduction. They have not, or been willing to come I can email. was forwarded to somebody who wrote back to me saying what we're putting in a crosswalk as if I know that's been in the works since 2017, but we're asking for more time and she wrote back and said while you can apply for a grant and when I replied saying we could do more to add something to do. I'm currently in from Sheriff I can and I've been a member of the eastpak group rare penny years. So one of the frustrations is people talk about the septet will come and talk to us about a septet. But if it doesn't feel like they interact with the Department of Transportation Department of neighborhood seems like maybe they interact a little bit with whoever doesn't always feels like you have one presentation you try to organize people on the East Precinct crime prevention group is trying to work with the entire East Precinct. So unless if if you accept a group to come and give you a presentation, then somebody talks to that ass up. Maybe one group talks to them small neighborhood. But there is never any of the follow-up between departments to actually accomplish something or maybe septet people could actually work with the Department asked. To give them some ideas some tools. Maybe they could work together because if they're not working together, then it's up to us to ask for something and maybe we won't completely develop consensus on exactly how the street should be diverted, or maybe we'll make a mistake. Maybe we'll make it so emergency vehicles can't can't answer. So if it feels like you need people were the department sort of talking to each other and really coming and talking to the neighborhood's but also somebody that maybe can look at the overall Central District because he said happens on Jackson. It's been happening in the pipeline area and it feels like there's some relationship between all of this. So maybe if somebody had eyes on the entire area there could be some type of design or at least review of How things could be slowed down discouraged because of all this will not go fix the root causes the fewer opportunities. Somebody has to do violence will give them a moment to rethink their actions. Yes, we hear shots and the kind you are describing Emily. Why are you not use clearly something automatic or semi-automatic weapon just a pace at which is going, you know, it's not just a handgun and it is scary. Yes. Absolutely. There's there's no question about that and I'm glad you mentioned join also the same to be like, we need more better communication between the different departments. So I would say I mean obviously it's pretty much every should look into this morbid. Seems like a four-step might be to actually get some staff member key staff members from the key departments to come together there and have a discussion with resident and like you said you want it's totally fair if they say from the other expertise one of you that while this one work, but this will work fine. But let's have that discussion. It seems Seems only reasonable to expect that we could have that discussion and then getting But I do want to say some share, please please and I'm on the Block south of Marion between Marion and cherry on the west side of the street are two childcare centers and I have been thinking for quite some time. Now that school's are notified and do lockdowns. So during this last incident Garfield was lockdown. I believe Madrona was locked on and I think washing Washington Meaney, I think all had some time. Block them and when I came back from walking my dog during the shooting I noticed that the children across the street were playing in the yard because they didn't know that there had been a shooting and that people were racing down the street to escape from police or shooting more violence in some way and there should we should have a system in this city? notifies, Early Learning and Care environments of Emergency situations that the children where the children should be in the house. yeah, it seems like a Particularly glaring set of things that are not being addressed. Absolutely the state has Has taken some very small and insignificant steps toward this effort, but it's very jarring to hear the gunshots and see the children playing in the yard. And then later to see that Garfield had been notified. Yeah. Yeah. So I think that even if the state ever gets around to doing something we as a city need to do something to protect those early learners. and speaking of big responses versus little responses like we need to do the things that we can you know, and while I support the idea that we should take sort of a systemic luck at the maybe if we think that it might be helpful to look at the traffic patterns in the CD overall and see if their environmental changes we can make to reduce gun violence great, but this is a really process heavy sit and I don't want the desire for process to get in the way of the things that we actually could do right now cheaply and quickly and I think that on this particular block where there have been these five incidents of gun violence in Rapid succession escalating in severity injuries death where when that car speeds down 21st to previously three preschools. I mean, I think that it's in that should be enough to say okay if we could Raise $5,000 for Planters are fine $5,000 in our budget or left the community raise it and put them on the street in consultation with the neighborhood like we would like some action now in this River critical problem in one specific spot. Absolutely. I would be interested in how this up Ted could interact with s. Even on just this. Blog because of what what I mean if they have a a planning tool I don't they share that with us. With each other. But also I feel like a very basic First Step should be to get the people who have the expertise to come there and maybe they don't have experience directly on how to use traffic measures to address not traffic issues, but other issues fair enough, but I feel like we should at least have them visit and Emily you mentioned that I have done something new. I mean, I'm just well certainly there are studies about the effectiveness of crime prevention through environmental design and there are specific places where that's been studied, but I didn't print and bring him sorry, but it's easy to find but these are just some examples. I mean, let's not even go outside Seattle. Let's look at like North Capitol Hill. It has like little turn after the little bit. I mean, there are just things that you can do to make places not feel like a crazy thoroughfare and if there had been five major gun violence incident on North Capitol Hill or in Green Lake or in Laurelhurst, there would have been a different response than we've seen in the CD. So I appreciate your willingness to advocate for this area. There is there are in it. Automatic inequities in have different neighborhood jacket different responses. That's true. We know it. We know that's true. So that's why I always think if I think the next time we're on lockdown as often as Washington and Garfield there would be a different response. So yeah it definitely please send me what whatever he studies that are about what impact environmental design changes have on these issues. I don't I don't I agree with you. They should be dismissed in any way on the job Early Learning Centers. What? Is it true that there is no effective state law that mandates that like, how is it that Garfield High School is able to do that and but not I don't know how it is set up. But I do know that Early Learning Centers get no notification of And how do how can you can you tell me in more detail? How do high schools? How do they what is the process of notification like it up and do it or they get notified schools get notified. I meant I think so. What one question I would have is that through the school district or in do private schools. Also get notified. I do I haven't heard anything like that. Washington the different girls schools in the area. I haven't heard any announcements or they giddens. I haven't ever heard her since was notified, but I don't know if they say I don't know if they were tied into a system or if it was an individual that said you need to notify me if they're so I don't know how it works in the schools. I just know that. It doesn't mean I get me amber alerts on my phone. It seems like there should be a way to notify me. I'm having three kids who are in lockdown not infrequently is that they get notification from STD and then they are like in consultation with SPD about when they can lift it that it's SPD that lift the lockdown, but they notify it through the district. I think I think so. Yes. Okay. So I was because we all have limited expertise. We we will need other people at the table with us. And so I just wanted to propose some next steps one is a please share with me whatever information you have weather is from other parts of Seattle are from other cities or even other countries internationally cities if there's some best practices we could go buy it has That I think the department of neighborhoods used to do these septet analyses and now SPD is doing them. So I mean Seattle as a city has used this process as a way to make environmental changes for some time. So I will send that to you. I just also want you to know that Seattle believes it and uses the process of the individuals staff members that you have been interacting with a stepdad and also Department neighborhoods, you know people who are already familiar with these issues if we can quickly get in touch with them as well. And then what we should try and do is have some sort of community conversation about this. I think the most useful thing would be as if we are actually there rather than here. So our office will work with you and scheduling sometime of that nature, but but it would be more useful our time would be more usefully spend if we can get some people have some Studies of some kind, you know, if it's not exactly what it is what what is needed so we will we will try and work on that and we will coordinate with you in terms of when we can do that. And I mean, but my question is who can tell us. Please make these changes even though you don't feel that it's within your expertise to say that it would reduce gun violence something that requires any legislative measure let you know something would be major enough if it's major nothing. We would need an ordinance that would be have to be passed by the city council and then approved by the mirror. I don't think we're talking about those things yet. Exactly. So it seems like these are smaller measures what we see the Department's all just by the way the city's airport executive reports the mayor's office, but it is not We believe the city council as a legislative body also have the ability to engage with the Departments and make request based on community and then they're free to discuss amongst themselves of their expertise and then come up with recommendations of what would work and mean what may not work. So I think the first step is to just get some coordination with the department and then find a time that works for you all probably on on a weekday evening or our weekend. I think would probably be the best during the day obviously you're not but the daylight brother And then go from there when the parking was changed allowing parking on the west side of 21st. And when each of the traffic circles were installed just involved petitioning the neighbors. It was not a big deal. You just knock on the doors and say do you want this and when everybody agreed that they wanted it, it happened so straight shot. There are two traffic circle. So then it's a very long walk and the traffic circles don't seem to have Let me know it was a bit. I mean I live there when the parking changed and when the traffic so there was a big change in the speeding and we're slow down at this point during certain times of the day when there's quite a bit of traffic because there is two way traffic people have to pull over there's not a lot but it's a certain times when there is not traffic coming. Suddenly. People are just buy the impossible when you get stuck behind a garbage truck on 24's. This was my little drawing earlier, but I'm sure you're familiar with the like concrete curb bulbs. So You said between 17th and 23rd. It's the only straight shot. There are traffic circles, but that's all and that doesn't seem to slow cars down too much. The other blocks have two of the Box have her bulbs that you have to start a drive in an S shape and hearts have to wait at both ends on the 20th of Jason to us has to concrete curb all at the roundabout so that also really significantly slows traffic and then I'm 20 second one block below us is the greenway. So there are bikes that slow traffic and also a lot of speed bumps. So that's what we mean when we say that are blocked does not have comprable traffic calming measures. Tex-Mex appoints first well, thank thank all of you for coming out and sharing your concerns in on behalf of not just yourselves but your neighbors and your neighborhood. So I've heard a lot of very good thing. Set that is been around since the 1960s Is Not A New Concept is almost 50 years old and it's somewhat concerning to me of s. Says or whoever you talked to didn't feel comfortable on that kind of analysis because I I think they're many people in s. That have quite a bit of expertise in September designs. That should almost be a requirement given the fact that it was found in the 1960s by I think his name is Jeffery or something like that. I just remember reading it myself as a lay person. So it's not a it's not rocket science, right and there's some fundamental pillars that one would do. And so I think that this would be a very ripe analysis to have set Tab S. And the police department should I do a deep dive on would make sense the letter that you shared from Reverend Jeffries. I think I nailed the issue as far as I'm concerned that in addition to set that we need to quite candidly in it and I might be a minority opinion on this we need to actually know who are committing these atrocious acts as well. Are they coming from other areas are there issues that we have to concern ourselves with? And we need people we need to invest our budget our monies into I think other people in organizations could help with the underlying issues that would cause pulling pulling a gun on shooting someone is not a natural act in my mind. So there's and you can go back and talk about the years of institutional racism. You can talk about where the breakdown is, but we have to have an investment strategy that address is it now this stuff seems to sometimes come in waves in 2007 2008. We had I just have a high number of shootings in kids in middle schools. And that's where the birth of the shell. Youth prevention Sy VPI Seattle youth violence prevention initiative came out of that and we just real creative things some somewhat controversial when you start putting police officers in Middle School's my daughter was at Madrona in Alton are uniformed officers, but that was one part of a multi-faceted strategy. It seems like violence has on the uptick right now. And again with the letter Reverend Refuge. What I think is a strong letter to sit awake the city up again to revisit this issue. So I think the septet is a great strategy. I think those pillars at Reverend Jeffries point on is a great strategy. And again, we have to get the extra cheese here at the table to come up with an investment strategy to make sure your your homes are safe cuz no one really needs to no one should have to live to this kind of fear. As far as I'm concerned. There have been meetings with the East Precinct the police. To say that most of the people involved in the shootings. Do not have addresses in Seattle. tell if you're there are so we're trying to address the step Ted, but in terms of the larger issue, I would think that you need to engage in a reagent some Regional planning or some some type of regional overview of how is happening and I are at my perception is that A few years ago when I saw areas where it seemed like there was drug dealing and people hanging out. Most of the people were like 30 40 50, maybe not as old as I am, but older and suddenly I saw a more young people in the mix and now I notice in the news stories in the police confirmed that more of the especially Shooters have been young people and that's it. But my perception is true. So I was trying to get to where are they doing the recruiting what what are the vulnerable areas of recruiting Because that that seems like one way to start figuring out how to help. Yes, so yeah, I appreciate everybody's comments. Sorry. We have to accept our next agenda item people waiting here. So we should get to that but let's make sure we arrange something, you know, in terms of concrete next to apps. I agree with guns are present at all that we have. We should have after so many decades of work in the city. We should have some expertise. So sorry enough for them to just say we don't have expertise. Let's let's make sure that we do something concretely and it's not ruled out. That is the department indeed doesn't have a split rail. Do I agree that in addition if the program has been there for decades, but if they don't then let's take on so, you know of the harpy are there ways that we can address this and I don't see why these request cannot be accommodated to me. They seem very small compared to in terms of what it would take. Achieve them compared to the larger things that were working on. So I feel like let's let's let's overcome the smaller hurdles. And then the other thing I was saying looking to what to do for notification for Early Learning Center. I feel like I should change immediately. Just just absolutely not accept not acceptable that little children are our butt in potentially Harm's Way. It's a problem all over our state, but if we could do something inside, I know I completely agree so completely work on. So you want to be want to say something is the daycare so it seems like they would have the list anyway, it seems very important. So we will we will look into that as well. And then the last one or two make before you all leave us along the lines of Reverend Jeffries letter and the fact that we have klgr and the fact that this is also the place I'm in the central district is historically black neighborhood a lot of back to new members themselves are being pushed out. I would also like for us to have a community conversation that includes Africa doll own and others. So in addition to having this neighborhood to the walk-through with s dad and step-dad, let's also do a community meet up. So to say where we can have a Frank conversation about larger issues in addition to these the specific traffic coming and other issues that also have a larger discussion on what mean one Central District of the city to be like in we wanted to be welcomed an affordable for everyone and the funding for public schools and the pro programs like Reverend Jeffrey is saying a lot of the youth are getting involved and fortunately in all these problematic situations because they don't have things to get to and constructive uses for that dime because nobody's really looking out for them. So I would like you all also to be included in that conversation. I know you already are in your neighborhood, but I would let's let's make it wider and I would like for my office to be in touch with you all on all these specific questions if that's that's all thank you. Thank you. Thank you. Thank you. Thank you cards from Fresno for the comments. And also what should mention thanks, not only the dead but also Jeff Sims from Central staff whose it was give us some insights into some of the questions that we were looking into for this version diadem. No problem and reductions and please take it away. So I should also acknowledge Greg dolls from Central staff who has been helping us on this. Good, Jeff Talent with sdci on the rental programs manager. Hi, I'm Chelsea O'Sullivan. I'm the lead for the renting in Seattle program, sdci. Thank you and Lisa take it away. Apologies for sending so far down the table here in to operate the computer. Well, thank you very much for having us here. We were here maybe 6-8 months ago to give you an update on the progress until it's exciting to be here and be able to show you some finished products here with this rent in Seattle effort appreciate the opportunity to help promote this new program back earlier in the year, but we're now trying to make a concerted effort to get the word out about this program. Versailles fire departments purpose and values may be the one thing I'll call attention to is equity is in our purpose statement there instantly that's renting in Seattle program is a big part of our departments. I'm support for their rsj initiative by reaching our communities in Seattle with information that they need an improving access to services. Is it raining in Seattle started with the council requests a little bit of seed funding in a cancel request back in 2017 to develop the program and thank you for the leadership and support for that. I'm so it we spent 2018 building out the website getting a phone line in place in the technology to support that phone line and some other materials which we will highlight here earlier this year. We started with a soft lunch and I'm very all right. Now in may try to do a more aggressive effort to get the word out. We feel like everything's in place and operating smoothly and we want the customers to start coming. Did you have a select group of renter's to test out the during the soft launch out under the variety of different ways as different pieces came together. So we had a yes or no answer is both from within our department and outside of it. We had the renters Commission. We involve them and they reviewed some of the materials and gave us some good insight into the website and its flow we work with the community liaison for Department of neighborhoods to get to the perspective of immigrant Refugee Community use for the 9 English portions of our website. So the key features of renting a house what is more than a web portal in a phone number? And I think the first and foremost is is really boots-on-the-ground you're getting out into the community and helping deliver our message directly to people face-to-face. So I'm enhanced Outreach and coordination is a big part of that. We did 38 events in 2018 and we have over 60 plans for 2019 right now couple of big ones to feature don't see here originally did a great job in developing some Partnerships. So for example, we're doing quarterly trainings with office for civil rights for landlords, and that's been Just a lot of work and weaving are to their civil rights protections and our renters protections the Gathering to the single integrated curriculum that helps landlord still in all the gaps of the landlord experience with Seattle Housing Authority to get us invited to their initial tenant meetings, as people are receiving their vouchers for the Housing Authority, She's able to talk to 8 to 1510. It's every week and give them information about their rights and who to call for out if they're having problems. A lot of other collaboration on some exciting ones of it working with the community connectors at the food banks. And so we had a couple of events out at Ballard food bank and bird bar up in the central area and spu and inviting them to come along to some of our events to help promote some of their programs like a light bulbs and low-flow toilets and preventing fogwell Grease We just have a nice connection with other important city missions. Basically kind of a portable are renting in Seattle clinic. Now we can pop up you see a picture of our attempt there and we can set up with a couple of experts that so one of her Folks at staffs are landlord tenant issues group there. They can actually answer questions and taking service request if we have a if we actually didn't fight issues there. And then finally out quite a bit of more coordination between departments since we have several departments that touch on renters issues a big part of this whole effort is just getting the Departments to work together, with some unified messaging and I'm exchange information. They help Those portions of our website to make sure we're talking to their issues as well as our own departments. So another key piece was some new infographic information you before now most of our materials were pretty dense black and white kind of legalistic. So you can see we giving you examples of our new brochure. Where is we broke it into square key parts of the tenant experience and her intended to give you enough information to To to to get you started but not go away not go too deep but then point everything back to her phone line on our web portal to get information or help. I have to say I love the graphics. Thank you. Until these infographics around the translated into 14 languages and and they become a building block. You'll see you in a minute of some of our materials on our website to serve 9 English speaking communities. So then the dedicated helpline touchdown that already so single phone number that people can call instead of having to look through no city directory and find three or four different departments that might be able to help them. We also have the added problem that a lot of the ranchers protections are in sdci and people just didn't think to call the Department of construction and inspections. So Brandon everything around renting in Seattle with a phone line associated with that is where hope to make this easier for people to know where to go. Where did there's a study Department that they could No, I don't think that I don't think we have any statistics. We just know I think more from first-hand experience in or out in the community talking and people say I had no idea call Department of inspections. The only thing we know is from Partners like office of Housing and because housing is in their name, they've got a lot of calls that should have come to us so we have been pretty good at making those referrals over the years. So this is hopefully this after it will have all of these calls funneling through our single phone line and then we can work to get it out to the right departments. Can I ask you in terms of in the pastor is a different phone number? You know that the phone number that was on that CCI website for a renter's to call and we gave probably hundreds of people that phone number when they called at different times and and you've been able to help many people. Is that phone number still active? Should we be giving people this phone number for how does it work now phone number is still active. That's the long-standing Code Compliance helpline. And so that's what people call the end of the season illegal construction or if they have weed problems things like that. So we're still receiving calls on that line. That's actually the same people answering both lines the expert enough to know all the right spots are the number is fine. I think we're trying to really promote this new phone number. It's also good way of us would isolating just renters issues and collect data on how many calls were getting. So from now on we should give up phone number The website so I think I'll try and jump out of the PowerPoint presentation here and hopefully technology will work with us and going to show you a few key features of the website. So the first thing you see when you come in we spent a lot of debate about this and I'm tested this with several people and decided we really need two doors were speaking to to audiences renters and landlords and to use, you know, accessible language for each of those audiences. You need to be needed to write the same information but in different ways, so if you come in as a renter, you'll see your your main doorway for information. And we organized this around the renter experience. So starting out. So do some of the be prepared. Are you ready to rent moving in managing the rental relationship moving out and then just general resources. And so if you don't know exactly what you're looking for, this is a way to store to come in and say oh this is about where I am in my rental experience and you know, I want it. I'm about ready to move in. What do I need to know? And if you come in here, you'll learn about moving costs and what's allowed and watch not installment payments and you're entitled to ask for those security deposit check list of the most important things us to this is less regulatory, but just a really important tip make sure you get that move in checklist. Types of rental agreements with a lot of agreement out there and enlightened here's an example of where we're also making a cross over to another department. So we feature the utility. So people know both how to get utilities moved over but also some of the other utility programs that might be available to them. Yeah, you told this one made going to utila just count this. If not, it's mentioned elsewhere. And let's see. Let's go. Other features to look at here. Are they go back to the home? We also in this is actually specific feedback in the ranchers commission. They said but I don't want to navigate through all this I just need help. So we created you have a couple things to get you right where you needed to go. So right here is like the top. 7 issues that we get in exactly where to go for help on those Another one to feature here materials and other languages. So we we didn't translate everything in the website. That's more than we could do right now. So what we did do was basically sort of inventorying and catalog materials. We had a new materials we wrote. Summary information + Princeton C's infographics, you've seen and the videos that will show in a minute are all in language on these different web pages. I think that's the main thing. Also require landlords to include voter registration info. Is there any indication there for renters and I go to your website? Is there I know there's a security deposit check with a checklist for the information packet for the information for tenants back in when you move in. You should write just remember to register to vote, but we can get the information for tenants, but we don't highlighted or or speak to it, but Because renters experience more moving and instability compared to homeowners, obviously. The question of getting re-registered at your new address always comes out. All right. Yeah, I didn't want anything just to feature here. So for instance the state just passed a new tenant protection laws and dulcie was able to get in right away and just put a short blurb on there. And then as we start unpacking those will will be able to say more about those on his website. all right, I think we'll go back to the yeah, a short description of the eviction process and links to some sort of related topics because types Fiction come eat with different types of notices and then some Community Resources to go to I'm going to our department doesn't get deep into evictions. We rely on the legal Community to provide that kind of support so me and they were trying to give people enough information to know. Hey, this is important and then help them get connected with the right resources. I think with the changes in state law. We're planning to bolster this up to reflect the new You just mentioned that beat. Does a legal concern how you would say this? What it what did you do think it would be helpful to may be like in addition to this information is very important, but maybe like above or below but have a bullet point checklist to say if you are get got an eviction notice other than for these reasons then What's the lights may help people be able to distinguish between types of fiction notices or a valediction versus at but it may be legal, but I still may be straight-up illegal and I think I think we can do more. I think we need to be careful how much we say because it is such a you know, a critical event that you really need proper representation to to sort through. So it will look at it. The other thing that was recently suggested to us as a little bit of the flowchart because it's kind of a complicated process to understand so you can just kind of see what the steps are and help really emphasize a you need to take action to prevent this from happening. Do you make sense an end up? Could we also in that in the whole flow chart of people take action if he also emphasized that getting legal help it it's a good idea and are obviously the biggest tire for a lot of people facing eviction is that they just can't afford it but it's worth actually trying to Cobble together. Something may be getting a loan from a relative of PCR. So startling I mean getting having a legal representation. Is it night or day difference between your outcomes and Anderson? And there's and their resources available for people who can't afford it. So getting them connected with those quickly and having people take advantage of those services. Sprouts to that point if you could can you click is that live the just cause eviction ordinance what happens if you click on that so you're going to pull up the ordinance I take it. Where is Waterloo valid reasons for being evicted or not. This goes into all 16. But my fear I thought you're going to pull up the origin sounds like no one wants to read an ordinance. Trust me. Going to reach one. I think the point the chairs making that I agree with his that it's just got to be so easy right for someone to really honest cuz you have to understand that the person not represented by counsel. They may not be a lawyer until and I'll look through that on my own, but I just wanted to be so crystal clear that anyone could understand it. I think the first bullet point is that the one that the state just writes opportunity. I have to have sort of a bifurcated thing saying, you know, I like 27. And 90 days after the end of the session. What would you be? just cause eviction ordinance which we know what it means by most people wouldn't know. When can the landlord evict you? Yeah, I think that's a good point. What's nice about a website is easily changed as Nimble and I think we're growing and then settling in. That's why we did a soft lunch and we worked out a lot of bugs and improved a lot of things that were very receptive to recommendations from Council from anybody in the community. If they see things they think could be more clear or a missing. We're happy to take that and we because of the number website we can get in to make those changes. All right. I want to go back to haven't been back to the beginning of the presentation there. But let's Okay, so we created a video and it's a very short day. It's going to be 30 seconds PSA links and just enough to just help people. Remember that the city has the resources and they can help. It doesn't go into much detail. I can play it if we can make it work here. Maybe we had technical. There's a lot to know about renting in Seattle. What are my renter rights and responsibilities? What should I know when moving in? Who do I contact when there's a problem with my rental unit what happens when it's time to move out the city of Seattle has many renter protections and resources. You need to know vivid seattle.gov flash renting in Seattle or call 206-684-5700 to learn more. Go back to the beginning again. Anyway the gaps and maybe on the Seattle Channel when they're looking for some filler space. It's translated into narrated in 1314 languages and another good example of partnership. It was the department of neighborhood community liaison who did the narration for us with a very cost-effective way to just have them work with our vendors who did the video and just walk into the studio and do that and actual community members here doing that. So social media, we're just really getting started on that mainly us and looking for partners to help spread the word through a Twitter. I guess our department doesn't have Instagram but Twitter Facebook and using the hashtag. Get weak and kind of brand everything. So we've been doing things like sharing this video. We're getting other tips out. Define other languages other than English are also in. You know. I don't think we we have a way of knowing I can ask that question. I don't know if we see who's viewing it with with a lot of detail. The pieces of feedback that came from engaging with the Department of neighborhoods Community liaison says that the older Generations prefer to communicate by phone and they prefer to call and speak to somebody and then the younger Generations are all about the social media. So pretty expected to help kids these days. So when are they thinking here? So as you know this year Council transferred some funding for tenant Services some grant funding from hsd2 our department and add additional funding for a legal services. And so we took that funding and then the early this year ran a competitive Grant solicitation process request for proposals out on the street and ask basically anybody who had good ideas or was interested to come in and propose ways that they could help serve tenants in a variety of areas Outreach. I'm legal assistance liaison with communities. And so we we we have now our Review Committee has made the decision selected organizations with notified them all and we're in the process of writing Grant agreements with the community organizations. And it's going to cover a number of things. So evention defense and legal aid tenant counseling door to door Outreach know your rights workshops and kind of overlapping with that. We're going to be excited to bring in a couple of smaller organizations that are serving in Congress refugees and also the lgbtq community. So we're we're piloting some work with some smaller organizations that return to reaching communities that we've had a heart attack. And then I what's on our plate for this year. So in addition to getting this launch out and maintaining what we've already built a couple big things that changes to state law that came along with a very excited about those and so we I do kind of a short campaign here to help get the word out. I think landlords are going to be a big audience for that making sure that they're aware of these new laws. We have a landlord email list to a real program of 19,000 landlords or property manager. So it's a good way to get information into their hands quickly. So is we finished and a scrubbing the changes in State Line exactly what they mean, we'll end up summarizing that pushing it out to the landlord Community fold it into the trainings were doing and then we'll also do tenant Outreach to let us know of their enhanced rights as well. And then the other big thing on our plate this year is to create a renters handbook the idea is to take the rather dense Legal Information for tenants turn into something. That's a little bit more user-friendly isn't just a summary of laws, but also has resources and where to go for help and maybe some tips kind of like these infographics bit flushed out a little bit more and and something that people might want to keep so a little bit more durable instead of just a piece of paper of one of hundreds or handed when you move in I said I said that's that's it for now. Happy to hear any questions. Alyssa isn't this great great work. I'm very impressed. It resides in. Sdci. This body works. I don't know if we thought of that or the mere thought of that is that still seem like the proper department for this kind of activity to reside make sense to me, but I I really thoroughly through it because I grew out of land use codes. And so I think it's just kind of a legacy of that as part of a write-up we did for Council in response to a request you gave us in 2017. I'm we analyze the other options like reading. I like a stand-alone rental Resource Center the consensus of the people we talk to you within the city departments and some of the community members is let's not build something new at least right now. You should be more about kind of a virtual Center and many of the things we talked about here just in task coordination between the Departments to make sure we're talking to each other and better materials and better Outreach right now most of the tenant services or tenant protections our house between us and office for civil rights and we approach things in different ways for different Body of Lies. It's a little it'll be a little bit hard to mash them together right now. So we just more coordination between us seem to serve the need. Thank you. Thank you so much. And yeah, please keep us apprised of updates and we're always impressed with your work and also just the dedication of all your staff members in helping repeated experience. Thank you very much. So I'm feeling any other points.", "end_time": 5543.0}]}