{"format": "raw", "annotations": [], "confidence": 0.93266378228481, "data": [{"start_time": 0, "text": "My sister and brother-in-law came down to visit. Oh, yeah. Good morning, everyone. Welcome to a special committee meeting of the sustainability and transportation committee. My name is Mike O'Brien. I am chair the committee today is May 9th. It's 11:34 a.m. We have a lot of folks that are Outdoors right now on the plaza at City Hall. There is a demonstration going on with a couple of the electric scooter share companies, but we're going to get this meeting started. I'm expecting that. My colleagues will be joining me. I'm as they get up here. If you want to get things rolling really quick. The agenda today has just a single item, which is the presentation on the scooter share. We're going to hear from a number of different folks into that single item before we get to that and we will take public comment. I expect there's some people that may want to provide public comment that aren't here yet. And so we're going to do public comment. At the beginning and then if you have time at the end of come back and do public comment for those that maybe arrived a little later. I'm going to go ahead and move to approve our agenda with that addition of a second public comment. At the end and I will prove that to go. Let's go ahead and move into public comment and Kelly signed up there. Can a 5-foot signed up will do up to two minutes each Richard Baron followed by Michael Carpenter. OfficeMax hot. My name is Richard Barron. I'm with safe safe acronym stands for Seattle safe sidewalk access for everyone. And I am encouraging this committee on the council to table this approve or decline any approval for any current. Yes. Efforts regarding scooter related activities. Andres Resendez any current and pending agreements between s. And Bike Share vendors until and I've listed four categories of untils and I'm going to replay mention just the titles of them. The first one is bike-share bicycle Vehicles presents on sidewalks is not consistent with other Seattle Municipal Code ordinances education is terrible and beneficial only as a marketing device for Bike Share companies. I'm going to put on the table and I would appreciate if Kelly would share them with numbers disable and I off all also have extras that other people here would like to have one you can either use them by wearing them or you can use them by putting them on bike seat seat switch is the original design that I created. Simply to begin to try to educate users, please. Don't pipe your Park your bikes or obstruct sidewalks. There is a 12 or 14 their Kelly if you don't mind. Another until is not penalizing Bike Share bike bicycle vendors or users the system allows they vendors to skate And as far as I've been able to discern a no penalties are costs other than this we're going to reduce your bikes and it's such a massive strategy to until there's no penalties real penalties involved time is up Richard. You have to thank you for your comments and thanks for even though I X up and that is the counting that's going on is ridiculous. I walked over here seven blocks 24 bike. Roblox Michael good afternoon. Council member Michael schuessler. Sorry for my spelling parently abysmal. I'm here as an avid bike commuter and bus commuter as well as the CEO of the Washington tech industry Association bike and scooter share is an essential element to Mobility for the city as well acknowledge. I heard you speak outside. So I know you feel the same way and it's green. So it doesn't really get much better than that terms of Mobility options. There were 9 million trips in the US last year on bikes on Bike Share. They were 39 million trips on bike scooter share scooters are way more popular than bikes and there's really no reason for that. Not everybody is in physical shape to ride a bicycle, especially up and down City Hills even with eassist but also scooters are particularly useful for people wearing a sport coat or a dress much more so than a bicycle so far in terms of short mobility of somewhere between a half a mile to to miles of going to meetings or catching Light Rail getting to a bus there really quite essential and scooters are really 4th edition to Bike Share the Portland Board of Transportation, which I think you're going to be seeing later published a study last year that show that there was a 6% increase in Bike Share was a result of introducing scooter said there's clear evidence that this is not a zero-sum game bikes and scooters are not mutually exclusive. There is a tie believe speaking again as an avid cyclist and the commuter on a bicycle. There is a need for safety as a foremost concern for this is City. I definitely apply at the thought on that. There's two comments I have on that. The first is total indemnification blanket is unreasonable because the number one issue for recycles bicycles as well as scooters is traffic red lights in the city or being run everyday by buses. People are still texting while driving. That's the number one safety concern. The second is the roads themselves. I live in West Seattle to been a long time since West Seattle seen anybody do any road rebuild. I don't like riding a bike on there would never ride a scooter. West Seattle, so if there's actually a public policy issue that I would strongly urge the council to consider and I'm probably not to be super popular with anybody on this speaking as a cyclist. I got to work with this and I have this at work and I have another one at work if I'm going to use a Rideshare bike I use this the city should mandate helmets for everybody on a bicycle and everybody on a scooter because the number one issue for injury on a scooter on a bicycle is a head injury. Everything else is easily recovered. Thank you, Michael. I'm Mercy you're going to be next in Marcy going to be followed by Dan wise and then Catherine toll and been joined by. Thank you customer brand and mosquito and my very improvised sign which says no blocking scooters. I'm a proponent of all three modes of transportation. I think they benefit everyone in the city. But I'm also a Davis disabled pedestrian and they're very clear dangers currently with the Bike Share. System in Seattle parking enforcement Park appropriate parking is not anywhere near acceptable levels. My message to the city is clear. Do not start any pilot program with scooter share until the bike-share blocking issue is much more under control. And the scooter share companies can guarantee that there will not be such a huge problem as there is with bike-share. Thank you. at 10 I am Dan wise and I live in North West Seattle Ballard Greenwood neighborhood and I work in the central district and I come downtown at 10 and I use Bike Share a lot to reduce my car trips as much as possible into the city. I'm a proponent of the scooters. We have a lot of hills and I've seen where the scooters are a lot easier to navigate on the Hills bikes. I do agree that we should as a community have good public design that allows people to park so that they're not obstructing folks on the sidewalk, but I think we can do that as a urban planning issue an alternative modes of transportation. Hi, my name is Katherine Heigl my first time doing this is very exciting. I feel really strongly about scooters. I use them in San Diego year-and-a-half ago and it was fun. I was so happy to not have to deal with how do I take buses in this new city? I think for tourism in this area. It's really easy to hop-on and hop-off to the point of you know, writing them to business where between the Lincoln in office is much more accessible than being on a bicycle as someone who lives in Ballard and got their bike stolen last year. I now write rely rely heavily on the bike share program and would really really love to have the scooters around cuz I'm much more fun to ride to the point of parking them in a safe location. I noticed that in Ballard there in areas on the sidewalks for your sister Park them and I absolutely love that cuz I also am really concerned. I don't know where should I park? This could be something that we were more broadly like this is the recommended place to park them. I don't know if it's something that we can necessarily enforce really strongly but user education seems like a real Big part of this and if there was some part of the applications where you had to confirm that you went through a certain small tutorial wearing bicycle helmets being strongly recommended and things like that. I think it would help a lot of problems. We've heard today and go scooters. I love them. Thank you. That's all it signed up for me to close public, for now. We will open public comment again at the end of the meeting and try to reserve some time for that. So why don't you go ahead and jump into the agenda. I'll go ahead and read agenda item one, which is the only agenda item lunch and learn scooter share presentation. And I mentioned being stopped by Kelly read for today. Thank you for being there Kelly. We have folks from Oregon joining us remote Lisa. Thank you all so much and I'm guessing this is Brianna. Hello. Okay, we can hear you and we can see you. So this is amazing. Thanks to our technology team Eric. Thanks so much for getting he's working. So tell us a little bit about what you learned in your pilot, downtown, Portland. Well, thank you so much, for having me virtually really appreciate the experience with chocolate picture as well. Get my screen share going on. spelled are you able to see my presentation so we can see that thank you Department who will be chatting a little bit about more of a little bit about the data that we used in order to discover and and find out some things about scooters in Portland OR user survey data. And so when we first started thinking about e-scooters in Portland, we really wanted to make sure that you scooters fell in line with RP bot transportation. And I wanted to really assess how this potential new option could fit into our existing goals of reducing credit motor vehicle use on our street still expanding access for underserved communities and how it could be a part of reducing air pollution in our kind of solution. Until we ran a hundred twenty days pilots from Late July through late November of last year. We ran a pilot in our entire apartment. We put a cap on the total number of scooters at a little over two thousand and on a two thousand seven hundred thousand mile wish about Friday and underserved communities of 1.6 miles. A little bit about I just wanted to give you a note in Oregon state laws and then city laws that govern it used to bother you. I just come in and some other states. We do have an all-ages helmet requirement for your users. And then we have a Max allowed speed for users 15 miles an hour. So that really informed a lot of what are requirements were for the operator and then for Portland specifically we also have around and use of motorized devices in our parks and so e-scooters as a motorized device are not allowed in our Parks including several. Not being allowed to ride on. So did his birthday is like I said, we have a lot of questions and I wanted to understand how that fits into our goal Citywide. So companies provide availability and trip data as well as let us know about any collisions that were reported to them and any complaints and then we also went out on the street and learn about that either behavior. And we also did a user survey as well as a public opinion poll to understand both how users were using the system and how the general public about it. Lni entry data requested a little bit more to this but it looked at er visits and Urgent Care as well as self-appointed injuries and collisions came to pbot for the pilot. And then Canady books from East Portland where we have a underserved Community as well as people of color in Portland. And then finally, we open any feedback form that anybody could respond and provide feedback to draw the pilot. And also submitted complaints. Missing we put out a report in January this slide summarizes fad 36 page report influenced by what we found is a popular. I think I spoke to a little bit in Portland and potentially reduce congestion as well. We stopped and then users overall preferred low-speed streets and by Queen. Little bit more about that mother on sidewalk writing improper parking and generally and access to scooters. We still have some questions and scooters that has a positive environment. The overall going into the signings little bit more detail 1% of users said that they used scooters for transportation. So they were either going to work. I'm going to school they were going to try restaurants and they really had a destination in mind and any scooters feel bad so bad for them. This is also supported true blue and orange the orange highlights are most heavily used times of the day and days of the week. So you see that on the weekdays Monday through Friday. We see pretty strong p.m. Afternoon. As well as on Sunday and Saturday we see you this afternoon. As well. Turtle are you they're starting again? We asked what would you have done for your last test had a knee scooter not been available. And this is the result 34% of Hope said that they would have driven or taking a uber Lyft or taxi instead of using that be scooter really strong number and the number was higher for folks to wear visiting Portland. So 48% of that they would have taken either a personal car or or right? And then we also learned that he figures in general really attractive folks to the bike lane for the first time and you know, this is not something I talk to Pinnacle used bikes are also typically used in scooter, but 74% of that they had never used before and about forty 40% really never rode a bike ride KC overall biking an hour 30. And then I went into this a little bit but you know 62% of portlanders release you this pilot positively and I'll just add here that those numbers were higher amongst people who are low-income people of color and people who are under 35 years old all those groups South even more positive about the pilot. And then I just wanted to provide a little snapshot of what sort of trick data we gathered and how does informing our thinking going forward. So this map is pulled from a report and it shows some of the most heavily traveled Street in Portland for e-scooters. And you know, that's where we had the most used and then eyes lighter color gets lighter with a little bit more what we really see is our bike Wayne at work really starts to pop out so that North South area that's highlighted is our North Williams and stretch their bus to 8th Street. East-West routes that I highlighted as Northeast going as one of our neighborhood Greenway and Toes looking at where people are riding on this is really in a really supported. The Investments That Portland is already made in the bike Network inside really heartening to see that of course, we always so one of us for this until we know that folks are likely to be riding on the sidewalk in the section into his can really help inform and prioritize where we should be making additional. And then I mentioned East Portland area or underserved overall in our transportation Network and we have requirements for the company is to place at least a hundred scooters in Portland every day. And so we can see that on the left side of the screen has really start to drop off a crossover in for a boundary of this Orange Line. We thought you figured you'd pick up again and overall we have 44,000 trip if you if it is available and they are used in an even contact for we have maybe less bikes infrastructure. Then we do downtown and it really is also Transportation overall. So we asked for lenders after we put out the front porch and as we were thinking about our second pilot, what do you want us to focus on what's your next step be thinking about bringing you into the city of Portland parking citation, you know some of our communities of color is that they just didn't know how to use this figure that no one ever heard from communities with disabilities that we can have more accessible scooter designs. adoption I'm glad we're bringing is this new pilot? We actually just started our one-year pilot in April if I'm 26 heard from portlanders and what we've learned in that first Tyler. So we're going to have our city parking enforcement staff Trailer company is very similar to how we do it Sparticle. You know, it's not a ticket left on the windshield because probably no one's going to come back for that, but it's going through. We're also going to do you have anything requirements that we have? No snow parking zones and no writing Zone switch require different things of companies companies are required to use their ass if they go through underwriting Zone and then they also required to prevent users from ending a trip and I no parking Zone. And operational size. We can really understand again what what the net kind of benefit might look like for this And then lastly definition portlanders ask for more safe places to ride and so we built in charges to book companies and the funds allocated parking places for E Scooters as well as taking pictures such as like wings or other neighborhood Greenway. Apartment. I queried are emergency department visits through emergency department visits that we're likely related to an Executor injury and increase with the introduction of scooters at the end of July and it speaks in mid September or so and came back down to pre pilot Levels by the end of the pilot for the end of November. Since we have reached out and we're finding that this is a similar method used in other places in Austin, for example, I use a similar approach to identify injuries. Next slide to see some of that and this is this is something that I think we're across jurisdictions, but one of the things that take away is for me, is it of all of these injuries? Majority where is Istanbul like a single-party crash or a pattern holds across jurisdictions, everything north of 80% of all injuries were due to a fall rather than a collision. a couple of other 400 take away is that we weren't able to gather very much information on helmet use that information was missing from both tumors Department Records. And I think in the range of 10% of the records has some evidence of intoxication. Overall, I think we we try to emphasize that transportation system has been zero. Great. Thanks Brandon, and I'll just note to that in our observations low on on how that you feel better all. I'm almost done here. Just just wanted to give you a sense of where is overall dress in January. And then sometime we were drafting new rules a new permit application for companies to apply for and we just launched her second pilot really understand. What is a full annual cycle of this look. Like how does your behavior change if it all the more time to test out these new management strategies and then next year in 2020 will be taking recommendations to our city council. And then I just wanted to include our contact information and we do have a website and a report as well as data that's available to download from. Thank you. I've been in bed and so much for this. It's really helpful to get an overview of where you are considering that you're you know a year or so ahead of where we are a couple a couple questions if that's okay, one of the things that we heard in public, today, and we continue to hear is concerned about parking and so I'm curious appreciate the safety data on users. What have you seen as far as a response to parking and in the original pilot was there were there fines or over there? No fines and you just added those in the last month, and I know it's pretty early but if you see any Behavior change their Great questions. We didn't have a fine for users in the first pilot. First four months. And so what we did is we had Skype out monitoring and educating users on proper proper parking and then we really worked hard with companies to educate places where to park until we've added a new measures into his Pilot such as you know, we really I think a lot more communicative on on where precisely were saying so scant park. We not only gave those so she opened saying but we also gave geofencing or bus stops that are in our downtown areas. That was one area that we we saw An RC car and Max. For I'm so really wanted to prioritize parking complaint for a relatively low in in relative to the other assorted issues that were highlighted with number one being folks reporting a helmet and the second one was reporting writers on the sidewalk parking was actually fifth or sixth down the list, but when we talked to our community that was one of the number one concern that they had even above sidewalk writing was about illegal parking. This question might be for Brandon on the the slide showing the rate of injury the number of injuries in the graph drop off as the as we head into the wetter season, but I'm curious does that also reflect or did you find a declined over time as people became more familiar with it? Not sure we have a clear answer to it appear in two and a gradually decline over time. But I think it's something that we want to explore in the current pilot again to see if it will receive an artifact of the data or what but there may have been early on in the pilot. Mmm, do you have data to compare it to other modes bicycling or even cars as far as injuries per 10,000 miles are 10000 steps have I like to see scooters? We don't have comprehensive information on the number of trips or the amount of travel to taking place on by other modes, maybe with the exception of Transit. We can't really make an apple to Apples comparison, but we saw that. I'll be there about twice as many injuries for 4 and we would expect the number of bikes have to be probably several times higher. so closest comparison Colleagues do you have any questions of our neighbors to the South? So thank you so much. I really appreciate the opportunity. I'm looking at the screen out of the camera. Thank you so much. I appreciate the opportunity. We have been working to try to get this multi-modal option here in Seattle for a very long time. I think with the intent to make sure that as we have more people using alternative types of transportation. We are then able to beef up as well people who may never by also see the importance of having these protected Lanes as they jump on scooters to get to places of work or to go grocery shopping. I use them in Washington DC with my high heels on to get between meetings use them in Portland when I came down in the new bridges that you all have that connects the city across the water. It is incredibly important asset and I want just want to see if you also want to comment on the momentum that you have seen provide. When you have this additional alternative transportation being scooters to the queue of options for your residence, how have you seen the call for protected bike Lanes in corral and greater pedestrian safety, especially for those with disabilities. How have you seen that all kind of culminate to actually push for the at protected lanes and pedestrian safety that many of us have been asking for for years. Yeah, I think that's a really good point and we only ran a four-month pilot. And so this and I would say over. All right, the only thing about a year-and-a-half old since when the first Hooters lunch in Santa Monica, California so ready for that day, but that may just be because this is a new group of people it's at but maybe we're driving or maybe taking Uber and Lyft primarily to get to where they needed to go. So we have certainly heard from communities who don't feel ready to hop on scooter. They want to see that bike infrastructure first before they feel like this is something that really can work for them. So we heard that pretty strongly At the same time we thought I was taking these Portland Community continues to embrace each time and how that may or may not manifest himself in another advocacy kind of constituency. We certainly know that and I didn't mention this but but where we went out on in Portland and took note of where the highest sidewalk writing and since it's were were the areas where we didn't have and where areas that we had high speeds. So if fever over 35% nearly 95% of people were and that alone I think tells us that we need to be really thinking about if you don't have baking soda structure, that means that everybody is sharing the sidewalks and That doesn't mean a great experience for for any of those people especially people with disabilities. And I asked him a question and we'll jump to unless you have another question. So in Portland, I see on your chart here that you do have a helmet requirements and inferior reason. We have a helmet requirement here in Seattle as well as I never wear a helmet when I wear my personal bike. I do wear a helmet because I go can go a lot faster and you know, it's a little bit more of an aggressive rise and when I'm riding on a bike share and I think it's a little bit more leisurely. I have you know, multiple bags like I did the other day with my workout bag as I think the big question for me though is what I was in Portland. I didn't put a helmet on and I was writing and having a great time because you guys had protected Lanes. I felt very safe. Seattle and not wearing a helmet on a bike shares. I've never had a problem with pulled over by the cops and I'm a fairly light skin she, but my staff member who was a woman of color indian-american when she and her friends went out to ride on the bike share. They got pulled over in the South End the cops pulled him over and the guy said I never want to kiss you riding a bike in this area again, which there are no bike Lanes in that area. So the only place for them to have written safely was in the street, which is something I do every single time I jump on a bike share have you seen incidences of increased on citations from individuals who are trying to enjoy scooters use them as a multi-modal transportation option. I'm disproportionately at seeing citations for communities of color because of this helmet law and let me also know I do think that we want to protect people say Z but without Without additional bike infrastructure. I understand why it's important to have a helmet law. I'm also not interested in putting in additional policies that made disproportionately affect communities of color. Yeah, that's the way I mean. I think we have the same concerns around enforcement and are you know but I'm fortunate that they do not increase then person. That's a problem doing it really is done by our parking enforcement officers. So it's either Piedmont staff and monitoring will be done by our regulatory staff police officers by Portland Police for my understanding hasn't been any concerted effort or in a while again, we heard from the public that's that lack of enforcement was a major concern around how we How we encourage people to follow the laws? And so what keyboard has done to to try to get at least a parking pieces and around sidewalk riding is to survive. One last question about the pilot. Thanks again sisters in Mesquite at your pilot. I didn't catch and remind me was it restricted geographically to a certain section of Portland Portland open star is more than Equity distribution that is accessible traffic city, is that practice if we are to do and when we do a pilot project it is critical that we don't limit the placement of scooters geographically because I think there is a disproportionate impact. Visuals were to use it as we hoped they would if they park it outside of that Geographic limitation for people to then decided especially in areas of North and South where we have had members of our community who are from communities of color. I don't want to see the same thing that happened to our jump bike situation where people are getting fined $25 for writing at home as we want them to do. If you'd better in my opinion to have a pilot project that does look a Citywide so that we don't have that disproportionate impact, especially in communities of color. Thank you for the invite representatives from bird and lime to come on Ford and Brendan. Thank you so much for your time. I don't want to take too much of your time. But if you're free to stick around for these presentations, we may have more questions for you, but I totally want to respect your time if you need to go. I appreciate everything you've done so far. Thanks, my friend. I should mention I failed to mention that we were joined by counselor to take out. Thank you for making up here and introduce yourself a good afternoon. John Hopkins any Country Fairs for lime break want to give you a chance to talk for just a couple minutes each tell us a little bit about your experiences elsewhere. Feel free to comment on what you heard about and learn in Portland on any thoughts you have on some of the public comments on the sure. If you heard them today that I can tell you they're consistent with what we've been hearing other outlets. Yes, definitely consistent. I think what we're seeing a bird, I'm probably at lime across cities in terms of both the enthusiasm for the benefits and also concerns about some of the potential downsides. I really appreciate the line of questioning about helmets and selective enforcement Equity, you know, Texas and other jurisdictions in America had actually repeat They're mandatory helmet laws because of the selective and unfair enforcement that they saw I think there are better ways to get more compliance with helmets. And in fact bird is working with the UCLA Medical Center researchers on that other report that was alluded to earlier on how we can move the needle on helmet use through various incentive programs. We provide thousands of free helmets, but we can and must do better to see those rates go up to 10% compliance rate in Portland is actually on the high side compared to what other cities are found and I think we also might agree that safety is is much bigger than just helmets Right comes back to infrastructure comes back to Rider Education and counseling bro, Brian you had that great question about you and do we see rates of injury decline as people to come more experience and I think the answer was no maybe a little bit in Portland on the CBC Austin study that was released on just last week found that in fact a disproportionate number of the injuries are occurring among new. People who've never been on a scooter, you know something like a third of the injuries. They saw in Austin We're to need a ride or so that tells us that we need to do more to educate New Riders and so working with the researchers were working on new program so we can do an even better job if you know the existing an app online and in-person education that we're doing are there may also be some operational parameters that we want to look at for beginners that make it less likely that they will be involved in a in a crash. I think it's also true that among all of the studies that we've seen from UCLA Boston TDECU. No birds Island Study where we found the variable injury rates between cities depending on how good their safety infrastructure was so I think you know Seattle already doing a pretty good job compared to other cities rolling out bike infrastructure. I've heard today a real urgency to do more and in and we must do more but I think you know that the bike abilities you've already achieved I think Goes well for scooters, but really all these studies going to prevention write. These are preventable injuries Now is really the main takeaway from the CDC study. So I think the question for operators moving forward and cities as well as what are we doing to operationalize and apply the lessons that are a blimp and learn from these studies as the studies concede we have to do a better job of injury surveillance and in comparing injury rates across modes, and if I may just quickly before we move on or is are quite a question, if we're going to we should absolutely include cars because the number of cars that I see parked in sidewalks. The number of cars. I see parked in bike Lanes in the number of cars who are hitting and killing and injuring people of the injuries that we've heard of or that I've researched from scooters. Let alone Bike Share so I would love to if you're going to go down that road make sure that we also include that in there. That's an excellent point. I could have made it better myself as the safety person a bird and I think you know what the date is also telling us that those those more severe injuries as you pointed out are coming from motor vehicle collision. So even if some of the single injury Falls are happening those do tend to be more scrapes and abrasions versus the more critical injuries on the other two deaths we've seen on on scooters the date. I'm almost invariably they have involved in a hit-and-run drivers in a drunk driver is reckless driving. And so I think getting that in check his key from the earlier testimony, we also heard I know big concern about sidewalk not obstructing the public rights-of-way particularly for disabled individuals elderly individuals because it's more than just a nuisance issue, right? It can be a safety issue if it's not addressed and I'm very proud of how we have lead at bird on addressing this issue from exemplary Rider Education to active management of our fleets, right? We actually employ people whose sole job it is to go There and you know if it's scooters tipped over pick it up move it to where it belongs to pay special attention to Ada issues ramps a wheelchair access and we actually have four system on a writer. So if a rider is is doing this we ban them from our app. There are consequences. We are finding Riders if they are repeatedly do this sort of thing and our detection in are in a pin for is Ben is getting better. We talked a little bit about Geo limitation, you know, we're getting better at preventing Riders from engaging in those kinds of behaviors that do abstract rights-of-way. I think another key thing in this is what Paris is not letting you know Paris is really amazing right now is scooters, but designating parklets, right Paris is about to roll out 2500 new designated scooter parking areas, mostly car from car parking space, but also from underutilized face elsewhere that's not you know, blocking public rights-of-way, but you have to provide people with that space to park. So that's really a critical part of the solution as we improve our Rider Education. Active Fleet Management and automated enforcement. Parklets in addition to the Corrals. So parklets would be dedicated parking spots and Corrales will be on the sidewalk in areas that are outside of the way of pedestrians are Wheelchairs and allow for people to know exactly where they should Park the scooters and bicycles all the above different different cities have different nomenclature. But really the main the main strategies that there are working, you know parklets in the street and sometimes those are also called Corral's depending on the city, but then the other stencil parking that's out of the public right-of-way and the more you can put these parking bays and areas, you know on the curb in the street the better because that's part of his phone. There's this relationship between infrastructure and rates of sidewalk writing and the rest and so, you know being being mindful in that way, but also just want to come back Yaqui because we know that there's this connection between infrastructure and equity and you know, very encouraged to see it being touched down in the public testimony and also in the questioning let you know historically neighborhoods that have been underserved new black and brown neighborhoods low-income neighborhood those individuals much more likely to live and travel on streets that are deficient by Design and sew as we look to scooter companies and users and the city to improve and fund infrastructure improvements. Let's target those improvements where they're needed most in where they will have the most impact. We are excited as we've been another city to deploy scooters disproportionately in areas where people do absolutely need that access to Transit where they are captives to Transit because they don't have cars. I think it's true that 16% of Seattle residents have access to a private vehicle to most don't you know, but if we're going to make good on that promise, we have to provide the same structure as as well. Did you jump in a promise DMV employees? You mentioned are they independent contractors or employees of limebike? I think there are bird watchers are our first full-time Personnel. Those are people we employ they're not contractual workers are Chargers are most often independent contractors. It's also true that in in May cities. We are we are moving away from that model and moving more towards on dedicated personnel. Tell the ones you jump in if you want to dress that question first Ninja Jump in to operate currently with bikes and everything else out to ensure compliance in quick responsiveness tissues. We find on the street, but there are the independent contractors to the intent is not for it to be a full-time job for anybody but it's a way of getting additional income because it's fulke's no matter what part of the city that are both able to provide better Mobility for the neighborhood and also make something come off of it. So if somebody is charging a scooter it takes about 4 hours at night it cost $0.25 and out of that $0.25 of cleaner to evolve Grace Seattle City Light energy. That's about 25 miles of mobility of for somebody that I stay and somebody who does that gets four to $20 for every scooter. They charge and sew in Portland in Salt Lake City and four to six months. We paid a quarter million dollars out into the local economy, and I'm like paying for gas at the gas station most that money leaves the local economy and to pay for Value the side elsewhere, Flutie. Community this is all clean and all the money stays in that local community. Just on the the recharging model. So when I did a mini-vacation down to Venice Beach, California two summers ago was my first time riding a scooter and loved it. I did see people bringing home the scooters to charge them up. Is that a model that's used every company and in each city, right people only get money for recharging a vehicle if it drops below a certain level, there's kind of like a shadow World version of rap the underwear that you are the vehicles that are low suddenly pop up on the Chargers at the juicers. We call them and then he doesn't come bird watchers or Chargers. These were a fruit if you didn't get the cheesiness bed. And so yeah, so then they only get money for that if they're taking a vehicle that is a deficient charge that it showed up on that app. And if they place it in the prescribed Zone appropriately inappropriate, we parked the next day so it encourages compliance and it also means that The cityscape is kind of reset every day unlike unlike the bicycles. The scooters are set in hot spots, but we will just want to put a plug in for future conversation as the chair of Seattle City Light on one of the things that we're trying to do is encourage charging it alternate hours or no not high peak hours. So if that's a model that you use used in other cities, I'd like to chat with you all about what that chart recharging strategy looks like so that we're balancing out our energy overwhelming. So thank you Jonathan. Do you want to go if you want me to spend a few more important points is mission is to read a map to reimagine urban life is wonderful ability as an urban planner cares about getting people out of a car's. That's really exciting praise. So we wanted to talk about this. I think there's a Deloitte report the Matt early this year. There's really a kind of fascinating very balanced talks about a lot of things but what it leads with a small is beautiful and comes from a quote by an economist 1973 saying that we've oversized everything and can't find it. Right. He said is that is in their system to purchase a small that's where it applies. I think the question is does it apply to Mobility the data from the last year would say yes by bringing in small scooters that people enjoy your bill to double the amount of people in the country. They're using shared mobility and in just one year. We've exceeded 10 years of efforts on shared bike infrastructure and up for a total of 84 million trips. When we did this in Portland is also very successful city of 6000 over a hundred thousand individual users different unique users on on our system reduced car trip vehicle miles traveled by 200000 with the combined bird was there as well when you combine all the data and recognize that 34% of people in Portland would have been in a car if it hadn't been for a scooter and 48% of visitors. We get 40 million visitors in Seattle in Carrier that that has a big impact as well sitting lots of fuel and 60 tons of CO2 emissions. So I think we'll talk about where we are at think a lot of data that might show is very similar between us and bird. So this is the day that we had available but it's pretty descriptive the industry, you know, where over a hundred cities around the world. We're launching Spokane on Monday the other Pacific Northwest cities coming in the coming weeks and months. We reach a lot of people in a lot of different places over 50% of our at 51% of a household's make less than $75,000 a year. But the average income in America is 81 34% make less than 50 find that the economically are ridership fairly. Well mirrors the Amazon distribution a city there more people of color writing than there are 36% people of color design 25% of Americans and more women Ride Scooters going to ride bikes 20% of our trips. The last trip was to 30% Nationwide reflecting similar to the Portland data. Is replacing automobile trip and that split evenly between personal vehicle and ride-hailing we look at Mexico City. For example that public transit connections huge and we're a big fan of it because that philosophically the Lions game space saving 40% Can I get the transit the last week 64% in the last month? 57% of our users Nationwide have not ridden a bicycle in less than 6 months. So this is craving like the city of Portland pbot said, it's complimentary there's overlap. What is complementary or inviting a lot of people in the don't already use a system and that store sells Argos increase people using infrastructure in Portland. 70% of people have never used Portland Bike Share and 45% said they never use a bike to get around with a bank via cities in America people overwhelmingly prefer protected bike lanes for usage when people are riding on sidewalks the real reason they're doing that is because there's no space created for them. And so we let this is I think one of those big pieces of what I want to convey today is when we really want to solve these big hairy problems about congestion admissions getting people around better. It requires really good partnership week and I'll put everything on the CNC saw this is a committee can't to come you can't put everything on the company since all that. It's actually solving it together and we'll show some examples of good partnership and I think maybe it is appointed. Actually. I want to start the outside for the council's interested in this and finding new ways to solve problems and micro Mobility thanks to pee but they've demonstrated like one of the best pilots in the country and create an absolutely great. And thanks now to the mayor hot for her interest in doing this as well because this statement is very true again from the Deloitte study an ounce of practice as gently worth more than a ton of theory. That's why I say run the country doing this pilots and some of the best practices we see from those we'll talk about now when we've mentioned sustainability and all the CO2 save for a wide. We also care a lot about Equity Portland had a required minimum out of vehicles and low incomes. We are fans of that. We support that 34% as I mentioned to make less than 50,000 if any of somebody's part of a low income program and Edward has a similar program program C K State Federal and they send a picture of some proof that they're on it like last night work a Lyft or housing vouchers of some sort, then they get half off 50 Cent's unlock 7 cents a minute. That's more than half off to ride our vehicles and we recognize like we look in the Rainier Valley. There's not bike Lanes down there. There's no express bus service Express Bus Services North how do we solve these gaps? We don't know of many industries that have these sorts of equity and some of them self-imposed Equity requirements to solve these problems, but we think it's a requirement. It's a sexual and so that's why I want to be good partners to the city to do that. If people, you know, 16% of people don't have cars and say I don't use a car you can save 64% if you combine scooters and Transit, we're big fans of that. We're working with Metro on stuff as we speak trying to figure out. How can we can sell Tom's another piece about safety and good partnership we lunch Monday in Spokane. Spokane parks department wants to host scooter tanks because remember the data says it's a little bit more dangerous when your brand new just like riding a bike. Will they want to host scooter change will be the trainers. They'll be the host. That's good Community Partnership in Portland. We're working with a Kalashnikov music color the 16 different equity in groups represent represented people of color and some groups focused on climate change that have inevitably impact we're working with him to get information out of slime access program help people in training so they can safely ride these vehicles. We heard the missions that pbot had earlier. That's how we saw this again working together as part of the community parking. It's again collaboration. We see Corrals in different places where I agree with what Paul said about Krauss on the street or a little bit more helpful at all ready in case it shouldn't be on the sidewalk and some people write it off the sidewalk to get to the street or just stay on the sidewalk. We soften the other data when people already on the side of its front of me Ledisi just don't feel safe on the street and that's why it's imperative that we could get infrastructure and we saw Portland there are I think this is an area we're looking at rental cars actually make sense. If if I drove a rental car and if I spend in it and never liked the the ticket always went to Avis, like maybe people would speed more but the ticket comes to me and so I think it's really important to we care very much about making sure these vehicles are not in part front of people with disabilities or people who are blind but we have done a pretty good job of figuring out establishing norms for cars over a hundred years / 2/3 of a stop focus on working on cars a bunch of people in the police department. There's a bunch of rules and there's consequences both good and bad for what we do. And so we know how to solve these problems. We just have to to do it until it delegate the space. We've inexorably invested in car have a structure. So we have to over-invest the salt that cap to make up work or else we'll be stuck in the same position. We are now which is not being climate goals and not getting as many people as car so we could so Portland again partnership in collaborations of the Seas is really work. I'm going in most nurse. He's talking to Transit agencies Cubs. Those could require like a lot of infrastructure investment that you can do microvilli hub for the cost of a can of spray paint to identify. How do people do that with first and last name of connection that we know that 72% of or so residents have access to 10 recap frequency Transit. I was among those who can use a scooter you can take that number to close to 100% by just having scooters available throughout the city because we know that Metro is not able to increase the number of us has best drivers whenever else to the degree that we have the money to pay for. So this these are examples of how we can all work together. I think a lot of this is kind of high like that and we're very eager to solve problems as good members of the community. Did you have a question earlier? Thank you for the actually I was one of the people included in the helmet. So thank you cancel. Brian's point about the need for a safe infrastructure because I'm living proof of that providing that infrastructure in the need for it. It is really not just in portable scooter usage but also for bike usage and so forth have you and this is building a customer must have you seen another city is the momentum just with the ridership and Lee Services just momentum building for infrastructure being built. So I think in Tacoma near Woodards almost went to Denmark Copenhagen came back and saw scooters in 2 weeks later scooters for lunch then, because she said we have we're building Structure but for me to build more as a mayor I need people on it and in the nest protect everybody when we build bike infrastructure safer for the cyclist are the people walking and people driving cars. So we've seen that in a bunch of other cities that I work in where you wouldn't maybe expect amazing bike infrastructure. They are finishing their bike master plan dinner. So excited to have people out on it. So I've been in the shop about 4 months. I don't have any we don't have that long County Schools been around for just over a year. So but but we're seeing the excitement in their people using if that purpose your question was very similar to a topic they came up this morning at the downtown Seattle association meeting where we were talking about the perennial chicken-and-egg problem where you can't get the political. Will you you need to get the infrastructure done until you have the numbers of people on your side and with scooter riders proliferating in so many cities are out really seeing a Groundswell of new political support for the kinds of infrastructure of forms that we need to keep people safe in Baltimore Racine. In Washington DC. We saw this last week. There was a tremendous event a demonstration after a bicyclist was was killed an activist actually and a new completes refill gaining momentum in city council there in Washington DC to make these kinds of safe infrastructure improvements. Absolutely mandatory in New York City the city council members who are leading on shared e-scooters are precisely those in transit deserts serving underserved communities who have a few bike Lanes in their District already, but they want to see them use more often So Cal summer saying we want to be first because we see e-scooters as a vital link to Transit and also a way to continue reshaping streets so that they are are much safer for particular those communities that have unjustly been been burdened with unsafe Suites for so long. I'm so excited about today. Thank you for we have gone to Tacoma just to use scooters for at you know, a afternoon before going to a concert down there use the scooters read that it was such a great day. I've done that in DC as I mentioned to get to meetings. I've done that in Los Los Angeles and the fact that we have Hills here should not be a deterrent. I have written up these Hills to City Hall on a scooter and can get up the hill faster than I can on some of our electric bikes even partly because I can put my foot down and put things that is very exciting about this is we have this in a quote. Of Maximum constraint, which is frankly yearslong, right and ideally it would have been nice. To have these scooters prior to the tunnel opening prior to the viaduct to going down to the people had alternative options currently have a crisis with the last mile concepts of people not being able to get two buses and to your point even in some of our communities, especially can use the color. We haven't even created rapidride yet, but it will be coming. We want people to be able to quickly get to these bus stop so that they can get any dedicated Lane to come to work if they're going to complete the rest of their commute by bus and also if they do want to ride at electric scooter scooter or take their bike and get more comfortable with the road infrastructure that this becomes an entree into that. So what am I questions? It's just about the time frame that we're talking about, you know, you mentioned two weeks in Portland. I think we started talking about this three-month. Well, you've been talking about this for a long time, but I didn't we started talking about this two months prior to the. Of Maximum constraint earlier this year and we're sort of told you let's just now Possible. We also didn't have the legislation that was passed and I want to thank our colleagues at the state legislator legislature for passing 1772. And we spent a lot of time working on that legislation as well. I was very interested in making sure that that passed this year and spend a lot of time on the phone with our friends in Olympia. So appreciate the work that you all did to come around on some of the Amendments and now have a blueprint for what it looks like to create a safe Network or a safe user experience. I shouldn't say Network because our network of bike infrastructure still has a lot to be improved actually make sure that our vision zero goals can be accomplished but we have a blueprint for how to make it safe. So two things one. Can you tell me how fast have other cities actually stood this up? Because two weeks is very impressive versus the 10 months time frame were currently talking about and have other cities gone through this environmental impact assessment that it sounds like some lady calling for have they had to do an environmental impact review prior to launching something like this. Have a great question counseling rescued I think. We know a lot of the there there a chance could you mentioned for this with a specter indemnification safety efforts and everything else like that Ogden Utah launched into three weeks. Spokane to Tacoma in 3 weeks. I don't know the timeline on Portland but a lot of places of turn this around quite quickly and we don't have to reinvent the wheel here if if we wanted to do best practice language on some of the rules of outside like right now dance like that. It's the same in almost every city and if we want to be Innovative and do good Solutions and just copy Portland on the incentives to innovate they'd already did it for 4 months their values as you heard or very aligned with ours and it is actually quite amazing within respect with respect to the incentivize portions of their code that we need to cure sidewalk writing you guys can get more benefits if you have innovations that reduce it or parking and there's a lot of collaboration there. An ounce of practice is better than a ton of very expensive hundred-thousand-dollar studies. They're going to tell us the same things that every other city has already told us. I don't think there's need for that and every day that we don't have this or every day that we just have 200 scooters on the ground instead of 4000. Is it your people taking car trips polluting driving and not doing other better things they could not writing Transit more and everything else like that. So if if we have the same sort of emergencies we say we have about climate congestion taking care of people in an equitable way. This is an aqueous solution then we do it tomorrow, but it takes that level the urgency or else we'll be stuck in the same situation. We've had to get us as soon not situation and I'm traffic. I miss you Portland. I just left I guess scooter companies have been able to really push timelines and and get started on the ground so quickly, it's it's remarkable and I'll give them time to really be thoughtful about regulation about what Seattle wants what Seattle needs in order to make the scooter pilot successful because ultimately You know, wait, wait what shadow means? I think the people of Seattle and and you all are as his leadership, you know that a little bit better than then the part of business. So he'll make sure that your pilot works for for what you need until you can answer your questions there. That part is on his way to going to take the most time. And so far first time we did that in two months and had zero public engagement and that was really hard to start that pilot without any public engagement in the second pilot. We took 4 months to to engage the public boat on what we learned in the first pilot and then what we wanted to change and I still hurts him a lot of community groups that that wasn't enough time for them to properly engage. You got that would be my insurance on how long to spend. Thank you. I appreciate that and we've It's part of our budget last year. We actually do the statement of legislative intent for a real estate apartment to start doing some of this engagement. Not just about scooters. All those is the highest-profile one, which is generally you know, I don't know you all probably have some secret technology. You're not telling us about that's ready to roll out in a year cuz you never talk about things that didn't really exist a couple years ago. And I imagine we're not done in the wedding and how do we use a city have the infrastructure but the physical infrastructure but also the the capacity the institutional infrastructure to allow this technology to continue evolved it will give us more Mobility options. I think I think another place where Seattle and Portland shares wanted to get broad Community feedback and balance out with urgency for both know what he needs, needs and how to do that pretty quick. On that point, I would love Portland if you were able to share with us your 4 month public engagement process that might be helpful for us to look to take a look at it to see you know, what the strategy was. How many meetings should you have where did you go earlier targets that might be helpful. And then you mentioned the Community Coalition from communities of color. We have a number of us who are coming from Queens of color who work specifically on Transportation. I know with your office a lot might be interesting to see who was part of that Coalition in other cities and then who we are currently working with an I take this up with some of those discussions. You talked a little fast. I think I talk fast. So I make sure I understood one statistic. How many people did you say here in Seattle do not have a car like what we're doing great work. / can you Seattle my last place apparently any final comments? And then I want to open it up to the public, to keep their people that showed up then we're here for the beginning, but go for a couple minutes station around data and the earlier presenters from Portland. And if you all want to try men still that be great and if you let you know, looking across cities have anything else to add I think it's important for us to sort of clear any misperceptions around with the data actually says and I wanted to offer a few data points to build on some of the earlier presentation in a lot of us have looked at some of the Information about injuries and if you look at it just on the face value and you don't actually understand the issue or don't want to understand it more you can walk away thinking that yes, there has been injuries associated with the scooters. But the reality is if you look at the gym in network emergency department in missions that the study that looked over a two-year period and Los Angeles reported by Mother Jones and others that there was extreme danger. The reality is much more complex while head injury is a common injury associated with riding a scooter the majority 95% were minor head injuries and the majority of the injuries overall were minor enough not to require any ambulance Transportation. Also, I think importance is that almost every single person injured was discharged to go home 94% of the people were discharged to go home with 73% of those who were in and out of the emergency room it within 4 hours. And I'm at hashtag hashtag who has summarized some of this data and has provided it in a way that I think helps to pull the layers back on what could be misleading data if you just where to look at injuries or admissions to to the hospital the first time I rode a scooter in Venice Beach, California, I wrote it right into a garbage can and then realized I have to hit they break a little sooner and going to let off at let off the gas faster immediately. I was back on that scooter. I had a tiny little yellow scooter electric, but having to have that muscle memory come back and just get used to the new function takes a quick second. Somebody earlier talked about writer education and you mentioned some of the programs that are being publicly funded. Can you talk a little bit more about the actual data behind some of the statistics around injuries? And then I have another staff. the most important things to point out as a lot of the what I would call slightly more alarmist articles about this will say dramatic increase in scooter injuries, but you know between 1800 and 1918 30, right? So that that's not really necessary the measure it's it's really about exposure and rates. Some of the best stuff is going to be looking at the actual Hospital intake by Diane the article last night. Now there's a quote from Salt Lake City saying dramatic increase but the Salt Lake City Police Department took police reports going to reflect incidents that were major and they found a sex effectively the same rates per month of injury of people walking biking and scooters. I think the number for like eight seven and eight right, they're essentially the same average per month we heard from Multnomah County which has looked at this very softly and they said specifically we do not see any reason not to can you tell me this pilot that said just like every other aspect of this to me to work on it, so it's a great partnership and When the cdc's allowed to do their work, you know looking at okay, what are the causes like targeting those with good policies and collaboration like Spokane Parks garbage can and so that's that's an opportunity to collaborate, but we can reduce some of the some of the risks and then solve these intractable problems with invisible solid yet. Yeah, man, I think the Portland study was instructed them in their their conclusion. If I can remember the exact quote was we found no disproportionate risk associated with the scooter used. And so I think it is a test we heard, you know, there's still more work to do to situate The Raid with other modes of the cars as you pointed out council member but I think you know what we're seeing are in a preventable injuries. Nothing out of line that will be seen with bicycling and you know, I was talking with John McDonald yesterday at Portland State Vikings have been under-reported and scooter injuries are really under the microscope right now because it's a new thing but we can agree that one injury is one injury too many and so, you know, dr. Turok for Betty UCLA Medical Center who did that to Emma publish study said that they did find, you know, 15 of the injuries over that a million-dollar. I'm sorry. I wasn't more like three million scooter trips actually if you combine the data. During your study. Between what the different operators did so an enormous number of scooter trips done in Santa Monica and Westwood during that. They're only 15 of those injuries over that year. Of millions of traps required more than you know, hosking of hospitalization, right? So so as you pointed out council member most injuries minor most not requiring extended hospital stays, but all of us subscribing to Vision zero really must end end and can do better I think one Portland had a similar experience with ambulance rates a little bit higher here, but 13% of folks represented in our study were transported to the hospital or emergency room. And then you know that 83% of our injuries here happens of the assault is that we know that those injuries are happening at a speed of 15 miles an hour or less. And so when we know kind of the statistics around people being more likely to survive that sort of Crash versus a car car scooter crash which feeds you know, something that we should take into account. Is it just the speed over all of the vehicle? I was just going to say 4 years ago. I sold my car and probably one of the best decision I ever made. So I'm one of the 16% that we speak about and The eye and I can't remember what I said when I first saw the car, I thought to myself I'll keep going for as long as I can and it just the city started making more more more options became available reachnow car2go John limebike and so forth so is scooters. I feel like this is another opportunity to another option to continue my lifestyle, but I also think this is really where the work of, Brian and cousin about the importance of the infrastructure and the momentum that's necessary because it's like the old adage if you build it they will come and so, you know, I really want to emphasize the point of how how not just this option and this this mode of transportation potentially can be beneficial in terms of us building aluminum continue the momentum to be more more aggressive about building the infrastructure that will be necessary that for myself, but for others who don't have a car or would like to give up their car and being supportive of our climate action goals to move forward, so One other note if I might but soon as you mention the CDC that you have from the CDC related specifically to scooters and traumatic brain injury because it just sent some data points that she would love to have shared the CDC reports that 26,000 traumatic brain injuries are sustained by adolescence and treated when dealing with bites but let's compare that and that's nationally let's compare that to what happens when you are in a traffic accident 500,000 half a million people per year. Who's the same traumatic brain injury. So let's do you know, that's all for this in perspective back to the first item that you mention. I'd love to see that David is actually make policy according to facts and you know, the Your point about the extent of traumatic brain injuries that are sustained by motorist and passengers is is shocking write a week and a half million end. There's a good case there for car helmets. That's one of my favorite Twitter feeds actually is car car helmets and I think really that's how much we know are part of the you know basket of Safety Solutions. It's I mean, I just love the focus on infrastructure and also operators, right? We do have a responsibility to manage our fleets, you know, constructed maintain the most durable and save vehicles in really mind are operating parameters, right like you keeping kids off scooters, you know, where kids are supposed to be off on on on scooters, you know, a lot of the epidemiologist who been looking at Scooter related injuries for many years. Every paid a lot of focus to like the extent to which you know kids are on high-speed private scooters, you know, and then that's something I think we we don't want to see absolutely right when we talked a little bit about speed and and and the need to mind that as a risk factor if it's too if it's too high, so I think the bottom line for us is that you know, right a responsibility operator responsibilities in concert with cities, you know, we can actually make real progress on Vision zero my favorite Staffing the Portland airport was the other 34% cartridge replacement rate for scooters in a flag that has a safety benefit. Right? Like we know that when we're replacing cars, we're actually making everyone on the road more safe. 40000 motor vehicle deaths, I believe Countrywide in 2017 you could imagine if there were 40000 deaths for a whole host of other things how rapidly we would respond to that and I appreciate the focus of safety on on this mode of transportation cuz it is important not saying that that's not but we for whatever reason seemed to be comfortable with the the injuries and deaths associated with automobile vehicles and we can hire to that we're going to be much better off as we shift notes and really pay attention to how we do it safely to. I'm going to be okay going to Pivot the public comment and just invite folks. If I don't know if anyone else is signed out that people want to come to the microphone will take all the comment for a few more minutes. I was going to be attending are you folks are welcome to sit here. You can move to the audience. It's up to you have a conversation with Scott. So again, thank you so much for sticking with us. You're obviously welcome to listen to Republic, to really appreciate it and we will certainly be in touch with you and all you've done in Portland as we navigate what's next for the city of Seattle. Garden say it like to be a public comment. Come on for two microphones. List queue up and do it this way. If you just say your name for the record, my name is Jessica and I'm the founder of Smashbox. But I'm also a bicyclist a pedestrian in multimode user here in Seattle. I want to say thank you for bringing these these these here to Seattle on what's going on throughout the world. I wanted to say that I am in favor of scooters. I believe that this type of new Mobility helps to reduce our carbon footprint. It's affordable. It's a healthier option versus driving a car. It's fun. I know I can't remember was saying that she actually uses them in her heels that's super impressive. And also it's faster than traffic. I was just in Portland where I had the opportunity to ride my bike and I rode on the Tilikum crossing bridge, which is a zero. Car and I noticed that along the Waterfront that they had signs that said no scooters and that this actually might be part of the reason or the correlation to why there's been a decrease in people using the scooters down. There is busier limiting the places of where they could be used the most along with that. I think that when it comes to affordability for these this new type of Mobility that it would be awesome. If you could put it on the Orca card and just have it on one app, they're doing it in Berlin, which is all on one app and I'll be great. Thank you. I see Jordan you signed up to so go next and then afterwards Yes, my name is Gordon padelford. I am the executive director of Seattle neighborhood Greenway is working to make every neighborhood a great place to walk bike and live and now I'm wondering if we need to update that mission statement. If we're going to bring scooters to Seattle time. We're in support of a scooter pilot in Seattle. And briefly we think they're suited for areas to pay attention to and disassembly other good ideas have been shared today and I'm sure we'll be shared over the coming weeks. And what is Gina really having a focus on safe sidewalks and reducing conflicts with people walking. We really need to legalize and recommend the scooters be operated in separated bike Lanes trails in the roadways of neighborhood Greenways. But as a number you pointed out we also need to build out that connects two networks of people have a safe place to ride and then orderly parking is obviously a critical thing especially for the disability Community making sure that we are building those Corrals in the corners of streets. That way people have a place to park in the end of the great thing about those Corner Corrals that also reduces the speed the drivers going Corners sort of making a safer for everyone slowing down the Turning motion and increase his visibility. So you don't have those cars are parked right up to the crosswalk and you can't see beyond it. And then third really we've heard a lot about safe scooting and keeping the user safe. Is that his some education to do probably some encouragement. There may be some vehicle ideas that are going to be intubated by making sure they were keeping the users of the scooter system safe as well. And then last the data collection reporting requirements that we are learning from this pilot cuz we will be learning and it is a new an evolving area and no one has all the answers. I did not sign up but my toddler still asleep, so it's okay. If I talked into, I was on the Transportation Commission for the city. So that was a really good experience to learn a lot about how these decisions are made. Child me take a look at knifepoint or so. I have sometimes have to use a cane and I have in the past had to use a wheelchair. So I understand what it's like from the perspective of the person trying to get around with a disability. So from that perspective, I do understand the difficulties when there's bikes on the sidewalk people do that. I still think it's worth it to have the scooters to try the scooters here. We already have the bikes here. We already know that that can be a problem. We can work around that we can do things. I can try new things to make that work. I don't like try 5 have to sometimes thinks I don't have to so much anymore. And I think the biggest danger for the scooters for people using me scooters is vehicles and I think the more we educate people driving the more we can keep people safe. I think if we want to as a community keep people safe, we need to address climate change issues in danger to people from Vehicle drivers more than anything. I don't think scooter related. Really the top priority to consider, so that's my thank you. sir My name is Larry Wyatt and I'm currently a resident at shag of Washington Terrace downtown here and I'm a senior citizen. I've lived and worked in Seattle all of my life. I'm 70 years old working on 50 and so I can't wait to take my first scooter. Right prism is Fantastic Four. Everything is going on in this city. So I just want to give my full support to the scooter price coming down. Exciting day exciting 24 hours for discussion to scooters Roberts. Got a lot more going forward. I kept him to take a thank you so much for being engaged in. This is great to see your helmet in your office when you first came to work and drink see out there on the scooter today any last comments before we go. Great Mall, thank you everyone for your today and will be returned.", "end_time": 5617.0}]}