{"format": "raw", "annotations": [], "confidence": 0.9413531554299731, "data": [{"start_time": 0, "text": "Good afternoon, and thank you for being here for a special committee special meeting for the governance package and Technology committee. I'm joined by a council member Lisa herbold who I dunno has a conflict right around 2:30. So thanks for being here and making time for this and we have two appointments the chief technology officer officer side Bashir and then we have an appointment to the ethics and elections commission for it short before we get in those appointments. Let's have some public comment. I'll call you out in the order with what you signed up and we'll start off with Anna give everyone 2 minutes. Mr. Munro to undye capable staff First Source Palo by Steven Kovac. You got it. See if car is my daughter. Should I cook in Criminal Minds Emily Zimmerman a president of stand-up America. I want talking about appointment shift technology officer. And for the last ten year every day, I come to the chamber and I know about old Chief director or CEO is all in denticle for 30 plus years. What is a live in Seattle? I cannot find one one one men's who were forgotten how we can change it. It is exactly what they're supposed to be right now exactly right now because Seattle right now is number one for ccg in America in console right now in jail for Lifetime together for many years. Cheap UnitedHealthcare for meth but every months Q&A for every direction every Council in every marriage last guy. Who did this is 5 year ago was named after every two-week. I don't ask you to remember his name. What is his name in after me? Mom is a pure freaking crew cannot sleep leak in right now Durkin don't have to I demand what is you establish a policy? So every director every cheap, every freaking will be followed by Kathy putt Steven Kovac and then Kathy putt. Hi, I'm Steven Kovac time with your National Brotherhood of Electrical Workers Local 77. I was part of the selection interview committee the mayor put together to select side is the new CTS. We interviewed a lot of candidates inside clearly stood out Head and Shoulders above the others. He comes from the city of Ottawa where he inherited an apartment. There was a total disarray rank, one of the lowest apartments in the city both internally and externally in the three years. He turned it around to where was one of the best and I believe he can do the same thing with information technology with the city of Seattle. So I encourage you to send us a full council with a strong recommendation to confirm saw it as a new CTO. Thank you. Following Kathy will be Jonathan Coomer. Good afternoon for the record. My name is Kathy putt from crown castle. So I'm here to support the nomination of Saad Bashir. We look forward to working with you on 5G to making Seattle an early adopter of the technology and Gerard Edwards and Jared Jared Edwards in before you start I just wanted to let you know that on April 2nd April 2nd and our committee meeting at 9:30. I would like you to join us at the table with your technology. We had that I didn't have that information. I just got that information so that be April 2nd, please proceed. Wonderful. I thank you. Cancel. Welcome side to Seattle. We appreciate your leadership in Ottawa and got to have you here that was actually part of the reason why we came we thought that week would we just released some pilot outcomes from the 500 individuals who were on the street who received the beacon and I just wanted to make sure that the council is aware of some of the incredible stories of individuals who would receive this smart wallet call The Beacon. We have a couple people here who have either found employment or found housing or on their way into recovery as a result of everyday residence investing directly into their lives as well as constant presence with Incredible counselors at different agencies around the city. We believe that the evidence from the first 500 lunch. Beacon holders justifies and expansion to provide access to a thousand more people on the street this year with a beacon and a thousand more people next three next year with a beacon as well to to help a expanded intervention help 2500 unsheltered individual's total, but I'll actually give away for a couple people here who have used the weekend and just sharing their experience around how it's helped them Advance their lives. Edwards NFL by Janis Wilson. Good morning city council pleasure to be here. I'd like to start by saying six months ago. I was sleeping in your lobby. Thanks for the beacon program. I was able to obtain employment at Nintendo. I found mentorship from someone in the gaming industry, which has completely completely turn my life around. I also understand that it is more than just empowering us. It gives back to the local community as well by giving Capital to the homeless people who then spend it for things that they really need an exclusively things that they need. Thank you for your time. Thank you, sir. Hi, Janice, Wilson will be followed by a Michael McCullough. Yes, I just want to let you know that the beacon has brought a phenomenal amount of Courage not just to have a little bit of extra finances to be able to go in the business place and start communicating and places that we wouldn't normally to buy close to buy. Excuse me, whether clothing to have meals even with a partner. It's been a great courage. I also I like to share the fact that I was able as an advocate of constitutional challenge. I am very interested in helping people who can't help themselves or people who have no voice or people that need to start communicating and the beacon is highly recognized that they're able to help people encourage them to go into the business place and start ordering something like a normal person to also I was able to go to a meeting where I was representing the beacon Samaritan and I was able to shed enough information that I gained $500 to help pay for my ability when I go into a better place now, it's going to be covered $500 because somebody was compassionate enough to apply that application and put that on my beacon. So I hope you take that the city and state recognized that this is a great opportunity to help people help themselves. Thank you. Michael be followed by Raven Good afternoon, Michael. This is my friend Locker currently now I actually live in the city of Shoreline. But before that I was homeless in Seattle for approximately 501 days and was the longest hardest time of my life the beacon Jonathan more specifically help me out of it. It was a very very tough time, but that little blue chip was special. It kept me based in what I wanted which was to get off the streets to go back to being normal. It's a very very important powerful thing. But they they just have problems reaching out and then on the other side you have people who don't know how to help and that's the beautiful thing about the beacon. It's Anonymous you get a chime on your phone. You can hold his nearby you read their profile. You give him a couple of dollars. You've done something good for somebody. I was talking to someone this morning about using the beacon and She asked me how would I feel if I was in need? And someone went to the app and they gave to another Beacon hold instead of me and I was like, well that wouldn't bother me at all. Cuz the point is somebody's doing something to help somebody else and that's what matters. I'll talk to Jonathan this weekend. I been. Up the street for about a year and in that gear. I was amazing how fast I put that whole thing behind me, and now I realize that I know a lot of people help me out. I need to do the same thing. Thank you. Thank you, sir. our last sign up speakers Raven Afternoon, good afternoon to the beacon has helped me currently with many things. It's help me my phone bill right now. I'm looking for a job. It's helping me with that connection. It's my responsibility. You know, I want to donate to the beacon is like a relationship, you know, they are coming in to our lives. Do we need? You don't have to be a choose to come and hang out at you to help with what they can you know, I've been on the streets 15 years still trying to get housing still trying to get a job, but the beacons been helping me. I can go to places to get what I need not things. I might want that are used to things they need because of the beacon John. I've met Jonathan it's been amazing what him and his $15. And so like it's worth it and then some I really feel that way. Thank you. Thank you. What I like to say to those testifying on behalf of the Samaritan application is the plan is this I thank you for sharing those two some heartfelt stories. Very inspirational stories on what I like to do on April 2nd is a few things one is to show to my colleagues on the council and I'll talk to her information Technology Group since many of them are here on how the technology works just from a technical standpoint. So are the public know how it works how The Medallion if you will allows people to connect with a medallion holder and then we like to do that will also invite some people from the human services department to understand any policy issues that are the technology Bay Rays and I trust that there could be some issues that can be dealt with it. I'm actually from what I know of it and research and very supportive of the technology and so from that from that meeting then we'll no doubt hopefully turn into Ask considering that as an investment that the city I may want to consider as we look at those that are experiencing homelessness. So thank you for sharing. Your testimony will have whoever would like to share the stories at the table in and display the wayers so to speak so thank you for your patience to Jonathan. You've been a consistent Advocate and thank you for your patience. Okay with that little conclude. I'm a sandwich. Please read the first appointment into the record appointment 01252 appointment of Saad Bashir as Chief technology officer Seattle information technology department for a term to January one 2023 associated with this matter. Please come forward my boss who invited some other folks that may be of interest if there would like to come for their welcome. They know who they are, but we don't force anyone to come forward if they don't want them particular time what members of the change team but you could watch from there if you'd like. Look at those guys jumping at the opportunity. So why don't we that's what you said on that side if you don't mind, okay, cuz I may have a college joining until. Thank you very much. Appreciate that flexibility. Okay, why don't we just start with introductions all the way down and then Deputy Mayor. I'll bring it back to you. If you want to start some introduction words and just for the viewing audience just as I got a second meeting of the committee on this appointment and appreciate the answers the comprehensive response as you gave the committee chair with shade of all our College deeply appreciate that introductions. Saad Bashir Anthony Davis. Okay, and I invited Chad and Anthony if I could call you by your first name to hear if it just to make sure I'm covering all my bases and feel free to add an inside ask any questions. You like likes any introductory words or she just dive in the second hearing that council president and councilmember horrible. We were very pleased to present to you. The nomination of said Bashir. I think he's already started with a very aggressive program of Outreach in input from both the people in the department and people outside the department and his clients who are the other departments in City Government. So appreciate the opportunity for him to provide responses to your questions appreciate that and I'm sure my colleague and I may have some questions at least I do and I want to thank again ibew477 and those Search committee for a doing all of the hard work on producing such a what seems to be very well-qualified can cross-examine you okay? All right. Again, thank you for responding to all of our questions and I did before I start asking questions did Ted or Anthony have any questions or do not want to just let the discussion and grow organically, but I'll give you the money in the question about where you stand you've been on the job now for a few weeks at least five weeks you talk about nine areas for improving. I don't need you to go into all nine areas, but it was a really an interesting sort of description on what you saw is where the department as a whole that the city that is a whole improve. So can you elaborate on a few of those that you'd like to talk about in particular? Children again. Thank you, sir president in council member for the opportunity to come again at each one of those nine is in my mind in a critical for the city to 2 to look at. But if I had to select a couple of one of them for sure would be at the skills, which is item number for on that list. And this is this question number two. I think that I talk about which areas we need to focus on right away and I've met with about 250 or so individuals one-on-one over the last five weeks. Most of them people who work in it many of them are client apartments. And the thing that is screaming back at me is you know, a lot of passion that it staff have to lead modernization effort to help clients and there's no shortage of work that needs to be done. But there is a bit of a skills mismatch. There are many things that we are doing in the technology space that We're doing a great job in implementing systems perhaps but we may not have done an equally good job in training our own folks to be able to handle that work. And so for me that is going to be the thing that will really be the the secret sauce for the city of Seattle is how do we get our 750 it team strong team to add to get the skills that they need for the next Cavaliers. If maybe one of the the other ones that I can also share is is it on processes and I have a feeling that the city of Seattle in general likes a lot of processes but definitely Seattle and so there are many opportunities and these are not opportunities that I'm identifying council president. These are things that when I'm meeting with those two hundred or so. So far many of them are just listing them in the one after the other and many of them makes sense. So I think those would be some quick wins to make it simple for our people to do business amongst themselves and how we interact with our clients. With hangout, I'll start a quote on page two of your response. You said where employees have may have years left in a career but skills are already obsolete. This would require show folks on skills development on an urgent basis and I don't read I read that to say that we have to invest in our own employees and that in technology technology is constantly changing constantly. I've been updated and you have stayed Nimble and deaf to invest in our own employees and I think that's a different policy approach then just getting rid of folks and hiring new people. I think that what you're emphasizing is an investment in in our people and then I was very places where to see that approach. Am I misreading your intent there clear out comes one is you will be relying less and less up on external Professional Services, which is a huge drain in terms of our budgets and the second thing that you'll hopefully see is lots of people who currently Where can I buy tea getting reposition because they have now acquire new skills to be able to contribute in different ways which will allow you to use your existing skill-set versus trying to figure out how do I get rid of an individual employee and hire somebody brand new? So those would be the outcome that I would be hoping for a good and you know, you're being questioned by someone that actually worked in the Freshman workplace before the Internet was developed. And so many people in my vintage do have a resistance sometimes toward new things and and I think in my mind an effective leader understands that resistance, it may be experienced by many but still inspires them to be better to me that's about continuous Improvement and self-development. So I hope that we can see some real good outcomes are going on, but just feel free to jump in. I know your time is limited so I could defer to you cuz I have other questions. Well, you asked questions about question 1 if we can move on to question to I don't follow up on that one. Thank you. As it relates to question to specifically the process question you refer to the fact that the overall governance structures around it can and should be streamlined and strengthen. Can you talk a little bit about what that looks like? Decision-making often gets obstructed when you've got asthma no more than the right amount of players and so in some cases, you know, they may be a need to see RV over-engineered in terms of how many management clears we have within the within the it existing structure. So that would be I think what type of cat and I are in some cases that mean very well be the answer but also very that structure is currently how that structure is currently structured unintended and by that what I mean is that they may be in the area. For example, let's call its modernization of it work which might currently today be spread across it the under different management under different divisions and may not be giving you the divorce that you looking for as the organization and so assembling some of those like-minded Fung. It was Under One Roof so that they can be without adding more resources. Just making use of the existing resources in a much better way that's another aspect of structure changes. I'm going to bounce around a little bit out of the sequence. If you don't mind and in on page nine in response to a question particular question dealing with RCI issues and underrepresented groups. You said you wanted to create a department of specific plan to recruit more insurance from Seattle College Programs is on page nine, especially Sarah promise to provide volunteer opportunities at shall I T two high school students from under-represented demographics and expose them to the technology sector and I shared with you. Of course the Archie work finally actually very good work plan that was signed by the legion 2018. I want to thank the members involved with that and what you saw earlier was the Samaritan software being talked about in one of the goals that I've always had us to really double down on the use of technology to address both the digital divide communities that are under shirt and underwear. Deal with the the homelessness issue as well and try to find the social good in in in technology. So can you talk a little bit about your notion of reaching out to underrepresented groups what your thoughts are and why you start a flag that is some of the things you want to do short for my previous floor back in the economic. It's too far away when I was in Economic Development one of the opportunities I had was to figure out how can we do a lot of social economic development work in the city and often that involve the use of technology for some social good in one example is that we had a couple of start the folks who started a company where they could give way similar to do to the beacon program, but something very people who had you know, eyesight issues and they were wanting to cross the road. It would actually talk with the video that the DD sensor that was built into the traffic lights to indicate that Was okay it was safe to cross the street and so being able to figure out those opportunities where technology can get married to social good is something that you know, we have been able to do back at the city of Ottawa few times. And so that is what I was thinking off as I was writing this response. You know, I've spent some time that with the RSG iFit committee at the in the Seattle i t and I know there's already a lot of good work that has already been completed but there's so much more that we can do some looking forward to leveraging and building all the different plans that we have for 2019. Please give so much throughout your response document. There are a couple of references to chatbots as a way to address buried issues whether or not it's addressing customer service service demands or language translation. Wondering how you could speak to the potential labor implications of using chatbots and and how that might impact. Are are workers are Leanne and the both both of the discussions with the workforce about that as well. As you know, how you see that fitting in just sort of overall for the for the city is being a city who you know uses are good jobs here as a as I really important measure I and lover to get folks are all alike. Topping career wage jobs the response on page eight you saying I'll just quote your language unifying the call center technology footprint will also allow the deployment of common services such as chat Bots Bots that can divide responsible responses and multiple language to the most common queries creating further capacity for call centers leveraging chatbots with a universal single sign-on cable. The ladies will allow residents to complete many routine tasks in a shorter. With a consistent user experience several examples exist in the marketplace example in the banking industry where such Innovations are helping boost client service and I think we all love be put on hold for 20 minutes before I get a live person. So I'm being facetious, of course, so the labor implications of that kind of approach. I think I can try what makes a real good points. Maybe you could respond. That's a great point. And that's something that came up in my previous role as well. And the idea is simple that there are many many routine types of questions that a typical call center agent or a service desk agent. Let's sing i t is is handling and you know, I mean if I can speak on behalf of that service desk agent those are not that the fun type of activities that they do want the job. They are wanting to add a lot more value and they're interacting with the I am so ready chatbots is a way for taking away many of those routine things so that you can free up the capacity and have your own employees does same stuff do a lot more value-added work for the clients. It is certainly not a measure to replace human agents because that's never going to be possible but it will be for those typical request and 80% not 80% but a large proportion of the request that a typical call center gets are very routine is the same question with the same answer and those are the kinds of things you want to address with chatbots. Maybe I'll stop there and end actually I'll just add one more point. It's not just about chatbots about any piece of technology that raises concerns that is it going to take over human people who are doing this work, you know, if I talked about Automation and the lots of automation opportunities in Seattle, I do, you know, the same question could be a star you going to replace five people with a software program and certainly that's not the case any one of those areas where there is that perception perhaps that that may be the possibility my goal would be to work very closely with people like Steve and the you know, the the labor stores that we have an ID to make sure that any of those concerns are addressed at the very outset. So don't ask you a little bit about employee. Morale. We ask you a very specific question. How do you plan to approach the employee morale and emphasizing that was not a suggestion of morale is good or bad or high or low it was just what are your views toward that and of course within the city we try to gauge that and measure that my own take on Morrell has always been asserted start from the top and then morale becomes poor when employees see arbitrary and capricious decisions and unfair decisions and favoritism of those kinds of things but also employees have control on their morale as well as a choice on what more are they continue to perpetuate Richard of a top-down bottom-up approach has been in my experience, but can you talk a little bit about your Your Sussman of morale and your attitude of morale and what do you do to keep morality Optimum level? I would say that if you can probably look at the workforce in it as a spectrum and there are 10 to 15% of the people that I have met so far. There's nothing that you can do to them that will decrease them. Well, they're just high-energy High passion, you know, they just want to come and do everything that they can do in that 7 8 hour day. So those are those are great people not much attention is needed to them in terms of from a moral perspective that you've got another 10% or so based on the sample said that I have currently sat down with him giving up, you know, they have defeated like that. They have been burned so many times they feel like they have a stocked about all of that concerns and nobody has heard them and they're in a really bad place and remaining of those conversations have been very tough for them. Also a very open I should say but that for me to listen to you know, this person really probably meant a lot of good things that they wanted to do it now for whatever reason whether it's their fault or you know, who ever after that they worked with the bottom line is there is nothing as such a good spot. There is a there is a significant number of people who are in a bit of a wait-and-see approach and those people that I'm meeting with r Feeling very encouraged when they're being listened to they are waiting for skills development and talent development to be applied to them and they're the people that if we can turn a significant number of that 80% of our Workforce, who is that in that holding pattern right now? I think you will see a sea change in terms of employment real It often employee morale. I think if I get affected when people don't feel like that they're being hard. I think most people know that not all of their ideas are going to be accepted not all of their concerns are going to be addressed but they want to make sure that it's a safe place for them to talk about it. And I think that is the kind of environment that I have already started and will continue to build this point. I'm going to actually have more conversation right now, but I know councilmember herbold has a pressing meeting that we had it for like another minute so I'm actually going to vote now, but then I'm going to continue this discussion because there's some other lines of inquiry and I but I tried to do for the viewing public to try to do a lot of my homework before this meeting. So I appreciate how willing you been to subject yourself to this kind of inquiry for me because I'm a technology sure to keep this is pretty important to me in and I appreciate you if you're willing to show I'm going to call for the boat. But then I'm going to keep questioning you in this little I don't think I've done that like that for in 12 years with his first time for everything. So at this point I will move for the appointment of Saad Bashir, which is appointments 01252 all of the favors. I keep drilling even though now I showed my hand so to speak motioning seconding and sitting by yourself. I wanted to talk a little bit about your you said something Instagram page for what you talked about avoiding five to 10-year long your check my plans. This is in response to the question. What examples of lessons learned from your prior jobs do you have what specific expertise and experience from prior job to anticipate you will apply in your new position and you talk about avoiding 5 to 10 year long in 100 million and higher transformation plan and instead thinking of 18-month it planning Sprints, which I helped me understand that the presidential as you all know that I T is creating significant disruption in every facet of our life including the way we are running the municipality of Seattle. And so to try to predict where technology is going to be in the next 5 years is is going to be a bit of a guessing game and that you have to sort of thick one over the other schools of thought that's one reality that we are facing. And so that is telling me that instead of painting a picture and making it sound very accurate. This is exactly what we need to do in technology and it will last us for five years. I don't think that would be a fair statement so that Flex the technology is creating is making me feel that we should plan for shorter time Cycles. That's one the other is IT specialist at the city of Seattle is in the service business. We're not telling Department of Transportation are utilities how to run their business. They have to decide how they want to run their business and I T wants to be at the table to support them all the way. And Knots not city of Seattle departments, but generally speaking Municipal departments are not really sure where their business is going there. Also a little bit nervous about how technology is going to be disrupting how they deliver services to the citizens of their municipality. So because they're also not very hundred percent sure. It makes it difficult for it to plan for that type of environment and maybe the third last thing is that it just the nature of the Beast is that we work in a in a in a in a 40 year 5 year cycle in Owenton in terms of public-sector and that creates a lot of uncertainty in terms of whether these plans that we create and we spend so much effort to create them. Are they going to last the next political leadership cycle that may be on the horizon. And so that is a lesson learned not just forces for city of Seattle. This answer is not something that you will find a lot of support for if you were to speak with the top Professional Services Company that deal in Lighty because that is a lot of money to be made in terms of selling the city of Seattle. You know, what 10 million dollar transformation plan that will last you for 20 years. So it's not a popular answer in the private sector, but I think that is what the Practical answer is very good Whenever there is new leadership in an organization seems to me that a very rambunctious later will come in and he or she will say we're changing everything not realizing that a department like I cheated or are pretty amazing work. So how did you go about looking at the gems in an apartment the good work that's been gone a good projects as opposed to just saying, you know, you guys are doing everything backwards here and I'm the new leader and this is how we're going to do and I'm going to do I'm presuming that You did find some of the great work they're doing and I would remind you that I have been trained at Technology Group provide 11 years now. So just notebook with me in all of those two hundred plus meetings in the end of every meeting. I definitely make a point to ask the person. Can you name me a few stars that you've encountered a night and just this morning. I was in the meeting with about 15 of the people and I jotted down all of the names that they gave me and so there is no shortage of individual who in IDR doing a great job in terms of delivering the services that the client looking for and whenever I come across those I'm making a point in either in person, you know giving them a pat on the back for sending a message or even I think it was day before yesterday on Tuesday with my own direct reports. I just listed a bunch of names for them and I said when you go back if this Around your team, make sure that you let them know how great of a job they're doing. So it's not all bad. No doubt about that. I think what is missing is that team spirit need the ability to work as one single it team is I think that's the issue at hand. My last line of inquiry would be, you know, the concept of race and social justice or gender Equity or anti-harassment policy is ETC taken seriously by the city often. We are criticized however for not practicing that with which we preach that they are perhaps people say we are either inconsistent or not as committed as we hope to be and I guess the truth is always somewhere in the middle right that we can always improve. I just believe in continuous Improvement vent. How can you impress upon the viewing audience in the city that you are truly committed to these values as you continue to leave? Department you have to take my word for it comes to president because I haven't had a lot of chance to actually, you know show you in action how I would be practicing these values, but maybe I can talk about a couple of ways in which I make a point that I am being a fair transparent manager of people. One as I've already mentioned is being as transparent as possible to the people who work in it in or leave me make some tough decisions. We made choose a certain direction but making sure that people in it at all levels not just people of a certain title or part of the decision-making. So that's important for me another set of principal I have is that to be fair to the people who are actually doing the job. And we're doing a great job Monday to be fair to them is to make sure that you're putting a lot of attention to the people who are not performing in. So that's another way for me to create fairness in the workplace is not just overburden the performers for all of the work that you have to get done within your team. And you know, they building on the did the great RSG. I plan for example that we already have a note that would be something a commitment that I've already made to the mayor and to this Council as well that I would be you know up in the game ever ever. I can and putting the focus on that type of work as well. Yeah, I want to do everything. So I've been to one of the cool leads for the artist Jay change team and itd for about two months now and is it is 5 weeks. He's been here so far. He's already met with several times has been very supportive of the RSG initiatives. In fact, he's asked us to put together a proposal that implements 10 truly transformative efforts to bring about measurable change for underserved communities. So she's going to include Workforce Equity study a service Equity study and then defining Whitley cause okrs. Results that we can use throughout the organization for the director level all the way down. So that each person can be thinking about our SGI, and I think one of the ideas that we were just discussing before this meeting was the artist g i Fridays of being able to have some dedicated time that everyone is thinking about RS giant either reading a book or treat taking a training class or doing something to enhance their knowledge of the initiative i n to really start making some measurable change out there. Thanks for those comments fact that I don't have it decided that you did talk about some small informal and fun like events as well to to keep the Montresor to going. So I appreciated your creativity there. I'll be very pleased to announce this and I in full disclosure. You don't have to if you'd like to see anything. I I think I've known Anthony since before you get to have a driver's license, and so now you're at the table with me, but I'm very glad you're part that I T family unless you want to see me. Before we move on to our next agenda item second with Ted was saying I appreciate the opportunity to I have an audience with you. You know, I'm so early to impress upon you how important the work is and to get the ability to bring forth more ideas for Change and not to just to continue what has already been put in place but to start a new because just like technology. If you don't continue to grow or continue to educate the new stale still people is just as bad as Antiquated technology. It does no good for anyone. Thank you. Thank you for for serving the city and in for responding to Oliver in Carrizo will we're finalizing a council expectations letter that we always try to have and we will all be part of the appointment file when we vote and the boat will be on March 18th to just do it next Monday. I have a conflict until I presented to the full Council on March 18th at 2 and then we'll proceed from then and again, thank you very much. And you have any questions, just let me know, but we'll be in touch. Thank you. Thank you. Thank you Anthony. nexigen item in Appointment 01265 appointment of Richard F shordt as member Seattle ethics and elections commission for a term to December 31 2021. Richard coming forward sir. So why don't we start with introductions on that end with Mr. Burnett? And then we'll bring it back to you Richard show just for the viewing audience then and then in an app to do that when if you have any introductory remarks will give it back to you. Yes, I'm Wayne Burnett. I'm the executive director of the Seattle ethics elections Commission. Richard short Richard Schwartz applicants for Seattle ethics elections commission. Would you like to introduce your corporate counsel at T-Mobile before that? He had distinguished legal Courier on both here in Seattle and in Washington DC and prior to that and I think also relevant to the work we do is he spent 10 years on Capitol Hill working in the House of Representatives. So we're very excited to have rich on board. He'll be replacing Charlene Angeles who wrote take it off the board after a single term. Sure want to thank her for her service. Thank you. And then and I think of her service as well. So tell us a little bit about you do a lot of compliance work and welcome to the ethics and elections commission as a potential commissioner. Tell me a little bit about what sort of drives you to do that kind of work in a little bit about some of your experience at T-Mobile and another Law Firm doing compliance were just a little about yourself for the viewing audience. Thank you very much for your consideration invitation and consideration of my application is Wayne said I have been a practicing lawyer for a little over a decade before that. I had a career on Capitol Hill in Washington DC for for around a decade. I think that's no currently most currently. I'm senior corporate counsel T-Mobile where I am and our compliance and ethics departments and I'm responsible for building and developing really best in best-in-class compliance and Ethics program for responsible for number of legal compliance issues, including our whistle. Star program pay the claim political contributions policies and I also work closely and advise our corporate internal investigations teams. Thank all those experiences at T-Mobile building a really strong compliance program really play well into the obligations of Seattle ethics and elections commission has to oversee the Inn at the ethics in his parts of the code. What's of our democracy democracy voucher program so that the work there that I do is really and my work in private practice and my work on the hill and in particular, I advised my staff and make sure that our office in my boss was in compliance with the house ethics rules and other obligations imposed on members of Congress and their staff really I've had the opportunity to have jobs that really is that that allow me to approach approach to decision-making an Ethics value-driven value-based way. I'm a very strong proponent of good governance. I'm really doing things the right way as we like to say fortunately T-Mobile. I work in a group with a very strong leader had strong CEO, but but they really encouraged us to be creative and end and work with all of our teams in our business units to approach thing from a customer-friendly standpoint a employee-friendly standpoint. So the the bottom line is making sure that I customers are our Surf crackly and our employees do things right way and I think that this had a lot 6 elections commission has a lot of parallels are goals to make sure the city employees are operating the right way at the clay and eggs in a good to Valley Raceway. And we also want to make sure that our constituents that you are constituents are understand and have faith in government have faith in the employees in Seattle and also have faith that the in particular the elections process is transparent and ethical and that the candidates are acting in an appropriate way for a good response. Amaya my interview wouldn't be complete without one curveball one of the areas than I've had discussions on this kind of issue. And that is the issue of intent. We've all know from law school that the ignorant of the law is no excuse. But if in fact there are violations that occur either ethical violations are elections violations because a candidate knowingly violated rule versus one that inadvertently just wasn't quite aware. There's no education requirement for a candidate has in his examples of some become someone more aware of the rules than others. So we're in either in your professional job or even as you become a commissioner, where does the role of the do you think the role of intent has any place in this because I you know again Miss Brenda and I talked about These kinds of things for candidates a new candidate. There's a lot of rules that a lot of regulations and souls many are some are better than others and knowing everything. So can you talk a little bit about the role of intent vs. Just near negligence? Absolutely and I think I would start by saying in my professional my professional career and personal care when I returned the hell not only that I work and need for an elected official in on our public office. But I also have a lot of experience and campaigns. I worked my by there but take a leave of absence work on campaigns are in my volunteer in my spare time with volunteering campaigns have worked and campaigns that the state Municipal and federal level. I have locked door to door with some of my good friends were running for city council. I know that is a hard job. I know the new and inexperienced candidates don't exactly know what they're doing. And I think that it is I think the experience that I bring the understanding of how hard and nuanced being a Candidate particularly first time he and I can be will help influence some of the decisions that well at least we'll help allow me to educate sand and have for three conversations with the fellow Commissioners when we are asked to interpret new or novel questions particularly as it comes to democracy voucher program, I believe the last I heard there were at least 42 Claire candidates for city council. A lot of them are going to be for some candidates and hopefully a lot of them will take advantage of that the program but even if they don't because the commission oversees the elections policy and elections go to the city we may be asked to land and obviously weighing in his staff will have a a difficult hopefully rewarding time you're looking at a lot of the issues that come to him. But if we are asked to weigh in on any disciplinary decisions for ratify or have a hearing I think that intent does play a role to code certainly the code spells out what a violation is, but there will be issues of credibility and sort of You're standing water person knew and didn't understand to be true the steps they talk and they'll be allowed to explain, you know, their rationale behind some of the decisions and I think that I don't want to say nothing of sliding scale. If your new you get a pass and if you experience you don't get a pass, I think we do have to take him to understanding all of the experience and in my rolls a litigator I think will help influence some of the questions that we might ask in in an understanding that as he said, there'd be no intent it there's it may not be a bright-line rule. It might be somewhere between negligence and and growth are gross negligence or malicious intent and it is important to understand the purpose of somebody acted and my background. I think my my understanding of what it's like to knock on doors what it's like to dial for dollars what it's like to hustle and get paid Media or earned media just understanding the pressures that a candidate is under will help me better understand motivations of Play SS credibility when they're providing their answers. That wasn't it. That was an outstanding response. I'm not sure how I would respond to that question. Thank you. Thank you for that in your experience on your your grass roots experience. I think we'll be out in space. So thank you very much for that. I didn't have any other questions and I can't turn my colleagues or any other questions. And so again, thank you for serving. So I will move the appointment 01265 appointment of Richard short to the Seattle ethics and elections committee. I'll second that all of favor say aye on the same day. I present. Mr. Bashir as we should be March 18th, no need for you to be here. You're always welcome to be here. But I presented I'm sure the council will you'll be warm to receive if you might cancel. Thank you very much for serving.", "end_time": 3193.8}]}