{"format": "raw", "annotations": [], "confidence": 0.9591870823024232, "data": [{"start_time": 0, "text": "Good morning. Thank you all for joining the housing Health Energy and workers rights committee. Today is Thursday, March 7th, 2019 in the housing Health Energy mosquito chair of the committee. I'll soon be joined by a council member and we know that council member Juarez is watching from afar today. I'm going to go ahead and start with the public testimony since we have one person signed up to testify for two items on the agenda today. Mr. Zimmerman for your comments and we have first everything on the medical demonstration transformation labor and everything from Seattle Housing. So go ahead and start your two minutes. Z-CoiL is walking good for my sweet lovely sugar pewter this place for less than a year in speak more than 2,000 time in housing this a gold number 100,000 housing for poor people, Clayson $40,000 in for many years, but then here I come to this place and every day to fix this problem very easy, but you need 5000 apartment Queen City belong to people who make 40 less than $40,000 per year in Canada pay more than 30% make everybody equal how we can fix this is 2 points worth is when you doing for the God chooses go. What is a token for many years number one? Seattle right. Now recognize from east coast to West Coast like number one for sure ECG in America in fascism is very simple without change this political philosophy about Nelson field beach access. Number one number two, what does absolutely critical because right now it's exactly what it's supposed to be with you doing right now this constitution Primetime like Gonzalez in civilized countries supposed to be going to jail for Life Time lasting change supposed to be moved out now to what is when you doing for 50 percentage is very simple business location. So, please 1088 exchange rules Okay, that will conclude our public testimony for today. Thank you very much. Mr. Zimmerman. Before we get started on our first items. I want to take a quick minute to say happy early International women's day tomorrow. We're going to be celebrating International women's day. We need to take some time to reflect and do some self care about how we are working to change the current context of inequalities and to ensure that women truly do have equal rights. So we feel whether you're out there trying to disrupt business as usual or doing your daily job that maybe doesn't get recognized every day. We see you for all that you have done especially to all the women in my life is my mom is watching and to my sister and my grandma all of our family and friends and especially to our all women's office. Today's sejal Aretha and Aaron. It's an incredible honor to work with you everyday and the women in central us of women. Thank you for all the work that you do is the incredible work that the city has done and to make sure that the workers in this city whether or not you're in Seattle City Light will be talking about today who's still have disproportionate Health outcomes as well and having our Healthcare access constantly threatens. We are continuing to fight on the ground level in Seattle to stand up and fight for rights in the workplace and equal rights in terms of axis equal pay and Healthcare access contributions to make sure that we do better in terms of not just accepting 78 cents on the dollar but recognizing that even though we've at increased Penny by Penny year by year. Play some 2012 with decreased term 86 cents on the dollar to $0.78. So we got some room to make up for we're going to keep fighting and one of the ways that we're doing that is on the topic that were talking about today, which is ensuring equal Access healthcare. We know that's an economic stimulus and it's also an economic a stabilizer. One of the big issues that I'm going to be working on is access to affordable child care throughout the city all we know that when we couple of childcare with access to housing on and make sure that those not only have two don't have to rush home and worry about an hour-and-a-half commute to the catching multiple overcharged by the daycare out who are predominantly women as well in the daycare centers, when we create greater access to child care in the show that it's affordable. That's an economic stimulus and equalizer for women as well. And one of the issues that we're obviously talking about is access to housing and we know that women and people of color and members of the lgbtq community are more likely to face housing discrimination and higher rates of eviction. So we want to RI committee make sure that as we celebrate International women's day were thinking about Healthcare economic stability access to housing and access their Early Learning and education is also to the women of color specifically in Seattle who work for our Department's everyday. We also see and hear the results from the reason social justice initiative were kind of Freddy Cuevas from our office has been participating in the interdepartmental task force to address sexual harassment and assault and when we saw the most recent statistics that said Not only was there discrimination based on gender, but it was compounded by race and ethnicity of Statistics. That's unacceptable to us. So we we take a moment to celebrate and we also recognize that are we have a lot of work to do to ensure that our intersectional approach to creating a greater Justice for All In The City really does start with us and looking forward to celebrating all that women have Brought to the success of this incredible City and recognizing we have so much more to do. So with that. Let's talk about Healthcare and agenda item number one. Argentina number one Medicaid demonstration transformation for briefing and discussion welcome. Thanks so much for being here. So we are lucky to have adjusted, and Susan McLeod McLaughlin to share with us a little bit about the Medicaid demonstration transformation. I keep seeing waiver if that's the appropriate terms and you guys can help us out here. They're excited about this and you know, given our work on the board of health in our ongoing offices of continued commitment to clean a regional health plan. We've been working very closely with King County Partners, very interested in hearing what we see in San Francisco and la which is a true safety net health plan for those who are priced out or excluded from health coverage options if they don't get it from their employer. So we love Health in this committee. And we also know that our options for policy levers at the city of Seattle aren't as great as they are at Kane County. So really relying on that partnership with all of you and perhaps there's ways in which Baby, stepping up our efforts at the city level that we're not aware. I'm so looking forward to hearing your presentation today and hearing more about how we can be helpful and also contribute more to the and transformation efforts that introduction and hopefully that we will be able to demonstrate that we have at the city with what's going on and why I love your opening. I just I had to what came to mind very quickly was my 93 year-old mother and my three older sisters who are Rey's the very woman Center man in this community to understand and appreciate that you're giving me goosebumps, and I already cheered up earlier. So it's going to be a good day. Okay, so so thank you again for this opportunity and Susan here is going to take a bow. And I really really appreciate the fact that we have been able to hire such an amazing leader for this very very important project. And my name is Jeff sakuma. I am the health integration strategist in the Human Service Department here at the city of Seattle. And I also and the city of Seattle a representative on the governing board of healthier here. So we are going to sort of go through a series of slides at Lowe's for the very specifically about this the Medicaid transformation waiver and specifically what we are here to focus on and that's initiative 103 Park waiver, but we'll talk a little bit about that in just a sec. But our goal here as you will find out it is this a lot of artwork obviously is very focused right now on people who are on Medicaid in our community, but really are goals as you will see our much broader in terms of Really trying to impact the health of all the books here in the city ending the county and in the state of Washington. I'll let Susan ticket from here about healthier here. Thank you, Jeff and I think you council member Moscato for inviting me. I'm really excited to have the opportunity to talk to you today and share what we're doing it healthier here and our strategy at least four 2019 and and going Beyond I'm in II to Echo, but thanks for that introduction that was wonderful and empowering and appreciative of the city of Seattle's focus on women and and equality gender equality said Thank you. So I am the executive director and Susan McLaughlin. I'm the executive director of healthier here and I thought I would start just telling you a little bit about who we are so healthy are here is a nonprofit organization, and we're dedicated to improving the health and well-being of people in King County through Innovative cross-sector collaboration. So we are working in park. Worship with the healthcare providers in our community as well as community-based organizations and social service agencies so that we can catalyze and Test new and better ways to respond to the health and social problems are of our region and especially for those that are most vulnerable. So you talked about the strengthening of the safety net and that is very important to us as well and making sure that people have access to care and is Jeff mentioned while the Medicaid transformation project is really focused on the Medicaid population the goals of healthy or here are four people of the region am at the entire region and particularly looking at equity in reducing Health disparities. We want the system to work better for everyone regardless of how they access their health care. So healthy 26-member cross-sector multi-state stakeholder governing board. It includes representation from medical and Behavioral Health Providers are Hospital health systems all of our local tribe. Are community-based social service organizations are Medicaid Managed Care organizations? We have City and County government seats represented and then foundations as well as advocates and consumers on our governing board healthier here has a staff of about 15 people right now that provide much of the backbone functions to ensure that we have success in the transformation goals that we have set out for the region and then healthier here is contracted to be the accountable community of health or a CH for short for the King County region. So what that means is our initial funding is through Health Care Washington in the Medicaid transformation project. However, longer-term we expect to have more of a diverse portfolio of resources that include Ranch Community in and provide parent partner support as well as philanthropic Investments to make sure that we can continue the transformation work beyond the waiver. What you know is time-limited So I'm there are nine AC H's in the state of Washington on the map on this this slide shows you the different regions healthier here is one of only two single County ACH is Pierce is the other one. So most of the h e a c h is representing multi counties, and we essentially act as change agents for the healthier Washington initiative that the best states Vision that they've set forth for transforming the entire Healthcare delivery system. And then the Medicaid transformation project which is the go first opportunity. We are responsible at your hair for planning designing the implementation and then the oversight of the work for this region. Healthier here aims to have a system of care that works better for people for providers and four are community-based organizations. This means that people in our region get better more Equitable care that results in an improved quality of life. It means that our provider organizations get the supports that they need to achieve better results and also to make the transition from the current fee-for-service way of paying for care to value-based payment arrangements that really focus on outcomes and quality and then also to make sure that are community-based organizations have the infrastructure and the capacity they need to engage with the healthcare delivery system in an approved way so that we can more intentionally address the social determinant needs of individuals. So just mentioned that the Medicaid transformation project is made up of three initiatives starting on the far right is the foundational Community Support Services Medicaid benefits for a small subset of Medicaid eligible individuals. I'm too specifically provide Supportive Housing and supported Employment Services initiative to in the middle is long-term services and supports and that also includes new Medicaid benefits again to a subset of eligible individuals and it's primarily to support family caregivers that are caring for their loved ones to help people age in their homes longer and the city of Seattle is very actively involved in this initiative to through its Aging and Disability Services in the Area Agency on Aging and then initiative one is the delivery system reform incentive program. And that's the component that seeks to transform the healthcare delivery system through the accountable communities with her. It's by far the largest part of the Medicaid transformation waiver as you can see. It's up to 1.1 billion dollars. I'm over the five years for the state and that is where we're going to focus today is on the transformation through accountable communities of Health. However, if you are interested in the other two initiatives, certainly Jeff and I can arrange for others to come Takata another time and where detail about those two components just real quick. I still looking at that last line three buckets. Do those correspond to the previous slide, which is the triangle that sort of touches on delivery of healthcare supporting providers and social determinants of Health. Do they correspond or overlap sort of so the triangle is really focused on the initiative one in the delivery system reform. However, the whole way is to address these three things and so on. What do you look at for example supportive? Supportive Employment Services, that's really getting at the social determinant needs of individuals and providing new Medicaid benefits and the similarly with the long-term services and support so they are focusing on different populations. I'm somewhat in different areas and are currently a little bit siloed and how they're moving forward but we are working to figure out where we can leverage them together. So for example, as we're doing the delivery system reforms that you'll hear about were thinking about how can we connect to those Supportive Housing Services that are available to again? It's not just a small subset of the people were touching her going to be eligible for that benefit. But if they are we want to make sure we can connect them into that. So there's some connection that way so our friends from Seattle Housing Authority are here and they're doing a presentation right after you which is really timely we wanted to try and health and the health of individuals and the health of the housing cuz you can't be healthy if you don't have Could you tell us a little bit more about the type of supports that the individuals or that the community is providing or that kind of third area on the triangle related to social determinants of Health to me as I'm trying to think how can we be more helpful? Perhaps this is the area that we can lean in on. Yes. Absolutely the so the initiative 3 the foundational community supports is managed by a third-party administrator through a request for proposal process. The state is working with Amerigroup Medicaid managed care plan to administer that it what it does. So in the Supportive Housing Arena, it does not provide any dollars for housing. It is the services that support people to find and maintain housing so it can look like I'm case management support to help identify affordable housing or housing that might where they Be able to use a subsidiary Housing Voucher landlord negotiations and then in-home supports and services to keep people healthy so that they don't kick it kicked out of their housing. I'm so a lot of case management checking in linking two other types of services that might be necessary to keep an individual stable. And so that they can maintain their housing and in for the employment. It's very similar kinds of things that doesn't provide wages or anything like that but it provides the services and supports that help people find and maintain employment and Amerigroup managers that right now Amerigroup manages the benefits do they receive any funding from the city of entirely funded by the Medicaid transformation project at this time. But Amerigroup does is it contracts with local agencies in an all of the regions across the whole state and then there is The state has set eligibility criteria to access those benefits. So when a service provider identifies a person who meets the eligibility criteria than they can you request a benefit from Amerigroup and then they would receive and most of them are our housing providers. They can receive at the Medicaid benefit for that individual to provide Supportive Services for that person. Thank you for flying this this seems like an area that I'm going to need to follow up on because I want to make sure that we're acting in as good partners with Amerigroup, even if they're not receiving any funds from the city of Seattle anecdotal and one of the case managers that's been there for 10 years. She said last year was the hardest, you know, 2017 was the hardest year that you've ever had because she'd had women who were getting to the end of their 12 months stay at the shelter. Add Section 8 vouchers, but there was literally no place that she could find to put them in the city along Transit lines that would be accessible to their work. So I want to make sure that we're acting also has to make sure that they can meet the goals of the transformation waiver and it seems like a big area that maybe we could step up and because even if there are contracted with are there so few resources and maybe you guys can shed some light on that later, but that that seems like a big component of your work to create stable and healthy communities and I just wanna make sure we're doing our part. They're absolutely as and thank you for that because I think one of the goals of healthy are here and in our role as sort of this, you know neutral objective entity that's not attached to anybody but supported by our whole Community is to is to figure out how we can leverage and aligned resources to reduce fragmentation and have greater impact. And so what you have just described as Really great way to do that to take the little bit that's available through the Medicaid transformation and make it more impactful by aligning resources. So thank you again. We can help get you connected to the right people to get more information. What are the most important things to know and understand about the Medicaid transformation project it is it is it is not grant funding. I'm so it's a pay-for-performance contract between the federal government and the state of Washington and then also between the State Health Care Authority and the ACH is so in this case and healthier here and what that means is that we only earn money for the region if we are successful and improving the health outcomes for individuals in the Medicaid Program the Health Care Authority and its negotiations with the federal government set and determined the outcome metrics. I'm going to show them to you in a minute. So you have a sense of what they are and they also set targets for each region and each ACH. So we get measured semi-annually on our performance on these metrics to determine if we've met the milestones and then if we do we are awarded a certain amount of incentive dollars that we that help your hair can then invest towards innovation. In our region and said that point I think then we really want to make sure that we're helping on the housing and stability and economic stability front to if this is how you generate revenue for future at welcome count timer backside apologize problem. We had a good conversation. We're on slide 10 right now and we talked a little bit about how the transformation waiver includes access to better care more Equitable care for Fulton County supporting providers to make sure that they have access to the most recent information that they're integrated integrated therapy. And that is a values-based payment program. And then this is where I think maybe we'll want to follow up on how we can ensure greater access to housing stability and economic stability with our partners who it sounds like our third-party contractor with Amerigroup. So we'll follow up on that later. Do I understand that some of this money can be used to pay for Supportive Housing and one of the initiatives is a new Medicaid benefits specifically for Supportive Housing and supportive employment its Initiative 3 and so it's a subset of medicated eligible individuals that are eligible to receive those benefits, but then it provides resources to housing providers to provide and I'm Supportive Services to individuals to help them both get and then maintain housing stability. Yes. Okay, and then this next slide just shows a little bit deeper about the paper performance contract in a really significant part for us and our region in terms of how we are in incentives. So as we move down the path of the Medicaid transformation project at the amount of money that were eligible to earn becomes more and more at risk for meeting outcomes in the first two years as you see on the slide 2017 and 2018 100% of our funding was earned by meeting reporting requirements. So we had to submit a project application and implementation plan. We submit semi annual reports and we are an incentive dollars that way but beginning of this year one quarter of our funding is going to be at risk based on how we perform on the metrics and then it gets more greater and greater amount. And so what that means is exactly what you were suggesting which is that we have to be really focused on how can we as a region meet our Targets on the measure so that we can make sure we can keep them. Flowing into our region and earn the maximum amount and then this next slide here shows you what the actual metrics are. And again, these are my checks that work sat by the Health Care Authority and negotiated in their contract with the federal government. So we have as a region and actually all the regions across the state didn't have any input into what the metrics work. And the other thing is that they are tied to the projects that we selected as a region just going to talk about that in just a minute, but you can see that the metrics are very Healthcare oriented clinical measures and you can also see across the top are for project areas that we're going to talk about how there's a lot of overlap and that was really done intentionally so that we can come at Improvement on these measures from a variety of different angles to increase our likelihood of success. I will tell you and then Jeff can say more about the As a board member the board is very interested in looking at measures that go beyond just these Healthcare clinical measures cuz if we would have had a say, I think we would have selected different measures for our region. I'm to incorporate things like equity and health disparities and then also to be looking at how successful we are in addressing the social determinant needs of individuals and where there are significant care gaps. So we will be building those into our work going forward as well. That was my questions and culture is there's nothing that stops us from adding those metrics. So we're not included to just this list paid for our for this list, but we can add as many measures as we see fit to to help us be successful. We've been working on. Just in council member mosquitoes work. Bye in other committees is that we see where there is real Equity where there's real value in addressing the social concerns we have But the other are all these other elements fall into line. So if they just as an example, we received a copy of his study late last week. That's what's called system failure and the the focus they had there was really on more of the mental health the 100 people that were most often seen in jail or up at Harborview and that if we can focus on the health measurements and the outcome and the equity issues that these other things begin to fall in line and waves that we hadn't anticipated question. Sorry about my soapbox. The next is a Right across the top on your slide 11. It says opioid use 7% Now. I'm assuming that that's you what you're looking for is a reduction in opioid use or what. What is that 7% mean Nation project that we had we picked from 8 different project areas. We had to pick a minimum of four and could pick up to eight projects to focus on it at healthier here. We selected for those of the four projects at the top the state also assigned wait to those projects. So those percentages are actually how much weight is assigned to the measures and the incentive dollars. So in Translation by directional integration that is 56% that means 56% of the dollars. We could earn are going to be tied to the metrics that are in that column. Where is For the opioid use only 7% of the dollars that we can earn are tied to those measures. So it also what it does for us as an organization is helps us prioritize some of our work toward that I value measures so we can bring in more money. And then once we have the incentive dollars, once we learn to them we can use them. However we want and so that's the nice thing about the performance-based Contracting. On the last live regarding performance-based Contracting. So we see the makeup of the full funding what has been your yearly budget and have you been able to maintain the funding this year given the incentive payment has started by 17 in 2018. We did earn 100% of the dollars. We were eligible to earn. Hotels by 2019 the minute we will learn them. Arizona turn over to Jeff. Now who's going to I'm just a little deeper into our project portfolio and how we're moving the work forward Susan said that we had set of a message that we area that we could focus on and we decided as a company more to really narrow it down to four for was the minimum that the state require two of them were targets that were dictated to a site that's not very good to two that were required is starting with the very Inner Circle is the integrated care in that then integration of physical and behavioral health or as I always tell people it's bringing people to body in their heads together. If you will that deal we are serving the whole person as opposed to our system in the past which had funding that came down for physical care have separate funding that came down for So this is about time that all together and doing so at a r a c h level but then also as we sort of bring that down to the the experience for the patient as well. The other man was around opioid use disorder and we'll get an into Susan's going to talk about these two a little greater extent and obviously that was one of them have mandated areas and obviously something that is very has been very important for us here in the county of the two that were optional were that we picked were what's called transitions increase safe and successful transpositions specifically for those leaving jail, and for those leaving the hospital and then the other is the expansion sports for those with chronic conditions. So as you can see that those are all things that serpent fit very well insert of the sort of the larger goals that we have both in the county and in the city Are you going to talk more about the transitions? Yes, so she wasn't going to go into a little more depth about each of those II slight here. The next flight here is super super important is at Susan has been talking about is her to the equity framework that our board has set around all of this so that it isn't just enough that we sort of meet these targets if he will that we really need to be very Vigilant about making sure that the equity is sort of foot throughout everything that we do so that we are not just improving the health outcomes of certain segments of our population, but that we are doing this for everybody and in particular lifting those who are at who have the most disparities. So and also that we are put the other framework is really that lid this becomes a very a consumer-focused process as well so that we have these three Frameworks. We work from in that Community Based care coordination. So that things happened to rub on the ground where people are accessing care that we are addressing the social determinants of health and everything we do and that we are improving equity and reducing disparities. I'm going to have Susan talk some specifically about the areas that down a little bit for you. I'm so starting with v physical Behavioral Health integration work. So this is really you've probably heard a lot about this. It's been going on Statewide for a number of years now and the waiver work is designed to complement what the state has been doing, which is to move great the finances for Behavioral Health that which includes both mental health and substance use disorder treatment with the physical health care System into single integrated Managed Care contracts and that started in King County on January one of this year that financial integration what the waiver is doing and what we have the opportunity to do through healthier here then is to make sure that the integration goes beyond just integrating the finances, but actually that I'm at the clinical point-of-care that care is delivered in an integrated we're away and that providers are at Addressing whole person needs is Jeff described the head and the body and all of the needs of an individual and stuff instead of just one piece every hospital and Medical Center in our region signed into this if somebody comes up and in for emergency treatment that they will be admitted and Medicare or Medicaid will help cover that so I so yes, everybody is all of the hospitals in the region are partnering with healthier here. We because of the size and scope in the number of providers. We have we have to Stage a little bit and so not everybody will receive resources in and shift to the new model in 2019, but it will be kind of a rolling we have sort of cohorts of providers, but at the end by the end of the waiver what that is one of our main goals, which is that where ever anybody receives their care in Kane County. They are there Whole Health needs are getting mad and they have a multidisciplinary. A scare that address is all of their needs with prescription drugs are other types of drugs if they're in chronic pain, and then we also know that especially for a kiddos sometimes they are perceived as acting out when really they have an oral Health crisis is is oral health integrated into this model as well. So I thank you for asking a question or else is a very significant component to all of this and actually crosses all of the projects in the initial version in a way that the waiver was written and it is not but I can tell you that sort of the long-term vision for the state is to start with physical Behavioral Health and then to roll in oral health and then also some of the long-term services and supports again to you want to get sort of the financing in the incentives and the and so forth all in the in the same place. We have had a partnership with your Cora Foundation. We have been with which works the Washington Dental Association and makes more sense to me anyway, and we've been having conversations with our providers as well. So that as especially when we talked about making modifications to electronic health records and other ways that people are screened which are very costly and time-consuming that if maybe we're just going to focus on physical and behavioral health right now, but let's put the question so we only have to like do the modification once and then put the resource behind at a later date. So I anticipate that we will get there as you think about additional metrics that you're holding yourself accountable to that might be outside of what we're getting reimbursed for. I think oral health is really critically important in our lens of today and tomorrow and terms. Women's Health and maternal health and child health. We know that access to appropriate preventive oral health is good for those who are pregnant and those who may become pregnant and the health of their babies in the future and health disparities really do stem from poor oral health access. I'm in many cases for those who are trying to conceive or are having a baby soon. So I really think that is at Health Equity issue as well and appreciate you bringing that forward. Thank you. I'm so some of the levers for a healthier here for the integration is the development of mechanisms for shared care planning across providers and provider types. We will also be looking to enhance the screening and identification of individuals with chronic medical or behavioral health conditions again, regardless of where they enter the system and so what this means is that if a person goes into for example of community behavioral health agency because they're depressed the community behavioral health agency is also bringing them to see if they've seen a primary care doctor and if they have any chronic conditions that might be impacting their depression and vice-versa so that in Primary Care people are reading screen for mental illness and substance. Use. We also hope to continue to expand evidence-based and best practice approaches to Kara cross providers will be developing interoperability is of data system. So that data systems and electronic health records can talk to each other. We know that the one of the biggest barriers to doing whole person care is that people don't have the they have don't have the information they need and information is not easily flowing or being shared across providers and provider type. So we're working on solutions to that and then enhanced care coordination again to help if people are receiving services for multiple providers, which is the the highest likely scenario and Kane County that that care there's mechanisms to coordinate care amongst those providers last budget cycle. We put money in for a coordinated approach. There is a group up in Northgate that answers to 11 alley Franklin is our contact if you're working with her, but I'd love to know partly this arose out of something and I'll be on my soapbox just 30 seconds. We also put money in for something that we called the lower. Acuity approach for our First Responders so that this is a little different approach but it's not it's not new. It's just Seattle has an adopted it yet. But we're working on that. I want it done in 20, why was hoping by March but we're hoping by the at least the second quarter and two rather than sending out our firefighters are First Responders with ladder trucks and ambulances for somebody who made just simply need a different kind of response but doesn't it's not a high Acuity response. It's a low Acuity meaning maybe it's an overdose. Maybe it's somebody who's passed out from alcohol whatever but the ideas that we send people out in a And a glorified mom than not with an ambulance in a ladder truck, but people that we may have a nurse practitioner on board may have somebody with mental health or Behavioral Health Training. And then maybe there is a first responder that has the basic Medical Response right at their fingertips, but overall it if we are picking up this model from Colorado Springs Mesa Arizona as to that it makes so much sense in a system-wide approach because people get the care that they needed the level that they need but the big-ticket is it we have to have a bed for them. We've got to have a place where they can go 24-7 may not be Harborview Hospital but it needs a place where they can you know, get whatever care they need for that. Of time. So I'm working with every provider anybody who will sit still long enough to talk to me. We need more beds and then that of course means we need more housing and that of course is something that council member Miss Katie and I are real. Deeply focused on but I'd love to talk to you more about how we integrate Arlo Acuity model with the work you're doing. So I would love to follow up and talk with you more about that to that is very consistent with on some of the conversations that we are having. I was saying to Jeff earlier our conversation is starting in the with the emergency department and how we provide preventable Emergency Department business, which is that low Acuity people that you're talking about Landing there. And so I think there's real opportunity there to leverage the resources and the interests had to really build out something creative and Innovative for a region fabulous. So before you leave today, let's make sure we exchange phone numbers you are you are part of the linchpin of what we're trying to accomplish. Yes, we would love to do that. And then I'll just a side note. We are working with crisis Connections in La Franklin and I are very excited with with that that partnership that the city and with the city is bringing two. I'll talk in a minute about the concept Ally's probably talk to you about the Community Information exchange. Right and we have our region is come up and every table and design planning meeting that we have had and so we are going to actually healthier here is going to convene all interested parties around that it's going to take all of us to to build it and get it to scale. I'm over the next couple years you are the best and if I can ask a will will follow up on this we would we my office would really like to be involved and I've got one individual who is my legislative aide that Allison McClain has been deeply engaged in this from mental health and Behavioral Health has good close connections with the county and if I can't be there we would really like to have her there just so we're sharing the same information. Thank you. Yes, we would love to have you there as well. I was just going to get out that the beauty of the health of your hair. It is this very does 26-member very cross-sectional group of folks. So as the issues of like the little cutie Pizza rises in the city that it's a very quick discussion with Alicia it from Harborview who's also on our governing board with Susan and so we can quickly to prevent the silos from becoming even more Silo to that we use for quickly begin service of class discussions. I have great faith in conversation instead of seven conversations, right so we can get more together really quickly and this includes Jeff mentioned transitions from hospitals transitions from Psychiatric settings and transitions from jails in 2019 healthier here is going to focus primarily on Psychiatric settings and then we'll expand out to include transitions from jail. Although knowing that we're talking often times about the same individuals who it's you know, it's kind of a roll of the dice whether or not abandoned Atlanta jail or a hospital. So we're very mindful of that. So very Pine and somebody that I've worked with for decades and she is in the King County Jail help. One of the issues that she and I talked about before is that if we put in somebody ends up in jail, we know that it's traumatic more dramatic than almost anything else. But if it's somebody who is suffering from an addiction, we need to get them on a plan before they leave the jail for ongoing with it. We can get him on buprenorphine or if it's methadone or whatever and I keep running into walls for people so we can't do that because the feds don't allow us to do that because and it makes no sense to me if we can get people stabilized provide him with a plan to make a move on rather than just that spin cycle back on the streets buy more drugs. So I'd love for us as part of our conversation. If you can give me an update on that absolutely absolutely insane so far. Have you seen an uptick and folks accessing Transitional Care Services? And what do you think has been the most kind of meaningful lever there? So we are just moving into a Implemented much of anything yet. That is our entire 2019 and end. In fact today. We have a governing board meeting. They are going to hopefully you are a 2019 investment strategy of about 8.7 million dollars that will go into these four areas that were talking about and so I will have more information on that as we move further into the year and would love to come back in and share some of that the things that are working and lessons that were learning from the soil and one of the things that we were able to do last year with come from Raja the chair of budget was to put some analysis into the budget of how are Health Services or how the jail environment is affecting individual health and wanted feedback. Wild King County manages the jails. It's within our border. So I think we feel that there is a responsibility and a role for us to play to make sure that those who are going into Tell them we're trying to do everything we can to prevent that that they actually have a health policy or experience in there and that they're not being exposed to mold that war trauma or harassment. And if your body is able to sort of give us any feedback if there's things that you're hearing in terms of asthma or conditions that people are experiencing higher rates when they going to jail, we would love to have that Health Data so that we can do our part to help respond. Great. I will attack into that and see what kind of data we have access to at the moment. We're continuing to build out our access to data obviously day does a huge part of this so that we can both track how are doing and make course Corrections when we need to but also understand where the kids are so management of chronic conditions healthier here is in addition to a primary focus on people experiencing mental illness and substance use. We are focusing on cardiovascular disease diabetes. Asthma and chronic obstructive pulmonary disease for our region and will support activities that help manage and prevent the worsening of these conditions. So your question is really Irrelevant in terms of who is it exposure on includes things like making sure that providers have the necessary knowledge and tools to manage the population. So who if I'm a primary care clinic who are all the people in my clinic that have diabetes and what percentage of them have uncontrolled diabetes and I'm going to really focus in on following up with them and getting them into their appointments and trying to get their diabetes under control and that's an example of how that would work. I'm also community-based self-management support. So whether a person is newly diagnosed are transitioning out of a hospital or jail, and I have a chronic condition who is working with them in the home to make sure they can fill their medications. They know how to take their medications appropriately. They can do all their follow-up help with exercise access to nutritious food. I'm as examples and community health workers are a core part of that. And that is one of the things that we had help your hair very interested in building capacity for those non-traditional community-based Workforce that can really support people in their Community speak the same language have common experiences and so forth. Healthier here become something that people think of it. Let's just say I'm a nurse and a small Clinic do I think about what is healthier here doing do I think that there might be some resources online that I could go to because it strikes me that everything you're talkin about about integrating. The system is precisely what we've been trying to accomplish for dads and that you're now doing it. So do people know about you. So I guess I know some people and our goal is to make sure everybody knows about us and we're doing a lot to make that happen as we go through the waiver process and more and more communication via all of that Medicaid Hospital health systems community health centers and Behavioral Health agencies know about us as an organization known that doesn't mean everybody in the organization knows about us yet. We just have been going through just going to talk about the process. We've been going through around are community-based organizations and also consume Where's and community members we've been doing a lot to try and engage those folks. So today I would say people who are connected and no doubt the Waverunner really interested in being a partner know about us but not everybody and we're working on that. The fun slow process where we actually begin to, you know, reimbursed folks for uplighting to care. Obviously, then that allowing these agencies to hire community health workers. All those things will obviously bring all of this up for very quickly once we're through later this year when we're at that State that and I think one of the unique things and Jeff alluded to it about healthier here again, I go back to you because we are not wear a stand-alone organization were represented by every sector in our community is being part of our Running board. So I'm really trying to be community-driven but really can focus on what's best for the people and not any single sector organization. And so we do I get the word out. One of our values is that all of the transformation is driven by those individuals that are are living the system and having the experiences in it. And so that they are really are the ones that can identify the solution. So we're working on mechanisms to to create that in a in a more sustainable way. I'm just really quickly focus is really on three areas. We want on those doctors that are and individuals that are prescribing opioids to do them in line with the state and National guidelines. Make sure we're being conservative about that in preventing opiate use disorders and then increasing access to medication assisted treatment and overdose prevention. So on and we are really I'm as you know, there is a lot of work around that heroin an opiate addiction going on the city's been involved in the county for a couple of years. Now. There's a lot of federal money coming into the region to address the opioid crisis. And so we are really working with all of the partners who are receiving that money and and trying to implement things to streamline and a line so that we're working towards those common goals is something that we all in at this table have been focused on since the Seattle King County report came out at several years ago. Now and I know Jeff you've been involved in that from the beginning. So a couple of these roadblocks that we hear about is where is buprenorphine uponor fitting may be really good for some methadone may be better for others but having it available where the people are is critical as I think it was. Dr. Caleb granny said to me I'm not going to drive to Renton to get my morning cup of coffee and I think that's similar here. We're learning that buprenorphine is available much more Eminem any more locations than we knew dozens across the city that hospitals may have its own clinics may have it but having our general practitioners sign up and be willing to be a provider. Could I hear is that when we really don't want to focus their practice just on people who have addictions so that there's you know, maybe a little reluctance and become a have more more people getting to the level where that they're able to prescribe. So that's said we're just looking for we know that there's no sickness Silver Bullet, but there are silver Buckshot here. And I think you're doing some good work for us. But if there's Federal money flowing into our region and it can be used for more clinics or more doctors or helping people get the training that they need to be able to do the prescribing. I just like to broaden those open those Gates a little bit to see what we can do it on demand, especially this medically assisted treatment can really work. Yes, absolutely. So I'm trying to continually conscience of the fact that you're not a grant that you are a pay-for-performance contract between the federal government and the state and between the state and healthier here and healthier here is one element of healthier Washington. Okay. So your role is to make sure that we are receiving funding in our region from these federal dollars by improving Health outcomes and more integrated. So there's a number of partners that you've mentioned. I think it would be helpful for me as have a better sense of who those partners are specifically as we think about the opioid crisis in our region who are some of these partners that were working on what are some of the types of services that have changed and I'm have you seen a notable or measurable impact You all have been working together to try to have greater integration and coordination across providers, especially in this area. I just feel like we're on a hamster wheel in dr. Seuss. Dr. Jeff. I just died. I upgraded you to a doctor because yes our health care experts to cut my hair knows better than anyone in a we are losing ground, especially on opioid addiction issues and despite our best efforts at the city to try to freeze, you know a safe place for overdose prevention sites. We continue to hit Roblox, especially with the federal government, but the other cities are facing the same thing on this issue. Can you tell us is there any key partners that you've been working with and anything that using the city of Seattle needs to step up to help on this? So I'm at the the short answer is yes, I can tell you but not off the top of my head. So I will get you a list of all of our Medicaid funded providers that are Working with us directly and on which projects because not everybody signed up for every project and then just going to talk a little bit about are community-based organizations. We are still in the kind of winnowing down of social service agencies that will partner with us. So I won't have that kind of finalize list until probably met but then I can get that to you because and then what we'll be doing is bringing those clinical and Community Partners together actually build out a The Innovation strategies that some of that work is beginning and so I can get you the names of those should we doing downstairs? And I thought we were trying to explain while we are but so let me say that we eat a limited amount of time a limited amount of money in a limited amount of capacity so we can't work with especially when you talk about Community. They Social Service organizations in King County where there's over five hundred we can't work with everybody all at the same time and when you're talking about also connecting that Community social determinant To the healthcare delivery system and a new and different way like that's not happening at all right now barely there's maybe a little pockets of Partnerships, but for the most part if I'm a primary care doctor in a clinic, I don't really know where to send people for housing supports or to get that. You know, I'm a Tekkit access to healthy food or and so forth. And so we are we're building it out. So we can't do that with 500 providers all at once. So the amount of smaller number of providers that we can start with and that we can design that are models and workout kind of all of The Kinks in it and then in so we would do that in 2019. So that in 2020 are investments can really focus on scaling it and bring it to other providers. Yeah guy takes us directly into the next slide here. We are again a lot of the work that we've been doing the engagement of the healthcare provider. Has been pretty straightforward cuz he's our agency's or entities that have worked with Medicaid for many many years at and sort of have a head start if you will, but I think that the real change here is really short of being able to help community-based organizations to be a part of this process. And in that what we do is that we really start to begin doing interventions as opposed to get all of the the the work of the healthcare provider to report for the bathtub for a person already has a health condition. And so this is the really exciting up our car at least for me. I love this transformation process. So I'd Susan said that the first step has been just to sort of kind of throw up and see who it's going to be a part of this and then there's some work that they have to sort of engaging but the beauty of the waiver project and what you saw in the first year first year 1 and year 2 Is that we'd have been able to provide a lot of these agencies some upfront funding to really kind of assess their ability to participate and to understand what what it means to be a part of this process. So that has what has gone on as Susan said we will be selecting a cohort of organizations to to begin working initially. Obviously that can expand over time as well. And it is to really have that linkage that Susan talked about this new this is really about where we begin to make sure that the individuals that hard being seen in our community based agencies are also connected to health care, but that not just that the connections are made but that the actual sort of care planning and tired of looking at the person and in their in their total being as to how we can best improve their health and prevent disease. I tell you I love this Slide the long-term what success looks like, you know, we said, okay, we have a limited amount of time five years and a limited amount of money. We can't do everything at the end of five years. If we were to say, how is the region different this is what the board came up with these four things on the slide So, yeah. Thank you. I'm so the other thing that I wanted to talk real briefly about he is sort of that sort of the actual governing structure of that. We are working under and that one third of our board is community consumer tribes and community-based organizations that that the that we have a very specific Community tank stupor voice committee that he is a formal part of everything that we do that everything that any decision that we sort of move forward on is passed through this committee and they provide the both the and put it in his development as well as sort of recommendations about how the governing board should move forward and also as we talked about previously he is getting money out to a lot of entities initially just to try to be able to have folks participate up to this level of the other small grants. What is smog what do you use small grants for me? 937. $3,700 doesn't strike me that's going to make much of a difference ran in 2018 was specifically to work with me based organizations that are embedded in various communities to actually run focus groups and Survey their Medicaid individual about the Healthcare System. What's working? What's not working how it what can we improve upon? And so it really dependent on the size of the organization and if they were doing some organization said what we can do to focus groups are there said we can get you know, 250 surveys done by people. And so that's that's the range of you can see that we ended up with 988 906 who receiving Medicaid to complete surveys about their experience with the healthcare delivery system in 11 different languages. And so we really trying to reach a broad base of When you do provide the information on the committee partners that you're working with it be helpful in these two sides to have a breakdown of organizations based on who they're serving communities of color lower-income folks when you talked about Community, what were they called work community health workers. What I was thinking is put on I thought us from the steam iron model. And so if you could give us that those demographics of him to be super helpful for us to get a better sense of who you're all working with in King County. Absolutely. So the next life that I live was going to touch on briefly and obviously something that aligns very much with the part that we are doing in the city here is now that's really about Workforce Development saw a piece of the the finding that we will be working with is really going to be focused on trying to answer some very complex questions around sort of building the capacity for us to to serve all of the individuals that we'd like to serve us so that it's ensuring that we have a trained Workforce time in some of the areas of vertically around obviously health and Behavioral Health build capacity and areas of care coordination than the community health workers in a peer support specialist. Obviously, there are models and varied various places of how those route programs can work effectively and so we would obviously use those models and figure out a way again building pass. The here in our County and then Hylian with other initiative initiative and this is where the city comes in cuz we to within the city have a variety of different Workforce Development initiative that we would like to align with our process. Can you talk a little bit more about that? Does that mean access to high-quality union jobs in the healthcare industry. So we have recently connected with the health industry leadership table 3 of that City. I think it's through that economic development in the Seattle jobs initiative is a big part of that that is really looking into labor yet. Some of the labor unions are involved in the health industry leadership table as well, which is how do we you know, what go all the way into our middle schools and high schools to get people excited about healthcare jobs. But also when we pull went as people come in to sort of entry level jobs in health systems for example, and they might be a janitor or somebody that works in the hospital cafeteria that they're actually putting mechanisms in place to expose those individuals to a wide variety of jobs within the healthcare delivery system and creating what they call. Flat scale program so that I may come in as a janitor and I might have access to English as a second language courses and other kinds of opportunities and maybe I didn't even know I could be a medical assistant or a you know, it's up to something else. And so they're creating Pathways to move into jobs that will pay more livable wages. So he just said that and I missed it. But are we working with our promise the two years of going into call it local colleges for this one of the things that I've learned from my favorite friends in the construction unions is often times if they can reach kids at the high school level to help them with math skills basic math skills, whether it's you know, you need fractions on taking a measurement, whatever it might be if we can start early then it really helps people be ready for these kinds of jobs and I have to believe that the same thing is true about the medical world. We had not so thank you for that suggestion. I will absolutely look into into that as well. I know that Rick Burke and he's on the Seattle public school board that it's an these apprenticeship opportunities and internship opportunities of really high on his list. So if you're looking at reaching out to the community, I would just so you After you contact him and feel free to let him know that you've been at this committee. Thank you very much. I will do that. So what the health partner so UFCW health nurse Union that I can think of you. Yeah, your knowledge is beyond at the IU and the other Union that you mentioned were represented. I'm not sure about the 1099 was the SEIU getting into the healthcare industry is special editions. The industry Healthcare field profession is that they struggle to make good living wage jobs. And so as we think about creating more affordable housing The things that's happening at the packed our you remember the old Pacific Hospital Tower that's over there. Now. We've never feel that with Community organizations with an orientation towards health and there is a Dental training program. There is a nurse training program there and it's run by Partners from our Seattle college system that are how is there and then the Future Vision is to create affordable housing for folks on that North lot. So it all connects here and I'm glad to hear that you're working with those Union Partners is critical that packed our area occasionally a little bit of questions about the money and tell you all about it. I will say is that it's at you know, it sounds like a lot of money and when you start to sort of did it when you get it how you earn it whether or not you're in all of it and all the people that want some of it. Quickly, we have a responsibility ultimately the governing board to figure out as we think about making the investments in this huge opportunity that's in front of us. How can we be the most impactful and change knowing that we're not going to get it all done in 5 years with the waiver. I'm in so creating a balance between how much goes to individual provider organizations versus system-level Investments that benefit everybody like the Community Information exchange isn't money that would go to a single provider. But rather is a system-level investment that connects providers together and we need to do both in order to make this work. We also have to make sure we balance Investments between kind of the traditional Health Care delivery system and are community-based organizations and tribes in areas of everything is going underfunded if we really want to bring them together in a leveled way big hospitals and Health Systems don't need as much resources from us as a small community-based organization who is I'm trying to provide coordination for for example of the Somali Community or something like that. So that is part of the strategy going forward. I will also point out that while we do have money and investing in transformation is a big significant important role for us. We do have other roles that we are playing in this region. We've talked a lot about convening partners and stakeholders again, because healthier hair is this multi-stakeholder approach. We don't represent any single organization or sector we are well poised to bring Partners together to talk about really critical issues that affect the whole system shared care planning. How do we standardize the collection of social determinant information and so forth. We have to have a policy roll at we are participating both in local and Statewide policy-making related to our transformation goals. There are a number of policy barriers that while you have providers who want to deliver integrated care There are rules and regulations that protect I'm doing it sometimes it's around credentialing and Licensing issues. Sometimes it's around what kinds of codes can be used on the same day. And so we need to remove those barriers. If we want people to actually deliver integrated whole person care. And then the last piece of sustainability. We are making me pretty significant investments in transformation because this isn't a grant-funded we don't want it to work like a grant fund. We don't want the good work to go away when the money goes away. So we are working with the Health Care Authority will be working with our Managed Care organizations. When we identify care models that really work. We want to find ways through value-based payment arrangements for those care models to be fully covered and resource under the Medicaid Program where it's appropriate and where it's not we have to identify other resources to sustain its so we will be working on that as well. What happens at the end of five years. The 1115 waivers and the delivery system reform incentive programs are renewable. It's given with the current federal Administration is highly unlikely and New York who is ahead of ours and was trying to renew their waiver and they weren't able to get there if there's an Administration change and $20 waiver will not end till 2021. So if there is an Administration change your new thoughts on the value of this there's the potential for a renewal if we don't draw down all of our funding we can do a no-cost extension to continue to be able to draw down the funding options with the waiver. And then there's other options as I mentioned with regard to some of the individual Investments and projects that we do if we can create mechanisms to have them sustained under a Medicaid contract or I'm through another mechanism. Different Medicaid contract is different from the waiver. So there's money out there in different buckets. And so the state has a Medicaid State plan to provide health and Behavioral Health Services and and long-term care services and developmental disabilities. Those contracts are not changing today. They are the same in that money still flows exactly the same this is actually the rules of Medicaid and allows the state to use it in new innovative ways to pay for things Medicaid doesn't today pay for under the Medicaid contract to test new ways of innovation. Now the the the trade-off and all of that is that it be at the end of the day the waiver has to be budget-neutral to the federal government. So then so the way I kind of Private is the federal government is fronting the State Medicaid Program in the state is agreeing to reduce the total Medicaid spend the directory of the Medicaid spend by a certain amount so that it's budget-neutral to the federal government. This is an area that I just love. So let's anticipate that things go. Well, we'll revenue-neutral mean that they will look at system-wide investment. So back to Arlo Accu if we can demonstrate that are fire department saves money because it's not sending out eight guys or our First Responders and ladder trucks and they're not taking an individual to Harborview Medical Center, which is you know, if you just assume all that is a $2,000 response at $2,000 overnight. If you can save okay with safety system $4,000 will that endure to our benefit of real people say it's kind of like it's not really budget-neutral because the fire department eats Ed or EOD ESC has a nurse Mary on site that they have to pay for. How are we going to really demonstrate that it's revenue-neutral? Revenue neutral to the feds that's like a formula at the state just has to meet but I think what you're really talking about is how do we ensure if we're saving money to the system that that money is getting reinvested in these less expensive things that really work and that is the goal. And that is the Hope and you probably know from the positions that you sit in the work that you do that is sometimes easier said than done and we're identifying where the savings accrue to whom is a big factor in that certainly when you're reducing emergency department visits and inpatient hospital stays. It's accruing at the house plans the savings and say you want them to reinvest there's other ways where savings might be approving to the criminal justice system will be an evaluation of all the work that happens both locally and Statewide and the hope is to yes to say, you know what this is working better and more effectively and saving money. We move our resources. Reallocate them here because it's going to generate savings and I'm to the extent possible. We really do want people that are experiencing no savings to reinvest those resources in the community and there will be doing some negotiation around that as well. Is informed on that Susan that is such a tricky area, but we know just experienced really and just common sense says if you can save $4,000 from one run up to Harborview, that's a really good thing that lets reinvest that money in the in our fire department or reinvest. So that dese can afford to have a 24/7 nurse on side is that reduces the number of calls to the fire department at exactly I could buy you instead of wine and 30 minutes total available anticipated budget for the 5-year waiver is 97 million dollars. This shows you the amounts across the years and down the left-hand side are just use categories and what you can take a look at but the most Important thing is 97 million across the five years. It's based on certain assumptions. So there is a chance we could earn more than what we need to be conservative because we don't want to kind of go off a cliff 75 billion of that 97 million is the project incentive dollars that we've been talking about. So if you flip to the next slide that 75 million then gets divided amongst Medicaid providers community-based organizations tribes and a little bit to healthier here to support the implementation. And so again, this is for the five years you can see how it's divided it up. So that's the money that won't go into the system over the next next several years for this transformation work. And as we move into implementation this year, as I said what we were happy to come back and give kind of regular updates about where we're investing and what's working. And what's not working and Lessons Learned. So thank you so much for that. I'm sorry. We ran over by the sea. Super excited. I think there's a lot of opportunity for partnership and Alignment. So I look forward to follow up a member of the governing board with this is really a diverse group of folks that we are so lucky to have Susan sort of leading this process here. If it is at end of staff. I she has an amazing staff that she has put together as well. So I'm not too far from here between spring and Madison on second. So I was excited to learn about all that you're doing. I hear a lot about accountable communities of health and it doesn't really actually give you a vision of what's happening. So what you just started you later today, really handsome picture of how our Community Partners are involved. I think with a better understanding of who you're working with once you've narrow that down to your core group that will be helpful for us to know why I'm excited. I'm sort of nervous about this need to have Medicaid dollars be a neutral to the federal government and to me that really means that we have to get this this housing stability economic stability area of the social determinants of Health right in our County and the city's going to play a huge role in that if in the future future Medicaid reimbursement dollars, I know they're stable for now, but if there's somehow affected by dollars not needing to be offset by the front loading of investment into the transformation waiver, maybe that don't materialize later and a future Federal Administration decides that they're going to reduce our dollar amount for overall Medicaid reimbursement. That could be pretty traumatizing. So I think there's a lot of opportunity here, but it does feel like it of theirs. There's also a lot of the factors that may be out of your control its specific to your network or your partner's and that I think is a huge real. Press the play. So love to stay engaged. I'd love to come to one of your community meetings or whatever. You think would be the link to our website that tells the dates and times of the various meetings, and then the last thing I think it would help her back. She was asking about which is I'm also very interested in the succession of this after the five-year period And Drive Hallsville will be successful, and we'll have a different way of implementing Healthcare in the future, but at this point, I would love to work with you to make sure that that's five year mark doesn't equal a cliff and thank you. Thank you. Thank you. Thanks for allowing yourself to be represented on our board is very excited. Thank you so much. High demand number to Seattle Housing Authority update for briefing and discussion. Thank you for today. And we often and Jared Comer is okay. Hi guys. Welcome. Thank you for reaching out to our office with this good news about the project that you're working on Wii. I think of TWP well why we have Integrated Health and housing into one committee, not to mention workers rights and making sure that folks have greater access to economic stability. I'm so looking forward to hearing more from you about your work to preserve access to affordable housing and the ways in which may be a city council can be helpful. Thank you. It's a pleasure to be here appreciate the opportunity to share with you the new program that we are embarking upon that there are also a few other questions that were raised and I thought I would do a couple things. I would catch on for things 3 very briefly very high level and then 4th is the acquisition program in in going to some depth with that but I thought I would talk a little bit give you a snapshot on where we are with yes or Terrace at snapshot on where we are with the home from school program, which is connected with which apps are terrorists and and and give you a little background of where we are with that sound also about our work on our housing stability efforts that are under way and then spend the rest of the time on the acquisition and preservation program. So I'll try to do very high level of those other three will be back to you on yesler Terrace. I believe that we You do an annual report to you on where we doing with that. So I won't spend a lot of time of that. So at yesterday, I guess at a high level two stamps not to think that we are very pleased with the progress there. It's all just by the Numbers we have completed or we'll have completed by the end of this month 298 of the 561 replacement units. We are very excited about that the opening of the red cedar which is our fifth building which will be completed sometime in the next 30 days will bring those replacement housing units up to 298. In addition to that. We have two more projects in the pipeline one that will get started this spring or late this firm over the summer on Oakey and another which is in a partnership with the South China Town International. Wda and capital housing on the old County record site. They will be doing 156 units of affordable housing 892 of which will be replacement and the project that we're doing the hinoki project that's going to be started later. This year will add another hundred thirty-nine units 88 at which will be replacing housing the completion of those two projects. We will have 85% of all the replacement housing Den. I'm so hinoki starts in next start sometime this summer and South Town at the Capitol Hill to the record side project is still in discussions and and design so they won't probably get started for another year or so, but we're very excited about the the pace that has been happening and we are very close to completion of those two buildings completion of all the replacement housing. We are about a third of the way already with the 60% tax credit housing. We've got the third event completed they would schedule do a 300 units there. We've got a little over a hundred done with a deed stand two buildings that were talking about will be two-thirds the way to finish with all that tax credit housing and then the market rate and 80% housing is also moving along very well. We will have a 3rd and Market, rebuilding complete in about a month as well. And then we have two additional market-rate two projects that are currently under construction. So things are moving along very well there. Are buildings that have been opened our fault the market rate buildings have been leasing space has been very very strong to the word. We are pleased with the response to the market. But yes, Lord Harris, I think people see these beautiful buildings and they assume that all of them are market-rate what you have done what you've just described as you've actually improve the conditions. It is absolutely within the city's roles and responsibilities to recognize when we have housing that may be unhealthy or an accessible to our growing population by its low height to rebelde free additional height to create an inclusive community that's mixed income folks who came to testify yesterday. Unfortunately in the planning committee assume that their warrants are folks. Who were Beasley living there getting in and what you've just said is that there's going to be 85% of the replacement housing being built on site and that you have a number 92 replacement housing units coming and replace my house is coming in and currently 298 unit replacement Adam housing options available. Now is what I heard I've been completed the other figures you use the 92 and 88. Those are in in the planning stage. They're onto buildings that will be completed. And so those will be done that those goddamn collection collection of folk of a building's equal 85% of our replacement housing all hundred percent of the house replacing housing will be built on site. So this just represents the progress. I'm so we are meeting our commitments that we have made to the community individual residents. Also, I'm who have Moved off-site are able to come back on side. They have first call on those units and they are taking advantage of that. I have two will have a full report on that for you. I want me come to talk to you about yesterday at Terrace. But here I just wanted to give you a snapshot to share with you the good news and in and the progress that has been made there and if there are additional questions. Before we come back to you with more than willing to come back in and give you a further briefing on the designs were just coming to fruition and to see how many people now are coming back is exciting. Can you remind me what the total numbers what they anticipated numbers are so we have the very low-income. We are bringing people back the 500. I believe that were 561 498 families at the time but So all 561 units will be replaced on site. I'm all 498 households have the guaranteed right to return to those those units many of them are taking advantage of that many of them did not relocate off site. They relocated to properties that were existing in so they moved a couple of times cuz they did they did not want to leave the facility and as units to come available, they're moving then directly into the unit. So they don't have to move outside and come back those that did move off-site when projects are completed. They get notified that there's units available. Are you interested in coming back? I'm in then we will work with them to meet their needs and in that requirement percentage of the people that are choosing to come back or rough numbers. More than half probably in the 70% range when you say come back since many of them didn't leave the majority of folks. I'm who led the yes or terrorists will be able to return to yesterday. And then when you're thinking about Market raid or reportable rate at how many more units are we building up there? So we're replacing all 561 public housing units were creating an additional 300 tax credit units at 60% of area median income. They're also creating an additional 802 850 units that are that are part of it at 80% of area median income in below 850 And the balance of the units will be market rate. So somewhere between 2500 and 3000 market rate units will then be built in addition to that. So all told we are creating a roughly 4500 to 5000 total units in that strata. 561 units and now you've created more than 5,000 units on the same property. Thank you for that. I am hopeful that the people who came to testify yesterday hear this message and that you have clarified for the record. We will continue to clarify as well. It is erroneous to believe that anybody was displaced for that development, which has been absolutely inclusive. I had a chance to to where I don't know if you had the chance to her as well, but would encourage all of our council members to go and go on that great or as well. Have you seen the new soccer soccer field and just seen the kids up there and saw the store. Storm players up working with the kids and then we've got the streetcar. It's an amazing effort. So I thank you for the house of red cedar at what is that said will be completed later this month and and will be scheduling open house and invite all of you to come and take a look at not only the red cedar but also the entire project. Secondly the one of the emphasis at BSR Terrace has been focusing on Bailey gatzert and creating an opportunity to improve that the value of the quality of the school one issue is the significant of homeless families that are homeless students that are attending Bailey answered. So we created a program to house the students families who are homeless going to Bailey gatzert couple of 3 years ago. We have seen it had 50 / the three years including this year about 51 families referred to us. We have issued than 36 51 of this Route 36 vouchers. I'm in the 28th of those were house. I'm in 25 of them remain house. So we are working continually with the school and attended the schools homeless counselors to identify students who are experiencing homelessness that are going to Bailey gatzert trying to find Housing Solutions for them and then provide them some light services to help them through the transition from Homosassa to after being how so that program is is we're pleased with it. It is helping to stabilize the school itself, which is what the the by Design was so that the education experience for the students that are going there mostly of which are living I guess or terrorist is improved in We've got some outdated that shows that that's that's occurring and it will be able to share that with you when we come back later on for a briefing to get for Terrace. and 14th and then finally, there's been a lot of effort on our part as we focus on housing stability and by that we mean keeping our residents house as as we house them. There are some challenges that some run into around. I'm their ability to meet all of their obligations and we're trying to figure out ways in which we can be more supportive of our residents so that we have fewer that ultimately end up in having to leave our housing. I'm so we have worked with some community members to identify some areas that were of concern how we work with our own staff to try to streamline our processes to make sure that we are considering all the factors that go into the situation that the individual is in. I'm we are reaching out to a lot of our Community Partners who provide services to our residents so that they've shift a little bit of their focus to really housing stability and War. He with a is a family very directly on your obligations and what has to happen. And what are the options that we have to work with them with so that they can prevent a there a nothing excessive Larry Enticer necessary termination of their housing and that's been we think successful we have to begin with less than 1% of our residents have to go through an eviction process. In any event. I'm with some of the changes we've made that's gone down to less than one-half of 1% I'm so we're continuing to work through that were continued says to to see if we if there are ways in which we can be much more supportive of our residents and do it earlier so that it doesn't become a crisis situation. We're not always able to do that, but that's our goal and so will continue to keep you apprised of how we're doing in that in that area. What what is the number one half of 1% in the 2017? I believe it's 51 individuals in 2018 is about 28 the policies that you put in place for those changes to be recognized and needle to the extent that we can help on anything else. One of the things that I want to make sure is that we correct the narrative supposed to believe that there is a higher rates of eviction at Seattle Housing Authority home and you've gone through this process to really change that internal process. The number was relatively low at the beginning. But also I didn't you already on your way to zero we want to recognize that and then see what else we can do. So if we could come back to that and when you come again, Thank you very much. So now I want to turn to our acquisition of preservation program to the board was very excited about it is an effort that meets the goals of our strategic plan, which is primary is fundamentally, um predicated on preserving more people more low-income people with affordable housing. I'm in this is a program that we think will help us do that help us do that at a lower cost and help us do that more expeditiously. I'm going to turn it over to Jared, who is our director of Housing Finance and asset management is kind of the architect of this and I'll let him walk you through the goals of the program and in how we think it'll work. Thank you. I'm so is Andrew is saying the primary goals of this program is aligning with our strategic plan to expand housing opportunities to deserve more people also to promote quality communities and by that meaning more in the preservation realm but also add an affordable units in two areas of the city where low-income people are a lot of barriers to access to the high cost of housing in there. But also we are losing affordable housing as the years go on. So preserving what we can to make sure that the stock is still there. And then finally just we know that the costs are very high. So not only promote in the financial stability of our ability to continue to provide low-income housing to Seattle residents, but also the stability of residence themselves, so it we have various levels of housing for income ranges so that we can serve from extremely low-income meal. Almost 30% of area median income all the way up to 80% of area median income. So you have the whole Spectrum there. So the program itself the initial phase of the program that we took to the board was the acquisition of 500 units and this strategy was designed to purchase increase either create or preserve 500 new units. Obviously, we want to create a number of units and where we ended up right now. We are going to be doing that. But what we're trying to our goals are initial goals are 50% of those units for 250 units are going to serve 30% of area medium median income or below so they would align with our current preference for a public housing program in our voucher program that serves homeless and Below 30% and then the other 50 units would serve 60 to 80% Area median income range in there. We're still working on what that part of the program looks like and how many at 60 how many in 70 and how many at 8 but that's the range there. You said 50% of units at 30% Ami to 60 is that between 30 and 60 between 30 and 60 is a difficult with a difficult area to serve based on what the funding that is available for us and the needs that we're seeing based on our wait lists and who we serve at the Housing Authority is a high demand obviously below 30% of area median income but then also because the tax credit rules allow you to go up to 60% Ami but no higher there is a gap for households that may be working and earned just over because it's a bright-line if you earn 62% of area median income you do not qualify for a tax credit unit. So this is an idea. Massive fan of calling at Workforce housing but a lot of people would call it more Workforce housing of the 60 to 80 lb people who are working but don't qualify for the other subsidy programs. And then that's super helpful. And I think that's something that will want to continue to work on between 30 and 60 there really is as gap of funding and part of what I applauded our friends at Microsoft for you know, what they've done with half of the amount of money that they've allocated out is impact investment loans. My understanding was that were to go to areas that really were missing this funding is is that 30 to 60% funding where impact investment loans for companies organizations who have additional cash Reserve is really needed that the Gap area that others could potentially feel. Yeah, I would say that that could definitely be a used one of the reasons 3260 is so difficult. Is that the way the Programs or setup is you have to make between like 50 and 60% of area median income to afford the tax credit rent without an additional subsidy. And if you're kind of on the cusp of that or you're below it, it's difficult and there's not really a lot of shallow subsidy programs that are out there. Shallow subsidy. So shallow subsidy would be something where you're providing a little bit of subsidy not to the extent of say about her or that's similar to the public housing unit. But there's a little bit to offset some of the operating cost that can't be covered by the rents that are paid or other ways are is more investment like what you're talking about to buy down the costs so you don't have debt to pay or other costly. I've got back to that slide. Sorry where we're at right now in what we've currently Acquired and what we are in negotiations on is we're looking at a 260 units of preservation and they will serve households at 30% of area median income or below. So we're a little bit more. A little bit north of what our Target was but that's good. We're able to serve more extremely low income households. And then and I'll talk about it in a few slides. We've acquired one building already. That'll that serve 60-day 2% of area median income and then we're currently I'm out looking for more buildings to fulfill her our total number. You probably know about this program that we're looking at for legislation in right now in the legislature that dolio representative Deleo and Eric Pettigrew have put forward something is called Pacer financing and my understanding how this works and it may not work for you. But it's focused on on private investment that an individual can borrow money and then it attaches. To the actual I can a lien on the property and they don't have to pay it off or pay the property taxes. I understand it until they sell it. So it encourages Investments, especially in unreinforced masonry. And I'm I'm I'm only just scratching the surface. I don't think it is as complicated as I just made it sound but I'm delighted that there are these mechanism and encouraging the private investors to get involved and if they don't have to pay the interest back or they can actually attach it to the property. Then when the property sells that it it just goes along with the cost of the property anyting everything that we can do to try to find more spaces for people, you know, frankly to preserve some of these older beautiful urmc. It's it's really worthy. Now that's said and you're talkin about preservation specifically, do you have certain buildings in mind? We do we're negotiating on three different buildings right now and have a slide in a bit on that. We're still in the negotiation face. So we're not able to share the exact locations in the details like that. But we definitely give you a high level of where they are in the city and who they're serving and bedroom sizes and things like that. So one of the other things this is just a preview of everybody of something that I'd like to bring to this committee leader with input from our colleagues on the community and you all sha. We talked to some of our Community Partners in the housing World about a piece of legislation. That was actually Palace by my predecessor, Burgess and councilmember Clark that required buildings that had at least one unit. That was at 80% Ami or below the required ask them because it's voluntary to notify the city if that unit was going up for sale so that our partners may be nonprofit. Lovers or partners that has AJ could get a notification of a potential building that would go up that would potentially have affordable units within it sellers have notified the city because it's voluntary and it's four units that have 5 unit for apartment complexes that have five units are more. So one of the things that I'm trying to explore the renter living in a building that has eight units we didn't get notification when our building was sold and I think there's a lot of us in there who would have wish that we could have had notification. So potentially we could have a cobbled-together funding exactly in fridge that ourselves and had our first time home ownership options. It could have been operated as individual condos potentially or as a co-op if you will with are in Partnership for Community Partners or potentially fsha had to notify, you know, that's a non reinforced masonry building for house doors opportunities for sha to step in and help create more affordable units, especially in an area like we was Access to neighborhood parks and libraries and really great bus line so might my point is one of the things that I'd like to do is to reduce the number of units that are required. So if it's a building that has two units are more work with you all to see what we could do in terms of notification. So maybe sha gets better notification and some of our nonprofit friends do as well and that the tenants get notification themselves. One of unit is coming up. Obviously. I'm not assuming that every tenant would be able to Cobble together funding within a 60-day. It's very cumbersome. As you know, I'm on an individual basis let alone for a Community Partners, but what I'm thinking is, you know, as we hear more about your acquisition strategy, what could the city do to also change policies like that? So maybe you get notification of more units that potentially would be coming online because what I'm hearing here is you're not actually you're broadening out the number of complex. apartments that sha can potentially have ownership of so that you can help maintain some level for Ability with something like that a tenant notice or a city notice of units with more than two or more apartment, units within it be of interest to Sha Yeah, I believe it would ducktail nicely with this program to keep us informed of the stock that's out there that time that could conceivably be characterized as part of the program in in if we knew about them then. Yeah, that's the first right is his kind of having some knowledge about what what is available on the market and then we would be welcome. Welcome to information about that. So I talked with Steve Norman recently from our King County Housing Authority. And I know for a 20 years that he's been working over there. They've been going after buildings and then holding them so that that's one of the ways that they're able to offer units that aren't as expensive as the private Market have we done something similar to the Jackson County Schools what we are not generally not bringing any new subsidy into the building. We're trying to have the building perform on its own but it's the same concept of identifying opportunity building to wear them in areas that we can then sustained and in our ownership in perpetuity and keep it affordable. Yes. Song of the total program cost itself. We estimate or open to do this over the next two years acquire these 500 units is going to cost us right around a hundred million dollars. We're looking to finance that through a combination of our own funding that we have available to do it, but also a lot through tax-exempt Bond issuances. So we bonding capacity to do that and as well as well make use of the low income housing tax credits where it makes sense to do so. One of the key things that we worked for quite some time with on the board well internally, and then with the board was what's the criteria for selecting buildings? And what would be of most benefit to Residents that are on our weight list, but also low-income residents in the city as well as ensure that the Housing Authority remains financially stable and were able to continue to provide the level of service that we do right now to the residents of the city. So we came up with this 6 A set of criteria that we're evaluating each of the Acquisitions based on so first and foremost, you know, are we able to serve more low-income households in the city? Secondly, does it mean tane our financial strength? So are we we don't want to be in a position is Andrew was mentioning of having to take from some of our other programs that are already serving people through either the voucher program or through the public housing program to go out and purchase more units because we're not really getting a net gain their thirdly as Tax credit projects and other projects that were funded by the federal government in the seventies and eighties are aging and are the regulatory requirements of those are timing off. We're going to be seeing projects that need to be preserved. So are there opportunities for us to step in and say okay. This is a building and in an area where is providing a benefit to Residence benefit to the city there is providing subsidy potentially. Can we purchase this building and maintain it in perpetuity? So that's kind of the key around that the other thing is part of me. Is he acquisition increase our inventory an opportunity areas. So we've been focused a lot on providing access for households in 2 areas that there's a lot of barriers to entry due to just the feellike queen on or where I live in Magnolia very difficult to get into if Low income household in next to Impossible if you're an extremely low income household. So that's the other area Focus that were using their the other thing is his large family units the Housing Authority owns almost a quarter of the entire subsidized large family unit stock in the city of Seattle 3/4 and 5 bedrooms. So that's largely in our public housing program as well as through our voucher program, but a large number is in our public housing program. So we have high demand and we feel that demand and pressure for these units as we have large families low with large low income families that need places to live in such difficult for a family of five or six seven or more to live in a two-bedroom unit. So this I don't know exactly how many are more than two bedrooms. I can tell you that we have in what we call our scattered site inventory, which is single family homes townhouses and small mid-rise is like less than 20 units with 711 units in 236 buildings across the city and that ranges from South Seattle all the way to literally on the shoreline Seattle border. So we're all across there and within that group in there, it's between 35 and 40% are three and four and five bedroom units. I would say in that portfolio and then we have been adding some in yesler threes and I think a few for is in fours. And yes, we can get you the number of the Yeah Yeah Yeahs. That so often that families come together or extended families, which is really what is happening and what we want to encourage frankly. I'd rather have people grouping together with a good solid roof over their head with rooms that they have space for themselves and each other but you know, if we're looking at 200 units when we know that the demand is in the thousands, it's a real subset of the entire portfolio. Our entire purple Lowe's around 8,000 units. We told her that we own or manage and so we'll get you sorted the breakdown about my bedroom size of that. I would also offered because we struggled in the city due to lawsuit but also sort of the pace at which were trying to rezone If we think of units that are sorry if we think of complexes that are two or more units potentially coming online for your potential purchased for the scattered program option. I can imagine duplexes and triplexes being a really good alternative. So that families can stay together. I mean if there's two separate entrance for Mom and Dad and the kids, you know who have their own infants. I haven't even imagined you as family units staying together. So I think a lot of folks think about large apartment complexes even 20 or less, you know, Mayfield large to some of our Community Partners, I would love to work with you as we think about potential options for the city to purchase or for Seattle Housing Authority to purchase a smaller units at that means two or three or more units in a complex potentially. That's another way for families to stay together and form or folks have access to high opportunity neighborhoods. So I hadn't thought about that until now but that's a that's a really good intergenerational. A commitment as well, which is also healthy for a community. And then our our last area is just the with the sheer cost increases that the city has been experiencing in regards to development. It's becoming more and more expensive to build new units. So one way to serve more people is to look to buy units that cost less than our development costs. So that's another key criteria. We were looking at as a way to leverage our funds further so So one of the Acquisitions that we've already completed is in the Lake City neighborhood. It's called the Spring Lake Apartments. There is 69 units there one Studio 55 one bedrooms in 13 two bedrooms, and it's in three buildings that was built in 1986. It's a fairly good shape. We purchased this building we closed in the end of November for just about 15 and 1/2 million dollars. So we were able to purchase this building for a $225,000 unit, which is a good value. And now this building as long as the Housing Authority owns it and our record of selling is I don't have one really is going to be guaranteed for as long as the Housing Authority is around so this property itself had some of our tenant-based voucher in it. Ready, so there are already some loading extremely low-income households making you so fat and then the rent's themselves were between 60 and 70% of area median income rents right now. So we kind of what we did is we acquired a naturally affordable building and now have been able to ensure its affordability in the long-term cell ever blow the walls out on something like this so that you actually take two Studios For example, and you know you enlarge them so that people can deal with the space button is I never an option actually. In fact that I was just mentioning rear. I have undertaken a conversion program where we are taking unused spaces weather we have you know, I'm finished basements garage. Ashes bonus rooms that aren't really good use of space and increasing the bedroom sizes. So we're able to take three and four bedroom units to 5 bedroom units. In fact, we found a single-family home in our portfolio that had three bedrooms, but the previous owner whoever we bought it from had boarded up the attic and the attic was actually a butt was a one-and-a-half story so that I could be converted to another two bedrooms with a bathroom up there. So we were able to increase the number of a bedroom. So yes, we are and work. We're actively looking at these new properties as we bring them in if there's opportunities to do that there so, So I just wanted to touch you on some of the the three properties I was talking about that we are in negotiations on that. We hope to have under contract enclosed in the next two to three months. It's a total of 262 units a large number of one bedrooms some tools and some threes and they're located in three different areas of the city. So the Lake City of Black Lake City. In the far right corner, that's the Spring Lake apartment that I just spoke about the one in the right by the locks in Ballard there. That's where the other building is located in that part of Ballard. The other one is more in the Central District. It's close to our yesler development. And then the other one is just south of if you'll remember our new Holly. Hope 6 development where we have just over 600 units down there. The other property is down in the rain. Valley down in that area so So that's what we are up to. We are as Jared that has indicated. We we close the property last November and into where negotiations with three more and we'll be continuing to search for I'm good bargain opportunities that we can preserve the portability and I'm creating opportunities for new housing. Do we have any opportunities for some of the Aging motels around here? We haven't focused on that and we've been focusing on larger buildings in residential structures that we haven't really focused on the Aging hotels have kitchens and probably be very expensive to retrofit think about how things were used in the past especially during the Depression era and e.on when folks as we heard it during the labor presentation. I came in to Seattle in the thousands to get good living wage jobs in the shipyards in as we see more and more people come in to get good jobs here in the tech industry. I'm thinking about how all that pressure has created more people getting pushed out of the city or pushed into the street, perhaps looking at single room occupancy buildings are unit and is in a new layer that we should consider obviously is not a good long-term solution, but potentially could help us something that you can invest in or are you prohibited by your rules for to invest? Sros, I don't think we're prohibited. It's not something we've as I said focus on with a lot of RA interest currently for sure has been around families in creating opportunities for families, but I don't think there's anything that prohibits us from more clearly. This isn't the direction you're going but if there are investors that are interested in this why you had talked with someone who 20 years ago did something down in Eugene, Oregon and they built up where they built it from scratch. I don't think it was a conversion. But what they did was have single single rooms, but community space and study space but they had like essentially a dormitory kitchen continues to this day and I talked to somebody recently who moved from Seattle down there. I mean, she's somebody who is intermittent. That was less expensive down there and she loved the idea. She said she hates to cook. She didn't want to this offered her three meals a day and give her space to continue her career and it just it strikes me as one of those things where nobody's going to jump up raise your hands say that's what I want to do. But it's like well, we're trying to think of every option possible to get people with roofs over their heads at an affordable rate. And an another take on that is a lot of the new modern shared living space concept. I have the chance to visit Germany. I am that was actually contact that came from one of our Urban his friends here. I met this individual who's Ed renowned housing expert in Germany and he lives in a shared housing facility. His family has one unit, but then there's a shared living and dining room area and I'll take turns making dinner. They all Garden together and screws and more affordable option with greater social cohesion. So and it's good for the footprint of our city because that is. The smaller unit overall. So we're really excited about this. Just one more question for you that I saw a number was that 2000 Ember incorporating part of the house or should I follow up with you on that afterwards that the number the actual total number was bigger than 500 is that the long-term goal? Actually remember what it said in the press release and reference the number of affordable units that we were involved in 9 SOA acquiring with this that this would add to the an inventory of affordable units. So the 8,000 will include the public housing units. So 6000 public housing units and then there's another 2,000 units at our client with including that's that are classified as affordable units over not serving to 30% and Below. Am I so I can categorize it is below 30% Ami and in theory, someone gets a voucher to specific heat to low-income public housing program in NASA program that we own the unit and manage the unit etcetera. So that's a hard unit at which the Housing Authority actually owns and manages and gets a subsidy for the tenant that lives there now because they Qualify for living there based upon their income, which will it be in our preference system would be 30% They would have to earn 30% or below of area median income and then they would qualify to live in that unit and their portable unit their income could be greater and they could afford to pay a little bit more and we wouldn't have as deep as subsidy in to the unit itself. Public housing by definition is your 30% and below in about the same issues. I think you for staying a little late so that we can ask these questions. I'm really looking forward to having you guys come back talk about yes or terrorist the eviction prevention program that you've worked on improving great statistics there. I think you for sharing some of that. I'm also really interested in how we take the information about the 30 to 60% of restraints. That folks have 430-462-3632 60% Ami it sounds like that's in line with what we heard at the a select committee or perhaps what we need to do to help. From falling deeper into poverty or from losing their house in some cases is cash assistance sometimes to help people get through a really tough. And I think we heard from are felons Who provided that comprehensive report on how to restructure our homeless Services know sometimes you just need to give folks the two Dollars and stop asking questions and don't make them fill out that you know, when 10 survey or did you know spend down in order to receive it? Really that could be a homeless prevention strategy and I think what I've heard from you all is especially in that 30 to 60% area median income range. We potentially could be looking at more Tools in that help people buffer from falling into for their paws. So this is very exciting. We will follow up with you as well on the potential opportunity to purchase act. I don't know what we want to call it the tenant notification act so that we can also make sure that it's a helpful tool for sha and I'm just I'm just really excited about this as well. We are about a week and a half away from passing the mandatory housing affordability legislation that the council been working on for years and as we do, you know, we're also reminded that this is just one piece of the puzzle. This is just one ingredient in the mix to try to help create more affordable housing across the I want to take this chance to notify the public and our colleagues that we're going to be having a work session or a lunch and learn on the 21st of of March which will give us a chance to say mha passed. Now what medication strategies what are the other building opportunities? What are the other zoning changes in the future that we may want to consider and I'll give us a chance to talk a little bit about the housing 2019 agenda as well and would be bringing and Community Partners. So I see if it is sort of a celebration but a recognition that we have so much more to do to create affordable housing for all in this information. We'd love to have that as part of that around table discussion on the 21st will go ahead and wrap up our next meeting for the housing Health Energy and workers rights committee will be on March 21st at 9:30 a.m. And we are going to have the domestic worker standard board. It's more of those the City Light review panel appointments briefing on the Health Care Health Care for low-income workers and a Seattle City Light Skagit environmental endowment commission budget. That sounds fascinating part of the high Rost treaty with Canada. So won't make sure that our friends know about all of that and look forward to seeing you all on the 21st active chenda that day. Thank you guys. Thank you for leaving for shepherding us through today's agenda. And that is it for meeting is adjourned.", "end_time": 7910.5}]}