{"format": "raw", "annotations": [], "confidence": 0.9206890866563127, "data": [{"start_time": 0, "text": "timer for drain Good afternoon. Thank you for being everybody. Hello Pastor. How are you? The April 8th 2019 city council meeting the full city council come to order its 2 p.m. On Bruce Harrell present of the council the park. Please call the roll. Mascara O'Brien. Her both apparel a present introduction and referral calendar will be adopted. Hey, no objection today's introduction and referral calendar is adopted and if there's no objection today's agenda is adopted wherever fairly brief agenda today. Green objects on today's agenda is adopted. There are no minutes for presentation today. However, we do have a presentation and we look forward to this council member herbold. You have the floor. My start off by thanking the Seattle women's commission the Coalition ending gender-based violence the sex the King County sexual assault resource center and the mayor's office on domestic violence and sexual assault for their leadership year after year on this issue one in Four Women in one and six men will be affected by sexual assault in their lifetime trans women typically trans women of color and people with disabilities are disproportionately more likely to be victims of sexual assault the Coalition ending gender-based violence couches the issue of sexual assault within a greater movement around ending gender-based violence that recognizes that the social and economic conditions in which women lgbtq people people of color and people with disabilities and children are especially vulnerable. Also know that Nationwide research from local indigenous Health Institute uncovered that only a hundred and sixteen of the more than 5,700 reports of American Indian and Alaska native women and girls were logged in the Department of Justice. Missing persons database in 2016. This report flushes out the role that is to slice racism places plays and investigations and data collection methods in cases of missing and murdered indigenous women and advocates for grad at greater. Greater attention. It is very important that we make policy locally as well as nationally that addresses sexual assault harassment and coercion in the workplace domestic in school settings and places where people are accessing services and programs last year this Council passed legislation to extend the statute of limitations on sexual harassment claims in employment housing public accommodations and Contracting investigated by the office of civil rights the city council and the mayor's office have also worked in Partnership to address discrimination and harassment and City departments. And per recommendations from an anti-harassment interdepartmental team a new office of employee on bud was created to assist city employees and understanding their options and working through claims of workplace harassment and discrimination. Finally. There are several proposals working to the state legislature to remove barriers for people who report sexual assault ranging from again expanding the statue of limitations on sexual assault crimes to addressing the back of over 6,000 untested rape kits and to improving responses to missing and murdered indigenous women. We'll be hearing more from the Seattle women's commission about details for our annual denim day on April 24th. This day is intended to raise awareness on victim-blaming and the importance of that we all take action to end sexual assault and gender-based violence. And if I could I'd like to read a few of the recital is not the whole thing. So we're a Sexual Assault Awareness Month was first observed by the United States in April 2001 to raise awareness about sexual assault to raise awareness about ways to prevent sexual violence and support survivors. Today millions of men women children and people who are gender non-conforming or sexually assaulted and are too often left with little support infused Solutions. We must commit to the elimination and prevention of his hate as well as fight to change all Norms that perpetuate discrimination against genderqueer individuals in our city. And homeless and housing insecure women face unique challenges that affect their well-being health and families including being at high risk for sexual assault and exploitation people with disabilities are sexually assaulted seven times more often than people without disabilities, especially violence charging those who identify as women whether it's in the home on the streets in the workplace in the media or on internet. The city of Seattle invest in a comprehensive network of Social Services and a specialized response to sexual assault that addresses the needs of Survivors by providing a 24-hour response system Crisis Intervention information and referrals and General Medical and legal. Advocacy. We know that working together to educate our community about sexual violence supporting survivors, when they come forward and speaking out against harmful attitudes and actions engaging in best practice sexual violence prevention and all this work together helps to end sexual violence and efforts to change belief systems and practices that perpetuate sexual violence, especially in targeted vulnerable populations required the participation of the entire community in Seattle must work to become a place where sexual assault is treated as a public health issue. We're social perceptions and behaviors around sexual violence are changed and we're survivors can access an array of services that are culturally appropriate and relevant to their needs and all. Currently we're sexual violence decreases in frequency now there for Jenny durkan mayor of Seattle and the Seattle City council do hereby Proclaim April 2019 to be Sexual Assault, Awareness Month. There's no objection will suspend the rules and love to see the presentation or rather the photograph in here from a few words of some of our guests. Thank you customer both for bringing anyone else like the same thing before I cash my herbold approaches the the guess. Thank you for everybody pitching in working on getting this out. Chewy, Percy, okay. Hello, everyone is making Freeney and I'm really excited to be here today on behalf of case Ark and its King County sexual assault Resource Center. What about it, which is projecting you can get a little closer, but you're projecting fine. It was just a suggestion use my yes. So is a nonprofit that serves those who've experienced or have been affected by sexual assault this past year. They've served 20% more. Individuals that's a huge increase for them and they do it. So well, they provide Counseling Services. They provide legal. Advocacy. They give people who have experienced sexual assault the opportunity to share their story. It's difficult to talk about sexual assault. It's even more difficult to live with it and be isolated and silenced. I'm grateful to all of you here who are raising awareness who are open to hearing all of the stories and and supporting those who have experienced sexual assault like myself. I accepted the burden of striving for change around sexual assault the day that I reported my sexual assault. I accepted the burden throughout the trial and I accept the burden every time that I give a speech like this. It's a large burden, but it's my hope that through legislator change and through an increased and an increase in awareness and through more access to services that we can lessen that burden for people who have experience in for people who might experience. I'm really grateful to all of you for standing with me today and standing with K start in declaring April Sexual Assault Awareness Month. Thank you so much. Thank you, cuz my heart pulse. Okay, at this time we will take public comment, or do we have another guest like say something please, please. Good afternoon. My name is Alicia Glen well, and the policy and special projects manager for the Coalition ending gender-based violence, the Coalition educates organizes and leads over 30 gender-based violence agencies in Seattle and Kane County Al would touch the lives of sexual assault survivors in our communities. I'm honored to participate in this event today to declare April Sexual Assault Awareness Month for the city of Seattle. It would be an understatement to say that the me-too movement has sparked significant debates in our culture many discuss this era as one in which are shared rules around sexual harassment and assault are evolving a boundaries are shifting our definitions of acceptable behaviour are changing as recently as last Wednesday. Former Vice President, Joe Biden explained away some of his questionable Behavior by citing changing social norms, but the founder Tarana Burke first started using the hashtag to highlight the pervasiveness of sexual assault and harassment in 2006. 13 years ago in the United States the first organized effort to decry sexual assault came from five black woman testifying before Congress in 1866 about widespread rape of black women by white men during riots following the Civil War social norms defining sexual assault and harassment have not changed the use of power conversion violence to violate another's physical and emotional boundaries has never been acceptable and survivors have been telling their stories and calling for justice for Generations. What is changing in this current cultural moment is our society's increasing awareness of the prevalence of these issues are diminishing tolerance for those who perpetrate sexual harassment and assault and a growing cry for accountability and Justice by declaring April Sexual Assault, Awareness Month you send a powerful message that sexual assault is not and has never been acceptable in Seattle. Thank you for this important acknowledgement and for leading on behalf of all survivors in Ark Thank you. Afternoon council members. My name is Daria Favre. Are I am the chair violence prevention and Justice with the Seattle women's commission. We appreciate this opportunity today first. I'd like to thank councilmember herb called in Gonzales, what are leadership and support and sponsorship on this issue? I don't feel like to thank them for acknowledging the devastating and for bringing awareness to the disturbingly high rates in marginalized communities today reflect on the lives, which have been impacted by sexual assault praise and thank those who support survivors appreciate those who do prevention work and take a hard. Look at our current culture. We look forward to creating a culture which values prevention actively stop sexual assault brings a topic to light believes and support survivors. It's imperative that we educate the public and work with are used to shift this dangerous culture comprehensive sexual education with affirmative consent curriculum at all schools is crucial to prevention. If we hope to have a culture which believes and support survivors, we need to invest our use in order to properly support survivors. We need to fully funded organizations doing the work, especially those who hire survivors we need resources that intentionally work with marginalized communities and can navigate the intersections. This month is for reflection praise awareness and for changing our future myself in the entire women's commission. Look forward to working together to prevent sexual assault and support survivors in their Pursuit 2 recovery. We thank you for shining a light on this issue, but we aren't you to do more we are urging to invest in prevention & Recovery resources the channel women's commission looks forward to our continued collaboration and the changing cultural norms and working together to improve our city. Thank you and that will be happening on April 24th. We're very excited to be hosting this event in the Bertha Knight Landes room event will start at 5:30 p.m. Go until 7 p.m. We will have some speakers and include Councilmember Gonzales and her bald and we will have some other organizations speaking as well. In addition to all of that. We're really excited to say that we will have a display of t-shirts from 50 different survivors and through those t-shirts that would be displayed in City Hall. They'll be able to tell their stories and share what's happened to them with the community. Thank you again for this opportunity. Thank you again. So this time will take public comment on items that appear on today's agenda or 2019 work program or our introduction or Pro calendar. The public comment will be accepted for 20 minutes. And we ask that you begin by identifying yourself and the topic you'd like to speak on. I'll call you out an order with what you sign and we'll start off with a mr. Alex Zimmerman and Alex Zimmerman will be followed by Yvette dinish. Jihad my dirty shooter I'm not sure you got to beach rats from animal to file my name Alexander speaker right now so fast little bit confused me because it's 5 foreman and no one man. So I'm totally confused woman in men have sexual harassment to me many times exactly four times this Council chamber and I give you a very simple example because it's what is trespass me from every meeting from every meeting for the last few years sexual harassment very seriously, especially on a day where we are cleaning April 2019 to be awareness day. This is the second time this person has indicated that there's been some form of Verizon and making light of the issue of sexual harassment accusing folks because of skin and gender is not appropriate in any regard and today on all days to have sex position levied against the council I'd is not appropriate and I don't know what the exact emotion is Mister president, but I would say that this type of accusation levied against the three council members and he's done it before is both Falls and inappropriate on this day. So point of order if I can miss president or whether he is disrupting the meeting he does have a right a constitutional right to express his opinion on issues and legislation that we are working on sexual harassment being one of them is opinions why certain while certainly vulgar and offensive in my opinion? He sent shares opinion. I still fit within the parameters of free speech on a topic we are Working on but I would ask that you address the issue and not attack our colleagues as you proceed. But at this point in this summer terms of use disruptive. He has a constitutional right to speak on our agenda items, but I understand your point. Please proceed sir. Exactly explain to you. So it didn't come to Men Who come to this place for 10 year 2200 time speak her mind trespasses for 900 ain't nobody in America have happy. So give me a chance right now explain to you. So my Kosher Sausage can stand in your throat forever right now because it's exactly what I supposed to be at the clock, please now, you've crossed the line it has nothing to do with her and you've been warned that that's disruptive and vulgar speech. There's nothing with our agenda. And if I hear that again, you're going to be removed for disruption, please proceed sir. The threat of sexual violence and I would ask you as a presiding officer to treat that behavior accordingly mean this man just threatened to stick his genitals down our throats and I find that to be a gender-based violence threat to anybody on the city council, but in particular to the women and I'm asking that you find him disruptive and have him removed Child Support. I'm required to give him one notice before I remove anyone you've been notified. I agree with your point. So you can put on notice, Thank you cancel president. I certainly of hold. Mr. Zimmerman's First Amendment, right, but I can categorically say for the last three and a half years. We have been subject particularly. I'm just worried Latina women up here. Not only a two attacks on our race, but are gender and anything else you can imagine and at some point we have to draw the line as counselor Gonzalez. Said that their actual threats their threats to US based on our gender on our race on who we are and the fact that we sit here and I for one am tired of it. Thank you. I'm worse. There is a separate security procedure. We use for threats. You've heard Mr. Zimmerman that members took those threats. And so I'm sure be on this hearing that they will follow through on how we proceed on threats. You've been put on notice of your destructive behavior. And so any more outbursts that qualifies destructive Behavior, will you will be removed immediately if 29er Guess you can say is I only give you example, you know what? This means is this. Statistical explanation. It's not something to do with personal. It's talking about what you think about this week off here and just brown white black Jew Catholic University have a constitutional right by law in City Court speak about everything. What is we want and just so you know, your behavior today was deemed threatening a by council members and you may want to expect some follow-up on that sir will be a vet deines followed by David Haynes. I'm back again addressing the homeless prices for years into it. There's nothing they was all and the reason I'm more concerned the day that ever I stop by the Othello Village because I read the paper. I'm going on between the villages and the low income housing Institute. I stopped by to check on their welfare. They put a children living up in there when I went there was for toddlers under 2 running around that's not what I'm asking right now. Is it can you please meteor figure out how do you close all the issue between Lehigh and those tiny Villages right now? I'll thank you by Nextdoor Community. Providing some Necessities toilet paper Cutlery food diapers Wildest Dream work out whatever you need to do to mediate the situation. Please do so. And also I want to encourage everyone out there that the reason how we change the situation how we make things better things by the power of your boat and your voice vote matter. The consequences are up for grabs at this year. Check into the issues make them clear on what they stand there and show you do that online. And also if your homeless you can vote is Wales from my husband are starting to your push to register people to vote. And with that said fix the situation that please Celebi look at the other one, and that's all I have to say. Thank you. Thank you in Spanish. David Haynes will be followed by Tyrone Kenny. We need city council to demand a weekly update on the homeless crisis with practically a Non-Stop investigative hearing on the inept government officials hiring unqualified six figure salary nonprofits hiring ex-addicts. We still have conscription to addiction fueled by a Welfare job lying to the homeless about shelter with sub Human Services virtually non-existent. I'm sure you seen the drama unfolded the newspapers about Sharon Lee of low income housing rips off taxpayers steals Urban rest, stop cheating the homeless daily and Scott Morrow from share wheel who keep it cruel unusual and subhuman mistreating. We have societal implosion and innocent people are being forsaken to the Exempted drug pushers and predators destroying lives daily. In fact Seattle is dying prove that wrap around services are failing to solve the problem. They focus on while discriminating against thousands of innocent sober drug free homeless discriminated against by social welfare industry College pukes miseducated by race is sociology professors, you know, you can tell Seattle all home.com of the yearly count is a good-for-nothing fraud. They take months creating a data collecting racist manipulated narrative that fits the treasonous and unconstitutional agenda work in the pay plan as at the expense of society. We need government officials in the nonprofit's to be held accountable for their egregious failure to put forth an honest diligent effort and don't believe this stuff suffering is Wayne because spring is here. I ruined Kenny will be our next speaker followed by The Honorable Michael Fuller. Also, hi. My name is Tyrone Kenny and I'll show him with God is our nonprofit working in the community. And also we working in the community and I'm sitting back looking at this city. And we doing so much things with building so many places and we are not supporting the ones that don't that really need. Would not support the homeless people and you should have left them in the in the jungle. You just should have left them there because know what you know what it was and you could have just gave him help from there. You you didn't have to move because they all over the city now, they are everywhere in the city on the floor on the ground that's near car lot, even on the role of the street, you know people to get hit killed whatever it is you waste money you asked for money and you had a money for it for them to do it, but you blow the money. About the money but saying you clean up the city cleaning up the city, but then they got waste noodles and everything else on it for a little kid. I seen a little kid that fell on her need of that are homeless person using and we failed to help the city, right? We failed to put people in their homes. What kind of city is this? If we don't take land from everybody we take Land from the Indians and all of that and we rape everybody and everything and all kind of like that. You know it been to raping been going on ever since the slaves been coming over. They raped us and brought us over here in America, and we failed to understand this thing. We are well so bad. We are sad peoples are of of 90 States of America and I'm not no color. I'm a black man in America being raped in ball over here. Bye-bye your thoughts in your dream to what you sold the Indians or dream like they're going to do this and then took their land and then put them on reservations. How can we say we are good City. This is sad, sad City. Patricia Kenney our last figure sign up as The Honorable Michael Fuller Yes, I'm on my way full of so I choose. I'm a legend that all nine of y'all is in violation of Margaret Laura Richards First Amendment right due process 30 open meeting that would violate. Hr300 three no Sanctuary for criminal act HR 304k cloth HR 309 enforcement of sanctuary city law. If you take to deep conspiracy section 241 conspiracy against civil rights under color of law violation excessively agent of rights under color of law one year in prison. I don't think that you're above the law in this country is so hard. What are above falling Chinese Exclusion Act? 1882 College United States vs Lee. 1882 Bruce Harrell, you are not above the law. But you are pimping We the People Martin or Richard born and raised it. But yet and still y'all people of color at the time of War, but then you turn around and say nothing. Now. Okay. Thank you. I am I know you are thinking case you were going to move on it's been noted. So we're going to move on to pay my bills. So please read the title reminder pay Sergeant claims in ordering the payment thereof. Okay. I moved past Council Bill 11949 to and I hope to get a second. It's been moved in second of the bill passing for the comments. Please call the roll on the passage of the bill. mascara O'Brien Salon Gonzales herbold Please read appointments. Please. Read items one end to seven Heavenly and Kevin McCaffrey's members Board of Park Commissioners for turn to March 31st, 2022. The committee to be confirmed that late is a District 5 resident who has served on the board for the past three years and he contributes and his thoughtful and balance in his approach. The issue is brought before the board. He holds a master's in public administration urban planning. He grew up in part of the Seattle Parks and Recreation family participated in programs and coaching tennis. He has work for the city of Seattle before the budget analyst he is apply for reappointment to the board of Park City commissioners. And I for one am very happy. So the committee I'm stoked development public assets and Native communities May unanimous recommendation on March 20th at the city council passed appointment 01278 thermistor Evan Hundley and would you like to read the second one as well? We read them in together. I believe this is the appointment of Miss Kelly McCaffrey appointment 01279 Kelly on both of these by the way, our reappointments Kelly has served on the board and supplying for a reappointment as well. I believe she's aboard chair. She's been a fantastic member of the board as she comes well prepared as good questions to think critically about issues and ideas before the meetings. We have relied on her expertise for at least the last couple years. She has a master's degree in public administration with a focus on Environmental Policy. She sees Park issues through the lens of a mother a dog owner a disabled Park user and bikers her work as the chair of the park district oversight committee has been helpful to spearhead correspondence is a liaison for the Department in the Park Board of Commissioners as well as an excellent advisor to myself and our staff the comedian Civic development public assets and Native communities makes unanimous recommendation that The council passed the appointment of 01279 mrs. McCaffrey. It's not those in favor of confirming the appointments, please what I I don't suppose both know the motion carries an appointments are confirmed. Please read the report of the sustainability and transportation committee. We could read items 3 + 4 + 3 + 4 + 1280 + 1281 + Joseph laubach as members Levy to move Seattle oversight committee for Toronto December 31st, 2022 the committee recommends he supposed to be confirmed accountability office. He was a volunteer with the move Seattle Levy campaign Jose a CPA with SSA Marine in volunteer with West Seattle Bike connection. They both served admirably on the oversight committee and proud reappointment. I think they both bring outside expertise and a passion for transportation issues in the city of the great members and look forward to their appointment. Forget any questions or comments? Get those in favor of confirming the appointment, please go die by those opposed vote. No the motion carries appointments are confirmed that concludes our agenda. Is there any further business to come before the council? 39 We Stand adjourned they would have a great rest of the afternoon.", "end_time": 2003.5}]}