{"format": "raw", "annotations": [], "confidence": 0.938125057373105, "data": [{"start_time": 0, "text": "Good afternoon, everybody Tuesday, March. Sorry Tuesday, March 19th at 2 p.m. Welcome to the stable and transportation committee. My name is Michael Brian chair of the committee staff today by Jasmine Jasmine and I believe I'll have other colleagues joining me momentarily we have for Gen items today. We're going to get an update on the what's happening in downtown. Traffic is supposed to be released to the bus is coming out the tunnel this weekend and we ask you some questions about progress towards the base Spike Network resolution that we passed last summer. We will get a presentation on a street ends from s. And Advocates and then we will have a public hearing on updating the comprehensive plan with a transportation project list of possible legislation around Transportation impact fees and finally will have legislation. around I'm driving blank University of Washington. Oh, yeah Theatres do the u dub nobility plant around 43rd Avenue is the Light Rail station come someone. So with that will start with public comment. I have a people signed up Alex Zimmerman your first fall by Vicky Vicky Clark Cannon. Sarah will defend each other for 2 minutes and a timer will begin. Is your car is my daughter shooter? Apparently she might criminal and Killer by there earlier. What is Elizabeth on about 6. It's very unique situation. It's never happened before small City. Like see it though. The 700,000 cockroaches live in this build a tunnel for 6 billion dollars make everybody billionaires. Nice. I like this. I was just happy. I was just typing in my eyes my old stupid eyes. Because we have a criminal versus chamber official criminal recognized by Court Criminal. Constitutional open public me to buy a beautiful brown smart concert five times your lazy sloth in court recognizes. Why is exactly problem about this week up because it's 700,000 and ask her very simple question as possible. So she has five times. Is she staying in this chamber, It's possible. It's never happened before in American history. So cancel it supposed to be moved by tomorrow and yesterday she persisted for 33 years because you don't make me happy when you have too many idiots around your life. Nice little bit miserable, but very nice. It's a typical. America cleanse. Vicki clock Seattle policy manager for Cascade Bicycle Club downtown bike networks and essential elements of keeping people moving to downtown during the Seattle squeeze and it's reassuring to see that it's advancing many pieces of the basic bike Network to connect downtown to the neighborhoods to the south north and east of downtown when people took their bikes and rectal temp has people turn into biking to get around when congestion looms and that's a win for everyone not just people on bikes. It was like to remind people that when I'm on a bike, I'm not in the car in front of them or taking up that last seat on a tightly-packed bus. For the Second Avenue protected bike lane the spine of the network and place the most pressing work is connecting. That's fine to neighborhoods North South East and that work is only as good as its weakest link and we won't see numbers of people biking that truly reflect demand is simple without a connected network was assuming people will ride alongside multiple lines of fast-moving erotic sex is a big ask that's why I'm making connections as soon as possible Nexus protected bike Lanes on pike-pine to Second a connection from Devon to 2nd West light to Second along 9th and extending 12 all the way to yassa text and tell you give me followed by Andrew Kitty and then Jamie Holder. I'm just a citizen an advocate for bike and pedestrian safety for increasing our options for moving around the city more safely. I consider myself a pretty experienced cyclist. I'd like to cross the country. If I drown Seattle for the past three years pretty extensively. I choose not to own a car to buy bike really is my freedom of getting around but everyday I see close calls between drivers in between people's people on bikes and it's super scary out there. And do you know for me? I feel like I'm pretty experienced and I'm comfortable but I can only imagine somebody who's trying to get out on a bike. So right now biking really is not safe works for an accessible option for the majority of the population but was increased traffic in Seattle along with significant infrastructure changes are coming up. We really need a recipe of safe options for people to move around the city. So I'm here today with one simple request to continue to make strides forward on building out the basic bike bike Network protected bike Lanes really encourage writing. I brought her in a more diverse user base and I went biking to feel like an approachable option for anyone in the community who needs to move around the city. Additionally. I'd really like to see the structure with education of some kind of encouraging Community Partners to teach people on bike about the rules of the road to teach drivers how to operate around cyclists how to get people on their bikes how to navigate around bike Lanes. I see plenty of drivers turning left across the bike lane off of 2nd on a red arrow seen a lot of people almost hit and it's super scary. So we need the infrastructure improvements along with educational components and I think these two things really need to move forward hand in hand. Hello, my name is Andrew Karen. I'm with Rainier Valley Greenway is in Seattle 350. My house is about a mile and a quarter from the Light Rail. And so I figure that the bike in the light roast best way to get downtown for me by far and when I'm riding for my house, I'm very aware that I'm tall guy and I have big white helmet and I sucked big on my bike and I feel like maybe I'm a little safe cuz everyone could see me. I'm really big but then again sometimes I don't feel that safe. I feel like wow, they're going pretty fast by me. Anyway, it's not that safe out there. Even for people who are really visible like me. I read a lot about planning and bike networks. And what I read is that bikes are good for local businesses and I often shop on my bike. I redid bikes are good for air quality because well, duh. People exercise their good for Public Safety because they cam traffic they do so many things and I'm just mystified by why it's taken Seattle so long given all the things that we value in our city. What's taking us so long Thank you, Andrew, Jamie Jimmy. You're going to be followed by Drew Jasmine and then making Cruise. My name is Jaime halter name the four. Communications manager at wash. Northwest Regional Shoreline, I'm currently the communications director for King County Superior Court and I'm a volunteer board member for the green roads Foundation. I'm here today to talk about green which is an international non-profit board and based in Puget Sound and dedicated to the design construction and maintenance of Transportation infrastructure. Specifically. I'm here today to talk about the U District Mobility plan as an opportunity to showcase Seattle's environmental leadership and public infrastructure. And the rest of the U District Mobility group for their parts in co-create in the U District station area Mobility plan. We also thank you for your service and for Seattle's demonstrated leadership is sustainability and transportation. It has resulted in a beautiful vision for you District. We see this as a mindset and an opportunity to go one step further with greenroads certification. I'm hoping to persuade you to amend the U District Mobility plants concept certification requirement pedestrian safety bicycle connectivity. Anesthetics are a big part of the Mobility plan, but there is so much more to sustainable Transportation Green Transportation green best practices of Transportation project from materials to managing water runoff to maximizing transit to traffic flow has green glasses on sourcing materials close by to reduce the carbon footprint designing a project with water absorptive pavement that cleans before it drains designing intersections to fundamentally reduce idle time for vehicles and maximize through in Bellingham. They recycled public housing toilet and mix them with concrete creating the first potty cream as a resident of the Seattle area for many years. I know these commitments are almonds. hippies wheelhouse I'm running out of time, but I just wanted to tell you that Washington is not alone in its commitment to the green roads sustainable Transportation model green roads Works across the globe and countries like New Zealand and can't even in the United Arab Emirates, but you didn't see that coming in the US with States like California and Oregon, Texas and North Carolina and right in your backyard with projects in Bothell and red green roads policy in some of these places including New Zealand for high-dollar project. I'll respect everybody else's time. But if you're interested, please feel free to contact green roads, and I have some materials that I can leave for you. Thank you. Jamie. Would appreciate some materials. It sounds like a really intriguing idea. I drew thank you. A transportation planner with Seattle Children's and I'm representing the U District Mobility Group, which was a coalition of various community members residence representatives of UW District partnership Small Business Association who all got together realizing that you know, their Light Rail stations are going to be precious jewels of Mobility that we have to really optimize and maximize and frankly communicating better step up cuz it wasn't really a holistic plan about how everything was going to work around the station. So I'm very proud and very grateful that you're looking at a resolution to recognize that by the city. I will just say it was great opportunity that really have in-depth conversation with Neighbors in a time where that seems to be at a premium where we really got to delve into Looking at at the long-term possibilities for the station area and a couple things really came up which was people recognize that the U District is up pedestrian-oriented neighborhood relies on transit to survive and there's needs to be a lot of improvements around the station to make it not just a place that people can walk to you but that they want to walk to you that they feel safe walking to day and night are they feel welcome at police did the first projects come in the scope of the plan the 43rd Street project Pierce to be getting that attention from the city so far and we know they're selecting a preferred alternative and we just asked you to stay on them. Look within the plan. Look at what they're doing make sure they keep the focus on pedestrians on people cuz there's going to be tens of thousands of them on that street right now. It's closed off. So it actually doesn't support anybody killer through traffic and there's not really any reason for it to do so in the future. So we need to prioritize pedestrians make sure small businesses have access they need we want me to want to displace any of the Small businesses and really just keep the eye forward on on the sustainable able to support dense development neighborhood. That is it will be the U District in the future. Thank you you do. I didn't make a near me followed by clear Cantor. Are you the last one is kind of think they're reasonable and good way to support our transportation system, but not the way they're being calculated the way this is going to be calculated as based on l o s that measures just single occupancy vehicle cars and that leaves out two of the biggest drivers of traffic we have on our streets now one is the tncs also known as Ubers and lyft's and the other is our delivery trucks and I want to give you some statistics to illustrate this in 2018 recognize report by S. Says private ride TNC with 2.8 miles on the road for each mile of personal driving removed. That's a 180% increase. In Seattle the most recent figures I could get from the second quarter of 2018 reported 17,500 Uber trips a day in the 98101 zip code alone. GNC's in this ZIP code Rose 30% between 2016 and 2017. So it's it's only going up. Same report that refers to summarizes at TNC trips draw from users of sustainable modes like Transit bikes and walking rather than personal out of use. The net result is more driving mileage and less use of public transit. My question is how will these vehicle miles be measured and captured the way this bill is currently written regarding delivery Estes done groundbreaking research about how many trucks are on the road and the drive of e-commerce with all the packages we get every day. They're going to double by 2023 and there's no way to count those trucks. I found that that's just a big open question and that doubling is without any population increase and we know that that's not the case here. So my other question how will this be measuring captured in this bill? If we don't capture these vehicles Seattle will double its last because it doesn't insist that new towers are built with adequate infrastructure to contain their transportation impact. They're not being built with an S. Loading space or space for garbage should be contained interiorly, and the alleys aren't wide enough. We have a chance now to do all that, but we're not doing it. So we have to we have to have two parts that we have to capture all those things that are being captured right now and Yellow s bill and we have to do the infrastructure piece, or we'll lose. We can't we can't pay our way out of this if we don't if we don't have sufficient infrastructure, it won't work one side note. I understand the congestion and infrastructure problems, and that it may be slowing down. I encourage you to support this in every way you can. Thanks. Hello, my name is Clara can turn from Seattle neighborhood Greenways. We're very excited by the support of the council is shown for building out the basic bike Network recognizing that it's an equity issue Varsity that people deserve safe routes while they're traveling into and around our city whether or not they can afford to buy a car or a bus pass and recognizing that this is about our city safety and health and sustainability and recognizing that the hundred and ten thousand people who are estimated to use the completed basic bike Network represent that many fewer people getting around our city by less stable nodes. We need to build this network that is safe that is connected without these terrifying four-block sections where infrastructure just ends. I'm a star has stated that the for black gap on 12th Avenue between King Street and yesler which was a part of this resolution is currently off the table despite being Pride by Council despite the high number of people who've been injured in those four blocks myself included despite it being the most critical for blocks for safety and comfort of the entire basic bike Network, and we basically just like to ask the council to hold a stock to the promises. They made last summer and build this network through downtown and also recognize that this map represents. Literally the barest of minimums. It's it's literally just one safe protected route into downtown particularly from the south in from the East and that once this is completed which it should be. We need to continue moving forward and building out the rest of the season at work. Thank you. Saints and then we'll go ahead and close public comment and move on to agenda item. Number one presenters want to come forward and then I'll Jasmine read it into the rec commission item led to the status update on end of downtown Seattle Transit tunnel joint operations and near term action plan. Welcome everyone. Thank you all for being here. We didn't assign seats, so you'll have to figure that out. I want to see the animals start with introductions. Hi, I'm Hannah Marks. I'm the director of downtown Mobility for a Seattle Department of Transportation and Megan Shepherd. I'm the deputy director of downtown Mobility for the Seattle Department of Transportation. Hello, my name is Jim Curtin. I am with the project Development Division in the sound of the ocean. So thank you all for being here. Today. We have spent a lot of time the last couple years and suddenly last couple months talking about the Seattle squeeze. We got through Phase 1 and then there was Phase 1 a of a snowstorm that wasn't on the plan, but we managed to get through that too. So thank you for your ongoing work. And in the next few days, we're going to see a pretty significant and permanent change in our transportation at work as buses come out of the the bus tunnel. And so wanted to get an update on that and wanted to get an update on some of the other Investments that are happening in the downtown area to mitigate smooth impact. So thank you for being here and I will hand it over to you all. Okay. Well, thank you so much for having us here today as you mentioned on Saturday. We are ending joint operations in the downtown Seattle Transit tunnel. You may already know that the downtown Seattle tree. The tunnel is the only Transit tunnel probably in the world, but definitely in the United States that has passenger stops and uses both buses and Transit on Saturday that and all those 830 buses are going to come to the surface and be operating with traffic on the surface Street making the downtown Seattle Transit tunnel light rail on only facility. That is going to impact the yes that also be impacted because we're going to shuffle how the buses move through Seattle. So we don't have one one bus route that is or 1 bus weigh that is overburdened. The information is available to folks who ride the bus or if you wanted more details available on Metro's site a couple of the buses that operate in the tunnel or real work horses for the for the system particularly the 550 the 41 and the 255. So this is a lot of Transit service and a lot of writers that are affected. One of the things that I asked. And Metro or working on together is implementing all-door boarding on 3rd Avenue. This is if you've ridden right before, you know, you can tap on so you tap off forward and then that makes boarding in a lighting a lot faster. So on 3rd Avenue, you'll be able to use that ORCA card reader for any of the routes that operate on 3rd Avenue right now. There are already ORCA card readers at twenty one of the stops that are involved the slide says but I think it's 10 account the dots and it keeps being 10 / Metro is going to install new ORCA card readers that's going to happen over the course of the next year or so, but for the service change and and on going until we have those ORCA card readers, they're going to have people with handheld. In the peak. In the afternoon to speed that boarding in a lighting. Okay, so just so make sure I'm clear on this in public is the benefit of of the off the off the platform payment system is the front door and go through any of the doors and that means that the driver is no longer in charge of fare enforcement because they're not doing that correctly can get on and off the bus. And so the way you prove you paid your fare is not by the fact that you're on there. It's if a fare enforcement officer comes by you would use your ORCA card and they would scan that and see that you did scan on that's correct. I'm so if you are a cash-only you just still use the front door and pay by cash and you paint your transfer and so folks need to be aware if they're see everyone boarding on the back door, but it's about the Dome. I haven't done this that they need to remember to swipe on or they may encounter fare enforcement on that. I know you have a slide about fare enforcement shifting little bit to 3rd Avenue to help transition customers. They're not going to be a spelling people from the buses right away. We want to give people plenty of time to understand what the new system. Absolutely they did an event oppressive in a couple of days ago. And the the time saved is actually substantial. So I said there is press coverage. You can check that out great. It's a good set of investments in DD's. My understanding is he's originally these scanning systems were supposed to be in place by the spring and summer but we've been delayed a little bit because of some reconstruction challenges that right that is exactly right there a laundry list of issues why they aren't quite done by now, but Metro has agreed to have these Being told so that folks can we can get the benefit even without the infrastructure and realize it so 4 p.m. Rush Hour. Those people should be available to do that at the stops that don't have the readers other times a day. They'll just still need to board by the front door most issues with variable travel times. Metro and Sound Transit along with s. And wash. Have done a lot of work to make sure that we have communicated not only with all the bus riders but also with all the other folks that are going to be impacted by these changes everything from Rider alerts and Transit alerts. Everybody's has a Blog and everybody's been cranking out the information all day everyday one of the things I do want to point out. Is that estan washed up? I don't know what my problem is Sound Transit and Metro have Street teams that are going to help folks in the tunnel understand what's going to happen. And I think those are starting later this week. What F. In the department of neighborhoods are adding to that are some Community liaison Center going to be positioned at the bus stops that are impacted outside of downtown and those resources will be able to communicate in language. So we make sure we're capturing everyone. Okay, like I mentioned the 550 which is a sound transit route is a Workhorse Eastside route that brings thousands and thousands of people in each and every day that is going to come out of the tunnel just like the other Metro buses and will take its place on the surface streets. Right. Now the The Joint operating condition in the tunnel create some delays for light rail Riders. And so having the buses take their place on the surface streets will actually improve reliability for Light Rail and the transition will allow those light rail Riders to enjoy 6 Minute headways, which is really exciting and head weighs will continue to improve as a system expands. This change right now is helping us get ready for light rail to Northgate as well as Light Rail to the east side. So we are planning and looking forward to that. Don't worry wash. Is still in town and removing the viaduct each and every day munching and crunching away that's going to be about six months worth of construction. And if you wander down to Columbia, you will see that the ramp she is no longer there. They're also working on filling and sealing so that the Battery Street tunnel so they can do that decommission work that's going to take a couple of years most of the work though, especially in the early phase is going to take place underground. So you won't notice that much in the latter part of the construction. There will be some impacts on Battery Street because they have to do the final filling from Street side. In addition there working hard on North Surface Street connections so that we can connect South Lake Union to Uptown and have that operate better than it ever has. So as far as doing many of the things that we did during the SR 99 closure and with that same intensity including real-time traffic signal monitoring and management, we use data to improve how the system functions were communicating with technology providers like Google and ways to make sure that they understand what construction impacts are. They should not steer drivers into we're also proactively managing construction schedules so that we are keeping construction out of bus lanes for this time being we're not provoking any permits this time around In addition you may have noticed. I'm right out in front of this building that we expanded The Fifth Avenue bus only lane buses old turn on Marion and then again on 26 where there will be a p.m. Peak only bus only lane. We did some excellent work reaching out to the businesses along that Corridor. And so I think we have everybody on board with what we need to do and Metro has their motor coaches doing training runs right now so you can see them out there. 8001 sleight of hand by cat believe And so I have to use the bike connection since it's night and it's so, you know, it's a small change, but depending on where you're going from City Hall has proved to be a shorter route. So I be smiling. In addition, we're continuing our very cohesive communication strategy with our agency partners. We think that that's one of the things that made the SR 99 closure go just about as well as it could have one of the things that were adding this time is a little bit of a campaign to help folks understand the options that they have to go shopping and eat at small businesses downtown and then use transit to get to and from so that's a campaign that you'll start to see I think we launched it last week. So you'll start to see those besides coming up really soon. Because it's always a pleasure to come and visit you council members at we have many opportunities to interact and a joint operations is coming right up and we've already talked about the Battery Street tunnel the north Surface Street connection as well as the demo Alaskan Way construction is going to start mid-year after demolition is done. So that's another big one for us in and tolling of course. We're not quite sure when that's going to happen, but it's going to be late summer and then in January for about 10 weeks Sound Transit is going to go to single track operation so they can complete some construction work that's going to be a little bit of a change in it a little bit of a burden for folks who use the light rail in the tunnel, but we're working on ways to mitigate that so many opportunities for us to interact with you as well as with Community one that I want to note that is a new addition to this time line is you you may have heard that the Port of Seattle is planning to add a cruise ship terminal 46 46 and that's scheduled to come online in 2022. So there lots of circulation issues down there. So we want to make sure that we have lots of time to work with him today to sort those out. Snooze the single-tracking to the tunnel for Sound Transit. Do you say January? 2020 January 28th for 10 weeks? Okay, you want to get here? It's complicated set of construction because of the nature of needing to bring Eastlink into the existing Transit tunnel, which will soon be called the light rail tunnel and wanted to do that construction before the Northgate link opens at 10 week. In the International District. If your destination is the International District, you're going to be able to get on and off pretty easily. But if you're on a train going from the airport all the way to you Dub you're going to have to walk across a platform to board another train to then continue back. So there's going to be a complicated nature there for 10 weeks or so and a little less than a year. But it allows for us to do all that construction now in advance of the 2023 open. Link to the east side without disrupting service to Northgate just after it opened Sound Transit actually planned this very carefully not just with respect to opening at North Link and Link to the east side. They also wanted to wedge it in between two bags season. So that that wouldn't be too much of a of a disruption. So they put a lot of planning into that and now it's the time when asked. And King County Metro need to come together with sound transit to make some mitigation plants. I'd say that the last Library going to go through on the agenda. Also, the the new term action plan report. So appreciate that is not a presentation. That's like so she did with that but we have copies of the hearing folks Republican. Look at that. We can also answer some questions. I'm just getting update on some of the bike projects downtown for a refresher for those in the audience that haven't been tracking it or those watching on TV. We brought them back up sights. It's the apocalypse lines. He has been advocating for a number of years to make sure that we have safe Connections in the most dense part of our City downtown. And of course, that's the place where are right-of-ways the most constrained and if so much demand for it so and after a couple years of of some success on pieces of projects, but frustration that they weren't all connected last year the city council passed a resolution and honestly supporting and committing the city for a policy perspective to completing this basic bike that work by the end of this year. And I really appreciate the collaboration with us. Both with with my office and council members, but more importantly with the the bike advocacy Community because I know you all have worked very closely with them including taking us out and walking in Vikings different aspects to see This is not the only thing happening in the city right now is you highlighted and so how it integrates with some of the other projects. So my understanding is the generally things still on track based on that resolution, but I wanted to just take a few minutes to walk through some of the some of the specific projects and get an update and where there are, you know of hiccups that we are anticipating or things. We already know. It'd be great to are those right now so we can talk about him. Great. Thank you. We did bring a few backup sides and just to set the contacts for the ones that are sitting near term action plan on making him free bicycle facilities in it. In addition to a many other strategies related to keeping TranZit moving like V extrinsic pathway. We just talked about and they all their boarding on 3rd Avenue as well as other types of enhancements will be putting him if he ran over the next couple of years to make The Pedestrian and Transit passenger experience better than it is today. So it represents a joint 30 million dollar investment that the city of Seattle King County Metro and Sound Transit are making together. There were three bicycle facilities in the near term action plan a protected bike lane on Pike and or pine that has the next phase of that which will be between 6:00 and Bellevue has a Target completion date at the end of this year December 2019, and then the South End connection from The end of the Second Avenue bike lane down towards Dearborn also has a Target completion date of December 2019. Both of those projects face. They're very complicated project and they're having a very complicated environment on with both stakeholder issues traffic operations issues, but we are moving forward on those the third project. I'm in the near term action plan was the Fourth Avenue PL and our Target. There is a have the design complete this year and we're on schedule for that and Jim Curtin who knows way more about bicycle facilities than I do is here as well to help provide some additional information and I'll be happy to jump in I think, you know starting with on the north end of town. We had a breakthrough on 8th and 9th Avenue. We have some good news there. Looks like we're going to be able to get going out there and the third quarter of this year. So that's fantastic progress. Bell Street is on track to get started in the fourth quarter as well. And is Megan mentioned we're looking at Can find getting going this year as well. We do have some issues to the convention center construction site that we're working very closely with them to to mitigate could be that we have to ramp people up onto the sidewalks were looking at all potential Solutions through that construction zone which obviously want to be extra sensitive and thorough to whatever we put on the ground out there Clayton. So on that one, you saw the presentation in the last committee meeting from some of the work that early ecovillage Capitol Hill district. My understanding is been ongoing conversation with some of the design elements of of that connection, which I really appreciate committee members doing that the convention center obviously pretty big project that big chunk of real estate and so from my my expectation is that we continue to work that as best we can you know, traffic impacts are going to be traffic impacts. I think a frustration It has happened in passed around construction is that it feels like pedestrians and bikes off and don't get the same level of where we supposed to go during construction. And so I know you for that. So hopefully we as we figure this out, you know, making it the safest most convenient as possible recognizing that they'll probably be some things that aren't quite ideal, but just having some transparency about where folks are going to be able to go and hopefully that doesn't hold up the rest of the connection even though that the whole network will be totally Complete because that construction fees getting those pieces on the ground and ready to move forward with the roughly Bellevue to Broadway section. No matter what and we'd like to do it all together. It's just a matter of making sure we get that coordination done and get a thoughtful safe facility out there for folks great. Thank you. I interrupted so continued connection are big hang up. There is a tametra layover spaces on Main Street. So we're working very closely with them to develop a design. We think we've had a breakthrough there as well. As long as that keeps moving forward. We're going to be on track for that as well. And then the one that I'd bring up his be 12th Avenue, I think as one of our fellow commenters Clara mentioned that's segment between yesler and King does look like it is going to be very difficult for us to build a bike facility and we have looked and modeled conditions there the operations at that intersection are already set up to move transit to the area particularly the sum of the routes that are serving that the ringer Valley but also the streetcar as well. There's a lot going on at the intersection. It's basically were born and Rainier meets also 12th Avenue, and of course yesler as well. However, we You have another segment on 12th. Just south of there that will make it a nice connection which would be 12th Avenue between King and golf golf is very south end of the Doctor Jose Rizal bridge. This is a segment that would connect to existing facilities on Beacon Hill. It would pick off one of our high crash locations for bicyclists as well at the South End of the bridge and provide a what we're hoping for a very nice protected bike lane up to King Street, which we connect to the King Street neighborhood Greenway where people could head West through the CID and into the downtown as well. So there's a lot of work to be done around that one as well. And we are we're hopeful that we can get it a nice connected Network felt as soon as possible connection between between King and yesler on Long 12. I would love to find an opportunity to have some Tell me more technical conversations with some community members to really understand what some of those challenges are. Sometimes. I know that the there's like policy trade-offs. You know, what are we prioritizing over something else? And so if there is things like that, they need to be contemplated to be really good to just highly what those are. Sometimes. It's just specific technical challenges or constraints with Peter Whatever It Is A Streetcar something that just it's just not going to work. So making sure everyone understands what's in the place and what is what in it may be useful to do a little walking tours out there too. But why don't we move back with some of the community the bike community members and figure out how we can have that conversation and see if there aren't some may be creative ideas that haven't been able to been fully vetted yet the floor or the minimum make sure that everyone understands where everyone else is coming from so that we can move forward of these for the shared understanding if even if we're still not going to be with her that sounds terrific There's some other things it in this action report to the talked about as mentioned. It's not just about bike Investments to make the safe. And so I really appreciate the sum of the transportation demand management tools and other stuff is not about concrete or wires or anything. It's really about sharing information. And I don't know if there's anything in here you you all want to highlight about what's going on that it was great to read through the report. I would just like to say and maybe Megan has something to do to note to that that you're we absolutely concur with that one of the things that got us through the SR 99 closure. No doubt was people deciding to flex their to meet a little earlier or a little later or work from home one day a week all of those things that sort of fall under the heading of Transportation demand management work absolutely critical to the success that we had and we really appreciate the entire communities hard of hearing that Clarion call that your commute choices are more than about your own commute and your own convenience that there is a that there's a shared responsibility there and that there's a community impact that all of our individual choices make Yeah, I'm anything else to highlight of the U want to touch on in here a couple things that are upcoming for the September on Metro service change in preparation for that will be making improvements at the International District Chinatown station. And again these Arts you like expand bus waiting areas and passenger amenities wayfinding on for people that are making connections. There is also be improvements at the montlake triangle to help a bus riders make the connection to light rail more easily there. So changing where the buses pull into the station as well as making some accessibility improvements. So in our next quarterly report, we can provide additional information about those that are those are some of the next big thing for looking at Johnson here cuz you might know better than me, but from the side that is in be truncated and go to Husky Stadium instead of downtown. Valuation for truncation and that decision will be made by the King County Council in advance on out there who happens to pay attention. There's there's only a handful of routes. There are a lot of buses in a lot of people that handful of routes there currently in the bus run on obviously. Those are no longer be the best title. And so your folks water down to I assume that the folks at her writing those commute everyday or should be well aware of this by now and know exactly where to go but I hope that it did folks are doing that work so that they know that provokes it or just the occasional writer and just every once a month to go down and catch the 41 to Northgate they going to show up down there and be like something's changed. Where are they going to get information about where to catch the 41? Will that be just go to their schedule rapper there to be signs up in the bus tunnel is it explained that there'll also be boarding assistant? There'll be people there that help people get They need to go and we'll go sucks be there for a few weeks or he'll be there for at least a week and that'll catch most of the the commuters and then the signage I'll say after that and then obviously you text on this to even if you're on a bus route. That's not in the tunnel as possible. Some of those routes changing the route. They're on to make room for some of the bus is coming out of tunnel may not have been paying attention cuz they might they cannot may not matter and may show up on Monday Monday morning. Hope it won't matter but Monday afternoon when you're heading home you like wait a minute. My bus isn't coming here what happened and so again for next week, will there be individuals on the routes on the surface streets to helping drunk people absolutely and the slides you went through. I appreciate the details of of highlighting which route to getting redirected. So folks want to follow that and that's what drugs can visit Seattle. Gov traffic or metros get ready website for more information about that. So thanks the public. Once again. We're calling on you, and we'll be doing this a few more times before the year is out to destroy. It really pay attention be flexible. Be patient, and I appreciate the comment you made that, you know the decisions we all make impact everyone else to so for those of us that they do have some flexibility. We're trying to produce as many options for people to consider when trying to make you as we're of those options would really help. I appreciate the business Community really helping and being flexible with the different shift hours and things like that to something great. Thank you. Thank you. Next gen item item number to visit information item related to the Shoreline Street ends at 8. Welcome. How are y'all doing? They're good always exciting to hear about these wonderful Street ends. It's been some cases feel like they've disappeared and re-emerging is an asset to the Community Corrections County one just keeps your name in Atco chair and founder of friends of Street dance in public Space Management on the shoreline 3 Program Coordinator Oppenheimer, and I thank you all for being here have a presentation. So do you want to just jump in it off and just wanted to give you a brief overview of the shoreline Street in program at per the request of council member O'Brien and I'm just highlight that the shoreline Street ends. Is it unique program in the street used to vision of s. And it provides opportunities for public access to Shoreline set a butt. Public right-of-way and Omar is going to go to in present the details of the program and then we're headed over to Karen to give an overview of the friends of Shoreline Street in a group. Thank you. So I can start off a little bit of a connection to how strong 3 and Stein despots. Overall Mission Bay suede shearling experience program for that starts values by connecting people to our beautiful Waterfront making more vibrant City overall. So I buy in his presentation of helping you guys know a little bit more about the programs at a very small program. Most of you probably haven't heard of this. So what is a shoreline Street in Akron information to history of and also the Mission Vision of our specific program and some of the program elements as well. So what is a shoreline Street and it's basically a council designation portion of right of way that extends from the ordinary high-water Mark all the way to the next Jason intersection. And so it is right away. That's not controls and it's typically 46 ft wide we have some that are real 202. Why is well, I don't know how how you start making a city but I assume eons ago someone planted the whole city in these things are just put down on a grid and they connected the dots and what was left between was land we could sell and but then they involved in different places and different neighborhoods. Is that Yes, ma'am. In roughly history and mosquito Fleet Service on these sites as well. So there's kind of a difference from a sham different reasons and usages. These are especially precious because there's so few sites in the city where we have access to the water cuz the way state laws work. It's quite privatized in most cases that you don't own the shoreline. It's a private owner who owns the Carolina Tideland adjacent. So that's kind of why this is it state law to make around these are basically to provide physical access or views to the Shoreline not all shorelines. You can get physical access because of a funeral topography or other constraints, but that's the idea is to provide that access as the primary priority. We also provide permits at the site. That's also what funds are programs. We try to balance those permits with access as well. So where are these sites? We actually have a giant step is. Well, you can kind of dive into this little closer to find out where they are in your community. But the map on this image kind of gives you a rough idea where they're scattered across the city most super concentrated along the waterways within our city both North and South in Long Lake Union is also other scattered throughout city as well. And so just to be clear to each of those dots represent friendship Public Access that may have had some improvements or may be inaccessible because of blackberries or something like that today, except there's potential for Public Access, but some sites are fully permitted or industrial uses. So our Maritime uses are part of that use in theory, but the are still our main priority is Public Access. So this is this are currently under permit that may have not Public Access something like the sum of the slides earlier where we've seen some improvements to make it easy for us. I'm in limbo at the moment. So if you actually find RJ on the website under Republic Waste Management, is it worth a visit or not? And that's kind of Our rough indicator of like, you know, do you want to check it out so. So backing up a little bit. So the program was created in 1996 through Council action that also set policy as well. And there were only a hundred and forty-nine Shoreline Street ends. And since then we had some policy updates and some changes to the program director rule can a more nuanced changes the most recently. We've added Shoreline Street in program coordinator position, LOL. That's me tell you about that. We've done some work plan items in 2017 prior to my getting hired the kind of evaluated all the sites across cities. We took photos. We sent interned Ollie's locations, check them out and see what the status was were there encroachments with her. Not and also an assessment was done to figure out what sites we should be tackling First Basin like an index. So a little more of a kind of a scientific approach to taking it looking at what's important to us in this community. So the Mission Vision of this program. So is the Troy Street ends are precious Community assets that thrive through bus Community Partnerships. And then our mission is to improve Public Access and protect you need to use enhance habitats for maritime industry in Foster City worship throughout these sites in across the community. So we're going to dive into some of the program elements here and going to give you a flavor of the day what we end up doing and the program's kind of support these sites. One of the primary things we do is encourage adjacent Property Owners to remove their encroachments if they aren't currently permitted and if appropriately guide them towards gaining a permit for their uses. So if there is not a a Park Community interest in developing the site for access at that time, and we feel it's appropriate to print a permit. We do windows permits are given there a yearly kind of renewal fee and we expect those sites every year as well. Make sure they're staying within the balance that they're paying for and in those fees once collected help fund program management basically and I'm proof daddy sites and so are those permits in a revocable is a year so as our capacity shifts or Community interest shifts or whatever it is. If someone decides like a next year, we'd like to you know, redevelop the site for crepe batter access. We're not locked in locked out in this case cracked head in the photo you show and encroachment in case it looks like I'm some industrial use what I just storing materials there and is that typically or imagined the name or residential areas is people that video over time there is property owners have either inadvertently or or intentionally got to read landscape than assume the use of that public right away. Is that also an encroachment typical types of person species either expansion of backyards or material storage were the main ones we permit either of those again, if if there's no better demand for their superseding like Community project coming in projects coming up with existing encroachments. And so we are going to Property owner Jason to make sure that you know that the plan neither works with the encroachments or if we want to we can kind of skill practice encroachments depending on you know, what's needed and I dad that there's some good examples on the north side of the ship canal in Ballard where the adjacent industry has taken over and and it's a public safety problem. So they are paying a permit and that permit go straight then into the fund the attitude from the city seem to be the adjacent property owners are responsible for the shoreline Street. And if they want to privatize that they can privatize it if they want to let the public in like a month Republican and that's what changed in the 90s got it. We shifted to a more proactive role say no does the public good and we will collectively Define indignant that may change the user may not but we're going to be proactive in that. So with that funding base being solely on permits. We are you know, it's obvious that you know with encouragement being removed the program funding removes lessons. I should say that means that we can sort of her line or Partnerships more in that instance. But the point is that where we're going to be working together with the community to do improvements and also seeking grant funding to kind of Leverage the dollars. We do have coming in which I think significant currently so but we're still trying to plan for the future has basically in 10, so When you talk a little bit about the improvements s. And our Community Partners both do improvements last year in 2018. We did three projects all kind of package together on the North and South sides of the First Avenue South Bridge also East Allison Street and kind of see the top right here image that really fun ass eating that was installed by an artist and some other improvements and followers can keep cars Santa Fe right away retail Partnerships help us with Warsaw Street continuing to do restoration efforts there over the next couple years and a East Highland Drive Francis Street ends at a great job partnering with trees for Seattle and we'll show you some of that there later in a second University of Washington and their landscape architecture program developed 11th Avenue Northwest. I showed you some images that earlier during the mission and vision slide we can stack up at your cares about it. And it's in 2014. We partnered with parks to do a bunch of different projects associated with the the levy Parks like it went through that time. And forgive you kind of a flavor what f-stop projects typical look like. This is Allison Street ends. It was developed last year and it has some of the more heavy improvements that if you know, you know members can't necessarily put into its concrete railing steps down to the water's and bollards new parking. Basically, you can can you see me before and after the main difference is it looks like a public space and that's the types of Bruins were trying to do or not trying to create a super high maintenance Park sensitive or just trying to create know that access and the what's needed for the space to get it to look for public. Straight that's when I happened to stumble across in the last year both the before-and-after and a great Improvement. And I appreciate the bike racks their ex got a chance to use them. So it's a nice one in District 4. And so I'm running out of time a little bit. But so I guess I'll talk some future projects coming up at the cross street, which was originally a park project. We are going to try to put a new railing on steps down to the water the kind of stuff. It's got a little bit of a steep slope right now for trying to clean that up and at 6th Avenue West. We have a new transfer in kind of opening up. This is kind of a long pass projects. I'm sure some committee members may have heard of this already, but it's coming back around again. We're trying to get off the ground in 2020. When you say you're trying is it like capacity like you can only be in so many places at once or is it like funding or is it like a coordinating 18 City agencies just take so long that last one so coordination. So we actually had a couple different staff members going to turn over and said we lost live with mentum and also just the fact that I'm picking it up now and getting under it. It takes a little while to get Shoreline permit. This is big enough project at its we're not sure if it would exempt you're not yet. We're hoping it will be some legal technical stuff. We have to work out to some of our partners Samantha swell Foss Nursery friends of Shoreline Street ends up here coming up April 27th at East Prospect Street guys. Want to come out there and help us. There's a sign up on the streets Seattle website. If you want to help us clean up that site this lot of blackberry that location similar types of improvements also coming up the east side. Subway on East Pine Street spread the street ends. They do some great work out there. I'm sure they can talk about it more later. So also jump up utilities has to pump stations that they're redoing. So they have a retrofit at 22nd, which is Kramer Street this year. They're going to be starting construction. And in 2020 in South Park. They're installing a new pump station near the 7th Avenue Pump Station. So that's been long anticipated and it's finally riding it. So that's an opportunity where Public Access and serving that utility need her. I can coexist in the same street in maintaining a site for us. So we're just one of those Partnerships where whoever is at the site. We're trying to have that department take care of those locations just to save to cruise going the same locations. so we talked about all these different Partnerships and it's important that we been able to work with each of them to Develop sites, we can't as an organization pull off the project all the time. So we try to work with Community groups of business organization, the strength of Street ends and our internal partners with parks spu and the port block projects and you just kind of falling here or just kind of quick run-through of what types of projects are Partners pull off. So, this is East Highland Drive. This was as kind of a fantastic project done a couple years ago where they took a kind of a Bramble and open it up. So you can actually see views of the water. This is adjacent to Lake Washington before and after here, you could not even tell if the shores behind there a nice little blue sign opens up before you and then some really great native landscape and community-based installed. So this is the type of work. We like to see that's amazing. I mean, obviously If you were driving by the first one, you have no clue that there is any reason to pull in there and the second one is just invites you in which is great as nice guy will be down there too. So it's it's nice across three dimension earlier. That was one of those initial Parks projects are the Levee and so this is what we're hoping to install a little bit safer path way down to the water at a railing until this is an example of a business owner coming in and proposing a project to us and a senior construction did a great job here opening up the landscape at 28th Avenue. Northwest in Ballard And so tell me a little more about that to a business owner. Want to do, just improve the sights make it look better for customers and employees to enjoy to and the public benefit or just that was actually the second time that he had done that site Seashore wanted the sights developed and it was kind of slipping into the water and not doing much so they developed it 10 years ago 12 years ago wooden benches one of the problems because the proximity to the rail line there is people were sleeping on the benches. So they took out the benches and then they read developed the entire site with s. And the business I paid for the development and it's a public park. Let's spend his stewardship, isn't it? That's really cool. And so good segue. So we're going to talk a little about stewardship. So about a third of our sites are currently maintained by the community. And so without them we cannot get the level of service that we need throughout the community. We partner with spu's tree master program and the green Seattle partnership also to increase the amount of stewardship spun Seattle s. Basically have cruise to come out and we'll help kind of pick up materials are dropped off by volunteers that helps greatly expanded amount of capacity that are committee volunteers have nails have tool trailers that dragged out to help these Restorations. Go a lot further. That's it. I'm well, thank you very much for having us here in our our goal today was just to inform you and citizens about the value of these incredible public spaces. I was involved in Coke County friends of Street ends, and it was almost 25 years ago and at that time about 20% of these amazing places where open for public access and over the course of the years now 50% are just really welcoming beautiful places about 20% have the permits so that you cannot go in in there in about 3% still or the low-hanging fruit is gone some more complicated but lots of opportunity and you kind of go. Why why are we spending so much time? Why are we interested in these places? Well indeed. Anna the late eighteen hundreds when are city was platted a streets just simply dead-ended on like bodies of water like Washington like Union the Ship Canal the duwamish Puget Sound and when you visit these places and I really encourage people to do so you just value our water is so amazing. We're right here on Puget Sound get how often do you actually smell the salt water? Will you can do that at these these amazing places and there's many things that make these things so positive and and a joy to work on but I got to say the partnership with f. Is absolutely key and having Omar on board having the funding that keeps that position on going is critical and then Angela and Elise also, so it's It's always a challenge especially when you go in and open these up for the first time. There's a fear from adjacent property owners that own other people are going to come and so but as soon as these are open, they're basically used by people in the immediate neighborhoods walk their dog meet their meet their friends meet their neighbors. And so it's it's always worthwhile when we sat down in December with with councilmember O'Brien. He immediately went to the math and there's some math involved in this and these this program is supported by the private permit their paper encroachments and our overall goal is eventually there's no encroachments. These are all completely open for Public Access. Well, there is one unique Street on end and the adjacent Property Owners pay up to $100,000 a year. This is based on the value of adjacent property for the use of this low Bank beautiful Waterfront and their long-term goal is to remove the encroachments and no longer pay that money. So that means $100,000 which is a very high percentage of the fund will no longer be available. So in the long term, the ask is really pretty small in terms of the city budget that approximately $100,000 in deficit will be because some We were successful but on the other hand that ended up being left money. So that's something that we ask the council to be thinking about in the future and and then Marty often hamar has been working on this but was the south end of Lake Washington and in the ship now, so Marty Stuart Park and what are the troublemakers who open South Willow Street? Some neighbors loved us for our then some neighbors hated us for it and Willis Street is amazing because we get all kinds of people coming down there all year round even in the rain. We there's a lot of Orthodox Jewish families in the neighborhood. They walk down there on Sabbath. There are Asian kids who walk down there a black kids who walk down and we don't have any trouble no matter what happens mixing of people. There's no trouble there. I'm also involved in South Park where my business is, and we're trying to open Shoreline Street ends in South Park. The Seventh Avenue M station site is is one that we have looked at for a long time and it's wonderful that we're working with SVU in opening that now because there was no good way for the community to open it. You been to South Park you may have seen the gear Park that the board opened which is also a street and and then the poor and S. And Parks connected that across South Riverside into a much larger Park area. So the the Partnerships that make these things worker or grade my wife and I are the stewards of South Willow Street and you will find that lots of people who live adjacent to Street ends or not adjacent Street ends become the stewards and keep things going and we do we tend to do cleanup and we rely on us. Help us on the bigger jobs. I really appreciate their Collective work over over decades to really bring these public assets back into the public eye and appreciate the folks at us. They're doing that too. I text I also appreciate highlighting that these are not without controversy and but it's for my perspective at least it's the absolutely right thing. We should be doing and we can be smart and we can be considered as neighbors. And this is a public right away if Public Access, it folks don't want to live there. They can choose to sell a property and move somewhere else and it and they should be fearful of visitors and has plenty of examples around the city and around the world where folks from different walks of life interactive ways. And the water is a draw for folks to do that and really positive things come out of that. And so I'm really grateful that work and I want to make sure there were supporting this going forward to sew Caron an estimate on the Timeline of when that one particular encroachment may be unencumbered how many months or years do we think we have till that changes in the next the next six months and it sounds like they backed off. I'm so we're looking at probably I'm looking at you all more probably about a year or two. I think permits now going forward and they have developed the landscape plan which is further than they've ever gone before. So we're staying on top of the checking in but they said for sure for this user can be paying their full fee. So so I'd say the average average members of our community who are out exploring and stumble across a place like this would call this a oh what a cool little park at the end but these are technically in many cases not run by the parks department, but they are the type of open space that we want to cultivate and nurture and so internally the city will will How to figure out how we find out right funding and who's the right Steward of it the city and where that money goes, but I'm going to Publix perspective in my mind. At least. This is the type of investment and access an open space that we have a deal with car parts department between the number of the places and I think it's appropriate frosted to dedicate some general fund Revenue to make sure that I'm discontinue be maintained and it's going to be critical for business operations to stay in a minute be appropriate for people to swimming expose Shipyard. I don't know but be great to do with that call to the public access on which means we will need an ongoing funding stream to do that in you know, the new I don't know if that's allowed to they're not but those are a variety of places where we might want to look to see if you want to include that and figure things out. Ford and then I just add that if people are interested in moving forward to working with us. That and us being an all-volunteer group Princess Street ends. Our website is available online and I'm there's a link to a Scott's website and S. Has a great map. So if they're out and about they can just go on and discover. If this is indeed public lot of lot of people in town that have a lot of energy a lot of these folks are highly skilled and engineering and Landscape Architects. And as you mentioned the easy ones have been converted but challenging ones, you know, why people do like a challenge and so an invitation out there for folks who want to look at the map online or physically and Highway something they want to take on for generations to come would be great. I'm or a lower threshold would just be wanted to set a summers fall project to pick a couple of these and just go visit him with your friends and family and check them all out because it's great for more more people than just be aware of them and you And that's that's also a benefit to all of us to know they're being used in loved. Thanks for your work. And I'm committed to figure it out how I can help make sure that the work continues her decades to come to. All right just went public hearing schedule presentation and then we'll jump into the public hearing. Is that information out of the range of proposed comprehensive plan amendments relating to Transportation impact fees in public hearing. All right, kiddo, when you're seated, I'll let you introduce yourself and you have a few slides I believe to run through and then we'll open the public hearing maybe before we start for school counselor wearable. Thank you for joining us. I want to be clear about what we are doing today, but we're not doing today. This is not legislation about Transportation impact fees directly, but it requirements for a jurisdiction to implement a transportation impact fee is it there is a project list is part of the comprehensive plan. And so the the city needs to take a step of adopting a transportation project list of the comprehensive Plan before they can proceed to do legislation. We're not actually a document registration today either because our effort to do that has been challenged through I think cepa thority so that's going to the hearing examiner June, but we had noticed this for a public hearing. Go ahead and do the public hearing today recognizing that it's still at least a few months away before we will take action on a comprehensive Plan update to incorporate the list which needs to happen before we actually do legislation to actually Implement Transportation impact fees. So this is like step. I don't know what number it is in a multi-step process and there's a lot of steps coming after that. So the public hearing should be the testimony about the public hearing is more about whether or not these of the right project list not about that. That's the action we're taking there's two people signed up until we are they talking about but I imagine books like I don't like this thing on the project list, but I suspect we might hear more just about the general idea Transportation impact fees so cute. All right, so I have a few slides here that I'll run through a lot of this covers ground that you I just covered cast member Bryan so this should be pretty quick but this isn't some ways picking up where things left off back in November of last year, but just to remind folks about the legislative history and 2014 the council amended the marriage proposed budget. So for the 2015 budget, I'm to add appropriation Authority for development of an impact you program during the administration that work progressed to Point there was an identification in recommendation on which types of impact fees to pursue and even development of some importance of an impact fee program the council docketed consideration of impact fees for consideration in 2018 and August of 2017. And then in October of last year the council prepared a bill and then do the comprehensive plan to add a project for transportation impact fees in that special determination for that bill was appeal to the city hearing examiner and the hearing Sounders going to take that up in June. So what is state law require of jurisdictions that Implement a transportation impact fee what has to go into the comprehensive plan? But it seems we have to go into their company to plan is a description of deficiencies in this is actually not another not a l o s standard that were using her for deficiencies instead of using something called an existing system value methodology and also a project list Leicester projects that remedy to deficiencies that have been identified so we'll walk through what is in the bill more or less. So I'm the bill I sent out the existing system value approach to identifying deficiencies in that essentially is an approach whereby the jurisdiction quantifies the value of existing infrastructure. So it comes up with the replacement cost of existing infrastructure, determines what A cost which an impact fee cannot exceed and that cost is essentially the value of the existing infrastructure divided by the number of current PNP Garrett reps. And then and then I was part of the deficiency analysis to jurisdiction. What we're proposing to do here would be determining the cost of passing through vents is not actually end and the conference. This would be a future stop the cost of capacity improvements for Christmas by dividing the total cost of impacts be eligible costs associated with the project. That's what you'll go through in a minute future person trips. What does down for me a couple months ago but it's it's pretty complex. How does this methodology differ from? Yeah, I think this is based on Portland and Oakland approach has a different from Washington State jurisdiction. Is this methodology as well? I think Kirkland use it differs from traditional approach may be a level of service standard associated with a particular facility and the impact fee would be designed to bring that level of service up to level service at me know CB or a trauma level of service F. And so that would be trying that would be something classical Improvement would be something like Road widening to achieve something like that. So the project less this is mostly what the what the conference plan bill would do it at a list of projects to the comprehensive plan a drive from a few sources here are current CIP projects Mobile plans somos Tu plan implementation is a key driver and selection of projects for the project list and also move Seattle Vision project. So projects that are not necessarily funded by Moon Seattle to wear identified to move Seattle planning process for future investments in my bathroom bag fees and some that are prohibited you briefly went through. I think what some of those are but our does this list include projects that are only eligible for a funding from Impact to use over this require Blended funding from other sources and impact fees could be one of those sources. Can you tell me a little bit so these projects Expenditures with impact fees so they'd be improvements in the right-of-way the benefit of travel. I'm so they're not necessarily things like things like that. But I just mentioned this would have an example for us would want when they think of her classic impact fee program is not with contemplated here. Then wore the nature of things like complete Street Improvement. So have a proven stew with in the right of way that benefit Transit as well as as pedestrians and bikes and auto too and we feel like we're on strong that are using this methodology to make these kinds of multi-modal improvements with her and Maxi dollars we do. Yes. I so I'm moving on to the list here. So as I mentioned the number of complete Street projects that exist in the current capital program summer drive from a variety of different sources, but they're also some projects here that Implement on things like the fade master plan. The project list also includes a little plan implementation for the bike master plan pedestrian master plan afraid master plan be showing you a map and a minute that does not reflect all the potential Investments that could be made for these little plan implementation projects. And then I'm there the move Seattle Vision projects which are longer-term and also broader in scope and he's also include complete Street projects, which is the Aurora Avenue complete streets project. So where were these projects be located? Here's a map. That is a somewhat better version of what they said that there's a pretty good distribution throughout the city. I'm so what you are mostly saying reflected on this map are complete Street projects and Fred master plan implementation projects. What are. It's not shown here because it would just be too busy to show our the help I can pack on master plan, pumpkin projects. So this map or something very similar to this map to be included in the plan. So that's more or less a cast member Bryan as you mentioned the comp plan amendments are a necessary but not sufficient step in Impact fee program. And so they'll be some future legislative decisions for the council to make possibly in the third quarter of this year. How is any questions for keto at this moment the limitation on armed conflict in Bedminster exploring with the city attorney's office address actions can amend the conference plan was done concurrently with amendments to an adopted budget and see if the city were to adopt and I Transportation impact you program that would also include include changes to the capital Improvement program and possibly also to some tables. Great, I'll go ahead and open the public hearing. We have three folks signed up today. Alexandra men's the first I didn't see him here. So that leaves Randy Banneker. You're next in the neck and Cruz. Are you after Randy and if there's anyone else and you can show up after Megan, you'll have up to 2 minutes honey. I hear I want to talk just a little bit about Nexus cuz impact fees are a lot about Nexus the idea that growth is paying for growth and you're fixing deficiencies where growth is creating a new deficiencies. Well, one of the Nexus has that gives us real concern about impact fees. Is that of the impact on housing affordability. So yesterday you took on those up songs impact fees add to the cost of market-rate housing and they add in significant ways depending on How and where you set those fees when those fees are financed? If you're going to charge that project developer at the early stages that those fees will be financed for the duration of that project coming out the ground and then the purchaser of that market-rate unit will be paying those fees as well. So it has the perverse effect of a really channeling. It added cost on the last person to show up in the neighborhood. So I just asked you to think about that as you contemplate this this concept is where we have impact fees in the region XI of the growth management Act created the allowance for local jurisdictions to impose impact fees because we were talking about jurisdictions that just hadn't had me building products. They didn't have any facilities in place. So if you look at impact fees in the city of Kirkland City of Redmond between those two cities, there's actually unincorporated King County that is not served by sewer. So they have extension fees things like that were it's a different story in Seattle. We front end that we paid things forward. And so if we need to fund Transportation improvements, our request would be to continue to look at the tools that are a broader catchment in which everyone dies. Thank you. Thanks Randy. Megan Hi, I wanted to make some comments and have some questions hopefully could give you answered first. This isn't going to pay for the growth that we have in Seattle are streets can't hold the number of cars and vehicles we have on him right now and we have to do something to fix that in listening to kiito's presentation. My question about the methodology is how can it come up with correct values of existing infrastructure. If it doesn't know that if we don't know the peak hour trips by tncs as I mentioned earlier, I mean 17,500 trips everyday in zip code 98101. It's it's immense and it's growing by 30% a year. How will we capture all these fees that we need to keep infrastructure moving here? If we if we only gauge It by L o s single-occupancy vehicles. It's just not accurate. We have to expand that the project list should include things that aren't on these lists. It should be things that the S. Has been working. With regard to adequate loading births number and size and space and Ali should be expanded if an ally can't be expanded because of an older building across the way from a new tower is got to take more than two feet. Otherwise, we've got most of our alleys in downtown one lane only and you know, the density that were adding is just not going to be contained. So this this is all good, but it's not really working with realistic figures. That's about it. And if there's a way to answer the questions, I would be great like to hear it. how to talk to you Drake great ahead and close the public hearing calling. Thanks for being here for that keto thinks your presentation. Just repeat one more time. It will be sometime after the June hearing examiner hearing the will get a decision at which point will potentially be able to take action on this but it's at least a few months away, but I'm appreciate the feedback from both books. You should have stayed a comment and look forward to more interactions to better understand how to craft a plan going forward. We have one final agenda item Jasmine even read that in the record 3 a resolution recognizing the community-led visioning process and the recommendations found the U District stationery Mobility plan and supporting a pedestrian Focus rebuild the Northeast 43rd Street. And we have a prisoner here today. You do. I am your presenter today councilmember O'Brien. I want to say thank you for making time on the agenda for me to come and talk to you about this important to an inconvenience fee to be a slideshow for us. But I just wanted to give a little bit of context. So the University District is a place under growing a lot of change not only did we implemented them editorial housing affordability program there. We also have the significant opening of the Light Rail station in 2016 and Husky Stadium and plan for 2021 for the U District station. We just adopted a new master plan for the University of Washington and it's a place that has had a lot of design work that preceded all of this. It's also got a lot of great Transportation connections and challenges coming to with the service revisions that we just talked about coming and play. Is it September of this year Peter service revisions when Northgate comes on line in 2021 as well as some City LED projects like the Brooklyn and 43rd Street projects in the next Metro is also course planning for two rapidride lines the Roosevelt rapidride line in the 45th Avenue rapid run on Unity came together inside. Hey, rather than having a nose for different jurisdictions come to us once every two months for the next six years and ask for our opinion on what they should do in the face of all this change. Let us be a little proactive and pull together a proactive vision for mobility in the neighborhood so that we can then just insert your government's issues or questions here in the conversations that we've been having. So if you move to the next line Amy, it is a community-led process station Mobility. Group has been funded by several of our partners s. D o n. University of Washington, but also has been really active active participants from folks like the Seattle Children's University of Washington U District partnership. They hired some good folks from makers and fear and peers to help lead through a series of focus groups and design charrette towards getting an outcome and I have come to the council and asked us if we would bless this set of recommendations as part of the validation. I think of the work they did not dissimilar from the presentation that we received a couple weeks ago about the Capitol Hill Hugo District. So here's a little bit more about the best ringtone from the app for of Seattle's top 20 challenging intersections currently serve by 16 bus routes with 193 buses per hour during rush hour lot of traffic on Has anybody can a test and a lot of growing bicycle facilities as we continue to build that are protected bike lane that work at Indy for and in order to get to this Vision are our friends in the U District did a whole lot of public engagement walking tours at the street fair a couple years in a row Community workshops survey presentations to the petting Transit advisory boards. They did a transportation choices Transit talk just on this topic and the design charrette. I think that both you and your staff and me and my staff attended was very informative about some of the challenges that I think that Community was asking are different governmental agencies to wrestle with one of those challenges include is generally what are the principles in the neighborhood and you can see all our next slide some of those sometimes those principles are in conflict with each other and I'll pick on a street like 43rd where We're going to open a really incredible Light Rail station at Metro would like to have bus service serve on 43rd. But members of the community would also love for that to be a pedestrian-only street. We heard in public, today. It is currently for the for all intensive purposes two blocks of a very limited run right of way with very limited cars on it today. I think that there's a really interesting vision for the community have that be a pedestrian-only Street Metro wants to run buses on that street that's going to have carbs that maybe that maybe working for a pedestrian-only it may not work for pedestrian-only. So in order for the group to really coalesce around the recommendations, they had to start with some principles in these are there six principles giving top priority to show movement design for pedestrian access to the station configure an efficient and flexible bus route Network safe and attractive straight down varmint for people of all abilities complete that bicycle And address the multi metal Moto challenges that we have on 43rd, which is very busy cordle. So get some recommendations Phase 1 and Phase 2 phase one being things that they like to see the city Sound Transit a Metro do before the station opens and then face to being with things that are open that will happen after the station opens the Light Rail station opens, so you can say we just did a little I'll run down here preparing a plan to inform future route planning as the service changes happen for Metro bus service in anticipation of the 2021 opening of the station working with Metro on all of the things where they're going to lay over buses. What kind of buses are going to be running. How do we improve the East-West Connections in that Corridor particular on 45th 45th has unfortunately been as you know delayed in terms of the rapid ride line planning, it's not in the current 6 year plan. The Roosevelt rapidride line is still in the six year plan will still have a lot of important busted that'll be running on 45th and just won't be running as a rapid ride. Working with sound transit to continue configurations on 43rd and is you heard of public testimony as I understand the project team is going to be very close to announcing with our final design preference would be on 43rd. So we look forward to that coming soon additional to recommendations. How do we think about electrification of our bus fleet? We got a lot of buses running up and down the Ave and and on 15th will have a lot more buses with the reconfiguration. Implementation of rapidride lions and I know that there's a really strong interest in contemplating having those rapidride lines on 45th go down the viaduct and serve University Village Inn around the corner to Seattle Children's. That's a very important Mission connexion. I think for a lot of folks right now. And when you add to the fact that limited geography in the U District for those buses to lay over and then turn around and go back towards Ballard. Net Connection straight to the hospital is a little more space got a lot of a little more room to stretch out a Brooklyn is a really interesting street. It's long. The bottom is a Green Street, which could be for bikes pedestrians and Transit but not for cars. There's a lot of interest in kind of realizing Brooklyn and and what's the right mix of multimodal Investments on that street particular for the block between 43rd and 45th? Invision I think there's a lot of folks who are interested in and kicking cars off the out. There's a lot of folks are interested in keeping cars on the app that will continue to be like what we see in Pike Place Market the tension between those who want to see an active pedestrian Corridor turned over to exclusively pedestrian Corridor while those who really want to hang on to the idea that cars are things that should be allowed everywhere in the city. I would love to see us pedestrian as both of those places and continuing to work through those challenges around Brooklyn and 43rd. So that concludes our sort of brief background on the community of the resolution is supported by a whole host of community members many of him who would have been here today, but I guess the sunny weather deterred a lot of people from attending today's meeting but a resolution and of itself is a blessing of this work and a desire to affirm that the community with r Financial support pull together this Vision. So again instead of having to be responsive to S. Metro Sound Transit the University of Washington and others they could develop that Vision first and then allow for others to to work within that Vision as as new projects come online. So I know you have a thousand questions. I can't wait to hear them all. Okay, so it's the Northeast intersection of just kidding. I think this is an amazing body work customer Johnson appreciate your leadership and really appreciate committee members and frankly once again to come together in a way that kind of model some some really good behavior about really being proactive and thinking about a vision and really doing it away if it's not always been impressed about the inclusiveness and the visioning for not just who's there today, but who's going to be there in years and make sure that this is an area that it's growing it's changing the to accommodate all those teacher needs. So without sanding Ivy from up climate in the transportation of the future perspective values are really aligned here I think in general with the city. So I think that's great. Look forward to passing this next steps as far as you know, once this becomes City policy officially, do you have a sense of how those conversations will continue and proceed? Both no resolutions come with a come with a different set of requirements than ordinances do our departments to continue to work collaboratively with this Coalition of actors who've come together with this Vision. The most immediate near term step on that is related to the design of 43rd and Brooklyn and the relationship between those designs and plans for Metro bus service on those two streets as the Light Rail station open. So I think that's another really important products of a lot of our conversations that are happening right now. Our best. Teams are sitting here in the audience today who are putting the finishing touches on the several different design options and looking forward to I know getting public feedback from the public about those design options for Chick-fil-A on 43rd. There's obviously complications around the Light Rail station because we've already for all intensive purposes permitted what Fashion design looks like and the right-of-way immediately adjacent to that station. So there will need to continue to be collaboration between us and Sound Transit if we're going to be asking them to make changes as well. It is a common frustration. I know for both you and I to be sitting here in 2019 talking about how I station can't be changed even though we're still a year and a half or two years ago with my station being open. So I think some of this is going to be a bad just continuing to maintain good relationships between the individuals who are doing work on the ground in our respective bureaucracies and it works well for everybody. That's great. I know to be clear we're not talking about park and ride at the station, correct. And so the tension were saying is between bus access and pedestrian access. And so I appreciate that. Those are the the priorities they were trying to navigate and I've been you know frustrated in the past with light rail including capacity stadium. We haven't got Transit access better that said outside of downtown. This station has the potential to frankly have the most people that are beginning or end of their trips as pedestrians. I'm making those connections to whether it's jobs in University or whatever and so it can be really exciting pedestrian node and how we make sure that it's safe the basic principles here. I think you're outstanding and as you mentioned he knows that there may be conflict between him but I'm I'm really hopeful and look to Our Community Partners and the agency partners to find Solutions where they're actually not in conflict. And so let's find a path that can hopefully lift up all six these principles in a way that they all work and we're not having to make too big of trade-offs and I know that's it's not always easy, but I think we got some great design folks in town so we can do that. So Great Wolf let's take us the next apps. I love to ask for your support and Adoption of resolution 31873. I will second one favor see if I'm passing on a wonderful counselor next week. Thanks so much. And thank you everyone in the audience. There's nothing else will be adjourned.", "end_time": 6217.9}]}