{"format": "raw", "annotations": [], "confidence": 0.9527900499456069, "data": [{"start_time": 0, "text": "Good morning. Thank you for being here for a regularly scheduled meeting. I'm just passing on copies of our minutes. And so as we begin I'm doing the council member sawant whereas Pacheco and Gonzalez. And there are two minutes that we are passing out. And so if there's no objection the minutes of the May 28th and June 3rd, 2019 meeting meetings will be approved. You know Jackson the minutes are proved we have just I live to the Best Buy nation of two executive sessions this morning and both may require some time. So just a forewarning you nothing from to vote from the governess in equity and Technology committee. We do have a sense. I don't see cast member O'Brien mention that this Tuesday June 11th at 5:30. There's a notice and call of a special meeting which is a public hearing at the sustainability and transportation committee s Tuesday, June 11th, 2019 at 5:34 to topic has a doos and other issues associated with test dwelling units. and think I'll stop there and just go around the table talk about today's full Council actions or any other items of importance council members to want the council agenda from the Human Services Equitable development and renters rights committee. The next meeting is scheduled for its regular time, which is tomorrow, Tuesday, June 11th at 2 p.m. Where we will have consideration of appointments. The Seattle renters commission one is 14 abbraccio. And the other is for McGregor. Good morning everyone. So there are no items today on today's calendar for the Civic development public assets and Native communities committee. However, we did have our committee meeting June 5th, and it was very informative and much-needed and I think to some level much pretty emotional a presentation on missing murdered indigenous women and girls by the sale Indian Center's board. CEO SOS Arrow Chief research officer Abigail alcoholic and the government Affairs officer Aaron spirek, The Illustrated the lack of accurate data collection and classification of missing murdered indigenous women and girls cases filed by law enforcement at all levels of government as you all know, it has we've shared there a many many barriers to fully understanding the scope of this problem, but we have sufficient evidence to show that numbers of missing murdered indigenous women and girls are are sad and are wrong and we must do better and we hope to do that. I'll be working in partnership with uihi to develop a plan for this and also the my council members to T up some legislation. If you're interested in learning more you can visit the sale Channel and watch the presentation or read the report at www.uihc.org. I want to thank councilmember Gonzalez. My vice-chair accounts were badshah customer mosquito customers want and customer Pacheco for attending Thank you for your time and your support on this very urgent and much-needed topic that we need to address our next meeting or are my committee is June 19th at 2 p.m. Cancel her badshah. Thank you very much for stepping in ensuring that for me. So next on June 6th. I have the honour which I've done three years in a row to ring the bell to start the Lake City's farmers market in the 2019 season, but the University Village or the University District stole our Bell this year. Yes. I just said that Abel. So we want our bill back the rain did not stop or Neighbors from coming out and enjoying the delicious food flowers and local fair of d v. I love this event because it demonstrates is the strength of our community my team and I as usual will be regularly attending the farmers markets about the summer and fall and I look forward to catching up with old friends and constituents and Friday had the opportunity and also counts murbad show as well to attend the annual Splash a fundraising event and with many others at the aquarium dollar sign by some guy and some band. I don't know if it was Nirvana or the other one. The other one was another group. What's the other big group Soundgarden Nirvana? What was it called when people anyway, they sell two guitars for $27,000. Yeah, I wasn't my ear regeneration wasn't paying attention and who not that they're not a good group. I'm just saying I just wasn't sure who they were moving people and they raised a lot of money for the aquarium. I want to thank Bob Davidson and bombed on again. They were both great and are raising the money and of course we want to thank Martha cons grad and her husband Peter Goldman who were also co-chairs, I believe and the event. Thank you. Good morning. You didn't call me. But I'm going to the neighborhood committee from the committee today this afternoon. We do have a committee this Wednesday on June 12th, and we've got an ordinance from a Seattle public utility Wharf building lease and the big one is a response from the sweetened beverage tax and short term rental tax funds and what we're going to do with those how we're going to invest them that first conversation will have one of my committee and we're also going to be having our first conversation appointing Bobby Humes is director of the Department of Human Resources. The following meeting. I'm is June 26th in my finance committee, and I just want to alert people that things are going to start building in terms of not just only enthusiasm towards the budget but the excitement we always get around the finance committee. But on that day on June 26th, I have invited the folks from sirs are Seattle City Employees Retirement System to come and talk to us. I had asked for a response many of you know, that Senate Bill 5240 had been introduced by Senator reuven Carlyle which would have given the city of Seattle and opportunity to take its investment and roll it into the state's investment in through the investment Advisory Board and I had asked for an independent analysis to take a look at that with the options would be whether that would be in the city employees and retirees best interest and a note for those of you who've been around for the last decade there were some significant problems last decade with some Investments and the employees retirement system had really was really compromised and some key areas since then. Though we've done a lot of work and I want to acknowledge the finance department and Jeff Davis himself and Jason malinowski. They have brought a team on board that has made critical improvements and changes to Sir. So those of us who were invested in it. I had asked for an independent analysis to come back and say how are we doing and the and the analysis was offered two weeks ago and I've asked Jason and Jeff Davis to come back to my committee on June 26th and talk about the system itself the financial help health and really the decision on why they do not want to be joining in with the state. So if that is of interest to you or anybody who's listening June 26th of my committee, and that is it for my virtual girlfriend Pacheco. There are good morning. There are 9 plus deleted items on the full Council agenda today 6 appointments to the Seattle design commission. Cancel Bill one 19505 which adopts the Ballard neighborhood design guidelines cancel bail bond 19506 which adopts the Capitol Hill Neighborhood design guidelines and Council Bill one 19489, which allows for major institutions in a small area small area. That sounds near spu the next Wednesday, June 19th, and wanted to say congratulations to all the graduates that will be in District for this week all the graduations in recent graduates at the University of Washington, and I want to thank all of the volunteers win this weekend's Seattle works today who volunteered on Saturday throughout a community and this lunch time. I will be with United Way emerging leaders program doing a Facebook live event to get more young people engage in our community. So thank you again, sir Pacheco. Thanks for that. Thank you so much and good morning. I'm the Civil Rights utilities and economic development committee on the agenda today include. I'm an appointment of Bobby Lee as the Director of the opposite economically velamints. We've had to committee meetings. We've heard this appointment shared questions developed by the council as well as easterlies answers. And in addition last week comes number should have all received a council expectations letter for Appointment Lee who we will confirm said induction. We will have a bill coming out of last week's committee watch Lee the public hearing that we had last week. This bill would amend Ordinance one to 5650 to extend the effective date of the ordinance by 6 months. This is the council bill that established an interim expansion of the Pike Place Market historic district pass last year. They legislation will allow the department of neighborhoods additional time to complete the work that the council asked it to do last year in ordinance 12565 0 and the central staff memo accompanying this legislation notes that department of neighborhoods expects that their consultant will complete much of the work necessary to develop a preliminary recommendation by the end of this month. We had a number of folks come out to testify in support of the legislation at the public hearing last Tuesday and folks coming out to support the legislation highlighted the basis for keeping the property within the boundaries on a temporary basis consistent with the council's decision to do so last year and pointed to a number of factors that make these deliberations aligned with the intent of historic districts namely that the market was established in 1909. The Showbox building itself opened in 1919 today, even many visitors go to both places when the Showbox opened it open actually as a public market and there is both Synergy of Commerce in that people go to both places, but there's also a physical Synergy between the building and the market self. Other items coming up this week for me. I have a committee meeting on Tuesday on the agenda for tomorrow's committee meeting include a geographic and demographic analysis of hate crimes in Seattle presented by dr. Tim Thomas from the University of Washington. This is work that was commissioned as part of the city Auditor's work that I requested that the city auditor do to look at hate crimes impacts in the city. And so we've heard the report on the enforcement side of things how cases are being handled by a speedy and by the courts, this is Basically a hypotheses that we asked the professor to test to see whether or not there are any Geographic or demographic trends that can be identified by mapping the locations of hate crimes in Seattle in addition on the committee agenda for tomorrow. We have a briefing item for spu and the Seattle Department of construction and inspections to discuss their efforts to implement new Solid Waste storage in this requirements in new construction. This is an item that I have brought up with both spu and sdci. We had talked about it during our mha discussions and were interested in potentially making those changes during those discussions, but spu and ftci. I thought it better to handle them differently, but the upshot is is that we know that people do a better job in multi-family housing recycling if they're the recycling the garbage in the compost facilities are all cold located on the same floor. And so this would be changes to the building code to require new construction to have access to each of the three types of waste disposal facilities on each of the floors. So we're going to hear from s p u n s u c on their progress on drafting legislation in engaging with stakeholders in the development Community about the need for this and then finally we're going to have another briefing from the Arts office on our fantastic Creative Advantage program and they're good amazing progress in getting Creative Advantage in all. Are the schools in the public school district made great progress as far as major events coming up this week on Thursday will be having a bunch of second graders from roxhill elementary coming to do a tour of City Hall and visiting me and my offices as well as having some time here in council chambers. Also Thursday. I will be giving the Excellence in advocacy award at the Seattle Human Services Coalition 27th. Annual Human Services award event. And in addition in the morning also on Thursday. I will be attending the shape of trust which is an effort of the city working with a claim playwright. Sarah pork Kabob who has written an original script act actually using our city employees accounts of racial harassment discrimination and other other. Experiences in the workplace that are evidence of the progress that we need to make as as employers. These stories were collected through the city's ours Jai I surveys and I am really excited to see this production. If you recall council president Harold one of our RCI Retreats that we had as a council was the one-man play on Langston Hughes and the power of that event. I think was a springboard for many on trying to figure out how we can use art to express the experiences of folks in our workplace play on Saturday. I will be attending and Fundraiser honoring the southwest Houston family services and the West Seattle helpline. This is a fundraiser that is held and sponsored by the cruise industry charitable Foundation Pike Place Market at that intersection of Western and Virginia. I've heard for much of a decade about the concern people have trying to drive through there and wait for pedestrians and S. Has said for years to me. There's nothing that they want to do because it's a safe intersection over at nobody's ever gotten squished. And so their 50th is okay, but the backup every summer gets to be pretty horrific Buster Simpson came up with an idea a couple of summers ago, and we pitched it to them then frowns night of the idea of working with our police department but bringing An artist and like what they've done in London and other places dressed up as a Barbie or some cases it's dressed up as a lime, but it gives pedestrians priority but then stops the pedestrians and watch the cars go through. We actually have somebody who is interested in putting forward money for the summer to give it a try a pilot, but I'd love to see if it's something that you be interested in working with the Artist as a pilot to give it a shot cuz it would make the neighborhood very happy. Creative Gonzalez. Good morning. There's nothing on this afternoon's agenda from the gender Equity safe communities new regular meeting this Wednesday, June 12th at 9:30 a.m. Here in council chambers. We will have only two items on that. I'm at mornings committee agenda. The first one will be a bill to consider allowing the mayor to enter into an interlocal agreement with King County for purposes of allowing a countywide Emergency Medical Services Levy to be put up for renewal on the ballot for King County voters at the next general election, which would be November 5th of 2019. So again, this Council would authorize an air to enter into an interlocal agreements with Kane County and would further authorized King County to place on the ballot for the general election on November 5th, 2019. This initiative is approved by Kane County. Where's the new Levi would provide 436 million dollars during a six-year period and total revenues to the city of Dallas fire department for emergency medical services. So important 08 is expiring soon and it'll be important for us to submit a proposal for King County voters and Seattle voters to consider. All of these critical services will be a presentation for the Department of Education in early learning who will be giving us a presentation on their RCI work and so will have their change team at the table providing us an update on their work in a deal really excited about that some notable events that I'll be doing this week on Thursday, June 13th at 5:30 p.m. And I'll be joining and Wishin for their 27th annual Human Services award reception and I'll have the honor of presenting the 2019 outstanding organization Awards super excited about that. And on Friday June 14th at 10 a.m. I'll be joined by fifth grade students from Maple Elementary School is like Kim's number for Golden. I have the same flavor of the calendar this week really looking forward to having an opportunity to ask them about the work that city council does and and making sure that they have that Civics 101 component as our young some of our younger constituents in the city Outdoors for all this is a nonprofit dedicated to enriching the lives of children adults with disabilities through outdoor recreation and really excited that my team and I are have an opportunity to actually cycle around District on adaptive bicycles, which I have never ridden but looking forward to it. So stay tuned will be posting lots of pictures and videos. I am sure of it on Saturday, June 15th. 7 p.m. I'll be joining the graduating class of the institute for Democratic future in Belltown to congratulate them on the culmination of their Fellowship in the graduation of their class. And then just a river point of personal privilege here Cody writer for my office is actually graduating from that program on Saturdays making it a total of three of my legislative aides who will have graduated from that program the other two being Briana Thomas and Vino and so super excited about being there for that momentous occasion and I last play on Sunday June 16th at 1 p.m. I'll be joining neighborhood safe Street organizations from all around Seattle right here at City Hall for a rally for Safe Streets. I'll have an opportunity to provide some remarks to the folks before all of The Advocates who are gathering here. We'll take a ride down 4th Avenue to Westlake Park. It's a family-friendly event starts at 1 p.m. Here at City Hall in the Plaza on so if you are interested in advocating for Safe Streets across Our city join us on Sunday, June 16th at 1 p.m. Here at the city plaza at City Hall. Again. It's a family-friendly event. So if you want to bring your kids and their bikes, please feel free to do. So. Thank you Tuesday in your absence. Are you asking me not to repeat that too much as I can leadership and transportation committee has one item on this afternoon. And then thank you for mentioning that there's the only committee meeting we have this week is the public hearing tomorrow evening really quick just for those that are tracking this on the out there you all are aware of the typical protocol in just want to be clear with folks. Will the meeting will start at 5:30 Central staff will give a brief presentation and I'm guessing it'll take about 10 minutes just a really high level overview of the types of changes that are being proposed in that legislation that I'm putting forward and then I believe they will also walk through a couple of areas where they've heard there may be an endurance and stuff just to highlight those for the audience and then Amelie jump in the Harbour caring folks will have up to 2 minutes. Each to talk will be here as long as it takes to get to everyone like we often do I have set of 3? More people want to come to the microphone together and combine their time for either one person to speak for 5 minutes or to share it across 5 minutes. That would be fine to just want to be clear with folks when it come up to the microphone to be part of a group. That's your public comment. You don't get a circle back with multiple other groups and then get your own 2 minutes. So but anyway, we expected to have a pretty decent crowd and probably be here for a couple hours tomorrow night. That is all for me count specimen hero. Thank you, Brian. Okay, so we're going to move into executive session. Is anyone has anything good for the order we are going to is presiding officer. I'm announcing that she will convene into executive session by step to subject matters that I explained earlier the purpose of the executive session to discuss pending potential or actual litigation. This gives us an opportunity for the full Council discuss confidential legal manners with our city attorney's is authorized by law on illegal monitors always present to make sure we reach our questions for policy for open public sessions and weeks. This session lasts 1 hour to will say a little over one hour. So we'll say till 11 a.m. And it goes beyond that. All announced its extension in Open Session, and I will will extend it so I can't read that list moving it into executive session.", "end_time": 1521.3}]}