{"format": "raw", "annotations": [], "confidence": 0.9481440274803726, "data": [{"start_time": 0, "text": "Oh, good morning. Thank you all for being here. And sorry for the late start. It is 10:53 and my name is Teresa Mosqueda today. I'm the chair of the select committee on homelessness and housing affordability. The meeting will come to order and I'll soon be joined by hopefully our full Council colleagues. Wanted to make sure that folks know that we have three three items on the agenda today. Hello councilmember backshot. Thank you for joining us a co-chair of this community as well. The first item on the agenda is to do a presentation on data and metrics ideally a benchmark or a dashboard presentation, but we don't have that full presentation today will tea have a future conversation first. We'll have a piano from the human services department and second will have a panel from a few of Our Community Partners. The second item on the agenda is the winter weatherization hsd storm response many of us were asking in the wake of the February snowstorm. How did we do? And we wanted to have a better sense that council member. I'm so what would you like to join here as a culture as well? That is great. And thanks for being here. And the last item on the agenda is the client group update. We have had at least one time to talk about the formal structure of the joint effort to create a new government structure with King County to better address homelessness. And I would also say housing which will be a future conversation. So with those three items on the agenda any other comments from our Council colleagues before we go into public Comet great. We are going to take folks who signed up for public comment. If you haven't yet had a chance to sign up there still time will have about 20 minutes for the section. Thank you so much. I know many of you were waiting for a while to speak. So I really appreciate you being here will have 20 minutes on the agenda as per Council rules the council shall. Public comment on items that are on today standing committee or our work plan public comment at the committee shall be limited to matters within the purview of the specific committee or an item listed on today's agenda as presiding officer. What I will help to ensure that public comment is in accordance with rules 6 c 3 a hand with that was the first person who is on our business Freeman followed by Bruce Google. Hello. And thank you. Thank you customer Juarez for joining us as well. You are fine. We are just getting started here. Thank you and good morning. My name is Anitra Freeman and the 24 years that I've been active in Seattle and King County efforts to address homelessness. The most to test I have seen is when homeless people themselves have been involved as full partners. Token committee members included to give cover of legitimacy to the decisions of funders and bureaucrats. But as fully engage Partners the homeless organizing efforts in Seattle have demonstrated our Effectiveness one example is during February's storm response. Wheel shelter stayed open and was open extra hours. Most of chair shelters were open 24/7 the one chair shelter. That was not open 24/7 was safe haven because the host Lehigh did not invite us to HST did not include the share and will shelters in the resources that they were notifying people out of. These are examples both of the good work that we are doing and how much could be done with the full cooperation of Lee of HST and of others Nickelsville has accomplished great things and deserves and needs the support and cooperation and to be treated as partners not to be undercut and lied about my Lehigh and H St. Council members. demand mediation between Lehigh and Nickelsville support the homeless organizing efforts that Seattle should be so rightly proud of Thank you. Thank you. And you try appreciate your testimony. Annex will have Bruce Goreville followed by Shawn Smith. Sorry if I mispronounce your last name Bruce. Good morning. Chairperson Mesquita and City Council Members. My name is Bruce Coville and I'm the democratically headed head of security at Nickelsville. Othello. Tiny house Village. I've written a copy of my testimony here that goes into much greater detail. Some of my fellow Nickelodeon's will also speak to you from the heart about this terrible problem. We don't have money or a lobbyist. All we have is the truth and you You represent us. Please cast politics aside seek the truth in act. We need mediation with Jason Johnson hsd and Lehigh. We need an investigation of hsd Hangout to you as a community in great Peril and anguish a community that many of you were supported and with your help has flourished, but truth be told Nicholasville is under attack by Lehigh have been anointed by h e to do so and doing so hhd has ignored the 2015 City sanction and Cam and Gordon's repeatedly and disregarded the directors ruled implementing. It hsd has not honored. The reality is one of only two authorized encampment operators in all of Seattle. Only list of drupes can operate in that cabinet. That is a requirement. Is mandatory an outlet in ordinance instead hsd has a wrinkly partnered up with a Goliath complex director Sharon Lee and her thugs like minions HD has allowed Lehigh to overthrow our Democratic self-managed Village which voted to reject this takeover Lehigh responded by Staffing it with her own employees backed up by intimidating security. We are now ruled by upper management at both Epsilon of bullies and deceivers delete case managers assigned to us or unfair insensitive and have violated their own code of ethics. They and others in Lehigh have perjured themselves manipulated facts and sadly enough. Are stopping at no cost with sess assassinate the character not only of Nicholasville, but homeless people throughout Seattle. These are strong accusations that are Justified and document. Please read the entire testimony. Listen to the others who want to testify to the specifics councilperson mosqueta. Please meet with us by Michelle Atwood. Welcome. Mr. Smith. Good morning members of the council. My name is Sean Smith. I am the elected external Affairs coordinator of Nicholasville. Othello's Village. On a check on April 8th Lehigh staff supported by hsd storm through the service entrance of our camp. All that stood up with orange Lehigh security vests in a dorm with GoPro cameras. We are a cam of singles families and children many awoke to a chaotic and frightening see Lehigh security pushing a resin out of the way in order to destroy a fire department approved lock gate. Lehigh security walking to the Village intimidating residence women confused and frightened held their children type of shock shock for the scene on folding before the police arrived and hers Bailey us or at Lehigh to arrest people but you just sense prevailed and with no rest made they acknowledged this was the Civil matter rather than a criminal matter council member should know that SPD with professional thoughtful and neutral in this in a self-managed community of dignified and purposeful dowel a broken and Report sheet. How could this happen in the city of Seattle a forward-thinking city that is playing the way for homeless people to become productive members of society. This cause of the failure is hsd is with the intern skiing term director Jason Johnson a man who has neglected his people and his Department serves man who is not only asked for the city of Seattle. The whispers are false accusations have clouded his judgment and let him down the path of your seat. He has dismissed with you the council members have written in the law ignoring rules directives and worst of all the voice of homeless people in a recent letter dated April 9th 11th, Jason Giants stated that he has reason for moving forward Lehigh with lack of progress with a required a more you give us will provide you well before the deadline set for March 8th. We have provided wound Glen before the end of 2018 install a note counter proposal. Really high did finally returned to the sponsor me February 2019. Nickelsville adopted many changes into that ain't on you. Just nickels and I'll leave the rest of my testimony here. Okay? Yeah, that sounds good. I see you have a printed happy to take that and apologize for the short time frame. Thank you, Michelle. That sounds good. Thanks. Is that word for being here? Thank you guys for taking the time when Lehigh did finally returned a response in February 2019. Nickelsville adopted many of the Lehigh changes to the mou not just Nickelsville band members of to community advisory committees have stated Lehigh failed to respond in good faith and walked out of these discussions Members First hand witness Shirley's refusal to negotiate key points to the mou which Lehigh stated was 95% complete. Instead she use that opportunity to perpetuate or assassination campaign against Nickelsville. That's why the community advisory committee have written to you to ask for mediation with hsd Nickelsville in Lehigh with a skilled mediator. Please listen to them and us and read Bruce's testimony. I have a minute and 15 seconds left to ask you guys for help my friends and my family are scared. I had to leave my community because of direct targeting by the low income housing Institute and Sharon Lee actually fled the state because she was so focused on me and Ed was trying to use me to hurt my community. They need your help. They need you to listen to that. They are in danger from these people and I know it sounds inflammatory, but it's not these things are real and they are happening to us. They're happening to me just because I'm a homeless woman in the in the city of Seattle doesn't mean that I'm less than does it mean that my voice is less than we work very hard. We working very hard in these villages to keep the peace and to give people a hand up to help them re-establish themselves. Not a handout. We don't need anyone to do the work for us. We want to do it ourselves. We want to help ourselves. We want to better ourselves and not be bullied for doing it and not be abused for doing it. I know all of you have read all of the documents that we submitted to you from share wheel and Nickelsville all of the things that happen to us. Read them believe them. It's true. It's true. Thank you very much, Miss Atwood and to you and to mr. Smith have me to follow up with you with a meeting. I know a lot of folks have been asking about what else we can do to call upon this question. The next person is Peggy hotz followed by David Haynes. Good morning city council members in Jefferson mosquito. My name is Peggy Holt son speaking today to convey my serious concern about repeated and harmful violations of the city's authorized encampment ordinance. I'll be leaving a packet soup with supporting documents. This ordinance was passed in 2015. The ordinate specifically mandates that only authorized encampment operators will operate encampments in the city of Seattle to organizations. Nickelsville. And Cher were given that designation following the city's request for qualifications process. The human services department began violating the ordinance almost immediately. Tiny house Villages have been encouraged and able to stay well past the 2 l e or limit in the ordinance in order to try and skirt. The law hsd gets multiple temporary use permits for The Villages. HST is aided and encouraged the low income housing Institute to take over operations of Nickelsville. But Lehigh is not a qualified in camera operator a just these responses been decided a contract in this case called a Services agreement with Lehigh but there's no allowance under the ordinance for operating in Cantonment using a contract as you heard from Nickelodeon's themselves a result of this direct violation of the law is that numerous homeless people are suffering trauma everyday and their long-term well-being is in Jeopardy and investigation into why Lehigh has been collaborating with Lehigh hsd has been collaborating with Lehigh in violation of the city's own law is overdue everyday that goes by brings additional harm to members of the city's most vulnerable populations and puts the city at serious risk of expensive legal action. While the investigation proceeds, please require mediation between hsd Lehigh in Nickelsville to the immediate damage. Thank you. Thank you for the materials to welcome back. Thanks for being here. Good morning. Seattle is dying of social societal implosion because a 2012 police reform was sabotaged and the corrupt flaws of law enforcement assisted diversion. Now city council should still reject Jason Johnson is permanent Director of Human Services Department. He doesn't have the best interest of the innocent homeless proof of that is the lack of accountability with a six figure salary non-profit getting rich subhuman subhuman mystery in the port. In fact when there was a 500 per person increase from 2017 to 2018 Jason Johnson, simply opened up more concrete floor space in the basement of City Hall and deceptively issued a media press release to manipulate taxpayers into believe in the city government was actually doing something about the increases. Get no accountability for the nonprofit hard to pad the books on cost of offering nothing. But a dirty met in a loud cement floor Warehouse Echo Building. It not designed to allow for normal living now. We need an investigation into who and why the city government and all home.com hired the future company also known as National Innovation service. The company is only been in business since last year for like 4 months when they got their first contract with the city of Seattle they came up why on Earth is City Hall hiring New York startup filled with college. Excuse me. skinny They're clueless about how to solve the homeless crisis yet highly motivated to incorporate their own personal racist and converted it into the system. They supposedly are experts at in fact the national anthem Innovation Service Incorporated our business in February 2019 after they pocketed their paycheck from City Hall to create quite frankly looks like a violation of recently recently released reports by a multitude of government and non-government agencies. The report reads quite familiar to the city auditor report a 2015 the multitude of others. It's a going to Seattle with bring the national Innovation service, which is filled with people from New York housing the way to life copycatting other expert reports and making an all culminate into a perverted racist lbgqt agenda within the system. They want to claim expert at solving it probably know nothing about in fact Marc dones only spent four months completely report. The only interview 200 people who are homeless and a hundred people. He's be asking him later. We will happily take any written comments that you have as well. Appreciate it. The next person I have here is Alan grits. Mr. Sorry if I mispronounce your last name followed by Jerome Snell. How he in there wash day we know you are at work reaction to listen to us something at HST only has not doing his own savings today. It's only about Lehigh nhsd. There's no mention of Jerome. Thank you for being here. Mr. Smell something positive to say. Hey why I Feel very deeply with the folks that were just talking because I've been there myself. So I have a more positive story in the sense that I came here to percent some solutions to homelessness in Seattle. And I don't think this is the right time to do that because it's quite if you will so but I did want to say that Seattle when I first came here, I'm a little nervous is the first time I'm doing this, but you're going to see me a lot more great, but I first came here. I was homeless myself and somehow I came full circle. So I want to thank Seattle for giving me my life back. Okay, see how it was a great City and it played a big part in my recovery. Okay, so I know it can be done. I know it can be done. So I have some ideas. I like to present them to the account. So I don't have to inform at to leave them here, but I was thinking that we were going to do a answer and you know, like a solution can't find a thing, you know Finding Solutions. I guess you guys are busy with all the complaints. So if you could get back with me or whatever, I appreciate it. Thank you back up with you on thank you for sharing your personal story. And I think the goal of this Council are this committee is to help make sure that we can replicate that. I want to say what when will you get back with me? We will have someone follow up with you today before you leave about meeting with our office at the fight today. Was there anybody else who wanted to testify but didn't have a chance to sign up. Okay, seeing none that will close today is public comment. On behalf of the coach Eric's house members want and councilmember bag shall we want to thank the full Council for being here? Thank you, Number horrible customer consalus councilmember O'Brien council president Maryland council member was very very excited to see everybody in the room here today. We have an agenda at this time. Let's move forward with our first agenda item for today. If you could read into the record item number one, that would be great. And while she's doing that actually let's have the folks from hsd join us at the table and addition to Jeff Simmons from Central staff agenda item one Seattle Human Services Department benchmarks for a briefing and discussion. Excellent. Thank you. And anyone who was here for that first candles welcome to come to the table. It didn't mean to leave anybody out. Thank you for being here. And Jeff. If you want to start introductions to formally will go down the line here and then we'll start with our presentation. Are they working? Okay, then we might have it all muted. Your life Jason Johnson with the human services department Tiffany Washington Human Services Department the table. I just I understand you have some opening comments. I have a few as well if I might be able to go through mine and then and maybe you could see up the presentation. We're about to get so we all know that we are in the midst of a crisis a housing crisis, which is manifested itself in a homelessness crisis. Our friends. Our neighbors are family members all we have people who are sleeping on the streets unsheltered sleeping in shelters, which quite frankly still means people are homeless and we have not built the housing that we need to create exit strategies out of homelessness for about a year and we've been engaged in a conversation about needing to have a dashboard and a key indicators. I call it the the dashboard of key metrics that we'd like to share with the public and for ourselves so that we can hold ourselves accountable I've been asked. Are those four year I know are co-chairs. And the the full Council has been asking for this for longer as council members. We want to have the data to help explain to the public what we're doing and what we like to do more earlier this morning in council member Gonzalez actually use the words. We need to truth test reports. And this is part of our desire to make sure that we're truth testing reports to make sure that we have the number of the actual data in hand that tells the full picture of what we're doing what we're doing well and to hold ourselves accountable what we'd like to be doing better some of the things that you have been able to report on some of the things I think are still on our wish-list some of these things include the number of enhanced shelter beds open for a night on average in November during the budget discussions. We heard that there was only 3 enhanced shelter beds open per night on average last month. We heard that there was only eight and hands shelter beds open for a night on average. Would these kind of Statistics it is no wonder that people continue to sleep outside and not have an exit from homelessness or from 10th in to enhance shelter so that they don't have to get kicked. In the morning, I have to line up at night. We're interested in making sure that we understand how many people were contacted by the navigation team. And what the outcome was. Did they get in to enhance shelters or did they get into permanent housing and if not why we're interested in the percentage of navigation team contacts who were able to sex with the successfully stay sheltered and not cycle back into living unsheltered in our Street Winchester. The number of people who are bypassing shelters and getting straight into permanent housing Supportive Housing and other long-term options or just sit in the number of hygiene services and how we are scaling up our approach to make sure that people have access to reach those services and able to keep their job because they have access to hygiene services. More importantly. We're also interested in the number of people who avoided homelessness through the diversion program. We see and statistics time and time again, those numbers paint an important picture to show us who is not falling into homelessness and how we help to keep people in housing. One of the things that I think it has been really important in the conversations. We've had across the city as we're doing District tours. It's hearing from providers who are telling us in or doing this great work as we heard earlier today from some of the folks in Nickelsville, but some of the ways in which metrics are being captured we are not seeing reported yet. And if we had a magic wands and some of these new systems are being created this seems like a good opportunity for us to TF that conversation. We want to show the constituents. We want to show members of the media. We want to show our friends who are experiencing homelessness and the people who are writing in concerned about their neighbors who are experiencing homelessness what the city is doing to answer the question. How are we spending the dollars but more importantly what lives are we saving and how we helping to stabilize so Getting into housing. We think this information is critical to show that we're being transparent that we as the counselor taking this responsibility seriously and that we are as kasimir Gonzalez said again this morning to testing whether or not the reports are accurate without this type of data. We do not have the ability to push back and help explain what it is that we're doing and in many cases what we're doing well also in cases where we're relying on people getting into housing. We're not able to meet these metrics because we as a region, we as a city have not scaled up the tremendous amount of housing that we need the most recent report that I thought was that we need a hundred and fifty-six thousand fordable housing units to be created right here for us to be able to address the crisis of now let alone the crisis that's coming as more and more folks want to move to this great City to this information is critical and that's why we're asking for it with sincerity and hoping for honest answers as we Implement our our strategies to work in partnership with King County. This is one key component so that we have a Benchmark to understand how we are focusing on investments and where we'd like to also do a better job of improving the quality of our services. We need to be mindful that the data alone. The numbers alone percentages alone. Don't tell the full picture and the stories like the ones that we've heard this morning due till that full picture, but it for accurately measuring what are friends on the front line with folks will experience homelessness are telling us is the most critical things. I think we can paint a fuller picture and as we begin to integrate a new system with Kane County, I want to make sure that we have the folks at the table who had that lived experience to tell us what it means to have a data system that does not read traumatize people every time they're asked to fill out information A system that will give us a fuller picture of how we're tracking. Our investments are outcomes and are gaps. This is an effort for us to reclaim the responsibility to make sure that folks are not only getting into shelter but getting into housing and medical services and long-term treatment if needed. So why don't we go ahead and see if the conversation I understand from a conversation with folks that teaches D. But also with the mayor's office with Chief of Staff that there's many entities that are fine to work together on longer-term Solutions today. I feel like as a placeholder and we'll talk a little bit more about what some of those longer-term items are that you're working on with external Partners, cuz I have some questions about that as well for lack of having a new dashboard to share today. Let's talk about what we do have in Jeff happy to have UT this up and then we'll turn it over to interim director Johnson and the team as you noted earlier at Council briefing today. And just now the slides that will be looking at were presented to the human services at go to both development and renters rights committee on April 9th. And this will give us a chance to hear some more detail about some of those as well as going into some other areas. I just he has various performance pay metrics and has been doing some action around there and then also has been doing work to develop some At this with. They'll have a chance to go into as well as some other items as while I believe. Essentia okay. So again as I mentioned this morning comes Marissa want had had this presentation and her committee are just about 2 weeks ago. Is that correct last week? Yeah, 2 weeks 2 weeks ago and our intent was not to try to duplicate it. There was a number of things that I thought were really good in the 2018 results from HSV presentation, which the full report can be found on council members who wants website what we've done for today is just pulled out a select number of those slides of potentially we could walk through but I think the Hope was to have those two 2018 results for me to see some of the great indicators that you've included in your hsd blog we have some good metrics that you've included there. The quarter 1 navigation team report was submitted to us as well as some of the data from all home. So you don't director Johnson as you go through this don't feel like you have to repeat everything that knew I was also prevents is presented, but do feel like you have the leeway to say in this other report. We have this data. That's a really good indicator. We have this great report at the NAB team that we've been tracking in your ideal world if we had that magic wand and if we had a dashboard in front of us what Would add to these indicators that are not yet here. I hope that helps to see up your presentation. Great. Thank you. Appreciate being with you this morning as has been mentioned several times Tiffany and I were at committee table just two weeks ago presenting 2018 year and data that data is performance-based Ada. It is data that primarily looks at exits and it is that data that helps us understand whether or not the Investments that we're making in addressing homelessness are having the desired impact the high-level takeaways from that presentation where that in 2018 were able to serve more people more households in the last year than we were in 2017. That more household move from homelessness to permanent housing in 2018 versus 2017. We also saw that more households maintained their permanent housing due to permanent Supportive Housing efforts as well as prevention efforts When comparing 2018 and 2017 program by program. And again, we can sort of you know, use the slides again. If you have specific questions or the Highlight some of this but program by program we're seeing this reflected were especially seeing this reflected when we look at the performance of permanent Supportive Housing permanent Supportive Housing, as a reminder is housing that has a breadth of services available to individuals who experience chronic homelessness chronic Behavioral Health in chronic medical needs and these are services that are provided in building. So that individuals have the supports that they need to stay housed. We're also seeing great success and diversion diversion is both the act of being very creative with an individual and helping them explore what options they have available to them plus some one-time cash assistance to help move. Whatever that plan is forward. We're seeing that diversion can be very client-focused for a customer-centered because it is that person and their own creativity their own options that they design that are put into action. Sometimes that requires some cash assistance, but not every time does it sometimes it really is that creative thinking that that case management that's offered that can help someone avoid the emergency crisis response system. We also see saw incredible results in our enhanced shelters. So enhanced shelters different from basic shelters are shelters that are typically open for a 24-hour period of time. They have lower barriers to entry they have increased support such as case management and housing navigation. They also have things basic things that people need such as lockers hygiene Services. It is can be a space where couples can go together can be a space where individuals or couples can bring them bring their pets. So we're seeing that by enhancing in a shelter environment Itself by including services and reducing barriers that people are much more likely five times as likely to exit into permanent housing then in our basic shelter space. So many times when we talked to folks who are sleeping outside unsheltered perhaps in a tent or perhaps just in a sleeping bag. One of the biggest concerns that we hear about is that they can't go with their partner into these overnight shelters that they can't bring their serve their their dog or their pets that they are worried about their family being split up and many of us. I think I've been trying to work on additional dollars for enhance shelter so that people do truly have the shower the locker a place to call home partitions between beds a place that is truly their own. If not directly into more permanent Supportive Housing, but when we only have a handful of beds open per night, I think it helps paint the story of why folks might not be getting off at the street when that type of enhanced shelter option is not available. Do you have data on the number of an ant shelter beds open per night on average over either the last month or the last quarter that you could share with us? So the banks so our presentation two weeks ago really had a great emphasis on exits exits to permanent housing is the key performance metric that we pay attention to to understand if a program and really if our system is performing the way that we wanted to we have an expectation and we stated that expectation in 2018 contracts that more people be exited from homelessness into permanent housing. That's the that the expectation that we put into contracts. We wanted a a a permanent end to someone's episode of homelessness and we're seeing more households exit to permanent housing than ever before that said it's not the only indicator that we look at we look at in partnership with King County. We look at the average length that someone stays The program we look at whether or not people return to homelessness after using a program. We look at the entries from homelessness. That means it's someone quite literally living unsheltered when they use a resource and then we also look at utilization rates. So it's that metric or that data around utilization that helps us understand how many beds are available. So right now or I should say in 2018 utilization rates were very high. That means that people were using their search Services the resources that are available in this community basic shelters how to utilize ation rate of 94% enhanced shelters how to utilize Asian rate of 97% What that tells us is that with thousands of people living on sheltered in our community. There are not enough shelter and housing resources to meet the demand. There is not a roof overhead for every person utilization rates of the 2100 basic and enhanced shelters that hsd invests in on average is at 95.5% That means that there are a hundred beds available on any given night for the thousands of people who are living Outdoors. So to Echo your opening statement while we are are are proud of the results that our investments have had we see that programs are working to make real change for the people who are fortunate enough to be able to access them. There is also a gap in between what is available and what's needed. No council member banks have a question. I just want to do a quick follow-up. So 97% utilization rates is another way to say that you have 97% capacity filled at any children's do you have a number of beds open on average a night in our enhanced shelter Beds, which means showers don't have to get kicked out in the morning don't have to line up at night can come with your partner and all of the things that I think are barriers to people either accepting help or feeling distrust of the system when that creates greater instability for them if they're being asked to leave it at I know that in November. I think the number that would be November. The number was three as a follow-up to a budget briefing. We got that in writing from an email and then last month. Thank you for volume of my question about how many people were able sorry how many beds were vacant and enhance Health, isn't it only sounded like 8, so if you take 8 and just suppose that was over 4,500 people in the region being unsheltered. I think it helps you to understand that this severe lack of access the shelters that we currently have and you were doing math. I was going to miss you to lose a shin rate of 97% over the total number of enhance beds that exist which is 1411 at leaves roughly 40 beds available on any given night in the enhanced shelter bed system. So more than 8 but still not nearly the number to match the need part of the reason why I think a dashboard Incredibly important because to go from 3 beds and November 2-8 beds last month and then have a number calculated in the moment that gets us to 40 and makes me a little bit nervous that we're not actually calculating vacancies on average a night. That's very helpful math to have us that have understanding even 40 compared to 4045 hundred people is not nearly enough, but I think having that exact number would be helpful. Someone ask you guys if you can follow up with us on that account from of action and councilmember O'Brien. Thanks for the work that you're doing. I know this is tough. I know today is a tough day in particular want to acknowledge that he was just talking about is that Continuum and we've been talking about this for a really long time and then acknowledge the fact that Getting being able to move people on and up into a different place in their lives is really important providing them the support. We're also seeing and hearing and the constant drumbeat of if people don't have a place for tonight before they can be settled in not just in and then leaving in the morning, you know as we've talked about all the time. Do you have thoughts now with your department on how we can increase those numbers of places that people can go 24/7 and I know that council member of a skater went to Los Angeles as an example looked at some of the options whether it's the big tent whether it's worth finding some buildings that we can get people into to expand this 24/7. We know that if we're going to have this whole Continuum that's working. We simply have to have more places to get people off the streets before they can stay and feel good about being there and this is working as part of the regional system. So are there some hints Some things going on that we haven't talked about. I mean for the last 10 years that I've been here. I know we're making progress. But regionally, we need to be expanding these these numbers. And once again, we're at the intersection of more permanent places to be the Criminal Justice Reform and the mental health behavioral health. So what did the hints for us to be able to move these numbers and work with our municourt is an example so that they've got places they can refer people to 2 / a thank you, very good. But very complex question. I know over the last year in 2018. We nearly doubled the number of enhanced shelter beds that we had the previous year in 2017. So that is you know that comes with a cost shelter enhancements are more expensive keeping a facility open for a 24-hour period of time is more expensive so that doubling effort cost almost 6 million dollars. So it didn't eat no enhancing the services that are available enhancing the length of time that people can stay indoors offering the ability for people to store their belongings. It does cost. It does have a very real cost to it. But with these limited resources, like I said, we've been able to double the number of enhanced bedstead that we have in our system likewise under mayor Jerkins. Bishop we've been able to open more new shelter beds than any other point in history. We had an increase in shelter bad to 25% Their mix of basic and enhanced so we need an example. Most of them are enhanced beds. But some example of expansion that is a curd for basic overnight only happened right here in this building. So there's no overnight shelter run by the Salvation Army here at City Hall and we expanded that efforts last year. So that's an example of the basic bad spot majority nearly 75% of that expansion were enhanced beds. We also have increased our programs that we know were so we doubled down on diversion. We wanted to make sure that there was more client assistance available so that people could be diverted from the system and not languish in it. We also did more diversion training training of Outreach workers out of our navigation team so that there is assurance that those people walking the streets engaging with folks were living unsheltered. Have the skills necessary to have a diversion conversation with individuals that they're engaged with. We we've talked about in hands shelter, but I should mention that we're also an enhancing the services at the at the villages those were stood up with some barebone services and now have a case management and some other services in place so that they essentially operate very similar to and enhance shelter model. We also want to acknowledge that you know why we've been laser focused on exits and that is an important metric to define success of the Investments were making there is also debate about whether that is the right metric to pay attention to Future Labs now and I asked at the Jones report it's referred to by many names but they have offered that you know, focusing on returns to homelessness really helps us understand if the interventions that are in play are having a meaning of meaningful result meaning that they are are permanently putting someone's episode of homelessness. Too and I think likewise this idea of consolidation. We are seeing that as we work more closely with our partners at the county whether we're talking about data or programming that there is always we're always better off. We don't it's very rare that we fund 4 program in isolation most of the time we are making an investment in a program in partnership with the county. And so this idea of consolidation that's been discussed for many months and we'll get an update later today on We Believe will also have a I have an impact in a Runza council member O'Brien and councilmember herbold quick if you have information now or in the future, my understanding is some of the shelters will give Dog sitting there like a first right to return and I imagine on a given night. Some of those folks don't show up. And so I'm curious in our accounting of how many beds are available if if a bat is vacant that night but it wasn't available to anyone else because they didn't come back or maybe it became available at 10 or some late time be when they open it up to someone else how does nuances fit into the accounting so we have shelters report in the morning. The number of beds they had open the night before so that the navigation team has those beds because you're talking about the discrepancy of like it's 10:00 at night and someone didn't return. It's pretty hard to then go out and try to figure out how to fill it. And so those opening communicated to the knob team the following morning. I would also just add that there are efforts such as operation nightwatch that has an informal sort of coordination with shelter providers. So they are aware even as late as 10 p.m. Of you know, if someone no showed there's a bed available. There are you know, great efforts to help provide transportation so that people can get from a full shelter to a shelter where there's an available bed and the providers. I think you are really excellent job of coordinating with each other to make sure all beds are full. Councilmember herbel, thank you. I was just wondering if you could speak a little bit to whether or not in your observation. There is something that is fundamental about the city of permanent Villages that contributes to the high rate of exit stuperman housing. It looks like it's about 33% in 2018. And where as we loved enhance shelters. It is a higher rate of exit then enhance shelters and the investment necessary to to stand up permanent Villages is a different level of investment than necessary to build and operate a enhance shelter. Yeah, I would agree that some of the upfront costs are a lot lower for standing up encampments versus a brick-and-mortar shelter some of the ongoing service Provisions. The costs are are are very similar and I credit the you know exit rates. And this is an impressive change in the exit rate that we saw in 2018 to the enhancements that were offered to the services that were offered and those in those permitted Villages these other services like a very A good Professional Case Management that focuses first on housing there is a conversation with each individual staying at The Villages about making a plan to exit that Village and enter into housing. This is happening across the board but in villages sometimes there is a smaller on population size not always but that helps we are learning a lot especially from our friends at the Catholic community services about how case management client ratio can be a either a benefit or a barrier to having success with clients. And so I would say, you know that it's it's very clear by the data that the enhancements that we've made in the tiny Villages. Are are are why those programs are seeing success? People that looking at the number of people served. So the rate is really important to understand the cost per so if you look at City permanent villages in 2018, it serves 658 people enhanced emergency shelter in 2018 served 6554. So we're doing an analysis right now internally that looks at the cost per hour for an ant shelter versus the cost per hour for tiny villages to find out to just get into some of the nuances so we don't Have data that isn't solidly able to be backed up. In fact as a follow-up. So even though the city permitted Villages now provide many of the same types of services that the enhanced shelters provide you're speculating that the difference might be that they're supposed to In Case Management Services. I assume they're both similar quality Case Management Services. So you're speculating the difference might have to do with the case loads. Yeah, if you look at the number of people served, I mean there's a bit of scale. So I know we're not comparing Apples to Apples, but the enhanced shelters are serving a much larger population than our tiny Villages. So there are many people who are using those enhance shelters in exactly the way that shelter was designed they're coming in and they're staying for a short while they're getting their need mat while they are addressing some kind of crisis in their life and then they move on and so we are seeing through a different different same population but a a different usage of the tiny Villages, then we are some of the enhanced shelters I would also say it's you know, I have some curiosity just about the space as well. Tiny Villages. They have sort of you know you have Own individual space forces are enhanced shelter still are a congregate model for the most part and while we do everything in the design phase to make sure that groups of people are congregating in as few in numbers as possible. There still are enhanced shelters were people larger numbers of people are sleeping in a single room together. So I just I have some some curiosity about that and whether or not that has an impact on the results were seen or not. Thank you very much for this presentation. There's a few things that sort of caught my my my eye as we talked about the wish list for Mattress going forward as we create our dashboard and he would be helpful to know how many folks out there. I'm have access to case managers how many of them are able to keep that same case manager as you remember one of the biggest issues that I worked on in last year's Budget on things to this Council for supporting it. Was to make sure that we had more dollars going into the very case managers who can help stabilize Hooks and get them into housing or into the services that they need but due to the high turnover rates and vacancy rates. We know that's a lot of the case managers are turning over. So if there's a way to track is consistency with case manager, that would be helpful. And then I think I'm summer horrible than you have just ended on a really important point to what is the caseload for those case managers. There is a few things are on the horizon if we could take just one more minute to talk about that. There are the homeless data model T made up of you. Of information School Capstone program Amazon Tableau. Nhsd. There's a navigation app 2.0 team, which have Microsoft hsd Seattle itsp you and the fire department. I think we would be very interested in getting a full briefing on what those programs are research efforts are and again, I'll reiterate that. I think there's a number of folks that are concerned about the voice is missing from those teams. As you think about who is at the table to create the very metrics that we need to make sure that we're tracking what success actually looks like this leads into our second panel which will talk about, you know, if we had a wish list of measuring what we were doing well in community and what were you not getting credit for yet as you think about this new system on the horizon pulling in some of those voices and ideas I think will be helpful. Was that a hand down there at all that I saw I know okay stretching any other comments. I have one and it's just that in addition to the efforts that you just mentioned. I wanted to share that there is also an effort regionally to update and really recreate redesign the dashboards that are on all home King County County's website. So that's an effort that will be launched in early May and will be able to share that new dashboard with you. I'm looking forward to this new dashboard because it's the first time that will really have good. Information that shows the inflow vs. Outflow. We started today's conversation talking a little bit about inflow and outflow, but this will offer us insight into our Region's effort to address a steady stream of unfortunate people who are experiencing homelessness and will give us a really good idea of of our systems ability to keep up. I also wanted to share that there will also be an effort inside of a chesty to do a better job of visualizing the data that we collect we collect a lot of data and a lot of that data can just be sort of Widgets or counting doing sort of head counts about how many people were serving how many hours of case management were provided that kind of thing if we're collecting that data we need to be able to use it and help you and the general public understand it. So we'll be working here in 2019 to 2. Are visualized in better tell the full story of the services that are provided with Investments to come through the department. And what's the timeline on that tractor? Yeah, you know, we're at a critical development phase. So I think that a lot of this weather it was the item that you mentioned or the efforts that are under way that I mentioned to be rolled out this in early summer. I'm so I mentioned all home dashboard and those changes I will be rolled out in early May some of the efforts that we're working in partnership with the mayor's office and I see aren't you out June June July we're working in partnership with the Innovation and performance team to update those dashboards related to the sub cabinets including the sub cabinet on homelessness. And that's where a lot of our data is going to show up and that you should be able to be rolled out with Q to data. So we're really looking at a lot of this new visual visualization. Data being available to us this summer. So I appreciate the visualization. That's one of the biggest things that I've been asking for and I do appreciate the work you're doing however instead of waiting until for the three months until July. I'm hoping that we can work with you for like an interim placeholder report. Would that might summarize some of these key pieces that you've heard from us from today? I would be remiss if we didn't also say and I'm visualizing the number of hygiene services that we need. The United Nations says that there should be at least one toilet for every 20 people and by that standard Seattle needs 224 toilets around the city and we currently have six according to the auditor's report. This is a crisis. I think not only for those who are unfortunately unsheltered and living outside but also for a general public at this is a huge ass that I think from a public health perspective and Community engagement social cohesion wanting people to go outside and utilize our parks and services. So, this is something I'm really concerned. Then I would love for us to work with this from the urgency perspective for those especially those who are living outside council member Juarez. You had your hand up. I will be very very brief. First of all Jason. Thank you for all the hard work you've done. I really appreciate we've been watching this unravel at least for me over three years now and we're still working on this Tiffany. Thank you. You've been so accessible even greater even returning our calls giving us information. I really appreciate your hard work. I also want to thank Jackie St. Louis is here. We met with Jackie last week up at the district office and had more of an on-the-ground what's going on with the navigation team? You don't we were kind of throwing up when I'm looking at the information you gave us in the nine categories in your in the homeless results by program. I know we're throwing the trim around dashboard in another life dashboard meant something else when I used to work on Wall Street, is that correct? Not in real time as in real time, they'll just always be two or three three four month lag. Just by the nature of collection is that correct in front of you? There is really a performance-based. It's based on the contracts the Investments that we're making and there will always be a delay and in capturing that level of performance data that said the I think it was mentioned that app 2.0. That's an attempt to have more real-time data so that Outreach workers in the field have access to what's available now, so we are both wanting to continue to have a performance conversation. We want to understand the performance of our investments but we're trying to use data to enhance service provision as well. And that will rely heavily on access to real-time Jada Just One Last quick note. We've had this conversation before and I want to thank you and your department for being so flexible for those smaller community-based organizations that provide do all of these things that you talk about prevention emergency shelter particularly diversion transition. That Art by nature and their mission statement homeless organizations. They're smaller than a lot of them are going to be able to plug into the hmis cuz they're just not going to have the staff internally. They're not going to have the kind of human capital infrastructure. So I'm so I'm hoping at some point we can have maybe a separate model. So those cuz I know just in my district, there's probably 5 where they can at least be reporting monthly and are least to us and real time cuz I know what you've captured hear the big organizations and I just want to make sure that we capture the smaller ones cuz those are the ones that are actually know the people on the streets. It takes two or three times to get them into shelter even though in their mission statement like a good example is North helpline or God's Little acre or Aurora common, their mission statement isn't to shelter the unsheltered but that is one of the things that they do and so I'm just want to make sure that we we capture them. That's all. Thank you. Thank you very much for watching him. Mr. Johnson for being here and you know that we ended with District 5 I would also say as we look at this disease indicators looking forward to having a better sense of the geographic distribution will be very helpful. For example, there's no shower in District 5 if I remember correctly. Thank you very much. You're welcome to stay if you'd like as well. But thank you for being here at the second panel is our Community Partners panel. And if we could please be joined at the table by Mike Cox the executive director of family Works Shannon real Solid Ground representative and Lisa daugaard from the defenders public defender's Association, Mike. Did I may have said your favorite? Hello and thank you for being here. Thank you all for joining us today. And anybody else who you have is your guests are welcome to bring up as well. We will give you guys about 20 minutes and we wanted to have a chance to talk with you as we see if this conversation about What key indicators you think would be helpful to track the work that your organization is doing but more importantly to track the success or the areas where we need to read invest or double down our investments as we move forward and there's a lot of really great work that many of our organizations do and we get Focus sometimes on Counting widgets. I'm counting numbers and percentages and you may have a better indication from your work. What would be better indicators of how you're helping folks either prevent from falling into homelessness or help getting stabilized and and out of homelessness. So is that why don't we start on this end of the table? And we'll just have you introduce yourselves all together and then we'll start on this end of the table and you and you'll start the tea at the presentation Jake Webber executive director family works. Thank you and my I'm just a pretty much up here though a great manager at Family works. And I'm Shannon Ray representing Solid Ground. Thank you for the public defender Association. Wonderful. So thanks again for being here directly from you as you do your work on a daily basis and engage with families with individuals with folks who are trying to find housing. What are some of the key indicators or metrics that you think would be helpful for a city council to have in mind as we think about gauging success, but also gauging where we've got gas and services and where we could be doing better and we'll start with family works. I wanted to start with how to measure prevention because as a family resource center and a food bank, we've always been a lot of importance and of course providing nutritious food, but also ways that we could help people get become more resilient and stable and we do a lot of survey of our our folks because we feel the progress we do needs to be in response to a people need and want so we've gotten some of that over the time but it's not something we it's fairly difficult to measure prevention. So we we don't know exactly that outcome of how many people have been prevented but we do during data on what people need and feel they want that help them in being able to stabilize our family with with financial cost usually and then what are the barriers For us that would be really important for us to have that information and we appreciate the funding for the kitty connectors of the food banks cuz they definitely help provide access to folks and many many aspects as well as family advocates to the Family Resource Center. I just follow up on what Jake has said family works because of the fact that we share building with Solid Ground. We also have a branch of the Seattle Public Library there in Wallingford kind of become an informal day Center for lot of people who are homeless in the area and I would say the biggest hurdles that we are seeing for those populations that are using us 8 9 hours a day is just a place to sit are mental health issues and addiction issues, which we are dealing with and we're not really Well suited to deal with them, but we are dealing with on a daily basis. And that's why things like Community connector's who can be there 8 hours a day a program that was piloted with food banks last year and we have applied for a commission after neck back. We're going to be asking to share one with North helpline at their liquor Springs location. So it'd be working Wallingford are Greenwood food bank, which we opened up three years ago in response to boa closing their Greenwood food bank. And with the Lipton Springs location north helpline SoDo is a resource that would actually be very valuable to us and to the people to come to us and needs a service has the other thing we do is just helped to build that resiliency things like finding ways to get rent assistance for people who are in their home, so they don't start to enter the homeless cycle. Ways of breaking that cycle of homelessness with people who are in in a shelter Place weather is so wrong or an s h a u funded housing or and to prevent them from breaking out of that. What are the reasons people are no longer staying in housing shelters. I know we deal with a lot of people who are at the fringes who for one reason other can't enter a shopper. Usually it's because they have a partner that can't be in the shop for with them or they have a pet who is incredibly important them off and they're only needs the support and comfort and not cats not allowed to a shelter. So they let them stay on the seat streets. And those are the people that we see coming to his day after day that are sitting in her hallway who really need that help but for one reason or another are being turned away or don't feel during a perfect candidate for the help and I'm glad That's something that we are very dedicated to it Solid Ground and I was looking at the data from all home and showing the critical need for increased funds for prevention overall. Well, there are other strategies like rapid rehousing and diversion that are also important. I think we are missing the boat some by not focusing more on prevention one example of that is all home data shows that the progress toward functional zero is not really matching because the inflow is Projected to be similar to the outflow. And as long as that inflow keeps happening. We are not going to get anywhere with these strategies that we have one of the other things when you mention metrics in the importance, I think measuring progress not only permanent housing and I don't know exactly what that would look like. But I think that that can be important when it sample. Is our rapid re-housing program. It only counts as a successful exit if they accept a permanent housing but some families decide to move in with others some families decide to go to transitional housing because I think that's what's going to be best for them and those count as unsuccessful despite it being successful to the family themselves. So I think looking at a broader range of success pictures is really important and the other thing I'll say is when we look at returns to homelessness. I think it's an important metric to look at but we also have to keep in mind that it is an inaccurate number because it is only include People that are coming back into homelessness that then go into another program. It is not just folks that return to the street and if they're not actually accessing other services, they don't show up if they're D identified. They don't show up a lot of our folks that we moved in Rapid rehousing into version of moving out of County or South King County or Snohomish and we don't share a database with Snohomish or Pierce County or Thurston County. So we're not capturing all the returns to homelessness and I think that's important to take a look at when we used to version funds. They're wonderful for a lot of folks and we're we're getting a lot of folks that have been to Diversion that are now trying to access Prevention Services. So it's they're not really able to sustain it and one reasons going back to that case manager equation diversion does not have ongoing case management and and we need some support for that. So I really think that those are some of the critical factors with that. I do want to also say I'm very great. For the shifts that have happened and the open dialog with coordinated entry for all to make a access more accessible and and to realize that not everybody fits into every single model. I think we really need more permanent Supportive Housing. I'm in there when we look at transitional housing and the exit to permanent housing. There's a big gap in our system that we do not have funds flexible funds available for those and transitional housing to move into permanent housing. So are transitional programs may do all the work to stabilize folks and then there are no funds to access. They're not eligible for diversion. They're not eligible eligible for prevention. They're not eligible to be a part of the coordinated entry for all system. And that's a big gap in our system. If we had more folks that could move from transitional housing. We have more openings in transitional housing for those that dude need greater case management support. So those are my thoughts for now. Good morning, or good afternoon. Can't quite tell I think I'm here representing the service providers that work particularly with people who frequently have justice system involvement. So it's important population currently under a great deal of discussion in terms of local public policy and some preparation is a I also spoke with some of the other providers key providers who work intentionally with this population including those that we partner with in the law enforcement assisted diversion program. We appreciate this chance to comment on way is that data collection and use could be refined modified or expanded to better drive forward effective work with this population want to start by saying that everybody I talked to flag that accountability is important and not something that service providers that affect your providers are. Iowa from and at the same time be incredibly helpful if data collection targets and measures were crafted after involvement in discussion with those providers. So that tools can be informed by some of the considerations that thoughtful providers can share I'll go through backwards and Andres what I think she is the most important when I want to I want to raise some of those that I spoke with flagged the important General point that the focus on exits to housing assume that those exits are a function of the methodology being used and effective case management in that really misses how much the outcome is a product of availability and prioritization of that housing stock to particular populations one provider noted that the program that last served the person prior to the person going in. Housing is the one that counts that is a success even if the bulk of the work that was done to effectively achieve that was done by a fire provider. So including signing somebody up doing screening and so on that actually culminates in the successful exit. I think this is an important point that Financial incentives and contracts to do Harden important work should be true incentives rather than penalties. This really was one of the important National realizations in one Child Left Behind that taking money away from an institution that struggling to do hard work is generally not the best way to improve their ability to do that work. And so and that is the correct. Although that the takeaway is less than it initially was is currently time to play to be less than was initially contemplated for failure to reach successful access to housing targets. It's still using kind of the flip side of an incentive structure which gets me to the most important point that I wanted to raise Felicia. Can I excuse me for interrupting there a little bit more about that last sentence when you said that money is being taken away and we understand that that has an impact on Organization but in a world where we have finite budget and are not able to just create more money without raising more revenues. How do we do that? Effectively? What would be your recommendation? Great question and leading leading me into I think the court appoint which is said when this Council or your predecessors passed the results based accountability ordinance back in 2017 ordinance 125474. The fact that outcomes numerical outcomes would be affected by the barriers faced by the populations that service providers were working with was called out and recognized in the recitals and that ordinance. Unfortunately, it isn't actually embedded in the portion of the ordinance that is codified in the municipal code. And I would really urge that you perhaps go back and take a look at that. There is three recitals that are 42 an important one technology that the effects of policies for example No, Child Left Behind and other examples of performance-based funding in public education can without UCare create unintended consequences while achieving confirmed it Conformity with identified finding criteria that actually decrease the quality and effectiveness of the work performed. So there are inside and some things are being measured but the actual outcomes are not being improved because of failure to appropriately incentivize what you actually went then a finding that the mayor and the council recognize that some of the problems that most urgently to me and Human Services Solutions involve working with populations that experience systemic and structural marginalization and require more resources per person to accomplish program goals, and then finally finding that programs working effectively to address systemic and structural barriers must not be burdened or discouraged by results phase Contracting. So that's what you said in 2017, but I think the way this has played out with probably, you know All Good Intentions by many putting this in place for the first time. Is that there Are actually incentives for service providers to run away from the most difficult folks out. There. They are the people who have been on KOMO. They are the people who are in the prolific offenders report. They are the people we work with and if I work this is not to work my office directly does B project manage lead and I was sitting instead of one step away from that the Lima for a provider if you take on some of those individuals who are incredibly hard to place they have criminal history barriers, they have behavioral barriers and they don't score high on the vulnerability index that's presently used through all home and coordinated entry if they step forward and choose to work with that person. It is to their detriment their Contracting detriment and their resource detriment. We should flip that on its head and call out that providers who will Embrace and do the very best that we can and know how to do with that population. Receive Contracting consideration, right? That's so there's a Nuance in the outcomes. If you achieve housing exits for that population, that is an incredible achievement that cannot be fully captured by the number of human beings. The impact on community is huge and I will animal at that point just by commenting that fire poppy is report in 2016 specifically identified the importance of the saying that we need to prioritize housing resources for people who faced greatest barriers and have been out there the longest and that's not what the current and not based on who scored highest on the vulnerability index and we have not taken that step in as a result providers to work with those hardest to place people are being disincentivize to do the very most important work in terms of Community Health and what the business Community is rightly calling for last comment about Outreach contracts different than the shelter contacts. currently that Outreach contact performances sole judge to in terms of shelter referrals made and that to two issues with that now that that's not an important question but shelter placements are prioritized to the navigation team increasingly there is talking neighborhoods and with business associations about a different model of Outreach that's more accountable to the neighborhood that if that is a city goes in that direction, which I think everybody thinks it would be very promising but those teams don't have equal preference for for shelter placements than they are not going to score as well that is not a product of their methodology but simply of how those slots are prioritized in the second point is for outreach teams working with people in living in vehicles those individuals and we all are aware are much less likely to go to shelter, but they can Go to housing that is generally the most effective strategy and if an outreach program is only ask for that. They're making a shelter referral. They're not being asked most important question about their work with that population living in vehicles, which is really about a housing placement strategy. Thank you so much. Thank you very much. Thank you to our entire panel. We have a few moments for questions question something over her bone. I was just wondering if we could get the recommendations of the panel and writing make it easier for us to follow up on them. Thank you from two words in community recently that you've also been asked to do additional reports year after year, so we know that this is another layer you being here following up with us would really appreciate it. I really do think that you can help us better form a more responsive and accountable system going forward. So just want to say, thank you. Jamis Coda and I need to leave in 2 minutes. I wanted to ask two questions. I want a bunch of all thank you very much in this is extremely insightful. And I think obviously bottom line is to fight to create more revenues to deal with escalating care of the problem by providing really important inside and it's not something that be here every day. So I really wanted to let go outside in times of having clear information not just numbers and Asian but inviting the big news I two questions one is do do other cities have like New York, for example, do they have different do they have a different way of setting up the ballad of bloody index in in a way that catches them. You're the problem in a much more effective way or or or not. I mean just curious and then I thought you were points were extremely useful and I just had it. Orscheln Museum Disney, like basic questions at all from you don't have answers to these questions, which is one is you said that BNP to homelessness the numbers we have are quite inadequate. I'm paraphrasing but I think that's what you implied because it only looks at people who access Services after re-entry into homelessness. Also wondering if do we have some insight into How likely or unlikely as likely are people less likely to access Services if there are the become homeless again and in general, what is the likelihood that people will seek Services when they become homeless, what do you know? Because otherwise we don't really have a handle on what the homelessness problem is. Actually a question about the tool tornado retriever all and subsets. I work group are working on redesigning the assessment tool and I'll home is given their go ahead to to proceed with. Exploration. There are the communities that use the tool itself and score different language we started to do and there are other communities that use different tools. So where there is a committee that is looking into that and working with that especially in relation to the disparities that happen with people of color with the vi spdat. So it's a it's a work-in-progress. In the meantime. They've been scoring it a little differently trying to capture that vulnerability better and I don't have any information on how that's working. I'm not an intimate partner of that group in response to your second question. I think that there are a number of factors that go into that. I don't have an idea of course how many people don't access services and I don't think that I don't think there's really a way to capture those that are hesitant to or what their reasons are for not re-engaging and Services. I do know that. Folks that enter the system to be eligible for the services for the housing opportunities. There are do you have to go through the assessment. And if they're not scoring as vulnerable, they may not be given a resource that they're not given the resources not going to show up as homeless again, am I understanding and so I would think that the majority of folks would try at least to get into shelter. But again as we've heard there's a lot of folks that don't access shelter for a lot of reasons and so they may not show back up. I think the the bigger thing for me and when I don't see your way around is the Hooksett Rd identified usually that's for safety reasons, and I don't want them to not be able to be D identified for their safety as giving domestic violence and things like that and then the others that move out of County and may we enroll in a Homa system in another County or another state and those we don't have a way of capturing at least if we could bring the Three Counties. Weather in some fashion and share that return rate to homelessness. I think that might be a help. I'm sure it would also involve a lot of coordination and energy and work and money. So I think that when we're looking at return rate to homelessness, we just have to and this is acknowledged generally in this in this world dead. We're not really capturing everybody that's returning to homelessness and to know that and that's one of our performance standards that we have to meet. We have to keep it under a certain percent. So there's a part of me of course that wants to not go there but I think if we're going to really seriously address this problem we have to know but if we're going to be penalized for it just says if somebody exits the transitional housing, I think we need to look at that penalty. Going to have that in addition to that great point, you know that our friends at all home doing coordinated entry have long been those of us who work with digestive system involves population. Go and say you need to flip your prioritization in the interest of public order of Public Safety and kind of Civic base of support for this work because you're leaving the people out there who caused the most problems for the most people and it causes this lack of legitimacy for this whole Endeavor, right and their response. Their response back is always that problem goes away if we have increased housing availability and that is true, right the prioritization tool is not as big of a problem. If you go deep on the west the previous problem is a blend of the fact that how are prioritizing people and the extreme scarcity. So I'm not certain like a a different conversation is how the new prioritization should happen. I think this conversation is about data and incentives for service providers and what we are encouraging people to do and discouraging people to do through these Contracting incentives and there are sort of if we just accept the current reality swim Supply and even current prioritization. You can still deal with that by changing the Contracting approached by valuing the the hardest work for the work with the greatest resistance or the greatest barriers again as he said in 2016 accident, I want to thank our esteemed panel for being here with us today. I know you have even more ideas that I heard from you while we were visiting a in community. So we will follow up with you would be ideal I think would be to have some sort of Round Table discussion as we see more of the the blueprint come forward so you have your chance but your fingerprints on it. I will also say I saw a markdowns nodding. I'm in response to council member who wants question about what New York does and we'll look for deployment information out on the last panel in response to a council member. So once question question around, you know, how do we design our contracts that those who are the hardest to serve have an incentive Wheels have examples from the healthcare World in which we have tried to incentivize especially Medicaid I contractors to serve those who are the hardest to reach so we can pull from that and your scarcity question that I think all of you have touched on is not going unnoticed. We absolutely agree you cannot be measured on number of cases diverted number of people exiting housing exiting homelessness number of people going to permanent housing and number people staying in housing without housing. So we will continue to address the housing crisis and the lack of affordable housing throughout the city. I'm so that you are not held to a standard that is impossible to accomplish when we haven't yet provided you with that housing. Thank you very much for joining. And with that we will go to agenda item. Number two for our Council colleagues knowledge. We started at about 11. I'm sorry 10:50. I will keep us within that two hour time frame and we'll do 15 minutes for each of the next two presentation. And I just item number two, please. Thank you. Agenda item number to winter weather event storm response 2019 for briefing a discussion. Thank you and welcome back to the table in from director Jason Johnson Jackie St. Louis and Jill Watson from the human services department and anybody else that I have failed introduced you can introduce yourself by way of reminder. This is a request that came forward from many of us on Council in the wake of the twins in in the wake of the of the February 2019 freeze the Seattle freeze that we had where we had over a week and a half of brilliant any snow storms unlike any of that. We've really seen in recent history and many of us were very interested in the response from hsd Department of transportation's Park Seattle City Light Seattle Police Department to make sure that we were all acting and coordination. We saw a Doctor Johnson you and a number of other directors. I think president almost daily briefings during the time on what we were doing and how we were doing a given The global warming situation we find ourselves in given the extreme weather that we find ourselves in we know that there will be additional Smokey Summers and freezing Winters and part of our response needs to be able to make sure that we're providing a safe place for people to either be indoors for Clean Air Act during Smokey Summers or indoors for warm air during cold Winters and this is not an is a situation that we expect to go away anytime soon. So we're hoping to learn from what you experienced this last year Focus specifically on the snow storm, but also recognizing that we have lessons learned for the future. How many folks are we able to get inside? How many folks to the navigation team talked with what were some of the barriers if any that came up who helped them where they folks from reach where they fell from that scene where they fix excetera and looking forward to hearing how we been helped use that as a touchpoint to keep folks in Services. If they hadn't asked us in the first for the first time they were coming into our doors how we stayed in partnership with them. What are we go ahead and from Jeff on down if you can introduce yourself for the record and then let you guys take it away germs scanner before introductions begin may make a suggestion just want to acknowledge that our director of office of emergency management bar graph who's sitting in Chambers now also plays a really critical important role to the coordination of her around the conversation that we are about to have and it sort of it is incumbent upon her to make sure that all of these things are actually functioning and coordinated. So if if there is no objection and director at graph is a amenable to it. I'd like to invite her to join the rest of the present presenters at the table this morning be most welcome. Please come to the table and join us and you're just in time for introductions. Just send the council Central staff Christopher Williams, Seattle Parks and Recreation Johnson Human Services Department office of emergency management. Thank you for joining us for the presentation in the order that you like. Thank you. So I'll go ahead and get it started and hearing that this is now a 15-minute item. I'm going to try and maybe move us through it by cutting some of the contact standing and sort of early introduction and instead just going right to the storm. I do want to highlight two. However, Joe Watson and her important role in the department. The Department's role is critical when any kind of emergency occur, and we leaned heavily on Jill and her expertise and her ongoing coordination to help us. Is it Department do the work that's needed when there is an event. So I'm a bike by cutting sort of the contacts that don't want to underscore or under value that that work and we'd be happy to come to another committee meeting and talked about each SDS 3rd of March Global role in emergency management and how we help a very vulnerable population during moments of crisis in our city. Okay. I also going to slide three I believe. Thank you one back. I want to acknowledge that while Parks HST and the office of emergency management are at the table today. This could not have happened without a multiple multiple multi departmental effort as well as the involvement of several service providers volunteers organizations. Like United Way several different partners on many are listed here many are not on this slide. So this was an effort during February that took all hands. It required us working collaboratively in coordination with one another and the Department's roll. Really to help an Outreach and Sheltering was one of just a few critical roles that this city really operated as one team to I've to really address the needs of the community. Just some some really quick examples. We had a shelter that was willing and able to stay open for a 24-hour period of time. This is normally a shelter that's only open overnight, but they needed the sidewalks clear. They needed a very steep hill where supplies could be delivered. I cleared and it was a staff from FAS who picked up shovels and went to clear that space. And so that's just one relatively small example, but I think an important example that illustrates that level of coordination that was happening on a daily basis to make sure that the services that we needed to make be offered in the community where they are for the people. I need it the next slide shows a quick timeline. This was a snow event. Like no other it snows every year in Seattle that gets cold every year in Seattle. We activate emergency shelter every year. Typically, this is a 1 2 3 Day event where we work in partnership with the Salvation Army in Seattle Center to get overnight shelters open during a relatively short. Of cold dangerous weather, but this was an event that went for several several several weeks and acquired a consistent collaboration by the department with mini service providers. During that. I think and immediately upon knowing that the snow is not just coming but going to be quite heavy and that was going to be one of three bands of snow that were coming to the area if he came immediately evident to us that we needed our Outreach team navigation team to be out on the street and really engaging with as many people as possible to let them know that the snow is coming Game of Thrones fan winter was coming winter was here and that we needed to get people indoors and Jackie st. Louis was a critical partner working literally 24-hour shifts in those early days to help coordinate with his team to make sure that resources were known to those living unsheltered and that Services were provided to connect those. Most vulnerable during the snowstorm to those services and so I'll pass it over to Jackie to just talk about what that body of work look like. Thank you. Jason. ISO from the moment that the storm we knew that there was going to be a bit weather on the navigation team realize the importance of supporting people living outside who had no other means of caring for themselves given the amount of snow that people were living in tents that could potentially collapse due to the weight of the the Dead Snow on top of them. We prioritize getting people move from IVs and Cabinets and Doors, police officers, the navigation team officers on field coordinators and also stopped from the parks apartment to work with us around the clock out in the cat men's during the day and evenings at night Connecting People connecting with people and transporting them on to enhance shelter options as well as some traditional show options. So the shelter options as we discussed it, the previous presentation are limited especially during this weather. They were more shelters even those overnight shelters that were aiming to be open for a 24-hour period of time. So the people didn't have to venture out into dangerous conditions during the day. I'm so it was imperative. It was it was critically important for us to not only have the shelter open at the Seattle Center in the exhibition Hall, but that shelter quickly surpassed capacity, and it was immediately evident that we needed to open more shelter that we needed more shelter capacity more 24-hour shelter capacity. If we were going to continue to ask that people move in yours, this was achieved and and my huge thanks to Parks who you're here from and just a moment for opening the doors of Garfield Community Center in Lake Community Center, not only opening the doors but staff in those those shelters being there 24/7 preparing meals. I'm doing really whatever was needed to make sure that people felt welcomed and that those spaces remained open during an Dan and even immediately after the start storm ended. Turn off pass it back over to Jackie to talk a little bit more about what the shelter operations would have looked like insurance. So parks recreation staff. We're at The Bitter Lake Community Center as well as the Garfield Community Center. We were able to secure the services of the Urban League of Metropolitan Seattle to staff the Garfield Community Center to provide around-the-clock Supportive Services to the individuals there as well as coordinating a response with our contract is City providers to buy supportive services, including housing assessments case management resources to people who are living at those shelters. So we were thanks to you and your team we know how many extra hours all of you were working. And I also Jason this is a flip back to you too. Cuz I know that you were coordinating a lot and with Mary's place and I think Vulcan Stepped up and Starbucks stepped up with food and that so I think this coordinated effort was great and I think and then maybe this is something we get to Parks but I think one of the things you told me is that we had a lot of people at Garfield and that was more difficult than a Bitter Lake where there were fewer people may be a different population. I'm not sure but if one of you could address that that what worked well and what we could do differently next time will do emergency spaces between we had additional capacity as you mentioned through Mary's Place Ernestine Anderson place the Frye building we work with Partners, we've mentioned Parks but also the public utilities and provider such as Urban League Salvation Army reach full life care to do Staffing meals and other services provided at the at the shelter's likewise. We wanted to make sure that medical care and that vulnerability assessment. Mermaid while those shelters were open. I just got a piece of good news from just the Olsen who was in back of me isn't anymore who shared that a gentleman who had really been living outside for a long time. I had not been accessing services, but because of the cold and the heavy snow came into one of the community centers and while he was there was able to be assessed that assessment showed that his we were just hearing about vulnerability need in the vulnerability tool. His score was so high that she was immediately placed at the very top of that list for permanent Supportive Housing and just got his keys to a unit just last week. So because you know there were opportunities. You know because of the dangerous environment that once people came indoors they were able to access services that maybe they wouldn't otherwise be accessing and we saw that time and time again, and so while we had these 550 new, you know individuals who are end in door as we wanted to make sure that they had access to resources and so a resource fair was coordinated and I'll have a jack you talk a little bit about that. Resource Fair. Guess what's really quickly? This was boarded up the idea that we had opened up additional spaces and seeing some people go inside who may be otherwise may not have done so many of whom may not have had a frequent so consistent interaction with with the resources that even Services Department work so hard to provide so we reached out to our colleagues of our partners and we attempted to coordinate a resource. We realize that one we had open hundred and sixty individuals already residing at Seattle Center. So we decided the whole sit there and we also had I'm at Bitter Lake Community Center on Garfield Community Center folks who were I'm stable stationary who we can we can transport. So with our partners, we coordinated to provide resources and support for individuals including housing navigation, including employment resources. We've had folks as a result of this become employed. We've had folks move into shelter. Some folks who have been housed we've had Diversion of some sex so successful, excuse me, the version and Strategies employed individuals reconnecting with your family is going back home. Also, we've had folks engaged in case management as a result. So I'll part is included aging and disability services including the Metropolitan improvement district. You have a second chance Employment Program, which was really well leveraged and we believe that it's edited edit invited us to think about. Do you know the prospect of how do we support individuals who may be underemployed or unemployed to as well? Thank you. So council member back. So you asked about Lessons Learned and we identified a handful I think as we pass it over to parkesdale help to elevate some more but we realized that in opening the shelter's we need more of our city family and our community broadly trained and shelter operations. We also know that this resource Fair touched so many individuals and gave them access to critical Services they needed so we need to duplicate that effort likewise. The navigation team was really effective in rapidly deploying life-saving assistance and transportation to individuals who are living unsheltered. And we also know that we have work to do to leverage the process of donations and Community Jonas Community volunteerism as they are critical Partners, but require a deep level of coordination in order for them to be involved. If I can get on that really what I see here, and I appreciate so much is that we came together around an emergency because it was an emergency and we were able to move things in a direction that I'm not sure I've ever seen before we were talking about 500 new units and getting people in and getting the services in the food with the community support to is there again coming back to Lessons Learned but can we use that we talked about and November of what was it 2016 that we've declared an emergency and now we're singing emergency being treated like an emergency. What can we do it before you answer the question? I want to just if I could underscore councilmember bagshaw's Point specifically as it results to recommendation coming out of the city auditor that we do just that the city auditor is encourages the city to consider reinstating the Strategic coordination come out. From the Federal Emergency Management agency's incident command system when the navigation team was initially put together in 2017 its first 37 weeks of operations were actually conducted as a formal activation at the city's Emergency Operations Center. We used FEMA standardized strategic coordination approach called the incident command system overtime. We discontinued the use of those elements for ongoing coordination those elements. There are considered the standard for Emergency Management across the the country includes unified command incident Action planning information intelligence management dispatch employment and to jurisdiction San Francisco in Snohomish County are currently using this framework for ongoing field operations. And this is really something I think is made evident that they the usefulness of this kind of approach is really made evident by the Work that hsd and other departments did together during the storm. An ant feel free also for our friends from Parks, feel free to jump in and help an answer some of those questions because I think that we're really interested in how we're learning from these other jurisdictions. And then also the the quick learn that you did on the ground to respond to the need for this greater coordination. Is that okay councilmembers one question. Are we going to go back to using an instant incident command system as recommended by the city auditor to treat this crisis as an emergency moving forward. So these are all in my mind sort of lessons learned from our time at the AFC and we got to a bar posted us for many months as many departments including the human services department met at the EOC everyday to deploy services this this practice of interdepartmental coordination and activation continues today while we may not be at the EEOC. We are very much working in in coordination with one another on a daily basis the nap team has that, you know daily meetings first thing in the morning. We are you know, I shared the previous previous presentation that just last year. We increased the shelter capacity by another 25% So there is a very real Activation that continues even though we are not located in the EOC presently, but I'm going to try to get you to wrap up so we can hear from Parks as well if that's okay. Go ahead week and we can kind of go through our presentation briefly. But also it'll talk about some of the lessons learned and then maybe we'll fix him a hard time to have director drop off a package. This is coordinated, especially the conversation afterwards and I think we would have we had lots of conversations about what we can do to improve. I have no idea how to switch this. I'm sorry. Do you have a separate presentation? Okay, I'm sorry. I don't believe that we received that so it I really apologize and we will definitely have you back since we didn't have your presentation and Christopher who was here. I was a a private Residence at the time but but Christopher who is here at the time leading our efforts, but I think I think you know, it's greatly appreciate having the opportunity to share our involvement both and helping hsts efforts to support our neediest resident. Also the city's brought a response. But but the echo what director Johnson said at the beginning of this was an effort by many many organizations many many both agencies within government as well as partner partner organizations. And of course who is the one that's ever brings us all together to make sure that we're having the conversations in an organized efficient than an effective way the table because we literally are in every community and we already provide lots of Human Service tech support for our residents. Both in our programs in our facilities, whether it's Child Care preschool before and after care as well as job skills, but we just do a lot until when things like this emergencies happen both communities look to us to help with that response, but our staff also is very much committed to being there in and being responsive to the needs of our residents and so part of our our work during this this last winter storm was both in operating the two shelters that I'm going to have Christopher talk a little more detail about but but also just supporting the city brought our efforts. It's just get the city back up and running. So we supported the work of of S. And other agencies including the school district in the library and just snow clearing a deicing and just making you know, these these facilities accessible to get us back up and running. We also supported for example or friends over at Seattle Public Utilities in the garbage collection side, when when the the snow kept piling up in every emergency. We we supported that we had folks out there dealing with. Trees and literally we cleared hundreds of fallen tree branches and things like that that impact not just people's act accessibility across the city but also power lines at Trenton and the city back in that regard. And so some of that have Christopher kind of talk to you a little bit about some of our operations in those two the two shelters as well as some of the Lessons Learned. But I did want to take just a quick moment at the gist express my at my deep gratitude to all of the staff at Seattle Parks and Recreation. Like I said, we're in every community and and we have a kind of staff that literally just rolled up their sleeves. It does work Network. Whatever needs to be done and even in situations like this are unprecedented we learned a lot but but at the end of the day our staff was really just committed to doing what they did and and my my friend and colleague here to my right Christopher Williams who very ably LED our agency in a response to that. I know you did a fantastic job making sure that we were part of the solution solvent turn over him. So real quickly what you need to know is that since 2005 We have been training Seattle Park and Recreation employees under the guidance of the American Red Cross to operate Emergency Shelters anticipating an event like this. You also need to know that I we use the incident command structure that you spoke about earlier and have practiced at all over the years in the stable Park and Recreation Department. We operated operated Emergency Shelters under the Aegis of the mayor's executive snow response or rather executive order and that allowed us to do things like buy food for the shelter extend overtime the staff and to engage in Partnership opportunities with outside organizations that we would not normally do if it were not an emergency. We operate at the Garfield Community Center shelter from roughly, February 8th through February 22nd, that's 14 consecutive days of operations. We serve 4380 Mills Just A Garfield alone breakfast lunch and dinner. We had a Cadre of staff that work 24/7 shifts 12-hour shifts 8 in the morning till 8 at night and from 8 at night till 8 in the morning. We also partnered with other City departments, but most of the Staffing was done by Seattle Park and Recreation. We operated shelter at Bitter Lake Community Center and one extraordinary story was one of the shelter clients at Bitter Lake had lost it will ensure they were diabetic and they lost their insulin. They left it underneath the I-5 for they were staying and we were able to work with the nav team to go back and find that specific shelter get their kid events 11 and bring it back to the community center and like four or five hours after we learned about it. moving on here snow clearance. So the park Department was sort of a utility hitter. We engaged in work that included clearing roads. Are we cleared library parking lot? We shoveled by planes. We shovel sidewalks. We did Ada path clearing and removal. We shoveled entry ways to City facilities and walkways are we cleared storm drains? And we even assigned our staff to clear a three-block radius around 11 elementary schools around the city that was hand work that was not done with machinery. And that was to Athens school district and creating safe walking routes for elementary school kids, so they could return to school. Does Jesus mention we were involved with Seattle Public Utilities and for drop sites across the city, we staff them. So local neighbors could drop off garbage when the other garbage haulers weren't able to pick up garbage around the city. We had downed tree responses across the city and some of our challenges and Lessons Learned come down to we know we're going to have to do this again. We think we need a taxonomy of shelters that describe shelter types that we are suitable to operate general population shelters warming and cooling shelters and then low-barrier shelters and maybe even with the climate change air quality shelters. We need to focus on Safety and Security for Staffing and shelter clients. We need a staffing plan. In fact, we identified the need for a job Staffing. Shelters as someone who just schedules the staff to staff the shelters. That was a real job need. We need a plan to cope with pets. A lot of people come to shelters and don't want to be separated from their pets a drug and alcohol use was pervasive and some of the shelters and we need a plan to deal with that. We especially need medical and mental health support. We were successful in working with our partners that Human Services to get that support when needed but we could tighten that up and then demobilizing shelter was also an area we want to pay attention to so our next steps falling falling a debrief with Seattle Parks and Recreation staff and Human Services and bar graph from hsd. Yes, we're developing winter weather protocols to better prepare us for the next snow event at this will include a set of protocols that underscores some of the policy areas that were uncovered in this race. Snow emergency that we need to deal with we want to create some agreements ahead of time. So we're not kind of chasing our tail looking the create agreements while we're in the middle of an emergency and we continue to partner with human services in the office of emergency management to create those protocols for this but we we definitely had did not give this enough time. They didn't give us enough Justice on our agenda today. So maybe this will be the beginning and we apologize to parks for not having your material. So we'll send it out to our Council colleagues. The walls have a chance to bring you back. I love the idea of a memorandum of agreement so that there's ahead of time understanding the text Antonio shelters is a great idea. You have a great Chad chair in Parks because otherwise, I'm sure that this is something she's tracking closely as well. And then to the issue that we always are concerned about making sure that there's a ton of access to low barrier shelter. Comments anything before going to Mark? Okay, very briefly guys. Okay. Thank you big. Thanks. All of you. And I want to acknowledge what you just last said Christopher about having those protocols in place. I know we did this between Metro and Sound Transit Metro and S. Starting about probably 12 years ago cuz it was the 2008 snowstorm with things didn't go well we did some new protocols things worked. So I just want to acknowledge that if we're taking care of people who are out in the streets and Tents and having some difficulties. I'm just on any day, but then let alone when you've got multiple inches of snow. I appreciate that if there's anything we can do count us in thank you. Thank you and I would appreciate knowing that during the storm event. The approach used was the incident command system. That was not my question. My question is when are we going to apply these principles to? Finding to our homelessness crisis in a day by day over the course of the year that these These are important recommendations of the city auditor and I think we need to take them. Seriously. Thank you underscore that. As we transition told I guess go ahead. I'm so sorry to say that. I wish it did on a daily basis to highlight the needs of the homeless is it affects everyone and therefore it's in everyone in kind of game but there was several the conditions that exist when we have snow days like that that made it possible for parks to use their community centers School schools were closed for 5 days. They have an early release for another they had a delayed opening another and so to some extent we need to remember that many times the at risk youth programs and other programs at the community centers, we would displace those populations in order to create this this surge of house is okay. Food to keep in mind I'm certain things happen when everybody gets affected at the same time will keep that in mind as we continue to apply the same kind of principles. Thank you all so much and thank you for joining us. And as we transition I do want to underscore council member herbold's point and perhaps we can also look at our national expert Mark to see if he has any other comments on this as we look for him to it for other ideas from other cities the national Incident Command Center you mentioned as being used in Snohomish County in San Francisco. I saw it actually live in person when I went to Los Angeles, they invited me into the room when they did their morning briefing that was an incident come in like and so I think we have some other great examples that we should pull from for the crisis of today and are 365 days a year and it's not about whether or not people are physically meeting in a particular place like DLC. It's about the principles that are used on a daily basis. Absolutely. Thank you so much, though. Don't mark down. Thank you so much for waiting. I was so appreciate you waiting and apologies for turning your time. Would you like to introduce yourself for the record of them will read it into the council. So sure my name is more cones and executive director of the national patient service from the client group on Regional governance for briefings and and discussion think you really quickly. Can I get a good cuz I contact with council members that I can I'm sure maybe executive sign a memorandum of understanding with the county to pursue developing a joint entity of some type. That was who govern our homelessness activities that was affirmed and giving some further guidance when the council passed Greensheet 1518-b one with a budget outline a how we wanted to be involved in those discussions. And last time we had our select homelessness meet committee meeting. We were given a structure and the various. Groups and a steering committee that would wear out all Outline by by Mark and that this is an update on the status of those various groups the broader the broad structuring in workflow among them was given at the last minute meeting as we go forward. We're going to start getting questions and having to take votes on approving a legal entity on approving an IRA on a proving what will be part of their policy goals of this group. So there are major decisions that we coming but today is going to be just focus on the membership of those workers. I even conversation today. I will say that moving to a regional response actually does allow you to use a command Control Function. That's one of the things that I report highlighted. All right moving really quickly. I'm so just as a reminder. This is the structure of the decision-making structure for implementation we have for workgroups organizational stand-up Community engagement policy and planning external Affairs and is a steering committee responsible for Process Management relations strategy. And then of course the legislative process that will run between the two Executive offices of the two consoles at the request of counsel from last time. I'm the purpose of this update is really just to give you all and to transmit to the record who is actually going to be on these things. So this is the steering committee group with names. I will note that yes, this is fennel. The only thing that I want to call out is that service providers and equity advik. Community including folks to experience homelessness. We want the community to German those things, right? So we have reached out to the provider Community. We have weekly meetings are the undoing institutional racism collaborative which is made of providers and folks who have experienced almost as and also with the live experience Coalition, which is the newly formed group of folks who've experienced almost as we are currently experiencing almost as we are trying to determine what the best process is for them to be engaged and I want to be really clear about that have communicated this your number of you but we are very clear that it is not appropriate or possible simply to say to folks who are currently experiencing a crisis like show up to this meeting right into being really really a thoughtful about what the best way to engages and not just sort of saying send, you know a person in that will check our box but really being clear that this is contempt. Live in deliberative engagement that requires their sign off as well the rest of these names I believe should be of no surprise to anyone. I'll pause it there any questions on the slide. Okay next to this is organizational stand up. The purpose of this working group will be to clarify the structure of the new entity and when I say structure, I mean like to really dig into things like org charts and like, you know how well Staffing Arrangements you've done this represents an opportunity to really fundamentally rethink teaming which we think is both exciting for providers. And for staff right that like, you know, how what is the best team to deploy on to support staff in the field? Like how do you think about retooling job description so that you're thinking more about Sir program officer job descriptions instead of sort of more of a contract management, etc. Etc. So a lot of that conversation will happen in this group again, I believe that none of these names should be surprising and again on the equity and homelessness friends. We are working with community members to determine what the best pathway is for engagement. Any questions on this? Community engagement I want to clarify I just briefly the difference between what we were thinking of in terms of community engagement external Affairs of external Affairs is really about like when you need to communicate to an organization or a interest group, right so we can we talk about communicating with the business Community. That's an external Affairs question. And we talked about engaging with neighborhoods with Advocates with providers Etc. That's more of a community engagement question again, I don't believe that there should be any surprises about this and again copywriting on the equity I get some service providers and what I'm seeing is that the labor representation has not apparently been provided again, but that invitation without apologies. It is. Nicholas internet awesome planning on this group will be responsible for helping to recall it affect affectionately the sausage making so we're essentially like starting to have a marathon right where we're trying to hand off a whole bunch of stuff to an entity that doesn't exist yet. And in the process we need to sort of make the sausage or the Baton that's a better metaphor that we would pass off. Right if this was a relay race and so synthesizing the policies and Regulatory Authority is unlike current positions of everybody who's doing something right now and making some pretty recommendations around what is a like which way do we want to go what aligns with you know, the directions laid out by our report by other reports. I counseled excetera that's going to really be the work of this group. Additionally this group will provide support Run the regional action plan, which I know a number of you have heard about but that effort being led by the corporation for Supportive Housing will be leveraging this group explicitly as one of the tools that they used to pull in a data for that plan your timeline. I really appreciate this and we all know how long it takes things to move. But can you talk about that? Is it working our people dedicating 100% of their time to solving this problem which switcher I'm like watching my calendar fill up with these meetings as of right now. Some of the first ones are scheduled for later this week, you know, I will say that as if you just noted pulling together this many people is quite complicated Endeavor and their number of competing interests around who was around the table. I would also say that Part of this is my colleague our colleague here at all home says it's all the time right that there is a need to find some way to manage through the dysfunction of order to get to the solution and so in our report, we talked quite a bit about the inability for staff to disaggregate between their crisis response function and they're planning function. This is one of those moments where that is happening and so it is not possible in the current structure or system for people to dedicate 100% of their time. Although I'm Jason Tiffany and Leo and Mark over the county have been really wonderful actually about helping staff to find time to move responsibilities. So that folks are able to focus. I think that each one of these groups has stopped by at least two members of our team. So that should help keep the ball rolling. And I have heard from folks on the front lines of this that there is some concern about what we have a job at the end of the day. I know this isn't your point to raise but every word is that we're going to approach this like we did the aquarium eight or nine years ago where people were assured. Yes, you're going to have a job with the same or similar benefits. We don't know what it's going to look like now, but have faith that you will have a job at the end of the day. Do you know what conversations are going on within the city about that and HST? I do not I am aware that they are happening. I believe there is a conversation on my calendar with labor for maybe tomorrow even so I know that that is moving forward. I will say that our team's position has been from the very beginning that there is entirely too much work to do. So provided people want the jobs that exist in the new agency. They'll be there are there are some fundamental steps we have to conclude with Legal approach to doing this they will have to answer some of those questions as well. All right and Last One external Affairs as I mentioned the focus of this group is sort of interest groups business excetera again, no surprises here. I will note that there may be an additional Communications from that is added to this my understanding is that the funders collaborative which is forming is looking to retain permanently someone who is able to coordinate across all of the different communication needs. I don't know when or Pal that will happen, but I just want to fly that there may be a shift. I'm very briefly just want to remind folks. This is the time in the wrong. We are short on time but on time so far. So I believe that in our next steps of conversations. We will be able to provide an update around to just point legal entity structure and to hear some clarity from Muscatine County around like what they are recommending and be able to begin to machine portal out of the details that I think folks are looking forward to additionally the working groups will have begun to meet and so we will be able to read out on the activities that are taking place in that those as well and that should be at Thank you so much for both waiting and for your quick presentation and for being here so frequently to help walk us through these I'm important changes. I'm sort of looking at Jeff to help us to make sure that on this last line we get those firm dates included since the Fletch Kenny does having a full calendar coming forward so that way we can populate that questions from our colleagues. About to the last question around retention of staff and are concerned always with making sure that workers are protected and that we have strong Labor Relations. I'm being support coming from this Council. I appreciate that. You've also included our folks from Protec 17 SEIU 1199 and others at the table for those tough discussions. I think that they will be very helpful and envisioning the new the new structure. We will I hopefully have you back and we'll put you first on the agenda is about that on the May 24th meeting if you're back in town you are okay and we promise you mark that will give you your due diligence in terms of time and attention there but know that you'll be around for the next few days. So we look forward to working with you over the next few meetings. I will not be here Thursday. I'll be in Massachusetts. But my colleague Marshall will be I don't know how you do it all at 9:30 a.m. And we will talk to her about that agenda and make sure you're up at the top of the list on behalf of all of our colleagues that are here and those that had to leave. Thank you for your ongoing work with the city as we go through this tough process and that you've heard today time is of the essence of people are really excited about having their voices Incorporated. So thank you for helping to make sure that that's possible you will see you in 53 minutes.", "end_time": 8030.7}]}