{"format": "raw", "annotations": [], "confidence": 0.956252493809179, "data": [{"start_time": 0, "text": "Should over and share your corner. No, good morning everybody. Thank you for being here for a regularly scheduled Council briefing. on on August 5th 2019. Thanks for being here. so few things I'm talking to no one's listening and begin our meeting my bike Knology. What happened in El Paso? I think the whole world in our country's shaken up the death toll is now at at 21 Federal officials have confirmed that it was an anti-immigrant kind of effort given the fact that the manifesto was written by the suspect and I don't know what I mean. Just my heart goes out and I'm hoping that our flag flying at half mast today. I see that is not the perhaps some of those to make those decisions waking at least consider that released today or this week. But if anyone else want and sharing thoughts or observations about that going on in the concern is we also had the mass shooting in Ohio last week the Garlic Festival. It keeps going on at what point are we going to be able to step up and do something that's going to make a difference. I know where nibbling around the edges in the state of Washington for which I'm grateful but it sure would be great to be able to take a big move and that's going to require more than just city and state by state test in 24 hours. After that. There's actually another mass shooting lesser people in in Ohio Dayton, Ohio. I think there's been around 32 or so. This year's it's it's it's a it's a it's a bad thing that is happening in our country. It's it's unprecedented at this level. Throw a f&n else want to share any thoughts rhyme station and give you the opportunity. Otherwise, I'll just remove to our daily routine here. Everybody good catch my Gonzalez anytime. There's a shooting of any kind whether its mass or a one-off as a results of guns. That should probably not be in the hands that they were in it is an incredible tragedy and when we experience a national event, like what just occurred in El Paso, I think it's important for us to call out what the motivation was there. It wasn't just anti-immigrant. It was anti-latino. Regardless of whether people were born in this country or born in a Latin American country. It is fundamentally motivated by white supremacy and racism these being fanned a national-level including by President Donald Trump, and I spent a lot of time over the weekend reflecting on What it means to me as somebody from the Mexican that community and somebody from the American Community to find myself in a situation now where it is it is it dangerous to leave your home and walk in a space as a result of this deep hatred that has been fanned by by the federal government and has been sanctioned by this President and it says it's it is a sad moment at dark moment in our history, but I believe that we can all come together and that there will be a light at the end of the tunnel and I know that President Trump earlier today or yesterday mentioned that need to speak up with one voice Against Racism and white supremacy and hatred and I hope that we can speak up with one voice in November of 2020 this to resemble you say no to a man who has certainly DoubleDown tripled. And has really endorsed and enabled much of the hatred that we are seeing come to our country. You cannot suggest that for women of color who are congressional leaders be sent back to their country wherever he thinks that might be and then not expect there to be repercussions in our country is released by hatred and in an in the El Paso incident. It is very clear that this this young man was motivated by hate and racism specifically towards the Mexican-American community and and it's a tough moment. And I know that we have a large population of Mexicans and mexican-americans across the country and certainly here in Washington state. And yeah, I think we have an obligation as elected officials to say publicly. They were going to continue to stand with those community members and that we will do everything that we can to protect and to disa How to disavow acts of hatred like the one we saw over the weekend make it worth your while those sauce. I just wanted to add I know we talked about this before it is those of us are older. That's the open season on Mexican Americans and Americans is that is race-based. It's not all about as President Trump said this morning about video games in the dark recesses of the internet or mental health. This is just pure hatred that's coming from The president of the United States and as we know when you have a thought I thought turns into action and sometimes that action turns into violence and that's what we're seeing now. I think what scares me now as I'm older is that this feels like what was going on during the Civil Rights Movement where it was open season on anyone of color and this is the time we talked about allyship. It's not enough to say I have white privilege and I acknowledge it or I've had I've had things that other cultures have not have ever been denied. This is the time for other people as well to besides our communities of color to step up and say something and do something and I agree with the people that chanted in Ohio this morning against I believe it. Was there a freezer Governor or their mayor do something and I'm hoping that we do something and I really want to thank Helper consalus and Echo cuz I know we all feel this way and we felt this way after other shootings as well. But this one is particularly hateful and Particularly painful because we know that it's race-based. At least we happened in El Paso. So thoughts and prayers aren't enough and I'm hoping that people are listening and they're going to do something. So thank you. Thank you guys better or worse. Cousin Skeeter On earn every other week blog. We're going to be also writing about this this week and I'm pulling from an article in essay that was written two years ago outlining then the consequences of gun violence. And as a reminder for folks, we know the consequence of mass shootings like this, they get highlighted in a media, but the reality is that mass shooting is usually defined as four or more person shot killed or injured at one time. And so the reality is that mass shootings happened on an almost daily basis literally on a daily basis in the United States and one each one of these four people are more shootings may not make the headlines that we see like the three incidents that happened in a very short. Of time over this long extended basically weekend. We know that there are massive amounts of people who are dying on a daily basis due to guns due to gun violence and especially in schools and public places like our markets like our gather. Places are creating feeder and their folding into the racist and xenophobic and I would even say an extension of assault on women. If you look at the most recent one that occurred in Ohio that individual had targeted women in the past and in his shootings killed his own sister on that targeting also occurred in a heavily populated area with African Americans come from Urban Solace talked about the shooting before that. I'm in El Paso being targeted at Latinos and in places across this country. We see how both racism and the presence of guns and the unregulated nature of guns in this country is causing mass shootings that are not getting covered on a daily basis simply because of the prevalence of those guns. There's an important I think report at work, but I guess I should say a book by Roxanne dunbar-ortiz called loaded the disarming history a disarming. History of the Second Amendment it was put out in 2018 and in the book short and easy to memorize a well regulated militia being necessary to the security of a free state the right of the people to keep and bear arms shall not be infringed. However, it is the NRA and the people who have taken that short short out of our constitution who have turned it into something else and weaponized it literally weaponized it to inflict harm on our communities. We have an opportunity now to look at the original wording of the Second Amendment and know that it has not been altered in any state but that it has been altered and its meaning and use by the NRA and now by racist xenophobic individuals and we have an opportunity to say that this was never the intent of the Constitution. This was never the intent to put arms in. A regular everyday folks who are carrying out messages of hate that are being perpetuated by our Trump president by the by the Trump Administration and to also never never fall for this being a mental health-related crisis. Of course, we need to access my more mental health dollars in the country overall and our state has led the way with the alliance for gun responsibility of getting guns out of the hands of folks who could potentially be harmed them self or others, but this is an intentional use of the words of the president and the intentional strategy of the NRA to put gun into our community and the prevalence like we've not seen it other places and let's not also fall for the excuse of this being related to video game. We seen this is statistics time. After time. This is not related to video games A Mental Health crisis. This is exactly because we have too many guns in our community and I applaud our state and our city for standing up, but we're not going to be fooled by the language either and how people have Benadryl. It's used in the Constitution or by Trump hiding behind these Hollow words of solidarity against standing against hate and racism when we can see through it and we will stand up. Thank you customers skater. Okay. Thanks for all those comments. Virgin cycle. So let's go around our agenda for today or this week. Nothing for both from the governor's equity and Technology committee up for today. Let me begin the meeting as we do now saying that comes from Juarez Bagshaw mosquito Pacheco Gonzales and O'Brien are present and there's no objection the minutes of the July 29th, 2019 meeting will be approved. You know Jackson those miniature being approved and so as I was saying that the governess accident acknowledgement will meet Tuesday tomorrow at 9:30. And they're three matters up for vote one would be about the consideration of a code reviser position in the city attorney's office. And I we've been working on this for a while. This is coming from the city attorney's office and our own center staff and looking at this cold revise our position which is sort of found it in a state law in state law because of some Authority and flexibility to do this, but we've seen over the years a lot of discrepancies in retroactive Corrections that are necessary and we have two legal assistant or paralegal types of positions in the city attorney's office now and we want to be able to replace an attorney that position. We think that that will I make the legislative process run much more effectively and efficiently on the second issue is a bill that authorized the FSU and 15 year lease with Cascade public media formerly known as kcts and that is the allowance of RI antenna system to allow it to operate the radio and antenna system on Cascades at Capitol Hill Tower. And the third one is AR technology matching fun where we distribute approximately $320,000 of city funding to support 11 new projects in community-based projects and it's match Bayou 300 mm coming from the award recipients many of whom are Grassroots community-based organization. So I look forward to that legislation as well. I do want to alert you that we did receive I think Friday is a letter from the mayor indicating the executives attention or now action on vetoing the sweetened beverage tax bill that we all passed overwhelmingly passed a we received it Friday and I'm open to suggestions and how to handle this administrative leave but my intent at this point is to let it to put it on both for next Monday. So sit weekend deal with this efficiently and effectively, but I'm all ears for any feedback at my chain again is I think it's a white. Can we just a complete waste of time? To do this and I'm not sure the acceptable reasons for doing it other than making us rebuild a boat. That was not even a narrowboat and I thought I thought we established you're pretty clear record on a rational and this will give us an opportunity to reiterate. I think they false narrative that's out there about us making decisions that are hold hurting some of our most most vulnerable or summer housing means I think that's a false narrative him again. We can clarify that on a revote but that's my plan is to put it up for a revote next Monday. But if you have any comments, I like to hear them now, Brian appreciate your words on this council president Harrell and I fully support that my counsel for 10 years. This is the second time. I've been to a veto and it's been 9 years since the last one so but my understanding is that from The veto we have 30 days to take action and we have to wait at least 5 days for Providing a certain public notice around it and I believe that leaves only the one full council meeting on the calendar for us to do because of our recess coming up so short of scheduling some sort of special meeting. I think next Monday makes a lot of sense is probably as soon as we could practically do it and I see no reason to wait any longer than that. I'm a better way and I also appreciate council president earlier your comments. I have been very disturbed by some of the apps that I've heard coming out of the executive including the mayor's office, but also her agencies that have really done a disservice. I think to what our role is as a city council which is to to be the budget appropriation authority to make tough decisions about budget issues. And I think this is really And it was really more about a statement against this mayor wanting to see her executive power curved as opposed to the substance of the issues because I think on the substance of the issues, we we Prevail it is clear that the sugary beverage tax has always been intended and it was our initial oversight admittedly to not be clear in the language in the ordinance to ensure that these dollars were going to be spent in exactly. The manner that we have now indicated. They should be spent and we all can appreciate that revenue is a source for us at the city and at the state but that doesn't mean that we should turn a blind eye to what the intent of the original ordinance was. And so I'm I'm very supportive of moving forward and I would Note 4 youth council president Harold that I will actually be out of the country next Monday on August 12th. I'm happy to take advantage of those poor. Council rules that would allow me to call in for purposes of this boat if if that is if that is okay with with you work through the administrative Logistics of that as soon we could do that and we'll start working that immediately once we talked right tfox. Okay. That's right. Before we go around the room council member where s Thank you. Good morning. Again, everybody. So last week the Civic development is considered for items. But before I get there, I want to do a quick update and it kind of a heads-up for my colleagues. We've been working very closely on the missing murdered indigenous women a resolution and some legislation to follow with the Seattle Indian Health Board and specifically esta Lucero and Abigail alcoholic for the draft and we are I'm actually going to start implementing on what this legislation would look like and to have a response to this systemic response to this crisis that we are seeing in our cities and as you know Seattle has the highest number of missing murdered indigenous women. So we hope to have that done and ready to was any of your comments or concerns on before the end of the week. And so we're happy about that. I want to thank the city attorney's office and King County and chief best in the mayor. Sophos have been very supportive and I'm hopefully we'll be working on with the budget chair on what that means in the future. So if we move forward on this and we have this particularly is on Whose job it is to work within the city and all these Native American Urban organizations as well as Indian country and responding to this we would be the first city hopefully to do this and so I'm excited about this we've been working on this issue for well over a decade. Okay. So let me just quickly go through what are committee did last week we received a presentation from the outdoors for all Foundation, which is a nonprofit dedicated to providing outdoor and Recreation access for kids and adults with disabilities. It's a wonderful program. It's located Magnuson park, but their reach is Stateline. I know many of you have went out to Magnuson and met with those folks. Like I said, it's a great program in encourage my peers to watch their promotional video to learn more it can be found on the link in the agenda which is item for which is posted online LBC ordinances that passed out of committee that are up for final. This afternoon won in District 1 and ordinance regarding Dolores Amish Park acquisition for open space and Recreation purposes were very excited about that expanding Moorpark land number to an ordinance regarding Parks accepting art donation to replace in the University District Christy Park and an ordinance regarding Parks accepting money and property where son Park located in Laurelhurst. So District Four going to receive more Park property and some months and Foundation money to continue the work that they've been doing two for a parks and activating them. Parks and Rec will be hosting their big day of play on August 17th. This is a wonderful event that is free for communities and families to enjoy food trucks and fun activities will be located at Rainier Playfield and the Rainier Community Center in southeast Seattle on my fat ended one of those before and they're actually pretty cool. We've had a couple end up in D5 as well. For more information, please visit Parkways. Sale. Gov. Now, this is why are big event as you know, this is our fourth annual wait before I won't get to that I need to do this one first. Sorry. I got them in reverse on Saturday. I went to the annual Lake City SC Fair Festival Wareham are gherkin King County Executive Joe Constantine, and I honored Eric Stark as you know, our Metro bus driver and Deborah Judd for Heroes in the aftermath of the Lake City shooting this past March. Eric is a metro bus driver who was hit in the chest by a bullet but yet managed to still put pull his passengers out of Harm's Way and park the bus then Debbie is able Second grade school teacher at Laurelhurst whose first concern after rise arriving at the hospital from a bullet injury was for her students. I got an opportunity on more than one occasion to meet both Eric and Deborah and they're amazing people. It was wonderful to honor them and do a proclamation and a prayer and it was a teen and it was packed and everyone was grateful. So second of all live Indy 500 be our fourth annual fourth annual folks 75 event. It's this Saturday August 10th from 1 to 4 at Hubbard Homestead Park. I hope my colleagues will join me. We will have live music again featuring three local bands as well as the local DJ this year liven T5 will have a petting zoo again for council member mosquito great food last year United Indians did salmon and fry bread and this year. We have a raised Native American food truck from the Tulalip Nation coming down and a beer garden and its course you have to pay for your beer. It's not free. But admission is free. T5 will have tables featuring Community groups and key City departments. So people in the district can easily access ways to get involved in support the community last year. We had well over 50 Community boost and City departments and we had well over three hundred people that showed up. I'm hoping that my colleagues will show up Katherine was Katie came last year and she was great on the stage. So thank you counselor mosquito repeller badshahi showing up in the past and I appreciate it that any of my colleagues who show up or want to it's up to you. But if you do just let us know and I'll make sure that you get an opportunity to get on the stage and introduce a group and also this year were really excited because council president Carol and I are going to be doing a duet together. So I write the song get back to me on that since you didn't do the dunk tank with me. Yeah. Yeah. Yeah you backed out of that one. Anyway, you may have seen the posters as you know, they're plastered everywhere. future Z artwork for I did not put this in my notes. I'm seeing it for the first time and I probably should have read this ahead of time artwork by my husband Michael. Do PL. Just saw that Michael did the t-shirts and he did the the artwork which is basically a blackfeet feather. So you'll see the beads on there as well with the blackfeet colors. So anyway, you are all invited to attend. It's our fourth annual and it is located Hubbard Homestead Park, which is located right behind Northgate behind the Target store and I hope to see you all there. Thank you. Thank you my best shot this afternoon on our financing neighborhood committee. This is actually an ordinance that would raise the wages of the hydro maintenance workers that these are the folks that work at boundary Dam in Northeast, Washington. So happy to move is through total annual expected expenditure is $77,000. So it's not one of the bigger ones were going to be touch. We also this past Thursday. We had a special meeting and thank you. Cancel, Amber Gonzalez council member Pacheco for joining me on that. We are going to be having five ordinances that are kind of come forward to yet. Another special meeting this Friday August 9th at my intention is to vote on them. We will be going this a second time that they will be in front of us. These are things that came up with the end of the year including rcip retirement grants and accepting supplemental. So if you've got any supplemental budget ordinance information that you want us to get in you got to get it to us this week when example that I brought up last week is a nurse practitioner that we want to have on-site at the ESC. We've actually found money to pay for that for the remainder of the year. So if you've got something supplemental you actually have to find the money and help us do that. So this will be in my committee on Friday. We've got multiple things to vote. I have no reason to believe it will be slow down and then I've asked the clerk for us to be put this on our full agenda a week from today so we can both this out and be done before briefing on these budget items that pertain to 2019 generation today. This isn't support of the art Workers Union who are at Frye Art Museum as you know, we talked it actually in the council briefing before about the workers at the Frye Art Museum their Crafts People Who throughout history have support and I have brought forward support for labor and other Progressive movements and they themselves though have been long struggling with low just working conditions and to get a voice on the job and they recently formed a union on June 10th of this year. These workers succeeded in forming their Union called the Arts Workers Union. And in light of all that we are celebrating this year on during labor which we started with a hundred year celebration of the Seattle strike and some of our Camaro commemorative comments and Proclamation on WTO. For example, I this is a great way for us to continue that extension of celebrating labor in the city and we want to congratulate them on both their contracts on the formation of the union and the work that they are doing to raise the voice especially for work for art workers in the city. Thank you for considering signing and thanks also the mayor for signing on to that as well. There are no items from the housing Health Energy and workers rights committee on today's full Council agenda. Our next committee meeting will be on Thursday next week on August 15th. Will we will be bringing our committee start time to 9 a.m. Again, if folks are able to join us. I appreciate you coming and I want to thank my committee Collies especially who have gone out of their way to come at 9 last week. We're doing this in an effort to try to get as much time. We can on the agenda so that the second part of agenda can really focus on Hotel worker legislation, which has been in pretty robust discussion. Thank U council member Gonzalez as a co-sponsor of that for being at all of those meetings as well in the latter part of the meeting. So just for folks to know of at from 9 to about 10:15. We will have a conversation and public hearing on the first two items on the agenda, which really to sort of an element of a green New Deal ask like Bill which it are two bills. When is pushing forward a new solar program at Seattle City Light so that we can do a better job of installing a solar panels for some of our mid-sized companies throughout the city. The second one is helping to make sure that we are creating an opportunity for Seattle to join the Western Energy imbalance. I guess Market. I'm in this allows for us to bring more Barclay cleaner energy on to the Western Market and I think that these two items are really great. I would love to be able to move forward a vote on those two. And our committee that morning and then we will take public comment on the hotel worker legislation will have a briefing discussion and possible vote on amendments. So you'll see the last hour and a half. If not two hours totally devoted to the hotel worker legislation. Again, if you do have amendments the request has been sent out last week. We will send a reminder this week council member Gonzalez and I have asked for those amendments to be due back to Central staff. I Thursday this week August 8th at noon Thursday, August 8th at noon will send a reminder out from our office later this week. You should have received one on Friday or Thursday just to make sure that we get all the ideas in as early as possible and then just to be clear. It's just on part one and three threats. Yes. So just by way of a reminder to folks this is related to the safety elements protecting workers from harassment assault excetera and On the health-care elements so you can see Parts 1 and 3 in the full binder that we sent out with an updated timeline for that. Have an amendment already in that aligns with the request from ACLU only working on had a chance to talk to Simple Stuff late last week along with some of our Council colleagues. And also give a kind of a broad overview to folks in the executive office will be talking to stakeholders as well this week. I'm so the concerns that the ACLU have raised have definitely been hurt and there is an amendment in works. We should have that to be able to circulate to all of our Council colleagues before the end of this week and thank you to Karina and to Danny turai who both collectively have been working to address those concerns and think through a process that will I think be well-received by many of our Council colleagues and we'll get the chance to talk to stakeholders are very briefly very soon. Thanks again to the Puget Sound advocates for retirement action and Social Security Works along with congresswoman. Jayapal. We had the chance to speak this weekend in celebration of the 54th anniversary of Medicaid and Medicare and the 84th anniversary of Social Security with a great turnout. I think he's Q13 covered it and really wanted to not just call for the celebration of those programs and the protection of those programs with the expansion of Medicare for all which was well heard at the rally and sending our message to DC and support of those changes as well this Thursday. I'll be speaking at University Heights on the vehicle residency Community Forum. I'm not sure if other folks are going to be there, but I'm looking forward to that discussion as we think about how we get our most vulnerable Phil and safe places. I'm if not inside to make sure that they are out of Harm's Way and have access to amenities and case management as we know it was critical for helping to stabilize folks and that's it for me. Thank you. Cancel Amazon Echo. Good morning. There are three plus resolution 3196 comprehensive memindahkan resolution Council bail bond 19597 which provides incentives for open space in South Lake Union to facilitate open space preservation at the old Seattle Times building and cancel 0 0 which updates are City CPAP policy telling them estate changes and make other improvements 471 clarifies the definition of a vessel. This was passed unanimously by the plus company in June but was held until now I need a required Department of ecology review on August 7th. That will be three items on the agenda the discussion and possible under comprehensive plan docket setting resolution a briefing and discussion of the city seba policy updates and a briefing and discussion on the planning commission's neighborhood spray. Report and we have that we will be rescheduling the lunch and learn with councilmember Bagshaw on wayfinders until after the recess tomorrow at my office will be doing Night Out events throughout the district and we have on Thursday the 3rd annual food truck taste off Madison Park Hangar 30, and I will also be participate in the u-district vehicle residency panel on Thursday as well. Thank you kiss from Chico. Morning morning is there are three items from the gender Equity Securities new Americans and education committee on this afternoon's agenda. The first one is an ordinance relating to the city's criminal code this particular Council bill would align the Seattle Municipal Code with some of the changes that occurred during our legislative session in 2019 to allow the city of Seattle to continue to both collect DNA samples and to also upload them to what is referred to as the CODIS database a post-conviction that would allow an opportunity for some cold cases to perhaps not be so cold anymore until I find some resolution. So this is really a follow-up on representative Tina orwall good work in multiple legislative sessions where she has been advocating together with survivors of sexual assault primarily on the testing in the doing with the extraordinary backlog of a primarily rape kits that have been collected not just at the state level but also at the city level so this is our opportunity to continue that trajectory of work and to allow for our city attorney's office and the Seattle Police Department continue to collect some of those DNA samples after a conviction has been secured for purposes of continuing on in efforts related to Public Safety and making sure that if there are other cases in which the same DNA matches up at that those those victims might be able to see some justice within our criminal justice system as well to remaining Legislative matters are simply clerk files one is from the Seattle police chief. This is a clerk file with her annual report concerning activities related to the intelligence ordinance of this will be just an opportunity for us to file that publicly as required by ordinance. The last is also a clerk file that's a chief of police audit report of same thing information related to intelligence that might have been gathered and utilized in at the course of ordinary police were consistent with that ordinance. So in both events are office of Inspector General report it to us that it appears that compliance has been had with his underlined ordinances over there were questions about the need to update our intelligence ordinance because it was written and has never been changed since I think 1972 And as we all know intelligence and the way we gather intelligence is radical. Formed and changed since then so that is work that has been recommended and it's my understanding that the Seattle Police Department in the executive will be working on that body of work for sometime in 2020. So those are the legislative actions on this afternoon's agenda for my committee. Secondly I will not be having this I will not be having a committee meeting this week. I will actually be in Denmark from August 9th through August 18th, attending the urban livability masterclass, which is sponsored by the Capitol Hill Eco district with physical support from the scan at design foundations of the master class is an immersion program that brings together government and nonprofit leaders and other stakeholders to have an understanding of issues related to Capitol Hill for a week of fieldwork tours and lectures presentations and work. Shops to study at public spaces and public life in Copenhagen it too hopeful and in Malmo Sweden to hopefully take some lessons away and some actual strategies that could apply to Capitol Hill in this case in particular and so many of you know that there is a Capitol Hill Eco districts. And this is really sore too focused on that particular neighborhood based effort which really focuses on sustainability to serve this very densely populated Urban Village and as it continues to grow and as we continue to understand and appreciate that this neighborhood has spell opportunities and challenges with public space in public life as it relates to transit-oriented development opportunities for this will be a really unique opportunity for me to join together with other Capitol Hill Focus stakeholders and other Regional government agencies and nonprofit leaders to really take a look at how Copenhagen to Malmo have done a very good job with those sustainability. And just creating safer public life in public spaces that are accessible to all with a focus primarily on pedestrians. So really excited about representing the city council at that particular convening and will be gone for that week in order to attend that master class. Thank you for thank you customer Bryant. Thank you, the sustainability and transportation committee has three items on this afternoon's agenda to pass around something. That's not what I'm talking to him in the second. The first two items are ordinances related to the street vacation at Seattle Children's Hospital that we began nearly a decade ago. I think one of those ordinances it will be accepting an easement for the connection like a sport connection from the burke-gilman trail to Seattle Children's Hospital. This this connection has been in place for a number of years, but finally have all the proper legal stuff in place so that the parks department can take over operations of that facility. And once that is voted on that is the final piece of the street vacation ordinance of the public benefits package that sell children's was supposed to provide for this week vacations for the expanse. Years ago and so we will move forward with the ordinance to finally grant that street vacation that we gave conceptual approval to a number of years ago. So those two items will be the last to do to finally wrap up nearly two decades worth of work on that. We also have an ordinance that will update the commuter production program. That's the program that's State program the city hops into which works with employers large the large employers hundred hundred employees are more downtown for nearly two hundred thousand employees are covered in 300 employers. And so this is just an update to that program an example of why the update on tncs didn't exist as of the last time we pass an ordinance. And so how those fit into the commercial production program. I'll just say that the folks that ask. And Suites Seattle do an amazing job of Seattle, especially folks who commute to and from downtown Seattle for the work day. You seen his kind of one of the best programs in the country for what we're doing especially considering that of our transit system is a little younger than some of the ones on the East Coast, but we still do some amazing work here and at the same time if we're going to make a kind of radical shift in how we get around our city special and relates to its climate change. We're going to need to keep doing even better work. So that's it for this afternoon's agenda that we passed last year was to try to look at the the ability and the cost to provide for you or Compassus to our Human Service Providers all our conversations that we've been having about the need to facilitate the ability for these folks to be able to afford to live in the city. We talked about their wages in the contract one other area that folks that are raised with the desire to see these human service contracts again. A ORCA pass did that come up at all in this discussion. I know that we will you just receive that information maybe a month ago or so in response to this lie, but is there a future opportunities using to incorporate that concept into something like this or is that a different vehicle related but this is specifically relates to the state law on commercial production which defines the types of employers and employees are required to participate in a program. It may involve some of the same parties good if commute Seattle were willing to partner with us on something Human Services and I know there's other efforts to figure out how I get more bus passes in more people's hands and so but I would love to go to work with you on that and there may be some opportunities even in the in the coming weeks or months to to do something about that. Cuz we have the committee meets our regular Tuesday meeting tomorrow afternoon. We also have a special meeting Friday afternoon. We also have a special meeting next Friday morning. And so I passed around a sheet that lists the items that we will be discussing. I didn't want to just take a minute to walk through this if you'll if you'll grant me that there are quite a few items that they were trying to squeeze through this committee and the coming month in the coming months and I are meeting thank you for being there last Tuesday. It went three and a half hours. I suspect these meetings will be pushing 3 hours to to get through all the items that are coming to us. And I know that there's a lot of stuff going on in the summer. I just want to make sure the folks are where this goes. There's some items that they will be back before the full Council as soon as next week. Some of them are fairly significant and I know with a lot going on it's hard. I just want to make sure folks can track this. So I really quickly just walk. Through the items. It'll be on this Tuesday's agenda than this Friday's agenda and I'll just highlight the ones that are going to be on next Friday's agenda. And then I want to speak a little more detail about this relate to the green New Deal. So we'll have an appointment on Tuesday to the Moon Seattle ever. Say Lucy at 11 oversight committee planning to discuss and perhaps vote on a resolution related to a green New Deal for Seattle. I'll speak to that again in a moment on the sheet that handed around it talks about a green New Deal ordinance that will actually not been committee on Tuesday will be on a committee Friday. I'm walking that legislation on to the referral calendar this afternoon and we'll pass around that legislation right now the green New Deal ordinance follows up on the resolution, which we will hopefully pass on Tuesday, which would establish the green New Deal fund and a green New Deal over sideboard to make recommendations to the city related to the green. We will have an informational Breaking Free on the transportation Equity program from s. Streetcar ordinance. We had a discussion about that last week and that is planning to vote on that on Tuesday tomorrow. So that would authorize an additional nine million dollars for a continued design and Engineering work on the the Center City Connector. My understanding is they believe that nine million dollars will be able to give the information that'll be enough to do the rest of the design works so that they have total cost estimates for if they choose to go forward. I believe the mayor's intent at the moment is to move forward with fully funding the the center city streetcar. I'll let her speak for herself of my understanding it committee was that this 9 million dollars is necessary to understand all the cost implications of what the next step would be in cell not quite a hundred percent committed until she Understands what is in there? But that's the direction they're going and so we have a decision to make as a council if we're on the same page with that and tomorrow afternoon will be when we have strong feelings on that and can't make it to committee. I would really appreciate hearing those. So maybe I'll pause now cuz I am going to support this effort of moving forward to continue to look at the design and Engineering work, but I wanted to signal right now that I'm concerned on three particular areas that I don't think we've addressed one is the operational cost. We know that we're going to be taking that over that were from Sound Transit Metro that we've got additional cost just for the Broadway link. I don't think we figured out yet that the lines that are not on dedicated lanes are going to cause delay. I really want us to figure out what does operational costs are going to be before we sign up. And say yes to the final whatever the project is. Also just along the capital money. We've got some federal money, but they're still a big gap. I don't know where that money is coming from. So we need to be looking at that down the road of five and ten years and lastly in this is something that I would I feel strongly enough that I'm going to want to ask for a Proviso at some point that it may not be for this 9 million because we need those designs, but we don't have yet in a way that looks at the system for Freight mobility and deliveries downtown and it's something I've been asking and working with us. On for the last five years. I'm talking about the entire system then you know 9 blocks from the water to the to I-5 but also all the way from Denny to Jackson and Beyond there more more packages being delivered downtown Amazon or UPS there they're here the trucks are in the way. They don't have places to stop their servant. They're circling the blocks and so I've asked us. Or a literally a block by block. Where do you drop the packages off temporarily? What time are you coming in? Are you if you're trying to do it at 5 in the afternoon, which they do if they get delayed it just makes downtown that much more congested. So this is not the first time it's about the hundredth time that I've signaled to ask. That we need to have this. So before we start digging up First Avenue, we really have to have a design that's complete about Crocs time place location and it's going to be a building by building. Where are you going to drop it off? And at what times I appreciate that counselor big shot and would love to work with you. I think I heard a mix of things in there but including perhaps some language in legislation giving some clear Direction on what are expectations are around the streetcar remove Ford. I'm calling the mayor's office is hoping that we would pass final approval of this at full Council a week from today, which is our last Schedule meeting prior to our recess so prior to September obviously we can choose whether we meet that timeline or not. My intent at the moment would be to try to meet that timeline if folks have language that they want to incorporate then we can get that in in time. That would be great. If if the general sense of this table and for the folks that are not here at the moment is that we're not ready to do that. Then I really need to wait another three weeks to do that in September, you know, that's not the end of the world. I think it's just a project that this emergency around but I'm happy to follow the lead of support you moving forward next week. I just want to be really clear that I don't think we've answered these questions on how is where we getting the operating money or the addition. Where's the additional Capital dollars coming from but this thing on the freight and the downtown system has not been fully addressed and I want first of all signaling today that that's a very important issue for downtown and we can figure it out, but we've got two dead. Its resources to doing it. And another thing will have in committee. I've asked them Calvin Chow from Central staff to help lay out what we know about all the finances a project. It's been through a number of iterations and federal money. And so we got a bunch of money on it. If we don't go for it is some cops. Those are gone. So we want identify with that spin want to get a sense of what we think it would cost to complete this project. We want to get a sense of that remaining money to be spent. How much of that is already allocated City money in the budget, but that if we chose not to go forward to be reallocated. How much is money we know there is a TENS of millions of dollars that additional money that we don't have the mayor has been identified as a source for you. Do we need to use? There's also Partner money including Federal money and I believe other agencies that if we don't go forward but have to go back and then around the federal money. I think there's a big? To I we weave Believe a 50 million of a 75 million-dollar Grant. I think there's some question whether we would get the final 25 and even the status of the initial 50 because I think we have to resubmit for that because of the timing so Calvin will lay a lot of that plus the operating cost to about what we're doing on the existing to streetcar lines and what this would add to that. So this is a lot of terribly complex but a lot of numbers going on there and hopefully we can we can come to agreement what all the numbers mean and then we'll have to make policy decisions come out. German skater, thank you. Thank you. Mr. Chair Transportation on the issue related to streetcar. One of the issues that I remember us talking about before was how much it has the delay cost us. So is Central staff already providing a memo of the total cost of the vote delay at this point so that we have an understanding 9 million + x has been the cost of waiting. Is that embedded in any sense of FML so far? I believe what we will see a comparison to what the original cost estimates were where they are today. I think there's going to be no reasonable Minds will disagree perhaps on why the constellation how much of that was delay. How much does that was a decision to buy larger cars, which is causing redesign. Am I mean there's a lot of moving how much that was related to uncertainty around the Federal grant process, you know change of administration had something to do with that too. So I don't know that Central staff going to be comfortable trying to say but they will be at the table maybe be able to answer questions that we might have and we can you know, make our case for for how we would allocate bad but my goal is to try to get them to be as clear as possible on the stuff where there's not disagreement about and then the areas where we how we characterize things or what we know we think the likelihood of Federal grant says whatever it is we can talk about those differences of opinion. So we may or may not have hearing and hopefully make a policy decision for you. All right. So that's most of what we're doing this Tuesday. We also are going to have a briefing on Transportation impact fees. We've done a number of briefings on transportation and back fees. I'm committed to moving legislation for assuming we get a supportive ruling from the hearing examiner. So just a reminder to folks we were proposing in last December's up date to the comprehensive plan to add a transportation project list, which was the first step a necessary step in creating a transportation impact fee system for for new development in the city Seattle the real challenge to the hearing examiner around the adequacy of RC fanalysis to that Transportation list that was going to go into the comp plan. We're expecting a ruling this week or next week on that, you know a couple of things can happen when the hearing examiner can say no the Sleep analysis was adequate at which point we can move forward with transfer. Impact fees and so I'm charting a path that it will assume that so we'll have a briefing tomorrow night on a tongue spacer the overview of kind of where we are today. But analysis has been done with the expectation that we would do some more policy work in September on Transportation impact fees if we get the green light and then would ultimately take probably final action in the budget because there will be some but changes the capital program with that Transportation project list and requiring additional update to a complex. So this is a hypothetical discussion about Transportation impact fees. Hoping that we get a good early for me hoping we get a good rule Inc sometime next week or so. Quick question. So as far as I know this is at least the third time in the last 10 years that we've discussed Transportation impact fees. Are we building on the work that council member Rasmussen Dead about four years ago? Cuz I know there was a lot of a lot of research we had some outside experts. We compared our cells with Bellevue and Renton and Redmond and everybody that's got them. So if you've been tracking my clothes leave the conversation tomorrow will look really familiar with the city council approved a budget. I don't remember but a few hundred thousand dollars for the mayor to do the necessary analysis is Mara Marie to do the necessary analysis to implement of Transportation impact. It has a lot of technical analysis that goes in the state laws pretty clear on how you can and can't do these programs and so that work started and then it stalled out and so about two years ago the city council because if Can clear that the previous mayor was not terribly interested or was not prioritizing that work. So the council and its budget action. I believe two years ago pulled that money unspent money out of the executive side and put it into the council's budget and then we picked up that Consulting contract with the same contractor where they had left off and we've been moving forward with that again, you're ready to take action this time last year. We were going to do something in the comp plan in December, but that failed because of the legal challenge. So we're working with the same consultants in it is building on that work and a lot of the things you hear in the briefing to be similar. What's Tuesday? That's I'm going to be folks are planning to come. I would urge you to budget 3 hours for that meeting is opposed to two and I apologize for that then Friday. We're going to have another meeting. It's it's at 2 p.m. We're going to get here from the mass Coalition. That's an acronym for move all Seattle. Sustainably. It's Coalition of of Transportation. In other Equity Advocates who are looking for better transportation access. They have been talking to you. If I'm sure you're seeing emails and other notes from them and they've been active here in Council last few months asking for a transportation package that they would like to see happen. We will consider a bike safety ordinance. This would the intent here is to put some more laws in place similar to complete streets, but with fraps a little more stricter requirements, so as we're redoing Transportation projects throughout the city really making it clear that they need to be The weather pedestrian bike Freight in transit Master plans, and if the executive department want to deviate from those plans requiring a check back in with Council so that we don't end up with what we had on 35th Avenue Northeast where I felt like a decision was being made in the council wasn't banging on that. We're going to have a resolution about the bass back master plan implementation plan is not a bike parking resolution about expanding on street bike parking. This is also perhaps in support of other modes like scooters to have places where we can store these vehicles are these Transportation modes. What are going to call them and then we're also going to discuss red light camera Revenue. This was something that came up in the budget last year you mail recall that we previously had a policy where 20% of red light camera Revenue went to school safety projects. We suspended that for two years and this year's budget, which is mostly done in next year's budget. It was the right word endorse. They believe assume that that in Revenue will be going to the general fund. I'm interested in it may be reconsidering that for next year. So we'll discuss some options and committee that will not take a vote in committee. But really want to set it up for a budget discussion about perhaps rededicating that red light camera to either school safety or Vision zero M investments in the 2020 budget. So then on next Friday just for a heads up that meeting is at 10 a.m. We're going to have a briefing on the Mercer Mega Blok. So this is a big piece of property that the desk. Owns actually has two parts of Applause spent like six parts of the property, but it looks like two separate blocks on the lights seem to be the Northeast in the northwest corner of Dexter and Mercer. There has been a process by which the city has been soliciting bids. They've done a lot of work and the executive is ready to show Are with us in the public on their proposal to make a deal to sell those two parcels and talk through what's in that package of benefits the RFP. We put out a little under a year ago. I talked about things about affordable housing about Transportation about Parks and Rec facilities in a series of things and and they have something I've actually had a chance to see a little bit of it and I think it looks very promising, but that'll be in committee. Next Friday. The hope would be the root of another committee discussion on that in early September and give authorization for the mayor to conclude the sale of that which will probably happen in late 2019 early 2020. Issues were before the hearing examiner on that. How did the next one is outside will have another discussion of Transportation impact fees next Friday with the assumption that will Hurd by the hearing examiner by next Friday that hasn't happened will make a decision that was put into their finally. Sorry cancel resident. I know I'm speaking into my credibility over the last few months, but I just have a few more things. I want to spread around get some good will thank you. Thank you. Mr. Share of Transportation. I am to be there at your August 16th meeting if I can for the Air Force ones that breathing and definitely there in September. I just wanted to take my appreciation for the folks from Parks and Rec who have been hearing my strong desire to make sure that in addition to the affordable housing components and the community element pieces that we included last year that we have taken every opportunity. We can to build Childcare on site and so I look forward to head that being part of the report back in your comedian and really pretty. We are interested in continuing to address the childcare deserts throughout the city as I look at that region. There's only about for child care facilities in that neighborhood. And while we think of it being any access to high opportunity neighborhood where we think of it being an area where individuals who work in that region potentially up higher wages. We have to also consider the fact that we want to make sure that everyone across the income Spectrum has access to child care in that area as well people were coming in to serve food and clean buildings and to work in the general area. They may also need childcare and also for folks who might have to commute in we don't want them to have to rush home if they're rushing out of the city or to the outer elements of our city and childcare near your place of work as a great way to strengthen our community. So looking forward to that presentation and and appreciate their interest in working with us and the potential purchasers as we think about the amenities that can help the entire city. Council Rock skate. I really appreciate your ongoing dedication and you're not the only one, of course working diligently to create more child care opportunities in a city, and I've heard that the the mayor's office and parks department of been having good conversations with you, but that's different than me seeing you all at the table talking about in a public forum. So I look forward to that. I hope you can make it. If you can't make that one must make sure there was a chance to her for that to be discussed thoroughly the last thing I just want to mention folks. I just passed around the resolution that will be discussing and hopefully voting on tomorrow around the green New Deal for Seattle, and it's a long resolution. This has been developed with largely driven by community members who've been engaged in ongoing conversations with me the same groups who asked us to sign onto a letter supporting the Seattle the green New Deal back in June and came down and delivered that letter with hundreds of the signatures to the mayor's office back in June. Just want to say a few things about this this this Builds on the green new deal that's being discussed and led the federal level by some, you know, amazing leaders on climate in equity that are doing some great work. Despite some really tough times in Washington DC. We know that with the current political makeup of Congress and the president is really no chance at the moment for a green New Deal housing there. But we hope in the coming years. There'll be an opportunity and the urgency around this means that once again cities like Seattle are going to need to lie down this and the federal government will likely follow but we're going to build off the frame or that they set up in my interpretation of that framework is we need to simultaneously solve the climate climate crisis, which is bearing down upon us and a broken economic system that continues to concentrate wealth in the hands of a handful of people at the expense of frankly everyone else in our community, but most importantly I'm low income Communities communities of color immigrant Refugee communities who are continually left behind and we need to solve both. This crisis is simultaneously by following the advice and Leadership of those who are most impacted by both of those crises who are living living the results of failed systems and also have the solution so lifting up the voices of folks on the front line touching up the voices of communities of color immigrant Refugee communities. I'm low income communities and Release Center their voices in this work. There is a real urgency around this because we know if I'm a climate perspective we have about a decade to radically transform our economy and our cities and the same time we have to move very cautiously because it's going to be really easy to do more harm to this very communities. If we don't give them the time the capacity to develop it and the tension between the urgency in the desire to move thoughtfully is a real tension that we're balancing here. And those communities know that and they are working diligently to to move swiftly as possible. But also to move smartly as possible the resolution that I'm hoping we will pass out of committee tomorrow has a number of points. I just want to highlight because there's some significant policy decisions in here again, it's a resolution. So it's laying out of vision. It's not binding in the same way that an ordinance would be but it certainly setting us up to take some actions. It calls for us to have Seattle beef carbon pollution free climate pollution free by the year 2030 back in 2011. This Council passed an ordinance to be carbon neutral by the year 2050 MLB now realizes 2050 not soon enough, but this means that while we've been working very hard doing some great work towards that 2050 goal. We are not even on track to hit the 20/50 go. In fact in the last few years. We've been losing ground on it. And now we're saying is we need to do that same thing, but in just 10 years and I'm being really clear with that means that means that Next 10 years are buildings cannot be heated by fossil fuels that means in the next 10 years are Transportation needs to be 100% electrified which means that purchasing decisions that we as individuals and pulses you put in place, you know, we're not saying we have to be to eliminate all natural gas and all heating oil and all fossil fuels in our cars today, but it does mean the next vehicle you buy I need to think seriously about what that looks like. It means the next furnace you buy next Appliance you buy how are we going to use energy throughout our system and the urgency around that's going to require that we take some pretty bold actions. If we're going to be true to those commitments relatively soon some other things that this resolution will highlight that I think a great strategy perhaps such as green zones, which is a strategy to prioritize public investments in neighborhoods that have historically been underserved and disproportionate burden by environmental hazard. Is it out of there in justices? Explore the creation of free prior and informed consent policies with federally-recognized tribal Partners create a fund and establish dedicated Revenue sources for achieving the green New Deal. We don't have Clarity on where the money would go for that fun. But we would like to set up the fund and its oversight board those also components about workers making sure that we have a stable well paying jobs in the process we support living wage green jobs, I talked about energy. We're going to have to essentially eliminate fossil fuels in our economy in the next decade. We know that there are a lot of people even in Seattle who's jobs and businesses depend on fossil fuels and so that is something that we have to take seriously. We need to work with those folks to have a just reasonable transition. If we leave it to only two years to make that transition is going to be really hard. We've already put it off so long we only have ten years to do it, but we can still do that in a thoughtful way, but we need to start acting immediately their components about access to Food and Health. So these communities are also need Food and Health Access. The resolution also talks about displacement work building on some other work we've done and I'm Waste Management. Essentially. We know that our way stream is a source of about the source of waste and it also asked land pollution. So reducing waste is critically important. So that is a big resolution that hopefully will be passing out of committee tomorrow and hopefully a full Council for a vote a week from today and so colleagues. I know that I'm allowed you probably will not be able to make my committee tomorrow have fun sir and put on that would love to hear that from you. Priests don't believe trees are listening. That's of that let's chat about what a good line of there would be thank you. Cuz I was looking through this in your your resolution is actually longer than the original HR 106 chicken. We like and I'd read about this earlier on the green zones and also the other information that's in here in time for some crazy wonky reason. I've been following this whole green New Deal stuff on the tribal side. So thank you very much. Thank you for bringing this forward and I will definitely be pouring over it and I will come to a portion of your meeting tomorrow. I can't stay for the whole thing. So just want to double-check. There's two main things that I'm really interested in. I'm can you speak to the language around labor standards in this and also anything related to energy efficient buildings of the big policy that were looking at them coming from New York at so the two issues the resolution pretty high level on both those so it definitely calls out that we solve the climate crisis but continued in our failed economic path, we will completely failed we need to do both his hand in hand and we can affect we must do it. That's how it's going to work. And so it does speak to the fact that that the jobs that are created the opera music created in this work needs to be heavily focused on communities and union jobs are really important piece of that. It also talks about in this will see in the ordinance around the ordinance around New Deal which will be discussed on Friday on the green New Deal over sideboard there are vets Italy B16 members of that board as envisioned at the moment and two of those would be on labor Representatives on that heavily weighted towards Frontline communities and folkestone environmental justice work on that committee to so those are two areas where it shows up. I think you ask me another question. I forgot energy efficient building. So it's clearly about about how we have to eliminate fossil fuel use for running our buildings. And I believe there's language is sucks about the components of that and we've said this numerous other time. So one of that is we need to make our buildings as energy efficient as possible. So that uses little energy and in the energy they do use needs to be a hundred percent renewable clean energy. Seattle's well-positioned do that because our electric utility is amazing and is one of the largest first 100% carbon neutral electric utility in the nation, which means But unlike other jurisdictions every time we convert someone from fossil fuels to electricity. We have eliminated 100% of the carbon emissions because of that. The rest of the world has a lot more work to do because their electric grid dirty including people in our surrounding cities, but Seattle is well-positioned in that way. Kathryn Morris cancer brain. Are you going to speak briefly to your resolution you're saving the orcas resolution that you have on today's? Did I miss that on the phone counseling which is an ordinance in this I want to give credit to a marriage or can kiss her team has done a lot of work on this to it's an ordinance. Sorry. It's a resolution calling out the Navy's plan for increased exercises in the Pacific Northwest those include increased sonar testing and also explosive Ordnance has that the federal government's supplemental draft environmental impact statement is clear. This will harm marine mammals and the science is pretty clear on this we know that is damaging and the resolution calls on the Navy to reconsider their actions and mitigate the impacts on all marine mammals, but in particular focused on the orcas, which we know are just on the Survival in the Puget Sound at the moment and the death of one or two of those are posed could be devastating to the long-term population of them is a whole. I've been a saint that one. You know, what is the likelihood that the Navy is going to listen to us? And on the one hand I would I believe that are navy cares about marine mammals and Compares about protecting our Shores and I think there's a half or they can do both this Federal Administration doesn't give me a lot of Hope but I think the Navy is much bigger than this Federal Administration. And I think it's important that we formally and informally from all of us share this with our federal Representatives because they do approve the budget for the Navy and we think that they can get their attention and we can Elevate the voice of citizens there. That's right. And I met with during Holy Week met with a local captain that was here and rear Admiral. They do care saying that came from the right stuff was no bucks. No Buck Rogers and it's similar they care about what we think about them. So it's worthy and I'll support you in this one other thing about thank-yous Seattle City Light and Deborah Smith met with s. After we had the Thomas Street to read a couple of weeks ago and I was just so impressed with I Deborah Smith willingness to say. All right, we've got a plan we're going to take another look at what we can do to increase the art widen the sidewalks working with S. I was just such a refreshing. Yes, we can get there and we can do it this summer know we don't have to have another three years worth of planning we can move so I just really want to acknowledge her leadership. Thank you cast member Bryan for sharing the next several weeks horses that is jam-packed lot of very important work and thanks for being so transparent about what the plan is. We all deeply appreciate that. We should have all 9 today should have a full house and I do want to acknowledge that our flag has now been lowered to half-mast as we've been speaking. So thank you for that. Okay. See you around 2 or whenever a great rest of the day until 2.", "end_time": 4471.1}]}