{"format": "raw", "annotations": [], "confidence": 0.9491759291509303, "data": [{"start_time": 0, "text": "That's it for this. Good morning everybody. Happy March Welcome to our regularly scheduled Council briefing. Today is Monday March 4th in the time is 931 council president Harold excused from today's Council briefing and city council meeting in his absence. I will be serving as President Pro Temp council president Harold will return on Monday at did I say that already March 18th? And so before we begin our Roundtable, I'm going to invite the office of intergovernmental relations come up and give us our our weekly State Legislative report. And you can good morning. You can introduce yourselves for the viewing public. I understand you have like about a hundred and fifty bills in front of us. I think we cut it down to 23 helpful. Thanks for thanks for getting that there were like a hundred fifty and number one being Public Safety number to being homelessness and housing and number three being the environment. We do have a lot of areas to cover with you today, and we've survived now but the policy committee cut off some ethical committee cut offs and we're moving quickly into the house of origin cut off on the 13th, which is next Wednesday. Not this coming Wednesday, but the Wednesday after that so things are moving very fast. And we appreciate you being willing to engage in Olympia given the timing we wanted to be judicious about the dates that we requested your help in Olympia. So given all the floor activity. We're still looking at dates. In March around for the council Lobby days, and I'm going to turn it over to Karen who's going to go over some of those are just sticks before our portfolios. Let's do our relations Charles Schwab. So I'll just jump in and they gave a nice introduction as to where we're at as a 50 of 105 day session. We are still count down the days almost halfway almost there still looking at the 19th the 21st or the 21st for the council to come visit us in a Lobby in Olympia to lobby at work early tide for the dates of Hannah and her office is going to be doing some Outreach to the council members. We haven't heard back from and hopefully we can solidify a date all go at once, can't we do half and half I know that we typically try to do like a big push to really show the presence of the council as a unified body, but I'm happy to to chat if that's if there's interest would rather have everybody show up in the same week as contrasted to half of his not being able to go. I think I'm in the path. We tried to organize speakers or things of that nature is a little bit difficult. There's interest in just having coming down and doing some meetings. I think that we could we could probably make that happen. So I want to support you. Let's just be clear on that. But I know there's one of the days that I can't go and I'm willing to go with everybody has to go on Thursday and I can go on Tuesday. I'd still rather go there not. And yes, I know it's always welcome to if there's a day that they're down in Olympia or a day that works for them. Let us know so we can help organize or organise things that we think would be helpful. And okay now that we've got counselor badge show schedule all the way. Maybe we can move. Sorry, that's okay. So I last week was pistol cut off a lot happening at this point. That was fizzle cut off from House of origin that still Bill tattoo feels that aren't necessarily needed to be moved out of those their budget committee is ATS Transportation Ways and Means of preparation Finance. So there's a lot to tell me five bills lots of movement. So we're still checking along as Lily said March 13th will be the house at work and cut off so bills that will need to have moved out of their house at work in to be to still be moving. So that's process. We know that there's a lot of lot of reference to the rules committee. I know that that's kind of confusing one of any kind of explains the rules process. Is it very little bit between a different chamber? So if anyone wants that information, let me know and I can send it over to you. I just want to Dive Right into education for council member Gonzalez. I know that you had a lot of interest in some of the child care legislation that was going on. So those have all been populated in here. So if you have any questions about those that we were supported with a child care access work Group, which of the know it's a big conversation point and tell her I must have brought that up last week. So we're monitoring all of that the school levies that was Segundo post McCleary fix still up in the air was going to hop in the bill that we were just at 8 to move that was going to move last week didn't end up moving. So we're still touching base with some folks to see what might be the next the next piece of legislation that we will see we going to the pit saying something like that in the budget as well. So still still looking at that currently the numbers being flooded out a catalytic half of 3000 to 3500 for students or at 20% So those the numbers that are being tossed around but we're still looking at that Seattle School District was looking at 35% is that they were at 37% of 4. I'm not sure what number they're going to be asking for it at this point in time, but we can we can check with them about what they need in order to be whole. Another one. I just wanted it flag for you on page two Senate Bill 1566 at the school district elections that is in rules right now. And that would change the bonds below the threshold the voting fresh hold from 60% to a simple majority. Yes at 50% So that's still moving along and we were disappointed to see that our Washington State opportunity scholarship at the local Mash Bill did not Advance other concerns about the the cost associated with that. So we're continuing to work with that. I'm in during the interim a lot of the partners that we worked with a are encouraged by that and really interested to see how local governments can play a role in this higher education conversation and how to find those first two years. So were were or happy that we were able to start that conversation will continue with that over the intercom. I'm environment again Center and I thought somebody was going to be working on it. But I may have lost track but there was a lot of interest on our behalf to really explore some modifications to how a child care facilities in centers are able to be cited in a much stronger Urban lens as opposed to what currently exists which is a framework that is really much more oriented towards Rural and Suburban cities understanding or information about any efforts related to the nitty-gritty details, or I'm under the impression are some rules happening on some of that agency side, but I'm happy to follow up with that in terms of legislation. I don't have a list of bills and Facilitate some of those regulatory rule changes on the administrative agency side and then regardless of that. I know you all have a lot on your plate, but I don't want us to lose sight of some of those administrative rule changes that are absolutely going to be critical for the city to be able to continue to advance a lot of our interest in meeting the affordable child care needs of our residents in the city which includes being able to work with providers who are having a lot of difficulty figuring out where to site child care facilities in the city under the current rules and regulations that apply to them and Atkinson over mascara had followed up specifically around some of that outdoor play Space requirements. We met with the Department of Children Youth and families and talked about you know, what do we need to initiate legislation to address those concerns that are specific to providers in the city or in urban areas. Generally they've actually agreed upon some rule changes with Coalition Partners. I believe in partnership with s Caillou nine-to-five around Alternatives such as if I have child care provider can identify a safe route to a nearby park? There's some other Provisions include and I know, some of her mosquito has been reviewing those as well as we can send those over to you as well. But I think that they've come to consensus with the providers as well from understanding. Thank you. Thank you madam. President great question and I have the same question earlier about whether or not we need legislation. I'm happy to have Roi our team following the rulemaking closely. It does sound like our Community Partners and you mentioned one sau95 but a few others are pretty satisfied with the internal rules so that to the extent that we can get that wrapped up this year my understanding in terms of where we're at with the rulemaking is I believe that the 102 process and 103 should be coming soon. So that means looking that I am excited that our Community Partners across the board have been feeling pretty positive. So I think it's also internal square footage. Also an environment starts on page 3 Reference last week. There's a lot of environment legislation that's moving through this year which were really excited about. So there's a lot of bills I will not go through all of them. But some just highlights. I wonder why I can go there if you'd like to 100% that moved out of the Senate on Friday, which we were really excited to see our transportation electrification bill which shoe again with the Authority for City Light to be able to offer some incentives for grading electrification infrastructure was moved to the rules committee. We're still we're looking at some of the plastic straw bans and some of the single-use plastic serving. We're going to move forward a lot of stuff on Recycling and solar I'm going to put quite a few new builds in here and we're going that work has quite a few task force that were Bills ever perform the task force this summer. So I dropped the ones that are still moving into this legislation will we should regarding like salmon protection and vessels and things of that sort. We should go on the Run. Set this council is we're all time at hawks. Just for the record. Can I ask you what what what is that going to do the task force? I can give you the specifics. I can send it to you. If it's in order to protect the supply of that. That I just didn't know what task Force's going to do about that. But okay. Thank you. Cancel my remote. recommended General government, there's one in particular. I wanted to highlight for you on page six that says the municipal B&O tax apportionment formula substitute House Bill. 1403 s a s Works quite a bit over the last year or two years with Department of Revenue Association Washington City is an Association Washington businesses in order to put forward recommendations to simplify the apportionment. Formula. They all came to agreement is past October at there was a lot of effort in order to preserve the revenue that we have coming in from the piano. So everyone seems so I think for the first time in a long time that we had something to kind of sailing through him piano, but that was a really big deal and if he asked a lot of very good work on that, so I just wanted to feel like that and say it's and thank them for all the all the stronger thought they were doing her bag. So I wanted to highlight the Pacer bill for your urm. The resiliency loans 1796 on page 7 is still moving that was referred to the rules. I'm working a lot with the ballots worst that still moving along to have all the ballots paid the postage paid for the balance on page 75063 in the Washington Privacy Act status of the big Bell from Senator Carlyle at he's doing a lot on this and that's about what user data and how that's being distributed in the choices that consumers can have with their data. So shocking that there's some components about facial recognition that we're looking at right now. So if we have lots of lots of Bill still going through and if there's any anyone in particular that you want more information on please let me know. I have a quick question about the substitute House Bill 1796. That's the one that you just mentioned about the Pacer program there anything we need to do to keep that moving remember that? Representative Pettigrew and I have been working on something similar for years and it just sort of dies about this time of year. Is there something we can do with represented Olio's to bring more attention to orders or anything that you see that needs to be done? Yeah, I think actually working at it right now. Julius taking it pretty pretty strongly on this and I know I think I'm pretty sure how to spell but I know that he's on the rules committee so ask him to pull the bill from rules in order to help move it to the floor. So, I'm sorry. What did you just say I'm saying that Pettigrew has recognizing that he has played a large role in this. I know that he's a sponsor on this bill that I think that asking him to potentially pull the bill from the rules committee in order to allow it to advance to the floor. I think you're suggesting that we do that that we make that request. Yes. Okay, would you work with me after I'm happy that we do the right thing and use the right words to make that happen. Yes. Thank you. Thank you. Okay, under Healthcare. So starting on page eight. I wanted to highlight a couple items actually on th9 the following page. I wanted to highlight the friends of mental health care. So 1513 n 5444. This is the True Blood the government requested the governor requested like legislation for the settlement agreement this me to buy parties with a lawsuit the house what hearing on February 26th, and them is an amended and passed out of committee on the 28th that sits and rolls will keep you apprised of that. That'll be a big big process moving forward. So we're looking at a 15-13. It's the middle of page 9 Kind of top middle of his ninth and then the next one below 15 23 and 54 5526. Sorry. That's the public option bill. It's not our government Governor requested a bill which includes establishing a public option. They call it Cascade Care standard sanitizing. I apologize. I haven't had my coffee yet. I think I had too much earlier than I just kind of walked away design for health insurance plans for the exchange. So the house had a house first airing on House Appropriations this weekend with Katherine committee on the 28th on its in-house rules right now for further consideration and the Senate version had a hearing in Senate Ways and Means Committee on the 28th and was passed 27th and 28th. Your substitute House Bill 1513. It's her money for us in the city of Seattle to be providing more beds and more Mental Health Services coming out of this. I can even updated version of that too. I I would love to check in with Aaron JJ car seat estate contract lobbyist and get a bar end up. If you can just send the signals whether it's to Jenkins or whoever this is something that we all know within the city of Seattle that we need is more beds. We've got a few now, they're opening up on big as hell. But that's it our dedicated to people with mental health issues behavioral health issues. So there's money coming out of this particular bill for that work. It would be terrific and it also ties in really nicely with the low Acuity project that we're working on with our First Responders what we hear from everybody if they need places to take these individuals other than Harborview Hospital or are jailed. Clearly we need to get some services that they need. So this is great. We've got some State legislation. We just need some resources and some help write. Thank you so much. And the other questions on health care. I have a quick one on 15 or House Bill 1638 the vaccine-preventable disease the repealing the personal belief exemption for measles and mumps. So that's on the house side. When when was that expected? What would be the trajectory on this one? I believe so we need to be honest and be housing-related. Also, I'm not entirely sure when we'll hear this on the little be heard on the house floor, but we can keep you updated when that happens. If you generally don't get a lot of that before it does but we can we can make sure to provide once we have it. Okay, so under housing and homelessness. So I'm on page 10 a towards the bottom 1406 and 5646. That's the local-option banville that we continue to really work hard on. That's one of think the big Coalition strengths that have been put forward this year. There's a lot of people at the table and they have been since well before session started we continue to see that moving forward quickly, and then I wanted to touch on the tenant protection. I wanted to let this is that fit this is 1656, which is at the bottom of page 10. So I wanted to let this just be back on for everyone. This is important for the Macarena with and no cause evictions landlord to be required to provide legitimate business reason for ending tenancies extend a 3-day pay or vacate vacate notice. This is really important to keep in their homes. I'm going to let you know that we heard from her this weekend the language that you worked on with her will be included in the striker. So, thank you so much for your leadership on that. Vanessa wanted to let you know that the the are sorry the Super Bowl which is 59-46 on page 13. That is on. 4613 yeah, that's the way we working with Senator win on that would allow its would allow cities to put in on sanctions and can't send on shelters without with bypassing the CPAP process still. Do you know within reason still by bazzi multi-process? It's going really well. We're really hopefully not putting too much steak. Unless I just got some great news coverage in the Tacoma News Tribune talking about Camp second chance to the residents came down and testified about how their Camp functions and how were they able to get people back on their feet and this bill would allow us to have a lot more spaces. Are you able to go between you know being on the street and into permanent Supportive Housing or wherever they need to go? You went really fast. Sorry. It's 5946. It's the top of page 13 at the last bill. I'm on my caffeine intake next time better. And I'm going to go ahead and start please go ahead and how the income eligibility threshold is handled in the different bills. I just want to talk to that only one of them is advancing still it is 1181 I think and what page page 10 and so the way that they adjusted it they they did is a percentage is going to be like different tiers and it's going to be a percentage of the county median income. So I'm still trying to understand what that means. I couldn't save going to be three three different tiers, essentially if there's a choice and how that choice is made but that is the version that's looking like we will continue to move forward and posted on that one. Deborah and I'm going to go ahead and start in the public safety section muster any additional questions in the housing homelessness area. We have a substantial package of firearm bills that are still moving through the process and I know many of you have been watching those closely including Senate House Bill and this is excuse me on the top of page 13 substitute House Bill 1010 representative Sons proposal that would provide wsp more flexibility to destroy legal firearms that passed out of House of Rights and duties Sherry on the 18th and is currently on the second reading calendar a ban on high-capacity magazines, which I know is a high priority for the Council on the bottom of page 13 sponsored by representative Valdez substitute House Bill 1068. Also made both cutoff deadline is also in rules and then moving over to page 14 representative Jenkins bill that would require Law Enforcement Officers secure Firearms when responding to domestic violence calls. Passed out of committee on February 1st and is on the second reading calendar along with substitute House Bill 1739 at the bottom of page 13 as a band or a proposal to ban undetectable 3D or ghost guns also sponsored by our own representative Valdez, and then I'm finally in the gun responsibility section. I'll just highlights under Palumbo's proposal substitute Senate bill 5174 on the bottom of page 16 that would put training requirements in place for a concealed pistol license, which also survive policy and fiscal committee cut off sun is currently in rules. Which one I'm sorry is Senator Palumbo's substitute Senate Bill? 51 74. And I just want to thank you for your hard work. We've been doing this a city of Seattle had passed it a proclamation a resolution. And then we were back in Washington DC meeting with a senator Murray and Center to Cantwell, but I'm really proud of the this is a you have the substitute House Bill 17134 Native American women missing women. Thank you very much for working on that. I really appreciate the work you guys are putting in on that. That is something that we've been working really close with with the Seattle Indian Health Board and call are Abigail alcoholic and the other domestic violence folks. So thank you very much. I appreciate that actually switch sections and move a little bit of head since this is one that we have under our civil rights and safety net portfolio am still struggling to find the bottom of page 16 substitute Senate bill 5174. Thank you. And then in the area of our protections for victims of sexual assault in the middle and sorry jumping back. I'm doing kind of sections here, but I will always list the page number so that you guys can look at the specific Bell. But in the area of protections for victims of sexual assault in the middle of page 13 House Bill 1016 sponsored by a representative called the air would connect survivors of sexual assault 2 appropriate providers and put penalties in place for any hospital that does not comply with the new requirement of connecting victims with a community sexual assault agency within 2 hours of being contacted this Bill had an amazing boat in the house. It was passed unanimously and has since been referred to Senate Health in long-term care. And then on the bottom of page 13 representative Entenmann proposal that she put forward would authorize a warrantless arrest when someone violates a no-contact order issued in a process. Tuition or trafficking case House Bill 1055 also passed the house unanimously and was heard and Senate lawn Justice on February 25th you searching for missing it? Yes. Sorry on page 13. Is I believe on down and got it. Thank you. Sorry around a little bit back to the top of page 14 a bill that many of you have asked us to watch closely and advocate for that would address the state's backlog of untested sexual assault case substitute House Bill 1166 sponsored by representative or while past House Appropriations on February 28th, and was referred to rules and then down to the middle of page 14. Representative Griffey notably Republican has a bipartisan bill that would extend the statute of limitations for rape in the first second or third degree and also eliminate the statute of limitations for rape or child molestation. That bill is also on the second reading calendar. And lastly. I know council member has to watch this closely. There are two represented pellicciotti proposals on the bottom of page 14 House Bill 1382 that would Grant immunity from prostitution charges to those seeking emergency medical assistance and would also change the second conviction of patronizing a prostitute from a misdemeanor to a gross misdemeanor and both of those bills have been offered to rules. Finally, I'll go to this very quickly and now we're almost out of time under silhouette civil rights and safety net. I wanted to highlight substitute House Bill 1713 on the bottom of page 15. This would require the Washington State Patrol to develop best practices for law enforcement response to missing and murdered indigenous women. This is the Villanova councilmember Juarez has worked very hard on everybody else was stablish liaison positions within the agency to build on stronger relationships between government and Native communities that bill is also in the rules committee sends her cell down his proposal on the bottom of page 16 substitute Senate bill 5164 would make victims of human trafficking eligible for medical care food care and Cash State Assistance programs if they do not qualify for federal benefits. And I'll legislation that would eliminate the death penalty that continues to move right along it passed the Senate 2299 Health member back child's birthday and it's been referred to house Public Safety. So I think that was a present from her lie to you. I think so too have finally they keep Washington Working act on the bottom of page. 89 Oak house number Gonzales has recently sent a letter to the committee about the importance of this to the to the council that would prohibit state agencies from using resources to assist Federal immigration immigration enforcement and data sharing surveillance programs or any other laws rules are policies targeting Washington residents based on on the basis of race religion immigration or citizenship status. That is also that is currently enrolled as well is the keep Washington Working act on the bottom of page 18 and lastly legislation that I know is also important to remember Juarez that would establish the Washington State LGBT. The rest of the council as well as the Washington State LGBT commission substitute Senate Bill 5356 is in the middle of page 19 and passed out of ways and means on March 1st at rules. And with that I will turn it over to Charles Schwab who's going to touch on some of our transportation priorities actually before you do that. I didn't notice this listed on the anywhere in here, but there is the Statewide initiative around secure scheduling legislation. That is Statewide. Can you tell me a little bit more about where we're at with that? I have some concerns. I don't believe I know it was a mended significantly in committee to exempt many rural counties and there was there was some concerns from The Advocates around that I don't believe it made the physical committee cut off so although bills never Completely dead. I I don't sense that is moving forward any longer this session. It's too bad. I'll do Transportation real quickly in that same vein that sound transit bills that we talked about last week a council member Johnson brought up at the moment. They have not passed out of committee doesn't mean that they won't be back. But at the moment they are understanding the Schwab in particular one of us bills House Bill 2123, which would reclassify the schedule for motor vehicle excise taxes and would result in a 640 million dollar hit to the Sound Transit 3 budget has been listed as necessary to implement the budget a K & T I B which is an indication that though it is not moving out of committee. It is still on the radar of house leadership, which is of course disconcerting to Yours Truly here from counselor mosquito on the scooters. And as well as that industry, but a really good cooperation with the cities and there are few amendments being offered but at the moment it's it's it's very much what we were hoping it would be so thank you madam president. Thank you so much for your work on this and I did have a chance to connect with folks in the Executive offices will appreciate their interest in making sure that we had a path forward on the scooter Bill and keep us updated. We want to make sure that folks understand as legislation moves forward. It's it's hard to undo a position of authority been taken but I think that on this one you all have clearly communicated to our state legislators are interest in seeing this move forward as a city. So if we need to do any clarification or touch base with any specific legislators, let us know but I think that this will be a good way for us to ensure that people have alternative modes of Transit and that they're going to be safe while doing it. So thank you for your work on that. Another one. I was going to highlight was the automated Traffic Safety cameras that we're really happy with how this is moving and the way it's going so far and this would allow us to take it those who are blocking the box, right? And also, okay, we currently have legal Authority that give tickets in certain blocking of the Box situations. No not with a camera with a camera. That's not what I can give you tickets. However, they have to actually see it positioned themselves there and then engage in that enforcement what this does is it allows us to automate that enforcement capacity, which is that much more efficient way for us to enforce this type of traffic offense What was the question I didn't hear it it do with buses that are blocking the Box ticket as well camera enforcement. What happened to you this morning on your commute in? Can I ask for one other question? I didn't Senator Carlyle and I have been talking about legislation that he had proposed early in the session around the retirement system authorizing the city's retirement system to join with the state through a lot of discussions. I think it was Tacoma Spokane and Seattle. That would be given the authority. I haven't heard a thing about it for the last few weeks. I believe it did not get out of committee. I think at one point it was shifted to maybe having it be a study of some sort, but I don't believe it to the dance, but I will confirm that ended many conversations with Senator Carlyle about that. He's very interested in continuing to work with you on what opportunities there might be. But I do think some of the research that you suggested is a good path forward. OK, I think there's significant resistance from the city of Seattle's retirement system folks to say they don't want to join the state. So but I had asked for is a rigorous study about what the pros and cons in the benefits would be both to the retirees and two current employees. But that said if it didn't pass out of the of the committee, there's not a lot of momentum to even do that study because if we don't have the authority to do it the question is should we invest in that money or invest in the Khan research so and I would say and maybe we could follow up about this offline, but there is no very an interest in continuing work on that and I think perhaps to the interim if if you are still interested in that research, you know along with our them are Partners in the retirement system. We could look at you know, something different language for the next session is great. Thanks. Let's let's talk about that afterward because it's pretty clear on what people are looking for in terms of they want to have you no good return and be protected the state program offers a broader range of investment options and it spread further so that it reduces the risk to individuals, but that said people that are on the board feel very strongly that they want to have a vote in it that they want to be present. So happy to work with you and appreciate it. I'm so I can see she's getting you guys very much. Sorry madam president. I was trying to find the bill number. You may have already mentioned it specific to labor. There was a few bills that were going to allow for others to unionize. When was related to the legislative assistants. I understand that that bill also died in committee last week, which is unfortunate. We're also interested in tracking the bill that would allow for the Assistant Attorney General to unionize. And is that on our list already? I don't think we have included in this report, but I believe that bill still moving to the process. Let me double-check and cook them that, you know would love to make sure that as many individuals is iPhone the matter what sector they work in or degrees. They have that folks feel that they have the ability to collectively bargain. So unfortunate that the LA Phil didn't move forward if the AAG Bill gets additional support and we can lend our support that would be great. Thank you. Thank you. Thank you guys will see you next week. Okay. Bye. Okay. So now that we're done with our State Legislative update. Let's go to our briefing before I talk about mine. I'm have a scripture to read from the council president the regularly scheduled governance equity and Technology committee meeting for Tuesday, March 5th at 9:30 has been rescheduled to Thursday, March 7th at 2. They're two items on the agenda. We have sod Bashir he is going to be nine billion for the chief technology officer the director for the sale information technology department appointment. This is the second committee discussion and the committee is planning to vote on the appointment and second. We have one ethics and elections commission cancel appointments. Looks like we have a couple appointments going on. Information technology and the ethics commission from D5 the Civic development. Not just E5 my committee the Civic development committee will convene this Wednesday, March 6th at 2 on the agenda or for appointments app for the Seattle Center advisory commission, which is very key in light of all the girls that were seen in Seattle Center in addition to a reappointment of mr. Robert Nelms for the Seattle Center Director will also have here from the office of the Waterfront which will present their 2019 work plan and the Seattle parks and recreational presented overview of their Community Center strategic plan including implementation updates in 2016. Spr, completed a community center strategic plan to guide Park District investments in community center operations. The plan was informed by demand study that demographic research best practices review and public Outreach. So we are excited to see what s p r i Has come up with and what the next steps are. Lastly we have two ordinances up for discussion and a vote. When is the 2008 Levi inflation contingency use for 2019 projects? And we also will be discussing the Occidental Park Timber Pavilion donation. And I think that's that's all we have for my committee customer badshah items today are Finance neighborhood committee and item number 12. This afternoon is landmarks commission regarding the Broad Street substation landmarking ordinance that will come together. And for those who are wondering where in the world. This is it's down by Seattle Center and there's a couple of buildings there that will have Landmark designations and continue the other item that we will be voting on today is a resolution and thank you councilmember herbold for bringing this forward. It's a c i p a capital program watch list. Have large complex capital projects that we are going to have enhanced quarterly review of thank you for doing that. And I believe you're bringing an amendment today that would put it back into the finance committee quarterly. So look forward to working with you on that and happy to be doing it. I think it's a great idea and it just puts a little bit more juice into the work that we're doing. And also I just want to mention that at our committee on Wednesday. We had an excellent presentation David Jones are auditor was accompanied by the public health researchers and the University of Washington researchers reporting on access to healthy food and the food bank Network in Seattle and I want to acknowledge for at least the umpteenth time that council member Juarez was absolutely right that there are few were food banks and less access to healthy food and D5 than anywhere else in our city and the work that He's done during our budget last year and going forward to make sure that food banks get get the food that they need but also acknowledging the really great service that food food banks provide. It's not just food, but it's things like being able to get information about utility discount programs are Orca cards, and this is true across the city. So I do want to say thanks to the researchers both at the UW and our Seattle King County Public Health researchers. They did an excellent job. This is the second of three reports. The one that we did in the fall really focused on the cost of beverages into I think many of our are surprised. We're raising more than was anticipated. But one thing that it we're not taxing is Diet Beverages and diet beverages cause of gone up in most stores are many stores to equal the cost of sugary beverages so some He is making some money there and it's not getting taxed and I think it's councilmember O'Brien. I just want to be able to talk to you more about that this year. We will have a third report from this committee about actual consumption. I think what we're seeing is that we're raising more tax money than we had anticipated but consumption at this point does not appear to be going down. So it'll be another issue for us to discuss from a policy standpoint. Thank you very much in Services Equitable development of interest rate comedy. There are three appointments of Calvin Jones Gene Owens, Michael Ocampo to the city of Seattle renters commission, and there's a resolution that urges that the mayor conducted inclusive transparent candidate search before going ahead with the nomination for the Human Services director, and I'm passing around copies of Memo that were all at to email it to you to Last Friday listing key actions Communications and Community input into the director nomination so far. The next meeting of the Human Services Equitable development and renters rights committee is scheduled for a special time on Saturday March 16th at 1 p.m. At the New Hope Missionary Baptist Church, which is on 124 21st Avenue in the Central District at this meeting reveal this does Equitable development in a Central District apartment building called The Chateau Apartments. This building has 21 units including 14 that are contracted with the US Department of Housing and Urban Development or Hyde to be Section 8 affordable units, the the name of this program. The heart program is project-based Section 8 housing assistance payments contract. This is a little different than the Section 8 housing Choice vouchers, which we are often talking about renters are assigned a voucher, but then they need to find a landlord who accepted which we know is notorious for take months or even years to find in this program the Section 8 subsidies attached to the building. At the end of 2017 a real estate company named Cadence purchased the building to demolish and Redevelopment into what it cost efficiency dwelling units, whichever one room or studio apartments last December Cadence announced that they would cancel their contract with hard for these 14 Section 8 units at the end of this year. My office has been working with the tenant in the building but also discussing with city council turn to start and also City departments in 2002 part of construction inspections and the Bremerton Housing Authority which happens to be the Housing Authority in Washington state that oversee this particular HUD program, and we want to make sure that if the tenants are displaced from their building them is not be displayed on the neighborhood and that they're able to find affordable and accessible homes in the neighborhood and many of them are people in their 80s and 90s. They live near their caregivers Medical Supply. Structure and other support structure. Some of them are being looked after by their younger generation. And so all of that will be disrupted if they are pushed out of the neighborhood and I want a more dangerous that I'm happy to share also the specific documentation from hard which describes what the process can be that the city can follow in order to make sure that these project-based vouchers are transferred to another building or other housing unit apartment. Is it possible to possible to transfer to another building? Do you have one of the tenants who spoke eloquently about the the issue their face and then there is one family for example with two children and another one was on the way and I think that might happen already. And this is a family who has experienced a devastating bout of homelessness. They were in their car for three years. They've just moved into this unit. And now they're devastated to hear that they're about to lose it. So I think a lot of that steak. I think I may be meeting on the 16th. We will hear from those tenants and discuss how they can make sure that they don't lose access to the housing that they need lastly Sartorius. I just want to highlight a point that was made in a Seattle Times article last week about the story. This is a proposed proposal that would build an additional or build new units 73 units and total but it would remove 21 units these 21 units are currently affordable of the 73 units. That would be built under. Mha the man Troy Housing affordability program. Only 5 with have to be affordable if replaced on site on the Seattle Times article makes the point that my proposed housing displacement mitigation ordinance would not cover this particular area and I just want to highlight the fact that I'm as proposed the house a mitigation displacement ordinance focuses on areas. Better within High displacement low access to opportunity areas. I think it's very worthy of a discussion of whether or not we should expand that to include High displacement opportunity areas, which this is one of those areas. So that would help address the significant loss affordable housing units with this development. The OPC D heat map is the next meeting of the select committee on homelessness is scheduled for Tuesday, March 12th at 2 p.m. That is a time that is usually reserved for the Human Services Equitable development committee. But since we're moving the committee meeting to Saturday the 16th, as I mentioned that time slot has now become available to the select committee at that meeting. We will discuss the sudden decision by mail darken to tighten the closure of the Schererville shelters after June and then we will all Discuss the impact of rents and evictions on homelessness and my staff will be sharing more detailed teeth on a Saturday. What time was that? I didn't get the time at 1 p.m. Okay. Thank you. Comparable and I do want to the record. I I heard you reference a proposed closing of share shelters in June. I think we all received information from our Central staff as well as directly from executive and I've also had the opportunity to have a conversation with folks from hsd there is no plan closure of shelters in June and it is true that they've been given I'm only a half year contract and they've identified specific areas of desire to improve Improvement in that is increasing the numbers of people that share will participation hmis they have a large number of people that exercise their legal rights to opt out and HST wants to continue to work with them on that. And that is what I believe has been a sincere statement on the behalf of HST is not that they are intending to and provision of the service in But rather that they are trying to work more closely and I'm I'm going to be doing some of that work also trying to facilitate a conversation between share wheel and HST about how to improve the numbers of people who are participating in the hmis system. So just to make clearer than the shoulders are not closing in June. There is no proposal for the shelters and I think it's a reasonable concern to have that the that the contracts maybe not Revisited by that again, I believe that HST is being sincere and using the Contracting process as a way to incentivize change practices. It was my understanding customers want people who use a child doesn't also the people run the shelters. So I'm as far as items on the full Council agenda today from the Civil Rights utilities economic development in arts committee. We have to reappointments to the museum Development Authority one is a reappointment coming from the MDA governing Council and the other is a reappointment coming from the Seattle Art Museum. We also have two bills from Seattle Public Utilities that we will be voting on today in full Council one is something referred to as the Seattle datum point and a datum point is a reference point used in surveying and construction to provide a known location for measuring the position or height of an object in relation to the datum point. The data points were last updated back in 2013 and the legislation would eliminate the need for future code update each time the National geodetic survey adjust its datum. So basically we used to do it locally now it's being done nationally and we will no longer need to continuously update the the datum point because it will automatically update in the Future II piece of legislation is a contract with waste management for construction waste collection Services waste management is the current provider was selected after an RFP and the new contract is for 6 to 10 years and will begin in April 2019. If I prove I can remember Bagshaw reference to the watchlist resolution is coming forward. This is something that we've been working on for a while now together with the city budget office and the executive we have established criteria for the types of projects that will go on the watch list and a process for the Decorative to report on on projects on that watch list and this resolution itself contains the 20 or so projects are on the watch list are mostly projects from our large Capital Apartments parks department Seattle City Light s. NSP you feel free to take a look at the Westham. It is included in the resolution itself. And we had a great discussion and committee about how the council will in the future receive the quarterly reports and counter bagshot graciously agreed to hear that in her committee moving forward. I think it's important to memorialize the council 10th for hearing these so that this doesn't just become another report on the shelf and I think customer bagshaw's plan is that when we have these quarterly meetings that we would also invite If it in those cases that they're not that they are not already members of your committee. We would might invite the chairs of the the Committees that have watched this project to participate as well as you brought that up and I thought it was excellent that if it's a transportation, I'm just under the current configuration of his Transportation will reach out to council member O'Brien and if it's something specific dealing with land use will at least give the and give early enough notice so individuals can that tanned if they're interested in doing so he created some criteria using those criteria the executive made some recommendations for watch this project and then Central staff work with all of you to identify additional projects that you wanted on on the last saw this is again Cobra developer with with executive in particular the budget office whom I think for their work unless there's no civil rights utility economics. Menards committee meeting this week as far as Regional committee that are coming up. We have a regional water quality this week as well as I believe Labor Management leadership committee, and then I want to thank everybody for in a very short notice signing on to the Seattle symphony's octave 954 macian was a really fantastic open house this weekend octave 9 is the new space where soundstages to be its multi-sensory interactive and I'm frankly, I don't have the words to describe it. It's really fantastic and there will be another open house in April specifically family-oriented. I think it's April 12th and great for folks to check it out. It's a really do space. And then last week Thursday last week. There was a meeting about the Lowman Beach Community project. There's a seawall removal project there that the parks department Seattle Public Utilities has been engaging with neighbors about and it's a really high priority project for our off for the county and specifically focused on salmon restoration. We've talked about this a little bit prior when the council receives some grant funding from the flood control district. There's I just want to give voice to the fact that there are concerns that the residents who live abutting the seawall have about the removal and the need for mitigation. I'm really appreciative of the parks department in continuing to meet with those residents and working through those issues. Thank you. This is an ability and transportation committee doesn't have anything on this afternoon's agenda. We do have a committee meeting tomorrow afternoon for items. I don't want to highlight on that. We're going to get an update from a pine protected bike lane design Workshop group that appeared to be given by Joel sisolak from Capitol Hill housing has been part of that process. We're also going to get it update from Seattle Department of Transportation on the vision zero progress report. That's our commitment to eliminate all fatal and serious injury incidents in the transportation sector across all Transportation modes in the city by the year 2035. They were going to have to ordinances. The first is going to be will consider to Grant University of Washington permission to maintain and operate a pedestrian tunnel under and across Northeast Pacific Street near the hospital and then we're going to consider an ordinance relating to the Delridge. Relating to the lifting the Proviso on the Delridge multimodal Corridor project visualizing exactly where that's at. I believe it's so you know where the triangle is between you. There I believe it's between the triangle and the hospital across Pacific Avenue. So it's west of not like Avenue connecting I believe is a parking garage in there, but I don't have all the details. We just want to know there was the second community meeting is Harbor Freight in Crown Hill for a community planning process. They're going through a really great turnout. I'll tell you that some of the themes that continue to come up as a desire for that Community to have What they described as kind of a main street right now 15th Avenue is a major Freight and vehicle Corridor and reconciling that with the type of pedestrian environment. A lot of folks want is a challenge is a challenge we have been in a lot of our communities around the city one of the concepts that they're exploring is creating a Main Street just off the arterial similar to I'm opposed to trying and up on Aurora Linden just up there that be just west of Aurora. And so there's they're working on that. They're really interested in and a lot of Redevelopment coming to their neighborhood because they're excited about seeing that neighborhood transform, but they're they're concerned about what that transformation looks like and really want to make sure it feels safe in the Austrian friendly environment that there's easy access to the transit and making transfers a lot of the same concerns that I think we here. The process will continue on for a probably about another year but they're working I said recommendations along those lines. I want to just say thank you to customer Johnson for my absence last week helping with some of the indictments around the Crown Hill and mha and of course of congratulations on a big step. Obviously. There's a meeting about the pike-pine corridor and the bike Lanes. Would it be possible for you to bring up the 4th 5th and 6th connections now as well 4th 5th and 6th Avenue cuz I noticed and some information that came from a star that Fifth Avenue and 6th Avenue or going to be turned into these bus quarters. We've known about that. But what are we still doing? We've been asking about having the network completed for safety reasons for people who ride bicycles and motor scooters down there. So we just like to know what are their plans? What are they doing with that? Because she couldn't check the bike lanes are designated areas that are better than Cheryl's what I saw was that the bikes were going to be in the bus lanes and especially when there's more buses that might get a little bit dicey. I share your your desire for better when I was saying kind of north-south through the city access, I believe tomorrow. We're just going to be hearing from the individuals who participated in the work group on the pike-pine corridor. And so other than how Pipeline and interacts with some of the north-south access. I'm I don't know that those individuals I have some expertise but what I can do if if there's hooks mascot of the table, I can certainly flag that is something we have ongoing concerns about and To plan to have someone of the table in the future meeting. We're going to want to talk about all the protected bike Network the downtown by the network that we passed a resolution on last summer and their work is slated to be largely complete by the end of this year and get an update on that and we know that that that resolution did not include significant facilities on 4th 5th or 6th in part because of concerns around the the ongoing Seattle squeeze and what that means in some of these changes but we know that that we need those facilities to until we can have a conversation about that time. If you'd like to commit to doing it, even if it's a year out it would be very helpful and it doesn't have to look like 2nd Avenue as far as I'm concerned if it's Good morning, Madam president. Good morning. Thank you so much for this morning's morning briefing from the housing Health Energy and workers rights committee on today's full Council agenda forever. I am handing out a copy of a resolution that I will be walking on for transmittal to the full Council. I'm not suggesting that this be a full vote today. This would be a walk-on with the hope to get your feedback within the next week and then to have a vote on this in at least two weeks on the 18th of March. So very Madam president this resolution helps to ensure that our full Council has a good understanding of the process used by the executive to forward and to consider a nomination for Department directors. I want to be very clear that this is not in competition or does not conflict with council members wants a resolution for today. This is intended to be a stand-up. And separate from that process. I think that the conversation that has been raised over the last few months raises good questions about the ways in which we can do a better job in terms of clarifying our expectations and the process not just for ourselves this council members in the legislative body, but for the full community participation as well understand that in some cases, there are legislated apartments that are relatively small in size. Maybe there will be a process. That is very maybe there won't be a process that all Scopes and an engagement with our community. We want to make sure that there is a selection and Confirmation process that's transparent and inclusive. So the resolution in front of you build off of council member licata's resolution from 2007 and helps the council understand the process that these executive is using and what forms of Engagement have been held what it is intended to outline. What engagement sessions are to be scheduled whether a racial Equity toolkit was used who had a seat at the table? I want to be super clear with folks that this is a document that we have been working on over the last few months with some feedback from Community Partners. I'm happy to have been able to build off of council member licata's previous legislation things as well to counseling for her some of her input and seek input from all of you so far this includes a list of Engagement and input sessions including dates and groups represented a memo describing the process to identify strong candidates. The resolution also requested the council can consider evaluating the confirmation process by looking at the use of the result of racial Equity tool kit and the process and the effort to have constituencies in groups that would have been directly affected by the services of the department be included in reviewing potential new candidates. These groups would include staff. That work closely with the department and the business partners. So as you can see, I believe that this resolution is helps us in our quest to ensure that we have greater transparency inclusion and understanding and that we have a better understanding as well on the diversity of the individuals who've been putting forward up the nominations and that we engage those who are directly affected by the Department's potential new director. We have some great opportunities to engage with a really diverse body is when it came to Seattle City light's appointment for example, and it was an excellent example of what we'd like to see when we pulled together different stakeholders though. I wasn't involved in s. Or the it confirmation process the individuals who sat around that table as well really talked about a robust engagement process in which there was a diverse group of people who not only helps us Alexa final candidates, but we're there to do the interview process and to see a broad array of stakeholders come forward. Is Nemours Thule racks iPad the kids to Community Partners? I think it helps us get a better sense of how those conversations transpired. So in conversations with many of you this is forward-looking. It is for the Department directors going forward and again is not intended to be in conflict with the resolution considered today. Yes will be working with law on this. It's actually hot off the press. So there's a chance things in here that are that are new to me as well. As one thing. I would suggest is that if you see something that is missing or something that you like to clarify the folks could let us know what those amendments are by Thursday of this week. We will aim to get that and put and get feedback from La by the following Thursday the 14th. So that will give us ample time but between law having a chance to review any new changes and as potentially voting on the 18th and 2nd, and I really want to thank you for giving your colleagues in Opportunity. I think it's the height of good government. When you give your colleagues and opportunity notice and opportunity to question to discuss God forbid we talk to each other and and then try to let you know make something good something better something that doesn't violate our Charter or our responsibilities and is also a very clear about our role in the legislative branch. As you know, council member council president Harold and I had long discussions about what would be coming over the transom. And so I want to thank you for doing that. I think that just takes down anxiety level it gives my office and me an opportunity to look at what what you've done. I like it that you've put in here. I'm looking mainly at lines 10 through 22, you know at a minimum following particular things by the executive and some of the stuff they do. Anyway, I can we do anyway, that's krantzow to codify that give us an opportunity to talk to Legal. Look at our Charter. What are responsibilities are have a collaborative process? I really appreciate that. So I want to thank you for that. Absolutely. Will thank you madam president. And today I think is a great opportunity for us to initiate the discussion moving forward again reiterate for folks. If you do see Amendment ideas or you have a question, let us know by Thursday the 7th of this week and that way we can make sure to get it to lie and get a final by Thursday of the 14th so that we have an ample time. Thank you. I have a couple questions as well. I understand that you're going to walk this on today for purposes of amending the introduction referral calendar. Where will it be referred to? Thank you for your question. And I defer to you all in the process my understanding from talking to Central staff was that I could introduce it to not have a vote on it. Hold it and hold it and have it refer to full Council still but not have it voted on until the 18th is my desire. Okay, so this will be a resolution. Will be taken back up in a couple of weeks. I scrap the full Council as opposed to being referred to a committee for additional committee work. That's correct. The grace of the council second question I have is that I noticed on this draft of the resolution that it does not have the concurrence of the Marriott. Have you had an opportunity to have conversations with with executive about a resolution of which contents would be a layer on top of what are her executive powers and Authority Under the charter? Yes. Thanks for that. We've been engaged in conversations when the executive for the last week week and a half and at this point we're still in those conversations. So that's part of our desire to continue get feedback and I hope would be that this is not just something that the council sends and then sits on a shelf that this is truly practice going forward. So the desire would be for there to be concurrent as well from the executive's office. Will continue working with them and all of you to see if that resolution can be found appreciate that and I think I just wanted a signal that much of what is included in this resolution. For those of us who have run for been part of confirmation process these or nomination or search processes for some of these major departments the contents of what does resolution lays out is not new it is it is what those of us who have engaged in the work in that those faces have ordinarily at requested very early on for the executive to provide to us as part of the mayor's search and nomination and ultimately confirmation process so many and many of these things are things that I think are pretty run-of-the-mill ordinary pieces of information that are traditionally transmitted from the mayor to who The committee chair responsible for the confirmation process is so I don't I don't think there's anything earth-shattering and his Revolution. So I hope that we are able to obtain the concurrence of the mirror given the fact that I think that there's not there's not a lot of new requirements here. I think the only difference here for perhaps some of the other departments as is a dilation of the racial Equity toolkit. I will however say that in the chief of police search which I know is not going to be subject to this resolution cuz that's has Charter implications related to it. But but even in that context, we did utilize a racial Equity toolkit and we also required all of the search committee members to undergo racial Equity training in advance of even beginning to consider with some of the factors in criteria were as it as it would relate to our own obligations of looking at applications and make Sure that we understand how bias can come into those objective process. He's evaluating application processes. But again, I think that this is this is pretty standard in my experience on being on the city council the last three years in terms of these these processes. He's the only other thing that I would say, the last thing that I would say is that I'd like to take a closer look at this as it relates to the OPA director and the Inspector General for Public Safety. Those are two positions that are in the ig's case appointed. The search process is run by the city council city council has the authority to appoint that position and and we also do the confirmation process cuz that's an independent office. There is a lot of requirements in our police accountability ordinance that layover that particular appointment process in terms of who is part of the search and nomination process. And I want to make sure that this doesn't trip into that Arena and then it similarly with regard to the OPA director at the office of police accountability director who is search for a nominated by the executive. There's also some language within the police accountability ordinance that already dictate dictate expectations around the search process in the nomination process or just want to make sure that those are are going to remain intact and in place in addition to the resolution turn back from you on how this could apply there. Also wanted to reiterate We all have been through various confirmation process these and many many pieces of this resolution outline our expectations that have already been fulfilled in many cases. I think when those expectations aren't met there glaring omissions in who's at the table, or we hear concerns from certain constituencies. This will be a nice document to be able to have to fall back on as with every piece of legislation that we consider. Well, we may have expectations for Best Practices. It is always nice to spend codify it in Statue or in our resolution and make sure that this is a process in which we all have a solid understanding especially cognizant of the fact that it's not just for this council is for future councils. And again, we're building off of the 2007 resolution, which was passed before so, I think it's a good idea to continue to improve that's your points very well taken. Thank you. I'm sorry. I really want to say that I have appreciated the opportunity to work with you on this. I think a lot has changed since 2007 as it relates specifically to council members expectations for these processes and the extent that there are uniform expectations of having a document that identifies them is really important. I also appreciate that you've drafted this in such a way that there isn't a need for the council and all the executives have to refer to two different resolution or the new one. So combining all of those expectations in one is great. And then finally I want to thank you for including the language that are recommended in section 1A. I think this is related specifically to the Councils expectation that the mayor should tell us what their intended process is on the front end so that again it gives us the opportunity if we have something different in mind from what is being proposed gives us the opportunity to highlight those things work with our colleagues to encourage the executive to to address those process issues on on the front end. So thank you so much for including that language. I think that's a big part of why we're having this discussion is because there were expectations for what the process should look like for hsd and I think this provides a lot of me to Clarity moving forward and the problem is we don't necessarily make it public and then appears to be a difference of opinion in terms of what that initial process might be. So, I think we're recreating unfortunately lack of lack of trust and transparency. Even even though it may have been inadvertently caused. Do you want to rub up? The hazard going to fight this resolution does not just a resolution that has been brought forward does not comment on the ongoing issue of the appointment of the director for the human services department. The resolution that is coming from my committee is specifically refers to Dad and I just wanted to clarify that the Dodge resolution is a direct product of hundreds of people having sent a communication Samsung J performs either speaking it to different committee meetings are having found our different offices are having send emails and and the Genesis of it was from Protec 17 the union that represents many of the members of the how many of the employees at hsd having invited my staff in early January to hear they're serious concerns with the way the nomination the current time. Went and also I wanted to clarify that my office had been making inquiries or enquiries with the mayor's office since early last year and there was nothing that there was no information forthcoming whatsoever until the December 19th announcement of the mayor had nominated an individual for the directorship. And so just want to make sure that nothing on you that was not nothing unusual that was expected and it was not like the mayor was caught by surprise is our regular occurrences that you all have already said that that they should be followed. But I also want to do the console to look at the fact that it is not just about rules that we are setting up for the future about rules that that it's about procedures and policies of the city of Seattle has agreed to and then didn't follow in certain cases. I mean there was a promise made to adjust the employees also that they would be included but they want and they were taken very off. God by the appointment that was nomination that was made to have disagreements and I'm not claiming that every agency employees on the same page. But I am what I am saying is that we have heard from so many that so it was incumbent on the committee and I think it's incumbent on the council to pay heed to them. Okay. Thank you want to finish up flag for folks that we do have a meeting coming up for the housing Health Energy and workers rights committee on March 7th at 9:30. I continuing on the theme that we'll talk about later today in terms of access to Quality Healthcare for all part of what the city and the county have been engaged in is a Medicaid demonstration transformation efforts that are being undertaken by Jessica Laughlin from healthier here and public health seattle-king County. So I have an update from them also have an update from RCL Housing Authority who has a effort underway to try to rehab And preserve and expand affordable housing for more than 2,000 units for low-income residents. Looking forward to that discussion. So today also I wanted a flag for films that I'll be attending the Fort Lawton Redevelopment plan public meeting. I know many of us have been waiting for that for a very long time, and there will be a public meeting today at Catharine Blaine elementary school starting at 5:30. The address is 2550 34th Avenue West in Seattle 98199. Please consider attending as we tried to create more affordable housing and to how is our seniors and those who are homeless as well as mixed-income housing on Thursday. I'll be speaking at the League of Women Voters talking about the impact of women in King County or impactful women in King County at the atlas workbase in Lower Queen Anne and I will not here next week. Conference but also their National Housing task force convening which were getting together in person again, so look forward to bringing back more information from that discussion Johnson thinks almost council member rob. You almost got robbed. Good morning referral calendar when I talked about last weekend. It was inadvertently moved to today the other one relates to the proposal to allow Portables at the north Seattle police precinct the top 5 Laney's decision won't be coming before us anytime soon, but will be on today's introduction referral calendar II is countable 119471, which is a changing definition of a vessel in the city of Shoreline master program. This week's meeting. However, we've decided to hold it to discuss one bill in one bill only and that's councilmember herbold's 141 replacement bell, so we will have that on the agenda for Wednesday morning at 9:30. We have a couple of other things going on this week. There's a deadline up tomorrow. If you're interested in bringing forward any amendments to the companion resolution to the Citywide image a bill that we pass out of the select committee last Monday. We have had a lot of robust discussions about companion resolution at the previous image ABS own discussions and companion resolutions have generally been the place where been able to address non-land used related items, whether they be Economic Development Transportation, or other issues that have come up in the course of discussions. We've got a pretty robust resolution right now, but happy to take more amendments. I would encourage you to talk to Allie penuche of our Council Central staff. Adding more doesn't mean that there will be more opportunities but the resolutions planning to go live later on this week. So if you want it in there in the next round of drafts and play CLE by tomorrow by tomorrow by tomorrow and 1/2 hours last Monday. I came in this morning and realized that was only a week ago. We don't anticipate further amendments coming forward but in the same vein if there's something that we didn't get a chance to get to that's a good idea this come up we would strongly ask you to connect with Central staff this week so that we can have those published as part of the cpat endless loop noticed before we take up those three bills the north utility bill to Maj related bills on Monday the 18th of March to last small issues. Thanks to the How to turn out last week and Ballard in West Seattle related to The Sound Transit scoping conversations around the Ballard West Seattle light rail extension. There's one more scoping meeting that's happening this Thursday evening at Union Station. So if you miss that, feel free to come on down lots of the ways to get involved. You don't have to come to a meeting can find all that information online and for my fellow Transit Rider colleagues, don't forget that at the end of the month 23rd specifically buses are coming out of the tunnel. You may not be riding the bus in the summer anymore, but it's going to have a kind of ripple effect on where bus routes are going in and around downtown. So if you're a regular Transit Rider, just keep an eye on on that. There could be a lot of folks out street team in over the next couple weeks, but your route may change including that a prevention 56 pathway, which some of us Northern Riders will not move to after being on 4th Avenue. So looking forward to seeing how those changes continue that concludes my report. Thank you. Good morning party people really quickly this week. I will be attending the King County sexual assault resource Center's 30th annual be loud breakfast. That's Tuesday brighten early at 7 a.m. On March 5th. I will then that someday at 5 p.m. Join my colleagues over here to the left at the asuw student Senate Forum to discuss issues relevant to University of Washington students, attending Seattle University law school public interest law Foundation gala and dinner really a dinner that's designed to fundraise on going pro bono legal services and throughout our community. I have two items on the agenda. The first is resolution 31867, which is a resolution that would Have the city of Seattle express its support of the Medicare for all act of 2019 again this resolution appears in the introduction referral calendar and on today's agenda for consideration by the spool city council this afternoon as many of you are probably already aware last week on Wednesday, February 27th. The Medicare for all act of 2019 was introduced by our very own a House of Representatives congresswoman, pramila jayapal, and she introduced that bill with over 100 co-sponsors on that house in the House of Representatives. So I'm really excited to share the news with all of you that congresswoman. Jayapal his mate. I'm on her busy schedule to call into this afternoon's full council meeting at 2:00. She has been working with counsel present for a time. Where is his office to make sure that we can accommodate this thing with folks in Our IT department to make sure we can accommodate her a smooth call in after this afternoon. So we Kick-off public testimony with providing congresswoman jayapal an opportunity to provide us directly it some testimony on on this resolution and why it's relevant to not just Seattle residents, but also across the country. So really excited to be able to welcome her even even those only telephonically to our council meeting very excited about that. And another thing that I will note on this resolution is that the current version in legistar does not include a concurrence for mayor durkan. We just heard this morning that she would like to concur on the resolution. So I will be proposing an amendment during full Council that would insert a line for the mirror to concur on the resolution and then just really quickly for those of you who might be getting questions from your constituents about. What is the Medicare for all Act and why the city council acting on it what it is share some information with you all about not just the nitty-gritty policy. Pieces of the Medicare for all access I'm going to hand out but I also wanted to give you all a recently-released report biking County. That is Aiken County Community Health needs assessment that looks at 2018 and 2019. So the first hand out that I'm giving you all is a national nurses United fact sheet that breaks down representative. Jayapal is Bill on the front side. It really talks about how our current Healthcare System is in effective and efficient and Incredibly expensive for all Americans including those who live in the city of Seattle and on the back side, there's data about the nitty-gritty components of what her bill would do and how this is different from the medicare-for-all effort in 2008, I believe so I wanted to make sure that you all had that information available for you and it comes full with 13 footnotes with lots of different citations to literature. So I invite you to to read that if you have additional Pinterest next thing that I'm going to pass out is again this King County Health assessment report. I just took out an excerpt that really talks about a couple of issues one. It really say focuses in on King County including the city of Seattle and Taunton and really lays out it with data what some of the access to healthcare issues are in in our account in our city. Our focus is particularly on uninsured adults, who are these uninsured adults suffer example in King County from 2008 to 2016. There's a graph on the second page of this and passed out the talks about how adults aged between eighteen sixty-seven plays out how many of those of folks between age of 18 in season 7 have no health insurance and while we know that after the passage of the Affordable Care Act, we saw a huge adoption of a people signing up for healthcare. We still have a disparate number of Bratayley those members of our communities of color who has not been in How to access affordable healthcare insurance and again medicare-for-all will provide an opportunity for those communities and insurance and health needs to be mad the community health needs assessment report that I just passed out on page 67 also talks about what the unmet medical needs are within our community as well. And again providing you all this information to allow you an opportunity to share this data with any constituents who might be calling your office or emailing your office asking for additional questions about Best Buy. I'm really excited about working with congresswoman jayapal and advancing this resolution the city of Seattle at upon passage of this resolution will be the first city to pass a resolution in support and I think that is only fitting given that the sponsor of the bill is congresswoman. Jayapal who represents this District that we sit in and really excited about being able to lend our Collective support, hopefully. You her effort to continue to build the case and the momentum nationally for for serious consideration of this legislation in the House of Representatives at 2 before public, Oh great. Thank you so much. I appreciate that clarification. I'm happy to answer any other questions about the resolution of the reason to move on to the second item. All right, so I also have a council Bill one 19468 on this afternoon's agenda. This is a bill that would create an incentive program for the hiring of new police officers at the Seattle Police Department. My committee has had two hearings on this particular Bill my committee and this council is a whole has been closely watching the hiring and separations data coming out of the Seattle police department since the middle of 2018 when it became. Apparent to us at the department was lagging far behind that they're hiring forecast at the department has continued to confront hiring struggles in recent months a reflection of a very challenging landscape naturally where police departments across the country are struggling to recruit officers. So this legislation as proposed by the mayor would have provided that lateral hires from other departments a signing bonus of $15,000. I have proposed several amendments are proposed several minutes to this bill that were voted unanimously out of committee last would expand the hiring bonus to not just lateral hires, but also to new hires at 50% of the rates about some 7,500 for new hires and it also includes additional aspects around accountability so that we are able to continue to get data related to how this hiring in Santa Furnace is working and whether it's working to allow us to course-correct if needed much sooner. The other thing that that that this bill will do including not just the expansion to new recruits in the new data collection, but it also includes a effectively a date which would require the council to renew their program so that it won't continue in perpetuity. Again that is tied very closely with our expectation that we want to see data and evidence that this hiring bonus is actually accomplishing the stated goal of addressing the hiring of the hiring gas for the police department. So I think it's appropriate for us to make sure that we're monitoring that data and to make policy decisions relative to the data that were seen and receiving to identify whether or not this is working and then the last piece is that there will be a clause in this version of the ordinance that would require a new hire. Or a lateral hire who receives a bonus to pay back the the bonus if if they leave before I set. Of time, so this is all been reviewed by the Law Department all of these amendments and feel very confident in our ability to move forward with this version of the bill. And the last thing I'm sorry, I forgot to I'm sorry for mosquito has questions very briefly just for clarification the ordinance that we have in our packet for today's full Council agenda version 2 that is what we will be voting on. There's no amendments besides the fact that the mayor would like to concur on the resolution of the resolution. SPD hires you'd mentioned that there will not be an obligation to pay it back. And if they don't stay for a set. Of time, what is Festa. Time? Is it different for a new recruit versus a lateral hire or is it the same? I think it is the same Provisions apply to both and I don't have the actual building with a friend because I bring my iPad that I'm happy to follow up with you on the there's a there's both a staggering requirement of you get paid the you get paid 50% of the bonus upon hire the rest of the remainder of the bonus at the end of your probation. And then I believe it's within three years. If you if you separate from the Department, you have to pay 100% of the bonus back. So it would apply equally to both the lateral hires and the new hires. There's no no distinction in the policy based on whether you're a new or a lateral building the investment that the city is making in lateral hires is significantly more than the new hires that right not necessarily because new hires require a whole host of Investments by the police department in terms of getting them to be admitted into the training academy that all require some level of financial investment and certainly time investment to get a new recruit up to speed that process takes about 12 months for that to occur as opposed to a lateral hire who is already trained just has to cover their license to one where they can be a law enforcement official in Washington state and that's pretty quick turnaround. But in terms of the amount of the bonus that were providing a lateral versus a new hire. Yes, the lateral hire dollar figure is larger and lastly I should note that in your review of the of the fiscal note. You will notice that this is a revenue-neutral proposal even with my A proposed expansion to apply it to new hires. And the reason that it is revenue-neutral is because the department is still not hitting its hiring forecasted numbers. And so there are significant salary savings that will be repurposed for funding of this incentive hiring program. Thank you.", "end_time": 5814.7}]}