{"format": "raw", "annotations": [], "confidence": 0.9361219699265527, "data": [{"start_time": 0, "text": "Good morning. Thank you for being here for a regular schedules govern a second and Technology committee. I'm doing Bank comes from Jennifer Samuelson just told them that we have three agenda items will cover today with the first one in Ordnance and will actually go down when creating a a code reviser position for the reasons for the Scribe during our discussion of that region. I will then move to the Rain Ordnance relating to the city of Shadows. I use of the Cascade public media Capital Hills transmission site in Tower and last will cover an ordinance relating to the technology matching fun and worlds excited to see what the community is doing with the use of that technology matching friend program. So as we always do I'll move to an object will approve today's agenda. So I think will approve it and why don't we take public comment that I don't believe we have anyone I sign up for public comment. So I will open that enclose that and ask I believe it's just a just a pit. Anyone associate with Constable 119594. Come forward and thank you Ali. Yeah, please read us the record 594 an ordinance relating to enter enter interpretations Corrections and revisions of the Seattle Municipal Code. Okay, so that was a short version which will suffice introductions first got together this very well written and so why don't you just described for the viewing public what we're trying to do to this bill 19594 would create the position of code reviser in the city attorney's office. This position would include would introduce a new position that has powers to make corrections to the code would introduce efficiencies and decode Drafting and would provide opportunity to suggest changes to the council. Well that would provide better code Clarity and make it easier for the public and the council and staff to work with the Seattle Municipal Code. The code reviser today in the city attorney's office has two legislative editor positions one would be permanently reclassified Stewart to a strategic advisor to creating the code reviser position currently the legislative editors provide code drafting support to the council to City departments and advise on code drafting generally in and work with us on making technical Corrections that need to be processed through amendments. This would allow certain corrections to be achieved through the codification process and would again introduced efficiencies. The code reviser is expanding duties will include the authority to correct revised and proactively crack non-subsidized of Errors including addressing discrepancies in harmonizing harmonizing ordinances. For the publication of the final code and the legislation also the next several general rules of construction for the Seattle Municipal Code. These powers are based on existing state Powers County power is in other guidelines that introduced Clarity and code Drafting and as I mentioned this will provide a more accurate and understandable municipal code and we'll also have a positive impact on your own counsel Central staff and that the position would have the authority to fix those technical Corrections and allow us to work with council members on more substance jib issues, appendix 1 to the memo provides a more detailed summary of The Authority the code reviser will have and just to reiterate the authority to make technical Corrections. The code outside of a legislative amendment process is very specific and Technical and would not allow for any substantive changes that changed the meaning of any of the codes are ordinances in the memo. I highlighted a few pieces of legislation. That could have been avoided if this position had been in place. So again, that's just to note that this will allow for government efficiencies by not spending time at committee on those technical correction. If this proposed legislation is recommended for adoption by the committee full council could take action on next Monday at their August 12th meeting. Thank you. So again, thank you. So delayed out the logic behind it on to create the efficiencies and you gave several examples ordinances. Actually that were passed where my guess would be have several pieces of legislation affecting the same code often as coming from several different angles, and this would be a step toward efficiency. Applying for a service don't see us budgeting is concerned. I did read the footnote that we should we will be okay for this year and next year, but we would have to it would have to be in the budget through the budget process for the year 2021 like in any legislation that creates a new position that increases responsibility there will you know in the long term it will be a budget increase but it is not significant in for the next two years will be covered with existing resources. And if there were not resources are available at that time, we would revisit that with the city attorney's office during the council's budget process both the city attorney's office in the very compelling cases for the creation. Almost seems overdue but so sounds like a smart way to blow me out and put in the process. And so I don't see any strong objection at the table so that I'll move to 95940 2nd and Thursday. I oppose the eyes have it and I'll pretentious 4 console again. because it's not controversial. Peace, but I want to What I was saying, I'm sending something to my colleagues would Allah. I work the show offline about how I make sure there when I I don't have to explain it and in complete detail for 20 minutes when I presented Monday, so I'll let get out a memo to all my colleagues. Okay. I'm happy to distribute out your direction to the city of Seattle's continued use of cascade public media's Capitol Hill transmission site and Tower authorizing the Director of Finance administrative services to execute a 15 year lease with Cascade public media governing the city's continued use of the transmission site and Tower for radio equipment and Associated and tineye. if I don't start with introductions Atomic cellular Council Central staff of Spencer Bonner radio communications manager for city of Seattle in the Department of Finance and administrative Services. Okay, so, I'll try to let you keep it up and then I'm sure walk through the issue. So go ahead and thank you. So cancel bell 19599 authorizes the department of the the director of the Department of Finance and administrative services to enter into a 15 year lease with Cascade public media for the use of its Capitol Hill transmission tower. This transmission tower is a piece of the larger Public Safety emergency radio network also called peace earn, which was funded through a 2015 countywide ballot measure. Cancel authorization is required for any of these longer than 5 years for Summit to Seattle Municipal Code. This lease that being considered with this legislation that replaces an agreement with kcts television that was in place since 1992. The city is operate equipment at this location since 1967. In addition to authorizing the lease the the bill also includes an appropriation increase which has $90,000 boxes $180,000, but the least amount is 90000 which covers these payments going back to October 2018. So that will take it through 2019. Total increase that's in the ordinances actually $180,000 and this is the $90,000 because it includes past due Authority for the Department of fas to pay the lease. Whereas the department of it will actually be the apartment will be operating the the tower. Stop the total ongoing cost began in 2020 is $145,000 per year and it grows by 3% per year thereafter after the initial 15-year term of the lease. There are three five-year extension options. Unless there are any questions for me at this time. I believe Hillary Hamilton from FAS and Spencer Bonner from satellit have a presentation to cover details that actually was an excellent background and really covers some of the slide material. We have a lot of history at this location. It's a key part of our current radio system Public Safety radio system and is a key part of the peace earn system that will be replacing it. It is also a substantial increase in the cost of using the facility. The good news is in 2022 or 2023 that lease amount actually reduces considerably and we'll we'll be paying something closer to $50,000 a year long-term on the property. Let's see. If there's again mention there of the piece are in system and the Eeveelution and Technology overtime. Has what stated a 15-year laced with the opportunity to extend it a lad. We do have a number of other systems besides the public safety radio system present at that location, It's a fiber Nexus for the city and it's also part of our wireless data Network that connects a lot of a city facilities using a specialized Wireless technology. So has some long-term importance to the city. And this is just an illustration of where it's at on Capitol Hill at the 18th and Madison. Make questions that Century straightforward. It's we've had this arrangement for decades it seems and seems like it was well negotiated, really no liability exposure for saying seems to be a financially or physically sound and so I don't see any issues so that I will move to approve Council Bill one 19599 all those in favor. Say I work 2 to get us this point. And one for your next agenda item into the Reckoning all the percentage give him for it on the matching fun 595 and ordinance relating to the technology matching fund making allegations and authorizing implementation of certain technology matching fun projects in 2019. favoritism Okay, girl set up there. I was going to tell you press enter on. Just kidding. Delia Burke part of the egg can give you technology and broadcast group in Seattle it Tracy Cantrell Seattle. I really don't I mean I would just feel the Thunder from CTO beshear's so I'll have to turn it over at this point tickets through a brief presentation. Well, thank you. I'm excited to hear to talk more about technology matching HUD program. So the technology magic fun has is two main strategies for helping to support the community's efforts for digital occlusions. We like the best ideas on how to address these issues and Seattle has long been a leader in recognizing the need for digital inclusion. And we want to thank you present Harrell for your and the council for the ongoing commitment. It's a part of this program. We've been able to find over 300 projects since the program began and this year. We are proposing to support 11 new projects with our budget of $320,000 will be able to leverage that funding with an additional $302,000 in matching commitments from the community. To get these to get a group of proposals. We did extension of our trees early in the year. We worked when doing workshops one and one technical assistance lots of opportunity for the community of Sly and our objective has been to make city funding as accessible as possible. We want to ensure that organizations large organizations as well as small Grassroots groups who may not have professional grant writers are able to be successful with his program. So from that we've received 47 applications requesting / 1.8 million dollars in funding. So we had a very deep pool of applicants and strong proposals at work from this year to collect the projects. We worked with an external panel of reviewers comprised of computer technology Advisory Board see tab, Seattle Pacific University. Information school students with a new partnership this year and many other community volunteers and building this diverse group of voices to look and that these proposals is really strong part of our process and ensuring an equitable distribution of our funding should work successfully with me to thinking that went into that. It was my understanding and prior to that. It was the sea tab subgroup primarily to the evaluations with if I'm mistaken except you're pissy tab. I'm members that were interested in volunteering on it. But we find that you don't often see tab is somewhat Limited in background and we wanted to actually brought in that we wanted to get more people from the community different from different perspectives. So and having a larger panel, I think actually brings that that in as well. So many of the community volunteers are actually exit AB members who were engaged and want to stay committed to to the program Seattle Pacific do they have a interested students as you start came forward or is that a that a target of ours of one of their spring courses? So we work with the instructors there to engage the students on a review panel and they actually earn service learning credit by this and really getting some real world kind of understanding of what some of the issues are facing the community. So it was a it was a successful pilot this year and we have to continue that next year. So the panel is recommending this later projects and we're really excited about the other group of applicants this year. It's a it's a really nice mix standing all over the city. We have several groups that were refunded in the past. But we've also open it up two new projects and when you read the project description Peter all these projects have technology technology component about them, but the projects are really about people and about how people can use technology to improve their life goals and to helping them advocate for themselves and and their communities. So out of this group of 11 projects several of our brand cheese will be helping to build a more Equitable Workforce here in Seattle series of a real change is working with homeless individuals to gain job skills to you to move out of their situation Dress for Success Seattle is working with very low income women to help get a pathway into Tech careers. Another interesting project is indigenous placemakers, which is working with a Native American Artist, which is actually one of the most disconnected Community Care in Seattle. And this project will help those artists gain more professional skills using technology to it for their career. Our prayers are also helping some of the most vulnerable residents in Seattle like seniors and people with disabilities to reduce social isolation and stay more connected so I can on Community Healthcare is a program in the southeast part of Seattle Dad is working with Asian seniors to engage with Telehealth. So they'll be able to manage their own Healthcare and live healthier Lives full life care is actually working with seniors and people with disabilities to use the internet of things to help navigate Seattle transportation and accessing other resources jobs are excited to see how that project goes more of an understanding of how functionally that works on the reducing social isolation for seniors. Does that mean that there's a person who's Going out and talking one-on-one individually with seniors and people with disabilities and helping them navigate the internet. I'm just trying to get a understanding of exactly what the what the work Williams have a technology lab and they have housing facilities for seniors live in very easily into the stack lab and they do a lot of classes and one-on-one assistance with those seniors, but it's really technology can be a great way for people who are homebound or disconnected to connect with family members that maybe in another country if they can learn to skydive or connecting with their grandchildren. So basically kind of opening up demystifying technology to be able to make it accessible to connect more and that's what I'm trying to understand is relying on people going to a place where the slab or their people who are Experts in technology her going to where people are socially isolated and trying to connect them to the the internet of things and internet access to healthcare and so are we at War right now and then they're offering these in a workshops and and in classes and when I was there some sort of in the in the setting of the community center, but I'll buses are annotations have you know that the case workers and entrusted people that work with us populations to help engage them in and help them in and braces classes. But I am finished that that's fat monthly classes and is certain funny that we're thinking of people in their 80s, but it's actually 55 and over so they're not exactly and I'm older than 55, but as people that for whatever reason aren't learning a particular in healthcare learning how to navigate through this and so it's sort of a fun kind of Workshop where they meet younger people in to help them and there's their fun classes because they they try to reduce the fear and anxiety of the people have dealing with computers as well. So yeah, and they and they have engaged with Amazon that Amazon is a partnership that they has to be bringing back records from Amazon to engage with those seniors in and help them learn. I just briefly on some projects will be working with a specific population of the whole family unit. So program Atlantic Street Center or South part of information Resource Center will be working with youth to provide Tech access to do homework help in places to go after school, but the off the engagement with us children's parents did give them basic Tech skills to learn how to do email and connect with their teachers the and navigate to Seattle Public Schools online systems. So those are the problems would really be happy to kind of strength in that family engagement with technology were there can often be a big disconnect where they use have stronger skills in the parents do in fact and then we do have a few programs that are really targeting youth to help with closing that Youth Opportunity Gap and Find used with with skills for the future computer skills for all will be doing stem programming and exposing you to computer science careers, Jack straw and multimedia resources and Training Institute are engaging youth on kind of exciting video and audio and helping to elevate their their voices through Technologies. So I'm so it may seem you know, that with this funny. We've only 11 projects that you can see that these projects really have a deep impact throughout the community and will reach over 3,000 Residence Inn in very meaningful ways. Good. Did you want to speak just going to say this is my first year in looking at how we have been running the technology matching fund program and some experience in running these types of programs elsewhere and they're typically three things that make or break the impact of these types of programs and I just wanted to show what those three things are going to be on my Delia Tracy's radar that we're going to not wait until next year, but we're actually thinking about it from yesterday when we had our first kickoff discussion on this but we know three things are a how to create a much much bigger multiplier effect governments are always going to be stretched V this year had a lot more applications and we could potentially fun and there is one multiplayer angle already. We're we're asking the applicant to provide some matching funds but there are many nonprofit organizations in the community many privates. Corporate social responsibility arms that are based in Seattle where we can create a note to 3:55 or more even Markiplier X in terms of how much money very able to give so that would be a big Focus for us to identify who does partners are going to be in the community that have a like-minded men did to the digital Equity program Behavior The City. The second is a shrink Del cycle. It takes from the time a person submitting application to the time we are able to deliver the funds and get them out the door and you know what the reviewing the program today. We do take a significant amount of time from the time be close the application which was back in March and you know, the money is going to go out the door towards the end of the year. And so anything we can do from I could because those organizations are ready to do all of the good rug that Delia talked about I know back in March and so there are some strategies there that I'm going to be working on to two. Cement one of them being not waiting until next year to start the 20 20 grand cycle, but to actually start accepting applications this year images NY simple as that and the third thing is often small organizations. We are talking about some organization receiving as low as 5000 some maybe 50 anywhere in between a reporting overhead is something that often organizations and Eve are receiving money from public sector are going to complain about that. We got money, but then we have to spend even more than that to just do the reporting Associated. So making my making sure that you're not taxing our recipients in unnecessary reporting processes would be the three things appreciate that background particular the first one and you have talked about that the multiplier fact that there's there are there grants out there in his organization out there trying to fill their Corporate social responsibility trying to get some of the same demographics and social needs that we see out there. so there could be investment down to share a question about excuse me about the the number of of success of Grants. I don't think anyone could argue that this is one of the Cities. I think greatest efforts and programs in getting money out to communities. It really needed and they are real impact of taking place to vulnerable communities. And so I'm just very proud of work. That's it. He's done since there's no criticism there I said, I wanted to understand philosophically sort of our approach. It seems like this particular. We have some some larger ones in the 30 to $40,000 range. We have 36 applicants that weren't success. I'm just multiplying I'm just deducting the 11 from the 47 applicants and it seems like in Prior years. We did more of a peanut butter approach. We had smaller amounts for higher number of applicants and so is this just a result of how the the the groups who made the decisions hats with a ferret out or did we give them some directions to go a little higher with the lesser amount or is it just organic? It just heard it is what it is at the end of the procedure, but I've noticed that this Do I get a smaller mouth higher amount? So maybe you could give me some background? Maybe they're always around 11, but it just seemed like we had larger and smaller amount so I could be wrong on that. The maximum was increased over the years as some of the complexity as a project and kind of the work that they were doing. So so it did it increased from I think 20,000 to 30000 and right now it's at 50,000. So the maximum is higher and the budget has not increased. So we we've been finding fewer program this year to we weren't this year. We did have a higher average Grant request that we did last year. So we were the Review Committee elected to actually not even fully funded the proposals to the 11. So we're trying to kind of deep in the investment on some of these programs to deliver these impacts but it is it is a challenge and it made See that we need to reduce the great award to sign or programs given the current budget direction or parameters to the decide. The evaluation group has gotten evaluation groups of the South Pacific and the seat Avenue Q new members and staff. Do we give them permission to say? Okay. We we expect there to be less than 20 or less than 15 and a friend or do they just look at the full pot of 320 and say we're going to see what comes in to make it evaluation. I didn't understand your response on my question though. It was so I mean that we would have the maximum ran over that applicants can apply for his $50,000 and so each year. We don't really know what we're going to get and so the reviewers will read and score all the proposals and basically get kind of a ranking based on the criteria and from that cuz of her job of looking at where projects Has Fallen. How to best allocate that funding and so some years we may have smaller Grant requests and was able to find more some years. It just depends on how that works in our guidelines that organizations can apply after $50,000 and many of them to last few years and some of that is in a stack capacity to administer the grants. The thinking was just your 2250 for many years, but in the end I think it was maybe two or three years ago that it was increased to 50. I guess we have to monitor it but it would seem to me that again. I just don't know what's more effective. Do we spread it around a little bit on smaller amounts for some of the Grassroots efforts or do we should have double down on that mean you're all grass roots for the to some extent do we double down on those on a higher amounts? I don't know. I mean I'm hearing you say we as a staff at Friendly creature from 30 to 50 and then we start to see what comes in the door but there are there are some smaller awards given as well. I know this and so they're not all 30 of course and I but I was just again trying to better understand. In fact, I think the smallest one was was five and that's a real change and but most of them seem a little more so it wasn't a good good or bad. I just last area of inquiry where I like the impact on the community helps. Understand where we're investing the same question. Do we we know our needs is a city and where we make think or presume. Digital Investments make should occur, but it seems that we don't dictate that to the evaluators that we just let it come from the community or am I wrong to each other on one of my biggest concerns is homelessness right now or are or senior isolation and look at those little more favor late. Do we just let it grow organically or do we try to give the evaluator some Direct? So in our in our guidelines, so one of our kicker tiers is that we are funding historically underrepresented in underserved communities that has a very high waiting is so through our criteria. The value of a dollar is really ensure that it's it's it's Meeting those needs. We also had it so I think through the criteria is really how we guide guide this there are also some areas of community benefit is this what impact does is making out on the community? What what kind of is there a recognized need will this be successful? So I think true that true that as the reviewer score these things certain programs rise to the top. So so all of these projects had it where it very competitive with others who they're serving how they're going to do that. And what is the need in the community if I can offer a couple of other ways to think about it give him the envelope that we Have to give out. It's not going to be sustainable for the long term for anyone organization. So the way I would look at it is that this is seed funding that we are providing to a multitude of different organizations are some of them are going to work in such a way that they will find ways to sustain it be on the city's founding and become independently funded projects and in some cases those initiatives those Pilots may not go much further. And so I would go to words more providing funding for a maybe a larger group of of organizations versus just giving all the funds to one or two organizations the other way to also and the other lens that I'm going to also applies I get into this a bit more deeper is are there any organizations that Have no sustainability plan Beyond receiving the $15,000 from the city. And if they don't then that is a red flag because we want these impacts to be much more longer term than just a calendar year and where either of you on the evaluating committee the sword by The View staff on the evaluation committee. Yes, we did have several staff members in our group and I was on the Review Committee as well, this year. I really just move toward efficiency. I've literally had every recipient of the funds here at the table you sat through some of these are in the audience cuz I want the city to know who are investing in this year. I opted not to do that. But I have found it very helpful to have seat at members here to ask a question to how they evaluated because my heart goes out to the 36 that didn't get it as well and I'm always trying to let them know they could reapply again or they should get some feedback on why they didn't quite make the cut list these 11 are obviously we'll shine and do well and we want to make sure partner with them, but did the last pieces I think the last year we did it is there was some jokes about District representation and so offline Tom, can you just give me the Districts that these are on our way understand they draw from residence and and people from all over the city. So just cuz they're based in District 1 or District 2 doesn't mean they're just there but there was some Lively discussion on whether it was District too heavy for some reason it wasn't but maybe you could let me know what districts these are in and I but I don't need it to knocking out alter my support for this and I don't think anyone's but we did I distract me that Tracy. Get on board or that have submitted an application and that really when Sade mentioned some of the areas that were trying to look at to make this a more efficient process part of that is what's driving the work that we want to do because there is a need that's not met. So are there things that we can do that will help meet a greater need. Okay. Thank you very much. This is going to be an exciting. I haven't voted on it yet. But again great work. I want to thank all of the the evaluators that's not easy work. I mean I've been in some of those kinds of meetings to just look at the end product and say ahh, the end of the quote great work with it a lot of work in it went into that. Thank you present a Harrell for your work on the matching fund over the years. I know it's been really important to you and you've shepherded its creation and expansion and did oversight of a lot of the awards that have got out the door. So I really appreciate the value for very sure station verify that sound okay with that. I'll move to pass Council Bill one 19595 Is removed and second and passable all those in favor. Say aye and Monday thank you very much and we will stand.", "end_time": 2299.4}]}