{"format": "raw", "annotations": [], "confidence": 0.9318200949749915, "data": [{"start_time": 0, "text": "Good morning, everybody. Thank you for being here for our regularly scheduled Council briefing on April 15th. 2019. Why don't we go right to our state legislative session update and I'll come back with the present report before you go through a preview of today's full Council actions. And so as good a team forward here. And just everyone has the April bulletin and the updates. Thanks for putting together such as comprehensive document when I appreciate that and just dive in governmental relations, Karen Cargill relations director. We are nearing the conclusion of the regular legislative session both Chambers at this point are working to reconcile their respective operating capital and transportation budgets at this stage. We have also possum significant Milestones recently the April 9th physical committee cut off as well as this coming Wednesday. We Face are on April 17th is when the when bills me to make it off that house of the opposite chamber or be designated as necessary to implement the budget if they are going to continue to move on many things moving quickly. We really appreciate you all being available throughout the weekends and late into the evenings particularly as it relates to and she's around 10 of protection some incredible movement there. It will be reporting on automated enforcement wrongful death and i-200 repeal specifically this week week, which I know council president Harold will be joining us in Olympia for the governor has already started signing bills into law and we will start reaching out to your respective offices. If there are Bill signing that we think you'd be interested in joining for so About definitely think it's it's still moving forward and is soon as we although it hasn't actually moved off of the floor at this point as soon as it does. And as soon as the the governor has indicated that he will sign it. We will definitely let you know when that is scheduled and we would love to have you there to participate and done before we dive into individual portfolios today. I'm going to turn it over to Karen Cargill or Steve director for a legislative session update. Okay, so we're on day 92 of the hundred five days session. So it's a little less than two weeks before Sonny die. I mentioned last week that the rumors have a special session are circulating in Olympia and those rumors are still still active until they haven't passed a budget on by then. So we are going with the budgets, but I know we talked last week that they are there are some pretty significant differences replicant about us $609 difference between the two budgets. So conversations that Revenue what those what those are going to go for 4 or monitoring that very closely and engaging in this conversation. So a lot of work that still needs to be done, so it'll be very busy until the very last name. The Ultimate Fan cut off Wednesday is the last day for bills have to be out of their opposite chamber. And then for the remainder of session that focuses on bills returning that require concurrence dispute or conference. So that's what the majority Focus says. That's other than four bills that are deemed necessary to implement the budget. Budget related question because the differences between the budgets are so significant because this Council has some strong preferences as it relates to some of the pieces of the budget particularly. One of the things that I've been monitoring are the both the capital and the operating Investments related to drug treatment the ability to bring on drug treatment beds as well as the funding necessary to operate those facilities. You guys been really helpful in helping metis through what what's necessary to put into operation previous legislation under previous legislative sessions into place here in King County as it relates to treatment of folks who have a drug addiction problems. And so what's the best way for us? That is one example. I'm sure there are other examples where this Council might have strong preferences on which version of the budget gets through for particular allocations. Is there a way like we just have generally for our legislative agenda. Is there a way for us to do that with the budget as well? Absolutely. I'm typically so when the Builder initially introduced very quick turnaround. Typically the budget legislation is introduced as a title only and then it's subbed in and an afternoon and then that next after the following afternoon. There's a public hearing. It's on the same day. So sometimes it's difficult to be able to get through all of the documents in order to have an impactful testimony or to be able to weigh in the public sense a lot of different entities and different groups like to prepare letters and kind of outline. What the what preference do they have them? I would like to see that in the final version. And so since I'm I think of suggesting something different than what we've done before I'm assuming that the council would be interested in doing something like that for the different budgets. Would that be something that Oar could help us work through we already have one in the works. So I'm happy to follow up with you and share what we have and we know that we've been talking to the Pacific Lee and some of the other stakeholders that has a lot to gain from this budget, even though the budgets are on different a lot of things both budgets have put some significant. I know that they're still a little bit of confusion about what all those pieces. They're called different things in different places. So working through what that means. It's still I think it'll be an ongoing and part of the part of the final budget negotiations, but we have a relatively good outline of the things that the the broader Behavioral Health Community is going to be looking for an asking for so happy to connect you with that ends. Thank you. Okay, I'm going to start with education. There was a lot of action on Early Education Andy Capp last week. I want to start with a second substitute House Bill 1344 on page to that was introduced by representative Reeves on this would require Department of Commerce to contact for regional assessment of the childcare industry to be completed by July 1st 2020 on this was voted out of the sun on April 12th 12 with a vote of 25 to 20 are there were some amendments that were adopted while it was in the Senate and that was requiring Commerce work with department of children youth and families. And in addition to correcting osm to develop a survey for state employees to better understand their challenges with childcare. So this will require that the bill was going to head back over to the house for a choice of concurrent or if they have any issues that they can send it back and that's that's the process for that but it will require an additional vote in the house. So it moves back over there. The second that I wanted to highlight is Senate bill 5089 on page tooth towards the bottom and that's put forward by Senator Wellman, and this would allow the enrollments a knee cap for children who turns 3 at any time during the school year if the children's family income is at or below 110% of the federal poverty level and the children have received early intervention services or participated in the Early Head Start program how to spell also passed out of the center on April 12th with a vote of 92 to 4. There were amendments that were put into the feel. So it again what's after return to the Chamber of origin for concurrent Sorkin? The last Early Learning Billy wanted to highlight is 5437 after on page 3 put forward by a senator Claire Wilson and this would allow the inclusion of children whose family income is less than or equal to 200% of the federal poverty level in ecap. A space is allowed on there wasn't amendments that was adopted in the house and that would above the 130% of the federal poverty level but less than or equal to 200% of federal poverty level the department of children that start at the children have to meet at least one risk factor Criterion as adopted and rule by it Department of Children Youth and Family. So because that change was put in an attic back to the Chamber of origin. Cabela's, Utah Senate bill 5089 and this Senate Bill 5437. How did these work together? I mean, I think this Thursday General efforts to expand the number of students are eligible to participate in each capsule. I think they each kind of work on a different piece of that and are looking at different populations. So I don't think they take away from each other, but they kind of work out complete, but I'm happy to confirm that. Karen just really quickly John which one of these bills included the revision around allowing graduate students full-time graduate student to be able to still none the less qualified for that was actually 1303 that was a child care higher education bill that's on page one. The very first the very first on April 12th. Been a high priority for for me and and I know that there has been in situations which it is released to the Seattle preschool program where graduate students have tried to apply for CCAP the child care assistance program and have been told that they cannot qualify for that as a subsidy to be able to fully participate in this child care services. So this I think it's going to be a huge shift in how parents who are seeking to at the same time further their higher education as a long-term outcomes for the family, Oregon via actually able to access some of these wonderful program. So kudos to the folks in the state legislature. There's music playing for the audience. About that bill in in in particular and want to continue to follow it to make sure that it gets signed. Thank you for highlighting that I don't have any notes about the weather for you and let you know if it's going to require any additional action by the legislative body found on page for I want to highlight that our favorites at electrification Transportation. El Paso to the Senate last week. No amendments were put on the bill. So it is it is past its going to the governor's house now so you don't have to hear me talk about this one every single meeting for the next three years. calcitonin Another significant environmental win. This past week was the clean energy bill that Senate Bill 5116 on page six. That was the energy bill for by Senator Carlyle and that passed out of the house go to 56242. There were some amendments for it. But again significant significant 1/4 of the environmental Community head back to the senate for and I seen some really good progress on those bills. Send thank you notes on things like this things that are important to us, but I'm just thinking that if there's an issue that you're interested in that we could can I give you some ideas for you to send thank you notes for I know that those are always appreciated for this bill if you're interested. I know Senator Carlyle Fitzgibbon and representative Charlton. I'm all commercial delegation were instrumental in getting this off of the house floor. So just want to give them a shout out that they did their for that. Internal government on page 7 at Senate house bill 14 Saturday substitute House Bill 1403. That's the B&O enforcement formula. This is the bill that FAS for today WC Department of Revenue and Association Washington businesses, in order to simplify the formula for the piano tax. There was a consensus language that was agreed on through a work group at has moved relatively smoothly through the process and also passed out of the Senate on April 12th a very busy day 40720 with no Amendments of has to the governor's desk. So Anna, is this the the sunshine committee House Bill 1537. So is that the one that everybody was didn't want to share their emails know. This one's not that this is a different issue under legislation died. Senator Peterson was the one who put forward that initial proposal. And if you know that there's a lawsuit surrounding that right though. I want this one was prepared to speak to that one, but I can follow up with it, but I know you're not that one. That's not that one. I'm on page nine. I want to highlight Sanibel 50163. That's the wrongful-death bill. This bill is on second reading right now and there's quite a bit of debate going on around an amendment that is being proposed for this many minutes is an attempt to strip the joint and several liability protection at a cases involving involving the statute which essentially means that it's like the parent making a claim for the wrongful death of a adult child, which is a significant component of the bill the people that are very supportive of the legislation feel that that pretty much takes any of the punch out of this bill. So there's a lot of fighting going on on that topic on a lot of back-and-forth. I don't want to think I can't remember Gonzalez for sending a letter to several of the legislators who have I was here and decided about what to do. And I know that there's some conversation about doing an additional letter and we're happy to work with you to have counsel support on that. I want to thank you all for continuing to fight the good fight on this one. It's a really important bill and it's it's it's very wonky in a lot of ways but it is fundamentally a legislated Injustice and how we value the loss of life and the harm in our society and there are many instances in which I had to turn away clients when I was at practicing plaintiff's lawyer because because it was an adult child that was lost in a really clear case in some cases very clear cases of negligence or intentional intentional acts and I think it's really important for us to make sure that people are able to access our justice system. And this is one way that they did folks are kept out. So in my incense, for example, I've only been married for a year and a half if I had passed away prior to being married my mother who depends on For a lot of things in life would not be able to have brought illegally viable claim against me. If the reason I died was because of negligent acts in a car accident for example, or some other type of government, you know misconduct that resulted in causing my death and that's that's you know, that's those are really does a real life in packs for families that in this Lodge doesn't actually recognized modern day families in the way that it should and in the way that we move around in the world. So I'm I'm really excited about continuing to advocate for this I advocated for it when I was a member of the Washington State Association of justice and on their board and continue to believe that this is a really important effects to a very archaic set of laws around how we value people's life and death and how we Valley peoples familial relationships in modern days. Friday so I've been in contact with a yr. And I know that Lily is going to work on a letter for the full Council to sign that I will be bringing to your colleagues at today's at 2 p.m. Full council meeting for Signature since we don't have a quite ready for this morning, but happy to speak with any of you who might have concerns about the contents of the letter in advance of today's full council meeting given the nature of the bill clarification from allies here for a lot of a lot of the newer members in the legislature will will be very helpful just understanding that this is an important priority for the city of Seattle. I think there's you know, people are getting into the weeds and getting a little distracted at this point. So I think that will be very helpful clarification and we appreciate those initial emails as well. Thank you. The last bill that I want to highlight and their the general government section is Senate Bill 5376. Synott, Senator Carlyle consumer data and privacy Bill. I know we talked about like it is but the main idea of this pill with soda have consumer protection on their data and their brights on what they're able to do with that until my people would not do it that last week right before cut off the Appropriations Committee and effort to preserve its ability to continue to move forward needed to strip the bill out of its content. I'm so right now the bill is actually just a title only an intent language bill. So they're still working through some of the new one says there has been some concern. Ford from that you tell you that the domain didn't go didn't go far enough for there wasn't the ability for people like to actually stop some of the stuff with tearing up their data. So I think some of those those issues are still being worked through. I'm just because there is no content in the bill at the stage by no means means that the bill is not moving forward to stage. And I thought would be the final form of it so that I will pass over to Christina. So moving on to the Health Care section on the bottom of page 10. I wanted to highlight 1394 the behavioral health facilities Bill we've talked about this before this relates the behavioral health facilities and programs needed to ensure a Continuum of Care for behavioral health patients. I wanted to highlight just a couple things that came out of the Senate Ways and Means Committee on April 8th. So two amendments were adopted by the committee one that clarifies that serve certified mental health. Peer respite centers must be provided by community behavioral health agencies, which is do, you know more options for people and the Second Amendment would remove language expanding the exemption to certificate-of-need requirements. So that would allow in King County to make a one-time edition of 60 psychiatric beds. So this pill is now on second reading on the Senate rules committee and await awaits further actions. So those are a couple of chain. Is to that one. I also wanted to touch and you talk a little bit about the funding the school of this has been an issue that all of us have been working on now for years and if we're going to expand the Beds which we need. We also need the resources to do it. Yes, and that is an ongoing conversation. We keep hearing out of both sets of budget, right, you know, we need more we need more places to help people and places are people to seek help for a variety of different places at there at that moment. It's my nursing. This is not just physically in this one, but there is some there's some funding as it didn't have to go through Ways and Means. I wanted to also just point out with this one up that that that is important is that it would also allowed in hand straight to be paid to nursing homes at the converted to assisted living or residential treatment facilities. So again, More options this time with an existing facilities. It's it's a good boost to the number of places that we have for people who are in need of assistance. And then moving on to page 11. The bottom of page 11 1870. So this is the patient protections under the Affordable Care Act this would so Karen just passed me a spreadsheet there that showed somewhere close to ninety million dollars. I think 5916 and what's the other one attached below 9 and then there's that the same 17.8 and 4 that was very different issue. That was for the Medicaid rate increase. Okay. So it's at 69 million dollars is that Statewide cuz you know that we could use that 69 million dollars multiple times over just in Seattle. Yeah, it is my understanding. It is Statewide. Although I do want to point out that in its current form. We could use funding that would be allocated under 1406 the local-option banville for a variety of Capital Improvements and potentially operations and maintenance to so those would be Local funds that we would keep within our own local community after you know, we clearly have demonstrated a a dedication towards providing funding from our own local resources or repeated repeated support of the House of the housing Levi. So that would let us oft into using 1406 is funds which is bonding as the state sales to pass the state sales tax in with the county with the money as well. That's so what's really important here. And I just want to beat this bush as much as I have to do it for the state is that we know what is going to make a difference and that is to get this medically assisted Treatment available to people but it means more beds since city does not have the sticks and the carrots that we've been hoping for Statewide to get other cities in our region to step forward. Like we had hoped there needs to be that conversation is that we appreciate it. Thank you for the 69 million, but it is a fraction of what we need to really be. Go to address his problem. And this has been the far front of many of the budget writers concerns to just this is something that we in every Community there is a need for increased funding its you know, it's the funding level that they're at right now. That's that's not to say this is the final funding level. We'll see what comes out of a component too. I mean there's that there was a much broader that was just one component of that at 69th Lane and I'm happy to follow up with kind of like a list of the things that were looking for like what are preferences from other that speaks to what are in our needs are in this area around the growth management act weather with carrots and sticks its like the state's going to help but every jurisdiction has to put forward its own growth management plan. And if you don't then you don't get the funding for the other things you want whether it's transportation. Whatever of the cities were looking for and frankly, I think that this is this is has a reason to be like the the most significant issue and the health care across the state. I'm in I'm just hoping that we are leaving the conversation on this. I'm so I just like to add you know, I think one while we work in partnership with you know, many stakeholders Statewide Statewide finding all often helps get important proposals that also help the city of Seattle cross the finish line. There's a an incredible opportunity for the Behavioral Health Community this year and the development of the behavioral health Innovation Center. So that would be right in our own backyard. This is a huge priority for the University of Washington and there are still some things in play around the budget but that is I believe referenced in the house at 34 million with significant investments in psychiatric resident a psychiatric Residency program to address those Workforce needs as well. So those would be Add here in in Seattle to address those needs of our community as well as 34 in addition to that 69. It's not out of that 6 minutes and find it in the house budget in the Senate still some things to work out there, but significant priority, that would be very helpful to address some of the needs that we know are important to you could thank you. Just returning briefly to the Affordable Care Act protections. I wanted to just let you know that this this passed out of legislature and is scheduled to be signed by Governor Inslee on Wednesday at 2:30 the great Bill a great hurdle to have overcome to get this through. We're really excited about the progress is still has made and we're very excited and I wanted to also just briefly touch on opioids. So page 12 If we look at 5380, so this again is the governor requested opioid Bill focused on treatment and Recovery pregnant and parenting women opioid overdose reversal medication and people with opioid use disorder who are involved in the criminal justice system. So this pass out of the House Appropriations Committee on April 8th. There were two amendments that were adopted in that committee. The first removes requirements that Medicaid and state-regulated health plans provide coverage without prior authorization, or at least one of at least one prescription drug within the drug class of substance abuse within substance abuse disorder treatment and the Second Amendment would make some changes to the terms are used in the bill. So we're still getting our terminology right as we continue to talk about substance abuse disorder those those were changed in the Bell. I'm so right now the bill has been placed on second reading and house rules and SO waiting for their action or very closely monitoring this one. It is primarily a access to treatment Bill especially the inclusion of and as well as those who are involved in the criminal justice system with a great brought thing to are there any other questions about the health-care section? I can answer. Okay, great. We'll move on to housing. So we have a couple on page thirteen. So the real estate excise tax the re proposal that we discussed this would this would allow cities and counties to use read to funding to continue construction of affordable housing projects. And this would also push out that Sunset issue that we had discussed. Maybe three weeks ago two or three weeks ago. So this pass out of this office on at floor on April 10th with a vote count of 34 to 13. So the bill wasn't changed by the Senate soda, and I'll go to the governor for signature. So that was great movement on that bill. So I'm at 1 there was a sunset associated with the original underlying language of June 30th of 2018. So what was the word of the language end up as it relates to is it a permanent use now or is it just an extension? Yeah has been pushed out yet. I thought it was so we have time to work on that. This was a critical Belton before this year as the sunset was rapidly approaching for these funds to be so word some sunsets till June. So not eliminated just extended but it was a critical extension as it was rapidly approaching and that would have been a big hit to a lot of cities too. And so what's the what's the what's the work plan on moving forward on that in order to be in the same situation over in this time where the sunset was upon us that went into this bill being passed on it generate a lot of communication with in different cities. AWC was really helpful to this that communication that's explaining why this is a critical need to move through the process and extend that timeline and also add additional possibility for use of these funds for affordable housing projects that conversation is not going away. I think this really pushed everyone to sit and look back and say wow you really need to keep this going and maybe make it easier to access additional funds so that momentum has taken place and that's how this Cast this year. I have to imagine them and I'm going to continue to grow I think the the deadline was was catching people off guard. And now we know the new deadline we know we have we have at sperm time on that. We need to go about extending this or doing a potentially a permanent Sam extension. That's that's going to be up for others to decide but this is this is definitely one that will not soon fade from every and I'm not seeing the other Reit bill in this section is that dead? The one with the progressive said it could could always come back. But yeah that we were not seeing it as part of that. So the bills are necessary to implement the budget and still very much part of the conversation so that they're utilizing slightly different ways. And so they're still trying to figure out what they're going to be what is going to be used to fund. And what does the different tiers will be very much alive. Just so I'm following conversation is the other read that comes from Gonzales is referencing the three that we've talked about. So initially Senator Roth has had proposed every 3 that would be dedicated to very specific accounts within the state budget that failed to move forward. So I'm Senator when I took up the bill and he has been championing that through the Senate right now. It's it's well known he has the blessing of Sundar office on this one. So they're continue to work on it. There are specific pots of money we can get you that list to I am forcibly don't have it memorized. It's a quite a lengthy list, but it would support a wide variety of projects not just related to affordable housing them that cracked while the initial proposal by there are multiple of three proposals. The one that this is replacing was the one that told her office had put forward a few weeks ago, and that was not Focus specifically on affordable housing that was like this one one that would provide two pots of my money to different parts of accounts around the state budget. There were there was a report for affordable housing proposal that was put forward to I think there was a lot of conversation around this year, which is good because that means we continue to talk about it and sessions moving forward but it's my understanding that the the re proposal that Senator that's but the replacement for some of their offices proposal is the one that is truly a still going and correct me if I'm wrong. I think that's the that's the one who still moving and when you say it can find numerous pots of money including affordable housing resources. I'd have to go back and check. I think that might be one of the pots right now. It's really trying to stick to this kind of traditional way that rates are carried out funding why is so you know, Vanessa local communities that type of thing of it's also not proportional to so that was something that we are a little disappointed to see this year. We were eager to have a proportional reads as Seattle King County would very much have generated the bulk of those funds. We would like to retain some of those that conversation. We we push quite hard on but I think at this point they're just focusing on getting an additional. I'm walking to you and how those conversations but he was really helpful on that and send her when is well. Okay, and then again our favorite Bill, well, one of our favorite type 2 in the section cut 1406 the local-option bonds Bill continues to move. It's been declared necessary to implement the budget we're doing almost daily vote count calls with the Coalition of folks who have actually crafted this since the proposal that it is today. This is very much a priority for leadership were considering to work on it. And if it's if it's possible if we need help with different members who loves to connect with some of you to help make some of those can I touch them and remind them how important this is Statewide also within our delegation for Seattle and King County. Oh, we will will keep you posted. We really appreciate all the help you guys have went to these issues. I wanted to also pass along that 1923 the minoan density Bell. It's has passed off of a floor at we imagine there might be some like currents that needs to take place. But that walked on the moon for the next few days. So it did passiflora wanted to make sure that that you all were aware that I know that was a big a big passions all for you all and then 5812 which is the ATU bill is still moving through the process. There was some great work was done on it coming out of the house local government committee representative Paul at Arbors in a Peterson or wonderful on those conversations. So we're continue to track its development. We are hearing that the prime sponsor is is starting to socialize that he is not sure if it will move forward this year, but I think the process that went into this what Know that you bail so that's that's 5812. That's the the Builder was put forward by Senator Palumbo, you know, there's mix messaging going on out there. But I think just the policy discussion that went into this is so helpful. It really showed how he could increase capacity and how we can also kind of work within communities to help them get there and help them, you know, not every Community has what three or four floors in smt of planners. So we need to be able to help those smaller communities with their own planning. So I'm really excited about just the policy level discussion we had on here it was it was frankly one of the most rewarding policy discussions we've had because it wasn't sides. It was really just how to be achieved this together. Yeah. So that's moving forward and then to see if adult thank you. So that is on on the bottom of page fifteen. This is the Sip exemption for City sanction encampments and shelters. So it is right now, 1 rules we're working very hard to get it out of rules and onto the floor. There was some great amendments that came out on the house side wants so when it came out of the side of their a couple problematic amendments one was limiting was prohibiting the use of drugs and alcohol and these These are meant to be used during a state of emergency. And when we had the inclement weather like we did this past year those them at that event would have prohibited us from allowing people to come in to safety and to warm because they are active users. That's something we never want to do. We want it. We want to protect people that the entire basis for the spell is to save lives. So that was running counter to that goal. So that has been stripped out of the Bell. Additionally there was a proposal in there that would have severely limited locations where we could say, bye-bye. Tying it to schools at schools has a very broad term your Traditional School year. I mean, you're early learning facility at a neighborhood daycare. It would have had to run. A thousand feet away from that and we strip that back quite a bit. So we do have more root more areas. We can put these bearing in mind that Seattle does a really great job of doing the community agreements, I believe so when we do put these in we going we talk to people in the community and we do really want to understand what others to understand that's a great process to deal with in their own fight these so like I said some rules we are pushing very hard Center when continues to be just a wonderful champion on this bill. He's very eager to see it move as are we so keep you posted on that keep your fingers crossed, please. Turn any other additional questions in the Housing section, I'll go ahead and start on Public Safety beginning at the top of page 16. We continue to see while there are significant differences around the different chambers run budget negotiations right now. We're staying consistent strong bipartisan and often unanimous votes on many of the council's public safety priorities. I'm going to start on the top of page 16 with sexual assault kit notice the bill sponsored by representative Kildeer that would connect survivors to Providers and although it removes the financial penalties that were initially in place in the legislation. I know that's a point in frustration for the council. I think work will continue to happen in this space and The Advocates are heralding. This is a step in the right direction on a providing appropriate care for survivors. Pasta House, unanimously has survived all cut offs and to date and is currently on the second reading calendar in the Senate on the bottom of page 16. I will highlight. One of the most amazing achievements I think for victims of sexual assault the session how to spell 1166 sponsored by representative or while. This is the proposal that would fund the backlog of untested sexual assault kits in Washington state with past the house unanimously on March 6th and off the senate floor with another unanimous vote this past Thursday, April 11th. So congratulations too many of you who've done a significant amount of work on this policy and then move to the middle in my conversations with Center or while we had some conversations around what Seattle has to do in order to address our a backlog and there was a little bit of force in terms of do we need to make amendments to our a municipal code to be part of this or do we not and I think I'm still A little confused as to whether or not the bill that passed requires the city council to take some legislative action at the local level. In order to 2 beats are part of the overall package. My understanding is that these resources would be made to all communities Statewide. So I'm happy to check on how that intersection intersects with our local local Municipal Code as well. And I'd let you know but my understanding is that this would address the Statewide backlog of untested sexual assault kits including what we submit to the State Crime Lab. I think the issue is that there were things that we collect that are not collected through the Washington State Crime Lab that also are part of the backlog and I think that if those are not untested sexual assault kids, there's probably still some work that will need to be done around around that evidence collection. But I do know that the the sexual assault kit testing is something that would be available to the city as well. And I think Karen has been trying to jump in just going to say that I do believe there are some requirements for what local ordinances adjustments. I will have to be made to address the issue that you're talking about. Okay, great. So just tell my colleagues know I've been waiting for the state to take some level of action in this face before taking any action at the local level. So I anticipate that we will be addressing some of that fixes that needs workers were a local ordinance to allow for the testing of our specifically collected sexual assault kids and other types of DNA kits that would be in compliance with this state law and there's other than a Geo that was put out specifically about the attorney general opinion classified that there was something of a hornet adjustments. I need to be made so we're happy to get ya. I read that and it was a little unclear to me but none the less. I think it's an important thing to be in the abundance of caution. I think it would be important for the city of Seattle to amend or Seattle municipal code to bring it into compliance with us than to be able to qualify for some of these dollars in the very clear away. So I'm shocked as done as significant amount of work on that as well. So we could we could have the city attorney's office follow up with you on what those visiting next episode look like you're in contact with them and I have a ton of them already. So we just want to let my colleagues know that that's something that's going to be on the docket for my committee and then in the coming in the coming months. Great and then moving on to the middle of page 17. I'll just highlight a domestic violence law enforcement House Bill 1225, which is that represent of bingen proposal that would require a law enforcement officer secure Firearms when responding to domestic violence calls that passed the house 6238 and then off the senate floor this past Thursday, April 11th. I will then move to Native American women on the bottom of page 18. We have some exciting news here on House Bill 1713 sponsored by represent of mosbacher that wood crate training and liaison positions to improve best practices relating to missing and murdered indigenous women that bill has also seen forward movement since our last briefing as it passed the house unanimously on March 5th. And since we briefed you last has also passed the house or the Senate unanimously on Friday April 12th. So we will keep you updated as as that bill signing his got Holden would be great to have you down in Olympia for that as well. That yet. We don't but will definitely be monitoring that and let you know. It should be relatively quick for. Before the governor has to sign it before the completion 750i. Finishing in the public safety session on a sectional does highlight death penalty elimination on the bottom of page 20 Senate Bill 5339 sponsored by Senator Carlyle that would eliminate the death penalty in statute. The bill pass the Senate 2018-19 on February 15th was exact out of Public Safety on the 1st. And while it has not moved from Rules since our last briefing the governor has announced publicly. He will sign it. So we do anticipate forward movement movement this year and will continue to keep you updated on that as well and then moving to safety net and civil rights towards the upper middle part of page 21. I will highlight a certificate of discharge. This is representative Hanson's New Hope act House Bill 1041 that would address barriers to employment housing other obstacles by expanding eligibility to vacate certain non violent criminal records and not has also survived Alcott updates having passed the house unanimously on March 1st and the Senate on April 3rd. So congratulations on all of the heart. Lily have we talked about how people who are returning to their communities are they can Access housing cuz I know that's part of what the certificate of discharge for doing. Nothing around here. We had something that though it was a different acronym but it was like a certificate of restoration. Thank you and part of the problem we had was to make sure the case managers could take people by the hand and help them move through landlords. And so part of the of our landlord liaison program that we've set up was designed to do that. But I don't know if we've got a whole you know, what I'm hearing is little pieces and whereas we really need to get our arms around this whole project so that we can get people in the house lately and I think coronation at the local level when this. You know, I think given how significant this will be in terms of access to resources and re-entry. This is something we can certainly work on the backend to make sure that we're connecting around what what resources we can provide locally to address that access here to be on for a long time and council president. Hero was a big supporter. So let's see what we can do as soon as you know, whether this gets through happy to do that. And then finally I will highlight towards the bottom of page 22 a wage and salary information House Bill 1696 sponsored by representative Dolan would expand on the the Equal Pay success last year by prohibiting employers from asking about pay history and not passed the house 56 240 and off the senate floor 37 to 10 this past Friday, April 12th. So continuing to see movement forward there around pay equity. And finally I will highlight the lgbtq commission on the bottom of page twenty-three top of page 24 that is still advancing quickly coming past the sea. Set 34 to 14 on March 6th and off the house floor with a boat of 67 to 28 this past Friday, April 12th. We don't we will monitor that closely and make sure to keep you updated about when that scheduled also dealt with the pay transparency issue that that ensures that employers don't take any sort of retaliatory action against employees who are sharing information with other employees about their their wages or the level of their compensation in the initial equal pay Opportunity Act. The any retaliation is prohibited explicitly in in that legislation. So I think this is just building on that prohibiting employers from tracking a given, you know, a lot of a lot of folks are trapped into lower wages. And then when you were gauging how much to pay someone moving into a new a new career for what they Aaron's previously that that is another part of the body challenge that that a lot of a lot of employers face by by determining people's salary range on what they earned previously about retaliation is explicitly prohibited. Thank you. And then I can I ask you one question. I don't think it fits on your transportation. So we may have skipped it in. This was representative DeLeo and pettigrew's work on urm funding and Pacer financing did that get through? Where are we did not go through update on it. So I don't know if there's any adjustments or was that another bill, but the original Bill itself did not advance but let me follow up with you on that joking there any additional developments we had some very interesting conversations with some folks that are looking at work in our International District as well as Pioneer Square in the Pacer financing can be a big asset so I'm so quickly for transportation motorized foot scooters and gross up at your house bill 1772 on page 24 pass out of the Senate on Friday the 12th. I will devote of 35 to 7 at the send it at the hold opted to adopt the Amendments that were put on the bill and the transportation company so that the insurance industry in the month because of this change at have to go to the house for concurrence, but you know that there are many parties that are very eager to see this through so we don't anticipate any issues. So you anticipate that the folks who were originally supportive of it will still be supportive with these and I do okay great. Well, I'm just for our call is knowledge. I received a handful of messages from our friends down in Olympia who are trying to move this as a scooter Bill through and they just wanted to underscore their appreciation for our willingness to work on amendments in to work with through all of you to get this through. So, thank you very much. The Little Engine That Type weak the Amendments on the bar right now and we've been kind of going through those and seeing what works without which ones work on which ones don't but we have a pathway at this point in continuing to work on that. So I'll keep you posted and we really want to thank everyone for all of their work. I'm in there quick attention on this working with such a large stakeholder group has been a significant effort disability rights Washington and inverted of rights have been extraordinary Partners on this and so many council members have taken gone above and beyond in helping us work with you on this one because when we were down there a couple of weeks ago you thought this thing is dead and you know, we kept saying we're not getting off this horse until we get some life back into it. But really thank you and I do Acknowledged Roots is out there. I was so impressed with that little 1-minute video. They did I didn't have anything caught people's attention. It was that well. Very grateful for all their work. and if there aren't any additional questions and Grill finished portrait Okay, so let's keep going down the agenda. Let me say a few things and then we'll go around the room and then we do have an executive session right after. From the governance and equity and Technology committee. That no one's paying attention to her because I can't even hear myself and back to me. We have the appointment of our hearing examiner the final evaluation and he's responded very well at least amount of pain into the questions we had of him. And so we expect that to be voted out of committee this week actually tomorrow morning at 9:30. We also have two other appointments to the international special review District board and actually two appointments there and I want to thank all of you for giving feedback on the hearing examiner and we again actually did surveys and questionnaires to employees in the office and constituents and I'll try to do our diligence and that looks very favorable. I want to talk a little bit about the public for many questions on that bit about the public forum this this evening as you all know on the applicants. We had 13 we have had one withdraw. So we anticipate Tonight from 5:30 to 8:30 in the birth of night Lana's room 12 applicants for the form this evening a little bit of description on the process we used. We reached out with the clerk's office and our staff to about 35 to 40 Community organizations received a lot of questions 15 Community organizations, too many questions and 14 Community organization confirm their participation. It's nights forum. There were over 50 questions that were if you look at the total number of questions have come forward as we posted all of the questions. We made it clear to the candidates that they can answer all of the questions that they not required to and to the extent they want to answer the questions will post their responses online on the format tonight about 5. The doors were open the applicants in the community organizations or after I've been around 5:15 or so. And then the moderator Brian Callahan will start around 5:30. It'll start with an introduction by the 92nd introduction by the qualified applicants the moderator or last three questions comprise from the community groups and then the community organizations will sort of be in the room at different tables and then Brian will take questions from the audience and from the organization's we anticipate the hearing will last till around 8:30 and at the end each of the applicants could give a Closing remarks, so that's where the format this evening and it'll be broadcast life. Yes, I may have missed your summary of how many of the how many of the applicants have committed to attending. So I must say that one of them were still trying to get confirmation. So 11 with an answer to the 12 one person dropped out and it is mandatory or described as manager. They participate so we're just having some issues the one person we actually in contact with a person and they are just not be met with her all that make you fart or just working at 2. We'll have at least 11 confirmed maybe 12. And one thing about in again public place want to make sure we're very open and transparent on what we're trying to do on so Wednesday, April 17th. I do have a question for you all to give me Wednesday lar opportunity to ask questions of these applicants and again to cancel Gonzalez's point. There will be either 11 or 12 for Matt that I'm proposing is that we have them all here and that we give them each 3 minutes to describe why they think they should be selected by us a serve their presentation to us. They've all been told they have three minutes to do that. And then we would ask the council members the Council of the applicants questions. And the question I have is assuming that there are 12 spend 5 minutes with each applicant battle to give them 8 minutes total. That would be 1 hour and 36 minutes. If we allow them 7 Minutes of question. To be 2 hours and show Bleeding for an option 2 is on diagram. This would be about a 2-hour hearing and each of them would have about 10 minutes of Q&A an and there's certainly going to be paired in each how we how we asked them both questions. And so unless I hear a strong objection will do the 3 minutes and then 7 Minutes questioning each one and Indian was her to try to time that's we have some parody customer Brian, please on the parody front with eight of us all very intrigued about who our future khalili I'm we we might all spend all seven minutes of their time asking the questions and so how how you manage that? I appreciate your leadership and I don't know how I'm going to do that but I look forward to seeing it just understand your concern. Our question may take too long as opposed to the response time. So it's going to be much longer than 2 hours remind me to clarify that so they are there response time will be the 7 minutes not are questioning of them. I'm wondering if I could imagine a really good question that I would think up and I don't want to ask all 12 people that question and I imagine each of us might want to do that and I would start to get pretty long. And so I don't know if there's a way that we can come up with at least, you know, maybe half a dozen things that we'd ask them to touch on in there the remarks and then we could be doing more follow-up things or I realize that's a good suggestion. So what will draft up and will give it to them at a time is perhaps and give me the feedback on what you want them to touch. You know, I'm sure most of them talk about the qualifications in their commitment. But if you have ideas, maybe four or five bullet points you want them all to touch on will let them know that even before Wednesday. So hopefully they'll cover that. You raise another good question on. The parody she's going to be a little tough to challenge and there's no check with law and ethics. There's no requirement that everyone gets the exact same question what the requirement is that they all get an equal opportunity to display their abilities. And so I do anticipate there's going to be different questions and you know these three of these four because they're there could just be different points of him for you have on this one. That one so we're not going to be strict on everyone has to answer the exact same question. Answer to free flow a little bit. But did the other point is it is going to be 7 minutes for just a response in our questions. customer Moscato So just to clarify. Is there a certain date that you like questions from us by that you're going to be sending questions to the candidates so that they have something in writing. So I was just going to let that floor organically on your questions to the candidates and part of my thinking is that's sort of what we do right? I mean, I don't even a question you're going to ask me so who started want to see on a real-time basis how they respond to real-time inquiries so I can turn back. So I think would cancel my bro Brian Reyes. I think it's a very good point if we could have four or five areas that we would like each candidate to address during their two-minute conversation to us that will give us an opportunity to focus on what it is most important to us. We give them those hands ahead of time and then we'll still have however many minutes to a specific question that I think if we could get those questions to you by this afternoon so that you could get it out to them giving them to know essentially 36 hours to prepare. That would be helpful. I forgot to just mention I count on her old is an after all of that. We were going to give them we're looking at one minute to do a closing statement because there might be something they thought about after show. Dracula name of 7 Minutes loop back and all 12 of them would have one minute of a closing. Counseling herbo provided sort of the opportunity to ask the in writing the candidates to respond to our interest in their qualifications with that have described in an in writing in advance. I see this stage is being much like a job interview. We actually don't give the candidates are questions in advance. So I would ask that we sort of rethink that part of it. Let me be quite what I'm what I'm hearing what I'm saying. So I wasn't time I gave him in the questions in advance. What I was talking about the is in their introductory 3 minutes, there could be some common things you want them to say that someone questions just make sure you cover this in your opening statements. I was looking for that feedback on the questions. I agree with you that I was going to let that floor Gana clean and just have at it with who you want to ask questions. I just don't know how much we want to coach in their opening statement. Stay the night. I just think that that's part of a part of this process is that the individual, you know, I'm telling the story and making a case for why they should be considerate and that's why we're having this discussion. So what I'm hearing you say is we're giving them 3 minutes and you're suggesting that let them use their discretion. What they think is important for us to hear any feedback. So what I'm hearing you say, however customer Browns you want to make sure something's covered in a common things covered in all those there's attention here and I appreciate Council and her bows points to I'm thinking friends since maybe they're all watching right now, but I'm curious to hear what your land experience is likely needs to be trained that committee and so something that mean that was kind of in the application to so hopefully that's fairly obvious. But if they're a handful of points so, you know, Curious to hear about your land use experience what you know about the race in social justice initiative a couple things like that so that I'm not competing to ask follow-up questions and everybody with all of you in a limited time. We could still come up with that question. We still have to provide in in in advance assuming that one or two of us might get asked a question for candidate and there's some things that I think if we all know if we all agree on that you might be nice to do but they hear Five Points. You may want to cover in your in your opening remarks obvious. What we want 10 horses recognize. I wanted the viewing public to watch and Sean are number one fan here to know that we have to have this discussion public. To comply with open public meetings act and that's why we're trying to make these administrative decisions. Now we were ordering executive session. We were able to talk about the qualifications of the candidates. We were correctly advised that the procedural issues on the format that is best reserved for an open session. So to some extent I try to do this one-on-one or at make description and cause with this procedure so important. I think we had a discussion on how we form at this cancer awareness. What issues are pressing on our city right now, so it's not a big surprise. I mean homelessness obviously there I can we can list a few more and I think to council member Brian's point. We don't want to be in the queue trying to raise her hand about the most obvious issues that I think they should be addressing if they're going to Be a council member for the next seven or eight months in which we have the summer to get to and then a budget to do and there's other issues as well. So it isn't anything new or surprising that that this candidate are these candidates wouldn't wouldn't already know about if they're not reading the news and they live here and they want this job. So I think it's smart that if it's three or four questions that we say, you know, you don't have to but these are four issues are four questions that you could touch on or not. But cancel this this this party is interested in how you would work with your colleagues in the city to address some of the most pressing issues. I should have got a middle ground. And so what a likely do is send them some suggestions and they don't have to come in the mall. But this is where things are interested in. I'll send an email to all of you too short to see it. I will send it to them. But they may go off script in the end. I will give them the lab should go off script. I'm not answering that. I'm going to tell you why I'm the best and so I'll come up with some general kinds of questions that they may want to consider in the three minutes that the larger question I have is in just follow my math for a minute if you will. If they have their three minute introduction in assuming this 12, and we just spent seven minutes with each person again. And we allow them a minute of closing that still takes us to about 2 hours and 15 minutes and my concern is the seven minutes of Q&A with a candidate may go quickly cuz we have eight of us. and that's just my discretion. I could say 10 minutes an applicant or I can say 8 minutes, but I actually look down at 5 minutes which was an hour and about 36 minutes, but the 7-minute sound about right to you all because I don't want to shortchange your ability to as Locker. We could go 3 hours and 15 minutes. If you want I do say before you respond that we have all the written materials there in a community forum tonight that will be televised. I'm sure we will all watch and there's really nothing prohibiting us from talking to them offline. Parameters that we're again, we're trying to treat everyone the same but if you have follow-up questions and you may follow up with them all if you want so a 7-minute sound like the a good balance are do you want a little more Q&A for each candidate? I got sued thumbs up and nods 7 minutes cuz Even Stevens 3 minutes to dress five questions or categories is completely unrealistic for the for those of you who have run for re-election recently and you can ask the question of homelessness in the city of Seattle. You have 30 seconds ago it mean it's just I I appreciate what you're trying to accomplish here cuz I'm going to manage my own expectations about what I'm going to get out of that hearing in a span of 7 to 10 minutes. I didn't understand. I didn't think we're going in circles just because I'm trying to get some feedback of where the 7 minutes is enough time or not. So I'm in hearing it is skinny condensed, but we are free to contact them and them us. In the event it every night. I imagine some of you just like I have been getting contacted by the applicants there is I just want to be clear that there's no prohibition on us talking to applicants. Is that correct that week? We're free to talk to them if we speak to some required to speak to all that is not my understanding - shining is that just as their race is going on. You don't speak to every candidate the people are applying to pick and choose who you want to talk to and there's no requirement that you meet with them all that's my understanding and fiddling differs. I'd like to hear that is my clearly my understanding my comments about the seven to ten minute window, but for me, I just really feel like I need probably need to spend a little bit more time and be a little bit more understanding of Where these folks are coming. I'm not sure that we get that from 10 minutes, but knowing that that is something that we can layer on top of the overall process I think is helpful, but I'm just trying to manage it and we don't want no for 6 hours. There are other ways to get some information plus we want to bring the public into the people. We are evaluating. So it is a job interview. So I'm hearing that a strong objection 7 Minutes in the calendars for much longer than this. 7 Minutes allows because because I don't know how long your questions are going to be. So we erred on the side of long questions. Based on historical practice. I'm throwing this out for an inquiry not necessarily is a position that we all want to leave on but does it make sense for us to present questions? Do you have you asked the questions and then if there's somebody has a burning follow-up to do that. So, you know if 7 minutes and feels just too compressed that if we spend it to nine or 10 on a real-time basis, we just do it for everyone so and I don't know again how the questions are going to be. So so we blocked off some time for it. But on a on a perfect if everything is executed perfectly to be too and less than two and a half hours, but we'll see. Say so does that include is there public comment at this meeting? Good question. Nearest public comment at that's that's that's why the longer produced by the common at the end. I forgot to mention that I'm still at the end. This begins at 5:30 on Wednesday this Wednesday at 5:30. And it public, that was a decision that okay to go perfectly. Okay. Thanks for the feedback is very helpful and will continue playing thank the clerk's office in HR and Centris everyone putting all this together. So it's a lot of work behind the scenes making sure we make the right choice with some discretion. So I really appreciate your willingness to engage with us on it. So what I have on this council's full agenda. Headed to closed captioning in places of public accommodation and passed out of committee on the 9th and it was introduced and there were amendments pass to accept exempt programming or closed captioning has been way from state or federal requirements in there was also an amendment permitting the limiting of closed captioning in TV show room so that at least one television of every model would have the closed captioning turn on but not requiring all televisions to have a closed captioning turned on there will be Amendment and Amendment and Destroy amendment that you'll be receiving before noon today related to the racial Equity impact. And again, you'll be receiving it in your email by noon today. We've been working with you write on it happy to answer any questions that you might have. No, civil rights utilities Economic Development Arts committee meeting this week. But we do have thanks to chair O'Brien for the plug committees a couple of bills that I've been working on one is a resolution on the North Delridge action plan the resolution recognizes the work of Delray community and Elsa planning committee development to produce the north Delridge action plan. The north Delridge action plan was actually finalized last August, but the community really wanted the council to take this action recognizing it and then finally, we have a an update on the vacant building monitoring program legislation that we passed during the budget process is part of our budget deliberations. We identified That the bill would go into effect in June and we identified some specific amendment that we wanted to address some of them priorities of of the executive in the office of Department of construction and inspections. And so we will hear that bill for the first time in committee this week on the 17th. And as far as events going on this week, I'll be visiting with a class at Rox Hill Elementary. I'll be doing on Friday a tour of South Delridge with scci regarding the vacant buildings there working to set up a tour with the East Junction neighborhood group regarding Sound Transit. I believe council member bagshot went on a similar tour but in Delridge earlier over the weekend. And also as related to Sound Transit, I just wanted to highlight the fact that a couple weeks ago. I requested that sound transit provide the public comments related to the scoping. To the stakeholder Advisory Group in the elected leadership group at least a week before the stakeholder Advisory Group meeting at which is this this Wednesday the 17th, originally Sound Transit provided to provide those comments just two days before the meeting and I just want to publicly thank Sound Transit for responding in a supportive and favorable way. They actually were able to provide the comments of full week in advance of the meeting coming up on the on the 15th at 1600 pages of scoping comments. And it's one of those situations. Where be careful what you ask for. You might get it a lot of our community Advocates who have been following this process carefully. Have there in boxes full of stuff in comments to review before this. Thank you. Kiss my phone at 2. We have an ordinance on the King County Conservation Futures Levy proceeds of her briefing discussion of possible. Vote. The proposed ordinance will significantly streamline the conservation Futures letting that's the CFL interlocal agreements amendment process. The streamlined process will go faster reimbursement for Seattle CFL projects have been awarded funding by the King County Council. So basically this is just I'll make it easier for us to receive the money allocated to the city of Seattle. So regarding the select committee on the library Levy as you all know last Thursday the select committee on the library Levy meant to hold another round of discussions for potential amendments Central staff provided us with a chart to compare implications of each Amendment on the resident on the on the residence as well as the proposed Levy the amendment and proposal and full will be up for a committee vote this Wednesday at 2:30. So it looks like we'll be doing that before we move on to the filling the seat of the council member. So hopefully we can move quickly on that and then the final vote for full Council on the library 11 will be April 22nd at Council it to Very good. Thank you customers for you work on that, too. Knowledge the library work and all of the folks that came out for the public hearing. It was just a lovely as civilized approach to do that. Thank you and thank you for your organization on that can't remember where I was so we have one item today for 5 minutes and neighborhood Committee in in in essence. It's a clean up its regards our Waterfront local improvement district and supplemental appropriation sis is going to authorize an executive and execution of an MOA a memorandum of agreement the Washington State Ferries regarding provision of electrical service at Colman dock. I spend you accept non city funding from Washington State Ferries is also going to authorize the exception acceptance of non city funding from the Washington State Convention Center. And that's for the extension along Pike Place Market from the market up to essentially I believe we're going all the way. The Melrose in there in the pike-pine corridor and then it will mend our adopted budget accordingly to accept these funds and to amend our Capital Improvement program. So I Eric McConaughy. Thank you. He wrote an excellent staff memo on this last week. So that's available to you if you wanted and that's what's on today for our positive vote on the introduction of referral calendar. You probably already saw that there is the confirmation of ammara Khan for our new office of the employee on but we are really excited to be able to bring the sewer company for consideration and just want to make sure that folks have a full sense of what the calendar will be. You will also get a packet from us a mini binder that includes this timeline if anybody's interested. Participating in the confirmation process plan to have dr. Khan's appointment in the May 2nd housing Health Energy and workers rights committee. Please send your questions for this appointment to our office by 9 a.m. This Friday. Please send them to Freddy this way of us and we will send you a reminder via email so you can respond to that as well. All of the written answers will be shared with you all by Friday, April 26th. That'll give us hopefully enough time almost a week to have you review the questions or sorry the answers to our questions and then we'll have a briefing and possible vote in our committee on May 2nd with the hope to have the new on bud approved and in full Council on May six. Thanks again to the mayor's office for including the members of the interdisciplinary zat aracari interdepartmental task force who worked on harassment and assault and came up with the framework for the office of the ombudsman. The selection process of this new director or I should say in the selection of the ombud's were very excited that she received a lot of positive notes from those who participated in the robust process are the next meeting of the housing Health Energy and workers rights committee will be Thursday April 18th at 9:30 a m. That's this Thursday. We have the first of a series of meetings on our Fort Lawton Redevelopment plan as you also mean have received already and if you haven't will get that to you shortly a Fort Lawton binder. This is going to be a series of meetings that will also be coming up. There is a updated Central staff Memo from Tracy Radcliffe that will be sending around later today with the materials so that you have a sense of what is on the docket for us in and hopefully closing this Loop that many of you have been working on for what 10 years. So we're hoping to have a 12 years will hopefully be able to get back to you later today to put on your calendar that there's going to be a public Hearing in the evening to talk about the fort laud and Redevelopment plan on May 21st at 5:30 p.m. It will be downstairs in the brothel in this night room downstairs. Please plan to come and participate to all of our viewing public. We hope you can come as well. The second thing on our agenda is going to be the annual office of housing report and the slow response to the office of housing recommendations on the home repair Loan program sponsored by council member O'Brien will also have a opportunity to hear and discuss and possibly vote on the work respectful workplace Revolution that's pertinent to the legislative branch in our friends in our department here. Thanks so much for the feedback. We got overwhelming feedback and suggestions on the Amendments all of you have received the Play the draft and I think that it was really inclusive process for getting your thoughts and ideas for that or group that we will be creating a safe time legislation briefing discussion impossible vote, which we will talk about later today what I just heard a remind folks. We did have a chance to hear from the folks at iuoe local 609 and from a member of the school board decorative wolf who came to our last meeting to sort of TF some of the issues that were going to consider in this legislation just by way of reminder. I'm also sending around a letter that we received earlier over the weekend regarding with this legislation does really just as a reminder for folks much of what work we've done at the city level is already codified in the CBA in the collective bargaining agreement for the union to represent folks like the lunch folks that are serving lunch at schools. The folks were cleaning the grounds. These are both Call pink collar and blue collar workers on our school grounds. How much of what the city has done in terms of sick leave is already codified. They're one of the things that they're looking for though is to extend the protections that we currently have in our sick and safe leave rule in terms of office of labor standards ability to help out with enforcement and making sure that people feel like they have the protection of the law. Not just the letter of the law on paper. So, we'll talk a little bit more about that one and make sure that you had a copy of that that referral that letter as well. Oh, oh you make it so I just want to say thank you to our friends in District for I did see councilmember Johnson walking around in the Streets 2 and told him that I was representing is district will still even though as you know, we are looking to fill that vacancy, but it was a great conversation in District for we met with family Works than Family Resource Center in food being right there at in the solid ground building who provides I'm not just food inside multilingual multilingual opportunities for families have drop-in offices of people can use a computer. They have a resources and support that they provide for families throughout the area. I'm not just in Wallingford. They're great conversation was Solid Ground about the work that We are doing to help those who are also not only experiencing homelessness. But the great work that they're doing to prevent homelessness through the prevention programs, which were hoping to scale up as we go forward and I had a great visit with a University Heights Building. If you remember that old building the school. Yes in the U District and learn all about their music programs and their Community organizations that are housed out of that old building. It's beautiful but needs some Renovations. I'll be working with you while hopefully on some capital budget ideas and thank you so much. This isn't that or shattering but I need to say it. I forgot to say this because for 10 or 11 years. I've been fighting for this job. And I finally got it here. It is the Native American law Students Association Tulsa the u-dub they have salmon Bingo every year to raise money and I've been going for like 10 or 11 years and I've always wanted to be the Bingo caller and I said I am Native American I do have a casino. I have a little background and they've denied me every year and other people always win and I'm always thinking is Ragbrai go any anyway, that's it against the u-dub, but this year I actually get to be the Bingo caller. So I'm excited it is I don't I it's this this Friday April 19th, and I'll get you the information starts at 6 and its we've been doing it for what 12 years and it raises it raises. A lot of money is started. I was like 14 people and now It's like pack but since I am now the I am the attraction Biko collar and I'm going to need an assistant. So I'm hoping one of my colleagues will be a lovely a sister to me, these names Husky football player will also thank you in tomorrow Tuesday the 9th cancel my room escape and I are going to be touring our city hall building and across the street SMU for a potential Child Care Center, you know, we put this money in the budget. We have been quacking about that or well well over a year councilmember Gonzalez has been weighing in with us on this show tomorrow. We've got some experts are going to walk around with us. And one of the things that I'm advocating for is that if we can't in 2019 have a full-fledged Child Care Center that we start with an a Infant care center in 2020 and I'm very excited about this the mayor we've been talking with her as well. I think we've got her support and said this is something that we think is really critical and the infant care centers. We all know is that is the most difficult both to get into downtown right now, there's a dire need for infant care. And so we think that we should do that right here in this in this area and city council across the street. So tomorrow we're having a tour and I miss any of you are interested in joining us as in the afternoon. Love to have you. Kentucky dolls, do you want to go before me? Nothing on this afternoon's agenda from the gender Equity Securities Numerica sanitation committee. We will be having a special committee meeting this Thursday April 18th at 2 p.m. The committee will consider seven appointments for CPC. That's a beautiful piece commissioned commissioner positions for of those will be counseled appointments one will be a mineral appointment and then we will have one reappointment from the CBC and one new CPC appointment and that is for the spot of Representatives. So all seven of these appointments are on this afternoon's Russian referral calendar and in addition, my committee will consider several other appointments Andre appointment at my next regularly scheduled hearing on Wednesday, April 24th. Also during the special committee meeting on Thursday 18th. We will hear And possibly vote on the amendments to the families education preschool and promise Levi implementation and evaluation plan and we'll also have an opportunity to consider partnership agreements that will help make the fat implementation evaluation plan operational. So he will be presented as a consensus package unless a council member would like to. Write topic out of the consensus package for discussion. There are nine amendments most of the Amendments bring the implementation plan draft into closer alignment with what council passed in last year's ordinance and companion resolution some of the more notable Amendment language includes a requirement for modifications to the implementation plan to be approved by counsel. It revises the Seattle preschool promise tuition scale. So families are paying a set percentage of their income to the cost of a preschool slot. We also added more more steps would refer to a steps in the income sliding scale. This amendment is intended to minimize the impact of any potential benefits Cliff as families moved from one income scale to the next scale. So instead of having 25 skills will we're going to expand a little bit up to 30 to make that transition a little easier another issue. We are looking into the amendment to this plan would create more space for Seattle promise students to attend that are attending in a part-time status. So during our deliberation process we learned that there is a significant number of graduates from public schools who and roll part time at Seattle colleges. If I remember that number correctly, it's it's it's well over forty percent of students who go into a community college from Seattle public schools are actually attending part-time. The current plan is proposed does not account for part-time attendance in the Seattle promise program. So important modification there there is also ended Emmett language for Seattle promise to specify certain topics to be included in deals racial Equity toolkit analysis such as students who wish to enroll on an exclusive exclusively part-time basis and the potential impacts of what's referred to as status for satisfactory a cat academic progress requirements the last year we make sure that prioritize students would also include Refugee and immigrant students English language Learners lgbtq plus students and students experiencing homelessness. And we have modified the language through an amendment that makes the language consistent throughout the plan. We also have an amendment to ensure there's language consistency on K through 12 investment are eagles will be an amendment for through Z Thursday's committee to ensure Infinity Base Investments are also centered on academic outcomes, like increased instructional time expanded learning opportunities and social emotional skills building as opposed to being so late and squarely Focus Only on College and Career Readiness, which is what the current plan provides so we will then be joined by we will be joined by deals. How does Yale public schools on Thursday for a conversation around the Community Partnerships agreement that was really great operationalize are a relationship with Seattle public schools and Seattle colleges. And I think that is that so I want to make sure that you all we shared a memo from Brad. Members died March 27th, 2019 and that provides all of the background information as I've just described it. So we're expecting to have a very dense a committee meeting this Thursday My Hope Is that we will voted out of committee and that we will be able to consider it a full Council on April 22nd, which I know is a very full full Council day already but excited to Have an opportunity to get this get this out of council. So that those partnership agreements can become functional last thing I'll report actually have two more things have a proclamation that I'm going to pass around. I'm sorry that I'm talking so fast, but I have to be somewhere at 11:30 and I have so much information to share with you guys. So we have a proclamation that I'm going to pass the roll be about thirteen members from the Cambodian Community who will be joining us this afternoon at full Council Holocaust Remembrance Day is upon us and I have a proclamation here that we drafted together with Community to acknowledge the the genocide of Cambodian people in Cambodia during the Khmer Rouge regime and that we do this about every single year. So this is the time for us to again acknowledged and stand with refugees from the Cambodian community in the face of that. And lastly, I will say that this week I will be attending the following and community events today at 11:30 a.m. I am going to stand with representatives from labor and community at a tax fraud day of action that so this is a opportunity for us on tax day to talk about the amount of construction industry tax fraud that occurs within the construction industry and I'll be joining of marriage and Monty Anderson from the south building and construction trades Council and Larry Brown. Who is the new president of the Washington State labor Council AFL-CIO at 11:30 to talk about how we can serve workers in the construction industry better including here in the city of Seattle Tuesday, April 16th at 2 p.m. I am excited to be able to go out and do a tour of the Vietnamese friendship Association and Seattle World school on Friday, April 19th. I will be taking a tour of the new affordable housing development that just opened up in District 3 at Liberty Bank. So if they're excited about being welcomed there and having an opportunity to to experience how we can do more of these projects throughout our city and then I will also be meeting and taking a tour of Urban League Alton District 3 MN Saturday, April 20th. There will be a Washington ceasefire Columbine Memorial rally right here at City Hall at starts at 10 a.m. And is at 12 p.m. It's hard to believe that the Columbine shooting school shooting occurred now 20 years ago, and I'm excited about being able to join cease-fire to to come out. Write the day and to also continue the movement and the mobility towards more gun reform and and sensible laws in that space and then lastly on Saturday April 20th at 5:30 p.m. I will be attending the API Chaya Gala that evening at the Seattle Westin API child. For those of you who are unaware are is an organization that focuses specifically on addressing and ending gender-based violence within the South Asian community and the API comedian General. So it really excited to be able then join them for that. Thank you Catherine Gonzalez. I'm so I'm going to speak briefly to sandelin Transportation committee and the plus committee first will start with sustainability Transportation committee. Agenda. There's nothing from either those committees on suffering is agenda. The sustainability Transportation committee will meet tomorrow afternoon. We have a sample of item on items on that agenda. We will be making appointments to the Seattle pedestrian Advisory board and the urban forestry commission. We will also get an annual report for urban forestry commission and annual Park from the school Traffic Safety Committee. We will receive an initial briefing on a street vacation proposal that would facilitate an affordable housing project on South Willow Street, and then finally will have a public Hearing in a possible vote on legislation that would update our land use code to require new construction to be electric vehicle ready in parking spots. So this is legislation that would require I'm putting requirements in about electricity being available for charging stations for all new construction where there's parking provided. One of the thing I'll mention on the transportation front this afternoon's injection and referral calendar will have a resolution that will come back to full Council the following week. And that's a resolution providing an honorary designation of 22nd Avenue Northwest between Northwest 56th and Northwest 57th L Ballard Library. Commons park to designate that is Rob Matteson way. For the planning and zoning committee. We will be meeting Wednesday morning three items on that agenda councilmember herbold mention two of those already. So I clean up clean up ordinance on the vacant vacant building monitoring policies. And then also the resolution what's the right word amusing here recognizing my trailer is action plan. We will also have taking up a piece of land use that came to the council last year. That's quasi-judicial this relates to the projects located at 7009 Greenwood Avenue North Saint Anthony Ridge. There is a contract that came to the council to go from NC to 42, NC 255 with an M designation. This was remanded to us for a piece of the legislation from King County superior. Corks And so we will be taking up the courts Direction on that there will be as this is a quasi judicial proceeding. We have agreed to allow testimony from both the applicants in the appellants. And so I believe they'll have five minutes each to address with the court decided and then hopefully we will be making a decision based on the courts the courts Direction and what we hear from the public one last note on the public forum tonight. I want to just publicly thanked many organizations that have come out to help coordinate the community event tonight. I want to call them out by name Transit Riders Union transparent Seattle the u-district partnership welcoming Wallingford, the tri-pac associated students of the University of Washington to U District Community Council the huge District small business. Businesses The u-district Advocates Northeast Seattle social justice and Equity Council the n-double-acp the Wallingford Community Council stcc stronger together and the Ravenna Branch Community Association so many organizations, but I've been in many of them will no doubt still participate but these certainly confirm their tenants this at this this evening and so we want to thank them for I've been part of that process. Okay, unless there's anything else we're going to go into executive session. And as presiding officer, man dancing that the city council will convene an executive session and the purpose of this executive session is to discuss pending potential or actual litigation and this gives us an opportunity to discuss legal matters with our Law Department is authorized by law but a monitor from the city attorney's office is always present to make sure we reserve questions of policy for a public open sessions expect this session last 30 minutes and so or less and so it will conclude at 11:45 and we goes beyond that duration. I'll announce in public session at 6, it's extension and the expected duration. So without that that's moving executive session.", "end_time": 6123.0}]}