{"format": "raw", "annotations": [], "confidence": 0.9114377550456835, "data": [{"start_time": 0, "text": "Good afternoon, everybody. Thank you for being here at City Hall the April 15th, 2019 full city council meeting of the Seattle City council come to order 2:03 p.m. I'm sure I'll present the council the clerk. Please call the roll. O'Brien Salon Gonzales Where is President Harold this I will move to adopt the introduction and referral calendar believe there may be a comment. And I was entertainment coming from council member Gonzalez if she is so ready. Okay. I moved to a man of the proposed introduction and referral calendar by introducing Council Bill 119500 entitled and ordinance related to land-use and Zoning amending ordinance. 1257912. Correct map errors contained in map a 423.58. Bo500 Mapei 423.58 C .50 an attachment 12 Ordnance 1257891 and they referring it to the select committee on the Citywide at minatori housing affordability. Is there a second? It's been moved and seconded that the introduction for a calendar b b a minute as stated by councilman Gonzalez any further questions? All those in favor say aye I opposed the eyes have it. Now I will move the introduction and referral calendar as a minute. Is there second the introduction Pro calendars moved and seconded all those in favor, please say I I opposed the eyes have it. Thank you very much. There's no objection. Today's agenda will be adopted. Turn objects in today's agenda is adopted let the record reflect the council members herbold and baksh of dryness the Menace of the April 1st, 2019 city council meeting of interview. And if there's no objection to minutes will be signed. an objection to minister being signed presentations were very excited having presentations led by our own council member Gonzales customer Gonzalez. You have the floor the proclamation today to members of the Cambodian Community to acknowledge the genocide that occurred in Cambodia as a result of the Khmer Rouge regime and I'm going to take a moment to go ahead and read from the proclamation if I made this President, thank you wear as the rich Heritage of nations in Southeast Asia dates back over 4,000 years and where I was during the genocide one of the bloodiest Holocaust in world history of approximately 2 million people nearly a quarter of the entire population lost their lives at the hands of war and genocide between April April 1975 and January 1979 and whereas after 1979 / 100. 45000 refugees predominantly from overpopulated Thai border camps relocated to the United States in order to escape the harsh living conditions experienced in a camps and sought Asylum from a battered War horns. Come here. And where is over half of the members of the Khmer population of experience varying degrees of post-traumatic stress disorder and other forms of mental health issues brought forth by the Khmer genocide and whereas the legacy of genocide of violence is inherited in the form of intergenerational trauma on a 15 ignore use of this generation through deprivation of identity self-knowledge stability and self-empowerment. And whereas over nine hundred more Americans have been impacted by this genocide and re-traumatized throughout systemic oppression and deported back to a country. They have no understanding of enduring separation from the US citizen children family and friends and whereas community community leaders and Elders from across Washington State work together relentlessly to rebuild historical and cultural identity nearly. Exterminated by the Khmer Rouge and to uplift their communities through education and cultural empowerment. And whereas the greater Seattle Metropolitan Area is home to over 22,000 individuals of Khmer descent is versatile members increasingly contribute to many thriving local and international organizations and businesses to the rich cultural tapestry through arts and Civic engagement and whereas it is important to honor the Khmer people who suffered and to remember those who died at the hands of the Khmer Rouge during the Camaro Holocaust now there for the Seattle City council and the mayor of Seattle do here brat. Hereby Proclaim April 17th, 2019 to be a Camaro Holocaust Remembrance Day. Thank you, Ken Springs hours before you present this to our guests or there. Any other members would like to share a few words about this report in the moralization of our history if that I'd like to say a few words. Thank you Catherine Gonzalez for once again bringing such an important a trustee in our human history to our attention and thank you community for being here. I'll date myself a little bit when I say this, but I was in high school when I would read the newspaper to read about this International atrocity and I think when you are Incorruptible Shallotte that time reading about this it changes one's for you on what this world could be when at its worst. And so thank you for reminding us of what we put this world can be when that unchecked when when their powers to be that are unchecked. I know this is affected your community your relatives your family members and particular. The younger generation of leaders in your community for making sure that we never forget to thank you Katherine Gonzalez Automation and I believe their members from the community who would like to make some remarks to the council. Okay. If it's alright. I use either Mike and they're both press a button and the green lights on and it's possible she could bend it down to it reach your height as well and would love to hear from whoever like to speak. My name is Stephanie on my dad is Survivor the Khmer Rouge. I want to thank the council president Harold for having us here and sponsoring councilmember Gonzalez. Thanks also to the do Amish people as we are on their ancestral lands this Proclamation is important to our community because of the impacts of the tires are not isolated to that time. Into those survivors. The impacts are still felt today and I feel the most when I learn about what my father has been through and what are people have been through. I think when people talk about Trauma from the war they talk about the survivors and how they pass that on to their their children their families people don't talk about is how it impacts the use when they find out what their people have been through and how their people have sore. So both I think traumatic and also very empowering. So not only did a quarter of our population Parish nearly along with it our culture and language and ultimately with it our identities. This is not just about remembering one tragedy a one-time event and celebrating my resilience as well. this Proclamation symbolizes our proposal to survive and is not just as Stephanie said This recognition of a tragedy but also a celebration of, resilience because we are here today and we are thriving and by sharing this knowledge and its history with our own communities have been kept from us from a very long time. It is a step towards learning about our history and ourselves because in order to know ourselves, we must know our history first. And with that we are really excited to be able to also present this Proclamation on an event will be holding this Wednesday April 17th at Red Square at u-dub where we will be celebrating, resilience remembering honoring this history and being able to collectively heal as a result to allow Our Youth and our community to really get a better understanding of how this will affect this and to express our trauma in an art to Art so Thank you so much for giving us this opportunity because through this we hope to be able to take space to show and make sure that the world knows that this is something that we cannot forget. Thank you both. Thank you both for your leadership and commitment. Thank you can talk to customers valves for bringing this to our attention. Thank you very much people. It is also the kickoff of happy New Year. So happy New Year to you all and I'm hope that you have a really wonderful celebration in the Red Square. Thank you for being with us. Thank you. Okay. So at this time we'll take public comment on items that appear on today's agenda or our introduction and referral calendar or are 2019 work program and I'll call you out in the order with what you signed up and we will have speakers speak for 2 minutes will start off with David Haynes followed by Alex Zimmerman. City council a few days ago in 95 year old man save the woman's life when it in raged junkie seed came out of the bushes and started to attacker in the University District the 94-95 year old man with a 35 year resident of Opera Queen. Anne didn't want to fight to younger criminal and when the attack was convinced by the 95 year old not to attack the woman the attacker turn against him until the 95 year old went into the church and the attack of rain inside the church to kill the 95 year old and a 95 year old sought assistance from to pastures about calling the cops. The 95 year old is for to defend himself in Ponchatoula evil. Junkie thieving file a criminal one time and drop the attacker. I know there's a serious conflict of interest between city council members and Lisa daugaard and the secret agreement with the police and safety committee chair the relationship between the director of community police commission and the millions the public defender Lisa daugaard expects from Council to literally protect. Evil nefarious characters who destroy lives daily and get listed nonviolent and guaranteed not to be deported because race is hypocrite on the city council thing foreign-born criminal only commit crimes cuz they didn't have a legitimate ID. I know my screen has mentioned that the only reason people who is responsible. Vital implosion formed by unconstitutionally adding a sentence that little warning that you being disrupted and I'm going to ignore him and councilmember mascara. I'm going to ask for your comments. City councilman just go ahead and so I'm going to have you removed by security system. Please have him removed, please please have him removed. Show cast member scary. Would you like to comment? The president in order for us to the restore decorum. I think it's important for us to constantly ensure that those who are speaking are speaking items on the agenda again, in this case. I don't believe that that was Point well-taken if I understood his comments while he did engagement disruptive behavior as evidence of him being removed. He was speaking on part of our work program. But even if he speaking to irrelevant matter in a work program is I interpreted his comments. He cannot do it in a destructive way and he has been removed accordingly and I do apologize for the personal tax that you and others have had to suffer unnecessarily. So for those kinds of comments having said that we'll keep moving down our public comment section and I'll be Alex Zimmerman followed by Sean McGee Kerr McEachern Can I spoke about this if Khmer fascism, but this kill million people. Thank you very much. I'm not your Social Democratic Progressive principal killer is exactly what they want speak. My name is fascism of a skill people couple Millions comparable to German Nazi Germany. Schuylkill are 60 million people. Yes, it's 6 and you know, my family style play some stuff to address our work program our interaction for a calendar or today's agenda in your description of History. So, please speak to one of the three subject matters. So please resume. hutch furniture Okay, no problem. I will speak about agenda number 3 about Central butter from Improvement program. It's totally make me a shock because we need a fairy wedding Transportation. What is important? It's money come from me from another poor people fix it too many problems like homeless, for example of a hundred thousand thousand people who live in what different after toenail come. Can you play confuse me? Because it support by is this I'm totally confused leaving this location a millionaire to so my question right now, very simple. If you don't charge promises crew could leave next spend a billion dollars for thank you, sir. I didn't see your speakers are Shawn make a curtain and then Sean Moore. Nicene council president I was here to speak on behalf of 1194 or 87 as amended but I was reading through them and it wasn't didn't mirror what was discussed this morning. So I wouldn't there's not really a thing in it. I don't know if this is the right. I'll wait something that I'll wait for another day. Thank you. Shawn Moore will be followed by Ken Lang. Lancaster CA Sean Moore Langston, okay. So Ken Lang. Oh, you didn't break this s t o n on there. So I want to speak as a member district 4 on behalf of Abel Pacheco. I want to speak about how I feel that he would be in addition to helping out. Some of the issues are going on in the Seattle District area for I've had a personal chance to work with. Mr. Pacheco in the past. We work actually together and Mesa, he's done great work for the community and also taking time to go to Olympia and speak on behalf of students are trying to get into stem like to possibly see in the future as him being an active member not only to lead because he also shares the same values I do but also to be a member that can help everyone else especially with the homeless problems issues are coming up the affordable housing and things like that because he speaks out to the community and he takes time to listen. He's taking time to listen to me. And I'm an advocate for veteran support better and rides and because you took time to understand like Mike Mike Colter Maya the people I associate with it really spoke to me, and then I got chance to understand where he's coming from and why he's able to do what he's able to do as he's able to put time in which is something that I've had a chance to see myself by going to knock on people's doors taking time to speak to them and show they really cares about this particular district and Seattle, which is expressed me multiple times having been a part of his home. This is home to him. He's taking time to actually get to know it. So for the record like to make sure, you know as a representative for the Barron community and speaking for Mitsubishi check on self. I'd like to see him become an active member as a councilman. Thank you for your installation. approval of that there queso two will move on to our agenda is Sir? We have more one more request, please please. Can you just check in with Monica security right there? She's Eric is at Shire Eric sure. I have after Mr. Langston. Thank you counsel members. My name is Eric sure. I am the commissioner of the co-chair for people with disability. I want to thank you for your time and efforts to review my proposal for having kept me in public places. I want to thank you to the three council members for working with me this in time Scott. O'Brien and her bold and I would think the members of my commission who are here for 3 for here, and I hope that we vote in support of passing that left license IQ. Thank you, sir. Okay, we'll move on to our agenda will move to the payment of the bills. Please read the title. Cancel bell when 19495 remind me Southern clams in Oregon payment thereof 19495 the motorcycle bill passing for the comments. Please call the roll on the passage of the bill. O'Brien Let's move to our first agenda item. Please read it into the record of the North East 40th Street between 24th Avenue Northeast Gilman Trail in the university community urban center neighborhood planning area Seattle according to chapter 3562 of the code and park 53143 80 So I'm going to ask council member O'Brien to pinch-hit on this one if he's so prepared you bet. This is pretty straightforward is simply a notice for the public hearing as described in the bill and certain public hearings required to have a resolution for the council to do that. So we are doing it any further comments those in favor of adopting the resolution, please vote. I don't suppose vote. No the motion carries Resolute resolutions adopt and show sign in please read the report of the Civil Rights utilities Economic Development and arts committee on 19407 Lane public accommodations required persons opening or managing a place of public accommodation to activate closed captioning on television receivers and adding a new chapter 14.05 to the chathams. The committee recommends passes amended. Thank you very much. Like to first get the Amendments before the council. And so Amendment 1 adds a new section to and remembers the remaining sections numbers accordingly. Thank you speaking to the moment. The amendment itself is one that my staff worked with the office of civil rights to specifically Focus that we get more detail in the form of a report on the racial Equity impact within the 180-day Outreach and education. Specifically detailing the impact of enforcement of this ordinance on immigrant and or Refugee run businesses. The law itself goes into effect 30 days after them are signs, but the enforcement of the law does not go into effect for a hundred and eighty days until this amendment as it's written allows us to get that information before socr begins enforcement and just as a as a reminder the enforcement mechanism and approach that soc-r is going to be using for this ordinance is very similar to that. Used for the all gender restroom ordinance. So it's much more of a in education and Outreach approach seeking compliance rather than seeking Vilas the issuance of violations and fines for the Chick-fil-A by canceling her balls. All those in favor of the amendment. Please hold. I know ornette the nose half the eyes have it. So we have in a minute piece of legislation. Would you like to describe the basic legislation has admitted customer boat? So this ordinance basically puts into law what is currently arguably are already a required. Accommodation as it relates specifically to to a public accommodation obligation under the Ada. And so what does does it ship seaonus which currently exists in the 80a where people have to request and accommodation and instead what it does is it shifts that honest from the individual in the deaf or hearing loss Community to request closed captioning as a public accommodation to instead have the expectation that if he provided in a in advance I'm in this is again. The objective is to shift Norms so that if people are better able to engage in public life and so they ordinance itself is modeled and in some ways better than similar ordinances in other jurisdictions some cities some states have similar. Similar ordinances Portland's law passed in 2015 Ann Arbor, Michigan Ordinance took effect in 2017. And there's a similar bill in Rhode Island. And basically what it would require is it would require that in public places that the closed captioning on a television be basically turned on one of things. I learned through deliberations on this bill is TVs. How all have the ability to Simply turn on the closed captioning with the remote. So this is a simple and easy thing for for businesses to do the background on this is that the cushion with people with disabilities adopted a resolution last November to support this ordinance. They identified it as a a priority in their work. With the intent again to ensure full participation and inclusion for members of the hearing loss and deaf Community to take place in public activities. The again the office civil rights will be the enforcement mechanism and enforcement will consist of a report a violation and an investigation notification to the business in a request for a written response. And the again. The model is very much replicating that of the all gender bathroom ordinance. The the other benefits of of this bill are there also benefits not just to the hearing loss Community but folks who are have English as a second language and the really appreciated the opportunity to work with the business community and missing some amendments that that that they had requested one requested amendment was to create some exceptions for programming that is not there is already exempt under state and federal law another amendment clarifies that if multiple televisions are for sale in a public area that at least one of each model must have closed captioning turned on and you know that one of the again one of the things that I've learned through through working with the authorities community on this is that the the need to have to request a public accommodation really has a psychological impact on groups that have been historically marginalized and some of the some of those Studies have been some some of that that experience has been captured in in studies better academic study isn't that point to the fact that internalized by us and inferiority inhibit the ability for people Be confident and take advantage of opportunities and activities available for the rest of the public and I know that we here in Seattle want to make sure that were removing those barriers whenever we can. Thank you very much. Any further comments on the legislation's describe a consumer herbold? Okay not please call the roll on the passage of the amended bill president Harrell. Please read the next agenda item into the record for 90 really into the central Waterfront Improvement program authorized tractor the office at Waterfront and Civic projects checks get internet with a Washington State ferry system for the construction to facilities to support electronic vacation of fairy vessels at the Coleman Ferry Terminal to a pass. Thank you very much. This will affect our 2019 Waterfront budget and it authorizes our director of Waterfront and Civic projects as Marshal Foster to accept non City funds for Capital costs and expenses relating to our Waterfront. There will be an opportunity for the office to enter into a contract with Washington State ferries to construct electrical improvements to support hybrid series on the coma. And also adds external funding and the tune of 2 million dollars from wash. Around design funding and 10 million dollars for the public. Benefit on the pike-pine corridor and that's part of the money that comes from the convention center. And it also updates are adopted 2019-2020 for CIP to be consistent with the revised local improvement district committee recommends to pass only working on some of these issues for the last three years, but she's been working on it for almost a decade ago cast member bagshaw's comments regarding the loan. In fact, the lid formation ordinance and the Waterfront agreement were authorized by city council this past January. So that is nothing new this ordinance confirm. So stipulations. Thank you to the office of Waterfront Dory. Thank you for being here for working diligently in Thoroughly through each phase so we can send connect our new Waterfront to the rest of Seattle for everyone to enjoy and for hopefully the first time in Many many decades we will be reconnected to the seller see, so, thank you. Okay, so no further comments. Please. Call the roll on the passage of the bill. herbal, Juarez president can move to other business and I believe counselor Gonzales has a something she likes you on the other business part of the agenda during our briefing from the office of intergovernmental relations that we are working on a letter in support of the Senate Bill 5163 Wychwood modify existing wrongful death statute to eliminate the ban on non-resident parents so that they can bring a lawsuit on behalf of themselves for the loss of an adult child. So it's both parents but also for just a current to be able to have that Equitable access to our court system in the event that they have an adult child who does not have next any survivors. A beneficiary legal beneficiaries into the lot to be able to file suit and have the loss of their children and the loss of the parent-child relationship be acknowledged within our legal system. So this is been a priority of mine for a long time since I was a trial lawyer and and I continues to be a really important legislative fixed in my mind to correct a lot of wrongs in our existing system that really do treat non-resident parents meeting immigrants who live in the country or live outside of this country if they have a child who was an adult who is killed as a result of a negligent action. They are legally prohibited currently from bringing a lawsuit and holding the entity that is responsible for that death accountable for their actions in causing causing that death and likewise same thing applies for Resident parents who currently lives in the country. So super important really large Equity issue and this letter would signal to our state legislators in the House of Representatives that we support a clean bill on Senate bill 5163 without two amendments that would if passed those amendments would actually water down the bill and kind and not correct these fundamental foundations that I've just described. So I'm going to pass this letter around consistent with Council rules and we have to sign letters by the full Council in Open Session Simon circulating it now for signature while you pass it less phillybuster a little bit because that's going to take a while. Thanks for for addressing it an open session customer back. So I think you can't remember to dollars for bringing this forward. Can you talk to me about the retroactive application if any I don't believe this is retroactive. It would just before it going is my understanding. And as councilman Gonzalez has pointed out we will sign this in Open Session. Thank you for your leadership on this and baking sure we support the SSB 5163 and certainly oppose and incurs rejection of the Amendments 511 683 Light of your suggestion to help filibuster. I would like to be excused if I'm a on April 5th through May 13th. Okay. So let me ask. Is there any further business to come for the council and what we heard is that customers skated like to be excused on May 13th is their second all those in favor of customers Kitty being excused on May 13th. Say I Opposed the eyes have it and long those lines. Is there any further business to come before the council? and we'll just take a moment to to wait for the signatures in Open Session and deal with that awkward moment of silence to have to deal with on occasion. I've learned better not to tell jokes. Trust me. I learned the hard way. Okay, we made it down there and everyone had a great rest of the day and with that will stand adjourned.", "end_time": 2258.3}]}