{"format": "raw", "annotations": [], "confidence": 0.9467812198049882, "data": [{"start_time": 0, "text": "Okay, great. Good afternoon, or good afternoon everybody. So this is a special meeting of the select committee on the library Levy. The date is April 11th. And the time is 5:32 a.m. Council member Wars chair of the committee and enjoying me is he finds chair the committee council member? Thank you. Some of our other colleagues will be running a little bit late and I'm some of them are watching but they are they are paying attention. I'm going to start with the chairs report. This is the third meeting to deliberate the 2019 proposed Library Levy renewal amendments to the proposal worjout last Tuesday, April 9th. Today, I sure will present these amendments and provide information to concerns brought up in our last meeting and preparation for this meeting. I shouldn't to gain have provided an updated memo for council members and the FAQ pack at the illustrates important Concepts and clear the common misconceptions of this proposal both are available to the public online and hard copy on the table outside of Chambers. There's a few comments. I want to make before I'm due a few Reminders to my thank you counselor purple. I'm glad you're here a few comments that I want to read before we move on to some just housekeeping matters. The library Levy is a potential source of additional funding for public libraries to continue providing services for patrons in in in in effect in short. It is a levy for the library in the services that it provides the city limits attacks on the property the first the mayor's office proposes a plan to the city council for adoption the council May amend the proposal with the understanding the Board of Trustees has sole responsibility for allocating the funds the council must approve the proposal before I can proceed to the ballot for a final decision by the voters. I also want to add about who sets the library priorities neighborhood our librarian. Where is Marcella's thank you and all the hard work that you and the Board of Trustees have done over the last two years and my understanding is that you would went out onto met with all the neighborhoods with Community input the Seattle Public Library. hosted at least six major Community conversations in the last 2 years and constructed a survey with more than 26,000 responses that affirmed the following priorities the same priorities that we had in the 2012 Levy. So this Library Levy is constructed around four categories. And that is what the the legislation that was transmitted to cancel. And I've said this before I'm going to say it again so we can have our conversations based on community input for 2 years and twenty-six thousand responses that it's on hours and access collections updated technology clean and safe buildings and maintenance. So with that let me move forward. This isn't I have an important reminder to my fellow council members to include concerns brought up in tonight's public hearing. The deadline for those Investments is tomorrow Friday, April 12th at noon to Asha into my office and in the game. Following the staff briefing. I will open the public hearing on this proposal. It's a great opportunity for the public to voice their input ideas and concerns. Of course, it is not the only opportunity you were encouraged and always welcome to continue to dialogue by contacting your council member directly in person by phone or email and certainly to our office and certainly to mr. Marcellus as well. So welcome council member Brian and council president Harold. Thank you for all being here today. Can I can you go ahead and read the first item into the record? Are the only item into the record? One cancel Bill 11949 1 and Ordnance relating to regular property taxes for writing for the submission to the qualified electors of the city at an election to be held on August 6th, 2019 the proposition to lift the limit on regular property taxes under chapter 8 4.55 RCW and authorize the city to Levi additional taxes for up to seven years for the purpose of sustaining and Investments the Library operating hours collections technology and maintenance while expanding access to opportunity through additional hours Library materials and technology and undertaking seismic retrofit sup3 Library facilities authorized the creation of a new fund and ratifying and confirming certain prior acts. Thank you in with that. I'm Oscar for the record. Can I have you identify yourself a command and thank you again for this great memo that you did and you followed up from our last public hearing. So thank you for that. Go ahead. Let you introduce yourself and we're going to go through this legal more this time. I'm sorry not legal. To this issue memo first and then we'll go to public comment. So go ahead and cancel Central staff. So I'll do a quick summary of what we talked about so far. We're going to talk about today and then next steps. So the library proposed represented their proposal on March 28th on Monday April 8th. We talked about issues identified by myself potential additions to the levy and then some specific proposals to potentially amend the Levee to add services that were not currently proposed in the lobby as transmitted. So today we'll discuss specific proposals both the ones that we discussed on April 8th as well as some additional amendments that council members have to add to the levy as amendments for each provided an estimate of costs or working on an estimate of costs. And these are these are all additional services that would be added to the proposal beer in old to be funded by Lovey dollars in terms of next steps based on helpful Direction. I will be Drafting and structuring Amendment language for a vote on April 17th. So this memo essentially summarizes a variety of potential amendments and I'll dive right into those. The first is to fun educational programming for Children and Youth this is proposed by customer Gonzalez as she is not here to speak to it. I will do a quick summary of that Amendment. So the library currently provides a programs for children from birth to 3 years of age include baby storytime in Goshen bilingual Kaleidoscope Play and Learn Preschool Story Time toddler story time. We're language story time and a variety of other story programs Patron attendance is approximately 107000 patrons a year 900 vents currently. This program is funded in part by the Seattle Public Library Foundation at a cost of almost $340,000 has budgeted in 2019. In addition the library provides educational programming in its Student Success program which supports students from preschool all the way through High School the library and play the formal learning library in a support these programs currently the public library Foundation provides majority of the financial support for these programs at a cost of about $157,000 in 2019. These programs include things like learning buddies which provides time for teens and children to read and play homework help ages 5 through 18 or just drop in homework help service middle school program to develop Career College in life skills for youth age 12 to 14 team read which serves second and third graders to avoid summer reading loss and teen Service Learning which serves you through 14 to 18 by providing leadership opportunities through project-based youth-led Service Learning. The amendment proposed by Council Amber Gonzalez would replace the current Foundation funding with Levi support at the cost that you'll see on table 2 at the bottom of page two of your memo. It would cost about 2.8 million dollars over 7 years of the Levee for maintaining the programming for children ages zero to three or an additional 1.4 million dollars to maintain the Student Success programming with Levy funds. Is it okay to ask questions? Absolutely. Fantastic. Thank you. So given that these programs are currently funded by the Seattle Public Library foundation and we're proposing to replace that funding are these dollars that the library Foundation currently makes available for these programs going to be invested in some different way. It's possible. We haven't had discussions with about where the displaced funding would go towards and so it could go towards adding any number of things at the foundation currently supports in why are we proposing to replace funding that is already provided by the foundation with Levi dollars. I believe the idea and then cancel American dolls. To confirm this but I believe the plan is to swap them out to provide a more consistent source of funds. So if it's some point donor funds were to drop these programs were up at risk than it would have Lobby funding to support them. The second set of the Second Amendment discuss is when we discussed on Monday April 8th as well to add more hours system-wide as it currently stands at the the library is open for 1377 hours as of 2016 items in the proposed lobby as transmitted would add on Friday hours for four branches and morning and evening hours to an additional three branches and without any additional funding and the library can staff one more open Sunday hour at all branches. This proposal would add additional evening hours Monday through Thursday system-wide. So it before additional hours per week at the central library and at each of the 26th branches for an additional 100 8 hours per week the cost to add those hours just to know that all these open hours whilst Kitchen 1st 2020, that's what the costs are are based on and to add to add that additional hour of service would cost 6.2 million dollars over the life of the levy would be an average annual cost of about $866,000 the cost to the average median household would increase by $2.47 or $0.21 per month the 6.2 million breaks down into 3.84 million that's necessary to open those hours of the Central Library 1.9 million to open the additional hour at the 26th branches and the need for an additional floating custodian to respond to custodial needs across all of the new open hours ads. Sacalis, we talked a little bit about this on Tuesday Monday Monday. Thank you. And you're just a reminder. This would serve a couple purposes one is to have more Library hours in the evening, which I think would be appreciated by a lot of users. It would also mean the other Library other spaces in the library such as a community meeting rooms would be available a little later in the day and that has been a problem for kind of evening committee meetings to be functional no spaces. And since we already have those spaces, I would love to be able to make those available as Asha said the price take care of the 6.2 million dollars over the seven years, includes both the central library and the branch library is the Central Library is a little lesson in a 2/3 of the cost of the branches being Portion I am supportive of the entire thing. But as we work towards making amendments if colleagues are are concerned. It would want to contemplate just doing the branch libraries. I would be open to that also and so far as that don't know if you would like me to submit a second amendment that has this sad so there beside by side and we were just a Mendes Amendment if we get there, but I'm happy to to have two separate amendments if that makes it easier for you or we can just have it one Amendment and if it doesn't work, I could propose modifying it. I don't I mean we can with whatever is convenient. We're not doing the options for America's got voted on 17th in terms of whichever option customer support. Third amendment is about creating a feasibility study for co-locating childcare space at libraries and council members is proposing this and smoke a little too this on Monday. But at the moment there aren't any library locations that are Kool-Aid ocated with childcare facilities it is it may be possible to add these kinds of spaces to library locations either the Redevelopment or for their bill. But if his ability study could look into what the specific requirements are what the challenges we would be for the branch libraries or the Central Library weather to cover it should cover her but Capital costs and operational costs. And then what estimated cost for both of those would be a cost estimate we're currently working with the library in the executive to gather more information about what the feasibility study might cost. And so that will betta fish will be provided as soon as a cost estimate Candyland a tampon. Thank you very much. My timeshare as you heard me discuss. The number of times were interested in every option opportunity. There is to create additional child care facilities throughout Seattle, especially for infant and toddler care. I'm one of the reasons is child care aware of Washington has range Washington State 6 in the nation for the least affordable child care for infants and 10th in the nation for lease affordable for preschool kiddos. And as you all know Seattle pays seattleites as parents gave disproportionately higher rates on average 31% higher than the rest of the state on child here because we have a lack of Supply. What I'd like to do is for us to think a little bit creatively here. We know that in the city council of Washington DC. They have passed an ordinance to put at least three child care facilities on site and sitting on buildings. I thought this would be a great opportunity for us to see what we could do with in publicly owned libraries to create the space for our kiddos to become the newest Learners the youngest Learners in our system. I'm after having conversations with the good chair. We're in conversations with the library. I think that it was a little ambitious to think about how we would do capital projects in this Levee. When We Were Young really need to do is a feasibility analysis. We have a number of sites that appear ready to go but having a conversation with our library friends and Community folks about the need the opportunity in the feasibility of creating a Child Care on site, especially for infant and toddler care of something. I'm really interested in doing what you're going to see from us it with the grace of the chair would be to come forward with a dollar figure for a feasibility analysis in the study. One of the things that we know the library has been a really good job was so far as making it possible for our youngest Learners to feel welcome in these libraries parents for example can take these board books home without having to check them out that used to be a lot of fear of bringing back little books like this with tiny little teeth marks on it. So if you see a book like this and has a yellow sticker, you can take it home without fear of having it be considered damaged when you bring it back and actually without any additional cost for check out or let you know without any Fear of being reprimanded for those teeth marks. So one of the things that were excited about what this opportunity is to continue that extension of the library is ongoing commitment to bring an early Learners and to create the cycle of education and programming I think this goes nicely hand-in-hand with them and that we just talked about first and I hope that with this narrow down approach to just looking at a feasibility study and in partnership with the library and Community Partners and supporters of the library at this would be seen as a good entree for future Library patrons as we go forward. So some of the requirements that you see here are we would be doing an analysis for the requirements for licensing site specific considerations, like outer space bathroom square footage estimated Capital cost in the future and where we would continue to be able to find operational funding and partners to run such operations of thank you for your encouragement to think about the feasibility first and foremost, and this is been scoped to that conversation. Thanks again to the library turn gauging with us. Thank you. And again, I just Priscilla council member amezquita. Thank you so much for allowing us to have a real nice conversation. I just two of us in the office everybody just to just us two talking about how we look at pre-k and child care in facilities in public assets that the city owns, but I really do want to caution my colleagues at this is a levy that we are putting to the taxpayers and it is a levy based upon $26,000 in two years of community meetings in which four areas as I outlined before is what the focus was 75% of the library is funded on the general fund. This Levy is only for 25% of how we maintain operations from 1998 to now so unlike the budget process. This is different in that. It's a living we're asking the taxpayers to pay. In the sense of here are the issues that they wanted and they deemed important. I do want to point out his council members gay and I discussed and we've had ongoing discussions with this council is that there is capital funds available. In other areas not only to the general fund for Pre-K and childcare but also within deal to Department of early or learning and education if anyone here want to add to that, please help me out, but there's there's room in there for that as well. And I just want to share this. I really appreciate counselor, Miss. Keita, cuz I know she has three more potential amendments coming the first when I'm I'm I'm very I'm very much inclined to support and learn more about and find out where and how we can make this happen in different neighborhoods that need the services, but I know that customer is getting you're going to want to talk about the other three amendments and I just would like to you to examine want to be candid and straightforward with you. I'm some of these issues for me. Are labor-related and collective bargaining and Union related and some of them I would like to find some space and how we can have a discussion about the funding. But again, the four corners of this document and the Levee Focus around four categories and what we're putting to the voters and I'm just trying to have everyone mindful of that. Okay, so if we can go ahead and continue At the next Amendment proposed is to provide additional security officers to the library is it currently stands the library employees 19 security officers. There was a study done in 2010 about Library security that recommended 21 security officers. So that would mean an additional two regular security officers as it stands the security officers provide responses both in the Central Library Antioch Branch library's about security-related concerns and also provide some level of Outreach through person-centered approach the cost of one security officer for 2019 is about $61,000 to add two security officers or the life of tilapia. It would be about 1.3 million dollars an average annual cost of $181,000. The average annual cost would be 51 / 51 cents or Johnson's annually or $0.04 a month. Thank you madam chair, so just to clarify we have three amendments total. So this is the second of three as you heard. There was a study that the library conducted back in 2010 on the need for additional security precautions and the staff at the library. Did this out of a desire to make sure that everyone felt welcomed as we know our library staff and are libraries mission is to ensure that the library is accessible to all members of the public and that we ensure that there's a safe workplace for those were working in the libraries and that those who are visiting libraries also feel safe. We currently know that there has been an increase in incidence in certain locations such as Ballard Capitol Hill University and Lake City libraries, and it has made responding to these crises are these incidences harder when we have limited staff you can imagine that a staffing shortage have made it harder for folks to respond when there's a crisis or mental health breakdown and someone needs attention, which gets us to our second one in a minute. But one of the things that we know is that anytime someone's having a moment of Crisis having our security guards who are here with us today. Make sure that people feel safe both the weather reading books in the library and working in the library is critically important. I really applaud the fact that the library already has I'm 19 officers on hands, but we're asking for is basically just two more to meet the 2010 recommendations for 21 security officers. I've heard directly from folks who work in the library that this creates a challenge when they don't have adequate Staffing in terms of safety support for both helping the public and making sure that those folks are working their failsafe. So as you heard this amendment would include 1.263 million dollars over the life of the Levi for a $0.04 a month investment on per household. I think the return on investment is very high making sure that people feel safe going to the library access in the library for the first time potentially and being lifetime members of our libraries throughout Seattle and Hope We can continue to work on this piece. It is something as well that I know that is up here amounts to make sure that our folks are working there and visiting the library still safe. The last amendment that would be to expand the current community resource specialist program as it stands. The library has a contract with the downtown emergency service center for a a social worker and a case manager to be at the Central Library as well. As for dropping hours at various other branches such as Ballard and Capitol Hill. I'm to expand the work that the that this program does the library would prioritise supporting youth in those services or potentially adding an to caseworkers to supplement the current Adult Services that are provided the services provided by the excuse me by the Try the service program is to connect patrons to a variety of services and they're primarily on house patrons add to housing or health or social services as well as performing at the vulnerability index assessment that enters people into the coordinated entry program. To expand the youth services portion of this would be about 1.1 million dollars over the cost of the Levee about $164,000 and an average average annual cost for cost the average median household $0.46 per year with a monthly cost of $0.04 to add into caseworker is to provide adult support would cost about $986,000 at about 101 season 8 $141,000 of average annual cost causing the average median household $0.40 per year or $0.03 per month. Herbal, thank you. My question for this one is also the same as my question for the the one related to security guards. I'd be interested to know I'm of the 19 security guards that are already funded to provide security services for the library where those dollars come from are those are those dollars currently coming from the general fund or they current coming from the current Lobby and likewise for the the services that are provided for the community resource specialist that currently exist. Are they provided through the general fund for our budget process or through the existing Levy? Chicopee just a moment so I can find that information. currently the operating funds which I believe the general fund pays for 14 security officers the Levee currently pays for currently pays for for Physicians and in 2020 The Proposal you'll pay for six officers with the operating funds paying for the remaining 13. That's a security officer P. Can I just follow up with that? Also, would you give us those numbers again is the the new proposed that is in the proposed Levy Lane? Which now, would you just give me those numbers one more time? Yes, so moving forward rather currently. So under the current Levi 14 security officers and the supervisor are funded by the Library operating fund and the Levee pays for four positions. So 4 of 14 are currently paid for by Levi dollars for out of the current 19 for the current 19 in 2020. So moving forward the proposal they would pay for six officers with the remaining officers being funded by operating fund still having 19 under the under the current proposal. So can I just add one thing here and council member that you and I are And more often than not line up with how we want to spend our money. I will alert you that I am really concerned that we don't supplant the operating fund with Levi dollars or ask taxpayers in this Levy to pay more than what we could be asking for coming up in our next budget or even quarterly supplement. So I just want to acknowledge that what you are suggesting I think isn't there great suggestions both for security safety and for education purposes and I would like us to revisit that out of the general fund money as contrasted to new Levi dollars. Math question manager, thank you madam chair just to clarify on your answer. So it does sound like currently for out of the four of the positions are currently being paid for by Levi dollars. The Proposal is actually increase the number to Six being paid for by Levi dollar still. We're already seeing that the proposed Levy that came down from the executive office already made some value judgments that this is a really important issue that we fund with Levi dollars and I think that in order for us to be responsive to both what the front-line workers and with the library have said is the need again. We have a 2019-2020 budget issue paper where they were also at that point asking for two additional ftes for security. So this has been a long-standing need given that it's already a current practice of using Levi dollars to make sure that our patrons in our workers feel safe on my hope that folks will take a another look at it and potentially consider supporting this as I think it's not Changing the process or supplanting existing dollars just a follow-up. I've confused myself with what we mean by currently that what you just described is that the mayor has proposed new Levi or is that what is happening today? So currently the split is sorry if my bath is for officers funded by the lobby. So that's through 2019 as of 2020 as the The Proposal be was transmitted to of those officers two additional officers will be funded by the lobby the six officers funded by the lobby. This this doesn't include any of the potential Amendment additions. Will have total of six men has proposed by the mayor for this Levy. Guess that's alright. This adds two more this would add two additional officers so that it would be a total of 21 officers eight of which would be supported by the levy that the larger issues in the context of these two officers are if we look at the the percentage should ensure keeps talking about this love is around 25% of the total operating fun of the library based on the proposed Levi. Is that changed at all. It is is a gone up slightly or down slide in terms of the overall because for me as we lay our on additions from the executive package I don't know if we are tipping the scales in terms of supplanting or not. And that's my larger issue. All these are great ideas phenomenal idea that I don't I can't disagree with the need for it to what I'd like to see before. We actually put the levy on the balance is some feedback from for example on customer Gonzalez's suggestions or proposals for amendments. If I'm hearing it correctly and the foundation are paying for those things what's their confidence level in terms of the volatility of their stream if if if those are in place, can we get some feedback in Marcellus and looking at you to make sure that as we amend this cuz now we're up around. 227 million starting to get my attention little bit here that we need to know if they're smarter ways to do some of this I like the executives feedback as well as we were we're getting close to budget considerations. And so these great ideas are there alternative ways to to do this, you know one possibility could be we could have lured the levy amount from the executive by the way. We don't always have to go in One Direction on these things in our discussions. And so I don't hear anyone talking and I just haven't had the wherewithal to really see if there were savings pause celebrity got outvoted on my fine Theory by the way. So so I am getting concerned about the dollar amount escalating. I need some feedback from the the experts in the in the library world. I'd be happy to follow up with the library in the executives on that. Yes, we will be doing that that I should note for the Publix, twos. I had an opportunity to talk with her head librarian over these amendments. So I have a sense of what they are inclined but my understanding is that Marcella's are Mr. Turner had to go back and make sure that he met with his Board of Trustees. And again, I'm not trying to not take away from anyone's amendments are issues cuz it was the council president said they all make sense and they're all great except we still have to be mindful that we are in Levi mode. We are not in general budget mode are general fund budget mode. You're right. You're absolutely right. We could go down or we can go up. But again, we're putting this to the taxpayers and we don't want to put a poison pill where everything goes down because taxpayers are not going to be comfortable. We're not voting on a child care Levi or no. Voting on a public safety Levy. We are voting on a library Levy and so we have to keep that in mind and we had this discussion in our last hearing is that libraries are the most public of Institutions that the city has all cities have and we have to be mindful as an essential governmental function or a central government of service that those core services are provided for I would like to see these type of items that can sperm is scada has generously put together within our libraries. I would certainly like to see a lot of these issues. I'm integrated into our 27 community centers. But again, I have to go back to the actual brick-and-mortar purpose of those public assets instead of development and what our job is as stewards particularly when we proposed this to the taxpayers and that's all I'm being mindful of at this point. So, okay. I'll just look forward. Summary of item number three since we didn't do that yet Costner a note from the chair and the other Council colleagues to reiterate this concept of having security guards is already part of what we find in our existing letia Levi and already part of what the mayor has ingested in her proposed Levy. So this is a core component to making sure that people feel safe in libraries and that they continue to access and that those are working their filthy again. I applaud the folks at the library for bringing forward the budget issue paper last year that requested the 2ft. He's based on the data that was an analyzed in 2010 and will continue to have conversations. I have no doubt one other area that I have a to bring forward for your consideration on item number 5 as was discussed a few minutes ago. To expanding the community resource specialist program and I have to say this was an excellent opportunity for me to learn about the Innovative programming that are libraries are currently doing I think Madame sure. You said it just a second ago that we have a libraries that function in our city has the most public of our institutions and I would also say this is the point of entry or point of service for many of our public many in the public are residents to be able to access services that the city may offer by coming into the doors of the library. What are library has done by the inclusion of a community resource specialist has been to connect patrons who self-identify I want to be clear that their self identifying as homelessness. Sorry as experiencing homelessness to resources such as housing Health and Social Services. So when an individual comes in to for example are Central Library right now for days a week, there is a community resource specialist who is one social worker and one case worker open one case manager. Who primarily helps individuals he's four days a week to get connected into Services. They do I think rolling hours also at the Rainier Beach branch and we've heard directly from library workers that expanding the existing community resource specialist program to other high need locations including Ballard Lake City Lake City D5. Okay Ballard Lake City University is a big priority for creating safe and accessible environment and meeting the needs of the patron. So this amendment would expand the community resource service program to Waze one as you see through the youth services support and then also by creating two case workers for adult support services. So I would offer you calling that this amendment is scalable. If we do feel that this is too much to bite off in this one moment. There are two options there a one is looking at 1 use folks use focus social worker and a half time use Focus caseworker. The other would be looking at adults. Says as you can see in this chart provided here and on the screen and I would also argue that for less than $8 a year. We would be able to purchase all of these services at that community resource specialist program would be able to provide if we were to extend it as the amendment suggests again. I know that this is a critical Levy that we get pass by the voting public to ensure that we have a viable and sustainable and thriving Public Library system. And I think that this is one Element as people are accessing our service or we can help connect people to other services and create greater stability in our community and there's a high return-on-investment. I'm not able to articulate it in this system out here, but I think that we will be able to see not only I'm greater support Pharr Library Services making sure people get connected in community, but it's a great opportunity when they're coming into our libraries to get them the services they need in addition to books. Thank you. Captain Marvel, I still had that outstanding question that I that you answered for the security guards as related to this one as well. What is currently in 2019 being funded through the Levee as a relates to this D services and what for from the general fund at the moment? It's a $110,000 contract. That is I'm sorry $111,000 contract that is currently funded by the general fund. Maybe I should on fruit you can provide for us and with further consultation with with with Marcellus and his staff and with you and you know, how I love charts and templates in boxes and all that stuff councilmember herbelin cancer mosquito. Ezra have raised some really important issues and I think one of the things I think we need to visualize and I would like the viewing public to see in certainly the taxpayers is the questions that cancelled rehearsal has raises a comparison of what we are actually paying for now in the Levee and what the expansion of that would be in the proposals that are now in front of us if we can have those two kind of columns. And then what the difference is. It's cuz the confusion for me as you know, I was trying to figure out okay. I know we have four in the Levee for the for the security officers. I know there are two more which came up to 6 and then it wasn't sure how many that what can surmise Kata which would she had brought up if we can have a side by By comparison before we start tearing up amendment to having more discussion. Would that be helpful? What is the post? And of course that is with our library staff as well. What if they proposed and then thirdly what would happen if we adopted these amendments? I select antenna with the bow, I think comparing it to answer the question that the council president hair elastic about how those things also impact. I think what is a is a goal on a narrative that we want to be able to stick to that 25% of the funding is is Levi dollars. Images and this we have potentially 7 amendments in front of us that approximately will be anywhere looks like between about 13.8 million over the 213 and I know that's not final but those are the discussions that we're having what I would I would and I know that we still have to determine on the Northgate are the feasibility study to collate code locate the child care spaces. Is that still another number that still outstanding? One reason it's good that we nail these issues down now and have a chart that explains that because these are really good ideas and a lot of this information. We're going to need either in the supplemental budget discussion or in the regular budget discussion. I seek elsewhere Mesquita is teen that up now. So we want to be ready to go if it's you know, what you have two or three bites of the apple. And I'm I'm I just want her to know that I would be supportive of that okay with that, just want to say that we're looking to 13 million dollars worth of traditions at the same time. We're waiting about 8 million dollars in fines. Just looking at the math Fair comment on the policy. I did too. I was hoping he wasn't paying attention, but he certainly was thank you counsel president. So with that I should thank you very much. You give us some great information. Thank you for the great memories that you wrote. I appreciate it on again. Thank you very much for the work that you've done and you're phenomenal FAQ sheet is color-coded with charts. I want to say she love a Microsoft clip art in their good job. So without let's move to public comment. All right, so why don't you well, we will not open up for public hearing public comment on the 2019 library library for all renewal proposal, which is in Council Bill 11949 one and the geen why don't you tell us how many people we got signed up? 33 Okay, so we have 33 people signed up for public comment. So to ensure a smooth transition or clerk nageen will call for people at a time when your name is called. Please line up behind any of the two podiums and come to the microphone. The center Podium will be Podium. Number one, which one is the center with that one? That's one that's one. Okay, and this is podium to so with that as you all know again for the record. You have 2 minutes to address the items this item. If you were a group of three or more you have 5 minutes before beginning, please state your name and please address your comments to our calendar that this in front of us today. Go ahead and the game. All right, the first group we have Daniel ortner Dave ortner Camille Jesse and Marlene Swartz and I believe they'll be doing individual. comments we have our interpreter. I thank you. I'm Camille Jessie and I'm here to represent actually the book group that we have at the downtown library. We started in 2006 and it's for people are blind and low-vision hearing impaired and we meet once a month and we are the largest book group in the downtown library. And since it started in 2006. It's been really wonderful experience also being able to go into the library and be able to use some of the services for all of us. I've been here before to talk about not closing the door is hoping not to lose any hours of the library. Glad you're thinking of extending them for people. I also want to mention that I run a low vision support group at the Capitol Hill Library. And I also took my children to the program's when they were young and I think the benefit of the library it's so nice cuz open to the public. No one has to pay anything. It's free. It's fantastic, and there's so many good places and programs there. Thank you. next the game Dave ortner. I'm a true leader of the Low Vision Group and it just here to address my relation with the library is that I used to When I say that I used to, all the time and just browsing get boards and then about 10 years ago. I lost my sight and at that time I thought I would never replace again. I just thought I'd stop and then I'll my sister started getting out of this and I started coming back. And so I've enjoyed the librarian and completely agree with for accessibility and funding security. I've always felt safe and I think it's important to Always fund a security and as well as more accessibility for all people to come to the library. Hello, I'm a damn partner. My brother Dave and I as he said Cole I'll leave the low vision book club at the at the central library. And we also use the Washington talking book Library. It's very helpful, very glad about that. They record all the books for a size mattress sets for us as my brother said I use the library as long as I've been here in Seattle when I was cited. I used to come regularly as he mentioned and then I have been coming a lot less but then with the book group, we've been coming more regular and volunteer at the library as well. And I think it's very important that to the library be open more accessible and specially for children to use it and be safe place. For everybody and especially for a disabled to a patrons to use the library equal access program. I think that's very important and very helpful. I think all these things in the library system myself or one of the things that make us see I don't know one of the top 10 livable cities in the country. Thank you, sir. Hi, my name is Marlene Sports. And so anything you know about me anybody who knows me knows I'm always reading the book. You can always ask me what I'm reading and you'll hear an earful from a long story short. The reason I love reading so much as I graduate high school without being able to read so I didn't really learn until my twenties the really start reading. So I value the library when I got my son who is first to Foster son. Didn't know adopt. That was one of the first things I did was take him to the library to and Ashley the library helped him learn to read because you had those books for kids where you have audio tapes and books and he was really struggling with learning to read and I was able to help him to that my reading to him, but also him seeing me read all the time my kids reading all the fees 19 now. He's reading all the time to not only That my son has disabilities and in order to graduate from high school. You need to have volunteer hours. So my connection with the Seattle Public Library through the ASL book club. And now the low vision club that I can I'm with my hearing loss. I was never able to join a book club. So when the Seattle Public Library had in a SL1 hours is static when that phased out a little bit. I was really disappointed and I was invited to enjoying the to join the Low Book the low vision book club, which they graciously let me come. I approached Cleo and ask her about if she would let Jared volunteer at the library and she mentored him and he got through his volunteer work. And now we're actually looking at him joining the employment at the Seattle Public Library for students again, he's been unable to get employment and with the amount of support the library give I think he's going to be successful with that. I've just like to say why no amount of time just real quick. I just like to say may be part of this Levy is also how we educate the taxpayers about what all this Seattle Public Library does. It's not just books absolutely just books and someone I know I can go to the library and have accommodations and be part of the library, and that's one of the few places I can do that. So, thank you. Thank you. pic of four names The next group if you could please lineup we have Alex Zimmerman Steve groups. I apologize. If I pronounce your name and Barb Wilson and Ryan Packer we have this Wilson and who's the last one? Ryan Packer or dagger. Is he at Port is the last speaker at podium one? A Podium to okay, alright, mr. Zimmerman and killer my name Alexander. Minute, I'm almost every week situation right now. Very simple. Number one. Why haven't you talked about that money from taxes from people? I don't have sense about taxes taxes. To be a hundred billion dollars of Texas city, for example have 6 billion dollars in peso Verde for banishment. $350,000 is most like you asked. What is it? Then solid e y b paises y is. It don't have money you get more taxes is number1 number2. What is very interesting proposition for Levi? What is double more than before? Why is she doing this? And when she last time in library Reserve $5000000 house interesting so we can talk about this. What is Kevin so she make us something very simple you can cuz it's everything but very simple Point negotiate with Comcast about $10 for internet. European people pay $10 per month. Ybpay 7 U-Box 4 months. So people go in library most right now for only for internet. So we'll be everybody I said, I'm 50 percentage pool, Clayton $40,000 $10 for internet, you know exactly what the average salary right now $80,000 and eighty thousand dollars you because you are freaking like a criminal the like reaching out to $10 per internet in next good afternoon. Good evening. Thank you so much for your service. I'm a Seattle resident since night 1993 and I've been serving on the friends of the Seattle Public Library board for 7 years, and I'm currently the president of the friends of the Seattle Public Library and on behalf of the organization. I want to speak in support of the marriage proposal for the library Levy renewal. So one of the things I want to talk about is that the strong Public Library forms the roots of an Ecology of literacy in our community. And so the thing I really want to speak about today is the indirect benefits from the direct support that comes from supporting the library. So I'll just let you know that the friends were established back in 1941 and we're all voluntary run and we currently have about a thousand members and we have three major programs we Advocate on behalf. Library, and we have we won the French Shoppe in the central library, and we also have been since 1971 selling books to raise money for the library in those books come from the library collection are well used but no longer circulating and then we also take donations from the public and our last book sale at the Seattle Center over the same Patrick's Day weekend was record-breaking we had about 12,000 people come through the doors. We raised almost $200,000 and one of the things I want to talk about is the indirect benefit is 3 AR books for teachers program through volunteers. We've been able to raise money from they were Navy Fisher Foundation. They give us a grant of $15,000 so we can buy the books from our collection and give them to Title 1 teachers. So at the book sale in March, we actually got 131 teachers 1100 books. And so I just want to read three quotes from the teacher. So this is a teacher from Graham Hill Elementary and she says for those of us for those of us with no Library budgets. This program is a lifesaver. This program provides books are schools needs but has no resources to resources to acquire another for Concord. Elementary says these books apply my entire summer reading programs for at-risk youths and a teacher from Rainier View says I cannot thank you enough for your generous book donations for teachers like me and Title 1 schools. It's like stumbling upon an oasis in the middle of a long desert Journey. Its joy and water and feasting for the spirit and soul. Thank you man. Just say thank you to the friends, and I really appreciate the work you do and I know you've been going for a long time, but it's a labor of love. Thank you. Thank you. I just got a note from the game saying that if you come up here, please state your name. We know you Barb council members. I'm Barb Wilson. I'm here to support the library Levy renewal on behalf of Vulcan. We've been a long time supporter of libraries and have supported previous levies are founder Paul Allen inherited a love of learning through Reading from his mother f---er who was known for often asking what's better than a good book and his father Ken who you may not know. It was a longtime librarian with the University of Washington Hall used to fondly recall his weekend jaunts to the Seattle public libraries and what it meant for him in his development as a critical thinker. The Allen family is commitment to public libraries in education. Most notably led to a 22 and 1/2 million dollar gift and the Central Library later dedicated its children center to Fay Allen Paul's Mother Falcon is proud to carry on the Legacy forward to supporting the levy renewal so that the love of libraries can be widely shared in Seattle. And we appreciate the efforts of council mayor the library Foundation to put forward that lovey that will equitably distribute the benefits of Public Library system's helping to develop the next generation of critical thinkers and continue a strong Legacy in Seattle. Libraries provide crucial access to the world and it's important that all of our neighbors share in this access. Thanks so much for your hard work. Thank you. sir Hi there. My name is Ryan Packer. I'm taking the day as a library user in a library lover in favor of the library renew renewal and in favor of the modifications in the central staff memo. Particularly Michael Branch puzzle to expand weekend hours to bring our weeknight hours to the same level that King County library system currently offers 9 p.m. I've been at libraries at 7:30 p.m. And people are scrambling to use the computers before they close. I've been at libraries at 1 before 1 p.m. On Sundays to see the line almost down the block to get in the library then demand is there right now the fact that this was not in the original Levi proposal I think speaks to the lack of vision provided by the executive across all disciplines right now. We should be bolder when thinking about the something as essential as our was Civic Life as a single public library and final note about the proposal to to bring that temporary sort of pop-up library to the CB Light Building or just interesting proposal the question is how many residents to see all need to add until the end of Branch, We both can obviously his stuff just spoke in favor of libraries, but there is no South Lake Union branch and how many people are going to be added to our city until we we bring that in I think that's a good idea to do a temporary City Light, but I would have liked to see some vision from you know, executive and legislative branch in terms of putting another branch in that neighborhood. I know we just sold. Com shop property basically for rental vouchers. I think the revision that could have brought a library branch with affordable housing above would be much preferable to a pop-up ad Into the Light by the Light station after the fact that you The next group we have Paula Becker. Jayrich Naomi. It should sake and Daniel or no. I think you so much. I'm Paula Becker. I'm a historian for history link and a Seattle homeowner. I want to tell you how fully the Seattle Public Library supported my son Hunter Brown who died in June 2017. The library was the sole institution with the breadth of Mission to serve Hunter who love to read over the entire course of his 25-year life. We became regulars at the Northeast Branch Story Hour when Hunter with 18 months old borrowing increasing numbers of picture books and finally attaching Wheels to a giant LL Bean canvas bag so we could drag them all home hunters First Act of Civic engagement was getting his own library card and act he proudly undertook the very week that he learned how to print his name. Hunter use the central library Seattle room when researching a project on the Denny party in middle school and in high school, he studied at the Northgate Branch but there's more as a teen Hunter began using drugs by 818 headband to a 3-month rehab program. But within the next year, he was inactive heroin addiction which led eventually to my beloved book loving son experiencing homelessness the Wallingford Capitol Hill University Green Lake and Northgate branch has provided Hunter respite in those years. He spent rainy days is tucked into their Corners charging a cell phone finding familiar comfort in all those books during some better years Hunter gained housing through the YMCA's youth in transition program and lived in a studio apartment at the downtown the why he spent hours across the street at the Central Library creating resume completing Central College assignments. online and writing poetry add to relapsed living by then independently, but facing eviction he use the central library's computers to research rehab options and days later. He was heading hopefully toward the possibility of starting a new when his life ended abruptly the Seattle Public Library the books the services and the professional non-judgmental always helpful staff cushions Hunter during what turned out to be a pretty hard life. I never imagined when I was taking him to Story Hour that he would be a young adult experiencing homelessness and using the library in the ways that he was able to use it. But I am so grateful that the library was there for him all those years. So I ask you now for all Seattle light to access our library sometimes for very complicated reasons to please give voters the chance to support this Levy. Thank you. Thank you. My name is Jay Rich and I'm currently the president of the Seattle library Board of Trustees. I like to dress the issue of Library fines first to be clear under the levy proposal taxpayers would not be paying the existing fines of Library patrons The Proposal would create a future starting in 2020 find free environment. So patrons who damaged or refuse to return books would have continually their accounts blocked and would have to pay second. We already have a partially find free environment many residents of Seattle already have find free borrowing because they are able technologically and financially to access electronic Ori materials. The very fast growing proportion of all borrowed materials materials are fine free already. Third there is significant research about the performance of the over 50 fine free libraries across the country to a nearby Kitsap County and Sno-Isle Library system's Sno-Isle has been fine free for 35 years since its Inception and it serves a population significantly larger than Seattle those libraries that have eliminated finds late returns have not increased more return trip materials are returned and perhaps most importantly there's significant increase of participation among users of all ages 4th. When we use late fees to raise funds to pay for Library operations, we disproportionately impact those who can least afford to pay those fines other Library systems report what I think we know intuitively But even the fear of a fine is enough to keep many people from using the library the guilt and shame people feel over Library fines creates a negative association with libraries and drives them away. Finally given to dramatically increased use of fine free E materials. Fines are an unsustainable Revenue source to pay Library operating costs. We have to solve that funding problem, and we can do it while achieving greater access and Equity. Thank you. Hi, thank you for having me. My name is Naomi Osaka. I'm here to talk in favor of the library Levy. I was reconnected with the library and kind of an unusual way after her quite a long Hiatus since I was a child here in Seattle. I became involved with the legendary children program about 5 years ago, which is in a library project that if you're not familiar with it is a It's a performance is also a showcase that centers the lives of queer and trans people of color in Seattle and the region using music performance of The Runway and it was really the first and still the only time I've ever seen that many queer and trans people of color in one space at one time ever in my life and it's continues to be a place that a lot of us feel at home. And that was really created through the librarian and while their performances in the events are at Seattle Art Museum. It's a place that we know we can look forward to and always know that there's a place that we can go that speaks to us and is actually representative of us. It's a really glorious feeling and one that you don't get to have very often. Do the legendary children program? You see the margins in their Community centered in a way that they aren't in any other place. You can learn about not just experienced the people in the room, but also learned from Reading lists and other ways that that there's a pop-up book store other ways that people can find out about Karen trans people of color at this event, and you can also connect with organizations that serve crab trans people of color in the in the region, so it's a really wonderful opportunity. It's really unusual and there's one coming up on May 10th. You should go and it's pretty extraordinary. I'm a photographer and that's how I came to be connected to it, and I would love to show you pictures cuz it really kind of speaks better than I'm speaking right now, but it's really extraordinary and it speaks to the ways and you kicking Creek community in different ways the library. Thank you. The next the next group we have Carmen Benedictine Sean mceachin Grace Nordhoff and Karen tearing. Hi, I'm Carmen bendickson. I am a board member for the friends of the Seattle Public Library. I've been volunteering for the Seattle Public Library and the friends both since 2007. I brought a little prayer. This is my bag from the French Open this in the library. It says my library knowledge and humanity and dignity and access and I think these are all the things that go into why I continue to spend my free time time. I don't get paid for time that I could be spending doing something else, but I I prefer to spend with the library because it's it's part of my community and I just wanted to say really quickly of of how I came to this point and and like so many stories there. There's the intangible Leti of of why the library means so much to so many. And for me it was it came down to after I had started volunteering in 07 the recession-hit. I lost my job 2012. We had a library Levy and where was I spending most of my time at the library and I had all this free time to work on the campaign. And so it became is kind of natural Synergy of yes, I could help the library because it had already given so much to me, you know, obviously I am I'm here in my career as a contract but there's so much more that the library gives that isn't, you know is in these words and and is in the feeling you get when you come to a library program or when you feel that the staff sees you for what you really want what you really need and it's not necessarily available in other places where you might have to pay to, you know, sit there for hours on end having sat on my computer working on. I've had that feeling so in the end it is about Community is it is about the intangibility. So please support the the library Levy. That's all. I think you meant I'm sure my name is Sean mceachron, and I think the levies a good idea. Other than that. I had a bunch of stuff. I was going to say, but I think my stuff's more of a budgetary matter than necessary some for the lavvy. I sense that there's a lot of wisdom in the walls tonight and I like that. Thank you. Hello, my name is Grace Nordhoff and I serve as president of the board of the Seattle Public Library Foundation the foundation raises private, contributions to fund programs at the library that meets the needs of our community the foundation supports this Levy renewal package that allows a library to continue. It's important work and bringing us together providing opportunity and providing equity in our city. I want to mention that just as Rose and utilities are critical to the physical infrastructure that we depend on in our city. Our libraries are part of the vital social infrastructure libraries. Bring people together help us learn and grow and give us a place to celebrate our diverse cultures the library creates a sense of belonging that is essential to a vital in Humane Society. So this Library Levy renewal package, which most significantly represents 25% of the library budget what continues Seattle public libraries efforts to respond to the needs of its citizens by providing access to books and materials Information Technology Community Resources and Gathering spaces for all so thank you for your support Grace if I can disable Grace Grace Grace, thank you. Thank you, and just as we were saying thanks to the Friends of the library. I really respect and I'm grateful to the foundation. So for all your efforts many. Thanks. Thank you. I appreciate that. Adam chair. We actually have two more that have signed in I was given copies earlier. So we don't have 30 people signed up the next the last two are Karen tearing and Betsy could kill. Oh, okay, but you can I have your time. I really I really don't have a lot to say thank you very much. My name is Karen touring and I am here to speak in favor of the levy Idis just this afternoon my daughter called and it was one of those FaceTime calls and you know, it's Grandma time and we have a I have a four-year-old grandson in a 1 year old granddaughter. And so when I ask my four-year-old grandson what he did today, he said we went to the library so you can see why I really want to have a world where Library 6th and little black boys can grow up and know that that's a fun place in a place that he wants to share with his family. So therefore I support longer hours the Amendments that came up the longer hours that the resolution to look into child care. So that families can more. Holy participating libraries. I and I really do support the elimination of fines. I have come into closer relationship with the library cuz I've had the privilege of working with a library and legendary children. I'd like to second that please come and I one of the things at the library. I think we need a 21st century Library write a library that is even more inclusive and more available and more Center to you know, just basic existence for most marginalized people and when you can have joy in the library when you can, you know know that the library is also a place that brings Joy like legendary children for queer and trans and people of color. That's it's worth supporting and I think tax dollars are worth us supporting as well. I also work with a program called cope which actually harnesses the power. Of the Seattle Public Library for marginalized organizations. So can you imagine an organization that is volunteer-run that has the power of research and a capacity that the library brings and I would like to see that support it and finally I would like to speak one more time to the issue of fine and how I was very triggered that there was a very casual comment by this Council about using fines to offset the cost of building this 21st century library that I dream of and I I find it hurt my feelings because these fines usually land on the backs of the most vulnerable people and to ask the most vulnerable people to pay for something that we all use and benefit from is really very triggering for me. So I would ask the council to watch their language when they cash Talk about these fines because they also serve to ruin people's credit because they go into collections and criminalize people for just trying to access the resource that we stay is available to all thank you. Thank you question them. Well and some contacts I don't be taken out of context what I said about discussion not this discussion another day while times was I support actually been waving fees if people lose a Bucking in They can enjoy the access of the library. Which defines what I said was if people can't afford to pay. They should have to pay that. That's equity. Are there many people that could pay and was there a mechanism by which we could consider those that are willing to pay him could pay? Can we still capture some of that Revenue because when you look at where we're trying to add we're trying to cut we will likely reduce 8 million dollars in Revenue by waiting all fines having grown up in the library system from a mother with the finance manager. I was just sort of taught that the fine polish is good to have you may not enforce its and certainly do not enforce it for people who cannot pay so the difference between equality and Equity to me. If we are to embrace that is that you really look at those that cannot afford you don't penalize. In fact you try to encourage are Libras being as you said as you said a a vibrant part of our community, they could really address all of the unfair institution practices than his is is a part is almost ingrained in our in our society. Butt wiping them all out to even if even for people that are willing and of higher-income or higher fluence to me. I question whether that was the right method to what I asked was it was there any kind of creative way to look at still trying to capture some of those were willing to pay so that was the poor joke that I said when we're looking at the fines are so if I offended you when I certainly apologize but the contacts but I still believe it when I say and what I say is that why they are 50 your panty 50 successful libraries that have gone to find free environment and we are also told that in certain situations. We still fine people. I don't understand why you still have a punitive fee system in place and then way finds another purpose of a poor person loses their book campos-duffy. We oppose the feet and then they still can't enjoy the accesses of a library and I also said that certain people more subject that I grew up in the air. There's a lot of theft when I was a kid in the Central District back in the sixties. So there are certain children that are around a higher theft area that may be penalized. I receive your point that I just wanted to be in the context of an ain't you know me. So, you know what I shampoo or certainly is not to make light of this notion of fines. I also have to say that as well as the amount my primary goal is make sure this Levy passes but make no mistake about that and a dollar here in a dollar there can start to affect whether this passes. We are at a we are we are in an environment where people are screaming at the top of their lungs about their property taxes. I mean we have I have to be we have to be mindful of that. So this is going to be once again A property tax and so when we start looking at using this property tax for services and products that can be supplemented by our general fund or we can we have discretion. I woke just like Jennifer and so I think we are smartly looking at whether this amount of the Levi is going to be a good investment but our goal I think I share the goal that we want this level 2 pass in so that's first and foremost, but I appreciate your comments. Thank you very much for your comment you have served on this Council for what eight ten years now and has been a leader in race and social justice and the equity lens in which we look at all of our city programs and capital projects and his leadership is more than valuable. He has embodied that whole concept of Being a me that one time he was the only person of color on Seattle City council and he has LED and has been the voice of that and was one of the reasons why I think I believe I'm here today and made a decision to run for office. So with that kind of leadership, I understand what you're saying. The other point is with my other colleagues sitting here. Our goal is to keep in mind again that this is a levy and we are putting this to the taxpayers in this is going to go on property taxes. And yes, sometimes we can say well this is only going to be $0.08 a day or $14 a month or how we break it down. But again, we are asking the taxpayers to pick up the tab for 25% of the library's operating and capital functions. Is that a fair characterization? I'm looking right at Mt. And so I did. It's what I think I speak for all of us. When I when I say this our goal here is since our library was first created in 1890 is the now when I've been called The People's University is from 98 to 2012 to now 2019 and looking forward is that this Levy passes and it passes with what you also heard council member of a Scottish are as well as concerned for her boat that we are a library of the 21st century in libraries today or doing things. They never imagined that they would be it would have been doing 20 years ago. I'm having social workers providing Services programs for our elders and we are seeing public assets and public buildings. Like I was sharing earlier with community centers and even our food banks. They are enhanced service centers. They are the first line of the most public places that people go Do not just two again heading back to library not to just checking out a book, but it still look for a job is to have a place to go before school and after school. It's the only place people can go to get online. It's where the Marcellus made available when we have hotspots in people in low-income. Neighborhoods can have access to Wi-Fi in the programs that the library has set up with CM and I always forget that an organization industry Loft and runs things. The public doesn't see that libraries do and so we want to remain true to the main and core principle of what the library is and for me that number one issue that it remains to be the most public of public institutions that the city should enjoy and should pay for it and I hope the taxpayers feel the same. So with that I'm going to see if my colleagues have anything else to say. Oh wait. Oh, I know that I saw thank you for that. I haven't written up here as well. Okay. So before we adjourn the next meeting of the select committee on the library, Levin will be next Wednesday, April 17th at 2:30 p.m. At this meeting. The committee will vote on Final amendments for recommendation to the April 22nd city council meeting for a final vote on the Levee proposal for the August 6th. Ballot. What is the date that we have to get this done May 2nd, May 3rd. It's early May by the first week in May we have to get this done so we could end up on the August 6th ballot, and I'm I don't think I can say anything else. Okay.", "end_time": 4991.8}]}