{"format": "raw", "annotations": [], "confidence": 0.9433822759292411, "data": [{"start_time": 0, "text": "Good afternoon, everyone and welcome to the finance in neighborhoods committee. Today is August 14th 2 p.m. I'm Sally Bagshaw. I share this committee and I'm joined by Lena Tebow for my office. Thank you so much all of you from Nickelsville. I miss everybody signed up excellent. So we're going to approve the agenda today and if there's no objection the agenda is going to be adopted since there's no one here, but me to eject we're going to assume that the agenda is adopted we've got nine items on our today's discussion. The first is a briefing and discussion of for an ordinance for the mayor's office relating to extensively damaged motor vehicles. Thank you so much to everybody that is just arriving for this that we will be discussing the what's called affectionately the RV legislation next working have a briefing and discussion on the Seattle City Employee Retirement System, and that is known as Circe. Thank you. So Discounts for joining us a council member of his gate is working with me on our retirement system. I will also have to choose from sdhr Seattle Department of Human Resources with a possible vote on a Citywide position list and the City's power marketing Compensation Program from Seattle City Light are the next five items. So we will have a public hearing on one of those items. So as we go through we will get there. I'm going to then ask if anybody wants to speak on that particular item. We will then I assume close the public hearing if we don't have anybody here and then we will move forward with allowing the vote and moving forward so that we can we can actually suspend the rules that will then allow us to vote on it next week. Thank you so much for coming. Tokyo we have two people signed up taking good to see you again. And David Olson is here to discuss RV campers. So I'm going to ask you to come up to the microphone and I would thank you Alice McClain from my office is here and we'll have two minutes for you and we look forward to hearing from you. Thank you. Good afternoon. My name is Peggy Houghton. I'm a longtime volunteer with Nickelsville. I'm commenting on in the extensively damaged motor vehicle ordinance proposal of marriage Jerkins. Nickelsville is full of people who lived in vehicles. This ordinance was not crafted with any regard for them and should be shelved immediately. Here's an update on what should be on the top of your problem solving list Lehigh and HST have started a new effort to escape the obligations of the council City sanction encampment ordinance. They want to throw it out and call Othello Village a religious encampment a religious encampment funded by City money going to a large corporate staff. This is simply a way to evade compliance with land use up. Asian Community notice obligations and oversight by Community advisory Council, it's Thoughtless and Dad policy and probably illegal the pastor of the church. They plan to call the operator of the so-called a seller religious encampment has been on the Lehigh Board of Directors for 3 years talk about a clear and blatant conflict of interest to us out this terrible plan for treating motor vehicle campers as a crime problem help people who are pleading for help Nickelsville conflict with a chesty and Lehigh is a way to see the connection between good ideas and a terrible execution by hsd and Lehigh a mediation between the three parties HST Lehigh and Nicholasville and a report by the mediator on what they learned and what happened the homelessness division of hsd is in chaos staff is fleeing as quickly as possible. The interim director is out of touch with facts on the ground. Please do what you can to push this mediation forward that we've been asking For so long. Thank you. Thank you Peggy David Olson. Hello, my name is David Olson. I am the external coordinator at Nickelsville Northlake as well as a resident as a former transient living out of a vehicle in an RV before that. Nickelsville was a natural option to assist in getting me housing. We hope for the city Seattle City council will help push mediation between Lehi and the HST in Nickelsville. So this option will continue to be available for others that may lose their vehicle RV in the process. Thank you very much, David. Thanks for coming. So anyone else like to speak they didn't sign up. All right, we'll see now and then we're going to move onto our first item of business and this is a report and if I can invite Justin's any of you want to join us, and by the way, thank you for the report that we just got a little bit ago. Great it then Atlanta. Would you kindly read in item number one item number one extensively damaged motor vehicle ordinance briefing. You will introduce yourself. Sure Jeff Sims console Central staff. So special meeting. We had a number of our friends from the mayor's office talking about the introduction of the RV legislation. And then we asked you to come back and provide some additional information. They have offered some data, but unfortunately I didn't get a chance to read that before this meeting. So if you got any comments sure am happy to us. So the majority the material cover was is already contained in the number that was attached to both to last week's agenda and to this week's agenda and I have any visual materials, but I if anyone is online washing bacon to accept that for references, well, I'll go through some of the background that was not covered at our special session last Friday including some of the new information that has been provided by a speedy and spu. And then we'll go through items of a raise already by the committee for the Amendments and are on the legislation and then other areas that's simple staff is identified as areas of interest for the council has been weird established last time that has a larger of contacts around this ordinance Stars shelters, especially our hands shelters. And Tiny House Villages are operating at full capacity. And with this ordinance as was discussing the memo, we don't have a full picture of how extensive the stakeholder engagement was or where stakeholder support lies with his horn at this time. I'm getting a signal from the audience. Can you slow it down just a little bit her and started last time. We only have the chance to join your committee and thank you again for letting me sit in on these one of the questions that I asked was around the fiscal note and you sent me a reply later but in that analysis He has also been spent so far. So do we have a sense of how much money has been spent either with initial Outreach and engagement or even internal office coordination and then how much money this would cost going forward? I have talked to both hsd and FAS through CVO and try to learn exactly that with in regards to the actual disposal of vehicles there still projecting an increase. I didn't bring the number with me apologize for that. That would be more related to the administrative a change on how to complete a junk vehicle affidavit rather than this ordinance. If it were to be implemented CBO indicated, they don't expect that to impact the quantity of vehicles. That would go through a Towing in this B have a junk vehicle affidavit and have to be disposed. It might affect the timing that those Vehicles arrive hsd's impact has I also considered negligible by CBO they and if they found that The Staffing in case management availability that they have right now should be sufficient to handle whatever would arise from this ordinance in terms of needing to connect people with landlords are helping Lee restitution restitution assistance things like that. Cuz you can get back to us about just the financial side of this when you've got that information. So the great thank you. We've also receive some new information on the scale. All he had to leave asked about how common is practices how widespread we're looking at a speedy end parking enforcement confirm for us that they know of for predatory vehicle landlords that have a minimum of 30 to 40 Vehicles. They also emphasized. They think that there are more it's just that they can confirm that there are four. They provide us some information that I won't go into today about you to specific individuals the number of vehicles that they have things like that FAS and Lincoln Towing also are aware of at least 10 individuals that have multiple vehicles and circulation and I love each other in each of these individuals has had more than 30 vehicles in their name in the past though on various numbers of these have been disposed of already. I believe that was covered in the Seattle Times. All that was I mention my account number of Brian at our last committee meeting of the 38th after vehicles that are registered among those 5 people how many of those would we anticipate are what we would consider to be uninhabitable. I don't know precisely what that number would be because the information we received characterize this as a predatory vehicle landlord. My assumption is that these are considered situations that would be under the the scope of the ordinance if are the bell at 4 past so meeting some of the criteria to be the person being fine as a predatory situation and possibly restitution relocation assistance being available. And then I send it to Shinto the maybe the small number of predatory vehicle landlords that have a large number of vehicles. We also the information that was provided to us. Is that a FAS and parking enforcement spdr aware of smaller scale landlords. They only have one to two vehicles on perhaps that's why they don't know the identities necessarily of those individuals. But especially in DeSoto and Georgetown regions, they are aware and have come across at least 10 or so Vehicles wear. What they believe is going on is this predatory practice of renting an RV? There was some of the new information that has been requested by the council specifically are there was one section that in the debts. I was not covered his background last time that I wanted to make sure it was highlighted for council members at this point as you can consider this ordinance and that's related to other avenues that and penalties that my already in her play with these RVs as we discussed last time an RV is not considered a dwelling unit that's defined by the land use code the building code for mobile homes and also the building code for single-family dwellings. However, the the housing and building maintenance code does allow us to impose penalties and fines on premises. Sdci currently does not consider promises to or they they interpret that to exclude the public right-of-way which is why this those penalties and fines and standards would not apply in this circumstance. Not sure that was abundantly clear during our last committee meeting. There are some other avenues that we could look out for. Enforcement I believe business licensing was brought up at our last committee meeting through conversations with staff in the executive that clarified that the they did not want to pursue that as the route because then obtaining a business license which would be very open to these RV ranchers would essentially condone the activity and they did not want to take that step. I also thought it'd be important to highlight that for $511 or less assuming that these ranchers are not grossing more than 2 million dollars. They could obtain a business license in dusk be conducting illegal business and then there's a question last time about vehicle equipment and whether or not there are other issues. It's not defined as a dwelling how that might relate here. I generally speaking these cousin requirements for vehicles focus more on the equipment. They don't consider situations where a person resides in their vehicle. So we be looking at finds that can range from like 48 to $93 depending on What is broken on the vehicle? And then of course with parking violations things like that? You can have a vehicle towed and impounded and also my put up for auction. But as we've seen that just perpetuates our cycle here. So with that has the additional background we didn't get to last time. I wanted to switch to what was already raised his issues by council members and then a couple other areas that can Central staff have identified first. We it was clarified at our last meeting that the cooperation of person residing in the vehicle would be required to pursue either a civil infraction or misdemeanor. That is not how the legislation currently reads. There's no requirement that that would be the case, but it was brought up as a concern last time and expressed by staff in the executive in the mayor's office that that is the goal here. And so that's a that seems to be an Avenue where there is an agreement if that's a change of the council wants to make Cast member tattoos after from the executives we received an email to one. That's that that's okay. So listen, every bullet points that are limiting knowledge about it. I'm the last one. I don't know. I don't know I guess the first paragraph. Sorry. That's not the right place. Let me scroll down a little more. Anyway, I'm not saying I recall somewhere that one of the reasons why we may not have good information was for fear of retaliation retaliation. Another Point might be that an unwillingness for people to report for fear that they might lose their housing living conditions that we would say or not acceptable if that person in might be like if you take it away on even worse off and so the comment of clarity and in some sort of structure that says and we will only exercises rights if the tenant agrees about it helps me with that a lot because because they said the people are unwilling me we still wanted the RV out from under them if you will if that's the best housing situation they have until we can get him something better. Zoe Please play. I think your points well-taken Ken's member O'Brien is that we know that and we talked about this last time that people are survivors the find the best option that they can for themselves and unless we've got something that is better than what they have there not want going to want to change their really know what we're talking about today is what can we do what we do to be able to say whether some some better options for you in here they are so I'm really interested this year going through this to figure out what what are the options for us and I'm I've got a bookmark on a couple of ideas but let's keep going. Thanks Jeff the next area that was brought up at our last committee meeting actually stems exactly with what you just raise council members related to increasing the vulnerability or exposure to unsafe living conditions for these individuals and recognizing that's where they're at now is often seen Preferable to other options for housing or shelter that they might have available noting that restitution is a process that is going to take some time and wouldn't bring me that they provide them assistance might not even be something that they can meet the burden Forks Rd. Documentation necessary. My understanding is that it's exceptionally rare right now for a civil infraction to have a restitution proceeding with it. So they're likely need to be a separate proceeding in which documentation and evidence were brought forward. I did want to highlight for Council Members looking at the the damage isn't out of the restitution that can be out on relocation assistance in the ordinance that's provided is capped at $2,000. And compare that to what is in our landlord tenant laws at the most a stylish the state level which provide for the greater of either 3 months of rent or triple the actual damages that are incurred. That's just for the restitution on top of that relocation assistance. That's again the greater of three months or $2,000. So instead of a maximum mm. Mm and then with our emergency order where the city says, this is unfit, you must leave are providing $4,734 or two months Ranch depending on the circumstances of the individual. So we talked about very very different scales of restitution is available to individuals with how the ordinances current the bill is currently drafted. What what is available for somebody who's in her apartment right. Now, what would it be available under the current thinking under the legislation and then put our our our options? What should we be looking at? Because I think it's it really matters if of individual. Actually has the opportunity to get three months rent. As removing, what's what's the pot of gold that we can access for that? If we're going after restitution are we seriously thinking that the RV Ranchers have the kind of resources that we would have to and then we need something fast. We can't expect somebody to say. Well I'm going to move out of here don't have another option, but we're going to go to court and get it out of this. But you know, it's sort of like the squeezing the onion there's not a lot there a way to the next point and I was brought up last week about the ability to advance payments, which is permitted under our 10 more lies, but would not be an option with the bill as it's currently drafted. That's not enough already that's provided despite the provision of funds that were there were passed in the supplemental better earlier. They work the bills at this point wouldn't allow for that. So sorry absent this bill going forward to folks who died today not for you could provide assistance to an individual residing in a vehicle that was written rather broadly. So there wouldn't necessarily you wouldn't have a situation where the person is being displaced and having a c candy relocation assistance just like to say it's not too dissimilar from some of our other homeless Services programs, like either prevention we call it prevention. Now where someone's eminently going to experience homelessness or diversion where they already are often are appearing at one of our shelter is going to provide them flexible financial assistance to move into a housing things like that. Please continue Insidious the last main area that was discussed last week was clarifying the impact of type of vehicles and who ranchers are specifically related to who ranchers are currently drafted wouldn't would still apply to someone is residing in the vehicle so that they if I'm allowing a family member or partner to reside with me. I could potentially be labeled as an RV Ranch and therefore subject to the penalties in and restitution or possibly lose my vehicle. I would know that there are two Court decisions that could potentially also be a play the I want the Superior Court decision and others in 9th us Circuit Court of Appeals decision that could come into play if that causes Boise RV Ranch used and it's not Legislation as we talked about I think what I see in this memo is the term predatory vehicle landlords or predatory refer to in subsequent paragraph So if we're talking about predatory landlords to individuals for dwelling units on Wheels, I think we can be really specific and attempt to be very intentional and our language. I just want to make sure that we're not using language that again gets us into sort of this association with somehow working with folks who were working with people. Individuals, right? So let's try to be really intentional about the language that we use and just stick with predatory vehicle landlords. I think that could help us out with the narrative a lot and I think it's the fault of the piece of legislation frankly, but it doesn't have it defined as who were talking about. But if I can offer that as a framework for us as we think about who it is that this legislation in theory, is it targeted towards if it's those predatory vehicles? Landlords, let's let's try to use that term Universal if we can and that's in lieu of Ranchers. Thinking about you try to be careful. Going forward to appreciate it. If we can be thoughtful about what we're trying to talk about here and how we regulated bad landlords in the past. This is clearly a market that's propped up because of that lack of housing lack of safe places in enhance shelters. And so I think for us to to just be really intentional about the language, which is what I was the walk that take away that I have from our last meeting that would be helpful. I don't know if you know the answer to this but I'm curious does this legislation or any discussions are there non-predatory RV landlords? Is there a pass to be in RV landlord and not be predatory as this legislation would lay it out. If you didn't meet the criteria of having a damaged vehicle that's inoperable there. There's four criteria. Yeah to the four is not a public health or fire hazard something like that. And then you could arrive at a situation. We're providing this as a dwelling unit force of providing a vehicle has Vehicles right now. Just saying that's not meeting those criteria. That would be permissible. We wouldn't be imposing fines and penalties. Repeat that song again. We shouldn't have people living in vehicles least people should have lots of choices that if you have seen a thousand people living in vehicles right now if there is a path to figuring out how they become compliant. We wanted to just go ahead and actually going on that. You guys are really setting me up all tonight. The landlord is we also raised last time was focusing on what types of vehicles would be impacted. So clarifying whether this is all vehicles just RVs, which have been the majority of the conversation also clarifying some of the conditions. For example, I think you come to my bro Brian raise that's looking at some photos. It's difficult to tell what is considered junk and miscellaneous things in the Call that are a hazard vs. Something that the individual in the vehicle would consider their own possessions that they might want to reclaim. That's not in. This is Dad's not specified and this kind of ties into an area that did not get into last time as well. There's not a discussion about the possessions that a person would have currently FAS will permit a person to be a company's to Lincoln Towing Sly and clean their possessions. If they need to there's not Protections in this bill though that would specify that should be done or anyting that notes how if the RV landlord is so I shouldn't be saying RV part of the predatory landlord is not allowing them access their possessions. There's no discussion of that or any rights or restitution laid out in the doll currently for that situation either something. I think that council members like we would want to consider on possibly as in Memphis and I'm certainly able to draft the language for that and some cases since it's already been raised last week. I'm prepared to do that. I've already I'm not separately but I defer to Counsel on what you would like me to do control of doing this and what sort of training would they receive for supporting vulnerable populations at all. It's not actually neither of those are specified currently. There is a remediation team is a collaborative effort between multiple departments SP parking enforcement spu FAS that's currently does 7rv, clean up sperm up right now others are also parking enforcement officer is going throughout the city. So there was a riot Avenue that you can have people that are that are actually implementing this and there. Nothing laid out about the type of training that they would need receive though. I know that in the case of the RV remediation team of of gone with them and seeing that there is certainly approach of trying to connect with The Navigators that work with the navigation team with other Outreach providers currently and also providing our region and Human Services resources as they engagement with individuals. My father was just if they were going to have case workers or mental health professionals with them when they were going out or if they currently do professional not sure how to answer that but there is nothing in this bill that would require that kind of training or that kind of connection. I think I'm hearing that we would like to look at an Emmett to add that tenant landlord law does not apply here because these are not for whatever reason they did not fall under the definition of that and I know that our tenant landlord laws are enforced me know if there's a role for the police or the sheriff or the very end of the process but largely enforced by folks that have expertise around defining that if we're going to be going in and I'm working with folks. We should be pretty specific on the types of qualities. We want to have people have their doing that work cuz it's complicated. Did have a question go ahead. Thanks very much that tails with a question that I was going to ask prompted by your earlier question. I'm still not convinced that we need this legislation. Is there not some sort of protection that we currently have for Consumer Protections consumer rights if these individuals are purchasing a product if they're purchasing an RV and they've entered into an engagement with the individual who supposed to be renting them a product is there not some sort of consumer protection law that we can also look at to say you've clearly rented out what you knew to be a faulty product. There was a leaking roof leaking Windows a broken windshield and a car that doesn't run and you've withheld the keys there seems like there ought to be some other protections for these individuals on that end and I'd love to hear if you have looked into that analysis. I definitely have it's a very important question in Focus. So the short answer is no there's not of the let's focus first on these as Vehicles, which as I said, the the regulations around Vehicles doesn't Envision a situation in which a person is dwelling in the vehicle. So that's not outlined as a penalty or situation instead. What you have is a faulty piece of equipment with your vehicle and you can pay a fine and I and I have to get it repaired things like that. So that wouldn't that wouldn't provide assistance but he's individuals here and I if you wanted to focus more to your question about seeing this as a rental situation the code defines a recreational vehicle as it actually says not a dwelling unit and then separately in the building code mobile homes are defined as usable for temporary living quarters for recreation camping or travel use. So again, The situation and for single-family home is having a permanent foundation. So with those definitions the only Avenue that we could treat these is being dwelling units or a resident of I had an RV that was parked in my driveway and I was in a prison deplorable condition and should be fit for human habitation, but I was renting it out because it's on my property sec. I could come and I can pay fines and have penalties associated with doing that. But in this case, these are the end that's that's because it's defined as I'm on my premises. My property sdci does not define premises as being in the public right away and therefore that definition of premises and the ability to impose those fines and penalties or those protections for these individuals is therefore not being extended and it's primarily a concern about the scope of what they are able to enforce and their capacity DP look at to be looking at the public right away as well as well. I said you not sure that this legislation is needed cuz I believe we're looking at this from a public health standpoint for the individuals that are there. What can we do to protect and then also it from a dwelling space? What can we do to promote more dwelling units that are going to be healthy. So do you understand sir that what I do think is needed is places for his folks to live. That's healthy. What I do think is needed is enhance shelters and lockers and I'm case management and safe place to be with your family so that people aren't getting separated. What I do recognize that this industry has cropped up so that people can keep their belongings and keep their family together and not have to go through the trauma of lining up in the morning and being kicked out. I'm sorry getting kicked out in the morning and lining up in the evening. And so I see these vehicles as the last resort for many people. They've kept their belongings there. I also recognize that a lot of times individuals are using this is the last resort because our shelters are at capacity and we haven't built the housing. So I absolutely agree with the need for us to get folks into safer living places and to get them potentially support from net Supportive Housing would be ideal for anybody who needs case management as I think council member of Ryan mention. This was somebody's home and we saw some of the conditions that we see we call someone to SS with case management because it might be considered hoarding versus the public safety hazard. This is a public safety hazard to have those living outside. The reason that I don't know if this bill is the right vehicle for addressing the concerns out there is still not consider. I'm still not sure how this helps those individuals who are living in that situation not be in a worse situation outside in the street or potentially Spyro back into the street if they do end up in some of our current shelters as so the question that I also have. Are we targeting the intervention if we know according to this memo that there was four of these slumlords on Wheels? What are we doing to hold those individuals accountable? That's that's one question number to it seems like there's a little bit of a revolving door if Lincoln Towing for example is the one who is Towing these vehicles off of the public right away. And then also then auctioning those same Vehicles back out. What are we doing to end that revolving door of those Vehicles going out that this legislation doesn't speak to that and I guess the last thing I would ask around the kind of consumer protection angle physically have lemon laws that help with individuals who buy a faulty car. Is there not some sort of lease law if we consider this a lease of a vehicle to make sure that those Vehicles ought to be Opera Opera tubal and in good condition that doesn't speak to some of the public health issues in the images that we saw last week, but I think it speaks to individuals being Rented or leased a product that is not up to par. So is that an angle that we've looked at as well? Stay are those the codes apply to a situation where a vehicle is being rented for less than 30 days. So in this situation, I'm not sure how they would apply at it. I have not looked into that honestly. I'm so I can look into that and also see if they're related to lemon laws and things like that how that would apply with the vehicle here. I don't have an answer in that regard. I think that you are correct focusing on the impact that this ordinance for this bill would have compared to current practice that is now in place administratively but had not prior to say June now as if these vehicles are being towed instead of continuing to put them into circulation FAS and the SPD are completing junk vehicle affidavits. They have their actually using very very similar criteria to what's in this. To determine that a vehicle that is in Lincoln Towing lot should not is it is a junk vehicle and should not be re-released. There is an Associated cost of the city for that up $2,000 two tubes that vehicle but they are doing that more now to prevent these vehicles from going back into circulation. They're one of the earlier numbers were given was that about half of the vehicles that have been towed or re-emerging after going through auction and said that with this area or has there been discussion either as part of this during the researcher with the police department about somehow putting markings on a vehicle to say not fit for human habitation may not be used for in so if somebody wanted to buy for $25 and tow it to their farm and use it before in a place that you can put tools that something very different than renting it back out and giving it to an individual has there been further discussion or review on that as the requirements and and and the locker? Play stands. None of these would be considered fit for long-term human habitation on because we Define RV is not being not be in terms of this specific vehicle is as they go through marking them licensing and put the yellow police tag permanently on it of any of those of the steps being taken in many cases there as individuals that were buying a large number of these vehicles at auction as FAS when Lincoln became aware of them. I understand that there are times that a person was not permitted to return to the auctions, but that they offer just locate a proxy that would come in their place. So they're finding ways to work around this subject is here that I would love to see his it's just his guidance and we think through ways to amend this ordinance or if there's another one is of course, I think the best Way to enter to the extent that they are Bad actors out there in this business the best way to drive them out of business. This is provide a better product and that's going to be permanent housing are good shelters that are more affordable like free and when we do that, there will no longer be a market for this and so that should be the focus to the extent that we're not capable of doing that immediately and we know that we're working on that but it's a challenge. I appreciate a pasta saying hey if there's going to be folks out there running RVs, you know, this is what acceptable internship looks like and and these are they RV landlords that are appropriately operating a business and probably other things about the probably need a business license. They don't have that in so, you know, if you want to normalize that you know, that's a bit but I think there should be a path the same that's okay and then Clarity around what's not okay to the extent that there are you know RV landlords site. What's the adjective for using? Predator predatory RV landlords out there who are looking to exploit people and profit off them. We probably just need to drive them out of business too expensive. There are people that you know, and I know characterizes wet that are out of compliance that are generally trying to provide a product that right, you know, what's help them get into compliance at the moment until we make their business model obsolete because everyone has housing options in Seattle and I think that's that's what you actually have a question about the ordinance and I don't have it in front of me, but there are the four criteria or two of which would Trigger 2 of the criteria would trigger one of those was about sanitary conditions in this at specifically about having a functioning bathroom or not. That's if you're looking at Since I can see maybe some paragraph. I'm not sure which and then you're lookin to where it's an adequate sanitation. And then you look down there's down to number four or the leaking fluids Automotive fluids. There is a functioning dump their sewage, even if it were functioning and so this is being dumped onto the street and cleaned up by ASP you with their their trucks that come in with suction it out in Austin. It's also then flowing into our sewage systems which especially with down and soda were talking about a sewage system that flows straight into the sound have some sort of a Functioning or any kind of a sewer system attached to it at all even have a toilet into that models make it fail on number 3 or is it only if you have a toilet in needs to be operable. I actually have not delve into that question, The problem has been primarily presented as an issue with RVs not with vehicles. And so if if the council wants to narrow that scope to view cuz I didn't didn't focus in on what how to setup Lan other vehicles. I'm back and I can definitely get back to you on that is not right. It's correct. So, I think I just wanted Clarity but with the intent is there and then apologies. Miniature people have to go to the bathroom. And you know, if if I will hope the intent is not to say that it's illegal to camp in your you know, your your car because it doesn't have a toilet in it. And then what do you do with RVs if they decommission the toilet, does that make it okay or not? And I'm not sure if the Texas decommissioned in toilet help us or not. Clearly when someone is dumping raw sewage onto the street or into a drain that made range of a body of water as opposed to the sewer system. That's a problem but anyone but if we eliminate all that these people still have to go to the bathroom somewhere and they're probably using the bathroom that probably inoperable in the RV because that's the best option to have in the middle the night before their part never take that away. I don't know where it's going but no solution. I think might be to figure out that this is a reality we can live with for awhile how we provide pump out operations for folks and so another place. We might want to invest in and just pick I like what you can't pump out in the street, but we will come by once a month and figure out how to clean this out or maybe the landlord's can sign up for this and that's part of their their lease agreement with folks. Whatever that looks like so you don't get it, you know focusing on how do we solve this problem? And then the problem is human waste and we all create human waste most of us has access to an appropriate place is filled with some don't and instead of saying it's inappropriate The Dumpling on the street say it like make sure we're giving them options. It is appropriate and it is safe and it is investing provide space for them to be and I one of those thoughts that I think I sent to both of you is I'm interested in whether there are some some buildings that we can access that we could lease that we could turn into 24/7 shelter. And obviously this is expensive and I really have a lot of faith in things to the executive because I know they've been working on this but just like This over the weekend. I was at Sam's Club that thing has been empty now for years and why could we not rent a facility like that at least have 50 places for people to be again increasing the 24/7 shelter. I'm very reluctant as much as I hate having these RVs out there that are terrible and condition and not habitable if we don't have places to put people we're just you know, we're stirring the pot putting people back on the street back in the intense back on it over the cardboard boxes. We haven't solved the problem. So I'm hopeful that whatever we come up with with this legislation, ultimately we're going to be able to find places for people to be there when you put them in do we put $100,000 into our supplemental Budget on Monday? So we want to increase this make it available for individuals. So between now and time budget starts, I really hope that we can dive into this and find a few more solutions. Really unrelated to this bill because this is exclusively focused on folks that are leasing RVs as someone else but for folks at do on their own RV, we know from the experts out there on the street that are working with these individuals transitioning out of an RV into housing is often a real challenge because this that vehicle is there safety net. That is the thing. That's a long table and what will be here is like hey, if you want to transition someone into more stable housing make it an actual transition and create a place where hey we're going to move you inside that your RV still there. We got a parking space on side made it maybe it's a 24-hour shelter that we think would be better. They still have your RV there and actually have a transition period where folks get to see what a different option would be without having to say I have to give up the one thing I've known for the last three years and I'm doing that and so that's not really what this bill is because it is probably not the case where someone is renting an RV rather. Johnson RV but I do think in the broader context of finding, you know, this is this is different than having safe. Lots of people can live in RVs, but if people are transitioning to shelter shelter other types of Housing and providing some parking for RVs so that they they can try out another way without giving up their current way and I suspected they'll find it like okay and I can I can do without my every now and then we can move someone out bring this to a close. So if you have any major questions, please let me know but one thing that came up and I didn't hear an answer to and that is if somebody is renting from one of one of our less favorite people right now, but they're allowing a partner to come in with them. I really wouldn't want to see that the individual renter is now suddenly falling under the penalties because they bring in a partner and say We're going to charge the individual renter who probably has no money to start with a penalty because they invite tip somebody else to join them. So it I'd like to Specs for that a little bit further. So if you have anything else we're going to have more conversations about this. It's it's not this is not the last conversation we're going to have but it is the last conversation before I break. So thank you for subscribing all of this. I appreciate it. I want to say thanks to our folks for the mayor's office. I know they've done a lot of work and that is well and we just are going to work on this jointly until we get something right. Thank you very much. And thanks for coming. So the next item that we have on our agenda is the city employees retirement system and I see the Jeff Davis and Jason mask you're here. Thank you for joining us and if you'll come on up to the table. And if we have an item to be right in sure item number to Seattle City Employee Retirement System briefing. Great. Thank you very much. Does everybody get settled in I I don't know that you've been to the table since I've been chair for finance committee, but welcome and if you'll just State your names for the record him. Moving forward. What up, you don't want to but please join us. My name is Jeff Davis. I'm the director of the Seattle City Employees Retirement System. Bring a little closer to you. Don't have to lean in great time with your Council Central staff. Thank you. Lee City Finance director and limo Drake and thank you so much, but welcome and I had asked to have you all join us give us a little update on our retirement system and this really a rose because of the potential legislation that Senator reuven Carlyle had brought forward last year that would offer us an opportunity to join the states states retirement system and I had asked for an independent analysis. You guys were great about helping get our other board that advises on various Investments to provide as an independent Alice's and the conclusion at the end of that was not so interested. So I didn't want to focus on that today. I wanted you just to talk about the health of the retirement system, but we can Circle back sure what we'll cover that in a number of other issues. So thank you for having us here today. So I've got a presentation will go through please feel free to ask questions at any point. Some things that we're going to cover today will give a little background about the retirement system will address the citizens Financial condition including the are assets are funding ratio and then actions that we've taken to improve the finances over the past several years. I've also talked about someone specific investment management issues investment performance the issue you raised about Outsourcing the investment management and then talk about environmental social governance is raised for the last 10 years. So we'll we'll fill them in great. So a little bit of background about sirs. It was established back in the 1920s and their provides retirement benefits to all city employees. Other than those that are uniformed police and fire employees that are covered by the state plan. We provide our retirees with a. Benefit plan that means upon retirement. They are guaranteed a lifetime benefit that is based upon their age of time of retirement their years of service in the system and their highest average salary. Search is governed by a board of Administration has seven members three members serve by nature of their role with the city. So we are shared by cancel. My call has the chair of this committee. Glenlee, the city's Finance director is on the board as is Bobby humans, the city's HR manager. We have three board members who are elected by our membership to or active city employees and one is a retiree and then the collective laid the six of them selecting a point are seventh board member. I just some stats about our membership at the end of 2018. We had around 9400 active members around 2,600 deferred remembers, that means they're no longer employed by the city. They haven't ever tired but they sell of money in the system and then around 6800 retirees and beneficiaries are those are the 6800 retirees and beneficiaries. So that our board serves a very important function for the system. They have a fiduciary duty and what that means is they take a number of actions. They make the number of decisions and when they do so they must do so in the best interest of our members in the best interest of our fund now we make a lot of decisions around Investments and none of our board members are expected to be experts in Investments. But when would they do make decisions they can rely on other sources as resources to inform their decision on the first of those is our our staff. We have a group of four investment professionals on staff led by Jason our chief investment officer and all four members are very experienced investment professionals. They each play a leadership role on different asset classes in overseeing them in our portfolio weather be fixed in Don Moore Public Equity, thanks that like that. We are advised by an investment advisory committee, which you referred to earlier. This is a group of five investment Professionals in the local area. They are not affiliated with sirs or the city, but they volunteer their time to give advice on investing issues to the board and to staff. 3rd, we contract with an investment advisory firm called any PC they are one of the largest investment advisory firms in the country. They have over 350 clients that they work with and over a trillion dollars of assets under advisement. And finally we are staffed don't make investments directly instead. We contract with different investment manager. So we contract with over 20 investment managers who each specialize in a specific area of our Investment Portfolio and then our staff in any PC work to evaluate the performance of those managers to make sure that they're meeting our expectations and their performance is consistent with benchmarks. We establish with them if we talked about this and if I'm around numbering here, but the budget for service is roughly 20 million dollars annually of which about 10 million dollars that we expand on. Sidon advisors. Do you know how that compares with other systems from Sophie's to our investment advisors is is roughly in line with with other pension systems, but Jason be one of the fund so we pay around 0.5% and fees and that is slightly lower than the median. Pension fund. So moving on to the pension systems Financial condition and conversation around here starts with a look at our assets. So at the end of 2018, we had around 2.7 billion dollars of Assets in our Investment Portfolio around half of that or invested in equities. So socks and US firms are international firms around 18% were in fixed-income. So thank corporate bonds or treasury notes and we have smaller allocations to things like real estate and private equity in credit fixed-income. The the goal here is to have is Diversified portfolio as we can. So Diversified across different asset classes and different geographies to minimize our risk. Next page we get into funding ratio, if you're looking at how how pension systems are judged what metric is looked at to gauge the health of a pension system. The funding ratio is the thing that is most often cited. So this is simply the assets / the liabilities of the system so assets we just spoke to that's the 2.7 billion we have in our Investment Portfolio. The liability side is the amount that we expect to pay current retirees and current employees upon their retirement. So the sum of that is our liability that we look on a funding ratio of 80% is considered to be relatively healthy for a pension system. If you look at the chart on the bottom left here at the end of 2017. We were at 69.9% if you look up earlier in that graph you can see There were times. We were over a hundred percent but a.com crash and other Global recession had something to say about that over the last couple years. We've been making steady progress in climbing in our funding ratio. So after a little bit of a dip in the markets last year specifically last December, we ended 2018 had 68.2% or 68.2% compared with other other whether it's the state or Tacoma or Spokane just in terms of the funding ratio. Sure. I can give you a sense of the chart on the right of this page looks at other pension systems across the country and gives a distribution of of what kind of funding ratio they are reporting so are roughly 70% funding ratio Falls pretty solidly in the middle of the pack of different pension systems across the country. It's a little hard for people to read. I think where would we fall? So at the end of just slightly to the left of the blue which would be the 20% of the pension system has a higher ratio Spokane has a lower ratio in the state is Are there over at their over 80? So do you want just described this I've had questions come from retirees. It's a Well, if our total funding ratio is lower than Tacomas. For example, are we in trouble? Are we going to get our make sure that we have are our payments monthly 2.7 billion dollars in and Investments we have access to liquidity so we can make pension payments. That's not a concern the lower funding ratio just means that you're more susceptible to if there is another big downturn that has a bigger impact on your portfolio access up. So that retirees are assured of getting the money that they have earned. So when we will get into this a little bit later, but when the city is work, How to make a higher contribution that is spread across all Department budgets the pay into the the system so citylight employees those dollars come from City like funds general fund apartments on channel $5 you were reaching for your microphone Glenn in general the pension payments that employees are burned is a commitment of the city and the courts across the country of indicated. It's almost as important as paying are dead on her bonds and so from my perspective, even if this number is substantially lower there is no risk to retirees to receive their their pension and there are some systems in the country that are in trouble they're in trouble because it's costing them so much to meet those obligations, but no one's pulling back on the obligations with the exception of maybe Detroit maybe Puerto Rico, I'm not sure where they are right now, but in general in the west coast and certainly in the Seattle region or or their Northwest there is absolutely no risk here to any retiree and relative to their pension that they burn through Oscars and this is a measure really of figuring out where are you all the mayor and the council how much you want to contribute in the system to make it even stronger and you're committed to through the last several years you've committed to bringing up this ratio to 100% over a specific time frame through 19 1940. Right? I mean to say we should just let Jeff give his presents. So over the last 10 years the retirement system in the city of made a number of measures and taking a number of steps to improve our financial condition and our long-term sustainability of the pension system the on the investment side a couple of things I mentioned before before 2008 there were no investment professionals on staff at the retirement system. There was no investment advisor under contract. So that changed in 28 when we get hired our first and best professional but those changes and building out the capacity really start accelerating in 2014. Everything a lot better in 2014. We we we build out our team of a for Holly highly qualified investment professionals. We contracted with any PC and we A concerted effort to really recruit individuals onto our investment advisory committee that we thought would be a value-add that would provide good advice to the board and staff as we look the different investment issues. To the point that we're just discussing the the city has demonstrated a strong commitment to funding its obligation. It's making all the actuarially required contributions into the pension system and I'll talk a little bit more about that every year. Our actuary does an assessment of the pension system. They look at our assets. They look at our liabilities and they do have what's called a valuation report. And in that report they say what level of contributions contributions are needed to get to a 100% funding of the pension system by the year 2042 because the contribution rates for employees are there are sad through Labor agreement. The any change in that overall contribution is done by the city. So to put it in perspective before the big recession. The city's contribution level was around 8% next year. It's going to 16% So there's been a pretty dramatic increase of the city's contribution overtime, but it's going to point the city has demonstrated that commitment to fund its pension system obligations. I even when it's been very difficult. So so that's one piece there other the other things that we've done to address the long-term sustainability of the pension fund. The first was closing the amortization. So I imagine that were the goal is 100% by 2042. It used to be that every time we did a valuation report weed establish a new 30-year window for amortizing that liability and when it came time to do a new valuation, we'd move that 30 or window out another year in 2013. We close. Who's the amortization. So 2042 is the hard date. So when we do another years valuation report, that means we have one less year to fully fund that liability and that puts more pressure on the contribution side to to make sure that when we do that report, we're staying on that path to reminder for Spencer contribution from the city to 15.46% rate on an applied again salaries is going to actually go up as Jeff said to 16144 the proposed budget and that's good very good for the employees and for the retirees just for those of us that are balancing a budget and scraping the barrel trying to find more money for housing and trying to deal with some of the That just means that there's less money in the general fund for us to scrape second thing. We did as a city to address long-term sustainability is create a second cheer for the pension system. So what we call a servers to is in effect for new employees into the system after the start of 2017. So just like service one. It's a defined benefit plan. Just like Siri as one when it comes time to retire. You have the same set of options that you can choose for your retirement, but it's different mainly in the fact that the employee pays less into that system and the employer the city pays less into it and that's has a decreasing effect on that long-term liability that we have. The last piece is reducing the expected rate of return on their investment nine years ago. The assumed rate of return. This is the amount of investment return that we view the portfolio was going to average over 30 year. That was 7 and 3/4 percent and 5 years and 5 years ago. We drop that down to seven and a half percent last year. We drop that number down to seven and a quarter and the goal here is to be as realistic about what we think those investment returns are going to be as possible. I'm so 7 & A Quarter represent our best view of what that lower return environment we're going into will result in and and we're not alone in that other pension systems across the country are all pulling down there as soon as rate of return about 7.0% that 7.25 was smack in the middle of the range. I tried to pay pension systems. Can you tell me over the last remind me over the last 10 years what has been our average annual rate of return has been 9.3% As of the end of March in years have been pretty good for the most part 2 years of last 10 years have been pretty good. But again, this is a forward-looking view like we expect the next five to seven years to Performance actually be below are assumed rate of return. But the expectation is that over that entire 30 year. We will achieve the seven on a quarter rate Market that we all recognize is that the Ebon flow and they've been blowing pretty well for the last few years minus December of last year or today or today did bad things happen. I don't want to talk about it. So an ex moving on to investment management issues. And when we talked about the the Investment Portfolio first topic on everybody's mind is what has been the performance of the of the portfolio so we get into that here and just don't worry into you on this charge that's broken of the three sections the first three bars represent the last 10 years experience second three-year the last five years and the third row of the last 3 years the blue bars here represent Services actual investment performance over those periods. The green bars represent our policy index. So on that it's looking each different asset class. And what is the Benchmark for each one of those asset classes collectively that establishes what the policy index is and that's that's really the yardstick. We measure our performance against the yellow bars that we presented here represent our Purity universe. So looking at other pension systems across the country with over a billion dollars in assets. This is the median rate that there is pension systems had realized so just walking through this at the 10-year. You'll see that serves his performance leg behind both the policy index in our peers the story changes when we look at the last five years where we're right in line with the policy index for a little bit above our peers and a similar story in the last 3 years. Where were a little bit behind the policy and Export a little bit above our peers. So that actual performance changes pretty dramatically in the last five or so years. I will say that if you took the same view 2 years ago or 3 years ago that Gap and not 10-year figure between our performance and our policy index are our peers would have been much like the series of performances lagged behind our peers in our policy index by a significant amount in that. Which leads us to our next topic is that You mentioned before that's the issue of Outsourcing Investment Management. So over the past several legislative sessions in Olympia, there have been bills introduced that would allow the state's municipal pension system. So that's Seattle-Tacoma Spokane to Outsource management of their investment to the Washington State investment board. These bills have been billed as allowing the municipal pensions to leverage the economies of scale in the size of the Washington State investment board to result in lower administrative costs or have access to Investments that they wouldn't otherwise have access to the last bill Senate Bill 5240 was introduced last legislative session and that bill didn't make it out of committee. But and look, The the Seattle or the service board and the city. I thought that it was worth looking at is a matter of due diligence to see if in fact Outsourcing Investments is something that is in the best interest of the city. So to do that evaluation, we reached out to our investment Advisory board or investment advisory committee. And remember this is the group of five in investment professionals who volunteer their time to advise the service board and and staff on we ask them to look at this Senate bill and look at it Alice's that have been done around it and report back to us to see if they thought that Outsourcing was in the city's best interest. So they did that work and came back to us earlier this year and they said no they did not believe that Outsourcing was in the city's best interest. They said that sending the Investments to the state to manage only remove responsibility for that part of the equation that the city would still bear the responsibility for for the risk of managing the liabilities and I'll read from some of that from their report. They said the city would incur significant additional Financial Risk by separating in perpetuity management of investments from pension obligations, that serves has more than adequate scale to manage its portfolio effect of lake so I can they reported that in a presentation to the service board earlier this year and I just like to take the opportunity to thank the members of the investment advisory committee. You further for the surface that they provided the setting. Thank you. And I will admit that I pushed to have that review and I appreciate the fact that both of you were willing to let that move forward because we do have in the record from these five independent advisors their recommendation that it's not in the city's best interest to proceed and join forces with Washington State investment board. So I think you for doing that and at least for this. Of time were thinking which better to stick with the program that you have all created, and I'm I'm thankful that you were willing to take a look at that and thank you for pushing up. The the last topic is that of environmental social and governance issues and end this appeared on our radar back in 2013 in the form of people petitioning of the service board to divest from fossil fuels and at that point. We didn't have a environmental social governance policy. We didn't have a procedure for evaluating proposals like that. But but we develop them very quickly and do over the the next couple years. We received a number of different proposals to divest from fossil fuels and we did Thoreau analysis on each one of them both from the investment side and from the legal side and the conclusion was always the same that the certain that the pension system could not divest from fossil fuels and still meet are fiduciary duties. So that was the conclusion But I will say that these proposals really pushed us to evolve in and how we thought about ESG issues. So we established and yes you policy back in 2013 and 2015. We created something called a positive action strategy and it's a group of a group of actions that we can take to address climate change while still meeting are fiduciary responsibilities. So the positive action strategy has three main pillars the first issue shareholder advocacy because we don't stock we have a voice as a say in the governance of Corporations. Now, we have a very very small boys because we don't have a big share and anyone Corporation, but when we combine our voice with those of other pension system summer much bigger than us. Are foundations or an endowment collectively we can move corporate boards and and we've been doing that and we've been emphasizing things like pushing corporations to do risk assessments of how their business is at risk from different climate change scenarios to disclose those risks and disclose that measures they've been taking to mitigate those risks and we've been pushing Regulators to emphasize that corporations should just close those risks. So that's the specific layers. I know that you've mentioned it to our board on a couple of occasions, but where we actually were able to move the needle So there's a number of opportunities over the last several years for us to do this. We need her this mall number of companies. I'm one of them is is axon that I feel is actually the worst responses are the climate crisis. We've done things around requiring them to do a planet risk assessment at the published to a publicly talking about how they how they're going to think about our machine on deciding which new projects to invest in. We've also made sure they open up on discussions between shareholders and they're bored and it's been very difficult to move that company. I still think were several years away from having a real Watershed event, but they were laying the groundwork now for doing so is ample of of where shoulders add a lot of interaction many years ago. We shall I shall miss him a lot of things recently in the Arctic there now, it's not stopping doing that. Also around on incentivizing their Executives so that if they reduce the amount of greenhouse gas emissions, they're actually benefit financially from that. So I hope it stays with move more towards that level and provide a greater us a Ford realtors in these companies tuition Stanford Harvard Bowden as an example have been able to divest or at least have a policy that moves them faster towards that dusting. Would you just explain again why they can do it and we camp And it has to do with the fiduciary responsibilities to the board members have and several years ago. We asked our outside counsel to do an analysis of the accounts to analysis for the for the port subsequently released publicly talks about a lot of the issues related to stay law and the the problems that are the inability for the service board that is against the financial interests of the members the system. So because the surfboard is acrossed and abide by different set of requirements than a University Foundation private Foundation that are able to be more Mission driven in the organization question repeatedly, I think you finally Handed me the the legal opinion. I'm going to try to get it. So thank you for that. And another point that that came up on ESG. And again, that's environmental social and governance policy. And I think I brought this up to you Jeff after we had the the National Conference in Austin this year. I learned from the New York program that they're investing in some things that were they would make sure that workers are protected or that individual Investments have Not just worker protections, but some of the the public things that were looking at that we believe are promoting project labor agreement and others and I know New York City had been that they were one of the speakers they were proud of their results and said that their returns have been grape. Can you talk about that? And then and how it's something that we can take a look at to this is related to a responsible contractor policy. I believe is what you're alluding to it typically relates to real estate Investments when you're constructing a real estate building and ensuring that you are responsible contractors adding one unique difference for New York New York City Retirement systems that are approximately 200 billion dollars in assets and is that they're actually fully funding and fully constructing buildings themselves where is ourselves we invest through funds through the managers that Jeff alluded to so we really on our doing two buildings on the investment managers. Investigators are running funds of many investors ourselves being one of them to make these decisions or ability to drive things ourselves as some of our limited but most of our real estate managers to have responsible contractor policies in place and particularly those firms that do a lot of development. That was one area that we we talked for managers about as it relates to social elements included in NES energy what you just said, it was something that I didn't realize New York s 200 billion dollars. We've got 2.7 billion in our our our account, but I did not realize that they were funding their own some of their own development that is darned impressive and I think we'd looked at that through South Dakota maybe that they had created their own bank their own pension system that was fun to be able to find some of their public development and they were able to just essentially borrow Thank you. Thank you for explaining that you just have a little bit left. I do. We're in the home stretch, is that of sustainable Investments? And so here we proactively it evaluate Investments that are expected to have a positive impact on climate change or address climate change where this comes up most for us is in the area of infrastructure. So we have infrastructure as one of our asset classes again, we don't make investments directly we invest through investment managers and they have a wide variety of projects that they are investing in but one of the more prominent areas of infrastructure Investments, and then the growing area is that of renewable energy. So in investing through these infrastructure managers will we have a s take? magic Queen future and I should note here that when we make these sustainable investment. It's not because we want to do good or that were we have the environment first and foremost in our mind. It's it is because we believe these Investments are the best economic result for us that they are at equal or better than other options in the market. At what point can we begin shifting towards things like biofuels that I know right. Now the rate of return isn't as much as as Exxon or shell but at what point can we say, we believe that for the greater good and that the return is equal to the kind of Investments that we could get by staying with fossil fuels Yeah, I think it's on about I never seeing in solar panels wind turbines things like that. So it's really has those types of power source has become War cost if it Advantage is there more money that can be moved towards those sources. I see that Thatcher's continuing down the future one of the bottles that people are waiting for is on tomato worm on lights. Org is a battery storage for the real problems right now is you can only generate electricity when the sun is shining or the wind is blowing. Give know if screen that for future use two more to clean economy. It also been a movement on from coal based Our Generation to generation which I think is in a marginally beneficial from a from a perspective but I don't really see the point in time and the Horizon where it's going to be a hundred percent renewable, but we passed legislation on Monday. If you know the green Seattle plan and a lot of that was very aspirational the idea that we would be completely off fossil fuels in 19 and 20 30 strikes me as being a wonderful goal. I hope we are I think there's going to be some transition between now and then but to the extent that as our service plan is making Investments. We have an opportunity to look at things that we believe are going to be green in for the better good of the country. I just hope that we are able to do that. When did you have anything you wanted to add? Mr. Finance director? I think that the staff is done incredibly Innovative work in this area relative to this really important legal constraint we have and I'm very proud of their efforts and and in particular the last point, I don't know if you went through is incredibly Innovative. And so Jeff you want to explain that I can go to that last piece of our positive action strategy is integrating climate risk and what we look at our portfolio and how it's constructed. We assess how resilient it is under different conditions. You know, how how does it respond to high inflation or low inflation or high volatility low volatility? How do shocks to world events impact the portfolio lately. We've been integrating climate risk into that assessment. So we look at all of our different asset classes and make an assessment on how we think those asset classes wolf. Form and different climate outcomes and and that along with the economic factors just add to the calculus on how we construct our portfolio and how we spread it across different asset classes. So we are thinking further ahead than I would imagine any of our like retirement system so cities and counties about what our portfolio should look like. Again. We have this very binding legal constraint that we have to invest only to maximize our returns given an amount of risk and yet this portfolio of work and in particular thinking in the future about what is a good portfolio profitable one with climate change is a reality is so Innovative and it's just traffic or do we have that written up on our website? I was part of our presentation at the investment committee. I think last month. I report to the board G+ Arthur quarter in September. So I'll be one of the items On That September to the public and to know all the good work that you are doing. I think it would reduce. The number of people in The Angst where people are asking you to invest in things that you don't feel comfortable for a variety of legal reasons and doing but to have it on the website so that they could just click on it. You know, why or why not and you've got some some really clear information one of the things that we're doing it almost every department is pushing for a dashboard be able to say what are the investment what it was the outcomes for shooting for what are the measurements? How are we doing and something like that? I think would be very valuable to her report on History issues quarterly. All those quarterly reports are on our website. Let's just do it again and maybe have some for this next one coming up and see if we can highlight it because as wonderful and clear as financial data can be off and I was people don't really understand unless they can see some bar graphs and charts some things that just bring it home to him. One of the last things I want to say besides. Thank you for coming and thank you for spending your time putting the presentation together is I know Bobby Helms Hazard now or HR Director he and I talked again about making clear two people get a you are a member of the city employee employee family and you get your retirement. You've asked after 5 years if you stick with it for 30, then things are looking pretty darn good for you how the 457 plan connects is something that I mean as recently as this morning. I'm talking with people who are saying I don't get that. I'm really confused about it. And I think we take it for granted. As we understand the retirement system in 457 is just something else you can you can do for deferred compensation. But again, the earlier people can invest in that the more money that they will have a retirement. I think it just gets lost because it's confusing and there's a lot of information out there on that great. And you know, I don't think it's just like making it easy for people having something that they could follow or some benefit length that they can click on just to have that information and it's so, you know, basically it's a 457 101. We're looking for and how that connects some people call me. I want to invest in that if it was even $100 a month to get started in that it really matters great like to cancel calling. Would you like to add any more things? So I know you're going to be deeply suspect you're going to be deeply involved in this in the future. So, thank you for participating today. Nothing else you'd like to add anything else for the good of the order Jason. Thank you for your expertise to and Jeff your steady guidance. I appreciate that Tom. You have anything else you'd like to add just one thing then. Thank you just to kind of have a touchpoint with the budget since you did raise that point and how this all plays into the budget. I did check with CDL to get some data on the impact in 2018. So the total contributions from the budget into the service fund was $189 118 million. And so that's across all funds. So the general fund Cy fund Ascot and some of that piece 27 million is in the general fund. So the the bulk of that is 90 million dollars roughly is coming from the utilities and public utilities and S. Okay. Thank you. All right. Now that's helpful interesting enough. I just got a call from the media that was asking that question today and I was on like I'll get back to you on it. Very good time. Thank you. Thank you both for coming. Really appreciate it. Thanks Glen. Okay item number three. I would like to invite our next presenters to the table. And item number three is our 2019 Citywide position list. Phoenix Erica to see you and all from HR. So Corinna, would you like to start off with the introduction please? Yes. I am Carina Bowl. I'm with Central staff. I like the sound of that by Sarah Butler sdhr. Joy liechty Seattle City Light, thank you and you can bring these things towards you move them so that it's just so you don't have to lean forward nice to see you all clean. Are you setting this up for us? Yes, I am. So we are you are here to discuss a legislation that was submitted by Seattle Department of Human Resources at this is the 2019 Citywide position list and it is essentially a list of all regular full-time and part-time authorized officers and employee positions and City Departments of this is an annual administrative procedure that will not have a sensitive impact the city operations employees are funds this ordinance would become effective on January 1st of this year. Once it is past that interesting notes. Is that the attachment to this ordinance? List a total of 12106 positions, which is 8.32% increase that's 39 positions from the 2018 position must visit include part time as well. It does and Lena. Would you read this item into the record for me? Give me for the record Council Bell one 19577 enormous Relief Society employment adopting 2019 Citywide position list very good, but go ahead please that is that is basically a short overview of this ordinance. Great bars what I have to offer Sarah. Would you like to add I don't have anything to add you're kidding me. We've got five of us here at the table to anybody else want to talk to us about the position list. So I know you came for a good reason. I'm interested in. Just what's next with his ordinance. So we pass the ordinance today. We will be it's already included in the 2019 budget Sarah. What do you see in terms of just the number of employees who is everybody covered everything else? We need to know nothing else. Just want to be clear. There's not a financial impact to it. It's it's just it's just it's just a list. Okay. This just sucks the Baseline for 2019. And so will the second quarter supplemental is 1/4 quarters get built on top of this and so we kind of reset to ground ground everyone at the beginning of the year. And that's the purpose of presenting these and putting it together. Well, I like that very much. Do you have any questions? So this is Council Bill 11957 8th. And since we have reached the end of any presentation on this, I'm going to move adoption of this Council bill. All those in favor say aye very good. There's no knows. There's no abstention. That was the easiest things come before. It's in a really long time. Thank you very much. All right, so we'll just move on to the next items. Would you please go by the way? I'm supposed to say that the motion passes and it's going to move forward to the full Council next week. So I how do I add item number 5? How about item number for Council Bill? 11957 8th and ordinance really into City employment adjusting the pay zones for titles and Cities Power marketing Compensation Program. Great. All right. So this is a another piece of proposed legislation submitted by the Seattle Department of Human Resources. And this legislation would adjust the pay zone for a supervisor position. It's the power marketing lead in Seattle City Lights powder marketing at Compensation Program. So this proposed legislation legislation follows the Recent ratification of a collective bargaining agreement for the power marketer positions at these two positions. The power marketer leads were not included in that collective bargaining agreement because they are supervisor positions. So this ordinance is being proposed to prevent wage compression that might happen if the power marketers get a raise and then the supervisors don't realized that I made an error reading into the last vote. We took that I was reading in Council bill for item number for and that item number three. So if I can correct that and then also recognize that our next are our next meeting is in September and it's not this next coming Monday. So if I may just take this again just for the record that I Number 3 that Lena had correctly read and it was canceled one 19577. So I'll just take that vote again those in favor of proving this Council Bill say I thank you very much and then opposed no extension. So Council Bill one 19577 has been adopted and we will move this through to the full Council. I'm at our first meeting after the break which is early September. Okay now, we're on to 11957 8th and item number for back to you. All right. So again, so this ordinances adjusting the pay zone for these supervisor positions in the power marketing Compensation Program and that the ordinance specifically it would change these lead positions from hourly to salary with eligibility for exempt status under the fair labor standards Act. That same status change also happened for the power marketers under the collective bargaining agreement. So that's that's happening across the board. But this is no moralizing for the power marketer leads and it would make the power marketer leads eligible for a one-time base wage increase that would be dependent upon their performance. So an employee that has unsatisfactory, unsatisfactory performance during 2019 would not be eligible. But if the employee is eligible, then this ordinance memorializes the increase pay zone for them to get that so do I understand that this ordinance just applies to two employees, correct? Seattle City Light to have anything you'd like to add to this. No, nothing to add Jeff questions. I don't this is obviously something that you all have worked on and if you're recommending it then I just Sue move forward with it. Cancel and reschedule. All right, so, this is Council Bill 11957 ate all those in favor. Say aye I should get a second out of it. Thank you very much. I'm so none opposed and there is no abstentions. So this too will move forward to the full Council in early September. Okay, so that was item number for item number five is canceled one 19591. If you will read that one in Forest. Yes and ordinance what you want to stay for the rest. kitchen extend This is this is this our public hearing. Okay, so let's describe. What's happening with Council Bill 11959 one. We do have an opportunity to open this for a public hearing and take public comment on Council Bill one 19591 Anybody here wanting to talk about our public hearing? So I'm opening the public hearing anyone seeing those speakers rushing to the microphones. I'm going to close the public hearing Deborah Smith nice to see you and maybe like to introduce yourselves. My name is Bill Devereaux and the director of Environmental Management and real estate division with citylight citylight and we just really wanted to thank you both for accommodating us. I know time is really tight right now. And so getting these these items through committee here couldn't have happened without your flexibility. So thank you very much. I absolutely was a pleasure to build you want to introduce this after I read into the ordinance relating to the Seattle City Light Department declaring certain real property rights Surplus to the needs of the city light department in authorizing the sale. I'm of portions of the property to Snohomish County for Road purposes would like to remind me before we get ready to the vote that I have to suspend the council road so we can vote on the same day as her extensive public hearing that we just had. That was supposed to be a joke. Is it to have a little green light halfway up the stem is a gray button, very pretty basic real estate-related type of this one just allowed Snohomish to to widen their 35th Avenue Southeast Broadway near are transmission lines. We retained our easement with them. So we still will build a operate frying with them. And so we sold that property to the but retained our rights are wonderful to work with but we got some big meaty issues coming up in the next year Okay, so It's nothing else, but four more Parcels were going to go through individual leotards. Well, I'm happy to make it, just about all four of them together but no picture you so much for bringing these issues for these next four bills really in combination or sort of what we see as the meat and potatoes of issues that are usually dealt with in the energy committee. And really just want to thank you publicly for your offer to bring these into your committee as I think they were late nicely to some of the other good government functions that you've passed today. So excited to be able to work with you to get these through the committee and make sure that we have items that are not major deviations from policy or program changes, but really are routine businesses at business items at Seattle City Light is required to pass forward so that we can gain authorization from city council to proceed with them and I really think that this is a kudos to you and your team Make sure that we were well prepared. So thank you and I seem are in the audience but really did TWP these items nicely so that we can just move forward and have these small real estate transactions in front of a very good. So did you want to say anything more on the Snohomish County 35th Avenue to do is go ahead and will the second. Okay. So this time I'd like to move to suspend our Council rules that relate to voting on legislation on the same day of our public hearing. This will allow the committee to vote on this bill Section 8. Okay, all those in favor. Say aye aye. Okay, so that just suspended the council rules. So now I'm going to move the committee path Council Bill 11959 1 second all those in favor. Say aye no extensions sew the first one check. So now we'll move on to the next one. Read this in for me. Cancel Ville 11959 to an ordinance relating to the city light department authorizing. Just read it. All right have a great general manager and chief executive officer to negotiate for purchases or purchase or lease up to two Parcels of land in acquiring other real property rights as necessary or desirable for the purpose of providing temporary housing for citylight personnel and contractors at the boundary hydroelectric project and pinned under it Pend Oreille County, Washington and stumbling over Pend Oreille. That's why you didn't want to read the whole thing. Okay, please go ahead of this one is pretty straightforward. We're looking we have two different things going on. One of the parcels would be purchased for the providing a place to stay while people are up there on a project on implementing the boundary license many projects over many years. The other II Parcels for specifically to project we were will You doing a recalls on their generators and a Transformers up at boundary and that will also give them a place to stay that will give us cost of consistency. We won't have to be relying on the market and at the end of the project if it's still no longer needed we can always sell it sell it then we don't know yet because the else you'd like to add any of the questions. Okay. Well, this is Council Bill 11959 to I will move to pass this bill all those in favor. Say aye aye extensions very good. So again this motion passes and it will be recommended to the full Council in September. Okay at the item number 7 coming up when 19498 and organs relating to the city lights apartment accepting statutory warranty deeds to the best neck and lemons property in my gosh project habitat lands as required by the Federal Energy Regulatory Commission license order for the boundary hydroelectric project and play Swing Set plans under the jurisdiction of the city light department requirement of the terrestrial Resource Management plan to pay me about 158 Acres this will this ordinance allows us accepting the deed of two Parcels that total 65 acre so we still got some ways to go. And each of these are these Parcels are designed to protect Wildlife as part of our license. So we found some good places for it. And these are two different parcels and the cost is about 190. Mm. Any other thoughts? Anything else you'd like to add so I will move the committee path Council Bill 11949 ate all those in favor. Say aye standing. So this motion passes and the committee again will recommend it to the full Council and September are good. So I don't underrate relating to the city lights apartment accepting various easement for overhead in the underground electrical rights in King County Washington placing cities events under the jurisdiction of the city light department in ratifying the confirming certain tracks very good. Thank you next to or just kind of housekeeping ordinances of Pastor of past action that we've done. So this one is a 451 different reasons that came into play when we did the Whenever there is some land use permitting actions that we changed our easements so that this is a phone over a. Of time 451 easements were made for this. Thank you for that the technical and housekeeping effort. I know when I was cheering Seattle Public Utilities, we would do the same thing periodically, some of them they found that were really old that they were bringing forward. Thank you for that any other questions or comments they so we are looking at Council Bill one 19533. I would like to move that we passed this motion or this is all those in favor. Say aye no abstentions. Thank you for that. So Council bill when 19533 passes and we will recommend this to the full Council in September. We got one more and then I have a thank you for you. So go ahead and cancel bell 11953 for an ordinance relating to the city like apartment accepting various easements for overhead and underground electrical rights in King County Washington placing set easements under the jurisdiction of the city light department in ratifying and confirming certain prior acts very good. So this was very similar to the other one except this is for individuals. When they need power brought to their to their home, so this is another list of of over a. Of time a hundred and twelve easements that we made with individual Property Owners or or businesses that need an easy for us to get into the negative power, especially like an glad that we're not making you read all of these in better. None of them had to re-up for today and I would like to move to pass Council Bill one 19534 and again will be recommended to full Council. So thank you for that if it's so anything else here for the good of the order. So Deborah Smith. I have been singing your Praises for weeks and weeks now, but I just want to Fresh my gratitude for the work that you and your team are doing with us on Thomas Street. I had another meeting today with s. The plans that came out of the design charrette. I'm only talking about five or six blocks but you your willingness to extend the sidewalks and put some light and some art on the Thomas Street station is seriously making all the difference in the world because once people saw oh this is going to be great and start Engineers themselves said, look, let's just closed off that last 1/2 block. So traffic will not be coming in there. The skatelikeagirl parcel is going to extend all the way down and I'm just right to the edge of where we're looking at having a pedestrian and bicycle blue Nerf and priority before you go into Seattle Center. The Seattle Center folks are thrilled because now we've got a whole kind of an almost more than just a walkway but a beautiful inviting Spacek, Thomas and 5th as as an entry point, but truly it was your willingness to step forward and say City Lytle do this that really made things move. So thank you for your work on it lately bracha and Antoine Tron cuz they actually I'm have been working behind the scenes to change things at night. I had a really good meeting I think two days ago with Randy angstrom from arts. And so I shared with him that the drawings that you had shared with me and he thought that was pretty cool too. So glad thank you what happens when people are willing to get DS so many thanks. Okay. Well it was nothing else for the good of the order the meeting's adjourned.", "end_time": 6730.4}]}