{"format": "raw", "annotations": [], "confidence": 0.9543736820871179, "data": [{"start_time": 0, "text": "I can never talk about sports to my good morning. Thank you for being here for our regularly scheduled Council briefing. We have a few excused absences given the holidays last week. And so the four of us to show to plow through it. I didn't want to say for example, for example that there's nothing for both this afternoon from the government and Technology committee on the full Council today. However, I would you want to describe next week Monday. We have a special meeting from the select committee on Civic Arenas and now the car on 10:30 7:15 after a council briefing mystery items on that agenda. And these are all mention that the last Civic Arena is meeting the first issue will be up two stops just sign overlay district and sign regulations for the Shadle Center trying to improve all of the wayfinding is a lot of activity there and we want to improve our way finding efforts there. That's the first there be a public hearing associate with that. The second issue will be a to amend a facility use agreement for Stan Hoops. Otherwise known as the storm there was a very successful negotiation the storm in the center at where the developers and so that agreement will be ratified hopefully through legislation and the third issue is relative to the public skate plaza is just basically a technical transfer of property from one apartment to the other in this case from the shell from s. To the Seattle Center and I we want to make sure we have that public skate plaza in good form. So we'll talk about that and hopefully both those out of committee next Monday and 10:30 small But Mighty group this morning good to see you no items today for the financing neighborhood committee, but we are having a meeting this Wednesday. This is July 10th, and those of you who've been paying attention. To Michael breines work around the short term rental tax ordinance and the sweetened beverage tax ordinance. Both of us are going to be for a possible vote. And we also will be reviewing the annual action plan for the 2019-2020 to Consolidated plan for Housing and Development. This is accepting grant funding from HUD. So we'll have a presentation. I don't expect there to be anything unusual. Also, there's going to be a slight adjustment to what we announced last week. We're going to have our first briefing on 5 budget ordinances for the second quarter and that's going to be on July 24th. So it's two weeks from this Wednesday, but it includes our 2018 exceptions or nuts the 2019 carry forward the 2019 second-quarter supplemental the 2019 second-quarter grades acceptance and the 2019 Capital abandonment again, I know all that sounds exciting but we Going to be doing that on July 24th two weeks from this Wednesday. Also, we are going to be voting on these items on August 9th at a special financing neighborhoods committee. If you got any questions Allison in my office is leading the charge on that and also last week I mentioned that with my Bobby Humes, we have more intend to be voting on his final appointment for the director of SD HR human resources, and we will have that expectations letter. It's been circulated to you. If you have any other additions be sure to let me know and just We'll add it into the expectations letter this week. Also I have been asked to remind you that one of the things that my office has been leading and thanks to Brian Chu we have been having public realm studies down in what we call yes or crescent. We did one data Gathering a couple of weeks a couple of months ago and it was First time that a star has done that and we're going to do it a second time this Wednesday and Thursday. I'm planning to attend and you don't have to attend for a long time. But if you want to just get out, hopefully the weather is going to improve but we identify how many people are coming by what they're doing if they're sitting there standing at their loitering if they're dealing whatever but just to be able to get those numbers. So is this Wednesday and Thursday and I'm intending to spend at least an hour both days doing that. So if there's anybody on the legislative floor that wants to join us Brian she was looking for volunteers. So thank you for that. And then lastly this Friday. We are working with various constituents from Belltown South Lake Union. We're doing a design charrette for Thomas Street and Michael Brian's office. I want to make sure that Mike is aware that we're moving forward with this and we have hired three different design firms to help us with Nodes along the way so that's both east and west of Seattle Center to help people move pedestrian bikes cars right to get to the Seattle Center. So if you're interested in joining, let me know before you proceed. Let me in on this. I did want to say that I'm joined by council members Bagshaw Juarez and Gonzalez we're here and there's no objection the minutes of the July 1st 2019 meeting will be approved. Hearing those excellent Minister approved list counsel present Harold was to congratulate the US Women's World Cup victory. We know that you'd also skipped over that that that was that was phenomenal. Queso our next Civic development public assets and native to news media will be Wednesday, July 17th at 2 p.m. To accommodate scheduled before August cancel recesses our last Apna meaning originally scheduled for August 7th has been moved up this me is now a special meeting for Wednesday, July 31st from 12 to 1:30 second on July 9th at lunch and learn the AIDS Memorial pathway. I'll be co-hosting a lunch and learn with council member her Bold and the Civil Rights utilities Economic Development Arts to enshrine the historical and current efforts of Advocates fighting to end HIV AIDS discrimination. This is otherwise known as the AIDS Memorial pathway, which will be tomorrow Tuesday 7 9 from noon to 1:30 council chambers TV members and members of the interdepartmental team will be presenting Cap City council members present to participate any questions. Please direct them to Dimitri and councilmember herbales office. Thank you. I'm also going to be reading the notes for a council member Pacheco as well. Are there are no plus related items or introduction and referral today in or on the calendar a full Council. There are no pleasure in the items on the full Council agenda today and the next plus committee will be Wednesday, July 17th. Thank you before a council member O'Brien gender Equity Estates community America's education committee is scheduled to meet at its regular time this Wednesday, July 10th at 9:30 a.m. He will have three items on our committee agenda the first consideration of an appointment at to the families education preschool and promise Levy oversight committee II will he be here. Refugee Affairs on challenges to citizenship this presentation will focus particularly on increasing difficulties of people who are qualified to do so as a result of some pretty intentional undermining by the federal government in terms of backlogs and fees and other barriers associated with just filing a citizenship application, of course the city of Seattle invest a significant amount of money in know your rights workshops, including providing pro bono legal assistance to those individuals who are seeking to become a u.s. Citizen. So it'll be a particularly relevant conversation to identifying how how we are how there may be some administrative bureaucratic barriers to the complete and full success of that program last we will hear an update on the emphasis Patrol program from various City departments, including the mayor's office. Department of Transportation Department neighborhoods Seattle office of Economic Development and Seattle Parks and Recreation on Wednesday work cited to we are expecting a visit from 10 journalist editors content creators from Belarus as part of a professional program through the through the world affairs Council. They are going to be joining us during Committee just in the audience observing to see how media can be used as a tool to drive Civic activism and engagement as well as to develop an understanding of social issues from a variety of perspectives. So they are really curious about how local government works in the US and they are excited to sit in on my Committee hearing to learn a little bit more. So I think we're giving them a little bit of everything on Wednesdays to really hoping that they enjoy the committee meeting for any of you who want to come out and say hi after committing you're welcome to do so, there will be a translator. Okay. I'm in third. Just wanted to conclude by acknowledging that we all saw that there was two massive earthquakes in Southern California. Luckily. There were no significant injuries or deaths as a result of that earthquakes. I just wanted to take a quick opportunity to remind folks that the city of Seattle is of course the risk of experiencing earthquakes. It is one of the most significant significant events that could face our city and just wanted to reassure folks and remind folks that there are ways to prepare yourself in the event that those emergencies do happen. So if you go to our Seattle office of emergency management at www. Seattle. Govt / emergency - management, you can take a look at all of the different tools available in multiple different languages and for folks with low. Find knees or deaf and hard-of-hearing you can look at a variety of different tools that you can use to get prepared. Our office of emergency management recommends that you plan to be on your own for at least 7 to 10 days. And there is a handy little infographic online that again reminds you what kind of items you should be. You should be pulling together for a total of seven to ten days in the event that an earthquake or other catastrophic geological event occurs. There's also a quick little handy form. You can fill out that allows you to gather all of your emergency information in one place. And of course, we are LED in this work by director bar graph of the office of emergency management. I think if she was here she'd remind us that there are there are an infinite number of plans or what seems like an infinite number of plans that the city of Seattle works on under her leadership to plan for these types of incidents. Again, all of his plans are publicly available and are considered an approved by the city council on a regular basis in order to make sure that those plans are fresh and we in that includes plans at the federal level state-level Regional County and also here also just lastly wanted to remind us that we have made some Investments and not just how not just toolkits to prepare individual people and their families on how to prepare for emergencies at like the one that we just saw in Southern California, but also make investments at the neighborhood level and at the community-based level and so there are organizations for example called Snap Seattle neighborhoods actively prepare that regularly meet at the neighborhood level to help neighborhoods get organized around how to respond in the event of a catastrophic events. So that's that's one organization II is a community emergency hubs. Those are investment fees made over the last Several years to Department of neighborhoods Community emergency has there places where people can gather after it is a disaster to help each other. They really focused on using pea patches with a neighborhoods as those gathering places that are centralized within our neighborhoods and there are currently 135 of this community hubs that are designated throughout the city. There's a super handy widget online at the Seattle office of emergency management website that helps you identify where the Hub is in your neighborhood. And if there isn't a hub in your neighborhood, you can ask to designate the Hub in your neighborhood. So just want to make sure folks have that information both here at the table and for the viewing public and looking forward to making sure the internet's lose the newsletter. We share some of these resources as well as almost at information outstanding presentation. And we will share one down in California. Well, but this I'm really pleased to see the work of word. We've been doing that you've described on a council member Brian. Thank you. And I also appreciate the the highlighting the those hubs. It's amazing to have so many community members that really just come forward on their own to set up the structure to help the neighbor and I'm going to try to figure out how to get the word widget into my presentation today considered to Grant acceptance ordinances. The first is a grant for a few thousand dollars for work in the Delridge neighborhood. It's it's a charitable fundraising that's been done by I believe it's dnda Delridge neighborhood association and they're going to pass those dollars on to the cities. Do some work for some modest Street improvements and then the other Granny's is related to psrc work similar to something. We did a few months ago. This is federal funding that gets passed through I believe the state first and then Puget Sound Regional Council and they're spending cycle fill this round of Grant is coming to an end of the next few months and he said we should cancel Awards grants to of Transportation projects throughout the Four County region. And what often happens is we get towards the end of the cycle if it becomes apparent that the project is not going to be able to go forward in a certain amount of time if we don't spend it as a region that money reverts back to the federal government's we try not to do that and there's a couple projects that we're being delayed and so Seattle had a project that was in the queue and was able to be accelerated. So they're going to shift some money from other projects to a Seattle project. Some seismic retrofitting of the that's the the bridge that goes through a Ravenna Park. I believe it's the Ravenna Park Bridge or something like that. And so it's a great opportunity for us to do some more work were also helping out the region by moving a project up in time to we don't lose that money. And then the other projects will get there money in the future. So we also have two appointments consider one for the sweetened beverage tax to an Advisory Board and one for the urban forestry commission, the sustainable and transportation committee doesn't have any meetings this week. We would normally have our meeting next week, which would be the third Tuesday of the month. But that meeting has been canceled were scheduling a special meeting towards the end of the month, but I'll speak more to that in a couple weeks, Brian. okay, that will conclude our Cast member when I get to do a shout-out to the the Women's World Cup team, they rocked it in that regard. We had a very short discussion before you arrived about sweetened beverage tax and the EDI being in my committee this Wednesday. So we have a proposal that will move forward with a boat and understand that you are not going to be here the following week. So for a final vote on those things we can put it off for another week at this receipt that the 22nd. Okay, we're good to go. Thank you very much colleagues. So we're going to live in executive session. We have actually two executive sessions scheduled at the council will officially convenient executive session. The purpose of our executive session is to discuss potential pending or actual litigation and this gives us an opportunity to discuss confidential legal matters with her legal with our Law Department is authorized by law but illegal monitor from the city attorney's office is always present to make sure we reserve questions of policy for our public open sessions next practice session glass for 1 hour 60 minutes. And so I'll say a 1053 it will end and if it goes beyond that extension, I will announce its extension and the expected duration. So that lets move into executive session.", "end_time": 1121.9}]}