{"format": "raw", "annotations": [], "confidence": 0.9370937464393188, "data": [{"start_time": 0, "text": "Good evening. Everyone. Today is July 2nd, 2019 and the special committee meeting mosquito the chair of the committee and I'm a council member bagshawe council member Pacheco and councilmember Gonzalez. Thank you all for being here. I know that more folks are probably on their way to say thank you to the incredibly full capacity audience that we have upstairs and downstairs the security officers and thank you so much for being here into the evening are they have informed us that there's folks downstairs in the Overflow room as well. So as folks filter out, we're going to bring more folks in if you have given your public testimony and you need to take off or can watch the rest of it from downstairs. We'd encourage supposed to switch out as we try to get more folks coming in the room. I want to say I appreciate you in for everybody that people have full-time jobs plus more. A lot of people are working a day and night. In this industry so we know that there's no optimal time to have a conversation. But thank you for making the attempt to be here this evening and to share your time with us a customer Gonzalez on IR the co-sponsors of this legislation so far and all of the council over the last few years have been engaged on this issue. I think you can't remember still want for doing as well have happy to have you thank you for being here is Spanish interpretation know if you need a Spanish interpretation, and I'm not sure that there's folks downstairs at this is being broadcast to as well. If anybody downstairs in his interpretation, please let us know if anybody needs hearing assistance. We also have the monitors up here Aaron house. Who is our Clarkson I can help you with that and for anybody who needs parking assistance, we do have a discounted rate since it's in the evening recognizing it sometimes But he has different mobility. And for those who needed to drive would you have parking assistance? It's only $5 at Sea Park. And we do have that parking lot that closes at 10 p.m. So we will get those out of here by us know if you need a parking about term. I want to say thank you to the folks who joined us including the interpreters. We have Pablo on stage and Allison Oster. If I'm not mistaken who helped us with the interpretation. They were here last year as we worked on the domestic workers Bill of Rights. Thanks again for being here today. One of my folks know that if you have child care needs we have also made that available for folks at no cost. Just let us know if you're downstairs and you need childcare. Please let us know. If so, let us know if you need any assistance for childcare. A lot of people who are signed up to testify on my checked in with a few folks who helped to organize tryouts for today. We're going to do a minute and a half and I know that's different from the 2-minute normal. I want to give folks a heads up on that because sometimes when I've been in the audience and had 30 seconds cut off it really changes the Set for me, so I want to give folks an early heads up that were going to do a minute and a half for fertility testimony. Oh, I need to slow down. I'm sorry. I do talk fast for the interpretation. I'm going to slow down a little bit. I'm so we're going to do a minute and a half instead of 2 minutes. Thank you council member Gonzalez. I just have a few opening comments. I want to make sure that we are very clear as well about the upcoming process that we've included for Seattle City council's consideration of this legislation. This comes on the heels of us having discussions over the last few months both with industry and with workers talking about the passage of initiative 124 talking about the fact that it passed by 77% of the voters in Seattle and proud to be a voter in the city of Seattle that worked on a legislator that worked support getting that over the ballot that we have to now go back and look at the legislation in front of us. This is disproportionately affecting workers who are people of color women immigrant workers opportunity. To make sure that the will of the voters is carried out and that we also make it implementable workable for the various folks are working in the industry really excited to hear from all the hearts of the public testimony here and I want to see if there's any other council members who have anything else to say before we launched into yes before we get into the public testimony just as a reminder for folks. We have a full schedule in front of us and I'll start at the very beginning on March 21st. We had our overview of the status of initiative 124. There is a memo from Central staff that's been available in the public record and we can make that available for folks here as well as folks are interested on April 4th. We had an opportunity to hear from the hotel workers and their stories about working in the industry on May 2nd. We had a chance to hear from the industry managers and their best practices and some of their thoughts and initiative 124 and the process for moving forward in terms of Malaysian on June 24th, the legislation was referred to the full committee for consideration. And on June 27th. We had the opportunity to have a full discussion in our Committee hearing and that was last week and have a discussion on the legislation today. We're having a public Hearing in the evening to try to accommodate a full room like we see today and we will also have a little discussion about the legislation and issue identification, which is our way of sort of identifying various possible policies and the Amendments that the people may want to flag for the future that will be on July 11th again colleagues. It's next Thursday after that. We're going to have another discussion on July 18th, and then we will not be potentially having a vote until August first edition all week with the opportunity then to come back in August and have a final vote. Probably the second Monday prior to us going on leave for a Recess in August. So just want to get those set up date and let folks know that that information can also be posted on our website. Thank you for the reminder. We have to excuse myself in 1 hour apologize. I have a 6:30 meeting up in the U District and 30 seconds on the clock and we'll get started when we do our best to make sure that we go a handful of Industry panels and then work for handled industry analyst worker and go through the process that weighs. Thank you so much for everybody for being here. And the first person to sign up is and I'm going to call a few so folks can line up. That would be really great from Hilton Austin and Jessica Horton. And just make sure you all come to the microphone really close to this microphone right here and there's two different heights and you're all welcome to line up and there's two microphones in case one wants to take one wants to take the other. Good evening, if you can my name is Dan Van die. I'm the director of sales and marketing for the Hilton Seattle. My first job in the industry was as a sale secretary back in the day when we were still called secretaries. I have been in the industry 35 years and I've worked in a number of different capacities on property at a number of hotels a very Brands and I have also worked in global sales and as a regional director of sales for an ownership management company, we care deeply about our employees their health their welfare and safety. That's why I and my colleagues enthusiastically supported Statewide panic button legislation and provide them to our staff. We were probably not past Statewide. So why is it part of this legislation people and businesses are affected by the rush. Thank you. Thank you very much. And Fallin by Jessica and then Linda Morton Thanks for having me. Stan Austin. I'm on her feeling press on toward the owner of West 5 in West Seattle District Launchpad. Welcome to West Seattle. I understand speaking on behalf of the government Affairs Committee of the West Seattle Chamber of Commerce operated my business in West Seattle coming up on close to five years with a 4.1 year retention rate for my employees. If we were to be here today, so that the wrap-up of the ancillary businesses is my concern. So business is being added in that are not Hotel operated businesses lease space from operate within I don't understand why were adding small businesses that are not in the legislation that was passed with 70-plus percent. We're adding additionally to it. That's a big concern of mine looking at Healthcare expenditure. That would be required from those people $1,680 at $27 an hour on a 20-hour employee that would immediately take my business if I ran those numbers within a hotel. I would go from profitable to negative $38,000 in that year that is not an expense to be taken by small business again. If we talked about panic button has full support support the legislation that was passed previous. I don't understand and have not heard an argument for why small businesses are being brought into this legislation. I look forward to hearing from that. We're having it removed. Welcome, Jessica. Welcome Jessica followed by Linda and then masaba and I really apologize for any mispronunciation. That's my bad. Thank you Jessica. Good evening. My name is Jessica Horton. I'm the director of people support for the Pan Pacific Hotel in South Lake Union as a graduate of Seattle University. I worked in various different Industries in Seattle to include law enforcement Social Service education and Supply Chain management. I've been in Hospitality for the last two years. We care deeply about the Health and Welfare and safety of our Associates as such we provide top tier Health Care coverage to our employees which exceeds the gold level standard offered on the exchange. We cover 89% of the cost of the associate coverage only 80% of the cost for family coverage despite this this piece of legislation requires an additional cash expenditure from information taken from the exchange who's rates are not negotiated. Nor are they accurately depict it at the cost of Gold's level additionally overtime requirements proposed are nonsensical if an employee receives a mandatory workload by a single square foot. We pay overtime for All Hours worked. Tell me one other industry that pays overtime for the entire day's work. I can tell you that from my experience in government non-profit and big big box Supply chains. They certainly do not bypassing this legislation. You work Ripley in the hospitality industry and especially small businesses. Thank you. Following you will be a mesob and then also to people after that stuff on Morse and Jen Jing Jing qiu. Hi, I'm Linda Della Martin and I am co-owner of Terra Plata restaurant. And I served as the president of Seattle restaurant Alliance Alliance support more than 2,700 restaurants in the city of Seattle most of what your small businesses. Over the last several years we've been extremely concerned about the barriers that have been imposed on small businesses in the city of Seattle. I'm here today because this legislation you're discussing isn't just about hotels. It's about small businesses and restaurants like mine. I'm also privileged to serve on mayor durkan small business advisory Council along with you councilmember Mesquita and with all this time spending in this legislation. We've never had this issue brought to our attention for issues or feedback. You know this impact small businesses. You read the legislation that way yet. The decision was made not to seek input from the small business community. The legislation put significant Healthcare expenditure requirements on restaurants and other small businesses far exceeding what's required by the ACA Hotel the expense to the small businesses is up to $1,680 per part time employee. That's quite excessive that means a restaurant or small business will have completely different requirements if they're in a hotel Wetter than an office building across the street. Small business community and stands together with a restaurant community. The restaurant business is very tough business. I can tell you that from experience and it's also a very important parts of the heart of Varsity wrap up for us and we have a cure for written test money at sounds as if you can wrap up first and then we'll take him right away. Basically. I just am asking that the final legislation does not include small businesses and restaurants in the same category as corporate hotels or either small hotels and family hotels in the same category as corporate hotels. We should be encouraging small and immigrant family businesses to thrive not just in this just as the opposite of Grey. Calling you will be Stefan and then I'm Shawn from Romeo Elementary at Waterfront. I've been in this industry for over 15 years work various departments various roles. Most of my time has been spent in the Seattle area has a small hotels large hotels and I don't think I've met any leader in this industry that does not care about their associates. They are an extension of our family. We care deeply for them to come to work every single day to interact with them to be with him. Sometimes we are with our Associates longer than we are with our own family members and our establishment already had panic button someplace very happy that went Statewide, but we need to realize that this is a lot more than just Panic buttons think it's made to be that it is about Panic buttons, but as we've heard today everybody does support Panic buttons, there's no This lot does require arbitrary cash. We are encouraging people to decline Health Care coverage in order to put cash in their pocket, and I don't think that's what it was intended for, and I don't think that's what the voters wanted when they voted, but that is what we are encouraging Associates to do. I think we need to look at the quality of the coverage not just the cost with regards to overtime. I think that we just want to be in line with all other companies all other Industries. We want to make sure that anybody that does work overtime is paid for that overtime, but they were punishing the establishment for the full day, and that's my time. Thank you. Stephan Moritz think and then Shannon Sharon. Good afternoon, council members. I'm not sure if I can get through all of this in the minute-and-a-half and I want to give a shout out to all the folks who worked all day today and are in the Overflow room downstairs watching this hearing on on a screen which you know, unfortunately a little bit symbolic. So good evening. I want to thank you for The work that you have put into this into commitment that you have shown to protecting hotel workers and to implementing and caring for division that voters approved with initiative 124 workers out here tonight to share their experiences and to demand action in 2016 photos for hotel worker stories and they acted voting 77% to approve initiative 124 in the wake of the Christmas Eve Appellate Court decisions leaders at the city heard from workers and you acted and that is just really really appreciated. The four ordinances not being discussed. Keep listening on part of the city did Kerry Ford the key provisions of initiative 124 protections from workplace violence and harassment limits on housekeeping workload expanded access to Affordable Family Health Care and job security to elements of the original initiative of crucial importance and have been preserved in the legislation introduced our coverage of ancillary Hotel businesses and the expectation that workers be able to ask gold level equivalent Healthcare given the Staggering public investment in promoting business travel and tourism in Seattle and the masses crossfit's accruing to the private Equity companies Real Estate Investment Trust and are the owners of Seattle Hotel real estate coverage of ancillary Hotel businesses insurance does public investment go to creating more good jobs and captures more of the profitability of Seattle hotels in the form of benefits for Seattle workers indexing the dollar amount for the required Healthcare expenditure under the legislation to the cost of a gold level plan helps to ensure that workers will be able to afford a quality healthcare plan with a deductible and other Associated costs that are low enough. So that workers will actually be able to get to the doctor when they need to the proposed legislation also respect. But you know, I just have to say that this is the right thing to do and we really appreciate your leadership on this issue. Thank you. For anybody who does have written testimony, we're happy to take the written testimony will make a little packet for all of the council colleagues. And I know Linda you had some written testimony to so I followed by on wink and then Shannon Sharon and adding Braxton Myers. Is he appear? I'm sure when we go ahead with you and then if he an is available, is that is that you again? Welcome. Thank you for being here. Hi, everybody. Can you put a little bit closer to thank you. My name is I will keep this Seattle Hilton Hotel housekeeper. I'm here till I let you guys know that health insurance for our family and me so we have my hotel because we had a union hotel, but my sister's they don't have health insurance is a hotel to so they say I want 24 the Sahel for you still inside. That thing is really good for they are family. So that's why I'm coming here to let you guys know. So they sell I 134 the Lord's willing what time to get passes into Union vulgar or non-union workers. Thank you so much. John followed by Sean will be Shannon Braxton and then Destiny send Okay, add my last name is work I'm so sorry about that I'm trying to work on the owner for Romeo's Pizza has been in Seattle for almost 39 years. I got into it 12 years ago. We are on the ground floor off Homewood Suites answer a business as we say now suddenly, but we were never informed of this. I just found out in a couple days ago when I want to say is I understand all the employees. I have been with me for all these years. So everybody is like family to us you take care of them and I understand they need health care, but we are small business and that means I start 8 in the morning. I'll end up 11 p.m. My kids are now older. I used to see them only when they're sleeping and we tried really hard to work hard. The Proposal here is basically I get it. It's just saying that we need to provide health care. Now. The question becomes is I was doing some math. I have 12 employees and one of my locations at $560. We are paying them $80,000 a year and benefits and at 1680. You're paying them $240,000 a year and I myself don't make that kind of money. So the question really for you is where is this money come from? Where do you think the money comes from? And how do you answer that in 12 years in the city? I have not seen the city has done anything for us small businesses. You guys think that we just become and go but we employ people. I understand if you want to yell for corporate businesses. We understand it's a higher profit for us. It is not and recharge what 12 or $13 for a Falafel sandwich and I'm pretty sure if I charge start charging you $20, you will not come to my place and have that sandwich. So I will wrap up I get back. I just again want to see when this initiative started. You guys said that this was for her safety all the sudden. This is health care and you're asking money from us. How do we come up with all this money? That means we're forced to close all our businesses and you guys are pushing us out of the city. That is not right. Then we are been in part of the city for a long time. We are small businesses and we need to be taken into consideration. So just help us in that sense. Thank you for being here for sure. Shannon followed by Braxton followed by Destiny's son and then Sonia Guevara board member up with the Seattle hotel association. I'm also the managing director for Hotel Sorrento and I started my career as a bus person. It was called a busboy at the time. I've been a food server. I've worked as a host front desk work my way out and I feel very proud about my Ascension and the experience I have and in that experience that comes with understanding what goes into every single category of job because I've done every job with the exception of engineering so that 20 years experience has brought me a little bit of Perspective so in the last 3 years. My perspective is that I have met with everyone sitting at the table with the exception of council persons to Juan I've met with you I've written probably 30 40 50 letters. I have given you my very best and honest and truthful opportunity to really show you and tell you how we work in our industry because through this process we have not sincerely been included. We've been invited to meetings where there was copious notes taken and then when the rules came out there was really no identification or representation for what we needed and the solutions that we really brought forth that were genuine Ernest and helpful. And so as we look at this now this brand new piece of legislation, I just throw the milestones in the markers have once again unequivocally been moved and expanded. I think that this new brief is arbitrary and I think Has requires another genuine sit down where we really care about what we're saying. We work in tandem as a group there is a pathway but that does require that that we understand the implications and impacts of our business and that includes the financial ramifications and care about that because that trickle down that directly correlates to the small business is direct. So I asked you think about small businesses and large businesses as you charge your course. Thank you, Shannon. Braxton followed by Destiny followed by Sonia followed by Rosemary and infoscan try to keep within the minute and 30. I know it's hard and we will have more opportunities for testimony and I apologize in advance for not following the full to so thank you so much for being here Braxton. And sorry to keep you waiting on the family that owns the Quality Inn and Suites down near the Space Needle family that immigrated to the United States put themselves through college and created his own business in New Orleans it as an import-export business for jewelry. Unfortunately Creek Katrina hit and it wiped out all of his stores. He lost everything and when he was waiting for his check from his insurance companies insurance company went bankrupt. He left. He left New Orleans penniless and got a loan from his family to buy a small property in California since then. He's built Business and was able to sell two properties in California including his personal home to buy a hotel in downtown Seattle. I want to make sure everyone on this committee understands that not every hotel in the city is owned by a large corporation. We are not owned by Hilton Hotels. We are a franchisee of Choice Hotels where a family-owned business and we always and forever will be these types of legislations. Do not just affect large multinational corporation. They affect families. They affect family-owned businesses. I take personal offense to the fact that every time it initiative 124 is talked about in the media. It's presented as something to protect employees from their employers. I'm the employer that you're referring to having to protect the employees from I challenge you to come to my hotel and ask any one of my employees whether or not they feel they need to be protected from me as an employer. I can guarantee you they don't I'm very very very passionate about this probably about this situation because at the minute that this bill passes, What's the insurance legislation impact this cost our business and additional $876,000 a year, and if it passes includes inclusive of all the initiatives with 144, it cost us some additional 1.26 million dollars that renders our business in solvent in Bancroft. That's not before depreciation. That's true dollars and sense. This renders our family business that they work for 45 years to be able to a massive amount of money to be able to purchase and operate completely insolvent overnight and thank you. So welcome. Thank you. Just need follow. My destiny is Sonia Rosemary a late. Are they followed by? Oh, I'm so sorry from La Ley 30. I'll, I'll find out and I maybe you can help me. Welcome. Thank you. I'm just a son and I'm the owner of the confectional. I'm here on behalf of the Seattle restaurant Alliance which represents 2700 restaurants. Most of which are small businesses the confectional open in Pike Place Market in 2006 since then we've survived multiple new city laws imposed on his business Community by increasing the cross the cost of our product streamlining our labor and unfortunately cutting hours the legislation you're considering will impact restaurants throughout the City by Simply Having a hotel as a landlord. You're proposing including small businesses in what you're calling the hotel workers legislation. And this doesn't make sense. We all support making sure the hard-working employees and see All are safe from harassment and violence, as you know, the state past panic button requirements for all hotels across Washington and it's great to see that this issue has already been addressed as would take a closer. Look we see it's not just focused on safety, but it extends job retention in healthcare expenditure requirements to Nan has not Hotel employees at small businesses with no relationship to the hotel's core operation. What impacts one restaurant in Seattle impacts us all where Community where Heroes were job creators. I know directly that running a small business, especially a restaurant in Seattle is not easy. I also know many of you say you care about small businesses, and I thank you. Thank you for your time. Thank you so much. So we have Sonya Rosemary. I'm going to try this. I'm really apologizing if a hotel there are two rows. Okay, thank you for reading my mind. Michael Clarke preciate your understanding addiction because we have fought for a long time to get housekeeping is a very difficult job housekeepers are have pain in injuries because we have to do too many rooms in a short amount of time the housekeepers and I did the job if my daughter is so we because I need to work and support my family. We have limits of of rooms. We have we are required to clean because we have a union but all hotels workers need this the same protections housekeeping is also a dangerous job. We have never know if I guess we'll come come back to the room without this law in place for sexual harassment at the hotel companies are taking credit for taking sexual harassment seriously, but they are only doing they're doing it because water has push in the den. We need to keep pushing them to take action and keep their employees safe. Thank you. Thank you very much. Rosemary Alegria Bienvenidos followed by our friend and then Michael Clarke followed by Steve visclosky time for translation as well cuz it's in this in simultaneous. So we'll do three minutes recognizing a minute and 30 is the amount that you're actually speaking Force Obama's at the embassy. When I started cycling one of those days so, you know housekeeper. I'm a housekeeper. I think of a Honda key in Seattle vs. San Jose housekeeper is Ronaldo's trabajos Mas fuertes specifically women housekeepers women doing housework Too Faced Ulta Easton 20 Quattro. Easton Is in December 2016, we had a legislation e154 approved fluidized housekeeper brought us a lot of benefit to us as housekeeper workers and Keith are mosquitoes beneficial. Why is it that through this long? They want to take away all his benefits powerless and unsecured. A muchos riesgos a precisamente a circle is Tali Goya Empanada. There are many risks and through this law. I was feeling very secure and protected. I am personas que quieren quitar beneficios a Una Mujer trabajadora is why there are people who would like to take away the benefits of a woman worker Dia A dia del trabajo Social Security to women who work day today in a place in such a hard job that we do. Contento muchas mujeres que trabajaba en diferentes hoteles work in hotels during this hard work has to ask you. Reindeer nose, please understand this is how we feel as women move or take away this law. Even if even if it's just for a muchas cosas and safety and that allows us to achieve everything that we need as women Hotel Choice a no tener servicio the idea to go into the room so that they wouldn't need to I have daily service. This is all that I want to ask to see which one of you Thank you. Thank you. Gracias Rosa Rosemary Alegria, and I'm so sorry. I'm a nor'easter has hello. My name is Terry Rogero. Call me the chef in the hat that I can remember to remember. I'm the owner of loulay Kitchen & Bar. I've only been putting my business downtown for about five and a half years. I am probably about 69 people and I cannot release the space in the Sheraton Grand which is the extent of my business relation with yotel. I have nothing to do with Hotel housekeeping. And I'm definitely backing up. The need of protecting anyone who's working at any place. So I'm on the board with that one. I'm just trying to understand and I read through the health care requirements and I can understand why you would force my small business to pay up all the way to $1,680 for part-time employee per month. I thought this legislation was a bad Penny button, and I'm completely confused about why we why I'm here tonight in terms of trying to understand what you guys are trying to accomplish here. So it would be very helpful if it could be concisely said that what you're trying to accomplish on now cuz I don't know that I should be involved with this and I certainly don't like it whatsoever. So, thank you very much and get back to work. Thank you. Call Tommy. Good evening. My name is Michael Clarke and the general manager of the Renaissance Seattle Hotel. I also serve on the board of the Seattle hotel association. I've worked in the hospitality industry for 31 years. I started my career as a dishwasher. I've been a boy a bus person a server. I'm worked up all through the ranks until the time. I became a general manager. I worked very hard every day to foster a culture of fairness communication and respect within the hotel. I'm so proud to support the 250 hotel hotel employees that we have at Renaissance Seattle. I think of them as family. I am interested in them both personally and professionally their well-being means more to me than anything that they do in their workday. This legislation is about far more than Panic buttons as we all know the law requires an arbitrary cash expenditure to provide access to Medical Care and how much you spend is not determine the quality of your coverage. I think that's something very important for the council to consider. We should be talking about the type of coverage and not the cost. It's time to pause and get this right. We're happy to pay overtime for hours worked but there's no other industry that pays overtime for the entire day because somebody goes over by 1% We've been talking about hotel employees and that's not what this legislation is now about it's time to pause and get this right. It's far more sweeping than just hotels. We need that you need to understand this small business is at work within the hotels and this is just introduced last Monday. I know you're going on vacation, but we don't want a repeat of what's happening in our court system now it's time to pause and get this right. Should be Steve Steve's Belgrade high C from Hyatt and Then followed by Jessica Houghton Hi. How are you doing? My name is Steven sotsky, and I'm the general manager of the Grand Hyatt and Hyatt Olive 8. I have been a part of the industry for forty years all of it with Hyatt today is my 40th anniversary. The company and you know, I take offense of small business or large. We're all very important to the vital economy of Seattle. And I also take offense to how it has been at least portrayed that we don't care about our employee everything. I stand for everything our company stands for what surrounds our employee we were voted on Business Journal as the fourth best place to work in Seattle that didn't come by itself. That was not an in-house that was an outside service that provided that everything we do is about the employees and this whole initiative started and the vote came through it was about the Panic buttons and from that standpoint, you will find a unanimous approval from the hotel association with the Safety and Security of our employees is of the Paramount. We support the Panic buttons and that has been Echo with the voices you've heard not only that but it goes beyond that and we're talkin about the adjunct businesses. Those are a part of our network of family. We support local Endeavors to make sure that they can give a Flavour of Seattle. Please please take a look at this because we're making way to rush decision. We have to sit down understand what it is. It's affecting small and large businesses. It's about the thank you Steve. Next we have notary sandras followed by Lula hill by Jessica Holton and Jeremy Aden. We have folks that have come from downstairs or waiting for potentially. Go ahead and take any microphone you prefer. Go ahead. OK. Hi. My name is Lola highly. I am from a star employee of Edgewater Hotel housekeeping Department. I talked I asking for this panic button about what are all housekeeping we need but I know you guys all of them they talking about the money about what how they would offer us more business something. What about us? We just have to to we doing good job. We need safety. We don't do something to make them suffer or something to make them. Are we doing good job more and more guests coming more money with limited by the time this is thinking about as to Not only about yourself. I understand the business maybe the money equals a lot of understanding. What about us? You'll be human being we are human to We Are woman we need protection this 24. We need to speak to Hunter 216, and they said okay, but still you guys fighting for us not to give us some of you summary to give us by Machine. We don't even hear us nobody. So I need we need it. So please you listen to us and don't fight it as you guys please. We still human being even though we are immigrants here. We deserve at this point for thank you. Thank you. Next we have Jessica Horton Follow by Jeremy Aden followed by Ricardo. And then Mack McGrath the diamonds pronounce that sorry folks. Let me start this again. Okay. I'm going to go past Jessica Jeremy Aden. No, Jeremy, Jeremy great. Thank you and see you back there welcome. I'd like to thank the council for their I'd like to thank the council for their hard work on this issue. My name is Jeremy Oden. I'm speaking on behalf of iatse local 15 local 15 stands with our brothers and sisters in the hospitality industry and their fight for basic protections such as anti-harassment measures safe workloads and Healthcare. We believe that it's reprehensible that the multi-billion-dollar hotel chains believe that their workers the people who make it possible for their hotel. Steven exist aren't worth Hellcat Healthcare and human working conditions. These employers can easily afford to give these protections to their workers. They're pinching pennies at the expense of the hard-working people that make the magic happen. See knows a lot about making the magic happen. So we stand in solidarity with our brothers and sisters represented and unrepresented and thank you for your time. Ricardo hi. Hi, good afternoon. My name is Ricardo Ortega member of a community organization called the legacy of a quality leadership and organizational morale organization of people of color and women were fighting to improve the working and living conditions in our community to work in the hotels are facing violence harassment Scandal and more than half will not report because they are fear of retaliation not being believed and also this workers need our support. Of the city or Community. Also we have the power and you have the part where on the political and moral responsibility to stop the hotel industry to continues to accommodate sexual harassment ambulance from the gates hotel at the expenses of the other workers. Just like his Legend has proposed to send a strong message to the stove to the hotel's to shoot trust that workers and window tell case has a perfectly balanced a connection band against to the person who cannot return to the hotel for appear the five years because of Health Care is one of the main reasons of the Bracken see in this country. This legislation is an important because he's providing a child care access Rotel workers and their families. Also, it's simplified Administration Hospital tell employers and solidify the law against legal challenges from the hotel industry while upholding intent of the original initiative also, I'd like to thank you everybody who is here? Because this is an issue important for our community. Which are two to resole your tell water the serve. No just respect but also our solidarity in their 5 for better working and living conditions. Mac Mac McGrath followed by Hong Zhang followed by Brianna Fox and Yoshi takaba Honorable council members. My name is Mac Makara. I work at the Embassy Suites in Pioneer Square and a local 8 member and I wish to speak in favor of the hotel worker safety ordinances regulations that side with the worker in cases of sexual harassment and assault from guests are especially important for members of the marginalized communities. Such as immigrants are LGBT workers because we've had additional barriers to reporting such incidents such as fear of retaliation or not being believed. These were the fears of my coworker Lewis when he was harassed by Gaston the breakfast restaurant where we work the guests crude comments and gestures were Witness by a second co-worker and went to stressing to all three of us. We went with him to HR to report the incident, but when the offender reappeared a month later, we realized the management could not be trusted to do the right thing on their own volition Lewis considered calling out sick or leaving work early to avoid seeing the gas despite. Money for his upcoming wedding. He was incredibly distressed and it's his friend. I was angry that the hotels in action had put him in this position instead. We persisted demonstrating that we knew our rights under the law and we demanded that the guest be banned in the process. We learned that the offender's husband was a highly valued value Diamond member, and it was clear. Why management were dragging their I see they will always side with high-ranking guests over us, but because of i-124 it we have started our rights, and we got the gas removed and banned from the hotel having him removed and knowing he couldn't come back made us all feel empowered and safer Louis. Most of all since before work and a public area. We constantly be reassigned to another floor to to avoid specific. Guess the only way for us to feel safe with that have been banned from returning. Thank you. Welcome. Hong Xing welcome a good evening. My name is Hometown. I'm a housekeeper in the DoubleTree hotel by Chicago airport. I have been working there at housekeeper for 5 years already. I didn't my hotel that broke his idea hotel. And now we have the yoga Health Plan my three kids and my husband and there are five of us are covered under my very important and very helpful for my family. So my family my husband flexible work and the both of us can look after our tornado keys. So we don't have a little brother to listen community and then we are more independent. So it is for all of us so we can all right. All right respect for this country. Add they compensated for their work hard. So that might be is John our help Unite Here Health Plan is it is very important to call. It is very important and I are probably the rest of the apartment and the physical is free for the ductable and the insurance that pays 90% I mean, this is a perfect 2 Health Plan health plan. Thank you. Thank you very much. Rihanna followed by Jeremy My name is Brianna Fox. I'm the HR Director for BMI Hospitality management. We work with three Seattle hotels in one restaurant collectively. We employ over 200 people in the city of Seattle. One of the most one of the items that I'm most concerned by these proposed bills is the minimum required expenditure for medical care that employers would be required to pay. I do not believe that the numbers outlined them. This bill accurately represent actual cost for an employer to provide affordable high-quality coverage to their employees. We absolutely want created a safe working environment for employees. We absolutely want to provide affordable high-quality health care for our employees. I don't believe that this the the cost outlined in this bill would achieve that I think I would put undue hardship on the employer to provide cost at this coverage. We currently provide 100% employer paid gold-level coverage to all of our employees here in Seattle. The employer pays nothing out-of-pocket for the monthly Premium cost and were able to do that at a cost of $427 per month per employee. It's clear that the amounts listed in this building not accurately represent what it cost for an employer to provide high-quality Health Care coverage to their employees. This council's claiming that the proposed legislation is to provide affordable medical coverage for Seattle employees and their families and safer work environment. I think if that were true the union would not be exempt from these on these bills Yoshi you will be followed by a Jeremiah follow up to I think just left if they are up next if anybody wants to grab them. Thank you. Cancel member bags of her being here and thank you for being here Yoshi me Wonder Years now. I've been in housekeeping. I love housekeeping job. It's passionate passion for me. I want to make my employees happy and I take pride in being fair to my employees. It's I'm sure everyone agrees. We provide number of checkout number of double beds small details, but we want to be fair to everyone and this initiative right now is proposing that what Loom it hasn't been clean for 24 hours, industry in his room because the previous guests put a do not disturb sign or the housekeeper Susie didn't want to go clean 5 minutes later. Then we get penalized by that and that's just not fair. Because do you guys tell McDonald's to how to make Big Max? There's no slow on that one, right? So, why doesn't he be patient things through and just let us know how we can help you guys. We are here just make sure employees a safe and happy at work. Thank you. Thank you. Next we have Jeremiah followed by Lisa Cruz and then Seattle raging grannies and following Kimberly spice. A good evening council members. My name is Jeremiah. I've worked in the restaurant Banquets in hotel industry for fifteen years now and I'll tell you it's hard to find a full-time good paying jobs that offer benefits at times that I for part-time jobs is for my family. I've been a restaurant server banquet server bartender banquet bartender room service worker banquet captain and supervisor and the Edgewater Hotel. I've been there 13 years. It's been about three years that I am able to get enough hours for it to be my only job the Edgewater offers medical benefits. If its employees work 80 hours in a month and good years. I've been able to maintain my insurance all year this threshold but this past year or even maintaining 80 hours average has been impossible. They were to three months this year where I lost my insurance. This is my story as an employee with 13 years seniority Eddie Union hotel. Where are banquet and restaurant servers in Seattle for dog lean on Union hotel Market supposed to get health insurance. We can work 60 hours all across town in a week and still not have any access. What are benefits that is why it is so important Health Care access be made available to employees work 80 hours or more per month and that workers at ancillary Hotel businesses are covered as well. If the council were to make Threshold at 32 hours a week to qualify for health insurance that would disqualify a vast majority of workers who work the same number of hours that I do. We cannot forget that hoe hotels can and to distribute shift strategically to keep people from eating the threshold of Healthcare in addition, excluding. Ancillary Hotel businesses from the healthcare requirement would provide another incentive for hotels Outsource their Banquets in restaurant operations. It's only hurt workers and deny even more was access to affordable health insurance when drafting the final version of these laws do not forget about us banquet and restaurant workers deserve dignity and respect for the profits. We deliver Hotel owners to Jeremiah. Alisa Cruise housekeeping I I got a pain for my white guys. So so if we get that Thank you. Thank you very much Lisa. Do we have Seattle raging grannies? I think we would see them if they were in the audience. They may have left while we take a quick pause to see if they're here or coming up to let folks downstairs know we may have seeds appear. If you do want to come on up and we have some spots. So following Kimberly spice and I am the owner of biscuit bitch. I have owned and operated. This might be a first for Seattle channel to hear this language you I found it operated my business in Seattle for 9 years now and I have three locations downtown and 52 employees now and I lease a space in the Belltown Inn and business relationship with the hotel. I have nothing to do with Hotel housekeeping and I don't understand the reason ancillary businesses are included in this legislation. Now, I do believe in taking care of my employees and I believe in protections for the housekeeper's I fully supported the minimum wage law. I believe everyone has a right to health insurance. I stand for the housekeepers and the hotel workers and I want them to have their protections and their health care, but I can't understand why my small business is being brought into this. I currently pay 75% of the cost of health care for my staff and that is only $470 a month for an excellent Kaiser gold plan with dental and vision to all employees working 20 or more hours per week. I'm at I have a 3% retirement plan match the profit sharing bonuses. I share all the profit over the summer. We're closed between Christmas and New Years and everybody gets a paid vacation. In order to be to be fair to all 52 of my employees. I would have to pay that hire cost for everyone which would force me to take away some of the other benefits that I offer that I mean, we have a two-and-a-half-year retention rate right now. I have very happy employees. So and I really don't want to do that. So that would force me to have to vacate my lease at Belltown Inn. So what I'm here today to ask you is to please rewrite this legislation to take the non Hotel employees and small businesses like mine out of it. Thank you very much. Next we have Brandy Mitchell followed by Solano him followed by Ernie Burton. I'm sorry again about the pronunciation. I feel like George W bush a little bit up here when I keep doing this. So Brandy thank you for did I get your name? Right. My name is Brandy Mitchell. I'm area manager of IHG properties in Seattle. We agree with Hotel employees need to be safe. They need to be protected. So we don't disagree with that at all. We have processes and procedures and trains to help our staff avoid injuries that was part in the and then what station is injury does occur to a team member we take that very seriously. We want them to report it. We want them to go to the hospital and be looked at. And there's an existing system to cover those situations. They're covered by our workmen compensation claims that's in addition to the health care. We already provide to our staff. The legislation requires overtime for All Hours worked even if the employee exceeds the mandatory minimum workload by one square foot. We are happy to pay overtime. But this is Extreme for our businesses and causes a lot of unnecessary. Track record keeping for the staff and what not, and we just want you to be thoughtful in this process for everyone the employees the business has the small businesses. Thank you. Juliano Ernie followed by Brian it looks like maybe a group Brian Sheila and a team from Mediterranean in hi. My name is Delia know I work at Embassy Suites Hotel downtown. I came in America two years ago and they have realized that not enough to mention everything that's happening on the hotel business is as we talkin. I'm having 5 days off this week and four of them last week. I pay crazy expensive medical plan such as for the last year a hundred $56 per paycheck 312 per month, which means 3754 per year this year. I change to achieve 4111 free paycheck. 222 a month. 2664. So I can save like $1,000 this year. Which I will probably use for my rent which is increased twice so far and now it's going to be 1200 per month my total medical expenses last year without including the medicines are drugs were like $5,300. I even had a paycheck with me from last year, which is $73. $73 from my full-time job. I am one of the full-timers that at Embassy Suites who needs to work on other departments serve a breakfast attendant evening reception dishwasher Maps sleep and deep clean. Just get some hours whenever it's 12. I have a second job, which I do and this information so I have with me including the bills can be verified, and they really need to change. I don't have any wife and kids so I can get benefits from them, but that doesn't mean that they don't have a family back home. So as I said before to see how do I need to control on jobs and Renee special in the hotel's? Thank you. Ernie Burton followed by the group from Mediterranean and then George Crum my name is there any birds in and I work at the Edgewater Hotel part-time and I help support the union members around town for all what they do and what they doing in the hotel industry, and I'm turning it over to Jose. Thank you Arnie, and I'm here. I'm standing what about on the way to the Northwest immigrant rights project? And we just wanted to express their support for the legislation and here in solidarity with her knee many of our clients are people who survived domestic violence sexual assault and other crimes, and we've had a number of clients who have experienced sexual harassment and sexual assault in their workplace. So we want to appreciate the work of council has done in in this issue and support the legislation along with her to hear. Thank you. If the group The Mediterranean and has here you need a minute. Okay. Thanks for being here has been the same here. But I'm sorry. George chronic. I'm the general manager at the hotel 1000 come up through the business obviously and you know, we continue to talk about employees safety which obviously is crucially important to everyone of us. I stand in front of my group of employees on a daily basis and I'll talk through making sure that they're closing doors behind them making sure they have everything they need to be successful in their daily job, but you know the obviously we want to provide Healthcare Healthcare that's being proposed a dollar amount is Exceeds what is necessary to get qualified health insurance? Of course, we want to make sure they have qualified health insurance something they can all off or I'm going to weigh continue to talk about the overtime the overtime and all for one portion over that square footage is just it's a nod to pay a full day's over time is is something that we just and I was just too much. We really need to look at. You know, how are impacting and we talked about small business. We talk about hotels. We really need to look and make sure that we're doing the right thing for for all parties. Thank you. Thank you very much. After the Mediterranean and we will be hearing from Nicole Keenan and Tobias girl girl and then gym Gregerson. So where the Mediterranean and the beltonian I thought if we were group we might have spent a little longer since we took 30 seconds off. The original time will take a full minute off the group time. So you have 4 minutes. Okay. Thank you very much. And we're not just representing the belts and then we're also the arm of the Mediterranean in but also the belt on the in which Kim is our tenets at and will not be if this legislation passes as is my started this industry in the 90s. My started as a night clerk 24 hour or overnight graveyard. I work day shift at work evening shift. I cleaned hundreds rooms. I've done hundreds of hours of Maintenance every single member on my team started as an entry-level employee. It's one of the few meritocracies left and you guys have it on a bull's-eye for some reason. It's inexplicable. I'm deeply personally offended at the attitude. You think we have towards our team and I've invited each of you individually except for Miss want to come by the property in either property and And they want get a full tour see how business Works talk to employees and educate yourselves. We have never been invited to meaningfully participate in this legislation and you're on an Express train run with it. Also tells our small family-owned hotels that have already taken to $300,000 a year additional expenses with some of the legislation you guys have asked without consulting Us in any meaningful way what you're talking about now is another 500 600 thousand a year 1618 is not even remotely realistic what it costs to provide decent quality insurance, but you don't seem interested in that at any rate this small family-owned businesses like ours and by the way, we've each these families of only since they build them from the ground-up they don't sell them to reach the family-owned businesses like ours will disappear and you'll be left with what you want. No small business has no family owned businesses in the city limits. We certainly won't have coffee shops and restaurants and things like that in any hotel if you pass and those who pay the rent and their mortgage and take care of their families on these jobs won't have them. Every person in our team has an opportunity in our businesses. It's grossly unfair happening much too quick and happening without any meaningful input from the real stakeholders and I still extend that invitation if any of you want to educate yourselves on what goes on in real life these properties are we had panic buttons, by the way, I put them in an 99 or 2003 get a great L&I rate because we are so accident-free we take care of our people. We don't have the contempt for him that you guys seem to think we have and it's really sad. Nicole Keenan Michael Keenan followed by Tobias girl followed by Jim Gregerson and then Amanda Parsons to have more than one person speak if you're coming up as a group Nicole and then we'll go through chayim. Hi. My name is Nicole. Allosteric Eden lion, the executive director of Puget Sound Sage one of the things I want to name as I come from for generations of women of color small business owners, and on top of that I spent the better part of the last 10 years either passing labor standards or supporting and forcing them. One of the things that I noticed when I was doing a lot of labor standards enforcement was that one of the common traits and dissonances between employees and the people who pay their paychecks at times are an assumption about the relationship a lot of times. I hear a lot of bosses. Say more like family for family and I hear workers say I'm so afraid of them that I don't know how How to approach this because they think we're like family and if you come from any kind of family, you know that families often have boundaries that are unclear. There's a lot of times when maybe families are abusive, so just don't think that that's a really great metaphor to talk about what it means to have an employer-employee relationship. I am the boss of 15 people. I would never call them family, but I respect their rights deeply do I do that by following labor law by encouraging the passage of labor law and supporting workers and every way that I can this was vital for the protection of particular workers who are subject to sexual harassment and sexual assault is so very rare. There's a false accusation accusation. So statistically rare that there's a false accusation. So anytime a woman comes forward we have to believe them. Thank you. Thank you for waiting and then Jim bergerson Amanda Parsons followed by Dustin lambrou and Nathan Russell. My pleasure. Thank you for having me here today. I'm Tobias girl. I'm the economic program coordinator for lgbtq. Allyship lgbtq + economic Justice organization representing over 3,700 community members here in the Puget Sound area in 2016. We worked hard to pass initiative 124 because hotel workers rights are lgbtq people's rights were more likely to work in service industry and we're more likely to experience the kind of harassment and discrimination that this law is intending to combat. Additionally we speak we work closely with the workers. We hear their complaints and we hear their lack of Education around there right this very same managers who are talking about their workers as their family often neglect to inform them that nice things like Panic buttons only appear when laws are passed. They do not inform them that they are legally mandated. So we cannot urge strongly enough that OLS enforcement be a part of this law. It has been more than proven necessary. We are the members of the housing Health Energy and workers rights committee and the city council has a hole to stand with hotel workers and support this legislation and its entirety along with any necessary amendments brought forward by committee chair by scada. We thank you all for your time. And that concludes my speech on behalf of the real stakeholders. Thank you very much. Welcome, Jim by Jim is going to be Amanda Dustin and then Nathan. My name is Jim Gregson. I'm an insurance broker for Parker Smith and feek. We work closely with our clients Hotel clients. We sit down behind the closed doors and we had the conversations about what we feel and what they feel is best for their employees are very competitive business finding talent in this market is very difficult and it's been a lot of time and energy trying to do what's best for their employees. I can see that from personal experience. I know exactly how they think because I've sat down again behind the closed doors. I think there's a lot of concern about the of the focus of the the employers. I'd also say that the way the pricing is structured is is is not reflective of how Insurance pricing really works having a flat dollar amount is in fact, probably the worst way to buy insurance. The appropriate way is to find the right level of coverage affordable looking for affordability looking for quality of coverage and matching that with what employees needs. So I would very much encourage you to sit down with some folks in the insurance business figure out insurance prices are created and then of course determine if there's fairness and all this, thank you. Good evening. My name is Amanda Parsons. I'm the general manager of the Thompson Seattle Everett in the hospitality industry for over 20 years and I started my career as many people have today. I'm as a server in a family-owned restaurant and I've committed my career to this industry in a variety of roles in my experience. This legislation will bring additional unintended consequences. This is being rushed. This industry is unique because of its interdependence. There is no one department or discipline that can survive without the others everything we do day-in day-out is as a team. There is no doubt that we care about our employees. We work together every single day. We have relationships with each other. We celebrate our successes and life's Milestones. I sleep with my phone next to the bed and answer it at all hours. I'm available to my team for any reason our focus on Stacey's all team members is because we care not because we have to this is why we've already established anti-harassment policy that are hotels support safety committee meetings and Training and conduct annual Hotel wise safety training regularly. We supposed to support of the passage of Statewide panic button requirements and are proud to provide them to each of our team members how much you spend on insurance does not determine the quality of the coverage we should be talking about the type of coverage not the cost their long-term impacts of this legislation that would caught that impact all Industries and this has not been explored enough. This is rushed. This is essentially like telling you use a car salesman how much you have to spend before they show you their cars. Please take the time to learn more and understand that impacts. We need that. Thank you Amanda. I'm following you by Jeremih and Mac MacArthur and members of the community. I'm here on behalf of Teamsters Local 117, and I was also just elected president of the Martin Luther King County labor Council. Thank you. This legislation is not rushed this we've had three years over three years to think about this legislation. I was I was a voter in 2016. I got my voters pamphlet statement and the legislation initiative 124 said more than just Panic buttons. This is not rushed. This is been thoughtful. I know the hotel industry did not chose not to fight this 3 years ago because they knew the polling was really bad. And so now you're trying to end then you sued sued for 3 years and now you're trying to encourage Council not to pass this legislation. This is important that room downstairs is full of women and people of color who work in your hotels and I just strongly encourage you all managers from the hotel's to think about Optics and And I understand the last meritocracy, but maybe have some women and people of color promoted to management. Thank you. Nathan all right. I was going to save it for the end. But I appreciate how folks have been respectful to let people have their minute-and-a-half. We're going to continue to go through I am fine with the plaza or we're going to keep this in a respectful Manner and others WhatsApp that has been said that other people don't agree with I appreciate the Flies, but we're not going to engage in Boots. Okay, so we are going to continue and that is Nathan Ronald followed by Jeremih and then Mac. Okay, my name is Nathan rodkey from Washington. Can I want to thank you guys for having me here today? This country is way behind on Healthcare. I'm here to talk about Healthcare. We're way behind as a country. It's it's really unconscionable ization stance on the belief that Healthcare is a human right actually want to thank those of you who showed up that are leading on that that are providing like gold level insurance for employees. Like that's really cool. That's a good thing. You guys should feel really good about that and I appreciate that you guys have done that. However, we wouldn't be here today of restaurant employees and hotel employees were have it where all had great health insurance. They clearly don't that's why we're that's one of the reasons that pieces in that legislation. So I really want people to examine that as you engage as you engage with one another to make sure that we are all collectively leading on this and I want to applaud folks the city council the workers and the employees in in solidarity with them because I hear the word dignity by being thrown around here and I appreciate everybody who's saying that in earnest. Do respect the Dignity of workers, especially when it comes to Hell. Nobody should be making any sorts of decisions for medical care with the fear of the bill in mine. So again that if you guys are serious about leading on Healthcare, make sure that you could present something where you're able where all of you are able to provide go leveling coverage for your employees. Thanks everybody. Alright. Thank you. One more reminder. We have Jeremiah has followed by Katy gyro and as folks are potentially making their way up from downstairs for everybody. I had to direct your comments to a city council members and that's something we've done in the past and I just want to make sure everybody knows we're here to receive those comments council members to want and just let me do one more reminder to self store coming up. We're looking for Jeremiah cell. A a Mac mcgarth McGrath Katie gyro followed by Christy Smith. I believe German Mac have already spoken. Oh, I'm sorry. Thank you for Telling me if that's the case. We will move on to Katy gyro followed by Christie Smith Leah larvar and Michael. Beyond I'm going to say those again if Jeremiah Katie Daryl Christie Smith Leah lover and Michael Boone. Hi Michael, I recognize you why don't you come on up and then we'll as folks make their way and we'll get them to the microphone. Thank you so much for a referral service where a civil rights and social justice organization that reaches over 35,000 pokes each year. I'm here tonight to ask Council to provide safety from harassment and harmful are hotel workers and to ensure that they have access to medical care that you and I enjoy majority of non-management hotel workers. Like housekeepers are immigrants about 56% and are the main support their family 80% are women. The 2012 IMF Chief Dominique strauss-kahn case of alleged attack on an immigrant housekeeper is one clear example and a reminder of why the legislation as a currently proposed send a strong message to hotels should trust workers and when are Hotel guests have perpetrated violence take action to ban. Person. In the area of healthcare access hotel workers face a daunting choice of paying the exorbitant premium for employee base pans and Out Of Reach deductibles versus food for their family and housing in many instances hotel workers are needing to cover 40% of their medical costs. They can't afford so they are not enroll or they make a difficult choice of who in their family should go with or without coverage. These aren't the decisions that we want hard working people to me. We are urged this member of committee here to vote in support of this in this legislation. Thank you. Thank you very much. Hi good evening councilmembers. Thank you for the opportunity to address you. And my name is Katie Guerra on the deputy executive director of MLK labor this weekend while talking to my mom about her General hopelessness under President Trump. She asked me what kept me from feeling totally defeated. I told her that I focus my in my intentions and efforts. Holy unlocal efforts on the same night that the United States of America elected or rapist Hotel Mogul. Seattle voters passed initiative 124 a policy that protects mostly immigrant women of color from sexual harassment on the job these efforts locally tell the story of the best of who we are due to the hotel associations Deep Pockets. They have successfully blocked the will of the voters using the court system, but workers have never depended on any Court to decide Our Fate and we aren't about to now I want to say thank you to the Seattle City council. Give me I want to say thank you to the Seattle City council for finding a window when the door was closed. I've heard a lot of concerns about the ways that this initiative believes women who report sexual harassment due process for the accused they say What does a person with no shoes on get a right to due process when a restaurant removes them for being barefoot? No, private establishments kick people out all the time, and this legislation gives the accused guess the right to notice an investigation and an appeal for white liberals in particular who are horrified by Donald Trump's racist Behavior towards immigrants and people of color supporting this legislation is one of the best ways that we can show allyship. Thank you. Hi, welcome and it's folks. Do you want to leave written comments? We will definitely take those. Hi, I'm real of our I have been a Hospitality for 23 years. My first job was at a very small hotel where I had many jobs does a front desk agent housekeeping when housekeeping went home engineering when they went home about to work for several years and housekeeping and laundry and then ultimately moved into HR in Hospitality for they never supported the harassment and mistreatment of anyone with practices in place to deal with that. I do think there's pieces of this legislation this part of the legislation that we need to look at and how we implemented. I want to talk about the medical registration on illustrate what I foresee in my experience in HR as an on an unintended consequence of the of the law on the intent of the last to provide quality health coverage at an affordable. Putting a set dollar amount on the coverage in my opinion takes away our ability on the HR employer side to negotiate a plan that works for our team's games. We know what else and we know whose child has autism. We know who's fighting cancer and we are able to work with a broker who doesn't know how much we have to spend on the plan to negotiate a plan that works for what are teens need taking that away and prescribing an amount is essentially telling them what they can charge us for the bare minimum plan without being able to personalize it for our team. Thank you. If you had more to say and we didn't get to it, feel free to leave a written comments with us as well as Chrissy Smith. I just want to make one last call to see if Christie's here from Crowne Plaza. Okay moving on Lori. Rosello Torres. Hi welcome. Thanks for having me councilmembers. My name is Lori was sell you a Taurus. I'm a member of McKenzie Seattle an organization that serves migrant Filipino workers and their families. I'm also the language access organizer for API Chaya as an organization that serves survivors of domestic violence sexual assault and human trafficking a Phi a wholeheartedly supports the reinstatement of initiative 1240 is necessary in preventing workplace violence against workers as well as ensuring health workers can be healthy able to keep their jobs and continue to be able to provide for their families. We decry the law to strike down this law in an attempt to avoid taking responsibility. I'd like to remind them and you that without workers some who are separated a long way from their families to guess every day in day out ensuring that the establishment is clean. No profits for the owners are the reason that the hospitality business and all businesses in our world-class City thrives the impact of the physical labor. They perform and the customer service emotional labor everyday results in the need for healthcare. Then sure that their bodies can continue to keep their jobs and provide for their families keep the hotels run. This is about creating the conditions for workers to be able to do their jobs and keep their livelihoods. All workers is of healthcare and safety, especially migrant workers, and we hope you stand by the just decision to reinstate this policy. Thank you. The next the next four people that we have our Victoria Brooks Stan Katie Henderson and Angela Sherburne if there is a I'm getting to the last this year. So there's other folks who got inspired to testify we're going to keep the sign-in sheet up there. But again, Victoria Brooks, are you here? Hey, thank you for trying followed by Victoria is Stan and apology stand for your last name that I'm sure I pronounced incorrectly. Hi, Victoria Fortune to work at loulay, which is an independent restaurant attached to the Sheraton. What I'm seeing here is that there are two separate issues that are being piled together hotel workers absolutely deserve to be safe. I don't think that should be a question. What is happening though? Is that a business that is merely by virtue of somebody is being In detriment actually, so we're having to put that kind of a position on the business what will happen is that the business will fail and so if you have that happening you're going to have unemployed people and all of these people that were talking about are all human. The hotel workers are human and the independent and independent businesses and their employees are human too, and we all deserve to be safe and working. That's all. Thank you very much. Followed by Katy Henderson followed by Angelita Sherburne followed by Michael Hirsch. Hi. My name is Stan shikuma. I am a member of the Seattle chapter of the Japanese-American Citizens League and also a member of the Asian Pacific American labor Alliance. I come here to support login statement of I 124 I believe. I grew up on a farm and what this really brings back to me as some of the in the 60s my parents owned a small farm and the United Farm Workers. We're trying to organize the valley and the farmers The Growers were very afraid of what was going to happen and fought against it quite a bit The Farm Workers Union wanted higher wages and when it better conditions, they wanted more safety. And The Growers were afraid and not ready to to deal with that. Eventually Union contracts were signed and the sky did not fall. The farmers did not lose their businesses and the workers got better conditions, even the ones that were non-unionized got better conditions. I think we need to look at the people on the bottom and what they need and what they deserve and I support reinstatement of I'd 124. Thank you. Welcome. Hello. I'm kidding Henderson and I work at MLK labor and I like to share with you my experience working as a housekeeper housekeeper a person not a dollar sign amount of effort required. I barely passed muster working. There was nowhere near commensurate with the pay it some other women. I work with Justified the heartbreaking Lilo pay because they had benefits. I didn't have the heart to tell them that the hotel / high-end gym locker room attendant made more than lated. I have work in 5 different warehouses. I have operated ski lifts in the harshest of conditions. It's cleaning hotel rooms with the hardest job. I have ever had. Are we still over worse and exhausted that my sleep schedule my schedule was brick shower sleep repeat my feet were so swollen that it hurts to walk. I clean hotel rooms in my box and make sure my manager did not notice where I worked room assignments were by floor. We were understaffed and the few co-workers I did have were spread out across the hotel when you think about it. Now I ask myself should someone have assaulted me who would have heard me cry for help. Mini housekeeping employees are immigrants you struggle with English the independent nature of housekeeping helps them obtain appointment one co-worker from Hong Kong asked me and broken English because hard work. Why do you work here for such little pay? The only reason I work here is because I can't speak English. I lived in the US for two years before I found a job. I'm one final issue that I need to address despite my time being up is that there's a problem with a suicides actually a lot of people commit suicide in hotel rooms. And that something I was very grateful that I did not have to encounter, but it does happen and for that reason Panic buttons are very important. Thank you. No, you had written testimony. We're happy to take that as well and share it with the rest of the council. If you'd like to leave that Angelita Sherburne followed by Michael Hirst followed by I will be this in a moment as we are getting the other testimony and maybe my colleagues can help me D appears to be the first initial. Okay, do we have Angelita? Hi, my name is Angelica Schuyler born. I'm I am a union leader from SEIU 1199 Northwest and 25 years in housekeeping job, and I'm a UPS worker at Swedish Providence Cherry Hill Campus. I am here to stand in solidarity with the hotel workers of Chateau because I know what it is like to get injured on the job. When you have to use your body repeatedly live heavily lean and pushing heavy carts and most importantly have too much work load. Your body is always at risk of injury. Recently, I had to clean 21 rooms passport discharges and then common areas plus hallways to map in 8 hours. I was really exhausted but I really wanted to finish my job before the end of the day at the end of my shift. I had my last discharge to clean. I pulled out the heavy linen from the hamper, which is a normal duty of my job. But this time I twisted my wrist and my ligaments swollen my family was worried for me because I am the bread winner of the family if I cannot work the worry is that I may not be able to support my family in the Philippines and too little could you wrap up for us just because of the time thank you. Ok, feel free. Public testimony as well. And if you have one more sentence, we're happy to tell you that you can take $0.01 to wrap up. I guess having a small words here. I ordered to the member of the housing Health Energy and workers rights committee and the city council that supposed to stand with hotel workers and support the legislation unit in entirely. So. No family should have to suffer and certainly about where the next paycheck is coming when we get hurt at work. Okay. Thank you so much. Michael Michael Hirsch And then the rest lie directly. Sorry. Is there anybody else who has signed at Vici one more person sign up on that sheet there and maybe somebody's making their way to the microphone cuz they think I said their name are there anybody who has just said anybody who has signed up and then we will have Sonia Guevara and Ilona Keener Sonia. Cherry testified hi. Thanks for waiting. And I just walked up to sign up anyway, so, my name is Alona can hear well, I don't have any experience in the hotel industry. I do have some experience in food, but I want to say is that people there are good work good actors in the hotel Community, but that doesn't cover everyone. It's a false equivalence equivalency to say that if I do something good. Everyone's going to do something good. The only way that we can get actual concrete guaranteed benefits is through laws, which is why this is important while there may be some things wrong with like saying a set dollar amount. We should have a set coverage that employees employers need to give their employees at so thank you so much for putting this on the table before giving people the opportunity to speak. Thank you. Thank you. So I apologize if I've missed pronounce your name, if you have signed up and you're waiting to testify Now's the Time to line up at the microphone. We have gotten to the end of our 10 pages of public testimony High you want to okay wonderful just introduce yourself for the record and then we'll get you all signed up profound experience to be in this room tonight and Akira so many hotel workers somebody Hotel managers and owners and folks in the industry declaring their unequivocal support for panic buttons, and I just want to recognize all of the organizing work and all of the women who spoken out about their experience over the last three years in and have come forward and and how about to push the industry and gotten us to where we are today? And so I really want to recognize that and recognized by their bravery and what they've done over the last three years to get us where we are today also say that we can do better and we need to do better. I think the legislation that's before you is is going to be an important half way for us to do that and make sure that women can go to work and feel safe and be protected and I did want to offer a just a few suggestions on the policy that's before the committee. I'm to ensure that the overall objectives of the policy achieved and fall hotel workers must have access to low barrier low-fare Pathways to reporting workplace violence and harassment and work a reports must trigger a reliable and meaningful action from their employers. Where's the committee to consider amending the language to address their confidentiality of reporting workers and Witnesses the further protect workers from retaliation and the grant workers a mechanism to appeal the results of an employer investigation in the same way that yes, sir allowed to appeal under the policy. I'm also want to know that their record keeping requirements in and notice requirements in the legislation should be strengthened to make sure that workers in defend their rights. Thank you all so much. Call for public testimony for today. There will be as we talked about three additional opportunities and I'll read through those again before we conclude before anybody else gets up. Anybody want to make their way to the microphone. Okay, at this point before I had to say something closing words on I didn't open. The floors are Council colleagues if there's any last comments, that folks would like to make you feel free to Government, thank you. I really appreciate all the workers and the members of Labor movement to justify today, especially the rank-and-file members of Unite Here Local Aid and the non-union members who testified because it is not easy. It is not racking to be able to speak openly and bravely about workplace conditions. I also want to reiterate from my office the commitment that we will absolutely be fighting for the best HealthCare coverage for all workers union and non-union and I think that was really powerful testimony about how when when union workers when something is also a positively affect non-union workers were talking about workers in the entire city that will be impacted. The last thing I'll add is just to let go but Abby said it's interesting to see the hotel industry and the restaurant industry saying that they're committed to panic buttons and they're happy to do it. Where's your father wouldn't have happened if workers hadn't fought for it. But also I'm hearing from a lot of workers that is not being implemented across the board. So if you are truly committed to it, I would hurt you that is actually implemented because we are hearing from workers that Panic they don't have panic button in the Dallas shooting from the the the manager manager eolian of the bosses that that it's going to cost them too much to do it. And that's why they haven't implemented a need Wi-Fi and so on and so forth our studies that I'll be in public that said that it was actually very very reasonably priced and certainly big big establishment like hotels can certainly do that. So we hope given how much commitment you have expressed for panic buttons that you will go ahead and Implement that for all workers. They can council member First I want to thank everybody for being here. It's a full to our I'm hearing and we have gotten you out before the garage closes. So that feels good. I just want to say I appreciate the most respectful conversation that's happened today. I know that folks have various opinions. I want to reiterate how important it is for people to feel hurt when they come to the microphone, especially for those who might not come here and testify on a regular basis. We know that this is not easy to do so want to make sure people feel like they're in a safe space when they do speak up on thank you for adhering to our rules as we talked about committing to a minute-and-a-half. That's just not enough time. We know that so we'll keep I keep engaging with all of you who come today. I want to thank the council members bagshot Gonzalez Pacheco herbel dance want thank you all for being here tonight. And for the actually being at multiple multiple of these meetings. I can't remember Gonzalez is office and I have been working on some of the details that you've seen laid out so far and we're all committing as accounts of continue working on this legislation with the office of Or Sanders with the mayor's office was Central staff and the city's attorney's office. There have been more meetings over the last six months. I'm trying to put together some of the initial proposals that you see and will continue to have those discussions especially based on my conversations that we've heard today. The priorities from stakeholders ideas that we've heard from the various committee meetings and today's a robust discussion from all of you has helped inform again, the four pieces of legislation that were talking about harassment and safety of hotel workers protection from injury and workload protections healthcare for workers and worker retention. These are important components that together. I think over the next few weeks here. We will have some additional opportunities to have various discussions. And today again is not the very beginning of the conversation given these ongoing discussion around initiative 120 for the last few months of Engagement that we had with the both industry and workers a but this is also a good place for us to reiterate that going forward. Ample opportunities for us to continue to engage want to reiterate the dates that we talked about at the very beginning of the meeting on July 11th. We will have conversation around possible changes as we call issue identification so we can bring forward some of that seems that we heard that just summarizing overtime calculation Healthcare calculation on small business Chancellor business definition issues around making sure that there's a Time enforcement and low barrier reporting for workers are just some of the things that we heard about today on July 18th will be seeing some possible amendments and considering a possible amendments for the council's consideration. We are planning to add August 1st committee meeting. That's a Thursday August 1st at 9:30 to talk more about those amendments impossible vote. And then the second Monday of August is of the day that we would like to bring this forward to full counsel. So want folks to know what the timeline is you all have that in your binders as well and that Has been made available and we will include the written testimony that fox has given us and if you want to send it, I think you know how to reach all of us lastly. I want to say thank you to thank you so much to our team Erin houses up. Here is a Joe Parisi was to have a wreath of us who's been running around 9 o cast member Gonzalez missed anybody else Roxana. Thank you for the Rock Center for being here as well to our child care providers who were on sides and providing childcare. We really appreciate you being here and to our interpreters for making sure that everybody could understand what was being discussed in real time. Thanks for the translation for this evening. You guys supposed to trabajo. Thank you for your work their work makes it possible for us to do our work. So it's important they are on the western trabajoso. Thank you to those interpreters. And again, thank you all for engaging with us. We look forward to continuing to have that dialogue and one last thing you two are security you guys thank you for staying extra and helping folks come up in the evening and get up those stairs with the Overflow room. We've really appreciated it just for the good of our orders the next housing Hills Energy and workers rights committee will be on Thursday, July 11th at 9:30. And these complish Amber's is everything else. Okay. This meeting is adjourned. Thank you all very much.", "end_time": 6709.1}]}