{"format": "raw", "annotations": [], "confidence": 0.934061075001955, "data": [{"start_time": 0, "text": "Comcast on the air we are on the air and thank you for being here for a regular schedule concert briefing on May 6th. Just go. I'll start off with just go around the room and talk about the full Council actions are this week's report nothing up for vote today from the governor stockley and Technology committee. We have our meeting tomorrow morning at 9:30. And we're going to have the digital Equity progress report in addition to the Seattle information Technologies racing social justice initiative, and I do want to mention along these lines just give all of you a little nudge has a nice for the respective departments that you deposit policy lead on I believe the following annual rsdi department presentation of already taken place. I just and I could have missed one or two, but I know the office of sustainability and environmental office of sustainability environment presented at this is sustainability and transportation committee on May 5th May. An old PC D&S DCI presented at the planning land-use and zoning committee on May first and finance and administrative Services presented at the finance neighbor is coming on April 24th. And on that one particularly. I don't want to show favoritism anything but I think customer back. So agree that was one of the most comprehensive and most effective reports by the team. They're doing some very they should have set the bar too high and what a department can do in terms of policy Direction granular a granular approach and then big picture items from there. Just well done in their numbers. They only had a couple people on their change team. They've got it all the way from them. My number is coming off a flight from to 2:20 or something like that. So kudos to that department in, I'm going to anyway, so we want to get that done before budget and want to go as deep as we can on the respective departments such that there. They don't feel rushed during the budget process. So just met you get an email. Route to Summit Apartments, we could get more than the the 303 we've had on the introduction or throw calendar today. We will be introducing a resolution we heard at the governor 2nd and Technology committee on April 21st at night on our meeting tomorrow. And on that issue. We're looking at modifying the rules Whenever there is behavior that can be construed as threatening and nature and are rules sort of address. And now that we didn't think adequately so and I want to thank a few of the cast members for again having a discussion about this and we think it's I think the rules were about to present certainly will legally and adequately address the issue. So that'll be on May 21st of May 21st, and last reminder is at 11. I have a photo today for the new council members or 11. They will take our Seattle City council members want the next meeting of the committee sketch. How far is regular time Tuesday, May 14th at 2 p.m. At that meeting we will discuss with the Seattle Department of construction inspections about their newly launched renting in Seattle web portal. I also wanted to report that my office I hosted a really important community meeting at the Garfield Community Center on Thursday. Alongside the US Postal Service to discuss bringing a post office back to Central District in addressing the post office desert that the entire part of the city is facing since the closure of the 23rd and Union post office. We are fortunate the USPS appear to be willing to be open the post office. They engaged with the community members by actively and have identified two or possibly three locations that could work as a temporary location and interim location and my office will be reporting more on that. Thank you. Good morning. Every morning. I have a proclamation to circulate this came from our human services department RH friendly Seattle is recognizing may as older Americans month. I turn my keep saying that that's just not the right time to be using but we will be presenting this on Friday not this afternoon. So I will circulate this for your signature if you'll join me in that nothing to Dave to vote and I do want to acknowledge councilmember Gonzalez. Thank you and your staff for multiple days of conversation last week about having the low Acuity presentation at your committee this week. I know you're very busy, but appreciate you doing that and so We will be cancelling the Wednesday May 8th meeting because we only had a couple of appointments. But that way you will have the next meeting on Thursday, May 23rd, and it's going to be a very well packed agenda and I want to acknowledge also that later this month that I'm going to be in a conference that will be focusing on our retirement system. So I'm going to be out of out of state for a few days and for anybody else who is interested in following up on our Seattle retirement system is chair of the finance committee. This is one of the responsibilities that comes with it, and I'd love to share that with you. So I would just bring that to your attention because it is something that is really important to our current employees as well as retirees, and I've been cheering that committee now for a year-and-a-half and I've learned a great deal that I'd love to pass on to whoever might be interested. I know I agree with you about the whole what do they call older Americans month? Yeah, they aren't keeps trying to send me a card which I throw away every time I see it in the mail. I refuse to take the art card. How's the junkyard when we get there? We'll Franco same way. Steve Madden Like I'm not an elder stop. Okay. So the Civic development public assets and Native communities committee met last week and I want to take this time to thank councilmember badshah and cancer ever Gonzalez protected against her badge temperature in the meeting for me my absence. Thank you very much. Thank you cousin Rick Gonzalez for tending and getting our staff some great Direction on one of the items one of the ordinances that we were attempting to what we will continue to review to thank you both the committee voted to ordinances for full Council. First of all, the appointment of Jesus a guy as superintendent of Parks and Recreation, which will be presented this afternoon and an ordinance regarding a partnership between the Seattle Academy in the South Park Community Center, which will be presented at the following council meeting Monday, May 13th. There's some things we need to work out the parks department requested more time on this bill to follow up with council members and the community who had more questions about the agreement itself and also want to thank councilmember skater who stepped up for me when I had to go home ill to welcome councilmember Pacheco. So thank you is the proclamation recognized Beatrice Catherine Alder or as folks may know Abby. We're recognizing the and honoring the life of Beatrice Catherine Alder. She died at 36 hours after she was born to medical issues and these parents Aaron Alder and Rachel Alder Rachel an employee at hsd we're devastated in the middle of physical and emotional wreck. They were dealing with a hole in our cities leave policies to find Rachel at at the time that she needed. So notably when individuals have tough pregnancies, they often drawdown sick leave and after the death of a loved one or family leave policies don't contemplate what happens after the death of a low on money if you've taken care of your elders or A6 sibling. Family policies don't consider that it's especially devastating when I leave policies don't consider the death of a child and what we're really looking forward to working on is honoring the today and the tireless advocacy of her parents Aaron and Rachel who's been needing to wanting and trying to bring forward policy change after a very long time. We're really excited to learn last week that the executive is submitting policies to city council to help fix the Gap in coverage that are State Paid Family Leave medical act and our own Leave Act has not actually addressed with the leave policies and to find some remedies to this issue that Aaron and Rachel have face. We also know that Aaron and Rachel will be here with her family today as we honor and we are really excited to be able to have this proclamation in front of us. we also have yes, thank you guys. We also have a proclamation in recognition of affordable housing week next week. I'll be circulating that as well. The proclamation is in recognition of affordable housing week in 2019. This Proclamation will designate May 13th through May 17th as affordable housing week in Seattle. This will be a week full of events celebrations and advocacy across dozens of cities in Ocean County to ensure that everyone has access to a safe and healthy and affordable home. We know that countywide we need a hundred and fifty-six thousand aafordable Helms to meet the current need their Partners in Seattle and cross. Our region were working tirelessly to create more resources and policies to help us create the affordable housing our community needs. This is a week to celebrate and energize those efforts will have affordable housing Partners present this afternoon at full council meeting to accept the proclamation and we also have a few items on today's full Council agenda was three Appointments to the Labour standards advisory commission will Pitts who will be representing Teamsters 117 gay Gilmore who was the co-founder of optimism Brewery on Capitol Hill, Maryland Watkins, who was the policy director of Economic Opportunity Institute, all three of which I've had the honor of working with over the last decade or so on labor standards policies game or recently met and was very inspired by all of the work. She does to ensure that her workers earn a living wage starting at $20 an hour with 100% paid medical and dental vision. This is the body as you all remember that comes together to come up with recommendations for City council's consideration the most recent of which is Miss classification taxa councilmember her both who asked him to put that on there were plans. So very excited to see these three move forward with your step for how someone I let folks know where are circulating updated resume for. Dr. Khan this afternoon. Dr. Khan is the person who Our committee has advanced to be the director of the employee ombuds. She has Global diversity and inclusion specialist in her resume. She serves as the Director of equity and inclusive practices at the Renton School District and prior to that was the associate director for Global diversity initiatives at Oregon State University. We're really excited. I'm especially because of the inclusion of the silence Breakers and the change team makers and ttf sorry Protech Seventeen members who were part of the evaluation and we want to make sure that her resume reflects her most recent activities the worst are circulating that for your consideration by the next housing Levi oversized committee appointees, Fort Lawton plan and land-use and administration and finance plan and housing funding policies will all be on the agenda. Is it for the upcoming agenda? I do want to let folks know. We have a special sort of work session that we are hosting. Jointly with the University of Washington and UAW 4121 That Way Beyond confronting harassment and discrimination best practices. Especially in public sector work. We are going to be talking about how we Elevate the voices of those who have been within the me to talking about how we change policies and practices and how we bring those voices into collective bargaining and public policy making if you are interested in coming over at the University of Washington University Friends meeting place at 4001 East Avenue from 5:30 to 7. It's on our Facebook and social media, and if you plan to 10 letter office know by the end of the day, I'm given that this is not a special meeting. We want to make sure that we don't go for Coram attending the event at Discovery Center in South Lake Union in Westlake tomorrow be speaking at the Cascades. Look up breakfast and Wednesday again and Chris folks to join the anti-harassment work session at 5:30. Thank you. Cancel RuneScape. Thank you. And I want to thank you for for convening a group of folks to talk about how to elevate voices to address issues related to sexual harassment in the workplace as it relates to our bargaining a lot of folks that I've been meeting with have been raising those issues specifically the silence Breakers and I've been pointing them towards the bargaining process to address some of them. So I'm getting down into some of the details about how they can do. That is to be really helpful. Appreciate it. Have no items on today's full Council agenda. There is no civil rights utilities Economic Development and arts committee meeting this week one item that it's not up for vote. But is on the information referral calendar today. Just want to give people an early heads up is an ordinance related to The Pike Place Market historic district amending Ordinance one to 5650 to extend its effective date by 6 months. There will be a public Hearing in my committee on June 4th in the evening at 5:30 p.m. Other items coming up. I have a regional Watershed resource inventory area otherwise known as y19 committee meeting this week and items where I will be out in the community include Tuesday's reading Partners luncheon. Wednesdays climate Solutions breakfast and on Saturday, there will be a city is climate Summit to model for success in Bellevue during the afternoon and I'll be attending think you'll be hearing a lot from me during the week. So nothing on this afternoon's agenda. We do have a regularly scheduled meeting of the gender Equity safe communities near as an education committee that will occur on May 8th. That's this Wednesday because we unfortunately aren't a situation where there are things that need to be. Turn on the May 8th. We need to start our Committee hearing early. Otherwise, we will be in Chambers until well after the lunch hour or so. We will be beginning the committee meeting at 9 a.m. Instead of 9:30 a.m. Items of business for this Wednesday is agenda include hearing a briefing from the Seattle Police Department representatives of the Seattle Public Utilities Department the sale Department of Transportation Department of neighborhoods as well. We'll be at the table with us to talk to us about the recently-announced emphasis Patrol strategy by the Seattle Police Department and mayor durkan as you all may be aware. I've been sending you copies of Correspondence that I've been having with the chief of police and mayor durkan about their new neighborhood emphasis strategy has announced last Tuesday believer Wednesday. I'm losing track of the days at this point. But essentially this is a announcement that came to us on the eve of when the announcement became public that there would be seven neighborhoods. He would receive additional police resources and what also see some cleanup work being done in their neighborhoods. The lead Agency for this effort is the Seattle Police Department and so they will be joining us at committing on Wednesday at 9 a.m. To provide us an opportunity to hear from them how the strategy was developed and what we can expect from the movies at from this deployment of the emphasis patrols. You will notice that I in the letter that sent that I sent to the police department and the mayor I included got a page and a half worth of questions related to both the development of the program performance metrics outcomes anticipated as a result of this additional strategy and in other questions related to Racial Equity toolkit and Anne and what crimes are going to be focused on during of the deployment of these additional police resources. So really encourage all of you who have an interest in this up to join us at the table on Wednesday and looking forward to that. I have made a specific request to have Chief Carmen best join us at the table. I think that this is an issue that is tantamount importance to both the council and to the overall City. I'm still had a conversation with her as early as this morning. She had indicated last week her office and indicate the last week that she would not be able to attend due to a conflict. It does appear that she is in town and I've asked her to a respectfully reconsider her schedule for the morning of Wednesday, May 8th to join us at the table. I would sincerely appreciate my request being accommodated in my hope is that she will revisit her schedule and look seriously at joining us. The table on this Wednesday. Okay. So that is that item happy to answer any questions if both have it. Otherwise, I'll look forward to seeing you all on Wednesday to those who are interested in doing so the next item that we will consider and in my committee will be related to the mobile Integrated Health pilot program. This is a Seattle Fire Department program that that all of us as supported during the budget last process. This is essentially what we collectively have been referring to is a low Acuity of program. This is the program that would save us a whole lot of taxpayer dollars by I'm not sending out a full deployment of Seattle Fire Department trucks to what simply requires an EMT or some other a crisis intervention management at repeat at addresses in particular. So really excited about hearing from the fire department in committee to address to hear the response to our statement of legislative intent with the initial concept around what the Pilot should look like best based on their study and evaluation and also consider a lift of a Proviso to allow them to deploy the funds to be able to purchase the items that they need to be able to deploy at so I am I am looking at making I'm some amendments to the sly and look forward to having a discussion about this at the at the table. So the last two items are related. I'm excited to host the Washington State Employment Security Department, Carla Reyes and my committee to walk us through an overview of how Washington's brand new Paid Family Medical Leave program will be implemented across the state beginning in 2020. So many workers starting in January 1st of 2018 should have started seeing a deduction in their paychecks going towards Paid Family and Medical Leave This is the effort that I was very closely involved with in the 2017 legislative session that I was real. Excited I passed and we will hear from the state of Washington housing fermentation is going and a very excited about having a conversation on my committee that is related to a glass addenda item which thermostat already spoke to about very thoroughly in her comments about this afternoon's Proclamation. But that is a fixed to the city of Seattle Paid Family Care leave program. When we originally version of this Council passed paid family leave here in the city of Seattle that applies to Jester Municipal Employees. We passed that line 2016. I was proud to be the prime sponsor of that piece of legislation and was really I'm honored to have a unanimous support of the city council as we station and passed it. There was unfortunately a blind spot in that law that didn't take into account what would happen if a city employee in the course of supposedly Hat of being in the situation of celebrating one of the most joyous occasions of receiving a new child into their home. What what would happen in terms of their leave benefits if that child of whatever age passed away shortly after being welcomed into the home. So this like this like knowledge is that there is a gap in our leave benefits under the Paid Family and Medical Leave CARE program at the city of Seattle and we'll address that Gap. So that future employees will have access to Paid Family and Medical Leave even in the instance where a childlike be only survived for 36 hours after after birth, so I'm really excited about hearing this in my committee and about it and advancing it for full Council consideration. We're hoping to be able to throw this out of committee on Wednesday and have a full council at consider at the following Monday. So that is all And look forward to the meeting Wednesday. Thanks for asking. The great questions and issues that I think will affect the whole city. So I think I doing a deeper dive on what's Happening is makes a lot of sense of things organized in that. What's wrong with your car? But you're cool. Happens all the time in the morning everyone just there's one plus item on the inspection referral this morning. I cancel belt 11951 one which meant a contract reasoner's 7009 Greenwood Avenue North D6 that the council approved last year to make Corrections required by the Superior Court remand. This legislation will be referred to next week Spokane city council meeting because the associated clerk file 31442 503 sleep granted by the plus company in April being considered under the council's quasi-judicial rules should avoid Communications about the merits of the reason applications with proponents proponents of the project. And if you have any questions about the council is quite a quasi-judicial rules PC keto Freeman of our Central staff, there will be no plus related items on the agenda today. And as a reminder that the next plus committee meeting is on his next Wednesday, May 15th. Very good. Thank you very much. Volume Transportation committee. We have a committee meeting tomorrow afternoon here in Chambers it to quick run to run through of the items on there will be taking appointments for the freight Advisory board that we six of those two for the Levee to move Seattle oversight committee. We will also get a report back from s. On the Move Seattle oversight report. Additionally, we will get a Sly response report on the rapid ride corridors. This is something that came up during budget as you may recall in the budget process in advance to the budget process. There was the the reset to the love you move Seattle initiative and there was some questions about how that's going to play out for the rapper. I court orders. Those are also tied up with Federal funding grants that they're waiting on and so this is an update to hear kind of the evolved thinking on that. We will have the rsj. I report from the office of sustainability environment tomorrow afternoon and finally will be Sing our first discussion about a deal legislation. We actually will not have the legislation in front of us. Yes, we still are probably a week or two away from hearing back from the hearing examiner that we expect to hear from the hearing Zimmer sometime middle of this month the focus of the conversation tomorrow is largely going to be around the proposed far limits in single-family zones this legislation around backyard cottages and in-law units have been something we've been discussing for over three years now and has a lot of folks that have paid a lot of attention to this and so we will touch on just some of the highlights of that but we'll get into the details of that later on in the environmental impact statement, which was finalized and had a preferred alternative last fall. It would include a recommendation that we limit the floor area ratio essentially the size of single family homes in the single. Amazon and that is a relatively new concept and haven't had the three years of wedding in conversation with additional e for people that may never consider to build a backyard Cottage or in-law unit. But on a single-family how it may have impacts on them and they may not have been paying attention to this legislation. And so it's really important that we have a chance to Daylight early what the proposal would look like some of the consequences that may have some of the kind of tweaks. We might be exceptions. We might be making to that rule Ali will be here at the committee on Tuesday to walk through all that and hopefully get a chance to hear some of your thoughts and feedback on that or answer some of the questions and also really want to make sure that the public out there understands what the proposal is and how it might impact posted on Holmes. We will proceed on with a deal legislation later in the month. We will dig more into the specifics around parking requirements ownership owner occupancy requirements size limits Heights all those types of We're also be noticing an evening public hearing here in Chambers on June 11th to walk through that legislation and then we'll have additional committee meetings. So wine on May 28th end of this month and then another one after the public hearing on June 18th, and all goes according to plan. We will have worked through all the issues and have the vote in figure out how that goes forward. And if not, we'll give ourselves a little more time. This is all contingent, of course upon a favorable ruling from the hearing examiner with the exception of everything before that. So we will start discussing out they are in a dance that hearing examiner ruling just to get that out there in the public eye once again, We're good. Thanks for the update and we'll try to be very intentional out because of the significance of those issues all the issues. You describe scheduling issues. Let people know exactly what's on the agenda will do a little Overkill. Did you mention a letter that you were interested in having I was about to mention that circulated via email to you all a letter for thank you sir. We're going to send to Pete Holmes been working with some Advocates and with the city attorney's office on this council president. It's okay cuz I think a couple office is still want to try a chance to review it. They'll bring it to full Council this afternoon. I was good. This is in regards to potential legal suits against fossil fuel companies. So other jurisdictions including New York King County of Los Angeles have filed lawsuits against fossil fuel companies for the impact on climate change that they've made and Understanding is a City attorney. Pete Holmes has been working on a strategy around that this letter says were very supportive of the strategy that encouraged him to hire outside Counsel on a contingency basis so that we're not there outside firmware recover only in the case of a successful lawsuit in recovery from the from the fossil fuel companies, don't fix Will you be talking more about this afternoon or do we have time cuz I'm very interested to hear what can count he's doing in particular. So if you're not prepared to answer specific questions by King County, so why don't I find some more information on that and maybe you want to give me the questions and we can are that this afternoon. I think they were relatively short agendas. So I won't take up too much time this afternoon but to try to address some questions about that. Thanks. Okay. Thanks teen and at this point will as providing outside without asking that the Seattle City council now convenient executive session. The purpose of the executive session is to discuss pending potential or actual litigation in this gives us an opportunity opportunity to discuss confidential legal matters. What city attorney's has authorized by law and legal monitors from the city attorney's office is always present to ensure that we reserve questions of public policy for our public open sessions expect this session last for 30 minutes and so go till 10:34 and if it goes beyond that time, I'll announce extension and it's expected duration with Atlas Moving the executives.", "end_time": 1820.3}]}