{"format": "raw", "annotations": [], "confidence": 0.9429364920054611, "data": [{"start_time": 0, "text": "All right everybody. Thank you for being here. Good afternoon. This is the meaning of the Civic development public assets and Native communities committee the days Wednesday, June 5th. And the time is 206. I'm joined by a council member of Gonzales council member Mosqueda council members who want and my understanding is cancer a bad shot is on her way. I want to thank my colleagues for being here today. I want to start with all my want to recognize a couple folks that we have here. We have Chris Fisher from SPD here today. Thank you Chris. We have Julie Kline senior policy advisor to the mayor's office is also here today. Thank you for being here and we have John John from the city attorney's office. Okay, I'll and we also have Liz tail hear from the Cowlitz tribe good lives are good to see you and let's see my daughter supposed to be here, but she's not so I'll just let that one guy. Just let that go. So let me do the sheriff's report today is a very special meeting for me and for our community the Native American Community. We have one item on the agenda. And it's a presentation regarding an epidemic of missing and murdered indigenous women. women and girls across our nation United Indians for Health Institute, uih, uihi is a division of the Seattle Indian Health Board, which focuses on the Nationwide Urban Indian Indians. Urban Indian and Alaska native populations provides Public Health Information Systems investigates disease diseases of concern in cages vital health information and resources with other public health authorities. I'm honored to have the Seattle Indian Health Board Chief research officer and CEO Miss Abigail alcoholic and the CEO missesta Lucero and their team to present a research and find is on this topic missing murdered indigenous women and girls and how Seattle is affected. this is a very special emotional and personal meaning to me not only as a native woman as a mother, but to this community this issue of missing murdered indigenous women has been on the radar not only in this country, but in Canada for well over a decade where we start finally taking notice. I think what we're going to hear today some some of these issues may be triggering. I know it certainly was for me. I'll talk a little bit later and some comments about the recent report that came out Monday the Canadian report, but those of us who grew up in Indian country and those of us who were Canadian communities and those of us who know and what our relationship has been with Public Safety in the value of native women in our lives have live this history, and I want to thank you all for being here. So what we'll do first is we will go to public comment after public comment. I will have our presenters come forward and introduce themselves. I will make some brief comments or have a statement that I would like to make and then I would like them to move into their presentation. So with that will go to public comment Nikki how many people do we have signed up? Why people sign up for public comment when your name is called? Please? Come to the microphone. You have 2 minutes to address the item on the agenda. And of course that is the eye of the presentation on missing murdered indigenous women and please before you begin state your name, and please mind the time I hate to be the person to tell you when your time is up with that you can go ahead and call out the names. First we have Margaret Richard and then after that Anitra Freeman. Yes, good day. Everyone is this thing on? On behalf of myself and other native people I consider myself black black native maybe and I think it's yeah, it is bad to see something like this just like it's bad to see black peoples bones in the Atlantic Ocean. And I'm from here. So if you looking at me, like where you where did you come from? Seattle Washington, so it's very important. Yeah, and I'm a woman. Yeah, and that's important that women continue continuously & Girls speak out for what is harming them because the dead can't talk. So as long as I'm around I'm going to speak about what has happened to me and you got the Indian Health Board on program and I was just screaming dated after the Indian Health Board. Is it open Queensborough? You're a native. They didn't do that to you. Panther is murderous. And if you don't kill it it'll spread. And so that's why I said look at this. It was on the front page saying that they were missing but we don't come up missing too and I have native blood in me. I don't really know much about that and how much but yet and still it is a problem. So I hope you can fix your problem. Just like black people still trying to fix their problem about how they're coming up missing and dead and in and treated in different just because of the color of their skin. I'm still fighting. I'm a warrior. I came here a warrior and I'm going to die one. Okay, and so I hope like I said that you will get everything that you asking for with this finding out about why these girls and these women are coming up missing as they do. Have a good day. Thank you next. Anitra Freeman and then after that Linda Soriano. Yes. My name is Anitra Freeman and I stand with wheel women and black whenever somebody homeless guys outside or by violence in Kane County. And we have stood for Native American women including Davina Garrison who was murdered in 2005 and her murder is still unsolved. Thank you very much for doing this study. We want Justice for these women to. We want Justice for Sandra Smith gun for Davina Garrison. And for others that we don't even know what has happened to them. Thank you. Thank you. Like to the record to reflect that counselor bags has joined us. Thank you. Hi Linda. My name is Linda Soriano. I'm enrolled with the great Lummi Nation here in Washington State. First of all, I just want to thank everyone that has an interest in this and that you even take the time to give attention to the missing and murdered indigenous women when this started going global in Canada. It's becoming there's becoming a lot more awareness. I have a very close friend who's concerned. So I when can I get my own research? Yes, we have a high number of murdered and missing indigenous women, but however, the men and the boys are twice as likely to be missing and murdered and that's here in the US and Canada. Now when I arrived here today, I asked the assistant here to put one of these on each of your in front of each of you. And the reason I did that is to point out that we just prior to this being here today. We were standing silent vigil across the street. For the another homeless death. What I want to point out is over the years how many has been found murdered or whatever the cause of their death is in my heart. I know from my own experience a high number of those homeless deaths are Native American. I know for a fact I have been doing my street Outreach unsponsored alone since 1999. My husband and I married in 2012 now that is our marriage Ministry. We often encounter people who are suffering out there. So this is why although I don't know a lot of the people that we stand silent vigil for across the street. It's important to acknowledge those to bounce the murdered and missing indigenous women and girls it just tears at my heart because so many of them are still missing. You're still missing and the men and the boys across the board u.s. And Canada. Thank you. Thank you Linda. We have Randy Peters and then after that Joey Gray. AllShare my name snoops Kavu measures passed on my ancestors since beginning of contact we've been having this trouble. permission woman missing children Now it's boys. If we can bring attention. trans issue We asked you. Please we need your help. we need to bring this out. Any open stops because I had sisters taken away from up and Canada. Did California? They got a hold of the RCMP. That is how they they got away from me. and everyday This is happening to families. Or we lost loved ones. annoying date hair help I plead with you we need your help. Because too much sorrow too much pain. usually a lot of people don't bring this. to attention that they just hide it away in our hearts. People are hurting families are hurting all the way through the country. So this will be played with you. Thank you for listening. Thank you. Thank you for your words. The game, I'm Joey gray. Thank you so much for bringing this important issue to this body and to the city of Seattle. My name is Joey gray. I'm Okanagan and metis. My family's been in Seattle since the 1920s here as a guest on Coast Salish land and my auntie gave me this letter from 2001 just recently that I hadn't heard of until then and it's from my uncle to my dad their family was from the Okanagan and I'll just read it. This is my testimony this lady that my Uncle Matt now in her 70s was the daughter of one Lula bouvette the youngest member of our clan and the one that their mom my grandma would sometimes longingly and sadly refer to who went to Los Angeles presumably in the 1930s then to San Diego and disappeared from view. I guess she had this daughter. Who was sent back to our grandfather? In Kelowna who raised her. And she disappeared no one ever found out why or how and their Auntie certainly remembers that mother? And her mom or their mom talking in the same tones Hazard Hazard my my grandma about the missing sister. I don't know whether there was a hint of Scandal are not in this matter. So this this was in 2001 that this was talked about in our family that way and it's been going on like other testimonial said since Pecan person's contact. So thank you again for raising this issue for bringing the most uncomfortable topics to the public light and dealing with it. We done. Is there anyone else who needs to speak in before we close public comment? Okay was that we will close public comment and move on to our agenda. Can I have you read into the record and then we'll have our wind our folks come on up and have a seat of here. Go ahead and getting what you read into the record for missing and murdered indigenous women and girls. Madam chair just want to thank you for the invitation to attend and then just let you know. I'm have to leave a little early. So I apologize if I get up in the middle of presentation. Okay. Thank you so much. I'm going to do something a little bit different than I normally do. I'm going to ask our presenters if they can just briefly say who they are and then I want to make a statement and then I want to turn it over to you 3 to go ahead and Aaron and I'm sorry I should have said your name earlier and you can stay here your title is on because I want to get you on the record first and then I want to put some of this into context. So if I can have you introduced yourself your tribal affiliation of course, and as you know, my name is Natalia mrs. Kay which means holy mountain woman and blackfeet and as I always joke, I did not get my name off the internet. There's a whole ceremony and it went along with that three days long. I gifted my friends here today with the most sacred place from our from our place Chief mountain and the two Medicine River. So if that if I can have you introduce yourself and then I'm going to make it some statements and I'll hand it back over. Everybody, my name is Ester Lucero. I'm the day and Latina and I'm the CEO for the Seattle Indian Health Board and it's an absolute privilege to be amongst friends when I'm sitting at a table of Consul members, and we're all familiar. Hi, good afternoon. Everybody Noah. My name is Abigail echo-hawk. I'm in a world citizen of the Pawnee nation of Oklahoma. And also a proud member of the upper on athabascan people of metastasis like Alaska and it is a privilege and an honor to be here with my friend and loved one and councilwoman whereas and again, thank you for this opportunity to be able to share what is happening in our communities and to offer Solutions. Look up Rihanna Samuel. My name is Aaron spark on the governor's Terrace officer for the Seattle Indian Health Board on to pick from Western Alaska in my language. I said hello and thank you for allowing me to do my part for a community. I'm also the father of two young Native girls save some for by this is thank you for being such a cutie. Thank you. For those of us that were raising any country before I make my comments. It's been a little different for me to make this transition from what I used to do to be on city council and are Robert's Rules of Order and how we do things. But I would like to do it in our traditional way that we start. We don't call it a prayer but we talked about a moment that we ask the Creator to make us move forward in a good way and we make choices and have good words that come from a good place and his uncle Billy would always At the end of the day, we will all be healed. So with that I want to make some comments and if you can just bear with me, I want to put this into context about why we're here today, but I will allow the experts to a coursing really share with us why we're here today be missing murdered indigenous women and a more historical and political and cultural context is what I want to address and as I was showering with my colleagues before the microphones were turned on at the root of this is about colonization and colonization is and was more than just the taking of our land and our resources colonization as a government policy or law took our lives are Health our culture or language our land our children are spiritual place in practices. They even took our hair. The irony of Native Americans being the most regulated ethnic minority as we are political entities and Sovereign Nations that under such scrutiny and attempts to erase us. There were no Collective attempts of inhumanity to find us to protect us and to value our lives and we're still here today. The historical context of the United States and indigenous people of United of us our country. I can't do federal Indian law history 101, but I can share the history that brings us here today right up to 2019. I want to go back in time just a little bit and put into contacts about what our people are indigenous people. all of North America have been dealing with in 1783 president President George Washington and his earliest writings in their attempt to purchase our land before War before treaty time after during genocide in termination. We were seen as quote-unquote wild beasts. We're Savages and quote-unquote Savage as the wolf both and being beasts of prey so they differentiate. In 1824 to 1849 the Indian Affairs was in the war department are political Genesis in our own country began in the war department with a military occupation of our land and our people it wasn't until 1849 that department of interior took over what they call the Indian problem in the Indian issue yet in the 1870s and 80s. There was a huge Congressional Porsche to put Indians quote on quote back into the war department for more military oversight as they put us on reservations. some of this history that I had to go back to is very painful in the last 4 days because even though I'm on city council when I practice long represented tribes, I know a lot of these facts off the top of my head and it's been awhile since I've looked at prucha and US V Washington and all these issues and I did so I can tell you that we are dealing with over 500 years of colonization over 300 years. If you was tribal relations in federal Indian law and jurisprudence. Laws that were the policy was to exterminate us laws of genocide and removal termination reservations. And we know our history these Colonial Roots Run Deep on a tangled in the Bloodshed of our people and that's not just hyperbole that is true history history of blood should War genocide and greed and it it hasn't changed so fast forward to 2019. We're here today because there are two reports first and foremost were very proud of the report that came out of the ceiling and Health Board and their work of Abigail alcoholic and I still let Sarah and their team that came out this spring that talked about Seattle having the highest number of missing murdered indigenous women. And we have a second report that came out Monday the Canadian report called reclaiming power and place that is a 1200 page document in this is the quote reportedly blames a disproportionate violence face by indigenous women on deep-rooted colonialism and state in action. Those are 20 very powerful words. I want to briefly share something with you and then I know that I'm Nicki had prepared a memo and I believe it's up here and I'm going to make sure my colleagues have a copy of it the recent memo reclaiming power and place National inquiry into the missing and murdered indigenous women the Canadian report started in 2016 and was finalized just this Monday in 2019 and was released. That final report is over 1200 Pages. The executive summary is 117 Pages alone. They're many facts related to the support but there are two of them that I want to highlight one about Aboriginal people in Canada account for 4% of Canada's population yet on average suffer from the highest rates of crime poverty and addiction again the root causes persistent in this is the quote persistent and deliberate pattern of systemic racial and gender human indigenous rights violations and abuse has perpetuated historically. They maintained today by the Canadian State designed to displace indigenous people from their lands social structures and governments into a Raticate their existence as Nations communities families and individuals and that's when the chief commissioner Chief commissioner Bueller on the report. Turkey basic principles in this report in their call for justice that is to reaffirm basic human rights to look at Major policy and legal reform to have trauma-informed services and have a regional focus with the tension on Northern remote communities and finally acknowledge bit of culture and language of tribes Across the Nation and identities within those tribes in areas on their call for justice. I think it's important to note that they highlighted the human and Indigenous rights in the government's obligations culture Wellness human human security and Justice and from that I don't want to go to all 15 cuz I'm going to get a little bit to wonky but it's important that this report is coinciding with your presentation because a lot of it is the same and I think they did it right and what I really like about it, it wasn't just about information. The government will be deliberate and a process to address why they have so many missing murdered indigenous women and girls and nobody did anything about it. I understand is they interviewed more than 2380 family members who are survivors of violence and experts and keeper knowledge Keepers and they went to the country together this evidence something our country has yet to do. So both reports must be read as I shared again within the Violet in historical context of colonialism. Colonialism to me for what? I understand and it is more than just this new term when people talk about decolonizing for us. It means trauma and historical trauma manifest itself through many many generations, and I know Abigail and Esther and Aaron will speak more intelligently more accurately than me. But I don't want to end with a simple analogy. That's both complex in human complex and painful about the human condition of trauma. Historical trauma is like a flooded River like when a river floods in breeches, its banks the water like pain cannot be contained anymore and that pain like that water has to go somewhere that pain has to settle and sit somewhere and I think why we're here today is we're here to discuss that pain in the history in the trauma the historical trauma and what we will do about that. This is just the beginning and I'm glad that I have my colleagues here today because these are the people these other women who were going to work with you and all of us how we're going to address this what we're actually going to do What legislation were going to pass to protect our women? It is sad to say that Seattle has the highest number of missing murdered indigenous women and girls in the country. It's not a fact that we're proud of but I assure you and my word today that is something that we are going to fix. And so with that I will hand it over to the experts in this. I want to thank you again. Thank you, Tim and Juarez again. It's it's interesting because we are often informs like this and we come with our suits and we come here with our Fierce faces, right and then you hit us with opening in a good way. What happens when you do that as we have to come this whole people? And that means we carry emotion in bed. And so I'm not surprised at Erin Express that and you might see that from all of us because we've all been impacted by this problem is challenged in many ways. So thank you for that. It also just like to say that I appreciate you making space for all of us here to Seattle Indian Health Board has gone through a tremendous transformation. And we do everything as a team and account on the expertise of my team members to carry this message forward and others just say something about the Seattle Indian Health Board for a moment Seattle Indian Health Board Rose from social justice movements of the late 1960s early 1970s. We are service organization that committed to our communities. We're probably best known for a Health and Human Services because one Urban Indian Health programs or authority lies in the Indian Healthcare Improvement act in this is permanently reauthorized to the ACA. I say that because people aren't often as familiar with the fact that we have a legacy of advocacy and that we host the urban Indian Health Institute, which is one of twelve tribal epicenters in the nation. And the only one that has a national scope because we serve the urban programs across the country as like to remind folks that 71% of All American Indians and Alaska natives live in urban environments, and we were one of those core relocation sites. And so what we are going to share with you today is an extension of work that originated with Grassroots movements, right that started back in the 1930s. And so we as an organization because we're committed to our people in our community and we Center ourselves and culture and traditional Indian medicine are coming forward today to offer our gifts to this movement and those gifts are grounded in research and they're grounded in understanding how policy and advocacy works and that's why we're at this table, but that is not to overshadow the many marches that have occurred or the many voices that are carried by our families who've experienced this recently and even in the past. So with that I just want to hand it over to the expert in our organization who we depend on to Champion this work for us. So again, good afternoon everybody in and thank you Esther so much as she said we are a team and it is and you know it and having her leading this organization has been integral to us being able to do research and data collection in a good way. So when we talked about the decolonizing data, which is up on the screen on people often ask me. What does that mean? And I think about myself not as a researcher from in Western academic model, but I rather see myself as a Storyteller and story in our communities has always been part of who we are and in fact in most communities was always part of who we are but we get into Western science is often this idea that our stories are meaningless unless we have the numbers and very often we look at marginalized populations American Indians, Alaska natives Hispanic and Latinos and many others. We in this Western system of colonialism are very often not given the opportunity to gather our own numbers to tell our own stories. So when I talk about decolonizing data in the work that we have done, Violence against indigenous women and girls is that is the Reclamation of our traditional ways of gathering information numbers and stories and using them to move the health and well-being of our people in a bar community and we are doing it for indigenous people by indigenous people and we will be the one shaping not only the stories but the solutions and I think that is why we're here today. We are going to share with you stories that are hard to hear. Stories of families have shared with me numbers that maybe you have never seen before but because of the silencing of them through the Western research and through the non Gathering of our stories because it justifies The Taking of our land the killing of our people and the Bloody genocide and which are organizations and which are bureaucracies and which are homes currently are instead. We are going to reclaim our strength in our power and being here at this table today is part of that. So you're part of our decolonizing data so welcome to a journey because it is that because it requires us to think differently and to make different choices in recognition of the things that councilwoman just read because it is an ongoing genocide against our people as we look at our women and girls who are missing and who have been murdered. I just want to start with a little bit of background and this is from National Data that shows that native women are two times more likely to be raped or a victim of sexual assault than the rest of the country. So we're looking at all of the racial and ethnic groups. Why are native women more likely to be raped or to be victims of sexual assault? This is a question that many people have never actually addressed and when I look at this data in my heart, I knew and from the stories that I've been told Nationwide I've done research with more than $150 in tribal communities across the United States both in urban and rural settings is that I know our stories tell but this isn't even near the number of actually of those of us who have experienced sexual assault or have been raped. I identify as a woman who has been a victim of rape and sexual assault and I know that I am not the only one When I first started the Seattle Indian Health Board about two and a half years ago. One of the first things that we moved to do was to release a study that have been done specifically with American Indian Alaska native women living in the city of Seattle. And this is the results of those studies. This is the beginning of a series that we titled our bodies our stories in this study. We found that more than 148 native women that we talked to 94% of them had been sexually assaulted in their lifetime. These are native women that were living in the city of Seattle when you look at this graphic again, this is part of our deal colonizing data. Is that for the reason that we use this imagery very specifically this woman is wearing a type of native. Regalia called a ribbon skirt. And what we wanted to represent is that this data these stories. He's beautiful voices who share this information with us that even though they are have had these ribbons of trauma. They are held within prayer and they are held within the hands of their community and those allies have a responsibility to ensure that this trauma does not continue. I'm just going to go briefly over the findings of the study. We talked to 148 native women living in the city of Seattle. And as I said 94% of them had been sexually assaulted in their lifetime. Now, this data is more than has been seen in any other City. Although I will say very few have actually done this kind of research. It is more than what the national averages are. And it's more than is reported in King County Health. This data was something that had never been seen before. Why were they willing to tell us because it was done by indigenous people for indigenous people we sat and those who did those interviews as these women shared up to 4 hours sitting down crying and weeping and sharing their stories. And why did they do it? Why would you relive that kind of trauma? They did it because they wanted their stories to make a difference here in this city. They did not want those next Generations their daughters their granddaughters their great-granddaughters to experience the same kind of trauma that they had because the trauma that they experience are things that you at this table deal with every day's you make your policy and programming decisions here for the city. We found that 42% of the women who are in this study had attempted suicide in their lifetime. We found that 53% of them lacked permanent housing. What if we change the dialogue on homelessness and those who do not currently have houses over their head that they or couches to sleep on or even safe spaces on the street. What if we change that to think about it from A Narrative of these are individuals who have experienced extreme trauma and as a result of that trauma, they work to just survive. So when I think about 34% of them in this study had also experienced binge drinking approximately 32% of them were also using illicit drugs primarily opiates. They're treating their trauma. They're treating their trauma that nobody else even acknowledged existed. Because when we looked at those numbers of those who reported that to the police only 8% of the cases that were reported actually saw a conviction of the perpetrator and what we looked at the date of those who were assaulted over the age of 18 the primary race of those that were assaulting them were white men. This is a problem in the city of Seattle. Our women are being assaulted and they're not reporting. Why aren't they reporting lack of trust within the system and we see that in the results of only 8% of them actually seeing a conviction within this King County Court System. Why would they report? What we did find is those who did tell someone about their assault at the primary person they were talking to her family and friends and we know this to be true amongst all women who experience sexual violence. Is that the primary person they to talk to his family and friends. How are we in this County preparing family and friends to talk with their loved ones who have been victims of sexual assault. And do you think some mainstream organization when approached by American Indian Alaska native communities are they prepared to talk about the ongoing trauma the results of colonization and when we look at the 148th native women 86% of them indicated that they experienced or have been affected by historical trauma submitted to find Historical trauma for you. It is defined as a cumulative massive. Impact on population just not one generation but ongoing so the things that my great-grandmother experienced are currently affecting me. So we ask them questions like do you feel a loss of land? I don't know how many of you at this table wake up every morning and feel a loss of the land of your people, but I do and I know that is unique to American Indian and Alaska native people. We ask them questions like did you or a member of your immediate family where you removed and put into the boarding school system? And we know particularly in this area Washington State and across the country, but there was a time in this government's history where they took our native children not because our families could not provide for them. And in fact, they took them because our families were providing too much for them. They were providing too much love and support and culture and connection to family to tribe to land to people they took them because that connection and the government size could not continue because they needed as they said this was actually a motto from the individual who first started these boarding schools by the name of Richard Pratt. His model was kill the Indian and save the man and the intention of the school's was the last once in the shutdown until the late 1990s was to take our culture to cut our hair to remove our language and to disconnect us from each other and from our culture with the intention of assimilating us into mainstream Society where we would just be molded Into The Purge. White man, they weren't even trying to hold us into the perfect white woman. 86% of these women who participate in this study have been affected by historical trauma and we think about the need to invest in in to ensure that are culturally a tune care such as a Seattle Indian Health Board and other organizations like the Chief Seattle Club United Indians of all tribes, not really and I could just keep naming the names is that we are the ones who know how to serve our people We know cuz we've experienced this exact kind of colonialism. I've experienced this exact kind of sexual violence. And in fact the sexual violence that was perpetrated against me which happened in Alaska as a result of the barriers of what exists between the federal government and tribal lands. I never saw what anybody would see as Justice because nobody cared about a little Indian girl that had been repeatedly raped. And I knew it and my family knew it. And to this day my community knows it because I am just one of a very few stories. This was on the front page of the Seattle Times in August of 2018. And after that I was inundated on every social media platform that I have and including my email address. I'm not sure how everybody got that with hundreds and hundreds and hundreds. I cannot even tell you the number of messages from native women across the country who all told me their stories of sexual assault. What was really surprising to me was lying down in the bottom. And almost every single one and they said I just wanted to tell somebody who would understand. We all want to tell somebody who will understand why hasn't anybody been listening and we know that we live in a culture that is blames us for our sexual assaults that judges what clothes we wore what street we were on what we did for work. I'm here to tell you that me being native is not a risk factor. I'm not at risk because I'm needing I'm not trying to beat the odds and I don't want my children and my niece has to have to beat the odds and not be that next woman who is raped. Why aren't we changing the odds? We need to look beyond the individual symptoms. And what is the larger underlying issue that is allowing for this kind of violence to continue. And in this city. We have an epidemic of sexual violence. How are we going to address this? How are we going to ensure that these voices these stories are honoured I want to I did a lot of interviews during this time. We release his report and I had a one reporter specifically who in the Seattle Times article. My sister Colleen echo-hawk who's the executive director of the Chief Seattle Club? One of the things she's quoted in that article and saying is that at the very least they have one rape a week reported at the Chief Seattle Club every week and we're staying at least one. So many weeks there are more. I was surprised by the lack of outcry from this community as a whole. When we saw the front page of Seattle Times that there is at least one rape we can just one organization being reported and I shared this with that reporter and I thought you know, I go to I go to LA Fitness. I pay my $20. I got a discount for a year, even though what is it my LA Fitness, which is in Seattle. What is that staff was hearing once a week, at least one of their members at least one of them was raped every single week before coming to LA Fitness. The news crews would be there. The police would be there. There would be a big public outcry. I was sharing this with this reporter and she looked at me and she told me she said well, you know, I don't think you can make that comparison because at LA Fitness they pay and I sat there and we talked about personally impacting. I had just told her I was a victim of sexual violence and when we think about the callousness that we experience as women as women of color and is even more marginalized American Indians and Alaska natives who are homeless and being sexually assaulted on land where a thousand years ago that never would have happened. But yet it went back to the economics of it cuz I paid $20 at LA Fitness. So, you know, you're worthy not to be raped. But all those homeless women who everyday going to the Chief Seattle club to go to the bathroom and take a shower and to contact their relatives to see our nurse when the Seattle Indian Health Board to get that and they deserve to walk into that organization every single day and not have been raped 24 hours before. The conversation in the city has to change and that's just my interactions with media. This has been something since the release of this report that I have been quite surprised by in the work that I've done is that I have actually gotten more compassion when I talk about heart disease then when I talk about sexual violence. One of the things that we've seen and I know that there are members of the council who sit on this is the King County Council has recently created a subgroup for the Board of Health that is specifically addressing missing and murdered indigenous women and sexual violence. And I'm one of the co-chairs of that because we are specifically going to take this on it is a direct result of institutional and structural an individual level racism that makes sexual violence against indigenous women and other women of color in a sense. Okay? Because if you're not Prosecuting it if you're not addressing it if you are not mobilizing Community for it you are complicit in the sexual violence that continues So I'm very thankful to see the King County Board of Health take this on as an issue over the next year and expect to see some things come out of that. We have an incredible group of people. It has to be done and we have to shift and change this narrative. Very often people keep asking me what what is this report? The first one you did have to do with missing and murdered indigenous women. The reason we started this and this was the first of our Series in the second report was are missing and murdered indigenous women and girls is that we wanted to look at one city what is happening? And how are native women being affected by violence there? And if we can be sexually assaulted in the streets if we can never see Justice within the King County Justice systems if we've been affected by historical trauma, and that is ongoing and continuing if we can see these behavioral health issues as a result of this trauma. What else is happening? It was then that we release the next report in November of 2018 and I want to start with a statistic from the CDC the Centers for Disease Control that murder is a 3 third leading cause of death among American Indian Alaska native women. I actually think personally I believe the statistic is wrong and I'll tell you why the data isn't being captured for what data there is currently available. We know that murder is the third leading cause of death death for All American Indian and Alaska native women. I believe personally, that is number one. Because nobody's Gathering the information. Nobody really knows except for our communities because this ongoing violence didn't start again 10 years ago. It started 500 years ago and I can tell you his storical stories to stories from two weeks ago that are so parallel and what happened that it is incredible that it is still continuing in my eyes. We have an epidemic of murder and we have an epidemic of our women going missing and the sexual violence report as we showed. It's so invisible nobody's listened and up until this point very few. People have even cared outside of our community. our report Was titled missing and murdered indigenous women and girls is available on our website UHA. Org. I believe all of you have a copy of it and we did this report for one reason and one reason only Are women's voices deserve to be heard? This report was led by annita Lucchesi who is working with us at that time as a fellow and she had been doing incredible work both in the United States. And Canada created had created the only database of missing and murdered indigenous women and girls in North America the only one and it was done by that time. She's a doctoral student buy a doctoral student who wasn't getting paid. I'm at that time. I reached out to her because I wanted us to be able to support her work. And again, we have been hearing cries from across our community that missing and murdered indigenous women and girls was happening and in fact over my years and working with tribal leadership and sitting in on listening sessions between the Department of Justice different agencies of the federal government. I would see tribal leader after tribal leader get up and say our women are going missing and are being murdered. What are you going to do about it? Why are you not working with us? Why haven't we seen any information? Why isn't this being acknowledged? And what are the answers that they heard? You know, it's going to cost us too much money. We meet allocations from Congress in order to do a really good look you have one or two or three stories, but the data shows us that it's actually not a problem because in our data, it doesn't say that there's very many who have gone missing and murdered we heard tribal leadership being told it's your problem is happening on your reservations. This is an issue of your people. Year after year. Decade after decade are tribal leadership has called for something to be done. With the work that Anita was doing we had the opportunity as the urban Indian Health Institute. And again, I am so thankful for the support of our CEO Ester Lucero the entire executive leadership team in our board who supported us and saying you know, what now is the time? We're not going to wait anymore. I'm not waiting for money from the federal government. We are going to take the steps ourselves. So we started this project 100% unfunded and we ended this project 100% unfunded and in fact the $20,000 that paid for this what is being called a groundbreaking report that has been used to shape Federal legislation and legislation were the 16 States across the United States was actually fees that my team and I charge for whether it be speaking our services here in there. That's how we paid for it. We didn't need an allocation of Congress because again, the indications are they didn't do it because the money wasn't there they didn't do it because they didn't care nor were they going to be held accountable for not caring? So they just didn't do it. We decided we would do it in partnership with Anita and what we found is we submitted public records request to 71 cities across the United States 70. I'm sorry and then the 71st one was to the state of Alaska as a whole because we recognize that Alaska has from what we estimate some of the highest numbers and if when we get the date of that were looking for it is possible that Alaska will be the epicenter of missing and murdered indigenous women in North America is so we also got data for we're looking for data from the state of Alaska. We submitted a request including to Seattle and two other states are other cities here including Tacoma in Spokane. And also in these other cities we see cities that we identify to get asked all the time. Why didn't you do every city in United States? We're unfunded and these are cities in which we provide technical assistance and other services to as the urban Indian Health Institute. We know in these areas are high populations of Urban dwelling American Indians and Alaska Natives and what we found is what I wanted to be able to do originally was to establish a baseline to say hey, this is what's happening nationally in these cities once we receive the data. Over the course of the year what we realize is that I can't tell you what's happening nationally because the data is so bad. And in fact the 506 cases that we found of missing and murdered indigenous women across the country is such a gross under count. I can't even estimate on how bad those numbers are in terms of not truly representing. Are these numbers true 100% Are they in undercount? Yes. Personally, I think it's triple quadruple. If not more that we were unable to capture. And in fact, when we look at the numbers that we found we had a hundred twenty-eight we're cases of missing indigenous women 280 were cases of murder native women in 98 were in an unknown status. And that means we weren't quite able to tell what had happened with those specific cases at this time. However, when we got this information what we experienced was what are people always experience in working within bureaucracies and governments, we were stopped by people who simply did not respond to a public records request with puts them out of federal compliance. They did not comply with public records request at all. We had other ones who did comply. However, they wanted to charge us a bunch of money in order to access the data if I had had $4,000 more I would have had data from six more cities. I didn't have $4,000 more. So the data and that it should be public information was not accessible as a result of the fees that were charged in order for us to access that data. We came acrossed police departments who said you know, what we can't actually differentiate because we don't capture the race and ethnicity of American Indians and Alaska Natives and the fact we found one city like that in Santa Fe, New Mexico. Primary populations of minority populations, there are Hispanic and Latino and American Indian Alaska native and they're not capturing the race or ethnicity. Why would they not do that? That is when again we talked about the institutional structural racism that exist. If you are not accounting for the data, if you're not capturing and information, you are able to effectively hide it and you are not held accountable to it and addition there were other cities were there actually defaulting and their data to White if American Indian or Alaska native was not captured race is not a default. I'm not sure what kind of programmer or what city made that decision or why they made that decision. It's in our report if you want to look at the city's but Fargo North Dakota is one of them. right next to Major tribal populations when we look at white as a default as that is the whitewashing of America that again you hide what is happening and to me it is an absolute illustration of why and how white supremacy is still playing out in our communities because we are not defaulted into white. We should never be defaulted into white but yet it is happening across this country another example of how and why we have to address the systems in the structures in order to break down these barriers. We also found that not everybody was entry and race and ethnicity in their Law Enforcement Officers weren't being held accountable to ensuring their catching race and ethnicity. I know you've all seen I know there in like Walmart and other places we get these amber alerts on our phones and one of the descriptors are the race and ethnicity of individuals who got missing. Why are they not giving that same descriptor for everybody? How do we find our people when we don't even know from whom they come? And yet we know it's happening. The invisible 153 and our report was 153 cases that were not accounted for in the public records request in the data that these Police Department sent to us. This number is shocking 153. So where did we find these from the families? from the community from social media where they had put up a missing persons notice when the police wouldn't take it because they said oh your daughter runs away. You don't wait for a week 2 weeks 3 weeks 4 weeks. Maybe we'll take it then. Different murders that have Romaine cold cases that nobody has ever bothered to look at again. And in fact many of the police didn't have in their in their systems. The invisible hundred and fifty-three are a number of native women to a racially misclassified within the data that we knew were Native. But didn't come from police departments like the Seattle Police Department and I'll tell you one case of that specifically in a minute. But yet the stories are here and we honor them despite them not being in that data. We honor them as those communities as those loved ones as a hurt and a loss to their community. For mothers who weep for them who children who cry for them? They deserve to be represented and more data. They deserve to be represented by those who have been entrusted to protect and to serve them. Top 10 10 cities with highest number of missing and murdered indigenous women again. We did not get information from all of the cities. And I know that many of those cities information is wrong. However, I will tell you that when we look at the high number 45 for Seattle. We know that those 45 are missing or murdered in Seattle the number we actually received when we got our data back from the Seattle Police Department was 33, and I know that they probably see that there is a discrepancy there and they're absolutely is a discrepancy there. We do know that some of the data that we did not receive is because every direct result of racial Ms. Classification and the fact that they are listed as white women within the data or they're listed as other races, but we know that they are American Indian or Alaska native. I also know as a result of that racial mix classification that Seattle has more than 45 Absolutely has more than 45 and in fact, every one of these cities listed have more again. This is absolutely a gross undercount. We have to look at the also listed on here is Tacoma Washington, and we know that many of our people are going back and forth and that some of us live and work in many different places. Me being native should not be a risk factor in a city that I'm in. I shouldn't be more at risk because I'm native. How are we going to be not saying beat the odds but rather change them? Washington State ranked number 2 and the top 10 states with the highest number of missing and murdered indigenous women cases. When we look at this, we do know that we have seen some state-level legislation that is passed in the last two sessions led by representative mossberger and have seen incredible leadership from the tribal communities both urban and rural meeting with the state of Washington and pushing for accountability in the fact that we are number two for missing and murdered indigenous women. however Those efforts and we saw a report released on Friday from the Washington State Patrol is a result of that very first, in fact, it's on the front page of Seattle Times today for that first legislation that was passed at this is a picture that came from the Seattle Times in an article that was done on Nicole Westbrook. And the reason I want to tell you the story is because it was detailed in the Seattle Times in multiple different articles and speaks to the issues that we are experiencing as indigenous people who are calling for justice. Nicole. Westbrook was killed in 2012 in Pioneer Square. She was shot while coming back from an event with her boyfriend. She only lived here for a couple of weeks and she had come here according to the article or family shared that you come here to Seattle go to culinary school. She was enrolled they had already bought her all of the supplies and she'd come here to make a better life for her family for her children for her community. She's only been here a couple of weeks when she was the victim of random gun violence in downtown Seattle when this happened there was lots of articles that were done. Only Seattle Times and father Outlets news stories done police interviewed her family came from the Navajo Nation. She was at the name woman and she was so loved and I read this one article that the Seattle Times has written an inn at her mother talks about how you know, she wasn't killed immediately. They actually were able to take her to Harborview where she was alive and therefore her family to come and say goodbye before she died and her in that article her mother talks about how she washed and braided her hair. And I think about that. As a native woman who understands what that means. And in fact, one of the most amazing memories I have of my sons is braiding their hair. Because for many of our communities are here holding me it different meaning and as mothers we care for our children in that way. And I know as it as a Pioneer Woman, it is my responsibility to take care of my children and I remember sitting down in parting my son's hair and taking those three pieces and telling him who he is and Whispering those prayers and singing those songs as I braided his hair and I told him who he was. And I think about that mother. Who did this for her daughter, Nicole Westbrook? She braided her hair. And then she buried her daughter. Nicole is one of the ones that we did name in the report. We did not name very many except for those that have received large media Outlet. We did not want to cause any harm to the family or to the cases. And when the report came out in November of 2018 a reporter from the Seattle Times spoke to a sergeant in Seattle Police Department and ask them to verify some of the cases. This was one of them when that Sergeant pulled her up in that data. And again her family came from the Navajo Nation articles everywhere talking about her being an indigenous person it talk to the native people who stood and held her in Memorial in Pioneer Square and sang those songs and recognized that she fell on indigenous land. In the data from the Seattle Police Department. She's listed as a white woman. In fact, I actually hoped after that article came out that I hear from SPD cuz I don't know if that's been corrected. Is she still held in the wrong story? Is she listed as a white woman and SPD data today? I don't know. But I think it's likely that she is. Washington State Patrol For the first piece of that legislation that that was supposed to happen the Statewide with Washington State. The intention of that legislation was to establish. What is the problem to hold Community meetings and to conduct a data analysis on missing native women in Washington state I participated in it went to several meetings as did many of my team and I listened again to tribal leaders tell stories demand Justice. This report came out on Friday. And I managed to find a copy of it. It's really buried in the Washington State Patrol is actually a difficult to find the actual report itself. But we are seeing lots of news reports where people are, you know, applauding innocence and padding the state on its back and saying oh you pulled out the data that says there are 56 native women missing and Washington State a majority of them from Yakima and from King County. Where the highest numbers. What that report does not say is that there is rampant Miss classification in that number again is a gross and under count. The report itself is basically meeting notes from 10 Community meetings with no meaningful analysis done again as a Storyteller or as you know trained in both Western and Indigenous methodologies of conducting analyses and studies. This is not a study. This is publishing meeting notes from 10 Community meetings where our community did share what needs to be done the recommendations that are made. They are to begin collaborations with tribal governments. Well as and I'm sure counseling than words can tell you that's already a mandate through tribal treaty law is that meaningful government-to-government relationships and consultations with tribal entities. Basically the report tells us everything. We already knew. I'm tired of getting handed the crumbs. This is not a check box. This is not a we went and listened. This is a Time for Action. And I had expected to see some kind of action to be able to be taken from that report and there is none. the only thing that has happened is legislation that's already passed and that is to establish to Liaisons and one in the western side of the state and one on the east to Liaison is not the answer. Two Liaisons is a beginning. Where is the accountability to actually do a report? That is Meaningful data analysis is not saying there's 56. That is not an analysis. I always think about my accountability to my funders whether they be private or federal is I am held to a certain standard. I am going to hold the state of Washington to the same standard. They will be accountable. To do more than to give me some meeting minutes and to say will give you two Liaisons and we'll establish relationships. We have to do more now is the time for action. We are not a checkbox. I'm not going to be crumbs at the bottom of the table. If we allow this to be invisible again, we are all complicit in the violence against indigenous women and we will treat the symptoms the homelessness the substance misuse the opiate crisis. But until we actually address the systems that will not change and here we see a family that Mourns. A mother that great at her daughter's hair who wanted to keep braiding her daughter's hair. And that is all we want is for the lives of our community members to be valued. And we will sing for them. We will pray for them and we will fight for them and all of our fierceness because when I think about native women We are Generations who have survived in a time when we were supposed to be eliminated. If that genocide had worked I would not be here. I am a tangible manifestation of my ancestors resiliency, and we all are Somebody asked me what how hard is it to see all these native women who are victims? Now I will tell you I am not a victim. We are Fierce Warriors. Who win? They wouldn't let us sing our songs we whispered them. When they wouldn't let us stay in our land, we took handfuls of dirt and are seeds with us. We are Fierce. We are strong. And we refuse to be complicit in the violence against us The Advocates the Grassroots those who have marched those who have stood Memorial. Those like Patty white foot of the Yakama Nation. Of those other individuals who have fought for so long we stand here on their shoulders in their footsteps because they have been fighting for this for many many years. We did these reports not because my community need to know we did this report because you needed to know We did this report. So now nobody can ever say to us. Will you don't have the data? This is a tool. This is an arrow. This Is Us going to battle Because we will not let this violent continue to share one more story and then pass it on to a mine credible team here and it had to do with the day to receive from Seattle Police Department. So I need to receive the first initial data set and then we got another one a couple weeks later on like what is going on? Why did we just get to completely day this different data sets from the Seattle Police Department and that is because a representative from SPD told us that the homicide unit found that in in the data, which is how they were sorting the data to identify whether or not they were Native American that it was being used up until the early 80s by the Seattle Police Department as both recognizing in for negro in the data and in for Native American, so they were effectively hiding what was happening to both African American women and two Native American women and in fact from that data from the early 80s back I can't Tell you what was happening because we don't know we can't tell and also the word negro has not been used in modern data collection since the end of the Civil Rights movement in the early 1970s. So again as we look at the impact of institutional structural racism and cities like Seattle, here's one of the ways it was playing out. Is that why weren't we doing? What my at that time modern data collection would have been to ensure that that word was not using it said African-American was used. So these were some of the unique things that this happened specifically in Seattle. I didn't hear that from any of the other cities. We have work to do. We have action to take and in fact as the Seattle Indian Health Board. We have been doing that and we have been working at both the local the county as I talk about the King County Board of Health the state and also on the federal level to look at policy legislation to ensure that we are working with our communities and getting the information that they need to ensure the safety of our women are girls because they are our matriarchs they are our future and so I'm going to pass this on to Aaron Sparks. You can tell you a little bit about what's been going on with the policy and legislative piece. Thank you very well. So I do want to give a little piece of this if I'm going to get skip skip around on the scale piece. I must start at the state level and right now Abigail mentioned 16 states that mass of the missing and murdered indigenous women and girls movement the epidemic or the movement to recognize it has manifested itself in a lot of different ways. Unfortunately, a lot of them is not necessarily in the form of legislative teeth when Ethan can actually happen or money has been allocated a lot of the Proclamation stating that it missing and murdered. Women girls is a thing not to do something about it. So she mentioned 16 States but instead of actually drafted bills and introduce them into their legislature is only 10 states with 19 bills and at the moment only six of those bills in five states that passed us being one of them two of them being in our state. So what we're trying to do is get to the point where we're not just saying we understand that there is a missing and murdered indigenous women and girls epidemic we're saying there has to be something to be done about it. And which is why we brought the report by the highway patrol right now. So at the federal level I do want to talk about there were three pieces of legislation both in the house in the Senate and none of which have passed we have Savanna's act which is looking at the data collection reporting standards that we have throughout the country increasing tribal sovereignty autonomy. So they can reach into the data collection sets and also Implement better standards to be able to report and collects data DC lobbying as well as judge gembic. So that passed the Senate but not the house. Are you going to address the violence against women act as well? Absolutely know that guy's neck is also there it is. Not past. It's actually expired at the moment. So all funds are expired funds. We don't know when that's going to expire. The funds are still being released but we have no idea what the end date is on that yet, dad that we had some interesting Congressional disagreements that had nothing to do with violence against women and women in Indian country where the main defendant was a white man, but it came down to jurisdiction issues in the elephant case. Basically that people who are not a member of the tribe felt that they should not be in the criminal justice system of a Sovereign Nation, even though they were defendant and had perpetrated the crime against the native woman within the boundaries of the reservation. So it actually came down to a political argument not how are we not addressing the native women are being raped and murdered in killed and when we have a defendant that is a white male, even though we could kick it over to the feds the feds don't descend as they declined it. So that's what it came down. And I was so so disheartened to see when we are in February that Because there was no actual area of jurisdiction for them to work with because if they were Caucasian perpetrator on Indian land they could say that you cannot hold me here. I have nothing to do with Indian country and that was upheld in a lot of areas because it was just so fuzzy all around the place and value are there is one of the reasons why I was held up is because you could be prosecuted extending tribal powers in order to prosecute on Indian lands non-indian people. There's also other pieces like the boyfriend loophole Otis have to do with that toxic masculinity piece where they're saying we're going to protect the mail on this aspect and that's why it's been held up. We're not seeing it introduced. We see it introduced in both Chambers at the federal level, but I don't think it's going to pass if anything it will pass the house but not necessarily the scented if I could just add one more fan cuz I think it's important in contact specially for the not just for the north. But for the lawyer's here is that when we another which is in a proud moment in the States history is what's holding that up in the discussion is the Oliphant case that came out in the 70s in this state that set the standard that tribes could not prosecute. Not Indians are not members. That is a Durango that came after that. But but the main issue there was besides what all that was about. The main issue was tribes one of the ability to prosecute non-members for perpetuating and basically harming our women and we are still at that is still good law today. We cannot do that. That's right. It's completely unfortunate that's being able to address these things at the federal level is falling on deaf ears. Unfortunately, I do want to point that we're talking about those three pieces of federal legislation does a third one just studying Indian crisis act. Reviewing law enforcement at the federal level on why we got here and where we can go that's literally the name of the guy acting the scented. One of the things that we've noticed is that the urban community is completely left out 71% of US based on the 2010 census live in urban areas. If you look at different forms of analysis, it's up to 74% of us here in the state of Washington or living in urban areas. That's almost three out of every four of us yet when you're looking at these pieces of legislation. Strengthen tribal sovereignty autonomy would we fully support we endorsed the reintroduction of the Santa Savanna that they're not paying attention to and they're not being respectful towards the urban community at this point. So that's what we're here to talk about as far as legislation. The city of Seattle has an extremely unique opportunity right now to learn from the failure of the rest of the country to actually addressed this in good legislation to say that word of wisdom teeth behind us. We're going to look at our justice system. We're going to look at law enforcement and we're going to hold transparency and accountability at the highest possible level and we say that we need including our entire native Community are tribal Partners as well as our urban community. So we do that in four different ways. The first one is referencing Urban Indian communities and date in legislative finding in the first place. We were talking about these things that always falls on tribal peoples. And that's true. We are tribal peoples we come from Saavn authorities. That's why the tribe go but we're living in urban areas and a lot there is no in the Indian land in the city of Seattle. Although we are on Indian land, but the way that it works is farther. Federal government goes the city of Seattle goes the state of Washington goes this is not Indian land. So what we're trying to say is this is Indian Land make sure you pay attention to our entire Community. The other piece of that is adding the urban confer policy to this. So no matter where we are a lot of times we talked about the fellow trust responsibility in the fact that you have a tribal consultation and that is an extremely important thing. But the fact is we have a health authority is urban organizations through the Indian Healthcare Improvement act for an urban confer and that's all we're asking for we ask for that we had to get for that at the federal level. We're also asking for that at the local level and we are in urban area. So if anything does happen in Seattle and especially knowing that you're there chair was that we're going to get to that place. But again, we can be that blueprint for the rest of the country to do this, right and include our entire Community are let me ask you a quick question. You know, there's been all this Fanfare I heard it on. NPR in everywhere else at AG Ferguson is now saying well when I decide to do something, I'll check with the tribes. I wanted to say, excuse me, that's been the law and consultation for well before Prince President Clinton in the executive orders on government-to-government consultation is it said I don't I don't know why there was such a big fan fair in a big pat on the back because the tribes to successfully sued and made it clear in our resources and our people that this is Indian country and we are not restricted to the four corners of a reservation and neither are our rights. So I want to get your opinion about that. If is that I don't know if that's a if it's Aurora Mo man or that that's so I interpreted. I'm glad that people are saying this in a very very I would say this is a very National thing that he was trying to push out there. But the fact is the state of Washington has a centennial Accord. It's already written into that the executive of the state of Washington whole consultation and uphold the federal trust with the tribal people in the state. So that already exists you're right. I had to be announced again. I'm not quite sure we have the Centennial Court meeting every year. So I'm not going to comment too much further on that one. But again it already exists and we already think the state of Washington for uphold the match. And yes, we do enjoy meeting with the governor and the all the secretaries when we go to Centennial Court always support and strengthen tribal sovereignty never want to touch resources that go into tribal communities and I think that a lot of the work around the Tribal Law and Order act and even some of the Volvo allocations all those things are fantastic because we do need that work in Indian Country writing in archival communities and what we are trying to call attention to is that we have needs in urban environments as well. And we have an opportunity here with the city of Seattle to do this differently right to not just generate another block brockham Proclamation, but to actually generate legislation that has resources and To it so that we can create to change it. So we're getting it so we can stay on the jurisdictional challenges or we can stay on sovereignty and all of that. We are trying to expand this to meet the needs of All American Indian Alaska native people regardless where you live the right now, we have an urban confirmed but it only lives within the IHS system. That's what Aaron is sharing today is that we're asking government systems like yours to take a stand and when it comes to issues that affect our health and our well-being and our lives in this situation Our Lives. That you give us an opportunity to have a voice and that's what nerve and control it allow us to do is that like a new term of art that came out of the federal stuff. It's in a HS. So, iihs created tribal consultation and tribal consultation lives in all government systems. And then I just created an urban confer. So that there that Urban could be included in the conversation. We're one of the few areas in the federal trust where the authority to advocate for a native people outside of tribal lands exist. So in the area of Health, we have that under the Indian healthy improve neck where we can we are a health authority for native people and we're allowed at that table if you're looking for a mechanism right now, so lucky that we have his tail here and some other members from the Callas Nation who have an opportunity to I'm not only have the brick and mortar in a building but be able to provide all those services for Native folks and there's and their spouses and children even though they're not per se on the tribal trust law. End of the Cowlitz people you think yours truly for that that lawsuit. This place is urban Indian Health programs like us we exist because not everybody can do that. That is still an overhead cost try to get some IHS facilities money. You're probably going to pass away before anything like that ever happens. It's just not something that happened. I'm so done with the one we're talking about the funding piece. I do want to go into the soil it more like an opportunity for the city of Seattle as we're looking at this. We need to carve out more talking about the urban pieces. And again, we're talking about those Federal pieces were asking for carve-outs when everybody's going to the state or the county or the city and waiting for the FED to do that is something that's going to take forever. And again that hears this blueprint a spec we can beat a beacon for the rest of the country where the Seattle City Seattle can just say, we're going to do this. We're going to recognize urban community. We're going to make sure that they're included in this morning to show you how it's done, right? To the state and then into accounting systems and then they are tasked with serving our people and what do they do? They knock on my office door and they say hey Esther, how can we serve your people better? The money has been spent a my answer is you don't have to wear doing it. Just fine. Why are those resources going to you when they should be going. Do you see what I'm saying? This is something that given our situation in Seattle or we have city and county working very closely with one another that from an administrative perspective. You can make changes. I think one of the incredible things that came out of the Canadian National Aquarium missing and murdered indigenous women and girls is that the commission very specifically called it a genocide. I know they did very specifically and in fact there they haven't gotten their prime minister to say it. He's avoiding it several members of parliament have also said it's not true so that it's one of those issues again where people don't want to use the word that recognizes that they have read. Possibility and that it is ongoing. I think that for the commission to put to do that and I again I've been doing talking to a lot of people and I always say it's a genocide. I think I've seen it printed twice because again people are even afraid to print in their newspapers. What would it look like to do more than then for the city of Seattle to say something like that that we recognize that there is an ongoing genocide against missing and murdered indigenous women girls in the city of Seattle and as such we are going to take these actions are going to work with the urban Indian Health Institute to correct the racial Miss classification on all SPM. You know, I'm throwing everything I can let you have a speedy data to properly represent what has been going on in the city of Seattle and to also correct those African American women who deserve to be recognized in that data. Also, how are we going to partner to ensure that officers are trained correctly on capturing race and ethnicity that when an article comes out in the Seattle Times that says even race Play misclassifying that you reach out to the organization who brought that up. You know, how do we build those Partnerships in relationships? And how do we do something that has teeth cuz like Esther said a proclamation is great, but is it just paper? Because if it is I don't have time for it anymore or my people are dying I get emails and I talked to people every single day who have lost their loved ones who are experiencing trauma. They should never experienced and our responsibility to them is to take action now and again, I am appreciative of what the King County Board of Health is doing because nobody else is doing that and the country addressing sexual violence and missing and murdered indigenous women by looking at the institution on structural racism that allows for this violence continued but what else can we do? That's just the beginning now is our time and I think we want to avoid the situation that came out with a States report from the highway patrol because that happened without meaningful consultation. They came to us a Beyond are actually at the meeting together and they didn't get anything that we said we told her exactly what was going to happen. If they didn't work with us from a community-led standpoint. That's what actually has to happen Abigail created the methodologies that are going to make the successful and they ignored all of those in this report their only miss. Persons arrested for that meaning for consultation when they say happened something has to come of this and then those carve out to make sure that our tribal epidemiology centers that created this methodology are the people who are leading this because when it comes to Indian Country trying to fix issues that are in there it's not going to happen with somebody who is from outside of engine country. I should do this governance has to happen with us. That's where you find success when it happens to us. That's when you find failure and that's what we want to point out in the very last thing that we want to say is no matter what you're doing were talking about policy when it comes to Urban American Indians and Alaska natives that we do have definitions at the federal level through matter where you write them. If we are going to take them author that state system you can put in the u.s. Code to make sure that we're there Urban Indian organizations and tribal epidemiology centers exist on our website at the Seattle Indian Health Board on our government Affairs, please thank you very much like to turn over to my colleagues if they have any questions or concerns ready. They want to follow up with the procedures before I make any comment. Thank you. I don't have any questions but I just wanted to express my sincere gratitude to all of you for the work that you've been doing in this space and their multiple times when you all were speaking in particular when you're sharing some of the stories of some of the women in the families impacted there really a work created partner motion for me. And and I just I just want to again echo my gratitude to you all for this hard hard hard work that is a re-traumatizing just by virtue of having to do it. And so I really appreciate your willingness to take this so seriously, cuz I know it's I know that it's it's it's something that has existed for a long time in your community. And I think it's really important for us to create spaces in a space like this is incredibly colonized. To have this kind of conversation that is real and raw and sincere and I want to express my gratitude to a chair Juarez for making space and dedicating the entire meeting time to to have a conversation about this. It's been getting a lot of attention from mainstream media. But of course, we all know that this has been on the indigenous folks Minds for a very very long time. So I'm really grateful for an opportunity to share the space and have an opportunity to learn more and to listen and to really work in Partnership and collaboration on figuring out how Seattle can leave the way here. So I know we are in good hands with a chair Juarez in terms of advancing an agenda for that will hopefully show the way too many others and so and I'm originally from Yakima County and so grown up around On my way. And and I just I really appreciate the amount of commonality that that as a Latin next woman. I share with a lot of indigenous communities and and it's and it's personal right? It's it's you can feel the heaviness of the conversation and the realities of the circumstances of repeated trauma and just not being seen and there are deep disturbing reasons for that. And so I really appreciate you calling about and I'm giving us an opportunity to do something about it. So thank you if I met at before I let cuz our bag Chicago that it's wonderful to have Casa Maria Gonzales on this committee because she also chairs of Public Safety and you've seen the great work that she's done while you are doing your presentation. She did lean into me and she said something that is and I know she she understood it. Immediately. This is goes beyond just missing murdered indigenous women. This is about genocide that's been going on for $5 years. So there was a policy to kill our people are women in our children first. And so not only do we have the inside of somebody in the heart of somebody who believes in justice, but council member Gonzalez and councilmember badsha is the co-chair of Board of Health along with myself, but she's a co-chair Board of Health for your subcommittee councilman, cuz I was also was on that committee now it is now on the board of health with us, but you have the right people at the table that what you said and I'll stop in the moment cuz I want to other people talk before I wrap up that when we put our minds to actually doing some we will do it because that's the kind of badass women we are. Okay, I'll leave it at that. I gave her a bumper sticker recently that said she is badass. She didn't start over. This is really not easy for me. and it was pretty obvious sitting here with Juarez and Gonzalez and sawant and Moscato and Pacheco that I'm the only white woman, but that said the hurt that you just described just kills me and I have to acknowledge that the separation of the children from families. Are you experienced over the last hundred and fifty years and I can what what country is doing? We have an opportunity to raise what you're talkin about. fundraising here But to take the action that you're asking is for the solutions. Could you please not take my picture while I'm sitting here weeping? I really want to acknowledge and with the deepest respect, but you have raised and I know that you know Abigail how much I care for your sister calling and everything that we can do. For the Chief Seattle Club to be able to take the land that you have lost respect that it was the land that you've lived on for so many so many generations and then turn that into respectful action that is Meaningful to you and meaningful to all of us. I also want to acknowledge and say thank you that our police are here are Representatives or City attorney is here and their representatives in the fact that all of you stayed means a great deal to me. Is mayor's office here to I'm sorry, if whoever's here. I don't I don't see them, but I just really want to say thank you that we're all in this together. So your study is remarkable and like you said it was unfunded goodness knows the work that you put in on this. So I I really want to appreciate that. We're never going to see money from the federal government particularly with this potus45. So we've got to do it ourselves and I do want to acknowledge and appreciate the fact that the governor has a lot more to do, but the but they are at least saying the words room, so I'm going to be marching right next with my sister Miss more as I have such respect for you my dear and the fact that this very committee is named with indigenous people and Native Americans and that we care about this show. I just I was just in very respectful to thank you. Thank you, cuz we're back. So I think you would have cuss word for Jacob. I just want to thank you guys for I can be in this meeting together and just thank you for your bravery for speaking and speaking speaking your truth and speaking of sharing the stories of the individuals never contacted. It's not easy and I know just bringing this to light and the work that's been put in was not easy. And so I just want to recognize that and say, thank you. Thank you. And so I'm going to wrap up briefly and I think there's been a lot of them. I knew this was going to be a tough day to be really honest with you. I was kind of dreading it this morning and I did my prayers and then of course I got Texas from Colleen and you and pictures and making me feel better because as a victim of sexual assault and violence, I to know what that's like to be on a reservation to not be her. so I started this with a little bit of historical context about colonialism and historical trauma and what they have done to our people and I wasn't trying to be provocative or simplistic when I said our first president refer to our people as wild beasts in beasts of prey. There are still people today that refer to us is that so I want to make this commitment to you and that's why I'm glad that I have the strong women at this table. And of course you to able to keep you out. We we've had an opportunity to clean the game read through and I attempted to read as much as I could this summary of the Canadian report of us and just the executive summary is 117 pages, but it is phenomenal and when I kind of wanted you guys to Green Sheet when they call the call for justice. Those are those are actionable things that they're actually physically going to do. So we us our will be chained up legislation to work with you on what does this organs or legislation? Look like as we work with Pete Holmes the shopping City attorney. I've also had a really wonderful conversation more than one including this morning with tri-fest with SPD. Everyone has understands what you say now when you say decolonizing the data, And of course, it's important to us in our city. We don't want to have the reputation is the number one city that has the most missing murdered indigenous women and girls and certainly not be number two in the nation with that same title. So I just want to end on this note because I plan to have a few more follow-ups meetings and where we're going on the legislation to get things done before we leave on recess and we would have had what I was trying to do is and I know it's going to put Abigail on blast here Abigail has been traveling everywhere and taking this show on the road and it's been in States. I've run into in Washington DC along with judge Denver and Esther and we were running in and out of Senator Patty Murray's office in Center Kent was officer, but I saw your guys's Seattle to need more drum there and I took a picture of it. We're like, you know, all of all of us were in the hallway in February lobbying for Savannah Zack and for the reauthorization, Ebola The money so I want to share with you that we hope to tear up that legislation and having these labor indoors and who understand it that but having the Canadian report come out. I think it was a blessing cuz now I can physically look at it and say there's a lot of stuff here that we can do to I think the state law is important. I think it's a good step forward, but I need more than two Liaisons. I was thankful because as you we all know when we are moving these kind of civil rights movements forward, you don't get it all the first swoop. You know what I mean? When people chant what do we want? We want it now. So no one like, you know, the world doesn't work like that soon as we got to roll up our sleeves and just keep marching and that is what we have done as native people if we had bought into this historical trauma as you got hurt me so many times when I do speeches the other side of trauma is resiliency. And we have that that's why we're still here despite everything that we know that was done to our people. We're still physically here. So with that I wanna thank you. I know it wasn't easy. I want to thank my colleagues for showing up and being here. I know it was a little bit more emotionally charged then you don't normally we're not sitting here arguing about a doos and I Do's patches but not to say you're I'm glad that I have my community our community everyone's Community native communities in this committee because we are going to get this done. And so with that if there's anything else you want to say before we adjourn is there anything else you'd like to add? I just want to say one thing and I'm a Storyteller, tell you a story. I was actually when when I ran into you and DC I wish I had just at that time a native woman I had presented at something and she Not to me and she told me the story about how and her family all of the women that she had died in the past 20 years. They buried them all with bruises because they all had been victims of violence and she told me, you know, she's gotten used to doing that. That was just normal. And she said we cannot let this be normal anymore and she leaned into me and I remember it because her hair was down and you know this made basically should I cover my own face in her hair and is like breathing this story in this strength to me at the same time. She said we have to keep going we have to keep talking and what will happen is supposed to happen when it happens. It's the way I think about this meeting because I will say to the council woman has been asking for us to do this for a while and I've been traveling and my team has been traveling to is that this happened at the right time? Cuz that report just came out from Canada and the what was just released from Washington State Patrol, and we now have Other things for us to be able to use to push forward. So thank you for having this committee and for doing things in the right way in the right time and for us to allowed to not only breathe the story but to tell our truth and to recognize that this land not only remembers who we are, but it knows our name and it is holding our women or men and Oliver lgbtq non-binary folks together for the strength and resiliency of our community, and that is our action, and that is our resiliency. So thank you for this opportunity, and I know that there will be action cuz I feel it and I know it's the right thing in the right time moving forward. So thank you again for this place in this space. Thank you. Read anything else? Okay. Did you have something? All right. So with that everybody and we stand adjourned. Thank you guys.", "end_time": 6099.6}]}