{"format": "raw", "annotations": [], "confidence": 0.9297810330277397, "data": [{"start_time": 0, "text": "Healthcare, good afternoon, and thank you for being here on June 10th to June 10th 2019 city council meeting of this Full Sail set city council kind of order. I'm Richard on Friends of the council clerk. Please call the roll. O'Brien jco salon president Harrell, there's no objections of introduction and referral calendar will be adopted. Interjection, today's introduction of throw calendars adopted and similarly if there's no objection today's agenda will be adopted. A Change Is there if there are no checks in today's agenda is adopted the minutes of the May 28th and June 3rd 2019 special City Council meetings have been reviewed and if there's no objection the Mets will be signed. king of Jackson the miniature signed Presentations I'm not aware of any presentations this afternoon. So we'll move in a public comment. This time will take public comment on item items that appear on today's agenda the introduction referral calendar War Arts 2019 work program with what you sign of go for 2 minutes a piece and we'll start off with David Haynes followed by Mark Taylor Canfield and so we're going to try to put both microphones and play so, mr. Taylor canceled. If you don't mind you'll use this microphone up here and start making your way toward there. When is the proper time? Go ahead? You can tell it's reelection season for Democratic operatives of the Northwest co-opting trivial movements for media re-election favors and all the corrupt activists and organizers and political operatives of Seattle. Social welfare industry nonprofits. Are we going to set the clock for one moment more specific work with rock and roll forever stuck on drugs and alcohol acting like keeping Seattle run down to lapid deadly preserve is the only way to feel Seattle Forever Living in past. It would be a better to go. She a Shinto man to the developer to tear down and rebuild a modern 21st century Showbox, that would be a preservation of a music venue without the traffic driving by a twenty-first-century volumes like PTSD for all the kids hanging out there waiting to get inside and it would not preserve another. Dangering Lake crappie building that is totally unnecessary. If you have like a really wealthy developer, just, you know be forced by all that is on review and all the great pedestrian-friendly particular that you have 21st century Redevelopment and create a more accommodating 21st century Showbox, but make the developer do the whole thing that you guys design the whole thing, but preserving another old building and tries to on those cobblestones is too much to bear you guys give you something about that regardless. Thank you following marked to Canfield be Joan Singler in the middle on the middle Mike. Yes, sir. That be great Mark. Thanks. Hi, I might my name is Mark Taylor Canfield. I'm a musician and a journalist and I moved to Seattle because of the music scene here and because of places like the Showbox and some of you have heard part of the song but we have a new a verse for you today and it goes like this. Louisville today Yeah, we love the Showbox. You got to save the Showbox. Don't let them take that lady away. I've been going to the Showbox since the day I was born. Schubach I'm going to the show Who told you that? I'm down going to be in that lady. We got to save the Showbox Showbox related down. very good the following Jonah B, Eugenia Wu and where the organization that spearheaded the campaign to save the market and wish to convey are very strong support for the extension of us 6 months extension on the Pike Place Market historic district to include the Showbox. We believe that it is feasible and appropriate to seriously consider this expansion and to include historic properties including the Showbox. This concept deserves serious professional study and in-depth analysis. Neither of which appears to have been undertaken since he interim action was taken by the city council on August 13th. 2018 Friends of the market are eager to assist and support this effort our board of directors and membership include many individuals who possess in-depth knowledge regarding the history delineation regulation of a Pike Place Market historic district. We are very willing to contribute to a thorough study that will fully identify the feasibility and appropriateness of his expansion. Thank you. following Eugenio by Jane Davies on the middle Nike I'm actually Jane Davies. I'm going to speak with Eugenia that works out then following you two will be Elton Mason in the middle Mike battle. We are asking for the council to pass the amendment to Ordinance one to 5650 to provide for a six-month extension of the interim boundary expansion of the Pike Place Market historical district section 4 of the original ordinance describes a work plan to conduct a study to review the historic significance of the Showbox and study its relationship with the Pike Place Market as well as conduct a steeper review on the permanent expansion of historical district. Our understanding is that neither the study Northern C4 review has been completed. So it is appropriate and imperative that the council extend the intermix mansion in order to complete the commitments that were outlined in the original ordinance. Thank you. And Sue's the toad sounds of the city hired his is charged with looking at the historic significance of the Showbox as relation to the Pike Place Market. Just want to let you know if you I'm sure you already know but last week the Seattle landmarks preservation board unanimously nominated is a clear domination of the Showbox for the landmark. The designation hearing is set for July 17th. And we're confident with this clear domination. It will get designated. So we also I'm happy I contacted by the consultant as of last Friday and we'll be doing a stakeholder interview this Thursday and we look forward to meeting with him and talking to them more about the historic significance of the Showbox in relation to the market. And also I'm with us. All that the ties are the show box was originally built as a public market in 1917. Just Ten Years After Pike Place Market was a salad. 1907 so that connection is very clear. And so we just want to thank the city council for your time and efforts in this important issue, and we ask that you are past the suspension. Thanks. Thank you. Following. Mr. Mason bee Shannon Wells. Hello to record. My name is Alton Mason owner of the Washington State Trucking. The comments that I'm here to make is in regards to the Contracting with the city of Seattle contract to come out of f a s s. And whatnot the problems that I have occurred what happened to my farm and the I believe map to Vera and I'm watching this first handed there's millions and millions of our tax dollars being wasted millions. And I I know for a fact first-hand that this is going I'm not going to name any names out of a PLS and out of the Visions across the street, but you do have my contact information on the sign up. You have my email you have my phone number before this goes to the next fa else is made some decisions within my firm and I've done some Major damage to my friend. I lost my capacity. I have to sell over 30 trucks. I lost my office that was here in the city of Seattle. I mean, they've done some major major damage and some of the decision that they get made and in Contracting in regards to this inclusion plan with the with the contracts that are coming out of the city of Seattle. I have any way I can go on and on but I think you know where I'm going with this but I really hope to somebody reaches out to me before this goes to the next level. I'm mr. Mason. If you do have the time after the hearing today after conclude, I like to speak with you. If you do not I'll follow up with you based on your information. I'd love to chat with you after today's hearing to take its maybe an hour show up at the other time. Thank you, sir. Following Shannon will be from Ocoee Shannon will be Kim. Doyle I think Good afternoon. My name is Shannon Wells and I'm taking today on behalf of friends of the Showbox which is a Grassroots Community Coalition dedicated to saving the Showbox the friends of the Showbox strongly supports the six-month extension of the ordinance that places the venue in the Pike Place Market historic district. I do have a copy of the ordinance here and as historic Seattle just mentioned there is a work plan, as you know laid out in this ordinance and so our concern is that there are a number of studies that are listed here the historic significance of the theater the relationship between the theater in the market the super of you looking at historic district guidelines has been done to the city laid out a 10-month even start till now that leaves about a month for all of the work that was supposed to be done in 10 minutes to be done now, so we feel that it's rushed and that it won't be comprehensive and thorough and as Eugenia mention There was a unanimous vote last week to nominate the Showbox as a Historic Landmark. So I just want to reiterate that this is really important to the city and the community and so we just want a serious comprehensive analysis to take place. And that is why we are asking for the six-month extension. Thank you. Daniel Martin Hi, I'm Kim Doyle and I came here today to ask you to please vote for the extension since the city can complete a the mandated study. Thank you. Thank you. Good afternoon, my name is Daniel Martin. I'm privileged to serve as a president of a Seattle Pacific University Forest. I'd like to thank councilmember Bagshaw for your representation of district 7 you will be missed. I've appreciated your partnership and your leadership. Not only think about items within the district and the ways in which we can be a better neighborhood and better neighbors, but for broader Seattle as well as your approval number 15 is simply an extension of the conference a plan amendment that was approved in December. We've been partnering with the city since 1891 what this would allow for further conversations to be ongoing between University and concern Community citizens and the industrial base there as we think about the best possible use for this land for the benefit of also. Thank you so much. Thank you. Next to speakers or Dominic vischio Dominic and then we'll go to Ernie grunfeld grunfeld. Hi everyone. I'm dumb. I work at the Showbox. I'm asking you to please extend the ordinance so we can have a comprehensive study. We deserve please help us preserve. The heart of Seattle's thriving culture music and entertainment are integral to our city and our society. We have Showbox dearly want to continue providing that entertainment and enjoying ourselves at our line Mark home venue. Thank you. Thank you. Following Ernie is Carolyn and hi. My name is Ernie grunfeld. I'm a board member of friends of the market. I'd like to talk about some reasons why we think this is really important thing to consider the issue of adding the possibly adding Showbox to the Pike Place Market historical district first. It seems to me that the show box and its use as a cultural venue was way more compatible with the markets than a luxury high-rise would be on that side second. All that show Box is being considered for landmark status, that would not protect its use adding it to the historical district could preserve used for entertainment and third the Pike Place Market is potentially threatened by development all along 1st Avenue expanding historical district, perhaps including the show box and extending along 1st Avenue from Stuart to Union could protect the market from incompatible development. Thank you. Thank you. This isn't Caroline. I'm going to call out three speakers Doug Conrad Steve Gillespie and Christopher Knowles Doug Steven Christopher after Carolina in. Traxxas Caroline in and I'm a reason being for the music and for the cultural diversity that here in Seattle. I recently wrote an article and innocent words magazine and I also would like to quote the mayor. She has recently been quoted as saying in Seattle is thriving I feel that if we want to keep Seattle thriving we need to keep the doors to the Show Box open. We need to keep these doors open for our community our cultural diversity in the city that we pride ourselves upon. I think we need to put Community before profit this extension is needed. I believe that we are not only protecting the community and our culture also protecting the jobs of the people that work at the Showbox. Thank you. Hi, my name is Doug Conrad. I'm a citizen of the city and for the last three or four years. I've come to the Council on occasion and giving testimony with respect as important issues concerning housing affordability and homelessness. And I want to add my voice of support to the committee that just adopted the least supported the adoption of resolution 31887. That's the one that reads. It's a resolution adopting and approving an application for Surplus Federal property at Fort Lawton including Redevelopment plan. And it goes on I want to make three points. The first is one of the aspects of a plan that I like is that it contributes intentionally toward fair housing and I think that's a very important if you will double win both of the fair housing and for the development of affordable housing. I also want to congratulate both the council and several of its members for their strong support of housing affordability. I think it really matters. I think the Fort Lawton An example where I would hope the council in the city and HUD and habitat and the Catholic Housing Authority will push to move with all deliberate speed to get this done. My final report on point. Is that as you think about this when Halle and the mandatory housing affordability Levi was being developed. I thought that was a a very impressive document and an ambitious document it pointed out that even building 6000 housing units, which was the plan would only bent 30% of the need over the proposed deck a 20,000 units needed a plan for 6000. So this 238 units at Fort Lawton that are proposed three different sectors housing affordability low income housing vets included. It's just a it's an ambitious plan and a significant to say is it's like 2.4% the need and it's been in some sense depending on how you time 13 years in the making that property was if you will. Provided to the city for free and I don't gainsay the fact that it takes time to do these things right, but haven't given testimony in this issue at a office of housing meeting that they had up in the Fort Lawton area couple years ago. Thanks to you. I thought it'd be a done deal by now. Let's get it done, please. Thank you. Good afternoon, Steve Gillespie Foster pepper here on behalf of Seattle Pacific University. I'm excited to be part of a very packed agenda that is generated. A lot of Civic engagement. I'm here to talk about a few blocks along near the ship canal in North Queen Anne. We've been working on this text Amendment and I heard your approval. This is item 15. I want to thank you for taking it up. We've been working on it for several years. I think the council member bagshot. I first spoke about this and January 2017 and I as President Martin said this is implementing the comprehensive plan amendment that you're approved in in December of 2018 and it is not the end of the conversation. This is the beginning of a what will be a robust public conversation about the appropriate use of the land right adjacent to Seattle Pacific University anything that the university decides to propose is going to involve quite a bit of public process. From project-level permitting meetings of our advisory committee up all the way through a full major institution master plan, which all of you know is a very very robust years-long Community conversation that we are excited to have but this this phone is the first step that allows us to ask the question of what how this land should be used. So thank you very much for your support councilmember bagshot. Thank you very much for your service to district70.org to be a tough act to follow and thank you. Thank you. following Christopher B, Ernie Ashwood and Misha to do my My name is a Kristoff dolls. And I'm a Lifeline Seattle resident around here. There is no place like the Showbox is the absolutely best place acoustic acoustic lie and just let your beauty to see shows there's a good reason why basically everyone around here loves the Showbox and bands from all over the world in the country love the Show Box just in traveling wearing the shirt, you know, the last couple of months and stuff. I've had just a different venues around the country of had people ask me about that and basic about what's happening with it and they said that they simply can't let that happen. That's that's where we that's where we play. That's the best that's what would some place we look forward to or all around the country to to play footsie. And also just the fact that it would change the entire historical. The feel of the markets are we can't let that happen on this Market one of our most treasured spots in the city where we get all onward tours flock to I'm 2 or 1 to see beautiful historic buildings like the pike place like the Showbox want to go see shows at the Showbox and that's a lot of tourist Revenue coming in and we just can't afford to lose. One of the last two beacons in the arm are cities near long-standing title as the the city of Rock and that We just need that the proper time to do the other due diligence with with the study. So I strongly urge you to vote to extend the the study for another six months. And so make sure we we get the do the due diligence that we that we were promised and on that we get a fair shot. Thank you so much. Thank you. Good afternoon, everybody. Thank you guys so much for taking the time out to hear us. We really really appreciate it. My name is Ernie. I represent a band called the complex. I like the privilege of being able to play at the Showbox. I also work at the Showbox have a lot of ties into the Showbox. I'm not here to ask you guys to make a decision regarding the actual permanent extension. We're just asking for more time. Just based off of the concept of having an informed decision. It's been very very very clear from earlier testimony. Is that a lot of resources for information haven't really been tapped yet and the start of actually getting that information has just begun. So recently when the when the actual ordinance was passed way back in August, we need more time, so that way you guys can have the proper information to make an actual informed decision. That's the only thing we're really asking for today. Again. Thank you so much for your time. We appreciate you so much. Thank you. Thank you. following Mitsubishi Marva Smith Hi apologies to be redundant to this is something I said very similar last week to a few of you but it's time to say it again just for the benefit of those of you that we're not here. So I'm a name is Misha, local artists and have been a theater in venue employee in Seattle for close to twenty years now work at the Seattle opera or to Benaroya Hall Everett to 5th Avenue Theater. I also currently work at the Showbox SoDo my love for Seattle theater and venues is runs pretty deep and for a very long time. So I just wanted to say thank you for the continued efforts that you've made towards helping us to save the Showbox without this additional six months we could very well lose it and there's been countless theaters in this town that we've already lost the music box was built in the twenties that was demolished completely and I can give you countless other examples, but I bet you when you look at pictures of those theaters, you'll think to yourself. Gosh. I really wish this were still here. I really wish they were part of The downtown landscape, but unfortunately, there's just no bringing them back and the same goes for the Showbox. I know it seems like process to process, you know, another 6 months plus another 6 months going to do but it could be the difference between losing it and having it. So I urge you to make a decision towards leaning towards giving us an additional six months to work on it. Thank you. My name is Marvis to me and I'm here to ask you to postpone the vote for developing the last remaining contiguous parcel of Discovery Park, which is known as Fort Lawton. I'd like to paraphrase a statement by Phil vogelzang the friends of Discovery Park the park represents many decades of hard work and active his advocacy. We ask that all of you remain committed to the ideas at first put forth by the likes of Senator Henry Jackson Bernie white beer judge, Don Voorhees and Bob kildall. To create and protect this place that is free from the noise in the clamor of the city to provide its citizens a place of refuge and Solitude not only is a parcel adjacent to the park is also located within a few hundred feet of the riparian zone of Salmon Creek and Kiwanis Ravine where a small band of great blue herons have been living in nesting for literally thousands of years. They too are stakeholders in this decision, and we ask that you consider their fate. Also, I'd like to paraphrase the statement by Thatcher Bailey from the Seattle Parks Foundation as a city strives to meet its Equity commitments. We cannot regard access to Green Space and access to affordable housing as competing goals. Piecemeal Solutions such as surrendering finite Green Space can never be recovered. To create room for affordable housing would only lead to more serious problems down the road. Thank you. The last three speakers app sign up Rosalyn Rosalyn can Setter Marty Forester Forester Roseland in Marty that order? Hi everyone. My name is Roslyn tan. Thank you for the opportunity for me to be here on this topic of Lawton and liked what I had said I request for the decision to vote to be postponed. So a husband and myself. So if my husband here this is what he would say. I feel it's in the appropriate to take a neighborhood with his own quiet character and dropping 600 more people and their cars into a very small residential space. Call Samantha O'Brien. I thought you on NPR saying it's pounding the virtue of absorbing to allow for Cesery dwelling units that your Cottages as a way to increase density without greatly impacting the character of The Neighbourhood. Why isn't the same thinking being applied here? Japan would greatly changed this area and area nowhere near places of employment shopping or transportation for the people you hope to house hear my commands my personal comments follow so a couple questions. What are the reasons for pushing this Fort Lawton project through is it because you have spent the last 15 years on this and you think it's about time to get this going then I don't think it's the right reason enough good enough reason if it's about helping the homeless an affordable crisis. We are facing now than 237 Unit 8 years later would help the situation that we are facing today. If it's about getting this land for free, then I would like to know how much the federal government will allow this to go to an expansion of Discovery Park and the affordable housing being built off-site for example at the interface Armory Armory where the plan is to build 2680 units for up to 4,000 people. So the land may be free, but developing it is not cost-effective. So I thought you just please spend the money wisely like, it's your thank you. Hello, my name is Nick fat and I'd like to speak about the Showbox to be aware. The Pike Place Market is a truly unique neighborhood. The only federally designated historic district the status due to a public vote. It is today home to over 500 small and micro businesses as well as a preschool a senior center a food bank and a medical clinic. I've been a tour guide in a story in the market for over 10 years and have learned that Above All Else. The market is a fragile ecosystem your motion to add the Showbox to the historic district was an important step but in the interim you have failed to follow through with your promises to conduct studies on the impact of making piecemeal additions to the district today. I heard you to extend the ordinance simply so that you can buy more time to conduct the Outreach and studies. You said you would do in the first place. I will repeat that you made promises that were left unfulfilled. I have been a part of the community working to be engaged in the conversation around the Showbox and I am imploring you to Simply do the work. You said you would do vote to extend the ordinance vote to have a responsible dialogue and seek to find compromise to authentically and sustainably work to Mary Seattle passion for progress with the history and the culture that make this an exciting and engaging place to live. Thank you for your time. Thank you. Following just one second Marty falling Marty is our last week will be Alicia Roberts. Definition Council Member's Mark oyster, I work for the Housing Development Consortium Seattle King County. I am speaking in favor today at moving ahead quickly with the Fort Lawton project 11 years ago. I was excited to bring Habitat for Humanity's work to that area. It has been a long time in coming. We are right now today at least 156000 affordable homes short in King County in order to make that number palatable were talking about how to build 44,000 in the next five years. So it's not a matter of should we or should we not it's a matter of how much including Interbay and every other possible location that we can build and unfortunately, that means that we all have to learn to adapt to a society that's going to embrace density density done, right? Talking about Fort Lawton being designed after years of work by Partners the office of Housing and others as a true Community. Yes. There's other work that's going to need to be done floating Transportation school's all of that, but it is a unique opportunity that we have before us, and I would encourage you to move forward with all due haste, and please encourage your partners as well to develop it out quickly. Let's make it happen. Thank you. Thank you. Hello, my name is Alicia Ruiz. I'm here today representing the Master Builders Association of King and Snohomish County. We all recognize that affordable housing. We are in a crisis situation with the shortage of affordable housing there for the Master Builders Association fully support the Fort Lawton Redevelopment plan an urge the city to approve quickly. Obviously after years of discussion planning with stakeholders public review litigation and debate this time to adopt implement the plan to create affordable housing at Fort Lawton. Thank you. And I will conclude our public comment section. Let's move the payment of the bills. Cancel a1195 38f reminder pay certain claims in order the payment thereof. I'm going to pass Council bill one 19538 bill passion for the comments. Please call the roll on the passage of the bill. Call Brian Pacheco Salon. Gonzales favor. Not a post. I was going to ask for an encore for from Mark Taylor Canfield before I got into a Jenna but I think I'll just keep plowing on those pissed off their Mark. Please read the first agenda item. What is civil rights utilities Economic Development and arts commission Titan one appointment 1345 appointment of Robert wonsung Lee as director office of Economic Development to the committee recommends the appointment be confirmed told you so today I am really excited to advance the confirmation for acting director Bobby Lee for the office of Economic Development acting director Lee has been really helpful and throw in this confirmation process completing what I found to be and I believe When compared to others a really rigorous question are submitted by the council and joining us for 2 confirmation hearings in the Civil Rights utilities Economic Development and arts committee extend. My thanks to director Lee for sticking to the process and thank you Doug Council colleagues for your participation director Lee brings years of experience in the public and private sectors where he's worked on youth Workforce initiatives community and economic development efforts to have prioritize equity and building Pathways to Economic Opportunity for communities of color. Building sustainability for small and long-standing business is similar to our work with Legacy businesses and served on also as a city council person for the City of Eugene. So he understands our role as well acting director. Lee's most recent roll before coming to Seattle as director of Economic Development Portland before that. He served Oregon governor Kate Brown working on economic and Community Development challenges. He has received numerous letters of support throughout the process including former colleagues and elected Zorn Oregon the president of the Portland chapter of the NAACP and leaders from important community-based organizations. In addition, I just went to highlight director Lee's commitment to working on priority issues on that. This Council has has identified and has already begun engaging in the neighborhood businesses throughout throughout the city is come to South Park twice already in his short time and met with businesses out there. I do have an amendment. I'd like to to make to the appointment as it relates specifically to the expectations letter 1345 to add the council letter of expectations from Shirley. Okay, we're going to put on just the amendment. Did you want to see more about the amendment or being sort of self-explanatory show just a minute vote all those in favor of the amendment, please. What I I oppose the eyes have it. The legislation is amended. And so those are my comments in support of this confirmation and before we move forward and that's where colleagues would like to make any comments or questions customer badshah. Well, I am very pleased Bobby that you're going to be joining us. I really appreciated your positive energy and I think moving forward and you've got some people at that preceded you that I really appreciated working with so I think it's going to be a wonderful partnership and I do want to acknowledge. What councilmember her. Both said, we received many many letters of support unsolicited letters that came in and talking about your strengths and experience you had as a city council member in Eugene as was mentioned and the number of us, so we figured that you've got a good thumbs up there as well. So I want to acknowledge that it's I really welcome you welcome working with you and I'm very glad that the mirror put your recommendation forward. Any other comments from any of our colleagues? Councilmember mosquito that you would like to take the department. I just want to Echo some of the things that we've heard, especially from front-line workers from union members have been very supportive of the direction that you'd like to bring to the department. I am also really excited about the commitment that you bring to women and minority-owned small businesses the work that you've done in Portland with the Portland Mercado example in which we want to create so that as we're creating new things over creating density. Are we do as you heard from one of the density Done Right, which means smaller shops on the first and second floors and that we do the Outreach to connect those on small business owners with the opportunities to have sites there so that they can begin their business and that is Affordable and that the process gets broken down and I just want to make a plug. So every time we trade opportunities for small businesses to thrive. We also need to clean those opportunities for All Care Facilities to grow so that they are businesses and workers can have a play some for those kiddos and families and workers to be successful and I loved your enthusiasm around that image and I love what you've done in Portland. I really excited about the Frontline workers also supporting you and I'll be enthusiastic. Yes. Thank you counselor mosquito any other further comments from any of our colleagues? I'll just say very quickly than I've enjoyed the time. We spent together and your vision for the Department in the city. I found I love the through the fierce competitiveness you have for small businesses and for high-performance, but then also said about the quiet humility about your style of leadership. So I I I do expect great things and I did approve the expectation letter, but what a treasure to have you as part of our city government now, so I look forward to supporting you strongly text. So with that customer or should I call for voters? You want to close with any other remarks? other remarks I would like to close with our recognition that the mayor's small business advisory commission had deferred on my request or my offer for them to submit questions because they had already met with the early on in the in the what's the weather looking for the the process to identify an appointment? They'd already met with with mr. Lee and we're really excited about working with him. The I want to just highlight real quick play some of the specific expectations that the council has grow and strengthen the local business community Through the provision of drug Services Workforce Development is an important priority is specifically the city's investments in Workforce Development initiatives that support the career advancement of low income in under employee job Seekers economic resilience measuring the city's overall economic health the analysis of the key indicators Economic Development leadership participating in Regional Economic Development work groups and policy meetings neighborhood business districts working with business owners in our business district to identify evaluate and address emerging emerging needs in these business districts Legacy. This is developing and implementing a legacy business domination and designation program with a goal of facilitating and finalizing the designation in each district by the end of this year and then finally and really importantly shepherding the conversation or participating in the shepherding of the conversation around the home for the film in music division. That was formerly housed in the office of Economic Development. We're not quite sure where it's going to go but there is there is an effort partnered with the Arts office to to engage with the Arts and film and music Community to talk about where the right home for film and music is that I think we have a shared belief that there's so much more that Seattle could be doing to support the film in in. Music industry and I'm excited that director Lee has that on his list of priorities as well as ours that's doing such a thorough job on this confirmation. Thank you Josh. I'll blow them think you make search up at least you're here okay with that those in favor of confirming the appointment early as a minute, please vote. I dispose vote. No. The motion carries an appointment is confirmed and will suspend the rules and we love to hear if you were show me. Mr. Lee. Please come forward and congratulations. Well, thank you very much. Thank you very much. I'm truly humbled. I'm so excited to be in Seattle. I finally made it. Challenging part for many Urban economies is that we're about to transition into new economy call the network economy and their strengths and weaknesses in the new economy. As a part of our job in our office is to have help you navigate those opportunities and make sure that we we build an inclusive economy for everyone, but that I'll leave it there. Thank you very much. Thank you, Miss Shirley. Please read the next agenda item 0 4 billion to the Pike Place Market historical district, MN eagerness went to 56502 extends its effective date by 6 months of commensurable pass with cast members herbo Swanson O'Brien favor and extension with cast member Pacheco Ordinance one to 5650 to extend its effective date by 6 months the bill it is a mending establishment in a Roman expansion of the Pike Place Market historic district last August, the legislation will allow the department of neighborhood some additional time to complete work that this Council asked to do in last August so that the effect again is just a simply extend the legislation. We already voted on by 6 months the central staff memo I'm accompanying this legislation specifies that department of neighborhoods expects their consultant will complete much of the work needed to develop a preliminary recommendation by the end of June. If the recommendation is for a permanent expansion secret review would follow that recommendation. We had a public hearing last Tuesday. A lot of folks came out to testify in support of the legislation and folks speaking in favor of the legislation really did a great job of speaking to why in their perspective the market should be looked at as part of a a permanent future expansion for the for the Showbox to be within the market boundaries the points that they spoke to was that the market was established in 1909 the Showbox building opened up about ten years later and 19. 19 it was a public market folks noted. The fact that there is a commercial Synergy between both the market and the Showbox many visitors go to both places each year for the last several years Seattle has had a record number of visitors into tourism is an important industry in Seattle. One of the comments that came up in the public hearing was from businesses are people who'd moved to Seattle because of the culture and who have since started a business that folks also spoke to the the physical Synergy between the the look of the buildings and the appropriateness of the Showbox to be considered as as part of the market because of that is well Department of neighborhoods is working to implement Ordinance one to 6560 which calls for a review of historic significance of the Showbox theater. The relationship between the Showbox theater and the Pike Place Market and to consider amendments to the Pike Place Market historical Design District design guidelines related to the Showbox theater there also a part of this ordinance called them to draft legislation conduct Outreach to stakeholders and conduct State Environmental Policy Act review on the permanent expansion of the historic district as appropriate the there may be some confusion about the scope of what the executive is doing right now. The department of neighborhoods is clarify that the current scope of the study includes an analysis on whether or not to permanently extend the The Market District to cover the Showbox property and in order to make a recommendation on whether or not to extant expend the expand the districts to cover that one property. They need to look at a broader area. And in this case, they're looking at First Avenue properties to better understand the historical context as it relates to the Showbox essentially to analyze the Showbox properties. You have to analyze historical connection of the adjacent areas. We have heard from folks who during our earlier deliberations back in August had not taken a position on we heard from some of them today. And we also received a letter last week from Friends of the market the Pike Place Market Foundation historic Seattle friends of historic Belltown the Fisher Studio building and rise up Belltown and friends at the Showbox made them twice because they are awesome and the There's been a question of a potential lease expiration in January 2024 If part of the if this property is becomes part of the market historic district, the change of use would require a certificate of approval from The Mark of the Pike Place Market historical commission. So that just a little bit of additional context about how the recent news from the owner on their plans for the for the building would impact future decisions around the the district boundaries. Thank you. Cancel, Amber herrboldt and open up your comments or questions. I hear and appreciate that this knowledge and sentiments that brought some of you out today to support saving the Showbox and I believe that this conversation highlights a need for better tools to preserve the cultural resources we have in our city. That said I do not believe that this tool expanding the Pike Place Market historic district is the right way to go about preserving the Showbox as with any policy decision their major trade also associated with preserving the Showbox when we use a blunt policy instrument like the historic district Hazard tool. We are making housing the cost of saving the Showbox that is housing at the city desperately needs in the midst of a housing crisis which rooted and which is rooted in a shortage of housing. We need to be building more houses of all type. This action takes away the opportunity to build 442 new units of housing that we need even more importantly under mha all new development must contribute Ford up to affordable housing by closing the door to redevelop on this site. We are turning down up to five million dollars in a fordable housing payment that could it could be have been required under mha As a chair of the council's planning land use and zoning committee. I'm a firm believer that we should be embracing density and building more housing in walkable neighborhoods. Particularly close to Transit Light Rail stations. I also serve in the Puget Sound Regional Council will be our challenge with vision 2050 as a region is expected to grow with 1.8 million new residents and 1.2 million new jobs. As he confront climate change congestion and unaffordability building housing near Transit and jobs is what's what will allow so many Seattle lights like myself to live without a car at someone who has advocated for greater density density in my own District particular in the U District Avenue Light Rail stations are opening it is an intellectually inconsistent to opposing the new development. So close to light rail. Let me be clear. I'm not opposed to save in the Showbox, but I cannot in good faith support saving the Showbox in a way that places the burden on families trying to afford a place to call home in Seattle as a as a city. We need to move away from a conversation that sets up a false choice between create a new housing and preserving cultural spaces instead of putting these two things. We need against each other. We should be having a conversation that promotes both housing and culture. I wasn't on the council last year. When is temporary boundary expansion was established but if I had been I would have voted. No, I believe that the council she could have and should have taken more time to identify a solution that preserve the Showbox and created more housing if we had work with a developer to identify a solution that work for all size. We could have found a way to preserve the Showbox and 1/2 442 units of housing that we prefer that were proposed as someone who was just at the Showbox on Friday. I don't think that it is contradicted to want to preserve the history of that place and recognize that it could use some upgrades. Example we all know that the show boxes on the city's list of unreinforced masonry buildings mean that it poses a serious danger that the people in the area in the event of an earthquake. This fact alone should tell us if reason the Showbox in time is not a safe for responsible option. I will be voting no today because I believe I save in the Showbox in this fashion is leading us down the wrong path has a city and because I'm hopeful that it is not too late to pursue the options that allow us to preserve culture while also building housing if I can make one final note. I hope that we as we have this conversation we can do so in a way that is respectful to all of us at the public hearing last week. I was very concerned to hear one individual compare himself as a show box fan to a Native American and call the shobox his reservation. I was even more concerned that the crowd the crowd applauded that statement that sort of comparison is unacceptable in my mind and we should not be condoning it. Thank you can spell check off any other comments cast member War S. I just want to share that we have a point of order council president. We just had an hour of public comment about people supporting or saving the Showbox and during that time. Nobody was jeered or made noises and councilmember Pacheco deserves to have to you to be respectful and to listen because that's what we're doing. So I'm going to ask that you do that and that this is not a rally. Thank you. I'll take that under advisement any other comments questions, I think comes first one. I think you were in queue customer skater. Figure that one out. I just defer to your side by side colloquy there and glad it. Pink, mr. President first. I really applied to Mayra Pacheco in terms of your concerns around affordable housing and housing in general and I want to make some comments about housing and I think the trucks that were at with wanting to create affordable housing for housing in general in the city and preserve cultural hubs throughout Seattle. I will be voting Yes again on this legislation to make sure that we have additional time. I had to consider the request in front of us, but I want to be very clear about something we voted. Yes last year we voted. Yes in the budget to give funding to the Department's you complete the study the study did not begin until January of this year. So if there's frustrations I want folks to know what this council did in August versus what actually happened beginning in January into directas frustrations accordingly. I think it's also very important to know that you're on the council have taken a number of steps to ensure that there is access to both cultural heads and promoting as to how Throughout the city and that it doesn't have to be an either-or. One of the issues that we had been working on last year prior to the passage was making sure that if there was the opportunity to preserve that they show box as is and then build housing above it that all of those options were tirelessly on pursued before moving forward. And unfortunately, we don't have that option in front of us, but I am supportive of giving us a little bit additional time so that we can see if there is opportunities that do present themselves to protect this cultural Hub. But I think in the future we want to make sure that there is not a distinction between cultural Cubs versus housing. It should be both and there's also I think an important element that comes from which Echo has elevated and councilmember Juarez at United free appreciate your understanding of the need for respect because we do want to make sure that we're not putting ourselves against each other in the city when it comes to residential cultural and business displacement. That is a very real and pressing. Do around Seattle especially though in communities of color and as we're facing the challenge of looking at displacement across our city. One of the bigger longer-term impacts that I'm going to be looking at is to make sure that we have both and both housing both have fordable housing and the ability to create and preserve cultural hubs. It's really important for us to wavey's equity implications as we take actions to preserve important Community spaces like the Showbox and so many others that have come before us and also think about how we can build housing around the center so that more people can walk to work that can afford to be artists in the city can go down the street or down the elevator to their place of employment or the place where they're playing a show. So I hope that we keep that in mind and that also as we think about the opportunities to both preserve cultural space we take the same level of energy that we've seen today and throughout the last 10 months and we really Do you apply that to creating greater density like some of the comments that were made around creating density at Fort Lawton? We've we had know that there's tremendous opposition sometimes and having your energy harnessing that energy and focusing and as well in terms of creating affordable housing as much as we are as I'm creating cultural has that can can be a both and and that's what I'll be looking forward to in the longer Term Policy Solutions in conversations. Thank you. Activist on music lovers who are here again today, and I know many of you were here at the public hearing last week and many many more of you have been fighting for the Showbox and I've been honored to stand alongside you all who have made the hope of saving the ShowBox a reality, although obviously, we're not done. I also want to take a moment to congratulate the save the Showbox movement, especially the Showbox employees the friends of the Showbox and historic Seattle in overcoming a major hurdle and winning the landmarks that has nomination last week and we are looking forward to a really positive outcome on that as well. Even though we are all very clear that doesn't preserve the music venue use of the building. WWE one last summer expanding the bike place boundary Historic District boundary to cover the Showbox would never have been possible without this movement without the / 118000 people who signed the online petition without the hundreds of you all who packed council chambers demanding the Showbox not be destroyed to make way for unaffordable luxury apartments without a hundred local musicians and artists raising their voice on behalf of their community and forcing the council to act we would not have had any chance of winning in the Pike Place Market itself would not be standing today. If it were not for a movement decades ago similar to this and probably larger in scale because of what what what they were up against It's also a critical component for the movement to have its own elected representatives who would always stand with and fight alongside the movement never betraying it in. My office was proud to play that role and we will continue myself and I will continue standing with the movement at every step of the way. I also want to do again. Thank Altima Bryan was supported my ordinance last August from the get-go and don't remember hard-boiled who brought forward this bill today, which I think is important last year at every opportunity many council members would say, what is the rush why someone's office pushing for this boundary expansion to apply so soon why is fast-tracking the legislation necessary? The reality is that if we have donated their way by believing the deal can be struck with wealthy landowners are corporate developers. Then we would not be here people likely know about the lawsuit filed against the City by Rodger Forbes the building owner of the Showbox when the judge reviewing the case throughout significant portions of the lawsuit we heard this was due to our movement demanding no delay in action. So judicial outcomes also are influenced by what we say out in this world on the streets and how strong are movement as when we passed our legislation last August. We knew we had it one inch rim protection that we knew we would have to come back this spring and summer. So here we are I will be voting. Yes, of course on today's proposed six month extension of the interim expansion and I all call on council members to respect the demands the movement and do the same but really has our Shannon Wells said, you know, it should not have come to this today because the mayor's office and her Department had more than enough time to ensure. The Mississippi Studies have been conducted in 10 months. Okay, it didn't happen. But this is what happens when the immediate pressure of the movement of the absent. So it's important that we keep in mind after today. If we have one that six-month extension, it doesn't like us the movement of the Hulk we have to make sure that all the studies that were promised in the work plan are carried out in a timely fashion and that will only happen if we remain Vigilant and vocal and we want to make sure that in the next month, especially we have enough pressure on the mayor's office to Modesto relate to be completed our neighborhood impact for the city Department because it can be done in that timeline. We cannot we simply cannot rely on the behind-the-scenes deals and negotiations with Ford's attorneys developers and corporate landlords 31 the initial internet protection purely to the strength of the movement and we should not waiver regardless of what we hear what else we are. We should not waver because we know the behind-the-scenes deals is not the way to go right now. Let's win the 6-month timeline extension and keep the pressure on the city Department to report the mayor's office and make sure that studies are completed. I wanted to thank those were being fundamental to the struggle the employees of the Showbox the friends of the Showbox historic Seattle Central staff members Les Schwab Richland, who's your who helped us tremendously, but getting the legislation ready. Community organizers in my office some of whom are here today J Middleton who launched the online petition and Seattle's best community of Art. A musician some of them are also employees of the Showbox, but I also wanted to mention Smokey brights Ben Gibbard Soul sassy black dude, York Spirit award ruler many of whom also performed at the free concert. We had last summer on the Plaza outside. Thank you all so much and then in closing I will say as only Ashwood said last August is Yoda right here in Chambers. This is not about culture is not a question of Music vs. Housing. This is not about music vs. Affordable housing. This is about culture and housing for everybody versus profits for the few. And as Arnie said he has elected officials. You have to pick a side you don't decide which side you're on and I will also say that making this about affordable housing in my view is either naive you don't know the facts or is disingenuous of elected officials because we know it's not about affordable housing if elected officials are concerned about affordable housing than those who repealed the Amazon tax should not have done that and if you want to support affordable housing, then let's fight for rent control and to expand social housing massively by taxing Amazon and big business fighting. Casa Maria Gonzales, I'll make this quick cuz I know we're on agenda item to of a very long agenda for today. But I just wanted to say that I consistent with my vote in August of 2018. I intend to continue to maintain my my same positions. I'm going to vote Yes on this bill. However, I wanted to give some caution and some additional rationale for that. So I don't think there is a justification for me at this point to modify my vote on what I see as a technical amendment to allow some some time for the Department's to continue doing the evaluation that we originally asked them to do. We haven't modify the substance of the evaluation and Analysis and study that we originally asked the Department's to do back in August of 2018 at this is an opportunity for the city council to provide executive additional time to be able to complete that work. Again, nothing something to this change in terms of the work that were asking executive to do this is just about finding an additional amount of time to allowed to do that. So I see this amendment to this bill is technical in nature and not substantive. I in terms of a final long-term solution for this particular parcel of land at which leads me to my second point which is a caution to my colleagues that I am concerned about the direction of looking at Annex of expanding the scope of evaluation for the alleged purposes of evaluating the true historic and Architectural District nature of this space. I am I am I am conscious of the fact that this me the expansion of the scope me lead to further limiting development capacity along 1st Avenue at utilizing This historic resources at tool as the mechanism to do that and we've seen in the mandatory housing affordability contacts in and other spaces that oftentimes historic resources and an historic resources. As a tool is being is being weaponized to prevent additional density and affordable housing coming in to particular neighborhoods. That's that should be taking on the burden and responsibility of additional development capacity for purposes of housing our families and low-income members of the community. And so I'm going to say yes for this bill today with with the caution that that doesn't necessarily mean that I would support a final bill if that final bill signals in my mind a move towards a scope of study area that would diminish significantly development capacity along 1st Avenue again under the That the auspices of preservation and Anna and I just really think we need to be very careful about evaluating specific historic resources and how that might implicate policy positions clear policy police positions that the city council has taken in other areas with regard to up zoning and allowing additional development capacity for purposes of increasing dollars real dollars available to us to construct affordable housing either in this particular neighborhood or in other neighborhoods around the city of Seattle Emily. Look at the maps of where our development is happening as it relates to affordable housing developments a significant majority of those developments are occurring right here in downtown in district 7, and so when we know that Mary is owning a incentive zoning programs require that downtown developers contribute the most amount of money under our mandatory housing affordability program. I have serious concerns about Broad stroke approach here at that may compromise and diminish the great efforts that I think the city council has taken in the space of affordable housing as it relates to a broad swath of land along 1st Avenue. Any other comments or questions? I'm going to say a few would you like to close to bed after I said if you so just a few things. I'm going to support the legislation counseling herbo. Thanks for having a committee meeting on it and bring it to our attention and I we were sort of monitoring the deadline of our first legislation. I want to thank the advocates for coming out your voice is heard meaning. Thanks for the song Marcos beautiful this concept of picking a side to me. It's up nonsense. It's not for me. It's not about picking a side. It's about listening to people and you pick a side view drawing a line in your on one side of the other to me. That's not how we get things done in the city. We listen and we try to understand and try to come up there. Good. How can I think many of you for xanada a very clear picture of what we can preserve and we should try to preserve a customer check. I want to thank you for taking a bold stance on what you believe in and you weren't part of the long discussion. We had that got us to this point, but I want to applaud you for voting for your conscious which I always think is Noble not listening to anyone else, but trying to get to try to try to hear others, but trying to vote on what you think is right. So thank you sir. And last I want to say this notion about behind-the-scenes deal Towing address that So my take on it is a city didn't do its behind the scene work is feverishly as I was hoping they did when we pass this legislation. I was hoping that behind the scene work was really done. And so we didn't have to get here where we are today. We all know it's no big secret that we're in litigation on this matter. Okay, that's it. If you didn't know I'm sorry to let that secret out the bag but we are in litigation on this matter and my hope is that perhaps parties can work together and we could come up with a win-win a wind that preserves our great music venue and allows these talented musicians to do what they do so well and that we will again look at the value of the market in the beauty than market and housing issues and come up with some win-win since whether that's behind the scenes or here in City Hall eye care less what I just want to get that kind of work done before me is not about picking a side. It's about working together as a community and getting some things done. So hopefully within the next six months has this Legend Presents we will get this work done. It's going to take all of my colleagues for this robust discussion at Acid customer herbold close to debate and then we will vote and see where the the chips fall clothes out with some comments. So if you heard before during the public hearing highlighting the work of the Arts office as it relates to the the need to act with urgency to preserve our Crossville spaces the report out of the Arts office the cultural space report identifies that the value of cultural spaces and activities are quantifiable. They drive economic growth and Urban Development blocks in Seattle with cultural spaces. Hyatt have significantly higher walk scores. They have more businesses open at 10 p.m. On Fridays and have twice as many Outdoor Cafe seating permits pointing to be the economic development value. They go on to say that the art Ecosystem that we have today thrives in a rich network of cultural spaces that were able to flourish because during periods of Greater affordability in Seattle without the spaces to support this cultural life without the presence of Arts and Cultural organizations in our neighborhoods. This ecosystem can't be sustained at times of less affordability like the times we are in now vulnerable communities are the canaries in the coal mines of displacement. They are disappearing from the cultural landscape and put some of the first to disappear as we have heard our use of color and the Arts and Cultural organizations that reflect them whose presence helped create the very land value on which those cranes are now building. I think that's a good point to end on Orchard. And with that we are going to vote on Council bill 11950 for so clerk. Please spell the role on the passage of the Bill O'Brien Jayco. herbal eye Juarez mascara president Harold want to post Clap on that one. I please read the next agenda item housing Health Energy and workers rights committee agenda item three Capital One 19507 related to fair housing establishing a one-year probation on YouTube rental housing building platforms. How many section 7 point 24.0 twenty-two times for code and adding a new section 7 point 24.0 and 90th, Seattle. Thank you. Mr. President so on to rental protections because I'm sure that it's informed by Our Community Partners at the mission on red wedding technology. So for folks who are unaware, this is like for rental units there housing Skyrocket, but we heard immediately after getting elected was that there was a number of people especially in the University of Washington area is student specifically seeing these eBay like platforms is collate the cost of housing in their neighborhoods was to create a one here prohibition on these rent building Technologies in order to provide time to determine whether or not these platforms are in violation of our fair housing laws to analyze how they may impact housing cost or cause greater inequities in our access to affordable housing and housing throughout the city. Potentially disproportionate impact on our communities especially communities of color and lower-income communities and what we seen over the last year through the office of Housing and coordination with the office of civil rights and the department of construction and inspection. Is it at Leon time? I will add thank you very much to the mayor's three departments who is producing a report for us in July by the study to help us better and analyze and understand this new technology is impacts on Equitable access to housing and what long-term relations may be necessary given the pace at which new technology isn't right here. We see a number of them crop up right in our own backyard can come on line can be ingrained in our communities and ingrained in our system the pause button. Let us have a little bit of time to see how these rent building Technologies Oribe like systems for rental units actually affect the our commitment to fair housing whether or not they have an impact on the rental housing market. And whether there's implications for our commitment to protecting our populations access to for fair housing laws. So the report will be presented as I said on time and July of this year. What we'd like to do with the council support today is to add an additional twelve months. So once we receive that report back from the three departments, we will have the opportunity to work with tenants and the community-at-large to develop potential policy Solutions and conduct a robust engagement process to actually talk about what to do about the technology that we have seen from other cities that they have not put this pods in place and the consequence have been limited access to units throughout their cities and increase in the cost of affordable units and with an effort to try to be proactive and get ahead of it. We're very excited to be able to put forward in front of you vote from the housing committee that looked at requesting that 12 month extension so that we can create the appropriate and informed decision on Longer-term regulation for rent wedding platform waiting for your leadership on it and I certainly will be voting for this today at the committee the other day. I asked the question because I've been hearing from both renters as well as Property Owners. How is our study going along the lines of the first in time registration because what I'm I'm concerned about is that people who are at their computers during the day that they get a first shot at a rental unit that comes open. I'm somebody who is working outside and away from a computer may find themselves still laid and behind Franklin County fall in terms of getting on those lists. And is this something that we can continue to look at or will it be part of this 12 months studying or could we make it such thank you for the question. Looking down the sewer working on the first in time legislation previously. I think that that's part of the question that they will be answering for us in July. How has this tool impacted that ability. If you're the first one to put your application in you have the qualifications you have the funding you should have access to those that that rental unit. Unfortunately with the way in which the platforms were working before r1r Stay On These Technologies. They cost was escalating. So those fruit folks who were first in time we're getting outbid. So I think your question is exactly the type of question. We hope that the July report will answer. IKEA near the questions or comments before we vote think we're good. Okay, please call the roll on the passage of the bill to post please read items 4 through 6 and you could read a short of title of the house. If you'd like resolution 31887 adopting and approving application for Surplus property at Fort Lawton including Redevelopment plans committee recommends a resolution be adopted as amended Council bo1 19535 Lane to the Fort Lawton Redevelopment plan application. Can you recommend simple past tense of 01195 10 really to land use and Zoning the committee recommends the bill pass? Play all of these items are interrelated us. We read them into the record together. So I'd ask council member Mascota is in the skater or yes. Okay, House member scada to describe the mall and then but will it bolt individual if that works with you? Cuz they all fall together. This is really an incredible opportunity for us to celebrate the combination after 15 years. This is about a Community Vision for affordable housing to be developed at Fort Lawton. Does it take in community engagement planning an advocacy? Advocacy as I mentioned for 15 years that is now going to create a variety of homes including homes for seniors and Veterans experiencing homelessness affordable rental homes for families and individuals affordable homeownership opportunities for low-income buyers with housing costs touring and disposal prices at a very high levels as we just talked about Tens need for these homes to be built now more than ever and about as one of the most important things that we can do is also preserve and expand access to Greensboro of the Fort Lawton land that we were talking about 60% of this site will be dedicated to parks and Open Spaces complimenting the natural beauty of the recreational space. That is right next door at the Discovery Park Park. This is wildlife habitat at Discovery Park veterinarian that we all love to enjoy and councilmember bagshaw's District that will not be touched by the development at Fort Lawton. So will be complimentary animal vet up to the existing a land at 4 at Discovery Park and is Fort Lawton housing will be a compliment for the neighborhood and by creating affordable homes in a very high-cost area of our City Fort Lawton will further expand our commitment to exactly what you were just asking about our commitment to fair housing in Greater inclusion and advanced opportunities by opening acts. Tu Amor family Sevilla able to live in a very high-cost area of the city that has previously been Out Of Reach for very low-income communities, especially for communities of color and low-wage workers. So I want underscore is a win-win it's a huge opportunity and it's a rare opportunity to gain access to a significant portion of public land from the federal government at no cost at no cost. If it is used to build affordable housing and services, especially for homeless, it's a win-win for Seattle highly competitive retail. I'm sorry highly competitive real estate market and over the course of several evening. And I will go over the last few years and especially five public hearings at the housing Health Energy and workers rights committee just this year. We've heard from community and interest in doing a couple of things. This number one is expanding access to bus services in the neighborhood and increase in school capacity. We heard from s. And folks from Metro that they will engage in a process for looking at the frequency at which. Buses should come and how to potentially add stops our routes to the area over time. We've heard the desire for increased school to capacity and actual school buildings for teaching what we've heard from Seattle Public Schools today is that they will engage in that process of looking at additional facilities for classroom, but the most pressing issue that Seattle public schools has right now is the need for more play fields and that's exactly what we're creating here. We're also creating more space for a while that's habitat as you heard a thing from some of the folks who presented today and in previous committees the desire to make sure that there's more space opened up to to wildlife habitat and that we were Deuce are surface parking lot stream. Today's package. We have a really great a minute that came directly from the Coalition that was working with Fort Lawton. And in the in the neighborhood that they brought to our attention the desire to reduce the surface lot parking space by at least 1/3 and 2. What communities that we could create more public space, especially for a while the height of Life habitats including the Blue Heron population. So I'm really excited about the proposed Packers that you have in front of you with the amount of work that has gone into making this these three pieces of legislation that you just heard. It described come together is really important and it's for the night if I might I think there's a few details as it comes to housing that I'd like to underscore for the population for the community homes for seniors. This is 85 Supportive Housing units for seniors, including veterans who've experience homelessness site. There will be House housing case management residential counselor than housing stability plans created so that we're really not just creating a door and a roof that we're creating the ability for folks to get stabilized. Thanks to the Supportive Services in partnership with Catholic Housing Services and United Indians of all tribes. This is not just House, but it's truly creating a stable home for both again. That land will be at zero cost. The second is for individual and family two bedroom apartments for renters running up to 60% of the area median income. So you can imagine this is greater space for families to grow and Thrive opportunity for community space for those tenants there. So it's not going to be homes and younes. It will be actual communities based housing is being developed by Catholic Housing Services. The land is coming out of extremely discounted price is homeownership opportunities and having been a person who just went through the process of trying to become a first-time home buyer. It is very cumbersome. It is very confusing and it is very stressful if we're going to create equity in the city and buy Equity. I mean racial Justice Equity economic equity. We need to also create the ability for folks to buy their own first place so that they can create greater equity in their pockets and their Bank Cancel that people can get out of generational poverty without Universal guaranteed retirement security often. The ability to own. Your own place is one way to pass on a well to Future Generations in to get out of generational poverty as we create homeownership opportunities, especially for our low-income communities. This is one of one way for us to achieve our commitment to equity and this will create 52 to 3-bedroom townhomes in rural homes for low-income buyers low-income buyers between 64 to $86,000 a year for 2 or 5 person household. So that's our missing middle housing. That's our low income middle income housing to create greater self-help so that people can create Sweat Equity and create opportunity to have true equity in their pocket books. Thanks to the folks at habitat for Humana for working on this portion. And again, the land for this type of housing will come at zero cost further. We have included into the requirements that requirement for Green Building standards. Which will be required for all of these new homes at Fort Lawton. And finally as we heard before it's important to preserve access to greenspace and Public public play areas. So 60% of the 34 Acre Site for part will be maintained for parks and related uses. That's 13 acres for Passive Recreation 6 acres for 2 multi-purpose field and surface parking lots for Forest land incorporated into Discovery Park and existing building where they have the parks maintenance facilities parking lot will be reduced Now by a third again. This land will be at zero cost for the open public spaces. So mr. President with that. I just want to say if you think you is if I might and perhaps I should hold those thank-yous until other folks have a chance to say a few words, but all this is going to be very abbreviated. But I do want to acknowledge our neighbors from Magnolia. Thank you for coming again. And I tried to get your questions answered at the committee and having people address them and I have been involved in this for way more than the last couple of years the five committees that we've had on Fort Lawton and I really want to acknowledge Steve Walker. Thank you and Emily Alvarado Tracy rats live from Council Central staff that have worked so hard on this truly. We are getting 6 Acres more of Active Sports field. That's something that we negotiated with the Seattle Public Schools. There's going to be 60% more of this land is going into Parks. We're not taking more of Discovery Park Fort Lawton is asphalt and right now we're going to be turning that into housing and a great portion of it is going to go into Parks as councilmember mosquito said the whole idea that it could be an either-or and as I mentioned at the committee meeting just the day before that committee meeting. I'm hearing from folks that are single. Look we've got a really good idea. Let's not do it in Fort Lawton and let's put it down. And Interbay frankly. We are going to have to be looking for space all across the city and all across our region to even begin to scratch the surface on the amount of affordable housing that we need and it strikes me that yes, after 15 years is Fort Lawton plan is one that we have negotiated with the neighbors with the neighborhood and I'm very pleased that were moving forward with it. And I have respect the fact that people say there's change you bet there's change Seattle is changing everywhere and no neighborhood is really to be separated from this. We need to incorporate hear the voices and be inclusive and I believe that in this particular case over 15 years that we have done that I also want to acknowledge Marty Marty Cloister who was here earlier. I think he's left but Habitat for Humanity's giving people the opportunity for home ownership and we know that that's really the step forward for so many families. So I'm very happy to be joining you in this council member Mesquita. Thank you for bringing it through your committee and also I want to acknowledge the United Indians of all tribes Catholic Housing Services and all those who are helping us get here and bring this across the Finish Line any other questions or comments before we turn it back to customers skater? cake customers want I want to start by acknowledging that we are on a Genesis land of the do Amish people in them specifically acknowledging that because we're discussing in the this item in the next 3 to items the disposition of Fort Lawton as everybody knows in 1970 courageous activist from the United tribes of all the Indians occupied the military base on Fort Lawton demand it be returned at indigenous land and it was true that struggle that the Daybreak Star Center was one result of a demonstration of civil disobedience. Once again proving that when we fight we can win and it was a big victory even though the movement did not win all the demands that they had today. We are voting on approving a plan to transfer ownership of Fort Lawton from the Federal Building represent on the federal government. I'm sorry to the city and to approve a plan to build some affordable housing there. I will of course be voting in favor of the these items because I support building these 237 units of affordable housing on Fort Lawton rapidly as rapidly as possible and to build more there would require a new environmental impact statement which could take years. So I support these agenda items today for years not not necessarily about the current counselor, but in general has been a Monumental missed opportunity that could have allowed us to build far far more affordable housing than we now have in our hands. Former mayor Ed Murray has City departments conduct e is for the Fort Lawton Redevelopment, they study different Alternatives, but the maximum affordable housing they studied was 237 homes, which makes that are legal maximum at the stage the mayor made that decision without consulting members of the public. I'm sure that after today is built there will be numerous press releases from the political establishment outing this Fort Lawton Redevelopment plan as a Triumph, and absolutely we should celebrate every affordable home that gets billed but I think there's a danger that that drive is such an exaggeration that it does not realize the better reality is a preface in terms of our affordable housing prices for comparison Fort Lawton will have 237 affordable homes on 34 acres in comparison affordable housing activist on Forest Hill in District 3, successfully one sound transit property to be used to build affordable housing on Parcel of Madison Street, that one parcel but have over 300 units more than all of the 34 Acres of Fort Lawton. Myself calculated the ratio and the fortune affordable housing project will have over a hundred times as much affordable housing is Fort Lawton relative to its area similarly the north lot of portable housing Redevelopment of the Pacific Hospital pediatric have more affordable housing than all of Fort Lawton similarly the fame housing affordable housing project in the central area near Pratt Park would have more than Fort Lawton the list goes on and all of those properties around single tasos. Not on the bus 34 Acres at Fort Lawton said so so I will be voting in favor of this plan because I want every affordable home that we can get but I also my messages for affordable housing activist that we should not let up for one second and demanding as massive as possible expansion of a social housing in Seattle because as we have these tiny projects are loaded with a lot of fanfare they are actually falling far far short of what is needed to Julia dress the affordable housing prices in Seattle. We will have to expect business and the soup Raise the funds that will be necessary to build social housing and on the scale that is needed that is in the many thousands every year not in the hundred, and we also need rent control to stop that continued hemorrhaging of existing affordable housing. Thank you. Because remember mosquito, would you like to come summer consalus please? Bank accounts president I just wanted to Echo my thanks for everybody who has been working on this issue for for so long. I think one person who was left off. The thank you list is at the great Kenny Pittman who just retired last week. He is an instrumental along the way for a continuing to advance the relationship between us and the federal government to allow an opportunity for us to even be having these conversations around using the Surplus property in this manner. I just wanted to underscore that when you read about the efforts the 13 plus your efforts around Fort Lawton. It's it's it's striking to me that when the city initially proposed development in this manner on Fort Lawton and that was in 2008 in the original proposal. Actually. He proposed 415 units of affordable housing. We're now down to about fifty percent. That's a part of that is because of construction costs and because of you notes, are there other realities related to the process and I think it's really unfortunate that we are now here over a decade later in a situation where we have a half the amount of housing units we could have had in 2008 had we been able to proceed as we wanted immediately before the recession. So I think this is a while we're while we aren't getting those at full capacity of housing units that I think all of us would really truly want to see in this in this uniquely situated neighborhood. And I think it's important for us to acknowledge the work that has been done to allow us to be in a position now to accept the 200 + units of affordable housing that will certainly need the needs of many families in the in the city of Seattle. So really want to thank councillor mosquito for bringing us across the finish line and I can summer Bagshaw for your dedicated server. The district 72 over the Finish Line must feel pretty tremendous. So congratulations to you as well. I will be a little bit brief and I'll probably showing my age here but some of us were there in 1973 when we took over Daybreak star and we didn't actually have the movement but we did it and we got it done. Anything else. You want to say to CEO Michael Tooley who just walked in who is the CEO of United Indians? And also my cousin always involved in Indian country and the struggle for Native American people, but I want to add that this goes further back than 2008 back in 2000 when we were trying to build the people's Lodge which would have included housing units a cultural center Elder Center. And more low income housing and medical services for not only native an urban people, but other people who would require the services those neighborhoods thought I was on the board for almost 30 years if United Indians of work with Bernie Whitebear, and I was also legal counsel for 15 years those neighborhoods fight us tooth and nail for 13 years. So the historical perspective is a swell before NyQuil since 1973 our efforts that we did in 2000 what we try to do in 2008. I am proud to say here today and thanked us her Miss. Keita and councilmember Bagshaw that we kept at it is that our Compass was clear about what we wanted to do with that property. You've heard me say this before sometimes just because you chant when we want we want it now, that's not how the world works. You have to keep marching forward and clear and what you need to do for the community and sometimes you don't get everything you I want but you get to that point where you can actually take a vision and have it transferred into brick-and-mortar. So I wanted to thank councillor Miss. Keita and Kenny Pittman and again councilmember badshah for being relentless and working in the district and Michael Tooling in the other CEOs and a walk before him that we work hard on this and also Michael Reichert at Catholic community services Liz Taylor at Cowlitz I could go on and on and on this is been a piece of property that the tribes have worked on for many decades. So I'll leave it at that. Thank you. All right. Well, thank you very much. Mr. President. We're going to actually help create more affordable housing throughout the city. We're sending a parcel of property that was publicly owned. That should be put to the Public's use so they use for the Public's good not a military base live in the city first time home ownership options and we're preserving 60% of former military land for parks and public spaces. Yes, we are celebrating but this is one small tool and a very large tool kit that we need to address the crisis of Housing and every single one of those opportunities that we can we will take advantage of it. What is legislation that I passed was making sure that every parcel a publicly owned property that is not used to the highest and best use that we've determined as Surplus and no longer needed by the city. We should preserve that public and stop plugging budget holes and Ashley build affordable housing. This is an extension of that commitment on every parcel of land. We should be working to create a Housing and Community Services and the ability for more people to live in the city. So that more Working Families can have the chance to grow live and thrive in the city so that more seniors have a place to call home and don't get this place so that vets who are sleeping homeless on our street have a place to call home. That's what we're celebrating today. I'm incredibly proud to be working with our colleagues to get this over the Finish Line after 15 years in the making after 5 committee hearings this year after the opportunity to work with those who wanted more space for the Blue Heron to get rid of surface parking streets. We are going to celebrate this and then we will keep working and organizing Housing make it more affordable by 15% per cent. That's a smart use of the Public's dollar. This is a smart use of public land. We're also making smart Investments for future generations. And for elders. Thank you. Thank you to everyone who helped to make this day possible and looking at director Walker and his team Emily Alvarado. Thank you to the office of housing link you to the folks at United Indians of all tribes for being there from the very beginning advocate for turning this military land into a better public space on top of community services at Habitat for Humanity at the Housing Development Consortium. And so many others in the housing world who been advocating for this for so long and thank you to our team Tracy raz-plus an cattle Freeman from Central staff for your ongoing tenacious work on this along with Kenny Pittman who council member Gonzales mentioned earlier he retired last week. He got to see this over the finish line. So we are so Happy that he was able to celebrate that committee vote and we wish him the best in his retirement. Finally. Thank you to my staff Aaron house who has been working on this. I'm over the last few months to really make sure that we had all of our I's dotted and T's crossed and we won't give up we know that we need additional housing and we also hear you in terms of the need for more Transit and potentially schools in the future and will be there to work with you to do that analysis. So yes look for that press release because it is coming and congratulations to everyone of our colleagues for all of your work and the community-at-large for your tenacious work to turn this parcel into housing good to to hold on we're going to go on three piece of legislation were going to take them individually. or do the resolution first and so Those in favor of adopting the resolution that resolution 31887 please what I know most guys and resolutions. Didn't sign it. I'm Council Bill 11953 5 please call the roll on the passage of the bill purple Juarez. Mascara president Arrow. And regarding Council Bill one 19510. Please call the roll on the passage of the bill. 9 in favor not a post. Please. Read the next agenda item number seven as member City Light review panel for turn to April 11th, 2020 the committee recommends the appointment be confirmed. Thank you. Mr. President. I'm still reeling from our excitement around Fort Lawton Seattle City Light review. This review panel position has been open for a while. So we want to thank the Seattle City Light review panel for their ongoing work as we've work to fill this position. Mikhail is a project manager at spark Northwest. She leaves access solar program in spark Northwest and support solar plus State energy strategies. Sorry was she supposed support solar energy strategy across Oregon and Washington also she serves on the emerald City's executive committee and the Seattle environmental justice committee 100% renewable energy work excited not just about her qualifications and her experience and her leadership that she brings to the panel. But on all her also that work that she's going to bring an end the diversity of opinions as we work to create greater diversity and representation. On the boards. It's really exciting. She wants to serve in this role and appreciate Miss Gonzalez his commitment to making sure Seattle City light's strategic plan and and if our efforts that we initiated in my committee last year to right-size our commercial and residential rates for customers ends out ends up in the right spot. So thank you to her and the entire panel for their ongoing work on this effort has any questions or comments? If not those in favor of confirming the appointment, please hold. I I suppose both know the motion carries an appointment is confirmed. Please read the next agenda item reappointment of Rachael L Steward as member Capitol Hill housing Improvement program governing Council for turn to March 31st, 2022 the committee recommends the appointment be confirmed. Bring forth his appointment to have Rachel Stewart serve on the Capitol Hill housing governing Council. This is an opportunity for Rachel to help us bring her commitment forward that she's had from the Community Services Group at the Seattle Housing Authority. She's the former deputy director at the center for Community engagement at Seattle University and Rachel. Join Capitol Hill Housing Community Development Committee in 2016. As a non board Community representative. She has an MPA in nonprofit and Community Driven development from Kentucky State University and a certificate in leadership from Seattle University. Don't get any questions or comments. If not those in favor of confirming the appointment, please go die by those opposed about know the motion carries an appointment is confirmed. Please read items 9 through 12 1359 appointments and reappointment of Kellan Bulman Michiko Starks. Shawn weeks and Thomas J Kelly as member Joint Apprenticeship Training committee for terms of December 31st, 2021 the committee recommends if you don't quit nits be confirmed in one comment together these appointees to the Seattle Joint Apprenticeship Training committee really compromise the type of experience and commitment. We need to ensure that journey level workers and Seattle City Light apprenticeship coordinators and management Personnel have ongoing attention to how we are getting folks into these Apprenticeship Training opportunities, and we had a great conversation and committee about the ways in which the Joint Apprenticeship Training committee which oversees the Apprenticeship Training standards offered through Seattle City Light apprenticeship program. Can help us with some of our commitments in these cities to diversifying the workforce. I'm ensuring greater placements of positions within our city good paying job positions. And also as the city is dealing with I would say hi number of individuals who will be retiring soon trying to identify ways in which we can scale up our Recruitment and Outreach to especially diverse communities women people of color to get into a V's living wage jobs positions for the most part and very excited about their interest in serving in the I think willingness in which they show they love to come back to talk with us in September about some of these initial ideas with their appointments. I'm very hopeful about how we can maintain and reach more of our goals. Pick up any other questions or comments. But not those in favor of confirming the appointment, please vote. Aye aye those opposed won't know the motion carries an appointment is confirmed. Please read the report of the planning land use and zoning committee and Zoning many sections 23.41 + 0 10 and 12 of the Seattle municipal code to remove the Ballard municipal center master plan area guidelines and to adopt the Ballard neighborhood design guidelines and to delete reference to the Ballard municipal center master plan area guidelines, the committee recommends for passes amended Pacheco. So this legislation adoption new design guidelines for the Ballard neighborhood these new guidelines are the result of years of community work including 24 Community meetings, 5 open houses online surveys and community group conversations at the Ballard Community set about to update these guidelines in response to the significant growth. The neighbor has seen in recent years as well as the mha reason I was at the council adopted recently the new guidelines. I also apply to a much broader are within a neighborhood defining 7 character areas and recognized in the unique design attributes and distinct features of each. I want to thank everybody for the community to take part of the time it took the time to craft these new guidelines questions or comments. Customer Brian briefly add thank you cancel number check out for your work on this and really want to emphasize the Gratitude towards community members have been working on this for so long not very often that a land usage and comes before us with almost no controversy at all better to get speaks to a lot of really deep deep Works its Basin community outreach buy some of that. Thank you for the comments. Please call the roll on the passage of the bill herbal Juarez mascara president Harold favor, not a post and 506 related to Linus and zoning and planning section 23 Point 41.0 ton of the Salem zip code to prove the Capitol Hill Neighborhood design guidelines 2018 the committee recommends to go pass as amended. So this legislation adopt new design guidelines for the Capitol Hill Neighborhood the development of these guidelines began in response to changes in the neighborhood including the opening of the new Capitol Hill Light Rail station, the establishment of the Capitol Hill district in the arts district as well as the recent. Mha zoning changes a design guidelines were developed with the help of community working group that held monthly meetings for over a year Community involvement also included walking tours open houses and online surveys some of the priority spelled out in his new design guidelines include reinforcing walkability and natural features encouraging development to reflect local values and the lgbtq community an integrated major institution development into the surrounding community and I think again all the committee members who took out a time of their lives to work on these design guidelines. Thank you customer for check or any other questions or comments? Not please call the roll on the passage of the bill president Harold 9 in favour Nana post extension of major institution uses a new portion of industrial General 1 and 2 zones and Industrial buffer zones located near Seattle Pacific University and a many sections 23.50 + 0 + 12 + 23.69 Point 2400. The committee recommends the bill passed away on SVU to apply for a slightly expanded major institution master plan that would incorporate several nearby Parcels that are zoned for industrial use this legislation Implement set comprehensive plan in the middle by the sea. Municipal code to allow for The Limited expansion of major institution uses these specific industrial Parcels near spu in order for spu to Ashley expand their master plan to include this area area. If we need to begin the process of creating a new master plan, which would ultimately come back to the council for final approval. I would like to thank spu who work with the surrounding Community to secure their support including the support of people have spent Decades of Defending industrial land. Thank you customer for Chico any questions or comments before we vote customer back show. I want to acknowledge. Dr. Martin. Thank you for being here and my buddy Steve Gillespie who we've been working on this for a long time. I want to recognize and say thank you for the good work that you've been doing without reach to your community that has made a huge difference and I went back and looked at this about six months ago. We got letters from both Eugene Wasserman and Susie Burke. Both of them said they didn't have an issue with this going forward, which is great because those would be the two that would be if they were going to be concerned. We'd be hearing about it. So thank you for that. And I understand that this is the second step in a three-part process that we move through here. And then I think mr. Gillespie you mentioned to me earlier that we will go through a full-blown mup and and really getting focused on what the designs might be. But at this point is just moving us forward another step. I want to acknowledge how much work you've already done. So, thank you very much. Any other comments, I'll just say I present Martin. Thank you for being here. Thanks for your commitment to her to her use her. All right. Well everyone wants to be educated to our region and I don't make it a habit to think attorneys here. But thank you for being had on the start that President here, but what a great. Academic institution your presence. We were honored by your presence okay with that. Please call the roll on the passage of the bill. So I bake Sean Gonzales purple Juarez mascara entire meeting. Please read item 16 through 21 65 appointment of Benjamin William Sanford town to 329 2020 20 appointment of Amalia Leighton Cody Vinita sidhu Elaine wine, Brianna s Holan and Richard F. Krochalis as members Seattle design commission for turn to February 8th, 2021. The committee recommends a piece of plywood to be confirmed. Benjamin William Roberto's is a director design with flat architects in Seattle and is being nominated by the ocean and being nominated by the mayor to serve as a new chair of the design commission. Amalia Leighton Cody is a director of the Seattle office of tool design and a past year the Seattle Planning Commission Vinita sidhu is principal at site Workshop a landscape Architecture Firm based in Seattle. Elaine wine is a develop manager at Seneca Group which and has experience serving in the landmark Landmark board. Rihanna. Holan is the project development manager for gemdale USA and a reappointment to the design commission and Richard crotchless is served as the regional administrator of the Federal Transit Administration region 10 office in Seattle and of the former director of the city's whole department of design construction and land use you as a reappointment to the design Commission. A very much customer check with any questions or comments on these appointments are going to vote them all at once. I'm not those in favor of confirming the appointment, please vote aye aye those opposed vote. No the appointments are confirmed. The motion carries appointments are confirmed. Please read the next sustainability and transportation committee and I'm 22 appointment to 1354 appointment of on the desk at Hannah as member Seattle pedestrian Advisory board for March 31st, 2020. The committee recommends the appointment be confirmed. Brian has got a masters in urban planning land use and transportation. He was also a pointed number of the stakeholder advisor group for the Sound Transit 3 like the leadership group process that we just completed. Thank you catch my breath any questions or comments not those in favor of confirming the appointment, please go die those opposed both know and what scares appointment is confirmed going to move to other business in council member O'Brien you wanted to say some remarks about a return to Puget Sound, please describe it in Open Session. Thank you. So calling them circulating a letter and asking her support to sign on. This is a letter to the Lummi nation in support of freeing toget a and returning her to the Puget Sound. I'll read us a couple of accidents out of the letter that you should have or have had in front of you. We know the love me believe that they're at their ancestors did the Orca or part of their cultural patrimony our kinship relations and consider families to be sacred as such it is their sacred obligation to bring toget a home as she is an ambassadress of the of the Salish sea. Moreover as the Orca are fighting for their survival. The lonely people are acting boldly based on their inherent rights and their sacred obligation to help them as part of their overall Sailors. She campaign the following words from your secret see website resonated with us. Answer this is putting from the website. We have been called to bring took at a home. We realize it took us a story is important, but she is even more important as an ambassador for the Salish sea Blackfish are apex predators and us are key indicators of their ecosystems Health. If we are to provide effectively for Target and her family, we must restore the salmon runs and vitality of the Sailor see the people's cultures in ecosystems of the Salish sea are all connected and they have long suffered. The violence violence isn't stresses of colonialism. It is our task to work across cultures in borders to heal the ecosystems the economies and communities of all those who now call this place home. Thank you can sperm Brian it's been passed and we've signed Thank You For Preparing that and for your work on this on this issue. Okay, we're going to move to other business. Is there any other business come for the council council member Juarez? iTube to move to save the council member Warriors be excused on June 17th in the comments all those in favor. Say aye aye opposed the eyes have it. Mr. President. I'd also like to request to be excused from Council Council and briefing on June 17th to attend to family reunions. It's a moon to say they catch me. I'm scared to be excused on June 17th in the comments. All those in favor. Say aye aye opposed the eyes have it any other time great rest of the afternoon.", "end_time": 7210.5}]}