{"format": "raw", "annotations": [], "confidence": 0.9256104358406954, "data": [{"start_time": 0, "text": "recommended Spanish Good afternoon, everybody. Good afternoon. Good afternoon, and thank you for being here in City Hall. I'm going to ask that we had were pretty much a capacity. Is there a way there security or FAS me open up the back doors get a little ventilation going in here. Nothing personal anybody, but it's gets little warm here and here on occasion. So it'll crossbreed Breeze. I think we'll all be happier the July 22nd 2019 city council meeting of full Seattle City city council come to order 2:00 p.m. My Bruce harell president of the council the clerk. Please call the roll hair salon Gonzales. president Harold Trino, Justin council member Wards will be excused from today's meeting and we wish her a speedy recovery. Is there any objection to that? Turn off section customer Waris is excused from today's meeting. If there's no objection the introduction and referral calendar will be adopted. Interjection days introduction and referral calendar is adopted and similarly hearing of Jackson. Today's agenda will be adopted. Funeral Jackson today's agenda is adopted the minutes of the July 15th, 2019 city council meeting have been reviewed and if there's no objection to mince will be signed. interjection a minister being signed presentations are not aware of any presentations we had this afternoon. Again, thank you all for being here. We will now take public comment on items that appear on today's agenda the introduction referral calendar or our work program for this year and we are rules allow for public comment to be accepted for 20 minutes. We'll see how that goes. But we do have many people that have signed up. So in order to hear from as many people as possible and I'm going to limit the speakers to one minute and we'll get twice as many hopefully in a good amount of time and go for sure. I want to get people little warning to get your Converse down to one minute and I'll call you out in that work with what you sign up or going to try to get both microphones and play. So I'm going to call the several names go middle Mike Mike this middle Max and back and forth you guys too many of you have done this before so we have We're Sami is at 8 a.m. On a n or Sami and then Colleen Lang will follow to Colleen. Can you come over here and then falling with the middle Michael Beasley Denise Perez is it? What? Lolly thank you very much Denise Perez Lolly be 3rd. So I am calling and Denise and guess you maybe we can have at the YWCA Seattle King Snohomish allocating the sweetened beverage tax revenue to support education & child base program so that our young children of color who are intersect with poverty are given High access will high-quality and Equitable early childhood education services to continue funding for a child in County study children of color experience disproportionately higher rate access early intervention services at lower rates, and the county average ineligible children are less likely to Andrew. Preschool applications of limited or no access to Quality Early Learning is reflected in Children of color demonstrated flow at the YMCA are extremely effective and working is to eliminate this disparity through the provision of his match. I was a homeless families are available for support this includes evening and weekend hours at parents are children are free due to their daytime DSHS program basic requirements. Jalisa do a reset here because we have a lot of people to sign up. So I really am not trying to be rude to anybody who have a lot of people like son. So if you could just started look be mindful oclock, I don't want to but What women okay for try to do that? Thank you very much. We have Colleen Denise and then Joe Carolyn Carolyn's Oak also. Okay, I'm trying here. Please proceed and services were concerned that the effect of this motion could be to undo funding commitments to the parent-child plus formerly the parent-child home program that were made for the 19 and 20 budget city council and the mayor's office in order that it would have a stable and ongoing source of funding and we wanted sure that that continues for dennisport leverages millions and private donor dollars and additional Millions from the county. This program has exceptional efficacy is I think most of you know and we're asking Please do not leave families and agencies in the Lurch for 20/20 where we've already contracted for services and home visitors have been hired and please continue funding parent-child + through this week and beverage tax free much. Thank you council president and council members. Good afternoon. My name is Denise Perez Lolli and I have the honor of standing here with co-workers peers and community members El Centro. The lettuces serves about fifteen thousand individuals each year our food bank receives over 20,000 visits annually four times a week and we have over a hundred and fifty seniors participating in our senior services offered four times a week or early learning program has expanded fivefold. To end funding for basic needs Services is the unthinkable and simply cruel we stand in solidarity with those in this room. And with the city council is canceled his Champion. The sweetened beverage tax is vehicle to expand critical programs that serve our community and is fought to ensure that spt revenue is used solely for this purpose. We support the passage of CB1 19551 NS city council to ensure that our funding is not jeopardize csepp weather. Thank you. I'm Joker Olas. I represent OSL formerly known as operation sack lunch. OSL is a 30-year meal program in Seattle in 2018. We served 1027648 no-cost nutritionally dense meals to those struggling with Hunger. The majority of these meals were created from the more than 1.5 million pounds of quality food. We rescued this food is valued conservatively at one point or 5.8 million dollars. We contributed what we did not use to meal programs throughout the city in the Seattle area. We are only one program of the many needed to serve and support the nutritional needs of our most compromise citizens. OSL funding is change from General funds to SBT funds. We are non political organization. What's a pedal to the metal every single day we trust those who are more experienced than us to operate the in the best interest of our programs the best interests of the people and organizations that we all serve often meal programs in food. Banks are the only nutritional support for those in need. So thank you very much for your service. You guys we want that support on CB1 19551. Thank u r next three speakers. Tammy Morales xochi maykovich and Hilda time if you take the middle Mike xochi Hilda and inviolate larratt. I love it. I thank you for the correction. Hello, my name is Tammy. What all this I am a community organizer with renew Beach Action Coalition. I'm here to speak about a couple things. The first is to support the notice of intent to sell and we think this is a really important first step for giving renters the opportunity to form coops and to really start to build community ownership of assets that we want to support that but we also are here because we have been active participants in the community Advisory Board related to the sweetened beverage tax and we've been offering our guidance on how to use those funds in an effective way to support community and really start to close the food security Gap. We reject the notion that our communities have to make a choice between feeding their families and other critical services in our community and we're here to ask and support you in your effort to pass this legislation. We supported and me think that it honors the communities process or how we are addressing the issues in our community and we ask that you urged you to reject what I believe is a really cynical effort. Divided communities of color. Thank you. My name is Sochi making action. I'm here with Washington support the newest of intent to sell legislation notice about property that's going to be sold. A lot of property in Seattle is getting sold within a day prophets from being able to get it's really important to make sure that there's an even playing field so that we can explore another Resident controlled housing models. That'll help. A lot of people who have difficulty accessing housing as well as ensuring nonprofits can see the downside to a landlord because there is no one has a right to buy so they can still sell so this is pretty common sense. And please pass it. Thank you. filled up Violet and Tamika Thompson San Martin Child Development Center at El Centro De La Raza, I worked directly with children youth and families. And I know firsthand the needs of our local hardworking Seattle residence child care assistance at the danger of not knowing how Child Care is going to be fun for the two twenty20. Very disappointing child care assistance program is the vital subsidized program to help individuals parents with child care assistance families are able to go to work and they have their child childcare a high-quality programs in to be ready for kindergarten this program support children from infant under 13 years of age. When we knew about that sugary beverage tax and the promise that all programs would be maintained and expanded will work very hard and volunteer time to make this a reality with the man to maintain the original intent of the parrot prioritize children youth and Families First family has been able to stand with the local Community College mayor mayor to honor the original intent of the sugary beverage tax. Good afternoon, council members. I'm here to speak on the support of SVT and I'm urging you to vote Yes to protect These funds that were allocated to the SVT. You're going to hear community members speak against it and we don't want this where the community is divided by the Mets. That's what I'm up here to stay. What are the things that we were supposed to be in this all together until today? You're going to hear a lot of Advocates speak on the SVT my goodness. I even wrote a song about fresh. But since I'm so what we want to do is be protective of these funds if the funds are allocated to the community in these new programs. It should go there and I don't think the mayor knows that dividing the community. That's bad. That's bad. We discussed this in the community a lot about people dividing the community. So we're asking that you stand with us stand with Michael brain stand with Sally Bagshaw because I know you're going to bully us Ellie and we are given up with Kelly. Thank you. After Tanika, we have Jim Kroger and then Victor Coleman and then Susan is it young or why you why I believe so. Danca Jim Victor and Susan. My name is Shaniqua. You guys all know food access organizer. I got green. I'm here in support of the legislation for a separate fun for the sugary beverage tax as you don't know the mayor took 6.3 million dollars from a revenue generated by the SPD and place it in general fund or is unable to be tracked. So that should use it for a program that you prioritize the most important component of the SPG is a fact that is reinvested into the communities, which it is most impacts low income people of color and working family communities to the organizations that are here today out of concern for their funding being cut if if this legislation passes, I want you to know that the mayor has the power to fund your programs and is working on her budget right. Now. This is a scare tactic to put our United organ organizations against each other each other the decision to threaten those who serve the most vulnerable resume. The Seattle is a poor decision got green. Like I like your organization's care about our community and all the work that is being done to serve their knee. Jim Jim Krieger co-chair of the community board for the sugar sweetened beverage tax today again. And again the cab reaffirms that support the establishment of a separate spt fun and Urgent the castle to prohibit any supplantation of existing general fund by spt revenues. We ask you to act now and not DeLay So these policies can take effect in the 2020 budget year for the past year. The cab has repeatedly called for establishing this Fund in preventing supplantation. We sent a memo to the mayor and April of last year or is the council take action October send another may have to the letter to the city budget office in April again of this year. So it's not new to say that ample time to develop remedies to restore the supplanted funds and honor the commitments May to community and a time to honor the legislative intent promise uncapped and delayed is a promise. I'm kept so there's no reason to further delay in the city to set up a separate fun. Answer Plantation. Thank you. Thank you. Which number is my name is Victor Coleman. I'm director of the Statewide childhood obesity prevention Coalition and member of the Seattle healthy kids Coalition. I'm here to testify in support of the ordinance regarding protecting all of the new revenue from the sugary beverage tax. This ordinance is needed to reinforce the legislative intent and purpose of the original SVT ordinance. Trust in government is such a critical part of a vibrant Collective society and the harm done when trust in government is broken or severed hertzfeld citizens, and the government institution. This ordinance is needed to rebuild that trust. Also, let's ensure that those important food access programs that were supported with SVT funds this budget year are made whole in the upcoming 2020 budget. Thank you. Begin, Marjorie Schneider will be at this mic and then following Susan admit of Michael B, Lindsay Lindsay Lindsay hovind. Please proceed. Hi. My name is Susan. Yay. I'm the executive director at Denise Louie education center. We serve over 500 children and families in the Seattle Community about 80% are immigrant and Refugee families and these cats that are proposed for this for the rearrangement of the way. The funding is going to graduate very significantly impact our children and families specifically in the parent-child plus program, but we are also the recipients of childcare comprehensive fun programs that are also scheduled to be potentially rearranged as well as food access programs like the good food bags from Seattle tell us so we are very this happens. All I can say really is we don't want to be part of your fight. All we want to do is ensure that our funding is restored. We don't care if it's the mayor we don't care if it's the council but we do appreciate the finding that has been leverage through the city the county and also the mayor's office and the sweetened beverage tax. So we are here to support your effort one way or the other but please make sure that are for And our staff and our children and families aren't hurt. Thank you. Good afternoon, and thank you for your time. Today. I'm Marjorie Schneider parent-child plus coordinator at Kindred kindering is a neurodevelopmental center, which is been providing services to Children and Families since 1962 and since 2011 because of the generous support from United Way of King County. We've been able to provide parent child plus funding the efficacy of parent-child + is exceptional and United Way's partnership with the city of Seattle for parent-child classes and long-standing parent-child + is a highly successful program that the city has prioritized funding for more than 10 years thousands of children and families who are low-income primarily children of color and immigrants and refugees the Council made a conscious decision to move parent-child plus from the families education preschool promise Levi sweetened beverage tax as a source of ongoing funding and can dream would like to ask you to maintain this commitment hindering simply wood. I'll be able to provide this service without your funding as a Seattle resident and a parent-child + coordinator. Thank you for your consideration. You're Marjorie. Correct? Following Lindsay is Heather Pearson Simone Adler. Good afternoon. I'm Lindsay Hogan with the American Heart Association to be here today and stand with the other community-based organizations here in support of council. Member of Ryan's proposed ordinance. Those of you on the finance committee have heard repeatedly from me that the American Heart Association has been solidly in support of the sweetened beverage tax since its Inception American Heart Association. We are here because we believe in the science behind this policy to improve the health of our community and we believe in the potential of the SVT funds to expand to serve more of our friends and neighbors. The proposed ordinance isn't coming as a surprise. It's not late in the budget game. It's right on time the mayor and Council have ample time to assess their priorities first city and make good on a commitment to community. Please restore the general fund dollars to fund these food access in early learning programs and pass this ordinance to ensure SBT. And are used as intended to grow and expand these programs. Heather Pierce Follow by Simone Adler than Jennifer Santos Cancel. My name is Heather Pierce Housing Association of Washington. We represent over 5,000 small landlords search for a framework that supports the preservation of affordable housing without driving more landlords to sell offered a more viable. Market-based Financial 5 3 7 and men's the notice of intent to sell ordinance to add increase delays and regulation for sellers to jump through without a viable public benefit. There is no evidence presented in conjunction with the law to support the need to lower the units threshold increase the notice requirements and increase fines and penalties to maintain low income housing in the city of Seattle. Will the intent of the law up here is at face value to be aimed at the property transfers in providing the city and tenants Advanced opportunity to purchase a building. It actually hurts individual owners, especially those who need to quickly liquidate for medical reasons or just simply retire the argument that owners. Small unit count properties only have to wait 15 days is disingenuous as a process could take far longer is in the public interest in the city's interest to preserve existing affordable housing stock for lower-income. Don't read that whole back side. Just wrap it up. Just wrap it up in a group of real estate going to have you removed if you continue. I just have to just wrap it up. Please got it. Thank you. Thank you. Thank you. Simone we followed by Jennifer here because I want to see our city council and I'm a Christian commitment to community and there's opportunity to do this through this ordinance. I would secure the funds from the sugary beverage tax revenue, see how to its intent on what you all know and have been hearing about witches for that money to be invested to communities that are most directly impacted by a tax on sugary beverages. The soda industry is known for targeting people who are disproportionately targeted by the purchasing sugar that money back into those communities. Set the pets rating it and so we need to make sure that this doesn't offend is is secured the sugary beverage tax revenue is secured and it's on silent. Good afternoon. My name is Jennifer antos and I'm with the neighborhood farmers markets in 2012. MKT organizations partnered with the office of sustainability in the environment to Pilot and implement the fresh bucks program. This program provides fruit and vegetable incentives in farmers markets and unlimited match dollar-for-dollar available to Shoppers using SNAP benefits to be clear. This is mostly funded by federal grants and other Revenue sources in the fall. This year under the initiative of OSD that who partnered with Community organizations, they expanded further to serve people in the food security gas and now has over 3,500 families on the waiting list in order for programs like fresh box to establish themselves show impact and grow to meet the rising need for food Security in the city reliable and consistent sources of funding or needed. I asked the council to prioritize funding for the agency and community-based providers currently funded through the sweetened beverage tax. Thank you for your ongoing support and commitment to our city. Our next three speakers are Gillian Basquiat past you to David Savion. I'm sorry Jack Lockhart is before that. So janica your next Jonica Lockhart Gillian p pescado and David Sabia, Julia. Good afternoon Council. My name is Jennica locker, and I'm with the president's office of Children's Home Society of Washington and support of all parent-child plus providers through United Way of King County. I'm here to comment on the sweetened beverage tax. We're deeply concerned about the proposed action that could impact future funding for parent-child + home visiting programs in the city of Seattle by $1000000. This nationally-recognized program increase children's literacy skills and support School Readiness if funding Cuts occur, we will face a hundred and $8,000 reduction directly impacting 34 of our families. These families are primarily primarily people of color from immigrant Refugee communities on or low income tax. Can you do 20 20 with the marriage and a fighting and proposing funding from another source in 2020. Thank you. Please state your name a good afternoon. My name is Julia prosciutto. And I'm a policy analyst of Puget Sound Sage over the last few years. We've seen displacement pressures grow in our city. The Equitable development initiative is the only fun that addresses the comprehensive and Tide displacement strategy and we need to grow and protect it to give you an example over the last two years. The city has funded projects like the Immigrant and Refugee Family Center to secure site control and prevent displacement of a child care center the food Innovation Center at Rainier Beach in Africa Town Plaza at Midtown Center in the last two years. We received over 30 million dollars of edge of eligible applications, but based on the mayor's budget for this year and next year. We will have 20% less money than was allocated in the short term rental legislation. We need to preserve the first 5 million from the short term rental tax for EDI grants for 2020. And Beyond is why we support council member of O'Brien's policy and oppose any amendments before Council today. Also here in support of creating a dedicated fund for the sweetened beverage tax and support the notice of intent to sell legislation. Thank you. Thank you very much David and then Scott bertani and I think it's Chun-Li, please go ahead 24. What is it's pretty pointless for us as an organization to try to train the new leaders of color in our neighborhood if they come to us hungry tired and stressed. That's why we have US Weekly dinners are nutritious and healthy. That's why we will study the Farmstand where they work and we supposed to Palms of color and we also have access to Fresh box for people in our community is also the reason why we swing positions available for Innovation Center all these reason I ordered you to make sure that both LED infp-t funding go today. Q director of North helpline where to think in Lake City and bitter like as long with other service parade or have other service that we provide as a member of the Seattle Human Services Coalition and the oceans of / 27 different 6:15 to wish that our city. Then tons of fetv upheld and supporting the ordinance and also making sure that funding continues as I have every confidence that the city council identifying food banks and other food programs as well as early childhood and tends to make sure that we are made whole land and fix the the supplanted funds if the mayor does not take that action. So I think you today for your efforts and support that, sweetie or So we have gone beyond our 20 minutes A Lot in it by a few minutes, but I'll extend public comment on this is your objection. Would you just have a handful of folks are still sign up? So I left your subjects and I'm going to continue with public comment for another session. So we'll start off with Scott. Ritani Shanley and Maria Miranda Scott, Jan and Maria. Yeah. Hi. I am the opportunity and I represent Lifelong AIDS Alliance which does business as to chicken soup Brigade, which is a community-based organization that does provide food bank Services Medical Nutrition Therapy community outreach and what not and we are here in support of your proposed ordinance eb-1 19551 and I just wanted to say we are the epitome of evidence-based therapy in practice and we followed the legislative intent of what that ordinance initially had been. So we were a bit of concerned that in the interest Transparency ineffectiveness that the mayor had sent out a letter that suggested otherwise in the concern that we have is that in 2020 if budgets are not necessarily going to happen the way she had suggested we want to make sure that our clients that we serve are made whole so we definitely support this and we would definitely have you no ongoing Communications to make sure that some of this inside baseball on how the funds are actually accrued happened. Thank you. Thank you. I am Chun-Li and from that seen you in action formation, and I'm here YouTube for petition for the continued food bank, and we had 800 people to get the flip from the food bank and every time you get the food and so me, so they're happy face, and they always say what they thought and that face. I never never see they faces happy. So I want to let you guys know that can you play continue to continue for the flu thing? Thank you. Maria once I cure following you because it really or Kaylee and then Keith Tucker. Facebook good afternoon. My name is Maria Miranda. And I am that I am here to speak in support of continuing home visiting service home visiting Services eliminate the barriers created by institutional racism and political turmoil. So that the low-income and underserved populations can have access to basic needs such as direct Emergency Services Support Services educational coaching and resource connections for the future for their future self sufficiency. What would what would it be? Like if you did not have food on your table a roof over your heads accessible resources for education for your children and you had to live in The Shadow Society shearing political threats of deportation to separate your family and Centro De La Raza slate founder one set. It is for the children that we work for they are the ones who know how to love for they are the hope of the world. And they are our future please. I meant cb11 95512 to state that the service is currently funded by SVT Revenue 2019 will continue 20/20 please no cuts to services. Is it Railey or Kaylee? Fella by Keith Tucker Kaylee? You got a killer. Hello, my name is Kaylee. I'm here on behalf of unified Seattle as somebody who cares deeply about those affected by homelessness and believe everybody should live the basic human dignity. I am important by the low barrier Shack enchantments near South Lake Union live in the area. I've learned that the homeless are in desperate need of real assistance, especially since drug addiction renders many of them extremely ill there drug that leaves them unmotivated and loss as to how to step away from addiction somebody to provide resources in a helping hand instead the city build small and Rags Shaq's where drugs run rampant and crime quickly follows. There is no guidance or leadership within these camps which leaves individuals to do as they please living in slave to their drug sleeping in filthy Shack surrounded by needles and trash is not human decency and we cannot continue to pretend that it is Unified Seattle on the other hand wants to provide solutions to this problem instead of doing the bare minimum. The homeless problem will take years of work, but these low-barrier shock encampments. Not the answer the city needs to go back to the drawing board and try a better approach because this is a poor excuse for care. Okay teachers for Mom and serafall and Keith B, Randy Banneker and then Michael. And Margarita Chen Michael, I can't make that one out Michael but you / it with Margarita. Shamso Keith Randon, Michael and Margarita. I'm Keith Tucker. I'm with the organization called hip hop is green with the first plant-based hip-hop organization in history. We received money from the sweetened beverage tax and we appreciate the money that we received our we got contracts and these are some of our interns here that are working on our farm right in the Central District, sawat right in your District. We have a farm that were teaching kids how to grow the food and then we have a chef that teaching the kids how to cook the food as well. We are directly affecting Health and Wellness in urban communities. We've been doing it for 10 years all around the United States 7000 meal served around the United States and we appreciate the council support on this bill to make sure that that funding directly affects kids that have to deal with cancer diabetes heart attack and stroke we are White Lies of making sure that these kids are healthy so come down. Thank you. Good afternoon. I'm Michael. It's the executive director of Chinese information and Service Center cic serves immigrants who speak Chinese Russian Spanish and Vietnamese in Seattle and King County are we like to check it with the positions earlier of the United Way and Denise Louie education center by the program. We provide to the community and children is parent-child plus the guy city council to ensure the ongoing agreement between the United Way in the city is honored by this program is vital to ensure that young children receive a School Readiness and close the opportunity gaps in Seattle. Thank you. One sec Randy falling r a newbie Anna Han and then oh my goodness. Number 30 on the food bank is like only Lou only little girl that shot show Randy Anna and only Lou I don't think that's president council members Randy Banneker. I'm here on behalf of the Seattle King County Realtors with regards to the notice of intent to sell legislation. I want to say that we appreciated the discussion further. We appreciated efforts to reduce impacts on sellers. We support Market solutions to increasing home ownership and transitioning tenants into homeowners. Unfortunately, we're concerned this legislation will restrict the purchase and sale of multifamily properties by slowing the process and that added time we worry will not adequately enable renters to transition into homeowners that what's needed is a wraparound process instead of resources to be in place many of these resources are already available through a r Change of first time buyer programs. We strongly urge the development of a framework that prepares tenants and not-for-profits to purchase housing in the open market place in the time frame aligned with all of the parties. Thank you very much. Thank you. Hi, my name is Anna how and I'm from Chinatown? And I know all the people and everything and everyone today and had a big and schedule for the foot pain. But I hope so. Can I cut the football, you know and all the people with a letter at 4 p.m. For the whole life and mine are all the people inside of a while here. Okay. Thank you. But she trying to hang us a document. Okay, what will have someone coming? I'm sorry. undertale music French thank you. So so the next speaker is number 30 is around the food bank. I could shut while you put put it on the dock when the phone number is 206-960-5706. You recognize that never I'm trying to pronounce your name Lou and then following that phone number. Go ahead. They call me. Jeeg. Only Lou and then Paula Reis Alicia a guard after that old lady that has low income the foot pain and the child male and diverse the whole city or phone number there. But there's a thank you. I also thank you and Lucille Paula Ruiz and Alicia a guard. Hello, I'm Paula Reis business owner have been in Seattle for 40 years specialized and how cities communicate I was here last week because there's only a handful of people that understand what this sign District overlay is going to mean our sign code hasn't been comprehensively redone since 1974. So when you talk about 500 and it's being in the code, that's super embarrassing because the new standard since 1994 on technology would suggest a hundred nits. I got the US Council Foundation the international Dark Skies. The international sign Association that are at 3:50, they're the worst because they sell these things a report for the City of Reno at a hundred 250. Why would we have technology Define our city that is in 1990 standard. So please look at that and also no data mining with these signed units Esten the newest. Thanks taking the public. Thank you. Thank you. Thank you Alicia here. So Lisha before you begin. I'm going to give the following speakers. We had we're on our fourth sign up sheet. And so we have to get on Earth are Jenna. So we're going to get the last 8 speakers are 9 speakers 30 seconds. So once you get your notes ready for 30 seconds after miss a guard who gets a minute and then she's just keep coming here. So we're going to get here from everyone but we're going to knock it down to 30 minutes after 30 30 minutes 30 seconds after Alicia and those speakers will be Christina so-so whiskey Erin chesky and Fran Yates Christina Arend Fran after miss a Guard youth organizer for feast s e e s t a few Justice non-profit that works to Center used in South Seattle around through just as increasing to access right now. We are unable to allocate this to increase funding in the school's. Both of our areas are in places are experiencing great food act like a back says until this funding was be meant for are used to talk with their peers to build structures and solutions. That won't be helpful to alleviate those instances at school right now. There are going to schools and Zarias. They're also not supporting their nutrition Health Children's Health in these areas. And so with his funding will allow us to do more intentional work in these areas and within these schools. The food acted doesn't just stop outside of school, but it's also important to drop their daily life that they wake up. It is why I buy you all continue to protect the funding that has been promised these nonprofits and communities that are too like you said they sent her those were most impacted by the issues. I had. Thank you. Christina hear Christina whiskey or okay. So that's where I move on is Erin chesky here. Are you Aaron? Okay, you have 30 seconds and then falling you befriend Yates, please proceed. Thank U council member and council members. Good afternoon. I'm Erin chesky with food Lifeline where hunger relief organization leading the turtle response to hunger by partnering with over 300 meal programs shelters and food pantries at Western Washington 88 within the Seattle City Limits calls all we like the original intent of SVT ordinance and know that stable predictable funding is essential to fulfilling its ambition ambition. So we encourage your support for this proposal. Thank you, Aaron. Fran will be followed by mirror Munoz. Hello, I'm Fran Yates. I'm the executive director at the West Seattle food bank in one of the co-chairs of the Seattle food committee here in support of the ordinance to have the sweetened beverage tax funds used as they originally intended. Obviously, very important to the Integrity of how these funds were used and I can tell you from the food bank World. These funds have been used to purchase food directly for the communities that were that are impacted by this tax. So, thank you. Mira Munoz and you'll be followed by a Gloria Hatcher mace. Thank you. Good afternoon. My name is Miriam. I'm the associate director of st. Vincent de Paul. We run the third largest food bank in the city of Seattle. We serve close to fifty thousand individuals and families many who also we serve affected and all of us here impacted. So thank you for listening today. I'm we stand with those who are keeping the sbts plan. Thank you falling glory to glory at please Sai semin Renny and Elton Mason and we clear the room, please proceed Gloria Council and thank you for the work that you do in support of those most vulnerable in our community. I'm here today to ask that you continue to support the funding as in 10. For the spt. I also would challenge you to look at a more strategic Pathway to downsizing the use of an SVT tax by incentivizing a reduction in consumption and what I mean by that is the food banks that I represent, especially in South Seattle Rainier Valley food bank could be instrumental in working with the community on education to see a reduction in consumption if the taxes reduce then we offset by funding from general fund until finally that taxes depleted. I urge you to think more strategically about your approach to this tax. saifullah by Elton Mason I get for justice. I'm here to support our partner operation sack lunch. We're requesting that you maintain councilmember O'Brien's bill because based on the promise of that who did Operation sack lunch to enhance services to criminally get impacted families and do food in education with them and very rarely do you get to make decisions not surrounded by Angry judges probation officers are labor unions. So this is actually something under your control. Marin Casino follow mr. Mason Hello, my name is Alton Mason owner Washington State Trucking. Unfortunately, I've been forced to follow lawsuit against the multimillion-dollar lawsuit against the city of Seattle. This is because the city house people that are employed that are abusing their position. So I'm not going to go into it. But if you have my information on the sign up sheet, so I'll be more than happy to meet with any of you about any of these issues that I have about to waste Fraud and Abuse with the city of Seattle with their Contracting program with the Wimpy firms, which is the women and minority-owned business the inclusion of these businesses, especially micro businesses on these multimillion-dollar contracts spu just didn't finish Mason going to just wrap it bottom liners. Sorry, I just said just just please wrap up sir. I just need a couple of things from you. Just please I need some from you had to wrap up. We need to data on these contracts with these contracts going to and we need to at least see who's losing them and who's winning them. Thank you. Falling mirror on will be missing a right to f o b dealer prepara. Good afternoon at Ellis Square project developed by Homesite in collaboration with several nonprofit Partners in South Seattle is one of many projects funded by the EDI through support the 3.2 acre lot in the heart of the Avella neighborhood, which would have never doubly landed in the hands of for-profit developers has now been taken off the market. I will instead be used to provide homes education and Business Development opportunities preserve the Multicultural identity of the South Seattle as well as prevent displacement of historic businesses Residence Inn Cultural anchors. I'm here. Once again to urge your support of the dedicated fund for both the EDI and the SVT. Thank you. Class 3 speakers Dila Dila here dialer and in Matthew Richardson and Carrie Moon. Those are nice 3 Hello everyone. My name is deal of her. I'm the executive director of Open Arms perinatal Services. We provide support during pregnancy birth and early parenting. We are one of the Early Learning programs that's funded by the city the county and the state here in Washington. I'm also the Early Learning seat on the sweetened beverage tax Advisory board. So I'm here to testify in favor of counselman O'Brien's effort to make sure that the tax is used in the way that it was intended. I know there are many Early Learning programs that are feeling threatened by the shift into planting and funds and as someone who is a colleague and a fellow with them. There's no reason for them to be threatened because the the primary reason that this tax was was in was implemented and one of the key objection objective was to expand Early Learning programs that they would lose funds is not something that is a problem that was created. So, thank you. Has Matthew interesting? Thank you for your time. I'm with nurse Family Partnership, like my predecessor here. We do home visiting for low-income first-time families here in Seattle King County area on the sweetened beverage tax ordinance understand the good governance intentions behind this bill, and I ask that as we went to the budget cycle that you remember Aris programs for putting the limbo in this process. I was encouraged that as we look at Birth to three language in the ordinance that we remember also prenatal programs as well and not limited to only those programs that begin at Birth, but also capture the good that can be done through peanut will work. Thank you very much. Thank you. Hi city council carry Moon here. And I was activated by got green and lots of the community organizations that pull people here today to support keep sweetened beverage tax proceeds for their intended purpose. I know the mayor is interested in solving lots of other problems, but we have 14 billionaires in this County. We have some of the largest corporations in the world cutting tax breaks for themselves at the state level. If we need more Revenue, let's go to those sources not take it from community-based organizations. I want to thank all of you for your public comment. We appreciate your participation. Please move to the next session section will be payment of the bills. Please read the title for the week of July 7th, 2018 through July 12th, 2019 and ordering payment thereof that please call the roll on the passage of the bill. O'Brien Pacheco Salon Gonzales purple, please read the report of the finance and neighborhoods committee on housing creating a fun for short term rental tax revenue 20 recommends the bill passes amended O'Brien, but just to let all know that this passed out of our committee unanimously last week actually 10 days ago. We had many meetings to discuss this opportunities for public comment. I want to say thank you to all of you who been so steadfast and working with us and letting us know what your priorities are councilmember O'Brien has led this charge and I would like to pass it over to you if you would like to speak to it. Just know that I appreciate so much the work that you're doing. It's incredibly critical to our community that we are funding all of these things both the ones that the sweetened beverage tax is funding now and what we intended to fund and what we will fund going forward 2 councilmember Brian. What is watch I'll try to be brief the short term rental tax as originally intended was dedicated to support at least the first five million dollars a year vehicle development initiative during last year's budget cycle about a million of that was in the proposed budget by the mayor was diverted to find the staff resources for the lady is supposed to Grant's I'm reducing the grant amount of 4 million. We found a way to increase at the five million of the budget by using cdbg money, but I understand that that money is really challenging for these organizations to actually use and so it was a Noble efforts in Philly tight circumstances last year, but it's not something that can be repeated in the sock created that money will be able to use his intended. What does legislation would do would dedicate in this order the revenues of the the short term rental taxes. The first five million dollars would go to Grants for EDI projects. We know that there are dozens of applicants qualified applicants each year for these programs and only a small handful get funded. There is no shortage of of really good programs. That could be fun. If there were money available. The second-tier would be 2,200 of the proceeds. Sorry 2.2 million of the proceeds will be directed to pay off debt for affordable housing projects Bonds were issued a few years ago. The next 323 million dollars would be directed to support permanent Supportive Housing the next 1 million and $69,000 would be directed to support. Staffing and consultants for UTI program and then any money on top of that cumulative amount which is about 11 million dollars a little over that would go back to additional Grant funds for UTI. Thank you cast my Brian any other comments or questions. I appreciate the fact that you were willing to amend the document as you went forward council member Brian. I think we've reached a good compromise and I'm certainly going to continue to support this. Comments before we take the road Casa Grande Pacheco. I didn't realize that I do apologize for that just this I think that's for the sweetened beverage tax admin and and I have a hard copy of and I believe it was timely. To suspend any rules. It was time to council member Pacheco. You're the flusher. House for sale 2nd and Orchard what we have here towards EDI grants and in 2021 and Beyond the financial policies would prioritise paying The Debt Service on bonds issued for affordable housing project by directing the first 2.2 million for this purpose. The next six million in revenues to the EDI would go to EDI EDI grants in Wonderland for Staffing and consulting services and then direct the next 3.32 permanent Supportive Housing and directing EXs short term review tax revenues to EDI grants The Proposal is consistent with the 20/20 endorse budget and would not result in any budget shortfalls. Unless run is coming below. What is predicted for 2020? Just said provided additional thoughts first. I'm supportive of the programs that this grant funds in the mission of the underlined legislation. This image is clearly states that any surplus funds in 20 would be directed to support UTI grants in 2021. The fold five million would go to the grants which is what the desire of the community community desire and any surface currents would also increase that dollar amount my intent on introducing this amendment is to follow through with the plans made last year to find the support required to carry out these grants given that this is my first party session in my approach to the budget is to give us the flexibility. We need to the important Services we all care about and know that our community needs a budget and a series of decisions that resulted in the comic a situation. We're in this amendment is about making communities hole in a manner that bounces are fiduciary responsibility or endorse budget and put us on a path account. Brian intents and underline legislation this amendment is about giving us a time to make sure that the program is whole for 20/20 while still supporting the underlying Financial policy began in 2021. As member Pacheco, I'm going to ask to speaker of the basic legislation speak on it. Can't remember Brian. Thank you to defer the restoration of the full $5000000 for an additional year and I don't think that's acceptable the demand for that role development Investments right now is significant and will almost certainly continue to grow again as I mentioned earlier. We found a I will be hoped would be at work around in last year's budget, but I know that the community organizations have struggled to take advantage of that and I think the most appropriate thing to do is to be responsive to the ADI granth applicants have been here today and it past meetings who want to see a stand up to the original commitment of five million dollars a year granted. So I'll be proposing this amendment. Okay, so we have a council member backshop. I am delighted to have the support of keeping things going in the direction that we endorse last year that said I'm not going to be supporting this amendment in large part because what we talked about it my committee 10 days ago councilmember O'Brien. I really respect the fact that you were willing to work with me on a compromise and I'm going to follow through with that agreement for the amendment any other discussion on the amendment? And I'll just share and closing that I'm not supporting them in a thank you for bringing it and having a transparent conversation in my mind this Equitable development initiative and the Investments for making are absolutely critical for preserving cultures and communities that are vital to our city many of them are are priced out through historical practices of racism and discrimination are finding challenges even more increasing with a present we have in this country and these Investments are Urgent and we should treat them as such and so I'm ready to support both this and and sweetened beverage tax as we move forward in simple terms, so I won't be supporting the minute. So we're just going to go down a minute. So having said that all those in favor of the amendment, please say I and raise your hand. That was one and a half milk. Okay, I believe all those opposed say no and raise your hand. Okay, so the amendment fails so now we have the basic legislation with the EDI and place council member or branded you need to say any more words are ready for a vote. Did anyone else need to close on this or I'm going to call for a vote to No Hands. Please call the roll on the passage of the bill Gonzalez purple president. 7 in favor one opposed Please read the next agenda item into the record 5.50 3.0 55 to the Seattle municipal code and providing additional guidelines for extending proceedings proceeds Excuse me. Give me a bill passes amended. Back. Turn over you first. Okay. Well, I believe that we have been speaking about this for the better part of an hour. And again, this was the item that council member Brian allowed me to share and my committee about the sweetened beverage tax and how we are going to be spending that money. I just want to articulate from the get-go. There isn't a single thing that either the small or the sweetened beverage tax as intended would fund or as we had funded through the general fund. We're going to have to find a way to support all of these Investments. But in the in the immediate time counseling bro, Brian, would you like to speak to it, please? Thank you again on this one too for finding the time you're committing to work with me through this colleagues and public talked about this quite some link. My goal here is to commit to the original intent of the sweetened beverage tax community members. We know or low-income community members. Music color are disproportionately affected by the stacks and they're also disproportionately affected by the negative Health outcomes of consuming sweetened beverage. That's because of specific marketing efforts by soda companies and also because of ability to live in communities that don't the reality that many people live in communities that don't have access to healthy food whether it's not affordable or simply not even available in their community. And so the original policy intent of this was not to raise revenue, but rather to dress the public health concerns and that's there's a tax component of that. They will raise him Revenue but it was critically important has been and continues to be that those Investments continue to go back to support access to healthy food and other Investments like Early Education for folks in those communities. This will create a dedicated fund so that all revenues from this will go into that fund that will make it easier for us all to track exactly. How much revenue Is raised and where it goes and it gets very explicit guidelines if it's money is to be spent on certain priorities and not to displace other funds but to be additive to existing general fund programs been on July. I want also thank all the people who came out and testified mini. You were still here are some who left last week. There was a lot of conversation about what this means. If you were to pass this it certainly would mean that we would rededicate these funding. So that's the intent to the programs provided that includes a variety of food programs the we heard from the mayor's office or at least department heads that other certain programs would be cut and I want to be clear that when the budget comes to us. We'll see what the mayor proposes that the city council will have its process almost two months long and figuring out what to prioritize and I will tell you that my commitment begin this year for the temperature in a row will be that we're not cutting other Human Service programs because those are a top Priority for me. We should dedicate this money is intended to sweetened beverage tax and we should also continue to fund fully fund Human Services and if they are sends a budget that does Purdue provide cuts to that. I will work as hard as I can with my colleagues to restore and potentially increase funding for Human Services. Cubs president there a series of amendments. I am sponsoring the first one and in support of the next 2 and so if it's okay to move forward two amendments, I'd like to propose my first amendment. Yeah, that's just walk to the mistake the first one please. So I moved to a man Council Bill 11955 one is presented in Amendment 1. I moved and seconded. This is simply a clarifying Amendment Council Central staff. Look at some of the language it would add language that says revenues may be used to maintain program expenses a new programs in accordance with subsection 52853055. B. The specificity is around central staff recognizing that it may not have been clearing allow that to happen. This doesn't change any of the 10 that we discuss it just clarifies what we'd find it very good. This is amendment only any other discussions on all those in favor of amendment amendment. Number one, please say I opposed the First Amendment passes. I believe council member Herbalife has amendment number 2 Thank you. I am moved to men's Council Bill 1195 51 is presented an amendment to please proceed to community members service providers and also to express our hope for the budget that the mayor of proposes to us in September and our commitment to address issues of concern related to other funding for other programs. If that budget does not come to us as we expect it. So the limited cells states that the legislation is not intended to reduce funding for any impacted programs and the executive and Council are expected to identify other funding sources to maintain full funding for these programs. Thank you. The amendment only if any other questions or comments on council member herrboldt Amendment actual I felt it was really important to demonstrate both to the community and to the executive that we're in the soup together, so I'm certainly going to be supporting address. Thank you. The amendment only all those in favor of amendment number to please say I suppose the eyes have it the amendment to pass has the accounts member Gonzalez has the third amendment. I do thank you cancel president Harold move to amend accountable one 19551 as reflected in amendments 3. Elaborate thank you so much. So this is an amendment that would once again further clarify and address some of the concerns we heard from some of our service providers who work in the prenatal space and provide funeral services. We heard from a few of those individuals today during public testimony, but we also had an opportunity my office at number to need to have dry conversations with a service provider to point out that some of the end of the story of language that we included in our first amendment related to expansion of services in the space of zero to three May or could be read to you exclude funding that we currently provide for prenatal services that would primarily be around our nurse to home program. For example, taking the word burst and including prenatal to ensure they were covering the full spectrum of existing and intended services to be funded in the future and that would Include those home visiting programs that I just mentioned in addition to child care assistance programs and parent child plus programs as well. Thank you for doing that. You want to come in after sleep? Thank you for doing that for including the prenatal. It's very important as you will know. Thank you. Cat Springs Hollis comments. You should have some comments here. But you know, okay, okay all those in favor of amendment number three, please say I oppose the eyes have it and we have a fourth amendment I think will be Best Buy customer Pacheco. I moved to a man Council Bill one 19551 as presented in Midland for elaborate. I would change the proposed Financial policies and accountability 195517 the use of the sweetened beverage tax revenues to supplement other funding sources beginning on the effective date of the ordinance this and then it would require are there any unallocated Surplus SBT revenues be used for expanding existing or create a new programs including program cost increases in size of the statue. This would accept that use of SVT proceed to supplement general fund money is in the adapter 2019 indoors 2020 budget, but it sure that none allocated Surplus Revenue in these years is used to expand existing or create new programs in accordance with the statute beginning in 2021 commitment would require that all SBT revenues be used only for expanding or creating new revenues new programs including program cost increases in accordance with the statue at line accounts on demand more time to create the heater create additional Revenue sources and a reprioritize Appropriations to undo the fun swaps. I also want to thank you for taking the time to engage on this issue. I haven't personally benefited from many of the Early Learning services in food banks hate these programs are very much personal to me and I want you all to know how much I am with you a second. I am saddened that this conversation has shifted to putting programs against each other. And when in reality, this is a conversation how we fund these crucial Community programs not if we find them tensions are particularly high around this legislation in the issue or Revenue sources. Generally, I want us all to take a step back from the finger-pointing and acknowledge that we all support the broader Community need for these programs and he's critical programs. They should not fall in the middle of internal City disagreements where we currently differ is in the approach. We think is the most responsible way to budget for these programs personally the path to restore and make the community's most impacted pole is to have these Financial policies take effect in the 2021 budget. It simply gives us more time to identify where the money will come from to fund the programs currently receiving sbct SBT dollar. I want to take my collie councilmember backshop originally introduced the amendment that out of this kind of flexibility. What should I support him committee? Unfortunately, we didn't arrive at this decision point overnight. It is for this reason that I am seeking an amendment that provides a path for us to fulfill the intent of council member of Bryant. I don't want to tie her hands before a budget season that I know will be a difficult one this amendment reflects my desire to have some flexibility going into that process to not make commitments before we are identified solid Revenue stream to back up our legislative goals. So again, I strongly support this legislation and intend I just want to see you scary it without Brantley tying our hands about funding for other programs. We all care about lastly. The city and how we got to this point Jose Community organizations that have been impacted by the decisions. We made an apology and I want to express my deepest sincerity and apologizing for the decisions that have led to this point and the conversations that have escalated in the last few days. You all deserve an apology and so for that I want to say sorry. I am asking I am pleading my colleagues to support my Amendment so that we can move forward in the most responsible manner, please. So we have a motion has been seconded and he even said please so council member back shows you like to speak to the motion of lead. Thank you. Not too difficult to know which way the wind is blowing on this amendment but none the less. I would like to speak to it and I'm speaking as your budget chair here. I'm concerned about a couple of things Violet by the way, you're right in your conclusion. But in the meantime, I have concerns about binding future council's by tightening down how we spend the money. I also want to acknowledge that like councilmember Pacheco. I have been deeply concerned over the last couple of weeks at what I consider to be a really by 2. 2 dialogue and a misunderstanding between people that have service people that are providers the executive in this Council, but first and foremost, I want to acknowledge councilmember O'Brien and all of us have been at this time. I believe the intentions are good. What I see is a conflict is that last year during our budget? We made some agreement about how we were going to spend the money both in 2019. And in 2020 in those endorsed. I think it's really important but it now brings us here and I want us to stop this fighting and knowledge what the good intentions were when the sweetened beverage tax was first passed and I also want to acknowledge Kirsten aerostat standing back there against the wall that you and I are going to have to start off and my colleagues are going to have to figure out where we're going to find six million dollars worth of cuts in order to continue. The program's going forward for 2020, but we will do that. I believe our good efforts now, we will figure out a way to invest in the programs that are now being paid for in the human services department DeLand ose by the sweetened beverage tax that now before Landed and we will have to find other General funds money. But to make it clear as budget share even though I believe it's the wisest thing to stay the course. I am going to support council member pacheco's limit here. I have a pretty good sense of what this is going to come out and when it comes time to vote, I will be voting. Yes for the underlined Bill very much. We are voting just on them and yet we have a few more speakers. I saw a council member her boat and go up first to find Cuts maybe if the mayor for poses a budget without funding for these programs as as we all voted for in amendment to as far as are our hopes for the executives intention. So I'm hoping that we do not have to find find funds for cuts to repair the mayor's budget and I just see this again I see this is Like much like the budget. I mean doesn't much like the actually took last week on the cost of living legislation. It's it's pre-budget work and it's us choosing to tie our hands on some decisions that we intend to make during the budget process and to allow supplant shit at supplanting of General funds in the 2020 budget would would go against our prior statements for what we intended to do and in that we voted on several times now, so I think this is really consistent with prior budget actions that we've taken and it's it is not irresponsible. It is actually fiscally responsible for us to be making this commitment to the public for how we are intending to make our future budget decisions in just a couple months. Thank you customer herbold. I'll let you have the final word since it's your motion LS accounts member O'Brien to speak now. Thank you as it would serve to potentially delay standing up to the true original intent of the sweetened beverage tax and potentially allow for up to six million dollars next in next year's budget to once again be diverted to other programs outside the intent of this. I think it's critical that we honor that intent. This is not the last time that we will have a tax that we work with community on and their expectations of what we do it that tax is critically important that we stand with what we tell them we're going to do so that we can continue to make good sound policy going forward. I also want to speak to any council member Herbalife put a very well this we are intentionally tying our hands this is making a clear policy statement that this money should be off limits. Except for the stated purposes. I was disappointed to see attempts to divide the community and it was really grateful. It's so many committee members coming out today on relatively short notice to speak weather. There are recipients of this or would not be recipients or perhaps their funding might be threatened because of some of the claims to say that we're not going to divide low-income communities and communities of color and turn against each other. We're going to stand in solidarity what happens next if it's possible if this amendment fails in the underlying legislation passes, we will see a budget from the mayor in about 2 months and I want to be clear that that budget will be the statement of the mayor's priorities. It'll be over a billion dollars in general fund money that she can allocate how she chooses in the proposed budget. We're saying this six million dollars that were discussing Which is less than a fraction of 1% of the general fund budget is off-limits for other needs but that leaves over 99% of the other general fund budget to list your priorities if it's the end of the day that mayor says The mayor says that the lowest priority that she needs to cut is some of the human service projects that she talked about last week. I can tell you that I am committed to not do that in to continue to restore those funds to call. I will be opposing this amendment in a I hope you'll join me in opposition to it. We can catch her and Brian. I will be opposing this amendment also, and I just wanted to say bike ready for Shuffle the six million dollars that were talking about. Yes. It's a very small fraction of the durrell's Cities total budget. But also it's it's something that we didn't expect we would have because that's the sweetened beverage tax has raised more Revenue than it was then we had projected for but let's go back to the original intent of the taxes was not meant as a revenue generator. It was meant as a mechanism to eventually have the funds be flowing back to the communities that are unfortunately because of the economic and marginalized circumstances are having to make having to consume foods and beverages that are good for your help. But the intent of this tax was never to penalize the community. That are facing these unfortunate choices. The intent of the tax was to make their lives better. And so when you have when they said he has six million extra dollars than those dollar should go back to making their lives better and as part of the original intent and I have to say I've heard can't remember back. She'll use her position as the current budget chair, you know the budget chair should rotate but that is one of the council members who as an as a council. We have to make a collective decision on the budget and I don't accept that as a budget share this this false idea fiscal responsibility. We all have a responsibility to make sure that that the budget passes by Charter the budget has to be balanced but that does not absolve us at the highest elected body of the city to find Progressive revenues and account number back short. So concerned about revenues that you should not have voted against the Amazon tax and for the repeal and and I were tortured all council members who feel that We don't have enough revenues. Well, let's make sure that this year the budget has more Progressive revenues not fewer all the time. And I would like to point out that on May 31st 2017 you voted against this and I voted for it. So it seems a little hypocritical and I'm going to bring those points up when we talked about the legislation itself. I think it is hypocritical of council members to vote for the Amazon tax repeal vote against every Progressive Revenue measure that we have brought to the city council in the last couple of years to the people's body movement and then say they probably don't have enough money. We're going to put Pitch programs against programs and all are good programs back to this Exchange in my closing remarks during the base legislation as much fun as we're having here council member Pacheco. Can you close this out on the amendment only sir? Sure. This conversation started long before I joined the council with the passage of the sweetened beverage tax in 2017 and the budget actions taken last year. It would also inevitably continue will be on my time on the council. I support the goal of this legislation to establish a set a separate fun for the sweetened beverage tax or that we keep the promises. We made as a city when we pass this tax. I think it's a conflict we find ourselves in today is the result of several unfortunate actions taken in the past. We all share some blame and I don't think people in Seattle want us to point fingers and play blame game. They want us to get good things done. Watch support the gold this legislation. I think we must get there responsibly this Council voted to approve the 20/20 endorse budget and I do not think we should throw a wrench into that budget at the last minute. Committee organizations that rely on spt funding budget with the 20/20 endorse budget in mind while we intend to backfill their funding if this legislation passes in certain introduced by this process is regrettable. I am asking that we get there and do so in a responsible manner that I think would best most benefit the people Seattle the community organizations here today as well as leaders in the pasta is the most responsible way. Okay. It's been moved and second. I'm going to call for the vote. This is just for this moment. All those in favor of amendment number for is Advance by councilmember Chico police Ai and raise your hand all those opposed say no and raise your hand know so that motion fails. And so now we have a base legislation that has been a minute with three successful amendments and councilmember Brian. Did you want to see a few more words about it? I emphasize the word few but this is important legislation. So go at it. I just want to thank community members who've been so active in this this was not an easy policy in the first place a couple years ago you had to do a lot of work to help us get the policy right and working with community members and I apologize that you have continued. To come back and work with us on this has been a long time especially in the last couple months and likely you'll probably have to spend some time during the budget making sure we still get it right and that's all time. They were taken away from conversation with community members to have healthy access to food. And so I Chase. I'm grateful for your advocacy, I hope to decipher the solidarity Racine Community today will help strengthen the organizations and we'll come out of this stronger than we were before. Thank you customer Brian accounts members to want thank you present as accurately pointed out. I didn't vote against the sweetened beverage tax and I made it clear that. Time to ultimately members that I voted. No because it is a regressive tax that falls disproportionately on the shoulders of poor and working-class people, especially low income people of color. But as community members have mentioned repeatedly that aggressive nature of the tax can be mitigated is the revenues collected by the task tax find their way back to the lives of the people who are having to pay the tax in the first place. So in other words. That's the intent of the legislation today to make sure that whatever revenues are raised through the ducks go back to the communities that are impacted. To be clear today is legislation is about how those revenues are used and not whether the tax should be in place of tax is already in place. We're not re litigating that matter here. So I will be voting. Yes on this Council bill because it will help ensure that the funds from the stacks are used to support the communities who are overwhelmingly paying for the tax. We have to have a caution in our understanding of legislation like this one by itself cannot necessarily succeed in mandating that the mayor's office do the right thing when it comes to the budget the mayor can always reduce the funding from the general fund going into programs that are funded with sweetened beverage tax like she did last year. The only way to really prevent that from happening is for community members to stay engaged and build a movement during the budget season, which comes in the Autumn so our work will not be done. I hope everybody understands that we will need to mobilize and and get organized for the budget and I invite everybody to Be part of the people's budget movement that has had a tremendous record of success in holding the budget process accountable. It is totally unacceptable. The way that mayor durkan has implied to Social Service organizations that their funding would be cut if they did not oppose or speak in opposition to date two days legislation and I congratulate all the community members and organizations for your courage in standing up to the pressure and also importantly rejecting as Violet and others have said that rejecting a cynical attempt to divide marginalized communities. We should always reject this kind of the Biden rule on this is classic divided into The reality is that these questions are being proposed because you know like the question about what happens with this small amount of revenue generated by the sweetened beverage tax in what is demonstrates is the fundamental problem that social services are chronically grossly underfunded across the board because the city has not make sure that big business and the Supervalu pay their fair share of taxes that has not happened. That is why we keep revisiting this question and always the question is posed as which programs to fund as opposed to other program that are equally good rather than making sure that all the needs of society in the city are funded because these are people's lives we're talking about if I darken was truly concerned about the finding that might not be available without the six million dollars that she wants to go after then she should not have repealed Amazon. In fact go to war against the city in order to repeal it because it was a one Concrete legal measure through which big business without being taxed and as I pointed out King County has 14 billionaires from 2007 statistics their 68,000 millionaires. I'm sure the number of millionaires as grown as as as as as just as the number of people who are facing a problem has also grown so many ways that the mayor could actually designed a budget in such a way that all programs are fully funded. She could you know promote progress of Revenue progress if she could stop the sweeps and use of homeless people and use the 10 million dollars that are spent on this beeps every year and fun 10 million is greater than 6 million why go after the sweetened beverage tax revenues in order to supposedly in order to fund some programs and the sweeps stop the sweeps and make sure those 10 million dollars are used for programs that we know work. In fact, just earlier today we heard from the Human Services. Edmond yet again that they do not have one iota of data to show that the sweeps of homeless people are doing any good but we have ample evidence of the harm they create and in the people who made last year my office propose using that funding for housing instead that did not pass but then the question is posed American Titans to cut funding for food in education programs as she has promised to do so many people need to build a people's budget movement to stop the sweeps to restore that funding. I will be voting. Yes on this bill to spend the use of our investor SPD revenues on food access and education programs and my office will continue fighting to make sure that Progressive revenues are expanded so that all the necessary needs, you know of society are funded and I really reject the efforts of the mayor to put one program against the other thank you customers want any other comments or questions customer mosquito to make sure that we did while off this specific funding the specific intent as we committed to the voters. I last year I too am disappointed disappointed by the unnecessary and manufactured crises among some of our most vulnerable organization. Sorry our organizations who serve the most vulnerable. I think that the information that has been put out there has caused concern and defends items among soaps and I hope what you heard today with clarification clarification that we can do both and we can both create a walled-off set of funds come in from the sugar sweetened beverage tax and continue to mate Ark maintain our commitment to these very organizations that are providing Early Learning and food access programs. I know that What is Express multiple times today? But I want to underscore the intent of the ordinances outline was meant to be used to fund the expansion of existing programs and the creation of additional programs for outreach and education for nutrition and early learning programs not to replace the general fund that provided the Baseline funding for these very critical programs. And so we know we can do both an expand the critical services and protect the funding that was always provided through the jungle fun at the city does face tremendous needs we talked about it every day from housing affordability and homeless issues from the crisis of equity in terms of access to economic stability and early learning needs to be intentional about how we invest our public dollars. We need to make sure that we're not in a situation where we're robbing Peter to pay Paul and especially in one of the most prosperous cities in the country. We need to not engage in Us in austerity budget. An austerity budget when we have robust opportunities to identify funding to go into Early Learning and food Access program. I want to thank some of the Incredibles 2 come forward and then multiple emails we received into also underscore with my Council colleagues have said and what the budget chair has said we can both invest in early learning and food access programs and maintain the Integrity of the sweetener to Sugar sweetened beverage tax and I think it's been said are already up here on the dice, but it Bears repeating that the reason that I think that it is important for us to maintain funding to go into especially prevention and education program as was promised in the sugar-sweetened beverage is to reduce consumption of soda to reduce the consumption of this toxic product that is intentionally being marketed, especially if you are black and brown communities intentionally being targeted to our lowest wage workers, we want consumption of soda and sugary sweet and beverages to go down and in order to do so we need those fun. To go into education and prevention program in nutrition to promote healthy eating to ensure that our local convenience stores have access to fruits and vegetables and not just unhealthy food and to make sure that our earliest Learners and their families have the support that he needs that was the intent of the sugar sweetened beverage tax. And today we're reaffirming that commitment that you all wanted in the initial language that was passed by the council by by voters by the council that was supported overwhelmingly. We want to make sure that this is a true commitment that we're keeping to the voters. So I'm really excited that we have the language that was included proud to be a co-sponsor with council member herbold O'Brien and Gonzalez to make it crystal clear that the legislation is not intended to reduce any fun programs currently funded with the with the sugar sweetened beverage tax and that we will redouble our efforts help. Remember someone mention it is every one of our responsibility when it comes to budget to make sure that these programs are kept hole in the budget. I reaffirm that commitment for myself to you. I hope that the full Council supports is underlying bill so that we can continue to work towards creating the both and approach and it's so early. It's mid-july we have plenty of time to continue to work on that. I appreciate all of the work that U-Haul have put forward today in the effort to support the sugar sweetened beverage tax initial intent and to make sure that we keep these other programs holes that we don't unnecessarily create additional tanks and confusion in the community. We stand with you and the desire to make sure all of these programs are served. Thank you again for moving forward this legislation so we can fulfill our commitment to you, but your customer mascara. Questions or comments? We're good customer could tell if eggs have been working on this particular bill, but more importantly isn't working on that greater effort around getting the sweetened beverage tax passed in the first place. I feel it's really important for us to Anchor this conversation in the commitments that we had originally made way back when in 2017 when we first considered this this legislation to label this tax to be levied against the people who consume sweet beverages in our city and back then one of the things that we we debated Ad nauseam was whether or not we were passing a piece of legislation that created a new Revenue stream for the sake. I producing a new Revenue stream meaning that we could use the money for whatever purpose we wanted to or if we were really committed to investing these dollars back into communities to we're being disproportionately and negatively impacted by the soda industry that in a manner that was so detrimental to our community's health and and safety and and really, you know, I just want to go back to that. Of time and remind folks that we have that debate in the end in the course of that debate. We concluded that it was important for us not to create a revenue stream for the sake of Revenue that really what we wanted to do is have a mechanism to collect additional Revenue that we could directly reinvest back into low-income communities and communities of color that would eventually interrupt the cycle of soda companies taking extreme. Advantage of our communities by targeting us for sugary beverage consumption and that it was important for us to make sure that we tied at the Investments back to that purpose. So today for me is a follow through on that commitment and the only apology I'm going to give to the community is that we didn't catch this when we first passed it in 2017 because it's always been our intent to to have this type of dedicated Revenue stream for these communities in particular. And so to those of you who have an expectation. It was an appropriate expectation and we should have included this language in 2017 as part of the original legislation, but I don't think that those of us who are sitting up here now if you were there in 2017, imagine a world in which we would be put in this unfortunate situation of manufactured division amongst communities of color and low-income communities. Frankly, the pumping out of terribly inaccurate information that is really resulted and creating a tremendous amount of fear. Amex community-based organizations who have very limited resources to begin with and all the minutes that you have spent in these Chambers to advocate for us to do the thing. We should have done in 2017 could actually have been spent right now serving vulnerable communities in the city of Seattle. And so that is a massive regret that we have to do this but I feel very strongly that we need to continue to support this this bill has been introduced by council member O'Brien. I think the intent is a follow-through of the original intense and I really want to appreciate councilmember O'Brien's leadership in this space and do see it as an opportunity for the city council to be a transparent and to follow through on commitments that we made to the public about what we were going to use these dollars for and why we were we were passing this route. In the first place. I was just wanted to take a moment to my office compiled a list of all the organizations and collisions that have written in in support of council Bill Lund 19551. I think it's important for us to acknowledge that not everybody got a chance to perhaps speak and for the full amount allotted but the list is is very large of the organization's who wrote To Us rejecting the mayor's narrative around what was happening here and in doubling down on their support of creating this dedicated revenue of fun those organizations include the tail healthy kids Coalition, which is made up of the Seattle neighborhood Farmers Market childhood obesity prevention Coalition or Cora Foundation American Heart Association shape, Washington and Central Asia Washington bus at Paul Sherman who is with a community health plan of Washington. Also a member of the community Advisory Board. Green Rainier Beer Action Coalition roots of all Road. Boost Mobile Farmstand feedback should not work Seattle Human Services Coalition including the Southwest Youth and Family Services. Why do BCAAs HSC Seattle farmers markets as a coalition Pike Place Market Foundation Queen Anne Farmers Market neighborhood farmers markets Solid Ground Seattle food committee Lake City neighborhood alliance Central Eric Lambert of kids company and the collect the community by those as a board and and individuals from that organization have also stepped up in support of this bill. And so I'm really appreciative of all these organizations really I'm being able to come together and seen through this strategy and helping us stay true to what the what the real intent is. So with that I am excited to you support the Bill. Thank you councilman Gonzalez. Any more brief comments? Housing a brief comment to I'll just say this thing. No, I haven't said anything. Those kids that wear my I never met at winking at 7. If I didn't like growing up. I was not a big fan of this text to begin with because I saw how it went to poor people than in people that just were Market at you like our colleagues said but that was our commitment to come in and that's why I got behind it and it's as simple as that and this legislation was called irresponsible. I think it's very responsible. We're not cutting anything. So it's very responsible. Okay, please call the roll on the passage of the amended bill. mascara O'Brien Pacheco Jayco no, Salon Gonzales 7 and favor want to post please read before the housing Health Energy and workers rights committee and multi-family rental housing to notify the Seattle office of housing the Seattle Housing Authority and the tenants of the artist proposed sale event housing and a many sections 22.90 7.0 30 and 100 of the tail on the committee recommends of a passes amended. Customer mascara for commenting on the notice of intent to sell legislation as you also talked about the need for a sugar-sweetened beverage isolated fun. So thank you for that. I won't take their exit. Mr. President as an indication that they don't because folks have waiting. So I appreciate that the notice of intent to sell or I should say that existing ordinance. It's already on the book struggle to compete with cash in hand and snap of properties within days of being listed and sometimes buildings are also sold without ever being listed on the market at all these for low-income buyers to get a foot in the door, including tenants and nonprofit organizations Community organizations that are interested in preventing displacement in helping to make sure that people have an affordable place to live. Does this Council has talked about multiple times? We need every tool in the tool kit to help make sure that we are creating you a first-time home buyer options that we are preserving affordability where we at work reading and building more affordable housing units those for renters and for first-time home buyers and that as we do all of this we create additional options to exercise greater self-determination in terms of how we access affordable housing the existing notice of intent to sell ordinance which many of you passed years ago with councilmember Burgess and Clark. I think who led the effort that had identified the multifamily properties of five more with at least one at 80% Ami or below should notify the intent to sell any property and provide a 60-day window before any transaction to allow an opportunity for affordable housing developers to submit an offer. Should they be interested in acquiring the building however as we've heard over the last If there is additional on tools that we need in that tool kit one is for those smaller buildings are those with two to four units and to create more opportunities for those developers in organizations to have more of an opportunity to potentially make an offer on some of those larger units with five larger buildings with 5 minutes or more. So we've engaged with community members and affordable housing providers on some of the industry folks who you heard from today to try to get some feedback on the ordinance in front of you and ultimately have landed on this legislation with the Amendments that council member Herbalife in council member bags. I have worked with us to include and I believe that it really strengthens the opportunities for tenants strengthens opportunity for organizations and strengthens opportunity for non-profit affordable housing developers, the purchase multi-family residential buildings, when they come up for sale Bevis either for individuals as tenants of the building who will now finally get notification before they're building goes up first. Or nonprofit developers who we want to facilitate the ability ability for them to either preserve the building or create more affordable units this Arena and to help preserve buildings or build more units so that there can be more affordable housing on the market as a whole and with this legislation. We will be able to provide notice to those entities so that they have more time to make an offer the proposed updates are not only intended to expand opportunities for tenants and nonprofits interested in purchasing properties come up for sale, but also take a potential pool of Neuse new purchasers, when we incorporate some of the language that council member Herbalife has been instrumental in including by making sure that the office of housing is what's a hosting educational program so that people understand where potential resources can come from as we pull in existing funding that has come from the office of Housing and other community. Development entities that have funding available for this type of purchase. We're going to build out our knowledge in the community about how to access these funds and potentially create more self-determination homeownership an affordable rental units on the horizon and we're also looking back as council member Bagshaw has spearheaded the effort in the legislation was going to be making sure that will hold ourselves accountable for this tool is working in the future and that we respond to the day that we get we want this to be a benefit to tenants to nonprofit organizations to community organizations that are interested in this and I believe that if we do sell we will potentially see more opportunities for those who've been historically not able to engage in this type of purchase engaging in preserving affordable housing and hopefully building out more affordable housing in the future. So creating a new pool of potential purchasers. Obviously, this is not going to be the one policy that solves any of our affordable housing. This is again one additional element to a much larger tool kit that we all need in order to create affordable housing across the income Spectrum, but specifically for our lowest wage workers and I really appreciate folks engaging on this legislation. We know we have other cities too full from and the national league of cities again in their report that they just released a few weeks ago highlighted this policy strategy as one important tool to make sure that cities are offering more opportunities for people to purchase these types of buildings and importantly the nonprofit developers and Community organizations along with tenants. So that is my comprehensive summary of the legislation and my huge thanks to all of the council that has engaged on this legislation and looking forward to hearing any concerns, but I'm looking forward to really the implementation side of things or any questions or comments customer Bradshaw. Thank you. I think we still have Council Central staff here. For all of your good work. I'm thank you for leadership on this council member Miss Kate. I want to underscore a couple of things when this does not impact single families single family homes with people that want to sell it also does not impact the large commercial buildings that people are worried about and I do want to acknowledge that council member Mesquite and I both reached out to Representatives that work for landlords. The reason we add the tears and the various gates for the 15 days was to make it clear that we're getting opportunities at people that might not have the information that they can get together and if they've got the financial wherewithal to put an offer forward, but I also without blowing any attorney-client privilege want to recognize and acknowledge that we did work with a lot of apartment on this. So some of the issues that were raised in the last week. I believe have been addressed so Thanks. I'm certainly voting for this. We'll see how it goes. We also have tide in an evaluation by the city auditor if we find it's not working. It can be undone. So I think it's a it's a worthy effort. Let's try. Thank you council member. chair Mascota for In our shared Amendment, I'm that was important to tenant Advocates and organizations working to promote Community Land Trust and low low-income homeownership specifically the need to do more to strengthen monitoring and enforcement efforts to improve compliance and help realize greater retention of affordability and promote tenant ownership in alignment with that as it relates specifically to strengthening monitoring making sure that properties that are that are required to comply with this law are more likely to be required to comply with this law or put on on I'm watchlist stats tenant groups and the city can work together and making early assessment of whether or not those are properties. Should they go up for sale that the city should work together with Community groups on identifying Funding and opportunities to support the purchase of those buildings and I think it also dovetails into some criticism that we've received the the rental Housing Association, which I actually don't see as a criticism whatsoever. They they refer to a similar legislation in Washington DC called the tenant opportunity to Purchase Act and they show that over a six-year. 5% of buildings subject. The requirements were purchased by tenants and I think that's given the fact that we don't have endless public dollars to purchase properties and I think 5% of eligible property is being purchased would be would be fantastic and I think what we really need to do not only is to support this ordinance and support tenants were looking to purchase properties in collaboration with the city. We also need to work on on the funding piece as well. Which I think is something that there is Broad agreement on no, thank you customers schedule you wanted to reach the council again and also underscore which ended with have so much more work to do to make sure that there is a non-profit developers and low-income tenants do have fun in that they can pull from Moana potential purchase comes up in the future. I want to underscore my commitment to that as well as we move forward. My hope is that this type of legislation in combination with robust funding and other public policies that we passed will lead to more Coop models more cohousing models more public housing models. As we're also making sure that this list of notification goes to the office of housing as well as Seattle Housing Authority. This is one critical element as we're looking for forward to creating more affordable housing ambos for first-time homeowners options of first-time home ownership options and for affordable rental units so very excited about the prospect of this and we'll be looking forward to working with all of you as we do the evaluation just a quick wrap it up to the community housing round table has been engaging with us. I want to thank you just sound stage and Washington Community Action Network who testified today in support and on RT Marin House of who's been a lot of research on this and is Tracy is listening crazy lab rats live from essential staff for her intense research and drafting of this legislation in addition to the Law Department who comes whenever bags that has mentioned has Burger King been working with us very closely on this legislation. They're excited to bring it forward to you. And with that I will stop Master present so we can vote Okay, if there's no other comments, please call the roll on the passage of the bill president Harold nipost Civic Arena 9566 row Lane to Broad Street transfer jurisdiction over the portion of Broad Street between Thomas Street and Taylor Avenue North and the South Department transportation to the Seattle Center department for purposes of constructing operating and maintaining a public skate plaza, the committee recommends it'll pass. Co-chair of the select committee on Civic Arena is Deborah War as with me as I prevent this because it was a selective and I think all of your familiar with what we're trying to do in these three pieces of legislation. The first one is pretty straightforward. We're just transferring the jurisdiction for portion of the Broad Street portion of Broad Street between Taylor Avenue North and Thomas Street without charge from s. To the Seattle Center and that's simply for the constructing and operating and maintaining a public skate plaza. Of course, this was caused by the work. We're doing over at Key Arena Seattle Center campus. And so that's basically what this does and look forward to your support any questions comments. Please call the roll on the passage of the bill pay rent on a post will pass insurance will send it. Please read the next gen. In the short short time. Please go to the facility use agreement with Force 10 Hoops LLC. The committee recommends a bill passed. Go against to this Council bill is relative to our beloved Champions the Seattle Storm and this basically modifies the facility agreement amendment allows the basically it it doesn't increase our potential liability the city was she continues to remain capped at 2.6 million. But what it does is Rico modify is the formula used to calculate relocation payments that it no longer makes a differentiation between additional costs and lost revenue and by doing that change it certainly encourages and incentivize the storm to fight the storm to play their home games here in Seattle rather than electric the location like Everett and I think many of you know that they're now playing at The Pavilion if University of Washington and want to keep our Champions local so that's what this does and it was a great upon negotiation any other questions on this great of the bill. O'Brien Pacheco San Juan Gonzalez purple president Harold Street, the next agenda item Centennial many sevens fit code sections 23.55 n 0 0 2 .00 3.005 and 23.84 HP printer 36 to add new SMC sections 23.55 planter 52.00 54.0 ft 6.0 57.0 58062 Savage sign for late destruction sign regulations for the Seattle Center including regulations for staff areas containing the Seattle Center area that receives me Arena and the brecci garage block the commuter rail passes amended think very much. So this last piece of legislation is basically creating what we call the sign overlay district and buy that immense the land use code to define a sign overly District that Basically provides the tailoring of the sign code Provisions at the Seattle Center the both the developers and city leaders. And those are the best of the project leave. This is absolutely necessary and shouldn't and sort of a catalyst for wayfinding and for the creation of vibrancy and it in the Southcenter and so the signage which do illuminate but they're not Mike Las Vegas type signs that are necessary for wayfinding again creating the fibrous who we want to see its shadow Center Arena renovation. I thought at the committee Table and there was some concern by both the and design commission and some folks testified about set of a be careful approach or whether this is the best approach that we heard I thought from the executive and the department some fairly compelling testimony in terms of how they limit the use of Sines. There's actually a total reduction of the amount of science Silence by tooth. Thousand square feet that was allowed in the original lease of the hours that science can be illuminated is cetearyl seem to be reasonable and as determined by the committee, and so this just decide this legislation was overwhelmingly passed out of committee and everything. Is there wise way to go any questions or comments that please call the roll on the passage of the bill Seco San Juan Gonzalez. Please be there for the Civic development public assets and Native communities Committee of surface and subsurface rights to King County committee recommends a bill passes amended the last three items. So we Are going to go quickly on this. This is a Discovery Park coordinates at Grant's utility easement of surface and subsurface rights to King County. They will maintain the Overflow Pipeline and channel and Discovery Park. We amended the ordinance in committee to adopt attachment 1 version 2 which stipulates that the city will be responsible for maintaining any natural causing disturbance to the easement. So if there's an earthquake it's ours. This amendment was agreed upon both by the city and the county and the committee recommends. I do pass recommendation on this. Please call the roll on the passage of the bill. Brian Pacheco Gonzalez. I just called the next agenda item to the record Seattle Parks and Recreation authorizing acquisition or built properly property commonly known as 2380 Northeast 125th Street South rice acceptance and recording of the deed for open space Park and Recreation purposes and ratifying confirming start Empire Axe the committee recommends to go pass. Thank you so much. This is an exciting piece of legislation for councilmember Juarez and D5 and in particular. It will allow parks to acquire a piece of land is located on 125th East Street used for open space Parks and Recreation purposes. It's on the North Fork of Thornton Creek council member was sent in a statement that says in protecting a pristine acre of salmon during stream will also Boost the flood retention ability of D5 main Watershed and council member. Whereas wants to thank Seattle Public Utilities Seattle Parks and Recreation Thornton Creek Alliance King County council member rod dembowski and the 46th District legislative delegation for coming together to get this done. So we recommend a unanimous approval that this piece of property be purchased think you can sperm banks or any other questions or comments. Please call the roll on the pastor of the bill purple president how to post member Seattle Public Library Board of Trustees for Trent April 1st, 2024. The committee recommends the appointment be confirmed MJ Rich. Most of us know him he's worth. With Board of Trustees for the last I believe eight years all of us know that he's exceptionally well-qualified without further Ado. Let us move forward with this phenomenal candidates appointment. Any other questions or comments? I just like to point out that this is a way to get it done three items in 3 minutes. I want a debate that just appointment now. I'm just kidding. Favor of the appointment. Please. Go die or those opposed both know the motion carries an appointment is confirmed. Is there any further business coming for the council really good okay with that. We stand adjourned in everyone. Have a great rest of the day. Thank you.", "end_time": 7437.0}]}