{"format": "raw", "annotations": [], "confidence": 0.9515884119968909, "data": [{"start_time": 0, "text": "Good afternoon, everyone and thank you so much for being here for our Finance in neighborhoods committee. The date is June 12th, 2019 a little after 2 p.m. I'm Sally Bagshaw chair this committee and I'm joining the council president Carol Gonzalez. Thank you for being here on Michael Brian who is here primarily to talk with us about sweetened beverage tax. So thank you so much for joining us for the entire meeting. So we've got three items on the agenda today. The first is a lease on thank you for Seattle public utility friends were here. The second item is our sweetened beverage tax and the short term rental tax statement of legislative and legislation intent response. And then we have the first meeting regarding the appointment of Bobby Humes as director for the Seattle Department of Human Resources. We will not be voting on Mr. Humes today, but this is our first First opportunity to talk with him and with the expectation that on June 26th just two weeks away at our next meeting that will have the opportunity to vote on his appointment at that point. So with that if there's no objection this agenda with a three items will be adopted. Carrie no objection the agenda is adopted and we're going to proceed. To public comment, we will now take public comment on the items that appear on today's agenda. I see that we've got eight people signed up and if I can just call you in order will have two minutes each. I'll ask you to approach the microphone. Please make sure we have your name and then the item to which you are speaking and then we'll keep moving and asked you to either lineup or be at one of the two microphones. So the first one is Lindsay a second is Jim nice to have you here. I know you've done a lot of work for us and looks like Leica. Wake up. Thank you. All right. Well, so Lindsay and Jim if you're ready, please proceed. Thank you. Good afternoon. I'm Lindsay hoping I'm with the American Heart Association and also here today as a member of the childhood obesity prevention Coalition. Thanks for the opportunity to provide a brief comment today. You can Heart Association was proud to support the sweetened beverage tax when this body passed in 2017 science told us that the time and the evidence continues to grow that this policy could help reduce the overconsumption of unhealthy sugary drinks and related chronic disease and directs critical funding to beloved established and promising Community programs and services leading up to the passage of this ordinance. There was much Community conversation and the communities desire to invest the revenue and food access an early childhood education was clearly reflected in the ordinance language, but let's go a step further. Let's create a dedicated account for these funds to improve transparency. Let the community see what money is coming in and where Going when it goes out the door. Let's ensure These funds are used for their intended purpose to grow and to expand he's learning and if you need these programs and services, so more and more of our friends and neighbors can and let's not use it simply to supplant underlying funding for existing programs. So, please uphold the city of commitment that was made to community to use this Revenue to provide more access to healthy food for more people and more learning opportunities. For more of our City's children. Thank you. Thank you so much for being here Lindsay gym, and then after an update, thank you very much committed to her back Shawn council members. I'm Jim Krieger. I'm co-chair of The Advisory board for the fbt tax here in Seattle. And as you know, the cat was established by the ordinance and makes recommendations to the mayor and the Council on how to allocate the tax revenues consistent with what the intent was of this ordinance, which is at the revenues benefit Seattle population. Who experienced the greatest inequities in education and health and the cab is really committed to seeing if he's revenues are allocated to promote racial and Health Equity including addressing the regressive and disproportionate burden of health problems associated with that says bees by diabetes poor oral health and obesity. So it's really the utmost importance to the community Advisory board at the revenue allocation is directed towards these low-income communities and communities of color to expand a healthy food at affordable food access and to expand access to Early Childhood support and education only then will that make this sugary beverage tax actually Progressive policy rather than arrested one. So therefore the cab is urging the council to honor legislative intent to use the SVT Revenue solely to expand existing programs to create new programs and not use the spt to supplant existing funding for these programs, but this was not the case in 2018 budget. We're up to six million dollars with supplanting General funds. And support existing activities rather than growth and expansion is intended by the legislation and is advocated for by the community. So therefore the cab has two goals would like to see an spt fund establish that would allow for transparent Revenue tracking expenditures, and also assure that the revenue allocation will be spent on new and expanded programmed with no supplantation. We know that the community stakeholders who support of these fbt. Text Cole for these revenues for expanding programs is Broad community support for transparency in the way. The revenues are spent and track and this will allow the cat to be more effective in performing his duties as well. So the last final point is if we can get this in place before the 2020 budget process, then we'll make 20 Penny budget process more transparent and more consistent with how we'd like to see the tax closing with the cap strongly supports a special fund for SVT revenues. Thank you very much. Thank you and thank you very much for your 2 minutes. And I want to really recognize you Jim and Lindsay both From The Heart Association free. Hard work on this we know that you spent Untold hours and your dedication is much appreciated. next item Lee kitanica, and then Abdi Good afternoon. Thank you so much. My name is Lika isn't what I am a registered dietitian and I sit on the community Advisory board on the food access seat and I'm also part of the executive committee as I want to thank you for the opportunity to be here and share public comment specifically about establishing the separate fund for the city budget to track the sugary beverage tax revenue. This is really necessary to have transparency and the collection and Investments of the fund from the tax revenue. Ultimately the separated fund will ensure that the city is upholding the original intent of the tax and investing these funds in an equitable way that will balance the regressive nature of the tax. So when I first started advocating when the process of the tax was being in place, I was talking a lot with different community members in one of the thing that kept coming up with people being really really concerned about attacks such as this looking like the tobacco tax where a lot of money millions of dollars would be coming in and then putting into a general fund. I'm so folks are really hesitant about that because it is regressive texting the people that are in most need of getting support. I'm so when the conversation shifted towards this money going towards Early Education, but more importantly the food access and there was a lot more support and so last year when the funds did get the planted in 6 million getting put into the general fund. There was a lot of that distrust that kind of came back up about how this was really being spent in the in the community a lot of concern about that transparency and accountability to what was originally intended for it. And so what I'm advocating for is having these funds be put in a separate account so that there can be tracking of its the transparency that is needed for the Community Trust but more importantly that there is accountability to having equitable distribution and really investing These funds into the communities that need it most and that are targeted by the sugary beverage tax by the industry and that we can have accountability to that commitment that the city has around social justice and racial equity. Thank you so much. Thank you very much Lika, Tanika Abdi and then yells mean. Hello, my name is Tameka Thompson. And I'm the food access organizer. I got green. We worked really hard to talk with the community and to ensure them that this was not going to be a regressive tax and something that they were going to suffer from we get a lot of door-knocking and we promised people in the community that this money was going to come back to them because they were the ones who are going to be most impacted and I kind of feel like I let them down and that's just because there was money taken away from the tax and put into the general fund that was exactly what they were concerned about. That's what they said to me. They said what will they put them? They're just going to put the money in general finding and do what they want with it. And I told them know there's an ordinance that states that there's going to be food Security Programs. Just wanted to be education programs and I tried to break down exactly where all the money was going to go. It's my name. That's out there. It's my job's name. God green. We're out there talking with community members. And so I'm very disappointed that my accountability is not you know may not be in fact, they may not want to believe me the next time I go out and talk to them. So I too like the members of the cab think that there should be a specific fun to track the money and that it needs to be applied as stated in the ordinance. Thank you. Thank you very much. And then it looks like Jonathan. Hi, my name is abusive and I'm here on behalf of Puget Sound Sage. We are aware of the displacement domestic placement is happening in our community and how we disapprove it affect his low-income communities of color need for a dedicated fund for Community Development. They need is too great last year. We had I believe 30 million asks for the EDI, but around 5 million available for it. If anything would when it is really to increase the funding available for comment and the EDI. We are here to argue you to bring a legislation this committee to create a dedicated fun for both the EDI and it's written text a a beverage tax increase was available. Thank you. Thank you. Yasmeen hi, my name is just me and fries and I'm a proud member of the EDI Advisory Board. I'm here to to affirm that we need a dedicated fund for the EDI initiative and sweetened beverage tax to match council's original intent for those revenue streams. As I mentioned rapid displacement is happening in our communities and one of the primary ways that we can prevent displacement is through coming Community Driven development development initiative is one of the only tools the city has to address the multiple Equity drivers and prevent displacement. There's a deep need for the EDI. So both last year and this year we have I think over 30 applications this year that are worth over 30 million and asks and are found is only 5 million dollars. So we we need a lot more funding to support this strategy and to have it be something that can actually work at the scale that is needed. The time is now we need to ensure that revenue from the short term rental tax which Council directed a portion of through ordinance to the EDI actually funds EDI by placing that Revenue in a dedicated the last budget cycle over 20% of EDI files were repurposed for other uses and thankfully the council replaced those funds for 2019, but we still have a million-dollar Gap in the 2020 budget. We need to resolve this issue now well in advance of budget deliberations, the council doesn't have to scramble to backfill the EDI budget, so I'm here to say that one of the first steps to dressing. This is to ensure that the revenue for the short term rental tax that's intended for EDI is placed in the dedicated fund and we are due to bring legislation to this committee to create a dedicated fun for both EDI and the sweetened beverage tax. Thanks. Thank you very much Jonathan. and then Christopher Williams you of course are welcome to join us at the table unless you're in the schedule to Please Jonathan welcome good afternoon council members about two months ago where we made a presentation to city council around nonprofits using Samaritan to elevate the outcomes of people experiencing homelessness to Quick updates from that time first. One of the members of the table who is with us a currently homeless Beacon holder Raven after 13 years of being on the street. He recently reported back that he'd secured full-time work and security had got a bank account. I was saving towards moving deposit. So I just wanted to know about that which is really exciting for us II idsc which is of course a city-funded shelter wrote a statement that I'd like to provide you guys if that's okay talking about their desire to give more people that they serve access to a Samaritan Beacon. I'm so hot. It's the right. I'll just hand it over to you guys and you can be with us today, but they've heard the statement for you guys at Council and if any of you are around afterwards and have a moment to chat about what can be done to to give potentially 2000 more people experiencing homelessness access to a Samaritan Beacon left. Thank you so much for being here. Mr. Williams Good afternoon. I'm Christopher Williams Deputy superintendent Seattle Parks. And it's an honor to be here today to speak in favor of Bobby Humes confirmation as a Seattle Department of Human Services director. Almost a year ago. I had a chance to hire Bobby as a park as a Parts HR Director out of a bill of several highly qualified candidates Bobby stood out to me because of his overwhelming enthusiasm positive energy. Bobby was not only energetic but I saw him as a type of leader the city should be hiring. He is a Next Generation leader for our time. I've not only been impressed with Bobby's energy and enthusiasm but also in his vocabulary and the way he phrases rather the phrases he uses to describe the Potential we have for city employees. I see Bobby as a leader committed to new solutions for intractable problems. He has Street Credibility with employees. He's almost in an evangelist for the CDs race and social justice initiative. I believe Bobby genuinely cares about people and puts human interest above transactional work and bureaucracy. Bobby is a people-centered leader for our time Bobby not only as enthusiastic and energetic and energetic. He is strategic and is thinking and he has a strong action-oriented bias. He simply gets things done. I'm happy to support Bobby Humes confirmation of the next director of sdhr. Thank you. Thank you. Thank you so much for your words going to rush right over here and read in the first ordinance the first item of Business Council one 19541. item number 110-711-9541 So I'd like to invite our friends from Seattle Public Utilities to come and join us. This is a lease that I know the LMU will be talking to us and Hillary. Thank you very much. And you're good to see you as well. So I'll ask for his for introductions and then you can Dive Right In. Hello, my name is Andrew Lee have the deputy director for greige Wastewater at Seattle Public Utilities. I am Ellen Stewart. I'm with the drainage in my sweater line of business at Seattle Public Utilities Hillary Hamilton with the real estate section at finance and administrative Services. Thank you. So who's leading this early. Carol O'Brien and Gonzalez. Thank you for having us here today with an SVU. We have a group of employees to focus on what we call Source control and pollution prevention. These employees are on the front lines of inspecting businesses for pollution and also responding to spill's or pollution that could impact our waterways as you can imagine their fieldwork and the 24-hour response needs of this group require facilities. I can accommodate their work and position them for the fastest and most efficient response today. We're here to talk about a proposed lease for a building that meets the unique needs of this group. The main driver for this proposed lease is the loss of their existing office space in Ballard because of the SP use ship canal water quality project that Mega project is a 500. Million dollar project required by federal consent decree with EPA Department of Justice in ecology to address combined sewer overflows into the ship canal in Lake Union The Source control on pollution prevention group will be vacating their existing location to accommodate the existing the construction activities for the Ship Canal water quality project, which will begin at the end of the year and hence the need for the new space. So Hillary Hamilton and provide more details on the process we use to identify the space are their unique needs and the terms of the lease agreement important role in protecting the city's drainage and sewer system in our waterways from sources of pollution. The work is required by the city storm water and wastewater permit under the Clean Water Act. We have 19 staff a fleet of 16 Vehicles one spill response boat and to spill Supply trailers. As Andrew mentioned the nature of the work is very feel base. We do 24-hour spill response for the city. We do sampling and monitoring and we work with businesses and residents to prevent sources of pollution. We made efforts to mobilize our operations so that our staff can spend as much time as possible in the field and you'll see on your PowerPoint example of the kind of work that we do. I also just wanted to review some of the history which is brought us to the point of asking you to approve this lease historically our division with split between two locations that smt Tower and our drinking water lab and they were brought together to the Ballard operations building in 2017. That property was purchased as Andrew mentioned as part of our ship canal water park water quality project and that move was always intended to be a temporary one as the project and construction staff will occupy that building during construction and Matt Lanter also mentioned. It's really that project schedule that's driving our timeline here as the contractors will begin to move in in January and every month of delay to that project is about 1.3 million dollars. The team was originally scheduled to move to the spu South Operation Center in late 2019 with our system maintenance staff that project has since shifted in scope and it's no longer feasible for us to be there. Also that site does not provide the needed boat access and the ability for our Citywide spell responses. It was really intended for our South operations Cruise. So with the change in scope in the fall of 2018, we knew that we needed to move quickly to find a spot and secure release last winter. We worked with FAS to identify possible sites that met our criteria. We evaluated 15 sites. We visited four of them. We review crossword puzzles for 2 and ultimately chose the wharf building as our preferred option. The Wharf building is located at 4209 21st Avenue West overlooking Fisherman's Terminal in the interval neighborhood it offers the ability to renovate the space to match our unique field needs. It offers an area for locker rooms equipment repair lab space will have an area for decontamination for our spill response laundry a secured parking for all of our 16 City vehicles in our spell response trailers and will be we will be able to maintain our boat moorage nearby within 5 minutes Drive, which is a covered in water secure boat storage that's important to us and it allows us to respond very quickly to Waterway spills. So overall we think this is a great match for our teams needs the primary responsibility for engaging in leasing activities on behalf of itself another city departments, and we are obliged to bring certain leases to the city council if they exceed 5000 square feet of office space if they exceed five years and if they exceed a baseline of rental, right, so that is why we are here today the lease with broad Acres LLC that owns The Wharf building provides about 7760 square feet of Warehouse locker rooms in office. So it captures all the criteria that spu had it has secured. Working and Equipment spaces, which is excellent for City vehicles. And we negotiated a 10-year term. There's also a five-year option to extend one of the things that was important to spu is option to terminate early. So they're hopeful that they'll be able to move back into the Ballard office building as the project completes, but we provided a window of opportunity in case there is a desire to do more with that other building or Other other City needs one of the advantages here. Is that the city as an entity has the tenant and so if we want to take down a little extra space for project staff or other City inspectors, perhaps we'll have the ability to do that under the authorization. We've asked you for any ordinance. The rent is about $38 a square foot that was comfortable with some of the other buildings of a similar type and size. Especially when you take into account the fact that bass utilities are included in the rent. Also this landlord did provide about $40 a square foot or $310,000 in improvements that will help with some of the specialized need like the decontamination area and locker rooms and someone so I we feel like it's a a good lease. So thank you for breaking me on this recently. I appreciate your allowing me to do Deep dive on questions and I wanted to underscore that that you concur that this is a routine ladies. This isn't anything out of the ordinary that we haven't you wouldn't have done for other departments. And also if you could talk to us a little bit about and you mentioned it, we have a five-year option to renew and they wanted to extend it. But you also have the two year prior to the end of the 10 years should SP you decide that you wanted to terminate the lease. So do you want to describe please just the Savings in the end the flexibility around that option in the lease. We have found that most of the leases that we bring the council. We are including at least one five-year option and I think in this particular case with the Project based need that was particularly useful and that is A pretty standard Clause that we are including in Lisa's the early termination is slightly different. We have done it before certainly and it it again. It's it's the other side of the flexibility the landlord wished for 10 years. And so rather than negotiate for 8, we went with 10 because then he was more willing to provide the tenant improvements and be able to amortize that Spread spread out that cost over this the least revenues for 10 years that the city has the ability to give notice at the end of the year and I are to leave at the end of the eighth year with one year notice and that just provides flexibility for the project and we may or may not want to do it. But it's there if we need it very good counsel, Do you have any thoughts or concerns about this lease? No further questions. Okay. Well, thank you for that. Thank you all for being here than I would like to move Council Bill one 19541 those in favor. Say aye any post and nobody's abstained. So thank you very much this passes and what this will move forward to our full committee on Monday. I appreciate very much the work that you put into it and again the briefing so Let us move on to the second of item of business Allison you want to read this one into the record and I'd like to invite our presenters to come on up. Item number to sweetened beverage tax and short term rental tax statement of legislative intent response prefnant discussion. very good Yolanda and Allie, would you like to introduce yourselves and then cancel Central staff job for me here Ali is this your lead? Yes. Good afternoon. Council members a good afternoon the speed up during the fall 2019 budget process requesting that the city budget office submit legislation by March 28th, 2019, that would create separate funds for sweetened beverage tax and short term rental revenues and proposed Financial policies for use of those funds are to me those revenues. The slide was in response to the executives proposed spending plans for calendar years, 2019 and 2022 not fully aligned with the council policy intent when they initially adopted ordinances establishing these taxes on March 28th to CVS submitted their response, but the response did not include The proposed legislation or did it propose Financial policies instead of outline their proposed approach which is to transmit legislation to establish the funds and financial policies when the 2020 budget is transmitted to the council in September today to London. I will briefly outline a few policy considerations for the council about why waiting to establish the funds and financial policies may not be in the council's interest and provide some background information on the two taxes summarize the legislation that we have drafted at the direction of council member O'Brien that would establish the funds and financial policies and out of line. If you alternative approaches council members could consider if they move forward with this legislation. So first, I'll just provide some of the broader policy considerations and then we'll dive into the two specific fun. So the main policy consideration here is that the 2019 and 2020 budget allocated tax revenues from these two sources in the manner that did not fully aligned with the council's in 10 and it did so in a manner that made it difficult to amend the spending plan without reducing or eliminating funding for other Council and City Pride priorities by previously been funded with one-time funds the Council of course always has the option of amending the proposed budget and Associated budget legislation. However, the primary purpose of requesting the legislation this March was to provide time outside of the compressed budget season to develop clear Financial policies to inform the 2020 budget and future your budgets. So there are several options council could pursue one would be to take no action now and await the legislation being transmitted with the budget. This could be coupled with a letter or resolution expressing counseled expectation for what they would like to see in that legislation. Another offer option would be to introduce councilmember O'Brien's proposed legislation and I should note that the legislation for the short term rental tax fund and financial policies was actually introduced during the budget process. But Council chose not to act at that time instead went the route of submitting this five. And of course you could also just do legislation for one but not both of the fun. So you are a variety of options in front of you. If the council chooses to go with the executive proposed timeline, which is wait until the 2020 proposed budget is transmitted to establish the funds. The mayor's proposed use for the revenues is likely to be what was included in the endorse 2020 budget and may continue to be inconsistent with councils in 10. We've been in the same position that we that counsels in last year and trying to identify Cuts or proposed new Revenue sources to adjust a spending plan. If instead the council chooses to act now to adopt legislation in establishing the funds in the financial policies. There may be some chance of those financial policies being reflected in the proposed budget. However, is likely given that what is in the endorsed budget is inconsistent with councils original policy and 10 for the funds likely that the budget would be proposed in the same manner as what was in the endorse, but at least the council's in 10 would be clearly articulated and then the discussion in trying to identify Cuts or new Revenue sources in the fall, but it would be transparent. I'm in everyone would be on the same page in terms of what the goal is. So now I'll turn it over to Yolanda to provide some detail on the Thanks, Holly. So I just as a quick refresher, the sweetened beverage tax was established by ordinance in 2017 and died January 1st, the city began collecting revenues and it is a tax on the distribution of sugar-sweetened Beverages. And so the ordinance established Financial policies to direct the revenues for specific purposes. Some of which are one time are limited duration expenditures as described in the memo and others are ongoing and those are particular to support the efforts to expand access healthy and affordable Foods closing City close the food security Gap and promoting healthy food choices as well as early childhood development in some Administration supporting administrative Services of the city. So as we as a lie just mentioned the proposed during budget last year that proposed 20 19 2020 budget so based on the revenue for guess I should back up a little bit. We had anticipated that the athlete she would bring in a class of 15 million dollars but turned out that it actually was bringing more than that. And so while there had been a spending plan in place for the original estimate given the additional revenues what we saw in the budget last year was that approximately 5.7 million dollars of the unanticipated access Revenue was used as a plant general fund money is 4 / guns administered by the department of Early Education and early learning human services department and offices office of sustainability environment, bring up the general fund for other purposes, which did a line with the spending guidance in the Ordnance though. I was not in Barely in alignment with the intent that these revenues be invested in the expansion of existing programs or creating new programs in accordance with the statute. So instead some of that money was then used to essentially maintain the same level spending for programs such as food banks a childcare vouchers in the parent-child home program, which raised concern among some stakeholders including members of the council and the community Advisory board. So this is kind of lettuce to where we are now and so under the directions Hilton Harbor O'Brien worked on legislation that would establish of funds for SVT revenues and allowing for the tracking of that money separate from the general fund and in addition to the existing the financial policies that were included in their originating ordinance, but this Legend What do with codify the spending guy dancing? So it would be in the Seattle Municipal Code. So for the public to see easily versus looking for the ordinance online and also would add some additional guidance and that it would require that the excess revenues be used solely for expanding existing programs or creating you program. Is that align with the SAT spending Garden so counselor can consider that as an option or potentially more allowing for more flexibility for Access revenues Branson some portion could be appropriated according to the community Advisory Board identify priorities another for specific programs such as food banks and the remainder left to the discretion of the executive so lots of different options with that and I'll turn it back to Ali and a few questions. The chair just at the Freddy or should we stop at that on the sweetened beverage or should we go to the short-term rentals second. I just had some questions about that. everspace Beck weathers legislation, okay, so let me contacts question. So when we set up the The Advisory Board the we gave them a discretionary amount. I think it's two or three million. I'm making that part. But something for them to decide where that would go in in that group as I recall they were both. Food experts if you will and some education folks, I think rather so was their task just sort of looking at their pot that they were distracting where to go or they all stood out. So I have some kind of oversight function of the entire fun the weed. I can require we set that up what happened in 2018 was at the commune Advisory Board was so yes. There was a reserve set aside and the went once members were appointed to the Canadian by three board. They were allowed to cut of allocate that those monies as they saw fit and also their ongoing role is to provide some of the advice and recommendations to the council and the mayor and so yeah just got a recommendations on how many so so what they did last year was provided to the council the mayor that they wanted like a certain percentage to go to Food access. Send us to Child Development. And so they did every year they they will provide us with Guidance the recommendations by understanding on that first year was that it was going to take a little while to get the cab established and it includes both food and education experts and they are going to send the money was in the coming in immediately and instead of having this group, you know be formed on day one make recommendations. We allocated some money in that first year as part of the budget and The Reserve Center said after you guys get established and build a relationship with each other will leave a pool of money for you two to make recommendations on for this first year. My understanding was in and then in subsequent years they were vampires. Where you'd like to be directed at first first years worth of money cuz they were largely potentially ongoing programs. We were things that they ultimately did agree with your priorities. First last question I was going to my last question is the that we know we started at a good problem. And we had the Surplus do we project in years to come that is going to start going the spiraling down his behaviors change the revenues going to go down or do we think it's pretty much leveled out now and it's going to be a level Revenue Source. Do I have an assorted guess we're never trying to get information forecast a downturn and had been annexed to the whole structure was really budget with the idea that for a while we would take the first 20% and not committed to ongoing sings cuz we expect that we could see it down turn it up as much as 20% so so far we've only seen gross but that's not we're not doing this because there's more soda being consumed but rather than as a system is as tax collection has become a limitation and more folks have come into compliance. That's really much more about a compliance issue. We think of you understanding what their responsibilities it's a little too complicated cuz the taxes actually on the distributor not on the retailer. So so we don't think it's time. We haven't seen a behavioral in fact that we expected either so legislation to look at where the revenues go, but I was equally concerned about the implementation the behavioral changes or lack thereof the impacts on small businesses, whether we have to me to get there, maybe we don't just sort of what happened now that we actually have it in as we focus on the revenues. I'm hoping that we can work on the the the tax itself and where we can improve what we thought. Well we've we've learned a lot since then when she's really been an interesting a lesson. Castro's in Helmetta contradict you but you made a comment that you know, the good news was he got more money and I from a revenue perspective. Yes the policy especially on this was was really tricky ever heard and public comment. There's a lot of economic evidence and public health evidence that by putting a tax on something you want people to consume less of it makes that one product relatively more expensive hoping that behavior will shift to the less expensive products, which would hopefully be at least an umbrella to the perspective and healthier. There's also an economic impact that this is because an income effect on people and it's actually makes them poor either because people don't have choices or it's still not enough to offset it or for whatever reasons may be significant millions of dollars that we spend on marketing to certain populations that will continue to consume and just be poor and to the extent that we collected 8 million dollars. How is a is a disproportionate tax in your Falls is proportional or incoming can you need to color a good thing from revenue for the city? It's really a bad thing for my perspective in that we we are impacting certain communities more than we thought we were and so I have discomfort about this tax in general just because when we're looking at our race and social justice schools, a disproportionate tax would normally be something we wouldn't want to do. We do have experts that are working with communities. We heard and testimony today talking to very community members that says we are proposing to tax you. But we want to reinvest that money in your community. And so that's the Crux, you know from an economic perspective. I could negate the income effect of the tax by simply collecting the money and then giving it back to the people but saying you can use this to buy juice and I'll be less expensive Rings used by, you know, coconut be more expensive but we can't just give cash back to individuals because of other reasons, but we can invest in ways and maybe even have a better impact for trying to do and that's that's where I think I'm trying to get it. It's an amp is fun. In our next meeting perhaps we can review what we received from the University of Washington earlier this year. I thought their analysis was great that team was showing where and we're across the city. We were collecting money and I believe there was scheduled to come back in September to talk to us more about the actual income that has been raised and where it's been raised so that we can have more information about this but I think the point that you're making council member Bryan you been really consistent about this is that we're collecting money from communities. We want to make sure we're reinvesting and things that was the original underlying intention to talk about policy standpoint the hear from you that there hasn't been a lot of evidence that that tax has been declining but I also understand the conversation just a brief conversation I had with Jim a few months ago. There is some evidence that behavior is Shifting and so I think that's his premature to discuss that at this point, but hopefully relatively soon we'll get some more date on that and see where it's going. Just just for the folks that are like is a tax working or not. I say let's Reserve judgment on that one. I couldn't even more so that it's really hard to face at the text. We never knew what the tax base was until we apply the tax. So it's taking us while we really haven't stabilize the revenue Source from a collection perspective to start drawing the kind of analytic conclusions were ultimately need to I want to commend our friend from got green if she still here where does just I appreciate so much that she was helping us get the word out to the community about what this Grandma was designed to do and that we would be reinvesting and I like the fact that you said that your names on the line at my really respect the work that you've done on that second point is Washington voters across the stage and I think it was like 5545 voted that going forward other than the city of Seattle that other cities could not impose this tax, and I thought that we might be able to adjust it somewhat I'm not sure that we can like for example, we can extend it to diet drinks with a concern for me every bit as much as sugary beverages but that said I'd like us to focus back in on the policies here and what it is and why it is that we're bringing forward on potential legislation. By the way that we're not voting on anything today. This is just informational. And I will just add one more thing about the community Advisory Board also responsible for publishing an annual report on the tax and so and programs funded by its own and that is expected to be completed either by the end of this month or early next month. So that could be another additional point for adding to the discussion short term rental tax locate any other questions on this point. So just as way of some background on the short term rental tax as a defendant a little bit more of a bumpy bumpy pop in 2017, the council adopted a local per night tax on each short term rental operator in Seattle the primary goal for this tax or the 10th for Generate creating this new Revenue Source was to create an ongoing source of revenue for Grants provided through the city's Equitable development Initiative Program that would at minimum provide $5000000 for Grants to come. I manually end and then anything about 5 million to provide funding for new affordable housing projects or to be used to pay the debt service on bond issue bonds issued to develop new affordable-housing the legislation outline. The council's intend for use of those funds in the in the manner. I just suggested the first five million for EDI grants the next 2 million for investments in a portable housing and then anything about that could be split between both the non housing and housing portions of Equitable development projects. Following adoption of the local tax the state adopted a tax on short-term rentals with the with information in that legislation that if the city repealed their local tax and tax revenue generated from the state tax in the city of Seattle will be directed to the city. So and that was a rather than a per night tax was based on the the cost of the cost of the rental and so is more Equitable and frankly defend the city didn't have to implement a new tax. So the city repealed the new local tax with the intent that the tax revenue generated from that Source would be directed in the same manner as was described in the local ordinance. The state bill was less specific about the funding at directed money for used for Community initiated initiated Equitable development projects as well as affordable housing, but was not as prescriptive as the local ordinance the spending plan in the 2019 and 2020 budget supported civil Council priorities broadly speaking related to afford. Housing an equitable development however, used revenues to support staff in the office of planning and Community Development and Consulting resources for the Equitable development program rather than providing a full $5000000 in Grants to the community and to support existing Supportive Housing Programs and the Seattle rental housing assistance pilot rather than investments in new affordable housing projects. So this was not entirely consistent with a council's original intent, but I think this sort of highlights one of the policy challenges here is that it is funding other Council priorities. And so there are trade-offs here and trying to use these new Revenue sources to buy new things essentially and how we find existing ongoing expenses or program the council or the mayor has proposed in previous budget years. So the council was unable to find ongoing resources to fully aligned the proposed spending plan with the original intent. However, we were able to ensure that in 2019 a full $5000000 would be available for EDI grants by reallocating some Community Development block grant funds, but we're not able to fully restore the funding for 2020. So the endorsed budget only includes four million dollars for EDI grants. The legislation prepared under the direction of council member O'Brien would establish the fun and financial policies for the short-term tax proceeds that would be consistent with which was what was included originally in the local tax ordinance. If the council moves forward with legislation, there are some modifications to those policies that could be considered one change would be rather than allocating the first 5 million to EDI. You could consider directing the first 2.2 million to pay the debt service on bonds that have already been issued for affordable housing projects at the stage. I think it is looking like we will have more than 2.2 million dollars coming in from for a term rental tax revenue. But in the event in some years if revenues for lower would ensure that were first paying our debt service prior to issuing grants in addition or instead the council could allow more flexible use of short term rental tax revenues in 2020 essentially to reflect In the proposed spending plan in the endorsed budget and then put in stricter policies that would go into place in 2021 or later. That's all I have on short-term rentals the two proposed she got in there, but you know where you got where you at, but going into last Fall's budget process in developing that we can challenge around homelessness and homelessness funding soap dispenser some pasta, press on, it's an important important piece of the story. So the previous fall Council has approved some significant potentially ongoing funding for homelessness program homeless services on the expectation that there would be a head tax that would provide the ongoing funding for those and then ultimately proved not to be viable. So the 2018 budget included one-time sources that were funding A series of ultimately ongoing Services shelters and the like in the expansion of those services that was in the base 18 budget. When was the movie the landscape and brought you and proposals for any further expansion of homelessness services that at the time was largely supported by one-time resources as well acknowledge them as we presented it that this is something we have to sort out as we bought forward the budget. So it was in the context of the declared emergency on homelessness and the need to find resources to support the response to that that we started to look for scratches before you were against creative creative uses of the Cities available revenues. This Council has a body had in previous years and perhaps in the in the The Flash fall in the previous fall debated the use of the emergency fund. Given that there was a declared emergency the reason that you didn't and I think you shouldn't have in the reason that it doesn't work. Is that the emergency fund of the one-time Soros and this is obviously a very unusual declared emergency. We can really don't see get send so to respond to an emergency. I think the allocation of resources is an obvious thing to do in allocation of ongoing resource. So overall for shelters in for food program at a variety of things, so we had to get very creative to be candid so hard the budget that you approved for 19 and doors for 20 uses a better word for swap to take 10 million dollars and effectively redirected into the general fund that That's a difficult decision. It deprives a number of important types of projects that depend. Otherwise on those resources that wasn't enough. So we then turned to some of these other sources in particular on the ones that you were talking about today. And so it is true that the proposal when the original tent was developed. You didn't know this financial situation you were going to be in that had tax would not prove to be a viable funding alternative. So given the circumstances has changed. It didn't seem unreasonable that potential uses the money. I'm comfortable as it might be and I need to be clear staring straight at 1. So this is not this is not the way you want to be raising revenue just to raise revenue designed to achieve their goals, so I couldn't agree more on that point so but You have the first five years ago. I was budget director has least four. We have asked general fund apartments for reductions and we every year with a list of those things and an entirely transparent and inappropriate way. We've transferred that list to you. Once we've had a shot at our first cells but you didn't take any of them up either. So I say that if I go to the next line is it's instructive to me. If not painful for all of us that has you went through the fault of the process last fall that you weren't able to find alternative Revenue sources to support these ongoing activities. I don't think they easily exist. I don't think the cuts that would need to be made obviously on the table without cutting services that support those Anita or the variety of city services obvious one police and fire account for 40-plus percent of the general fund fire is not shrinking in Norwich police from a cost-effective and write each other so there is obviously able to do it and I'm not surprised I wasn't able to do it either nothing you're not better than me but you like it it's it is that hard so what would I worry about from your perspective as well as my own is it if you establish these policies without knowing what the implications are that you for potentially regret them and that again in the context of the emergency that we are living in that spending some of our broader your broader policy objectives to meet this other overriding needs is where we are and that's how we got where we are and not these are your judgments not mine, but I think that context in the chat the real place challenge we face that you face is relevant, but this is a concern. Every year and it is the finance and budget chair coming up. I'm really concerned about decisions that we make now and how they might limit choices that we may want to take in October but recognizing that I think we pretty much know what the revenue sources are. We may not know exactly the dollar amount but the gold to find additional Revenue sources to support some of the things that many of us want including the good work that you're talking about right here. How do we fund take the sugary beverage tax? And then the taxes that come from other legislation that we're looking at potentially today, but then also thinking if I can just insert this that we're talking about adding some additional funding for Human Services providers, there isn't anything wrong with us considering that but we do have to look at the revenue sources because we know that the Human Services providers are Very interested in getting additional support, which I think we all look at and we see their budgets and we know how difficult it is. So as we're going through this today, I just want to be cognizant that we've got some choices to make short-term and then we're definitely going to have some additional choices to make and come October. To appreciate the you laying out the challenge is there and you and I have talked and agree on the challenges disagree on the policy outcome of the challenge for me. That is two separate issues here before us cuz it's two separate taxes in their distinct. I want to focus on the sweetened beverage tax first because the decision if I pay my taxes are really important one for me and and acknowledging that everything been said is there is a bunch of important things in the budget that our Council priorities that we do chose not to defund. I still cannot I cannot support a tax is disproportionate on these communities to fund those knees toes knees are priorities for us. And I think they are we should find a tax source that is more Progressive than that and there are other tax sources who know there are no options. We've used a number of them, but the sweet beverage tax didn't exist a couple years ago if we wanted it. Pack something selectively that disproportionately affected wealthy people we could do that and find sources and what I propose is that we get this legislation introduced and pass it and ask the mayor to present a budget and did find some solutions whether it's cuts from things other things or other taxes that are more in line with our values and and then we'll have to struggle with whatever whatever we get because it won't be easy but I don't think I personally can't support this containing the way it is on the swing. I know you well enough to know you think so. I'm hearing you saying that attacks it obviously is disproportionately paid by poor people of lower-income. We turn around and take that and invest back into the communities at that Community as a priority. We shouldn't use their money for those particular needs a paraphrase bit of might have an impact on consumer choice and part of the reason we're doing the taxes as a public health experts say we want people to shift behavior and attacks is effective at that but the income effect to make some poor is bad. So let's invest heavily back in those communities. So that that their incomes Levi it is right you support that we need to find funding to solve. I don't think we should tax homeless people to find the solution. I think we should text Society broadly to solve it. Similarly Food Bank. Affordable housing this thing that should not be funded on the backs of low-income people who go over consume Coke and Pepsi that was refunded on all of us. In fact, I probably should be disproportionately funded by people who are doing well in today's economy finding a good tax for that is is is hard but you know a yoga tax robot a taxes certainly better than a Pepsi tax. And so let's get creative if that's what we need to do. If we need to find a new revenue and not do it on the backs of these folks Thank You. Bridget was a conflict that arose around should we put more money into food banks or should we put more money into the items that were recommended by the committee by the cab and we struck a deal and there is peace in the family and we were able to move forward. How do you suggest that we addressed that? I think that's separate than this how we spend the money and I wear prioritize it we are I believe the cat is is just recently was about to finalize their recommendations going forward and I believe food banks or a piece of it and I think they will give us Direction on how that group proposes to address food insecurity including food banks, and I haven't seen those yet. I'm looking forward to hearing from you all are and it may be that the council and the mayor disagree with their set of recommendations. And so we will consider that again in the part of the budget. I tend to defer to those experts and others on the council have different priorities next totally fine, but I think that's a separate decision about should see this funding be diverted or supplant other things again, not in a devious way and it transparent way but I just disagree with us again in the council, but I really would like this. I have more conversation about that up front if we can so it just doesn't evolve answer for me to be clear on how did have more conversation but I like this resolved this month and and I hear from folks out there one is you know, Ben's told us what he wants to take back to the mayor. I'm telling you. I want to send something different back so that that does not necessary get results here. But I think the sooner the council ways in. Just Michael Brian wedding in on this and give you Clarity if it doesn't say fix the problem, but at least you know what it is more than like a couple days before the budgets done. And so if if if you would like this introduced and referred to this committee to come back in a couple weeks, or I can put it into my committee, but I do I feel especially for Tanika who was knocking on doors talking to remember saying we are going to reinvest his back in your community and I just can't wait much longer to tell them we're still sitting on hands cuz not only does it hurt us for this at her Just for future considerations like this to Tell me is this on our calendar for the 26th. OK short-term rentals a different Beast the folks that are being taxed. It's not a disproportional tax like this. It's largely tours from out of town and who Bears the cost and all that stuff is probably a little more complex whether it's the the property owner or the or the guests visiting but some mix of those folks of hang it and so I have less concerned about that. I do feel that the EDI Investments are a high priority and I think it's consistent with our investments both in improvident displacement this happening and the distinction that I believe happened last year that we corrected was between 4 million and 5 million being invested in EDI projects. And what working at what were the endorsed budget for the next year has only four million being invested. Community on the contrary. Smith was 5 million. That's a $1000000 gap which is still a big gap that not as big as what we're dealing with them this week and beverage tax. I do think that when you hear of 30 projects the vast majority of projects, I think that we would all like to fun for anti displacement work is really important some of those projects line up with our affordable housing investments to some of them are completely independent of affordable housing projects does raise the level for me that it's a priority. It's a different Dynamic and so we're talking about similar to the the driving Factor behind them is slightly different for me coming in his and in this year. Is there more expected in our short term rental tax than that at this stage. We only have a quarter is worth of data and she was always an accounting issues points. It works out to about the 10 million dollars a weed in a tent. So for the grants, I think it's important to recognize that is part of the development process staff support to the capacity building for the agency could be applying for the grants is integral to the program. You could do it with a general fund subsidy but general fund contribution that capacity misunderstand the program and I don't mean to lecture you. I just think it's it's an example of the staff support in the dollars out the door. I'll probably 50-50 not wrong. It's because I think I bought a definition of what constitutes the the program might be meaningful and useful. That's the challenge was that we had previously staff work. How did general fund money and when this pool came along the community expectation was 5 million when they saw that there was some Plantation but we could do that and we might say what's fair to say that the staff work is important work to the community. I agree with that part of the program which speaks to that goes with that the communities built their communities two to a place where they can engage in a can of standard grant-making that we do is identify just I've come to learn myself more about that in terms of in the reality of it. How do you say in closing before I go to next gen? I'm thank you can spell Brian for your leadership on both of these issues on your commitment. I work side-by-side you on these issues since I look forward to I'm making sure we are protecting it the communities that are near and dear to us and those folks that are being taxed or we're trying to help in and get back into the time. We're going to be all over that and the short-term rentals as well. I'm glad you recognized it a lot more full of people are expected but don't know on behalf of the mayor just as councilman for with this side of the recommendation saying that this is how you like the fun is directed. It seems reasonable Dental also say cancel the mayor of how you would like that match. So if in fact there are tax proposals that you would can you think are reasonable of that. I've explored progressive tax opportunities in they are limited or alternatively from the funding. What are the priorities that you see as the lower hanging fruit? Because otherwise, this is a one-sided policy recommendation. That doesn't own the other side in the budget on a competitive sport. I mean, we're actually looking for your direction and advise. What is the sincere request to understand if we're going to reprioritize as much as this money then what are we going on prioritize or what new Revenue are we going to use would you propose to use? I'm open to that request. Do you think we were pretty clear initially and I get fit if I projection was 22 million instead of 17 or 14 million. We wouldn't be in this house ever had text him. We haven't so I can to help us with that. So I don't think I should move on couch present Harold. Did you have anything you wanted to end it didn't feel good on my end because at the end of the day we have our priorities were trying to find them in the mirror is the executive and she could understand our priorities if we are prioritize prioritizing poor people in the sense, and we have other place in fire issues. That's quite frankly her job. I mean so I completely agree. The revenue overall Revenue forecasts hasn't meaningfully changed. So if we're going to redirect these resources away from where they're proposing indoors 2020 budget something has to fill their place. I'm in that is either a reduction somewhere else. So keep your priorities you endorse a 2020 budget those were the last expression of your budget priorities. This is is a change to those and you're absolutely position to make that I'm not but if it's if it's half the recommendation and not the other half it it needs us guessing that leaves the mayor guessing as to where are you would have us meet that that that challenge. That's all I was intending. I think this is a great beginning conversation. We will continue we'll plan it on the 26th. Thank you very much and councilmember O'Brien for being here and I'm thinking Ali and Yolanda for your good work. Okay, so our third item of business. Would you like to read it in for us? And please I'd like to invite All who are here and supported Bobby Humes to come on up to the table. Thank you. I don't have a 3 appointment number is 0 1 3 7 0 point of Robert Humes as director of the Seattle Department of Human Resources for a term to June first 2023. Excellent to have you three gentlemen here with us. Mr. Robert Humes. Would you like to introduce yourself? First? Never caught heard you called anything but Bobby, please and thank you. Remember. I prepared some remarks. If you don't mind a superintendent Seattle Parks control Christopher Williams a statement again, cuz I thought I'd really captured both Bobby and his approach to this work, but I will save you that since you forgot the same way Christopher. I was like eight men then I agree. I just wanted to have background we had about a hundred and eighteen applicants for this. We had a search committee comprised of Labor and Department HR directors across the city. I think they're about 9 or so members of the search committee, which helped us identify the peep the six people that we're actually at 8 people that we identified to interview to is through at the last moment. So we interviewed 6 and then the mayor interview the finalists that we recommended from there and Bobby came out clearly the the one that the search committee recommended to the Mets are they didn't make recommendations, but clearly indicated that they thought he was a very very strong candidate for the position in the mirror after doing interviews is happy to provide to you her nomination of Bobby Humes as the Director of the department Human Resources. I also want to acknowledge Lee Natty Boh on my staff who is part of the search committee. I appreciate all of her work and insights into the process. And also I want the two of you to know that I've had the pleasure of serving with Bobby on our service committee that says Seattle Seattle to get the sea employees retirement system. Is it so it's been great to have you there. I really appreciate the positive energy that you bring a friend. I know that you are going to be a real asset for this apartment. So if you've got a prepared statement that the council members thank you for this opportunity is sick with extreme honor to be considered to serve as the Director of the Seattle Department of Human Resources. I believe in the the Department's mission to provide services for this City's diverse Workforce in my short time as interim. I have witnessed the focus on Workforce Equity to the village in response to the mayor's executive order. On anti-harassment and anti-discrimination and the employee centered approach to standing up the HR investigations unit. I'm impressed by the customer driven approach to providing services to the new on situations within 18 apartments with unique missions and organizational cultures. I have witnessed centers of excellence among the ever-growing list of centralized administrative services that impact the entire city Workforce their families and our retirees have also witnessed employees who are still in need of time and attention to heal from the harm of inconsistent and tastin and Leadership within our department and Beyond. I believe in the people of this department and in our fellow HR practitioners across the city. I'm excited about the opportunity to serve in a capacity that build communities of eggs are excellent and provides the city with competent and consistent HR product services and supports we have a lot of challenging and essential work ahead of us has a city in the HR space there a lot of HR opportunities to increase our Effectiveness with labor partners by ensuring we honor our agreement through everyday operations and are responsive to our grievance process. We owe this to our managers and employees their partnership with it and finance accounting services and CBO. We have a window of time to leverage HR Talent across the city to identify and Implement human resource Capital Management systems that allow us to better manage human resource functions and outcomes as director. My goal will be to the senator race through HR services in commitments. Most recently. I've had the opportunity to work with the mayor's office and city council staff. On options that best support the city's goal of being an employer choice. This work is his work has been challenging yet extremely rewarding as it has become clear to me that there are leopard points in increasing our shared understanding of the impacts of HR policies and practice reflective communication and shared accountability. I'm eager to reinforce strong Partnerships with city council staff and HR. Again, thank you for your time. Today. I'm eager to hear your questions and provide thoughtful responses and provide more context about my vision for the work of the HR practice Citywide and my potential ownership of the outcomes in the role of director of the Seattle Department of Human Resources. Thank you. I appreciate your written statement, but I'm about to ask you some question because I love about you and your approaches your heart and your support of the people that you work with and I also want to recognize Deborah Smith. I think you have another supporter here at the table. So thank you for being here. That everybody's asked and it was in the first paragraph question that was submitted to you is why do you want this job? I know that in the decade that I have been here that I've seen struggles I've seen that there are questions of morale within the department. I think people have tried I believe that you will succeed and making this department something that everybody feel like I'm about to just talk to us a little bit about what brings you here. Thank you for your vote of confidence. What brings me here is what brings me to this profession HR and my opinion is a calling and if it's hard to do if you don't love people you can love the processes you can love the outcomes. But if you don't love The Human Experience all human experience, this becomes very hard and so I'm excited about the opportunities that we have to leverage the different Partnerships that we have sdhrs is looked at in the practice of HR across the city as the place you go when you need HR answers. You want to redefine who our customer is? We want to read Define what it means to bring value to the HR space for the city for the benefit of our employees. And so that's my why create value figure out what our customer needs and do all of that through a lens of racial equity. questions But if you got specific you'd like to bring up. I want to give you the opportunity. Just a few questions. I guess I should let it go at organically. And when are you thanks for responding so conference comprehensively to the Doesn't her 20 Questions 21 Questions was looking at one of your questions on your vision for the department and you talk about that with initial passive i1000 you don't. Let me back up in one of your Visions. You don't talk about diversity at all that there's no mention of diversity acknowledging that the workplace is changing demographic Lee and then in your question on channel 13, I know that you didn't mention African Americans for some reason and could you talk a little bit about maybe that was just an oversight you had a lot of information. How do you see the changing demographics in maybe the country the city and how that affects the city of Seattle? Some people say we're the whitest State they were saying where the whitest city in the country while I don't know how they computer messed up, but this is going to be a challenge trying to have a diverse. Workplace when you have Richard demographics coming into a city's just going to be challenged. And so I noticed you didn't mention any of that in your vision and some Absences in your rsji description, so I would say that when we think about the changing demographics within the city we have to think about what we mean by the term Greater Seattle and then we have to understand that the forces that are shaping or redefining a reshaping what it means to be a part of the city are also the challenges that we have and identifying what we mean by demographics. And so we had a discussion this morning with our Workforce Equity director our talent acquisition director and my chief of staff about how are we going to put the CD in position to be responsive to i1000 upon its initial passage and what that means is that we have to have a fundamental conversation about data and end in defining what are scope of human information. We're going to leverage in order to tell a cup. Story about our value and creating more diverse organizations. He cannot use the demographics in our city and Define. What is Bobby mean by Equity? We have to think and broader terms. We know that people are commuting into the city. We know that we must redefine our our talent acquisition practices in order to ensure that the people of the city Seattle who work in the city of Seattle represent the large lot of people who may not live here, but we're definitely work here and insult. That that's my response to that question. And I think we want to be ahead of whatever affirmative action reporting is is going to happen until we are we have a plan in place to bring our larger organizations together Deborah uses human is for the first time but to bring our larger organizations to the table together with us to help us Define these things we don't want to find them on our own and then create a compliance driven methodology. We wanted to have shared values in our approach to having an approach to equity that is centered around the greater Seattle definition what that means to all of us apartments that you should have do with him. I'm confused on this that like we have our small they sharpen in our department in many departments have their HR but you're human resources. Like do you like play some fire their? They're sure the big Apartments you interface with them a lot to I mean what is a job so I'll just ask what is rickrolled does sdhr play in the large apartment like the police and fire in terms of recruiting in cuz we have a huge challenge with diverse recruiting some of these departments. And so do they handle that themselves or where this be under Bobby's per view my particular place in fire are in those departments. You are absolutely correct that they do chordate with the sdhr. It's a part of that. I think the 18 apartments that Bobby was referring to or the smaller the midsize and smaller departments that they they sdhr provides the direct Human Services services to wear as the larger departments like City Life parks in and others do have their own human resources. Staff, but that is done in coordination with City HR. I found the corn is okay because what I have because it goes back to my earlier point is what I was hoping to see in the vision, which I just noticed wasn't in there was we've had some issues on this is a city. I'll take some ownership as well. We is a city in terms of our recruiting are printed ship on our poor diversity and some of our partnership programs. It's just a big big issue. We've been a contender know Catherine Gonzalez a lot of energy behind this as well. And I was hoping to hear almost a champion on some of these issues coming from your spot. And when I see a vision that doesn't even mention that I get concerned not that you're not an outstanding candidate, but I just bear some mention that I saw that and then when I couple that with you were talking with initial passage of I 100 and you talk about you'll fostering relationships with every group in there without African-Americans. I was thinking how we miss that one that specific line was in reference to Opportunity areas that we have not too happy to be do not have stated strategies around those population groups. If you rely Workforce Equity plan, you will see that and all the other areas. We have a target of recruitment plan for the population groups and we had extreme deficits there. And so those there's no strategy for those groups. And that's what that comes from. I would also say that I am a proponent of the different Avenues by which people enter employment into the City and so that's definitely a part of my being that's part of Who I Am Understood thank you, sir. Have a question that done tails to that last answer context of creating Pathways for careers at the city of Seattle. And that's something that we can do much better as a as a whole and as I think about Concept of a centralized HR versus a decentralized HRA meaning it's fair to say that we have a fairly hybrid system currently where it is. There are some inherent systemic inequities associated with that hybrid because a lot of the larger well resource in hunted departments have the ability to hire their own HR and sort of do what they want to do the way they want to do it while some of the other small or mid-sized agencies have to really rely on each are delivering the services in a manner that is consistent with their agencies culture. And if that's also impacted by the amount of resources or morale issues that might exist at Central a charm and so I and I think that that makes it really difficult for mid-sized and smaller agencies to get a really responsive reaction from Central HR on Really critical issues that they really critical hiring issues that they care about. So one example of a pathway to career at the city that we don't talk a lot about is the opportunity to do work study and internships at the city and the legislative Department have her own HR department and we really utilize and value of an integrated work study in turns into many of our offices hiring practices. I think most of our Council offices have interns as well as some of our administrative offices and I've recently heard from some small or mid-sized apartments that they have an interest in diversifying their Workforce and in creating opportunities for younger folks to consider careers in public service and in departments and agencies that might otherwise be an accessible to them whether it be environment or land you You swore, you know, there's a great opportunity to create Pathways to be for careers weather is here at the city or just building their resume to be able to add land somewhere upon graduation from University and some of these agencies that I've been talking to you and said that they heard directly from HR that that work study is not an option for those departments and have been denied the opportunity straight-up denied the opportunity to participate in a work-study work study internship starting under the auspices that only the legislative department. Does that which I know for a fact is not true as well. I'd like to hear from you what your priorities are in the space of work-study internship and aligned with that. How do we how do we get? Moral alignment and understanding within Central HR about what our policies are and what our policies are not on consistency is something that has been long flagged as a concern as it relates to interpretation of her policies practices and procedures at the city specific to HR and I and I want to get a sense from you about how you tackle that. Sure to park. So I would say that the organizations that have the smaller HR shops were those the smaller budgets are part of that 18 and they receive services from my HR business partner. So we have a team of HR business partners who are there to make sure that they're getting politics customer service arts and culture is one of those departments and I mean when arts and culture contacted us and let us know that they want to get into type of customer service that they valued we shifted we listen to them. It was shifted. That's our new normal to be responsive to our customers to provide value and I keep coming back to customer service in value. That is at the Pinnacle of what we do. I would say my value or my beliefs about internships is is in line with the mayor's directive for us to increase the number of internships. We have city-wide. And so if there are departments out there who believe that their hearing them. Would love to work with you want to identify who they are so we can provide some customer service to them in and work with them to make sure we understand what their needs are. It was initiative. That is not what I'm talking about. I'm talking about the work-study internship part of the the Seattle Workforce do an internship program. We have internship programs. And so we are engaging our Workforce Aqua aqua team. They came to me really early on in my interim role and said hey, we know we know that this is not a budget priority to some of these these Pathways to include green Pathways. The people leave that there's opportunities for us to leverage energy that's already out there around this need. What do you think we can do and my guidance to them was go to it, but your best thinking out there, let's build Partnerships and let's find of the individuals who Average opportunities and MMA that happened to that work is happening in those numbers are going up hunt. We seen it in some cases some departments doubling their numbers from last year's participation around internship, so that that work is happening and I just interrupt her for just a second council president Harold has an important for event of gas to get to and I wanted to pass it over to him stay for that. It's my wife's birthday is a thank you for this and I kiss her on TV shows have to excuse myself. Would love to talk to you more about my view on diversity and inclusion goodly amount of time talking about this. I know you'll be impressed with his responses so far. So very good. Thank you. Moerlein with our HR policies and practices. I think that's the Crux of that and I would say that we have a charge that I came for the mayor's office to provide more consistent incompetent HR Services products and supports that means that wild Deborah team has a lot of opportunity to be creative because of maybe the resources they were able to leverage that I would say everyone has the same but it's no one's you know, how the money tree and so where there's a leverage points for people to do or four teams to do different things. How can we leverage those into pilot opportunities so we can understand how things might work in it across our Enterprise and then scale those things to fit into the Nuance nature of different business lines. So what may work for spu, we know may not work for Parks, but what can we learn from you and then have that be adopted and scaled across the Enterprise work we're doing that right now with the alternative work Arrangements project that was piloted during the. Maximum constraint showed some great numbers, we hit our goals plus and now there's not too deep for us to think about equity in that program. And also think about how and when I say Equity, I mean racial equity and I'm talking about those who we know working are in our communities who who who Maura Lawns and take care of art of are green spaces those folks who, you know, don't work in offices. How do we get how do we leverage their opportunities in to having you know for tens or 9 80s and what what might that look like in Sault Ste use partner in sleeping Seattle City Light is partnering with us to Pilot that moving forward because adoption it's not just you know, we all do it the same but how do we measure the fact that we're doing it the same? I think that's our department for Allah believe that st-charles rule is to audit what we Implement Citywide to make sure that it stays consistent when it comes to policy. We are looked at on the HR. I get e-mails a lot about you know, there's a pot See if there's a policy implication to a decision in / ordinances Landoll on my desk. I don't just want to make yes or no decisions. I want to understand the clients going back to customer service. I want to understand what their needs are based on how they're asking me to think about that Leah policy outcomes and then I bring my team so we make sure that there's precedent because I haven't been here as long as some of them have and I want to honor their wisdom and looking at some of these policy outcomes. So I'm in response to your question. I'm thinking about consistency approachability and then communication. So when we make a decision that goes outside of presidents or establishes a new president's how do we communicate with labor to make sure that they know that maybe they said that's a one-time decision to go outside president. Or maybe it's something that we now think about differently and then how do we share that with our business partners? And so it's not a perfect system to some other we could talk for hours about how you use your governance to make sure The people have the same shit outcomes and same motivations around how we look at policy. Delete. Those are some ways that I think about it. Miss Williams had a comment. Yes. I just wanted to add to Bobby's comments that through partnership with sdhr. The mayor's office. We have increased our number of college internships in the Park Apartments last year. We had zero this year. We're going to have about 20 to 25 cuz you have your own HR, right? My concern is about those departments that do not have an apartment that have to rely on Central HR for the support. So if I'm an apartment that's smaller right with 30 employees or 20 employees. And I don't I don't have the luxury of having my own HR person. I have to rely on and you know, if I go to you and say hey, I'm really interested and diversify my Workforce. I think a great pathway for me as a director of this department is to stand up and Implement a work-study. Internship program in my department that will achieve those goals and then gets told no you don't get to do that when I just from a policy perspective. I think that's a bad policy and I'm disappointed to hear that that would be what I want to hear from you is significant and I plan on moving forward about how we turn that narrative around to allow for work study internship opportunities for students at her Department's it's just an invaluable experience. We all love our interns in the legislative department. And I think some of the bigger departments would probably say the same thing is so it's a very successful program for us and people who participated in it. And I just think it's such a missed opportunity in this area where we are really trying to support our use That's an and I just I really feel strongly that this needs to be a priority for HR. One of the things that are HR Service delivery team in our talent acquisition team is playing together is going on a road show for those 18th apartments in redefining the value that we want to create for them. And I'm going to go back tomorrow and talk to those to know the leaders on those two teams and make sure that they understand from work for a second because that's what that program is owned that they understand what the opportunities are for those departments. So when that comes up not only when it comes up so that they can present proactively that part of the conversation because it's valuable to us to I have a team and we're protected who celebrates every one of those, you know, 25 folks. So this is Meaningful to us as well. As smaller departments don't have a capacity of a sort of the knowledge that work study and even exist as a program. So I think it's really important that proactively communicate that to directors of Of the agencies that rely on you all for the service so that they they know that they have a meaningful opportunity to take advantage of the program if if they wish to do so and then you know, that's an opportunity to connect them with some of the bigger agencies that have that run these programs as heard of a mentorship opportunity for those folks to be able to make sure that it's a successful work-study homelessness Regional governance approach and we in the city and working with Jeff Colby from the mayor's office. Thank you very much. She's a real asset to this work and our County colleagues are getting started as well. And it's going to have an impact. I don't have an impact on human services department and others and I'm wondering what's your approach going to be? How do you see? Human Resources getting engaged and being involved. Thank you. I would say that any employee that impacted by that valuable work that we're moving forward as it is a customer and I know I'm back there again. And because you're a customer we have an inherent responsibility to make sure that they transition healthy and well and they understand what if there's any newness to their job what that is if there's any training that needs to happen that we leverage that and so it's our role to be we may not be the lead in that project but we are a part of the care and feeding about those employees that may be impacted by that change and we have a team of folks on one of the individuals. I'll call him out Michael South he was a part of the aquarium when we did the same thing with the aquarium. So he has that institutional knowledge about what the impacts of a change like this can be and so we're going to Good Lessons Learned From that experience and make sure that we communicate with labor and make sure that we're just a good partner for hsd and so for their HR staff for Jason success in for the overall success of this partnership between us and R&R Partners your willingness to work with each individual who could potentially be impacted. If someone could you describe how you will be approaching this and to solve it for everyone that is involved. Thank you for that. I think it's important that yes, we do that communication that we provide some effective communication feedback loops so that if individuals, you know how questions there's a lot of critically at stake here with no retirement benefits pay these things make people nervous and make it would make anyone of us a nervous off. How do we effectively communicate what changes are on the table potentially as soon as we know what the final answers are how do we communicate those in and give people as much peace of mind as possible that might also mean meeting people where they're at and they might not have an interest in being part of that new thing whatever that is. And so how do we help them? Consider what their other opportunities might be more help them decide what their next Life Choices based on that. I appreciate that. We know that individuals are worried about their jobs. They're worried about whatever their retirement is what the system looks like what their seniority is and I appreciated your commitment to be working with individuals upfront, you know right now, we don't know what it's going to look like. We are months away from knowing but for individual employees to know where we're taking their concerns to That when we know will tell them but anytime hear the principles were applying. I think that is that to me that was really gracious approach and I wanted you to know that I heard it and I want to do in Spanish how to say that, you know, it's not my inclination or expectation on my team to be the stars of the show. We want to be good partners and we just want to help our partners reflect on on these nuances as we think about the human centered approach to this change plan, which is our Deferred Comp, which is I believe Deferred Comp is in your shop. Can you talk about just how you plan to communicate to employees? I'm frankly to get them engaged early. I'm also let them know whether there's opt-in or opt-out I think and we talked about the opportunities to leverage new employee orientation to bed. Educate employees about what happens. I think there's some assumptions that employees are making because we're not telling them otherwise, right? So in the story we talked about yesterday. Someone has been with the city for three years. They were in a retirement plan or part of another deferred comp plan and that wasn't the case and these things are detrimental when you're planning out your retirement savings. And so how can we be more proactive not just individually as sdhr and I in our plan for how to leave leopard Partnerships so that we are sharing what Dad a week and you can to know while you know, Bobby may have a retirement plan B doesn't have Deferred Comp and so since Deferred Comp or retirement is is sending out email or to Bobby to for him to think about updating his his address may be deferred comp has it a stamp or something on that same mailer that says he have you considered Deferred Comp. That's not my new idea. That's the conversation that's already happening with the fur. About this I'm so that's Michelle L. That's that's her brilliant idea. And then I think there's also an opportunity to empower HR business partners to partner with us to be more proactive in regular communication about these opportunities. When did and I have is that I see a series of events. Whereby you can, you can bring your pay stub. This was an idea that was put forth at the Kent School District that work. Well you bring your pay stub and they go line-by-line and make sure that you understand the different berries codes and you can ask questions and you have payroll there you have to Procomp you have retirement is not the best value that we can create as human resource professionals is not passive it is active and so how do we become more creative and in creating a value for a customer? So I yeah, I would say that I've had the opportunity to work with Bobby quite a bit and it has start Tiant time as the interim director and it's been a really wonderful collaborative relationship. I think Bobby is a natural leader. He is enthusiastic. He's genuine and he does have a compelling vision and and I think that we have talked about opportunities that departments can have to work together on some of them are irrelevant to even questions raised by some of the council members here like career days and things were we bring folks together across departments, so it's not just one Department lifting the weight and I think that's the kind of thing council member that can help with smaller departments as well because then they don't have to carry the weight Bobby's great partner. He's solutions-oriented he cares about outcomes not personal recognition, and I know that he has and will support his peers and identifying and implementing creative salon. Things to the issues and the priorities that we're all working on together. He's a learner. I feel a little bit mom like with Bobby so that's okay. He lets me so that's a that's a nice thing I value but he's humble funny engaging he's looking for team wins regardless of Team whether it's his team or it's the team that exist amongst department has so he's looking for that team win, not the individual win-win and lastly. I think he's a really good friend. So he's builds Bridges and I know he'll do so across the city across between managers and employees across departments and and whenever he sees me he says hello friend, and I think that The importance of that really can't be overstated because Human Resources is a really tough place to be because you do have an enforcement compliance Roland so breaking down those bridges and making it clear that you're here to help everyone succeed regardless of their role. I think that's that's hard and I think he has the right personality to do so. Thank you, Deborah. Do you want to talk about the relationship with the new office of the Ombudsman that is a I'm proud of the city of Seattle. One of my colleagues are Workforce Equity director. Felicia Caldwell was in Chicago over the last weekend at a chief diversity officer training Symposium. And her feedback was where Seattle is and we're nowhere near perfect. But where we are in terms of creating a responsive employer support system is is is head-and-shoulders above cities are size and by hiring will talk about the individual talk about the baby office first, so the office of employee on but it is needed II supported 100% I support its independence and also support whatever partnership we can leverage together. To me that that Still Remains to be fully fleshed-out. We are working and have been working with the office of the employee on bubba to come out the back in Personnel things. We want to make sure they're providing them customer service in value right and making sure that they kept good onboarding and that they're a strong team from the the functional practice of how you bring in new folks attend up a new office. And benefit of it is, dr. Umar Khan, who is a friend. I mean she was in the hiring process when she was selected and it was a long we met a lot of people here in just a lot of people but her authenticity her focus on the the human centered design of the work she gets to do. I just she made me want this job more right and said that this just the ability to work with her and and Steve's wearing our new HR investigations unit director does a great opportunity for us and we're going to build that out together. What's most important to me is honoring the idt's recommendation that that office be independent not only on its face but it and its and its processes so she's not accountable to me. I'm not accountable to her but we're Partners. I take that back. I am accountable to her. She bring something to my attention that critically impacts our employees we will respond. And I can go on and on about her in my optimism for that office, but I'm very proud of the city Seattle for having that office. No, thank you very much for the time that you've provided us today. It's good. Well, I appreciate the fact that your colleagues are here to support you both at the table and in the audience and we'll have another chance to talk on our next meeting which is June 26th. And at that point it will be up for discussion and possible boat. Thank you so much for coming. All right, thank you all and this meeting is adjourned.", "end_time": 6649.5}]}