{"format": "raw", "annotations": [], "confidence": 0.9129591948645456, "data": [{"start_time": 0, "text": "Good afternoon. Thank you for being here at City Hall the May 20th 2019 city council meeting of the full Seattle City council come to order. It's 2 p.m. My Bruce Harrell present the council with the clerk. Please call the roll here. Whereas Mascota O'Brien Pacheco a present the record counselor in Baxter has an excused absence wish her well. There's no objections today's introduction and referral calendar will be adopted. Turn off Jackson's the introduction of 4 calendar is adopted. There's no objections to days. Agenda will be adopted but I do believe councilmember herbold would like to propose an amendment 1190 to 88 until September 9th 2019. Then moved and seconded to hold the legislation as described a council member herrboldt any other comments counseling her both here in the ER against this action to move the boat on this bill until September 19th. The bill in question is hate crime legislation that passed out of my committee last week and the date of September 9th. 2019 is the date that has been requested by the director of the office for civil rights as an opportunity to do additional engagement and a racial Equity toolkit analysis. I'm going to support the amendment. I did want to stay for the record band. I've had discussions with the city attorney about this as I'm sure you have many of you had that I'm feeling I fully support this kind of analysis to being done and I and I enjoyed our conversation this morning at the briefing table because of I think the the issue itself that I think time is critical and so I'm hopeful that before September maybe we could either accelerate the work or have something a little more timely than that for purposes of today. I certainly support the amendment. But again giving the increase of hate crimes that we are seeing in this city. I think that we need to wash our speed with which we work on. This should reflect this increase. And so I'm sure you're all on top of that issue but I'll support this till September and we'll see if we can maybe accelerate any of the comments on the on that Amendment. All those in favor of the amendment please. What I oppose the eyes have it and I'd like to make an amendment as well. I'd like to move to a Mehndi proposed to jinya by moving agenda items 25 and 26, which is the clerk file 3 1 4 4 to 5 and the council Bill one 19511 before item one. So should we can take care of that matter? We have some public testimony is on that particular quasi judicial manner that would like to move it to the front of the agenda and that we think that makes sense. So I'm proposing to remove those items before item one all those in favor of that. Okay, having done that those in favor of approving the today's agenda as a minute, please go die. I opposed the eyes have it in today's agenda. Is a minute as stated? The Menace of the May 6 in May 13th. 2019 City Council meetings have been reviewed and there's no objective the Menace will be signed. Thank you. That minutes have been signed presentations. I believe council member herbel has an exciting presentation and a very meaningful presentation that you'd like to share with us. I am honored to present today to the council and two folks joining us today and Chambers a proclamation honoring the life of Sharon Jones. The proclamation itself identifies many of Sharon's attributes in the ways in which she has helped influence the work that we do here. I'd like to read it. But before I get into that just a couple words Sharon I'll pass last month's at the age of 66 from Lou Gehrig's Disease amyotrophic lateral sclerosis. She was a real change vendor and had a frequent presence here at City Hall in her advocacy on behalf of folks experiencing homelessness. I understand that Sharon had a lot of a lot of people in her. I had a lot of pride in her home in Federal Way She wish to share the stability she'd gained from having a home with others and she was bringing her vision of the greatest love homeless Ministry affordable housing community to life Sharon saw the risk and health impacts of homelessness and fought to change it and we're looking at these issues at city council to i-19. I'm sorry. I 2018 King County Medical Examiner report shows that of the 194 known deaths of people experiencing homelessness in the county. The majority were by natural causes a meeting median age 25 years younger than the King County average the recent auditor report on hate crimes provided background and data that people live in sheltered are far more likely to experience violence and harassment due to their housing status. In addition to Sharon's advocacy her optimism energy and open-mindedness made her a Beloved Community member and she will be deeply missed. I'm very happy that we have some of her friends here with us today to join us. And I know that we can rely on those folks to continue to push our city to better serve protect and represent people experiencing homelessness. Thank you Katherine herbold. Would you like to wear you finish it? We going to read the proclamation Shreveport Louisiana into an Air Force family. And after the coming to Emmy atrophic lateral sclerosis. She passed away in Hospice Care at the age of 66 on Sunday, April 28th, 2019, Sharon Jones the tireless advocate for people experiencing homelessness with a frequent presents in City Hall and a beloved part of the real change resident Action project and Top Pot Doughnuts, Sharon Jones was active in local and Statewide advocacy for homelessness services and affordable housing. She modeled the importance of vision with her the greatest love homeless Ministry affordable housing plan that espoused the principles of housing first, resident self-management transit-oriented development and communities of opportunity. Where is in King County three out of four extremely low-income households pay more than half their income towards rent and according to the 2018 count us in report people of color Survivor of domestic violence and people with disabilities are disproportionately represented in the homeless population. And whereas the lack of affordable housing and Rising rents are primary drivers of homelessness in the trauma of living unsheltered hates a significant Health toll and where is it? 2018 King County Medical Examiner report record that 194 known deaths of people experiencing homelessness primarily by natural causes, but at a median age 25 years younger than the King County average and recent studies show people living unsheltered are as much as 19% more likely to experience violence and how is people and according to the Seattle Times more than 10% of Home homicide victims in 2018 were homeless when they were attacked. Ed Sheeran Jones dedicated herself to changing these conditions by telling her story using Ingenuity to advance the public good and highlighting structural barriers of racism and poverty Sharon was known for her while reliability her loyalty her selfless attitude despite the demands of community from Federal Way and working multiple jobs and whereas Sharon Jones is Iconic greeting. I'm blessed and well reflects the optimism and humility by which the city strives to approach public service and work to end suffering and where is the city of Seattle and its elected leaders mourn the loss of Sharon and graciously celebrate her life and the efforts to affect Justice now there for the Seattle City council bike proclaims, May 14th 2019 to be honored for the life and service of Sharon L Jones. Thank you. Cancel my hair bald before we suspend the rules. I want to make sure any of the council members. They like to say anything we could hear from her. Guess give you the opportunity. If not, I will simply say that I thought I was just a great piece that your paper did to honor Miss Jones and she was again a remarkable human being in many communities will miss her and I know she was a Seahawks fan to being so hopefully I should still be watching some games from her new view, but she was a certain weight loss. No pressure. I don't know. If Tim would you like to say a few words with n e be like say a few words Can I take a picture with all of them? Please? Don't mind. Thank you, honey. 1231 awesome. Thank you. Thank you miserable. And thank you City Council Members. My name is Lisa Sawyer. I've known Sharon Jones throughout the whole 9 Out Lil Bit over 7 years, since I've been homeless just recently I got into housing in this past February. Turn a x I found out that Sharon died my dad passed away. So the double whammy was told by Lisa herbold say that this is going to be happening. So thank you for taking this time for listening to us today. Sharon Jones had a vision she had a vision that no one will be homeless. She had his big huge planned property and that homeless people will not have to worry about being outside don't have to worry about getting raped don't have to worry about getting beaten. Do I have to worry about looking over their shoulder? I am experiencing from a transition being outside to inside it for people that take a long time from being outside for so long. It does take a long time to adjust to transition. I'm still looking constantly over my shoulders for being outside. I'm still sleeping with the light. Sometimes I'm sleeping outside because I'm still at that mindset. Sharon always brighten my day every time I see her she always says blessing well and every Wednesday morning, we always see her at the office and she always asks what day it is and she keeps saying payday. Does one first last I heard of Sharon that was the first day I started at real change. Since I've been with real change everywhere, I went Sharon was it Sharon was there she was with me at city council hearings most of you know, some of you guys might know that she was also a part of the resident Action Project do the Washington low income housing Alliance. She also she hosted a workshop just a conference we had over in Yakima. She put everything out there just to see no one outside. She even slept outside when we were all Kathy now in front of the city hall and up here. Although she had a place she thought it was best just to have a safe place and healthy affordable housing. I'm at a place. That's over $1,000 for rent. With not just me but me and my boyfriend. What is affordable housing lot of people keep asking me that? Most people don't know but lot of people are on Social Security benefits. Most people on Social Security benefits did not make over $700 a month. Sometimes even less see your Safari get a little bit more than that. but most of the people at almost this is around my age 32 Bobby 33 This is the time that we need affordable housing. I am going to keep on fine and memories of Sharon for affordable housing. And I can't wait to say. That the three-day pay or vacate no more 14 days. Here we go. Thank you guys for taking a day to Sharon Jones on behalf of change and the resident Action Project. You guys are the best and I can't wait to talk to you guys again. Thank you. Okay, I'll be very brief. My name is Shelly Cohen. I've been up many times trying to follow Ms. Real change. You can't follow her. It doesn't happen. amazing woman There will I can't visualize another Ms. Real change. Number to put one of my other hats on. As a board member. Of real change. She will dearly be missed improve on your good work. It needs to be improved. Thank you. Thank you, sir. Thank you. Thank you for the presentation. Okay, this point will move on to our public comments section and I'll call you out in the order with which you were signed up. And we'll start off with. Brian Simpson followed by Shelly Cohen Okay. So glad it's Byron Simpson Byron. I'm sorry my apologies. Commission ombre hair gold for her responsiveness to community in May 17th. We appreciate the extra time to consider the actual impacts of this Bill Burr Ridge Council to vote against this bill and less the racial Equity toolkit is able to confirm that there will be no increase in disproportionality related to the prosecution of black and Native people in the city council is aware. We have been found to be out of compliance with the Justice Department's careful consideration at this time. It is imperative that any future action regarding this legislation have robust Community input from those most impacted by those most impacted by the racist and classist function of Criminal Justice if the Sissy and this country specifically the input of black and Native communities who are already over and over, What measures to address individual implicit bias are appreciated? We cannot train a systemic oppression Injustice and inequality. Thank you. Thank you. Thank you. We've heard from Shelly so go to Dennis Saxon Saxman followed by Joshua daughtery. Okay. Thank you. Miss your sexy saxophone Joshua dirty followed by Troy Schroeder. Good afternoon. My name is Joshua Jordan. I'm here today as a volunteer for United Seattle and I'm making the statement today because they're homeless need help. We cannot continue to store people in Shack and cabinets and expect them not to end up back on the street Shack encampments like Lake Union in Canton that do not work because they do not encourage or require a lifestyle changes drug addiction plays a major role in Seattle's homeless crisis and rejecting this truth is a part of our City's problem just missing this reality and carriages policies that keep her home was suffering from a jug drug addiction. There are too many people who continue to be enslaved to substance abuse because of Shaq and Kevin still offer a little to no services to assist their sobriety real treatment options must been implemented to find the help out those suffering on the street in Addiction in addition progress that provide mentoring and job trainings are crucial to help us keep our homeless off the street and into permanent housing with jobs that can Ride them with their own personal stability real actions must be taken to protect a homeless by focusing on the needs of those living on the streets to allow them to create a life for themselves that is worth living. We need real solutions. Not Shaq's thank you. Thank you. Troy Schroeder and following Troy Schroeder. I just have two other sign ups that be Irene wall and Jeffrey Hughes to but I do have another sign up sheet here. Of course. My name is Troy Schroeder. I'm here on behalf of the homeless drug addiction and up project in myself. So 85 days ago I myself. I was a homeless person and I use drugs for many years and like it was always this. given there is no hope you know nobody really seems like nobody cared and I was I was on the verge of may be dying myself or something and then they had a project they reached out to me and and they gave me hope they showed me that they care and feeding the homeless drug addict when somebody did that for me. They got me into treatment on detox and offered housing and jobs and everything. So basically if we could just get more help and not condone drugs and needles to the homeless people or any any add any addiction. It's just it's a blessing day when people show they care and when people can help not just offer and I'll give us what is a enable us to be able to use needles and drugs. Cuz if we're enabling were able to do that. It just makes us think it's okay and it's not we just we need we need more people to help us and show that they care anything possible you guys could do is just be appreciated. So thank you. Thank you, sir to take the quasi-judicial matter last in Seoul. This is objection. We have a couple other speakers on the other sheets. I'm going to go to the other sheet and then take the quasi-judicial matter last. So we'll hear from Marguerite Richard you're up and you'll be followed by Naomi Finkelstein and then an honorable Michael Fuller Swiss Juris Yes, good day everyone. I'm here. Well, there is a particular ordinance that is should be important to everybody. I hate crimes and a folk down here hating on me. And other situation is this is National mental health month and we have a black gentleman that was in the news today burning grey coming out of the Central District and being totally disrespected as a black man. So you could consider that a hate crime to for an agency that failed to even look upon him as a human being to the tune of may be seven point billion dollars or eight million dollars for not obeying the law. That's what I come down here until you people the stuff that happened to mr. Grey and it's still in line with the corn because if you want to talk about decorum, then you better ask black people back in the sixties. What kind of Daquan did you have to bring forth? The Civil Rights Act? Human rights Bill of Rights any kind of rights that other people are privileged to have privilege to do us in and then we don't get nothing. I said how you do that. How do you how do you change the law if your script and and we're not even in the script? So I'm standing in in in line with Vern and gray on today sending a message out to television and all you other pathological Lies. We will not be moved. We will stand on Holy Ground Angels been forcing us to do the right thing. So America can be the land of the free and the home of the brave right now. It's not if black people are still being integrated. We are not free in this country. That's why I keep coming down here and I'm telling you again you fix it cuz you got lost to do it. Thank you for Testimony of Naomi Finkelstein will be followed by The Honorable Michael Fuller. Escape take your time. Make sure the microphone works. Hello. They didn't tell me they that it got postponed. But thank you for doing my name is Naomi Finkelstein, and I'm I'm here primarily. I got a bite of a sick that I didn't want to be here, but it's so important to me to talk to about this because I'm a victim of hate crimes in this city three times over once for being Jewish once for being We're and ones for being disabled. And I oppose hate crimes legislation largely because I think it's political and and symbolic and I don't think that you can legislate people's intent. I think that's dangerous constitutional grounds to start messing with because you start to mess with people's First Amendment rights. But you know even apart from that it doesn't work. So let me see if an oxy punches me in the face or tries to kill me or whatever it is. And then you send them to prison and you double their sentence and we know in prison there are area and games right? I mean no that's be white in a prison. You have to join one of those gangs. What good does that do me or you done is made somebody a better Nazi and that doesn't work. That's the first thing the second thing is. We need to just acknowledge that the state is a perpetrator of violence. So I can't come to the states and expect as a queer that I'm going to be protected because there's a crip as I I mean that is what we call ourselves activist disability activists as a disabled person and as a queer eye experience violence from the states all the time. So the black people so the immigrants so do brown people. I think that it's just not something I'm going to do to come to the state to for protection. We need Community Solutions Community Safety Solutions, and we need to address. I'm sorry. If I'm I'm just saying we need to address why some people are devalue by the society. So completely that other people and the state feel like we're useless trash. The issue not penalizing. That's the issue. Thank you. Thank you. Time of over. I apologize or next week or is the owner. Will Michael Fuller Suey pictures? Yes, I'm honorable. Michael Fuller sewer Jewelers. I want you to be mindful as of August 25th 2019 enslavement. Just and then you turn around. You don't want to enforce. In honor of George Washington George HW Bush senior and Robert summarized in the United States Army during World War II. Who served in the United States Air Force during both Korean War and Vietnam War and no sew a new America America on the Federal Constitution in 1993 and 1971 Rebel book dangerous and all do black lives matter. to make this country safe and secure from that petrol immigration reform 20 volt 813-2474 Thank you. So I got a couple more parentheses. I'm have to call you in just dropped your brother. I understand. Thank you, sir. Thank you. Please have a seat. Thank you, sir. Okay. Thank you, sir. Thank for this one. Thank you, sir. So our next our last two speakers will speak on a quasi-judicial matter and I have signed up Irene wall and Jeffrey, Eustis. Good afternoon. I'm Jeffrey Eustace. I will be speaking for the petitioners in the case. That is the subject of the reman and that is Irene Wallace and Robert Morgan. Basically the question that's being presented before you is whether you were going to Compliance with city code restart another 15 seconds back, please. I apologize. I just want to make sure I don't have any distractions. Thank you, sir. I understand that just general speak now, please. Okay. Thank you, sir. Okay, please please proceed. I'm still representing Irene wall and Robert Morgan who are the petitioners in the room. And as I said really the question that's presented to you is whether you are going to enforce your own code as it's written or you going to attempt to fudge compliance with a code and the code section that's at issue in this case is the provision that says there has to be a gradual transition and height and scale between the two zones involve neighborhood commercial and single-family unless there is a major physical buffer code gives examples as to what constitutes a major physical buffer. lakes rivers freeway Expressway railroad tracks open space open space that is used for Parks and Recreation purposes. Mouth The Proposal before you would have a 5-foot 54 High multi-use development right on the property line with a single family residence. And for transition what they're proposing is that the single family property be grown in land. They're grown and Lawn and Grant the transition. It is not a major physical buffer and does not exist between zones rather requires that the single family property buffer against the multifamily property the danger of you approving. This is when the next developer comes along with a similar proposal to acquire the single family property and use the single family property is a buffer you essentially would have already cramped this one approval to please set a precedent and you will be in the position of not saying no. Thank you. Thank you for just one answer. Okay that will conclude our Publix comment section. I see a person reason hand would you like to sign up and before you start? Let's just get the paperwork in order to go. Thank you have Katie Kendall on next to speak. Please proceed through 14425 the council approve this rezone from NC to 42 NC 255 n prior to NHA adoption. And as a result of that action, the applicant is ready to construct a project that will provide family-size units Michael retail affordable housing and local retail and provide much-needed affordable housing funds right now. The only question before the council is this compliance with 2334 0922 which mr. Uses said is to require transitional last major major physical buffers are presents the court that remanded this said that you know the lot to which is the larger single-family personal that you guys already put into the puta in perpetuity. If the other area of the single-family zoning was also put into perpetuity. Open Spaces in perpetuity, that would be potentially sufficient as a major physical buffer in open space is proposing and it will make this a continuous open space that provides a sufficient buffer under the city's code and we request that the council approved this rezone and the amended findings and them into who died that we have asked you here today and thank you very much for your time this morning. I think that concludes our we have one more. Your name is not yes. You made your name is on the sign up sheet. So you certainly are wilting rice or doing here give the name of mha which is why I did have but it was a place to stay. Sorry to interrupt your brother there. That's that's that's if you still want kids me and let's do a do-over. Sometimes I do need those. Thank you. When you pass the mha legislation recently, which is effectively while you're able to grab this property of 55 foot height Zone. It was for the purpose of creating housing for doing in this property is creating less housing that you could then possibly you should and how are you doing that you are in the name of this ridiculous notion of a major physical buffer, you are disabling a single-family home by chopping off its rear deck access to its own backyard making sure that whoever lives there which will be a Rancher has no privacy because there will be no fancy allowed you are mandating that in a single-family units there and all you would have to do is observe your own code, which is to require a 15-foot upper-level set back and in fact, Andrew, mha you increase the upper-level setback in your name. Greenwood in the BCI report recommending how you change that? I may say legislation. Furthermore, this is not Zone which requires any commercial use it all you can have some additional housing units on the ground floor in the back of the single-family Zone, and that is exactly what every other apartment and condo dweller. Has it done in our neighborhood for the last 15 years. This code has been in place for long long long. At least that long and wide is developer gets a freebie pass on meeting the code. I don't know when in fact that judge made it very clear and I was there the entire time that the answer to this question is to set the building back at a minimum develop single family property where someone will live and expect to have some privacy and access to their own backyard. You were making a terrible mistake here. You're setting a terrible precedent. I'm asking you to stop this and at least reconsider the pooda and add some additional conditions to that booty so that you are not creating a precedent. Thank you. Okay that will conclude our public comment section and let's move to the payment of the bills section and please read the title of a certain audited claims and ordering the payment thereof. I'll move to pass counselor one 19518 the bill pass in the comments that please call the roll on the pastor the bill. Urus mascara O'Brien Pacheco president Harrell Okay. So what United number one we've held? Earlier and so we're going to and we moved two items up cast member and you want us to read the clerk file and the billing to record or take them separately in the sentence same time. Okay, so breed the clerk file and the bill at the same time for 1st of June item in the planning land use and zoning committee clerk file 314-4253 Manta of the approval granted through 314-3564 a contract rezone application of 70th and Greenwood Avenue LLC C Series on an approximate 12001 88 sqft site located at 7009 Greenwood Avenue North from neighborhood commercial to with a 40 ft height limit to Neighborhood commercial to with a 55 foot height limit and a mandatory housing affordability suffix. The committee recommends the council Grant the application as conditions. And the report of City Council of the city council Council Bill one 19511 and ordinance relating to land use and Zoning affirming the rezone approved the ordinance 12564 0 and accepting am ending property use and development agreement as condition as a condition of the rezone approval introduced May 6th, 2019 a customer Brian. Thank you for the last fall. We we had a process we went through this and the approval of the contract rezone that was appeal to King County Superior Court King County Superior Court remanded at 4 to address the issue of the transition that came to the committee about a month ago in the committee. We had five minutes of What's the right word testimony I guess from both sides and then made a recommendation that recommendation was giving directions to staff on how to proceed. They revise the the pooda properties development agreement and we have those now before us today is the clerk file, which is the funniest conclusions and decision and I'll talk to that first, and then the second item is an ordinance which brings in the the pooda. I'll highlight just on page three of the clerk file the what the Superior Court directed us to do pursuant to RCW 36. 70 c. 140 the contract rezone approval and property use and development agreement are hereby remanded to the city council to dress compliance with SMC 233428009. . To which requires that a gradual transition and height and scale and level of activity between zones shall be provided unless major physical buffers as described in subsection are present in the area where the commercial lost to 87710 - 4100 shares of your boundary line with a single-family residential lot at 7010 Penn Avenue North we discussed a couple options and Committee in ultimately chose to set aside the rear lot of lot to find there as the buffer in the findings of fact for the desk clerk file. I want to read the second one in particular. It says the rear yard of the single-family residential lot at 7010 Palatine Avenue North can be modified to provide a landscaped open space that could be integrated into the landscape open spaced on single-family residential lot and then it was the lot number which I believe is a lot of me to south of it. And then of the conclusions, we had a conclusion section. This is also on page for that says a landscape open space in the rear yard of the single-family residential lot 7010 Palatine Avenue North provides a physical open space buffer between land use between land uses and allows for a gradual transition between the height and scale the neighborhood commercial Zone on east side of property and the single-family Zone on the west side of the property. That's about all I have to say on this if folks have questions and more than happy to move forward. I should say that we'll need to substitute version 2 of the clerk file for version one. So maybe I'll go ahead and move the substitution. Now, let's take the substitution first. That's the easiest one. So go ahead and formally move the substitutions. I guess I could take that as your form of motion or movement their second. Move the second you make the substitution as stated by council member of Brian. This is substitution. Only all those in favor. Say aye aye opposed the eyes have it. So the bill is substituted cuz remember and did you have any more say on the clerk file or the bill itself? I do not question for many of our colleagues on this matter. I want to thank everyone for testifying and thank you for doing the committee work on this and listen to test when I think I'm more than one occasion. So if that being said, we will move to to vote. Those in favor of granting the application as condition, please vote. Aye aye those opposed vote. No the motion carries. The App application is granted as condition in the chair will sign the findings conclusions and the decision of the city council on the council bill. I will move to pass count spell 11951. I'm sorry, Jessica O'Brien is pointing in that means hold up. I believe that he who doesn't do I need to substitute updated as the attachment. So I will move to update to amend the ordinance to update the attached router with the one that has been completed in front of us in our pockets. Just so I'm clear before its second that you're basically am ending the council 119511. Correct their second all those in favor of the amendment adding the food up to the council one. 19511. Say I At this point I moved to pass counterfeit. A119 511 as amended to all those in favor say please call the roll on the Pastor Bill. Let's do it that way or both. I wear mascara. Brian Jacob They were going to take items just one second. Let me get my bearings here. Listen to take Xanax. Items individually the appointments. Okay. Thank you and arts committee agenda item to council Bill one 19515 an ordinance relating to Seattle Public Utilities amending ordinance 12547 5 which adopted the 2018 budget lifting the Proviso and Section 8 regarding expenditure of funds appropriated in the combined sewer overflow budget control level for construction of the ship canal water quality project storage tunnel. The committee recommends the bill pass. Thank you. So this ordinance lifts a budget Proviso that the council placed on spending on this project during last year's budget process. The Ship Canal water quality project is part of a larger effort for the county and the city designed to limit the number of overflows in order to reduce contaminated water from reaching cute. This work. This project is required under a federal and state consent decree that has been placed both on the city and the county and the Seattle Public Utilities Canaan briefed Council in committee last week and let us know the good news that they have updated their confidence rating from 65% to 70% which means that the project is 70% likely to cost $570 or less. The city's share of this project is 393 million. It is actually five major construction projects in one and the storage tunnel is the largest part of the project estimated it 218 million. The tunnel portion of the project is what the council placed the Proviso on and we place the Proviso on the project at the point of 100% Sign so limiting the number of of dollars that could be spent only up until the completion of the design size having them come back to council for approval and lifting the Proviso before they start spending funds for the construction phase voting in favor of this now will allow Seattle Public Utilities to move forward with the selection of a contractor. They've gone out for bids spend a lot of time doing Outreach with a contractor community in order to get bids that hopefully will be on time and on target to cancel her both any other questions or comments on this legislation. That please call the roll on the passage of the bill. mascara O'Brien Pacheco read agenda items 3 through 21 read them together women take separate votes on them, but just read them into the Racket and I'll pass the council member. The report of the planning land use and zoning committee agenda items 3 through 21 appointments 1326 through 1344 appointments to the design review board of Han Bay Phoebe Erin bogert Timothy Carter Alan Grainger, Daniel, Maier. Gen Monte montressor Garrett. Nelli Lauren powers and May so as members for terms ending April 3rd, 2021 and the reappointment to the design review board of Melissa, Alexander Belinda bail, Andrew Haas Katie Hema Matt Hutchins Crystal, Loya patreese Martin Stephen Douglas Porter, Alastair Townsend and Brian Walters as members for terms ending April 3rd, 2021, the committee recommends the appointments be confirmed. Thank you can spend Pacheco. Good afternoon. Colleagues are we have no appointments until three appointments at design review board before us today on by is an architect and Senior designer at MG to Phoebe Bogart is a landscape architect and landscape architect. Timothy Carter is the founding principle of cone architecture. Alan Grainger is recently retired architect. Daniel Maier is a project engineer at pae Montes Superior is a landscape architect and project manager at Berger Partnership of Garrett. Nelli is architect Knack architecture. Lauren Powers is an architect and project manager at ARC Architects and our reappointments are May. So I was a senior Associates senior associate at Methuen. I was twenty years of architectural experience and project leadership Melissa Alexander as an architect and urban designer with nbbj nbbj. Is a fan Dallas with the Seattle design commission Hutchins is the founder of cast design build and cast architecture Crystal. Loya is a project manager and project architect at Graham Baba Architects patreese. Martin is an associate principal at Olin soszynski Jackson architect. Steven Porter is a developer with skanska commercial development. Belinda bail is a senior vice president of development with mental Kennedy and Andrew Haas as a project manager in colleges at City Light. These are our sorry to mornings and forgotten Alastair Townsend is a senior development Analyst at bentall Kennedy and Brian Walters as an architect Olson kundig Architects, and I moved to confirm appointments 013263201344. Thank you very much. So we're going to read three through seven individually of these appointments before I do a voice vote on each one of these would any other coming I members like make any questions or comments cuz she want Thank you for the. People being appointed or reappointed to the design review board, which is one of the most important of the boards and commission set up by the city of Seattle and community members have questions or concerns about a new building. They go to the design review board and the Lord has the ability to listen and require changes if necessary on the 42 seats on the design review board summer designated for local community members are there was a designated for a submit subject matter experts and others are for developers and businesses and you know everything about nature of technical expertise to be able to accurately evaluate development voices of Ordinary People represented adequately. It seems like all the new appointment and many of the reappointment Saar Management in the development industry. And even in the seat that are supposed to be reserved for residential Representatives people. The people being appointed are The ones with professional guides to the corporate development industry and I'm concerned that this will deprive the commission of the voice of working people who many of whom are struggling for affordable housing boards and commissions like a design review board our volunteer positions, and I'm sure that most of the people who volunteer have professional interest and expertise and design and development. However, it's a concern that having all the new appointees having those dieses to imbalanced. I will be voting. Yes on all the reappointment and I will be voting. Yes on design professionals were being appointed two seats that are designated for design professionals, but I will be voting no on the three new appointments for people with management guys to Big Business are being appointed to the seats reserved for Community representatives and the individuals that just to say that the seats reserved for Community represented should be filled by Community Representatives. Thank you customers want any further comments or questions before we vote? I'm going to take these individually those in favor of confirming appointment. 01326 which is Hyundai agenda item number three, please vote aye aye those opposed vote. No the motion carries appointment is confirmed. Those in favor of appointment 01327 of Phoebe Erin bogert age in Titanic for please vote. I opposed guys. Haven't the appointment is confirmed. Those in favor of appointment 01328 appointment of Timothy Carter agenda item number five, please. Go die. I opposed the appointment is confirmed. Those in favor appointment 01329 the appointment of Alan Grainger agenda item number 6, please go die. The appointment is confirmed those in favor of appointment 01330 Daniel Maier agenda item 7, please what I opposed. The appointment is confirmed unless there's any objection a comment. I'd like to vote on items 8 through 21. Together and come smoke with check or you did go up to 21, I think correct. So I can vote on items. Any if there's no objection going to take those collectively all those in favor of appointments on the agenda items 8 through 21, please I realize have it. The motion carries appointments are confirmed. Okay, let's go with please read agenda items 22 to 24 together the appointments of Al Levine and Jamie Marie stroble and the reappointment of Amy shumann as member Seattle Planning Commission for terms ending April 15th, 2022. The committee recommends the appointments be confirmed. So we have two appointments and one reappointment of the Seattle Planning Commission. Al Levine is the former deputy executive director of the Seattle Housing Authority. I only recently left a part-time teaching position at the University of Washington Jamie Strobel who works at King County's climate action team as a lead on climate Community engagement and collaborative partnership efforts as she barely started on the Planning Commission as in Mariel, Mariel Winnie and is now being pointed at the council appointing Amy shumann is a planner in the healthy Community planning and partnership program at Public Health. I don't King County and it's a real pointing to the Planning Commission. Farragut any further questions or comments? And that those in favor of confirming the appointments 23 through 24, please go die. I know the motion carries and appointments are confirmed. So we've already taken a Gen X 25 and 26 replace religion item number 2727 320 standards advisory commission for a term to April 30th, 2020 the committee recommends that city council confirm the appointment. agenda item 28 appointment 1282 Excuse me. Let's just stick with my 7 once she was originally appointed by council member her volt. Thank you so much for speaking to that appointment originally in our committee. Last week is the owner of Quick Service restaurant where she oversees the team of about 137 employees has worked very hard to provide employees with educational opportunities and a safe and welcoming workplace for all employees. She is very active in the community and she Volunteers in her school district at the national Helping Hands and alliances. Well, this will be his second term serving the commission. Forget any questions or comments? It's not those in favour confirming the appointment, please but I know the motion carries an appointment is confirmed. Please read agenda item number 28 to the appointment of Jillian Cronauer as member Capitol Hill housing Improvement program governing Council for a term to March 31st, 2020. The committee recommends the appointment be confirmed. Thank you. Mr. President. Jillian is being appointed by the Capitol Hill housing Improvement Council and currently live in District 3. She's the CEO and designated broker for hunters Capital where she is responsible for property acquisition marketing leasing in public relations and overall business operations has served as president of the chair and chairperson of the Capitol Hill Chamber of Commerce and is a graduate of the Khan's full recommendation from our committee for the full Council consideration. Alright gozags any other questions or comments? Those in favor of confirming the appointment, please. Go die by those opposed both know the motion carries and the appointment is confirmed. Please read Legend items 29th through 31 agenda items 29 through 31 appointments 13 12 through 13 14 the appointment of Kelli. Yukino Larsen as member and the reappointment of Ann T Melone and perdita poop. Diarrhea. As member is housing Levy oversight committee for terms to December 31st, 2021. The committee recommends the appointments be confirmed. The president of Kelli is the CTO for Plymouth Housing where she oversees Services provided to Plymouth residence and leave policy program development and strategic planning initiatives. She was inspired to serve her community by her experiences as a first generation Japanese-American appointment. She resides in District 3. This will be her second term serving on the committee and is a business development officer for a Housing investments at US Bank or and is responsible for for for originating low income housing tax credit investments in the Northwest and Rocky Mountain States. Also pradeepta is a mural appointment and resides in District for this will be her second term on the commission has executive director of interim Community Development Association where she's lived leadership development and social services and currently serves as the co-chair of the CID Community stabilization work group focus on sustaining affordable housing small businesses and services for the organ servicing organizations for the community. Very good. Thank you any questions or comments on these appointments. If not those in favor of confirming the appointments, please vote. I know the motion carries appointments are confirmed that concludes our agenda. Is there any further business going for the council? Yes customer Juarez. It's removed and second accounts. Remember words be excused on June 17th at all those in favor. Say aye aye opposed the eyes have it if that we stand adjourned. I want a great rest of the day.", "end_time": 3779.9}]}