{"format": "raw", "annotations": [], "confidence": 0.9578165046630367, "data": [{"start_time": 0, "text": "Good morning. Thank you for being here for a regularly scheduled briefing. We have several excused absences this morning. So we should have a relatively short agenda for a briefing but we do have two executive sessions that we will go into. I'm all just Briefly say that I am joined by customers Bagshaw Pacheco and Gonzalez and if there's no objection the minutes of the June 10th 2019 Council briefing and meeting will be approved. An objection those minutes are proved. We have no idom's for vote this afternoon from the government's equity and Technology committee. Would you ever regularly scheduled meeting tomorrow at 9:30 and we have some some appointments to some 202 several commissions and we may talk through some information on the Celtic excavation technology and organizational issues. We may or may not wear short up deciding that now so everybody so we have one item this afternoon on the finance in neighborhoods committee. It's an ordinance from our FAS Department regarding Seattle Public Utilities Wharf building nothing abnormal about it routine and we expect to bring it forward and hopefully pass today. We actually have next week is going to be a big meeting for the financing neighborhoods committee will have the Seattle City Employees Retirement System report. That's something that I've been working on it, you know by virtue of the fact that I'm chair of the finance committee and we are asking the head of the department Jeff Davis and Jason malinowski who leads our investment team to come and talk to us about some of the things that they've been working on and the fact that we have had a clean audit on the retirement system and also in response to legislation that Senator Ruben Carlisle had offered for the last three years would would give the city the option to join the state system after an independent analysis and review that I've asked for came back and said they wouldn't have ject to having the option but there was no movement or desire to take the Seattle City Employees Retirement System into the state. So they'll tell us more about that. I've got two proclamations today that I'll be circulating one is for recognition of the design commission and their 50th year anniversary event in this comes at the request of our friend Michael Jenkins. And also we received a proclamation which is recognizing the need for communities to deal with and get prepared for Wildfire smoke the last couple of August. All of you. Remember that we could hardly breathe around here. And then this is a proclamation that started in the mayor's office. Proclaiming June 19th recognition of wildfires seasonal air quality response and we're going to have a community day. So I'mma circulate those for you right now. Thank you very much. That's the from Chico. Good morning everybody. Good morning. There will be three items on the agenda a discussion impossible vote on a clerk file, 314-4138 cancel that Portables in parking a discussion and possible vote on Council Bill one 19471 clarifying the definition of a vessel at no one to send a quick shout-out to council member O'Brien and comes over her before they work on that as well and a brief discussion of possible 011194546, which is the update to the art the Rio. And so wanted to make a couple of quick announcements around this week. There's going to be opening of the my district office Grand Opening will be hosting an open house outside of the new district office. It's go get the University Heights Center in the south parking lot in basketball court area surrounding the U District farmers market. Hope you having demo lime scooters. And if you're available on Saturday, I love to have you join me this also going to be transportation choices Coalition at the you hike Center on Thursday, and I want to recognize really quickly volunteers from Ravenna who do a neighborhood pop up to help feed the Homeless. And so I was able to participate yesterday as part of Father's Day. Is one of the things that my dad always taught me was always count my blessings make sure that I was not able to be with him. I was able to recognize the Pacheco a little rewind here and let's get settled I forgive you too long the council member herbold. Good morning, everyone the sustainability and transportation committee doesn't have anything on this afternoon's agenda. We have our next committee meeting tomorrow afternoon at 2 p.m. Three items on that agenda. The first item up will be a discussion and possible vote. That's the plan at least for the backyard Cottage legislation. I appreciate all your work with me on this is essential staff memo posted with the agenda that this over half-a-dozen amendments possible amendments will be considering so if folks are planning to be at that meeting take a look at that to get a sense of the types of things will be discussing go again will be to consider any Amendments of people want to bring forward and then have a vote out of committee as a reminder that assuming assuming we decided to go to the full Council, but it won't be the following. Someday, it'll be a two weeks from today at the earliest because of other land use notices would like to have to do oversight committee. And then we're going to get a briefing from Seattle Department of Transportation on the implementation of the bike master plan. They had aided drafting fermentation that came out in March that a lot of committee members had some concerns with they released a new version of that last week. So we'll be having a discussion of that in addition as part of that discussion the other members of the transportation committee and myself sent a letter to S. Two weeks ago asking them to respond to some concerns we have about the implementation of complete streets on 35th Avenue Northeast originally for the long time. There was a proposal to have a protected bike lane up there. But the last minute that was scuttled that in the convening. Couple months since that has ruled out there's been a couple collisions with serious injuries one to someone in the bicycle Once Upon a motorcycle. So and then other video footage indicating that it seems to be a not very safe alignments are asking them to respond to some concerns we had about the safety up there. If in fact we made some designers let's talk about what the opportunities are to fix them. If they weren't design airs. You know, let's explain how we make this a favorite of the certainly doesn't look or feel safe. What's going on with their customer base. You can't remember Brian. Thank you for bringing this back up again and councilmember Gonzalez. Thank you both for participating yesterday and the event that started at City Hall and went to Westlake I talk to another number of people up there and I've not I've not ridden my bike up a Northeast 35th, but I saw some video yesterday that was really scary and that what we have effectively done. Is I think respond to the people that wanted to continue to drive over 30 miles an hour in their cars on 35th Northeast, which really rendered it more unsafe for people riding their bikes. What I saw yesterday was a group of people riding Northbound and then cars passing them in the center lane and I'm having to accelerate to do that and I'm going to ask for as we talked with us. To see what we can do to revisit that and if we just have to say look it was a you know, it was well intended but it's not working then let's figure out something that we can accelerate and you mentioned yesterday and I really can curl on this there's some things we want to do in the next 6 months and I would love to prioritize some of these safe bike Lanes weather there, you know take North South and 4th Avenue is an example but get these That works cuz people want to ride safely, but I was when I saw that 35th Northeast, I thought we we don't have this right yet. So thank you, and I'd love to work with you. Turn based on the only thing I was going to mention was the event that touched down. There was a street safety event yesterday that community members organized talking about pedestrians and cyclists a fee and including folks in the disability rights Community talking about how we better prioritize our sidewalks to ensure that our most honorable volume transportation system users. Feel safe is a really great event. I don't know the numbers but it was a packed City Hall Plaza and with the help of the police say shut down 4th Avenue for a parade Ride walk March up to the Westlake Plaza and it's great to see so many people out there including the number of young kiddos with their dads on Father's Day out there pretty around so great day. Thank you guys for Bryant Customer bold. Meeting this week. There are no items from my committee on the full Council agenda. I've to Regional committee meetings coming up this week the original Transit committee as well as the flood control district, and then as far as events that are coming up this week on Wednesday. I'll be speaking on a panel at the women's center Eileen Morris new Leadership Institute on Thursday. I will be visiting with ecology with spu director Mami Hara and we'll be seeing the new electric truck that's in our new Fleet. First of the nation Class 8 electric garbage truck and then Saturday, I'll be speaking at the Seattle University School of Law event. How real estate responds to disruptive change and then just as a DVD want to let folks know that I'm looking to Host a lunch and learn we haven't nailed down the date yet, but working with the folks at the Legacy Memorial looking to do sort of an update on on the on the project and just a little bit of background in 2015. The other Council allocated funds to the office of arts and culture to do initial planning to build a memorial in honor of Life loss during HIV AIDS crisis in 2017. The council passed a resolution sponsored by customer Juarez to work to pull together and I D T A Home of interdepartmental team of departments led by the Arts office to look at how to bring this project forward and this I went to One of their events that they held last week and thought with the organizers at this would be a good time to check in on the work of the IDT. So would love to have a representation from Council Members. I am working with council member war is on identifying a date that works for everybody. I think you're good morning. Good morning. There's only one item on this afternoon city council meeting agenda from the gender Equity safe communities new Americans and education committee. That is Council 11195 3/9 really into the countywide emergency medical services Levy that will fit is up for renewal on the ballot for King County voters the next general election, which is November 5th 2009. This Council bill would authorize America enter into an interlocal agreement with King County as described in the bill and would Advance the effort of the county looking at places. This Levy renewal on the ballot for the general election. So if approved by King County voters a new Levi would provide 436 million dollars during a six-year period and total revenues to the city of sails fire department for emergency medical services. So that bill will be on the full Council agenda this afternoon. It is a product of about a year to a year and a half's worth of regional task force work that has resulted in this would have agreed upon package as a region to 75% of the cities in Kane County have to agree to the structure as proposed by the task force to this is our opportunity to be one of those 75% of the cities in King County to Signal our agreement with the task force recommendations of via this bill and then we will go ahead and make sure King County is aware that we have agreed and we'll be Off to the Races literally. Okay this week the Dozen Ted committee is scheduled for a special meeting on Thursday, June 20th at 6 p.m. The location of the public meeting will be at Yale locational Institute in room 401. So you may have seen an announcement for my office last week that we were planning a special meeting to address and have a conversation run gun violence in the Central District. We had to change the location from Washington Hall to Seattle vocational Institute in room 401. In order to take advantage of the fact that the African-American advisory Council which works with a very closely with the Seattle Police Department was also having their meeting on the same date same time. And so we're going to combine efforts and have a coordinated meeting with the African American advisory Council to have a community conversation around some of the gun violence issues that we have been seen in the central disc. I understand that kills members will be in attendance. It is her District in it when I appreciate her office and there was a lot for her cooperation as we have continued to work through the logistics of this potential event. All of you are of course, welcome to attend if you're able to attend, I think it'll be a really important opportunity for us to hear not only directly from Community as will be having public comment towards the end of the meeting but as part of our committee agenda agenda will also have various City departments give a presentation on strategies to address gun violence in the Central District those departments include the Seattle Police Department Seattle Department of Transportation, Seattle City Light Department of neighborhoods Human Services Department, Seattle Parks and Recreation and the office of Economic Development. So really want to Signal my appreciation for the mayor's office and her Administration for their ongoing cooperation in partnership with us to make sure that we're Timely relevant information out into community that hopefully will be responsive to some of the community request as it relates to build environment Upstream interventions that will disrupt the violence and of course then just the basic law enforcement and things that need to occur in order to prevent and hold people accountable when they do engage in this Behavior. So really looking forward to being in community. This is a commitment that I made about 3 weeks ago to members of the community who were asking for the city to have a response to some of their concerns and to really present a plan on how we're going to move forward to that really disrupt these incidents of gun violence in the central district. And of course, we all woke up to an article in the Seattle Times this morning talking of But how there were additional gunshots fired in in the van asselt community area. And in fact, I had the last report that I heard said that there was about 50 gunshots and some of those gunshots did in fact hit one of our community centers of NFL's Community Center. Luckily. No one was hurt. But again, this is this is yet another incident that I feel like we keep having to bring up here and in these Chambers and I think there's a really great opportunity for us to work together with Community both new and Legacy residence in the Central District to really take a serious look at how we can change the environment invest more deeply in this community to prevent these kind of incidents from occurring I have been in contact with the Seattle. My office has been in contact with the Seattle Police Department and with Seattle Parks and Rec weed Back this morning from Christopher Williams hoof course is now the deputy superintendent for Seattle Parks and Recreation. He indicated that today the community center will be fully staffed and operated also plans to reach out to the South Precinct this morning to coordinate with them strategies for making sure that the area is going to continue to be safe. So that folks who want to take part in the programming at Venice. I'll feel like they can do so safely today if particularly in the aftermath of this report at parks is going Parks and Recreation will continue to highlight their summer of safety programming. And for those of you who don't know about the programming. It is an important part of Seattle Parks and Recreation programming at community centers, including Venice out that will create safe space and structured programming for young people in particular lyrics including and specifically focusing on Diversey and low-income populations. So again been a salt is one of the community centers that is receiving that so Sap programming and will continue to monitor this and get as much information out the community and to each of you that might be interested in sharing information with your networks as well. So that is all I have on that issue if there's any questions, I'm happy to take them on that. Otherwise, I'll finish my report this week. Just wanted to let folks know about and a couple of other things that I'll be participating in on Tuesday, June 18th, which is tomorrow at 6 p.m. I'll be coasting a screening of knock the house down with my good friend and senators and Regional in as well as Center to Mona Das and vote run lead at the Riveter on Capitol Hill after the movie will participate on a panel discussion to talk about what it means to run for office particularly. If you have a unique set of experiences, the event is free and open to the public. They are requesting that you RSVP because space is limited and that RSVP RSVP. Link is posted both on my Twitter and Facebook accounts on Friday, June 21st at 11 a.m. I'll be joining the Washington Leadership Institute at Perkins Cooley to talk about ethical leadership while I'm elected especially as we served over stakeholders and solve complex problems inner city. And for those who aren't aware of the Washington Leadership Institute is a leadership development program created to recruit training spell traditionally under-represented attorneys for future leadership positions in the Washington State Bar Association and the legal community in general. So I'm really excited to go and spend some time with these young. Where's talk to them about how to tell if their leadership skills. So that is all for me. This will be out of the office until I'm going to be cheering her committee this Wednesday and it's going to start a little earlier than usual. It's posted a starting at 1:30 p.m. Rather than 2 and their Items on the agenda both the rsji reports one from Seattle Center and one from Seattle Parks. So that's again this Wednesday council member War has his committee and I do want to say a special thanks to council member was for her last committee where she was focusing on indigenous women and those who are missing and murdered. It was really quite a stunning Full House and very moving and I want to say thank you to an echo Hawks and others who were here to present and also want to say congratulations to our former colleague converges. He graduated from college past weekend, and he was actually one of the speakers. They said to The Faculty that were behind him that he apologized because they try to have graduation rates at least by five years and it took him 50, but we're proud of him. There were many graduations. I Know Chief best delivered the princess switch is Garfield High School and we got some real good feedback about that. I delivered the the commencement address for University of Washington Bothell campus at T-Mobile Park Saturday, and I was in farewell eternity been in participated in the the kente ceremony graduation ceremony at Minnie Hall Thursday evening. And so that was a great great times for a lot of particular lot of first-time graduate from college, but even those that has been a lot of graduation. So it's a good weekend. I do want to mention this Thursday coming up from 11:30 to 2 at the birth of Knight Landes room. We have the Juneteenth celebration event until all are welcome in this should be a real good celebration. I think many of you know, the story behind Juneteenth so I won't bore you with that but should be an exciting events. I want to see if I suppose that will be it starts at 11:30 and we'll go till 2. And having said that thing for all those reports we're going to move into executive session. After presiding officer, I'm announcing that the Seattle City council now can being an executive session the purposes discuss confidential legal matters relative to a potential actual litigation and this gives us an opportunity to discuss these matters with our city turns as authorized by law. We always have a monitor from the city attorney's office to make sure we reserve questions of policy in our public open sessions expect this session to last for about 60 minutes and so will say What's a 11 a little over 60 Minutes 11 this morning? And if it goes beyond that. I'll announce the extension and it's expected duration that will go into executive session.", "end_time": 1478.0}]}