{"format": "raw", "annotations": [], "confidence": 0.917869821190834, "data": [{"start_time": 0, "text": "Let me get out of here. Good afternoon. Thank you for being here for a June 17th meeting the June 17th, 2019 city council meeting of the full city council will come to order its 2 p.m. I Bruce Herald Press on the council the clerk. Please call the roll. swan Big Sean Gonzales six present today's meeting and I'm Jackson council members want so want is excused from today's meeting if there's no objection today's introduction and referral calendar will be adopted. Hearing objects in the introduction and referral calendar is adopted and similarly if there's no objection today's agenda will be adopted. I have an amendment to make today. Now do the time is it sure. I move to hold Council Bill one 19539 until the city council meeting on Monday, June 24th, 2019. I'm sorry. It's been wanting a second. Okay. I had that motion on my script address. It would have had come up. So that's why I was looking for you some but we can do it now. That's a protest was removed and second of the whole to the day stated by customers almost any questions all those in favor. Say aye. Okay. So having said that list approve Vision all those in favor of approving the agenda as a minute, please go die. I opposed the eyes have it. The minutes of the June 10th 2019 city council meeting has been reviewed and there's no object of the Mets will be signed. 3 minutes are being signed presentations. I believe we have one presentation cast member badshah. I am delighted to welcome back to these Chambers are good friend. Michael Jenkins. Thank you for being here with all of your team today. We have a plot Proclamation and we are designating June 19th 2019 at Seattle design commission day. I want to say thank you to all of you who volunteer so much time and so much effort and also all your predecessors that we're working on this horse. So if I'm a read it because I think it's quite fancy and then I'm going to present it to you where I was on February 13th 1968 voters in the city of Seattle and King County pass the series of bond measures called forward thrust that resulted in the funding of critical Park Public Works projects to improve the quality of life for Seattle and the region and the adoption of the forward thrust Bond measures included a requirement that the city and county each created design commission to evaluate the design of the various Public Works projects funded by forward thrust and where is the mayor in the city council approved ordinance 9 6897 on July 17th 1968 creating the Seattle design commission and whereas the Seattle design commission was established to advise the mayor and the City Council on the environmental and design aspects of any City fundador approved Capital Improvement project and the impacts of private or public agency proposals for the long-term or permanent use of public rights-of-way and since its creation the Seattle design commission has advised the mayor of the city council City Department on / 1250 projects including Parks community centers police stations, fire stations, swimming pools tennis courts, growing facilities museums concert venues libraries water quality facilities Transit facilities convention Center's office building City Hall's roadway Improvement and many other critical infrastructure projects designed to improve the quality of life in Seattle. So I'm just going to skip to the end here where the mayor and the city council. Recognize the Seattle design Commission in honor of the past present and future contributions that Commissioners and City staff of played in advancing design Integrity of publicly funded projects in the city of Seattle. So now there for the city Seattle City council and the mayor hereby proclaim the day of June 19th 2019 as Seattle design commission day and thank you all and if you would kindly suspend the rules, so I'm a present this hello. Thank you. Mister Jenkins. Nice to have you back. Where you belong? There's two of them. I'll still sign them. Thank you so much for this. You know, we're fortunate enough. So this cast of characters in the front or three of our commissioners Ricker chalice who is are at-large member Mark Johnson who's one of her to Architects and I'm all you're waiting who just joined the commission as our transportation planner and then Valerie Keen s2r commission coordinator, Erin Hershey huszar planner and finally Juliet Acevedo who is our Administrative Assistant who keeps all of this running for us, you know, we've been with an event on June 19th, which is wonderful that the the proclamation corresponds with the day of the event our 50th and event 50th anniversary celebration, and we hope you can all make it. We have a number of speakers both current and former Commissioners and we're being opened by Leonard Garfield from Ojai and Colleen echo-hawk is also going to be present at the event to offer some of her Directives about what the commission might look like in the next 50 years. So we hope we can see you there but most importantly thank you so much for the honor and we'll be sure to frame it appropriately in the department. At this time will take public comment on item that appears on that appear on today's agenda are introduction for Ocala and in the city council's work program. I do not believe we have anyone signed up. So I'll ask anyone in the public. They wish to have public comment at the sign up. We are always receptive that and if not, we will close by the comment. Thank you again. Just moved to payment of the bills. Please read the Title Nine 5:45 or 5 take the pill patch any comments. Please call the roll on the passage of the bill. O'Brien president opposed The report of the genetically safe communities new Americans that education committee that agenda item has been hailed. So please read the next committee report Services Equitable development and renters rights committee agenda items two and three appointments 1368 and 1369 appointment of Dinah braccio as members that are Ventures commission for a term to February 20th, 2021 an appointment of Mac Scotty Ray McGregor as member Seattle Ventures commission for charm to February 28th, 2020 the committee recommends these appointments be confirmed. Poking cast members wants apps and so I'll introduce and describe these matters the first appointment to the rhenish Commissioners as a clerk described as Dina braccio who's been an advocate and educated with the tenants Unit 10 Tenants Union of Washington since 2015. She brings a wealth of knowledge of housing issues and disparities from the community. She's an educational education counselor is connected quote know your rights and quote workshops in tennis across the state of Washington and works on the tenants Union hotline to answer renters questions about their rights as tenants. That's a pointy number one. The second appointee in the appointment. 01369 is mac McGregor Big many of you know, Mac Scotty Ray McGregor who is a renter and trans activist and educator. He has de stated the desire to do all that we can as a city to protect the rights of all people. Ashley those in already marginalized parts of our communities and he believes serving on Seattle's renters commission would be an impactful way to do that and he serve previously on the city's lgbtq commission and so the wreck the committee recommends that these nominees be confirmed any questions about these nominees. You're not those in those in favor of confirming the appointments, please vote aye aye those opposed vote. No the motion carries and the appointments are confirmed. Please read the report of the finance and neighborhoods committee services on the map in Seattle Public Utilities to negotiate and execute real property lease agreement. And then that's with broad Acres LLC for office space and a silver uses and they're worth building locate 4209 21st Avenue West and I just I'm confirming certain Pyrex. The committee recommends a bill passed. They are moving a group that focuses on the kind of ecological disaster that none of us want to see happen and they've got 19 staff and 16 vehicles are in one boat and they need a place to put all of the vehicles and they're planning to move over on the Wharf Street which is off of Emerson. I'm down by the Fisherman's Wharf Specifics on this is that it'll be 7759 square feet of a warehouse. They work closely with FAS who went through 15 different sites. They visited The Forsyte Saga cost comparisons. This will be a 10-year lease that allows them to add one five-year option or to actually reduce it to eight years. If they decide they don't need that much space and this is actually because of the linear Reservoir that is going to be constructed in Ballard. So the landlord's going to provide $310,000 for tenant improvements negotiated rent is $25,055 per month and increases annually and this is consistent with the amounts of money that others are charging in our area. So I want to say thank you supposed to Seattle Public Utilities the folks that came in and briefed us at our committee and also to FAS for the good work that they've done to make this happen and other committee unanimously recommends that we have Are there any questions or comments? Please call the roll on the passage of the bill 6 in favor and opposed the passenger side. I believe that concludes our business on today's agenda. Is there any further business to come before the council customer Gonzalez has been moved and seconded comes around Gonzales be excused on June 24th. Any questions or comments all those in favor? Say aye opposed the eyes have it any further business come for the council. Customer Brian be excused on Monday, July 15th on July 15th. Any questions or comments all those in favor? Say aye opposed the eyes have it and then else. Okay, we stand adjourned and everyone. Have a great rest of the day.", "end_time": 784.2}]}