{"format": "raw", "annotations": [], "confidence": 0.9274221681792971, "data": [{"start_time": 0, "text": "Good afternoon, everyone. Is July the July 1st 2019 city council meeting of the Seattle City council will come to order. It's 2:04 p.m. And councilmember shama seven council president pro demo the council will the clerk. Please call the Roll bike shop Gonzales President Pro Temp Salon a present. If there's no objection the introduction and referral calendar will be adopted. Kodi no objection to introduction and referral calendar is adopted. If there's no objection the agenda will be adopted. Jerry no objection. The agenda is adopted. The minutes of the June 24th 2019 city council meeting have been reviewed if there is no objection. The minutes will be signed. Cherry no objection to minutes will be signed. We have a couple of presentations share. So if there is no objection the council rules will be suspended to allow the presentation of the proclamations and all the items. And I think you have the first one Bank you council president pro tempore colleagues later today the first item on this afternoon's agenda. Once we get through public comment is an ordinance that will change the name of the festival Street portion of East anyway between Broadway East and 10th Avenue East and renamed it to East Barbara Bailey way Barbara Bailey was a community leader in a community fixture for so many in our community for so many years and I wanted to just take a moment and presentations offer up to her brother Bruce Bailey to say a few words about this designation. Thank you for taking the time to listen to me for a few minutes about my sister. I know you have a very busy agenda. My name is Bruce Bailey. I'm here today representing my family and many friends to express our sincere appreciation to murder working in the Seattle City council for considering action to rename a portion of Denny Way. You want our Sister Barbara? We all are a bit overwhelmed by this but we are very grateful for your consideration. Barbara was a remarkable person who interacted and impacted many different individuals and groups and Seattle and around the country in a variety of positive ways. In fact, it was until her sudden death last September from a massive stroke that those are that's closest to her really truly began to understand and appreciate the magnitude of our impact the huge Gathering of support. We received at the time of death from so many people was confirmation of the depth and breadth and quality of her life. Robert had an outgoing personality and a strong set of beliefs that she was never shy about expressing but in no way was she's a self-promoter seeking accolades sometimes I wonder if she herself was even aware. Of the positive influence. She had on so many areas of our life. Certainly. She never talked about them nor took credit for them. Therefore. We are particularly thankful for your consideration to recognize her contribution in this form away. Barbara had many friends and acquaintances in groups that respected admired and yes even loved her that her name might stand close to where she lived went to school and worked at arconic Broadway bookstore will be so appreciated by so many and Hance seems particularly appropriate to us. Thank you again from a grateful Bailey family and from a community that loved and Mrs. Barbara Bailey. Thank you very much. pinky brace Thank you and Onyx presentation from consumer back show the next one. So you think we're moving right into item number two, I believe you were you had a presentation? Not today. Is anybody presenting on this? I thought they were. I'm sorry at this time. We will take public comment on items that appear on today's agenda the introduction and referral calendar and the city council's 2019 work program. The public comment will be accepted for 20 minutes and speakers are limited to two minutes of public comment. If the speakers, next season 2 minutes the clerk will turn off the microphone speakers are asking because your comments by identifying themselves and the agenda item that they wished you a dress and I believe it will go over the 20 minutes very likely so it will come to that do it. The first speaker is Michelle Hassan II is Porto Lofts 1030 Laura Laura Laura Bernstein. So if you if you hear your name being called out, even if you're next in line, just make sure you're ready. So we don't spend time with people walking over this quiet. Thank you to the council and tomato jerk and I Michelle hasson and I chair the AIDS Memorial pathway project. We are over the moon that Barbara Bailey way will be an integral part of this project, which I know you have all supported. I am going to just see if I can get someone to pass this out to you because I want you to look at this picture Barbara. I don't know how many of you really know her or knew her, but I want you to see that she has a Glass in one hand which was always fun, but the other hand but she's doing is she's reaching out and that was so Barbara because she reached out to everyone in the community no matter what. Lesbian, whatever she reached out. The bookstore was reaching out and buy that picture. I think she's still reaching out. So I want to thank you so much Michael Brian. Thank you for sponsoring this and the mayor again. Thank you, and thank all of you because I know you'll be voting. Yes to name this Barbara Bailey way. Thank you. Of course, I was born in Seattle. I plan on dying here and I love the city and so I'm here and I think that's why all of you are here to Backyard cottages and I think it can be a really great idea and allow people to have a little extra Revenue. It can make it easier for kids to stay at home, which I guess is becoming more popular these days and you do a lot of great things, but I have a couple problems with it. I've been racking my head trying to figure out why we would allow anybody to invest in your not having any requirements even live in the city invest in his backyard cottages and if there's something having to do with it being easier to get a loan then maybe attack for the loan is but I really don't want to see my city turned into a place where every single single family home turns into a rental property. No freaking to make Seattle rental City. I want to see you know, something more efficient like rental apartment buildings. And also with the parking lot. I would love Seattle to be a city where you didn't need to drive but that's not the case and I feel like this, isn't it? Sample of the city wishing cars away with not actually understanding that they're not going to go away. There's a lot of parts of the city. You can not get to without a car and you know, if we had mass transit everywhere that be great but I much rather see density go around for the mass transit hubs are and I know there has been up going around that I'm excited for that was reading this morning the 20-year plan for Seattle and it says there is housing capacity for over 220,000 or homes will not Homes apartment buildings housing units with whatever you want to describe it as putting auxiliary dwelling units. I think it's great to have as an option, but I don't want it to be an investment option. I wanted to be something that people can do for other people like in the families so they can rent a good morning. I'll get some relief on you know, how expensive things like that but it does really bother me to see that that particular options been taken out in the parking also bothers me. Thank you for your time. Nexus Nexus Laurel Bernstein and then after that we have Kimberly kangan Shelly Cohen and Stuart mcfeely. Please be ready to speak group. I believe they get extra time within 5 minutes. Persona say thank you so much to the council members that are showing such strong support for this legislation and spoken out counselor mosquito Brian Gonzalez you both thank you so much for everything that you've done to educate folks about this really important issue for renters streaming weather Winters make good neighbors are not that's really upsetting to everybody that standing here with me on May 14th, news reported that the city of Seattle. It's not as friendly and nice. Houses with an awesome post living in preserving ownership of the buildings that our neighborhoods is classist support for homeownership opportunities as a generation accessory dwelling unit legislation legislation today is that we have to deal with 1% of our city according to recent maps from The New York Times. We must pass this legislation immediately. Hello, I'm Jessica Western. I'm a renter. I live in Wallingford. I have been renting in Seattle since 2007. It has an additional know. I've never owned a car in Seattle and can count on both my hands how many times I've borrowed one in those twelve years. I'm concerned about the proposed amendment to have an owner have to own a property for an additional year before they can build 284 pose rule is a response to stop speculative purchase of old houses for tear down causing displacement of low-income renters, but it has found that this legislation would lead to fewer tear down lower price neighborhoods. So I'm concerned that this proposal is field of legislation. That actually is more damaging that it is helpful. There's an official see the building everything at once research from Vancouver shows that if you wait a year to build a second day to you you got $50,000 in additional costs to get in your second year built the fear is that a builder will come in and construct the property and Rental 3 when the research Vancouver is showing that they almost always sell to someone who lives on site and read see other two, so I don't want us to create more problems by trying to make people feel good when we're actually making it harder and more impactful on our low-income homeowners who want to help out their families. I'm Jessica Simpson from the Capitol Hill renter initiative and I would just like you to not accept any additional parking requirements for 80 years while Seattle may not be a place where you can get around easily without a car now. We need to plan for a city where it is possible to get everywhere. You need to go fishing Lee and safe leave by 5 Transit bike and walking. We have a climate crisis and need to cut our carbon emissions rapidly. We have even a chance of enjoying smoke freeze summer skies and future. Thank you. Hi, I'm Paul Chapman. I have just recently finished an Adu in my basement in a climate crisis and homelessness crisis. This is when the least impactful things we can do in the city in order to provide more housing encourage you to pass this reform right away following on the reform that just happened in Oregon this week following upon the reform that happened in Vancouver last year were they allowed four units on every single family allowed in the city, please pass this right away. Thank you. Hi, my name is Kimberly Kitchen on a resident of Capitol Hill and we bought a condo in 2015. So I'm here to talk about backyard cottages and speak in favor of the legislation before I do. Thank you to all the council members who spent years at this point. We're paying for this and also to all of the unpaid and underpaid housing advocates in the room for their work as well. Until 2015 when we bought our Coop on Capitol Hill. I was a renter 40 years many different cities and here are five things that my renter neighbors did for each other over those years spent decades standing and developing a community garden adjacent to the apartment building. Cooked holiday meals for one of our elderly neighbors who was a World War II veteran because he could no longer leave the apartment with a lot of effort and assistance. So it was hard for her to get out for holidays to and she don't have a lot of help. That's it as a favor when other neighbors went on vacation hold keys for the apartment across the hall until stopped to wait for an ambulance to arrive after coming across a neighbor who is injured on a trail and stopped at his apartment to give his family a personal update after he went to the hospital and take his personal belongings back in that last person was me. So in short. I just want to say renters make great neighbors and backyard or housing choices at a time when we desperately need them. Please pass this without parking amendments without other amendments. Thank you. So Shelli will go next and Stuart mcfeely Ira Appleman & Judith bandage. Hello. Cancel, you folks know me quite well, I'm many different hats and hopefully it is your assignment I gave you last time. I was here regarding facing homelessness and the block project cuz it had Matthew putting on a different hat. Rex Holbein with facing homelessness and the block project gave me a statement to read. Please speak at a longtime volunteer for facing homelessness and a believer in the importance of Integrated Solutions for ending homelessness integrated as a means of removing the stigma of other given to those experiencing homelessness. The block project is an integrated solution that brings Community into the task of addressing our unhoused and does it with dignity providing the same needs of home. We are home. We have kitchen bath and sleeping all begins with each of us steps forward just say hello in the end. Love you Shelly. Other folks really sad that we've heard so far and the block project in particular that requires the homeowner to be there. Chances of needing additional parking not likely because of the clientele that we have maybe room for bikes. Cuz that's a likely Target. So make any improvements. You can to help the block project and having two additional units besides besides, that would be great. Thank you very much. Yes. Hello. My name is Stuart mcfeely. I am a licensed architect. I've been doing residential architecture in the city of Seattle for 27 years support accessory dwelling units. I do not support removing the owner occupancy aspect of that legislation because you are creating duplexes or triplexes that can just be picked off by developers a problem with adus and Dodgers right now as the building department. They are dysfunctional it take 6 months to get a building permit in the average homeowner. It makes it very difficult to be able to get a permit for an Adu and even worse because The new Doctor Who has to meet every aspect of the building code. So when old house that's built a hundred years ago your basement doors 32 in wide, you know what it doesn't qualify to be a Dodgers. So what we have to do is loosen the regulations create an expedited permitting process for the second issue is the fa are going .5 is too restrictive staking the pendulum the other way again, the problem here is that the buildings are torn down because they're 8090 a hundred years old. There's no way to make an old Bungalow meet the current building code. And a total redo the building department doesn't let you do it. It's two-by-fours knob in tubes. The building department is the elephant in the room. If you're going to change this legislation, you have to change the way the building department is issuing permits. They are the obstructive problem here and the cost of construction not the regulations. Thank you. I recommend going to be a beauty bandage and and then M Wells I think and then Rebecca Brown represent in the duwamish valley neighborhood preservation Coalition and the earlier this morning. I presented a detailed comments, which I think were circulated to everyone. I and I also presented 29 exhibits which I believe was given to council member O'Brien. We agree with the Seattle Times editorial board that that this is really in the Aging the a doodad do I call it the end single-family neighborhood legislation is damaged in Seattle and you shouldn't go there but I'm not really thinking that you're not going to go there today the examples that are given to support this legislation are also human Interest examples such as Grandpa and Grandma wanted to continue to live on their land and so they need to build I need to you or somebody is having difficulty staying on their property because of taxes are how much money there and they have to spend and so they need to get a little extra money. But all that can really be taken care of now you can has the gentleman who said that he he already built. I need you in his in his basement what this legislation really does is it allows speculators and developers to make single-family neighborhoods multi-family neighborhoods by building 3 units and always wonder I've been at some of these meetings before and I always wonder where are the developers and speculators. I don't recall a developer Speculator ever coming here and saying anyting are the only people who come here are the special interest people are the are the people who have something that we probably agree with that you Have an Adu if you want to stay on your property, but I think that can already be done and it's a gentleman said before changes could be made to make it easier. But that's not what this legislation does this legislation turn single-family neighborhoods into multifamily neighborhoods for the benefit of people with a lot of money who developers and speculators. I think you and I'd like to the Box isn't here. Thank you. I need you to send it. I'm here on behalf of myself. I'm a homeowner and I think that is and that is a great. I think that they're great. I think renters are great. I used to be a renter for years my husband grew up in the Bronx. You can't be anything but a renter in the Bronx. But that's not what this does. It doesn't have long-term rentals so we can have speculators come in by at the house have basically 4 units. You have the basement. You have a house you have to have an additional run along the side and then you have a dad do so, it's great. I sent you a copy of Berkshire Hathaway soliciting homes in my neighborhood. And if you don't think that's going to happen in Seattle, you have your heads in the sand and so you need to put in you can't have b&bs all these long-term rentals. I have great friends in my neighborhood who are renters, but that's not what's happening. We have beautiful. Dues in my neighborhood there cussing a minimum of 250,000 to build part of which are architect. Just spoke about you don't have any provisions in here. 4 financing for people who really need it for seniors who want to stay in their homes. You need to have that. You also need to increase open space because you're taking more and more of it away. So I would urge you even though I think it's fruitless among this group, and I'm hoping in the next Council election. We can turn some of this around, but I'm hoping for long-term rentals, and I'm hoping you retain the owner occupancy that's already there. Thank you. Thank you. Next few speakers are Michael Wells Rebecca Brown Risa Blythe and Sally Clark and we are almost at the end of 20 minutes if there are no objections. I would like to extend it for another 20 minutes. I know it's today. I have the honor and pleasure to be the manager Bailey QuickBooks Barber Bailey's book store for 15 years before I became the owner have to Barber decided to retire my friends. She opened the door to world to me in Seattle that were not possible before I knew her and she did that for other people as well Barbara came from very different backgrounds. I was a Midwestern boy from Normal, Illinois. She was at Seattle Kennedy girl who'd been to the Peace Corps in Turkey where they scape her a box of books to take with her or she read some of the great world Classics. She was one of the first Peace Corps classes under Robert Kennedy. Bailey Cory was a place that Barbie created in the world when side places didn't exist. When Barbie made a book stores. She wanted a place where people to buy the joy of cooking and a copy of the advocate and a 1982 windshield repair Bailey books that place didn't exist and she made that place exists in Seattle and she made a safe place for a lot of community members every week. We had some scared teenager come in that store looking for answers to questions for help. We had worried parents. We had people who are sick and dying with a new disease that none of us understood and they came there because it was safe because she appeared to place where they were respected and comfort education Community Enlightenment any of those things she wanted She's a very special woman. I'm very very proud of this moment, and I know that the Bailey family is as well. So thank you very much for your appreciation for her. I couldn't be prouder and spend some time on East Barbara Bailey way. Thank you. The council and fellow-citizens. My name is Rebecca Brown and I'm a novelist SAS and Ryder and I have published 13 books that I've done reading this I'm speaking in London New York Tokyo and other places because I had partly because I had the Good Fortune to live in Seattle in the early 80s and come across very welcoming community of Bailey 40 bucks was founded by Barbara Lee. My first book is published in 1984 and a lot of people weren't interested in reading or supporting the book of an out lesbian bar Bailey & the Gang up at Bailey Quarry supported me and gave me a book reading and went on to support gay and lesbian in from around the world and then non gay and lesbian writers also from around the world and Bailey quarters, really a big part of pudding Seattle on the international that are a map with the folks that bar brought to Store in the conversations that happened in the store and she was also really great at bringing culture and literature together with a personal life in 1986 for my second book was published my mom who couldn't talk to me for two years after I came out as a lesbian came to Barbara's bookstore for my second reading and was happy as a clam that there's this great Community supporting gay and lesbian writers and that there was an out successful attractive Charming funny bright lesbian like bar Bailey to make the women of my mother's generation feel safe about their kids and I'll just end was saying that my wife and I are grandparents of a bunch of beautiful grandkids, but one of them is profoundly effeminate gay boy Chris my wife took our grandson Lincoln to New York this fall and they went to the gay and lesbian monument at the Stonewall together. Grandmother and grandson and bar Baylor is part of making a world in which unless mean people are considered fully human, so she needs to be on in this way. Thanks. My name is Risa Blythe and I've been a small business owner in Seattle for over 20 years. I'm here to speak in support of East rubber Bailey way and Barbara and her bookstore was an anchor business in Broadway Capitol Hill that brought tons of Shoppers to the area. Remember when Broadway was booming in the 90s baby boy books. Was more bookstore de facto Community Gathering Spot where people felt accepted and celebrated. When she died there was such an outpouring of messages on social media. I think maybe more than the people that were close to her even realized talking about how finding Bailey QuickBooks felt like finding a home for so many people when they were young and as people have gotten older it was a lifeline. Barbara and her example as an out proud successful lesbian influenced and lifted up so many lives including my own. Her generosity and support of progressive causes was legendary. She helped make Seattle The Hub of Creative Energy and welcome that it is today honoring her Legacy by naming a street after her is a wonderful tribute one that is well-deserved and one that Seattle needs as it changes and grows. Thank you. Aftera, Sally Clark we have Jane Tobin Martin Kaplan and Joey Jim Pedro, and I'm sorry if I'm not saying your first name. Afternoon council members. Thank you very much for the time today. I am here to speak in favor of the naming of East Barbara Bailey way. I want to thank him somewhere Brian for sponsoring. You can't hand mayor durkan for proposing. It is great timing and obviously intentional timing. We celebrated Pride all this month but yesterday in particular with most of the events and the commemoration of the Stonewall riots in the heroes of a particular start of a particular phase of the movement and so it's great to be able to talk about Barbara here today and to think about how Seattle honors Heroes and a particular way in a particular action that you'll take here today. So it's great to get to talk about Barbara people who said really great things here and I'm going to repeat a couple of them. But as was noted by Michael Bailey QuickBooks was more than just a bookstore and buy as noted by others Barbara was more than just a Bookseller. I was talking about the investment that she made And people in that it was about more than a bookstore more than a handful of times. I walked into Bailey Corey book after Billy QuickBooks after maybe a queer Nation meeting or women's Action Coalition meeting or some like that. It's like Barbara. We just need 50 bucks. The purpose of most often said yes. I mean you had to answer a bunch of questions. She was kind of probably had her arms folded and probably a v-neck sweater on some kind and she was probably asking you some questions about what was going to happen. Chicken Scott Fusco I can meet a hundred bucks wants because we said we were going to do a debate, you know how people love to Bates. Nobody comes to a debate boring to do a debate because somebody is running against Slade Gorton and that person happens to like lgbtq rights and we're going to do it to do it at Kane Hall and people will show up. No, no one's going to show up. But okay, I'll give you a hundred bucks a hundred bucks from Barbara Bailey which at the time would do a lot of flyers and probably purchase some coffee for the event and I think we got him we got about seven people at that event. Look at Scott me now or well employed. It's fine, and she did that in so many different ways for people through the presence of the bookstore to the community sense of the bookstore, and it's so great to be able to honor her and be able to support your action today. Thank you. My name is James Hoban. I'm from West Seattle. I'm well aware of the housing cross problem we have in Seattle and that the city council is trying to do something to address all the issues. But I really do have some problems with the new proposals for the adus. And the dad dues. You know, what all these acronyms. I've owned small apartments and large Apartments throughout the last 4 years of my life and anything over five units. I have a resident person living in that property at a reduced rent to make sure that everything ran smoothly. Maybe I am not reading things correctly or I'm just trying to play catch-up but I don't see any rules and regulations in the control of these adus and you use function. Will they be kept the same standards as owners of small apartment buildings are large apartment buildings as far as how do we get tennis in? How do we get 10 and south are there any rules and regulations for these units? You're now from what I read in the proposals from 8 to 12 individuals in these various dwelling units. If someone in that decides that or one or two people that we have a tenant that we can't get along with who's going to be taking care of all of this. Is it now the non occupant owner who is not on site. How do we We take care of all these issues. Who's going to maintain the property? We had good tenants in our life and we've had bad tenants and we love renters there my income but there are tenants who don't care about their properties. So who's going to be addressing this issue when you have the owner that is not living on site. I'm very concerned about these were supposed to be a green City and you're saying that there's no room for parking. 11 West Seattle, we can barely drive up our streets now because there are so many people we don't have garages. My time is out. I realize that I would like the council to refer to the Seattle Times article, June 28th for practical changes to preserve neighborhoods. Their points should be considered before any vote is taken on the proposed rules. Thank you. A good afternoon council members Marty Kaplan architect in the chair of our Queen Anne Community Council land use Review Committee. Are the first sentence on Saturdays op-ed by councilmember Moscato reads like this making it easier for homeowners to add mother-in-law suites basement apartments in backyard Cottages is a good idea for housing choices and affordability. In fact this legislation that you're considering the day favors uncontrolled development of market rate triplexes by developers and speculators. It does not consider the intended homeowners and affordability the council member Moscato favors. The current home owner occupancy requirement is the only protection against wholesale conversions of our single-family neighborhoods. Your ya-yas is clear throughout including page 5-9 that this legislation is quote disproportionately favors wealthy white homeowners and developers are produced costly market-rate housing because adus are very expensive. That's what it says. What council member O'Brien in his committee have denied that such speculation will occur and see how it began here during the recession 2009. Now thousands of seattleites have been displaced in our homes are now on by Blackstone other hedge funds and National corporate interest. Just waiting for you to eliminate regulations. Just last week the New York Times and Wall Street Journal featured front page in-depth stories highlighting the rapid metastasizing of corporate investment, portfolios. Assembling single-family home ripe for conversion all across the country our neighborhood Citywide deserve better find the end. We find the owner occupancy requirement the most important regulation to be protected. Let's not gift away our wealth of neighborhoods and homes to profit-driven hedge funds and developers instead of actually consider homeowners affordability and neighborhoods. Let's be smart. Thank you. For the next speaker goes we have Kelsey Hamlin and Larry Kelly next. Thank you for taking a, today city council. My name is Joe John Petro. I'm an architect and a low energy building consultant has a long time home owner in Ballard. I one of those who might take exception to have the actors in Daddy was coming to my house having children. However, I realize how impossible it has become for the Next Generation to live here in our Fair City simply because of economic growth. So I fully support the proposed changes to the accessory dwelling unit regulations have a problem that is very difficult to overcome a land-use history of primarily single-family zoning which by its nature is exclusionary. For example, I was in Philadelphia recently for a conference right? I got to school and noticed that there were no homeless anywhere to be seen in spite of the low-income population in Philadelphia and wish 25% live below the poverty line. They have fewer than 1,500 homeless in a city of 1.5 million twice the size of the city of Seattle homelessness problem in Philadelphia is less than one-tenth of hours. How could that be? Philadelphia is the city of Rome houses with no restriction on numbers of dwellings Perot house there for the affordable affordable housing up to these are not constrained by land use regulation. I suggest that buy this one action Seattle will be able to overtime. Welcome our children or grandchildren new residents teachers childcare workers, and those who serve our community who need much less expensive housing to live amongst us. So, thank you. Healthy hair when I'm the one who is Matt. The sign is on a lot of the research for it. I do want to clarify since someone brought up the eu's are typically in a hundred fifty thousand but it's not typical to the standard radio cost someone I know who built that you pretty recently. It was estimated 130000. So yes, they are expensive to the typical person who cares that price, but they're definitely less expensive than zero or below-market-rate because we care about the people that we love I was want to point out that these units help the clinic prices, which we all know is pretty present right now. India has pretty much as your water at the moment and hopefully it's so no matter what happens across the globe or what missions we spray to hear. It impacts. All of us has typically have residents travel left in their car. So that also means that we're pumping less CO2 into the air. It means that we can actually meet our goal for which we both want to point out that today you're hearing from a lot of people who are older and white at the last hearing you also heard from people who were prominently wipe that there was a little bit more diversity and there was certainly younger people there as well on the road a lot of renter's and I want to point out that this happens because it is 2 p.m. On a work day at the moment. And so that when it's working people who I want to acknowledge that and other cities to 80s typically rent anywhere from 0 to 50% of the time because they're my friends and family. This is not an anomaly. Thank you. My name is Larry Kelly. I'm a resident of a Queen Anne and this is basically to seek confirmation on the ATV ordinance ordinance applies to all neighborhoods in the city with properties that meet lot size and environmental area. And that no neighborhood is exempt from this ordinance. Is that correct? And in and out of the head for mr. O'Brien would be sufficient. That is correct. Every neighborhood no exceptions. And unless there any proposals to extend public comment again, or the speaker will be Emily Johnston. How many more are there cancel member? There are 10 12 at least 15. I'm okay. We could have went to Jimmy Johnson and then go to one minute for the remainder. I'm Emily Johnston and as I've said repeatedly hear Rihanna recent days, I'm Seattle needs more housing when we experience job growth and don't grow housing at the same rate people get pushed out and it's nearly always the most vulnerable people who get pushed out first and whether someone is a retired nurse's aide or whether there an Amazon Tech worker if they're pushed out to the suburbs, they tend to move too much larger dwelling units and they need to drive much more their quality of life goes down and their carbon pollution goes up climate breakdown is a crisis that completely dwarfs all of our other problems and if we don't respond urgently and boldly the problems that we have right now will seem like the hopelessly good old days. From a climate perspective where we live is the single most important decision we ever make it determines whether we need to drive and how much energy we use we here in Washington state were once considered climate leaders, but no more in recent years Seattle emissions have been rising and that's even without considering the rising emissions of those we pushed out of the city people have a lot of reasonable sounding fears about developers buying up all the neighborhoods, but it's important to understand that the law that just passed in Oregon that legalized fourplexes in all cities over 25000 throughout the state was opposed by the Home Builders Association because it was going to make it less necessary to expand the urban growth boundaries developers are simply not very interested in two to four units on a lot. They're much more focused on large projects and new Suburban developments. I need to make it easy and affordable for people to do the right thing and build additional housing units if people can build 280 use at the same time in or adjacent to their house construction prices and disruption are minimized if I can figure out the financing I myself would like to take down my 800 square foot single family house less than 2 miles from downtown and build a larger house with 280 use inside so that I can share my lot in my neighborhood was friends and other community members. Please make sure that people who want to do the right thing and do so with minimal fiction. Thank you. Sore neck speaker is Steve zenke or zarki? I'm sorry, I can read and after that is Alice Lockhart Sarah Weaver and showing you bold and I'm sure you all heard y'all have one minute each find Steve's mkti much are Tri pack. So this particular legislation we have concern among other issues that are reducing the number of trees require down to 1/2 in tree planting as I understand in this Falls in line with the fact that as part of the mha process and also the lady process here. You said anything dealing with the tree ordinance issues as a separate issue, so I'm here urging that we both look at keeping Seattle affordable. Plus we look at keeping it livable. That means trying to keep nature in the city and means trying to be sure that we on trees are removed at their replanted that we put in place of permit system removing trees like other cities have the urban Submitted the council member Bagshaw a draft and we urge you to try and consider getting that done this year rather than extending next year 10 years this process. I'm going on as long enough. You are in agreement with most with all the issues that we're at the tree people out there and grab it with we think it's time to move forward and solve this in other before you go to the budget process in October. Thank you. Good afternoon Council. It's really exciting to be here a moment before a vote for Mark climate friendly housing in Seattle. Without weakening amendments to that legislation. I personally am not speaking for any organization will be very grateful. If there is no owner occupancy requirement. I've testified hear about the 280 use that I would like to build and how will they they will help me to I believe preserve some big beautiful trees on my lot by building them on the existing footprint because I couldn't leave town for periods of time to support family members. I can't do that without the flexibility of being able to read out all three units. So, I just want to extend my thanks for this legislation as a whole and for preserving that flexibility. Thank you. Hi, I'm a real estate investor and developer in Seattle. And I have a lot of great tenants and they do make great neighbors. I want to say that I am against the city council approving this a proposal. I think for the Seattle Times editorial board said it best. So I just like to reiterate some of their key points. Number one. This is one of the most consequential land-use decisions and City history and it should not be made by a lame duck Council during a summer session Seattle deserves better governance and stewardship. Any decision should be made by the new accountable Council that the voters elect in November. There is little urgency number to Seattle has allowed backyard Cottages since 2009 and they are allowed on most Lots backyard Cottage development has more than doubled since 2014 when 53 rebuild a hundred and twenty or permitted annually for the last three years counting attached units of production average 252 this last year at this rate the city may see as many units built with no real chain. As it originally sought by removing neighborhood protections if the city wants to help owner homeowners add an additional unit. It should streamline the permitting process and lower utility connection chart number 3. This change isn't needed to accommodate growth in March Seattle upzone and enlarged Urban Villages where density is supposed to be clustered the city projected. This would add capacity for 69520 units is a problem requiring a multi-faceted response weakening leave it livability standards and tripling neighborhood density would only have a marginal effect on affordability the city's own analysis concluded and this is just my personal note. If you think that investors aren't going to be coming in to pick up these properties. You're sadly wrong if this proposal passes, we've already already looked up. Newbold we have Andrew Kirsch Esther Barfield Feld and Sylvia schweinberger Hello counselor. Thank you for letting us speak today, and I want to thank everyone who's worked on this legislation for so long. I am heartily support the legislation as it's currently written, and I would really encourage the council to not add any other amendments that would make it less flexible for people to add adus, especially II adus. Thank you. A good afternoon among the reasons. I have OCD 11191 195448 would probably reduce the tree canopy in single-family zones, which currently hold most of sales tree canopy between courage tree preservation but on the lot size so 1% one could for example cut down 323 inch diameter or just one 5in diameter and replace requirement to be the same on a 3000 square foot lot of single tree with a trunk diameter only three in the replacement for planting trees elsewhere in the heart includes a requirement on paper for the homeowner. Take care of the replacement tree for five years. This is probably unenforceable in quite evidently not interested. Sdci, which is ignored me or Burgess is executive order regarding The bill would also remove the owner occupancy requirement. If you don't care about the tree canopy with the urban heat island effect, why should Blackstone a real estate investment trust placed tree preservation over profit, please please wrap up in reality. There is no peace tree tree is the tree canopy for more airbnb's. Please keep Seattle Green and homeownership local voting. No. Thank you. Good afternoon. My name is Esther bartfeld and I'm urging you to vote. No on this legislation. This is not about whether to allow adus or dad as we already allowed at as you know, it is fundamentally changing the game and it's also not about a fordable housing. It's about Investment Housing and that will increase the social stratification in Seattle. I lived in an Adu when we first moved to Seattle and it was great, but the owner lived upstairs and I fully support Adu making the process easier with an owner occupancy requirement. Otherwise, we will have the more modest neighborhoods bought out by investors and we will be pricing out families and in eliminating inventory for families and all but the wealthiest neighborhoods of Seattle and every homeowner will pay more for their property taxes because the land valuation portion of your property appraisals will increase because it will be considered as Triplex pretend with potential. Most of us don't own the land next door to our property like councilmember O'Brien does so we can't control what's done to it. This legislation is offers less privacy and light and are protections and single-family zones that back up to Neighborhood commercial zones. You can build a two-story structure 5 feet from the property line in this legislation. We can and should study incentives to make adus and dad is easier to build. We only need one on a property and owner occupancy requirements, and I hope the council will start in a new direction. Thank you. Sylvia after Sylvia will be Johanna, Marissa Vega and Elliot brenowitz. Hi, I'm Sylvia schweinberger neighborhood resident and I also owned rentals and aimed at people or anything like that, but I'm still not in favor of this legislation. I'm a longtime, Seattle. Thanks at bringing in date while removing. The owner occupancy requirement will bring in developers developers are writing to me everyday now just having investors tearing down houses to build triplexus make money and leave They Don't Care About Seattle. They don't care about what these people are talking about the tree canopy. They don't care about our neighborhoods and how they're organized and I don't think it makes for a very good Seattle. We've already just up Zone 27 neighborhoods there of the building permits. Haven't even been issued for all those yet. Let's wait there's no rush. Let's let that build itself out. Meanwhile figure out how we can make it easier for owners who want to do this get the building department. Thank you. That made Johannes Earl. I'm not prepared wasn't prepared to speak. I would like to say to the woman who's on a homeowner in Seattle. I've been here for 42 years. It breaks my heart that people are being priced out of this neighborhood out of the city who have built this city. I don't see anything in the legislation that is going to keep developers from doing what they have in Ballard tearing down houses putting two and three and I don't see any incentive for them to make this affordable housing wasn't this what this legislation wasn't this what this started about. I've been following it for several years to make housing more affordable. It does depend on the Goodwill of people and if the woman hear another people who have spoken want to do something to rent out their back and build something and rented out cheaply to their children. That's great. I have no confidence that a developer has any incentive to do that. I would not recommend passing this. I think it's a disaster. I don't think it will. Ford improve affordability for people at all, unless somebody really cares in their heart to do that, and I'm not confident that developers to do that. Thank you. Does Marissa Vega Elliot benefits and Dawn cave? Say Hi Marissa. I am here on behalf of unified Seattle. I've lived in the city for four years and the short time. I've watched many of neighborhoods Trinity Health and environmental hazards and the trees handmade unsafe for Citizens and I'm here to talk about concern for South Lake Union enclosure Village and see a solution of building lobe area enclosures with Shacks like Lakes Union Village. Let's elect officials claim. They are compassionate but does nothing to dress a problem putting addicts and mentally ill human needles is not caring. There's no drug rehabilitation. There's no job training. There's no mental health counseling and there's no alternative housing for them our city officials who advertises temporary housing communities are putting vulnerable people in need of treatment inside is the Lake Union Village and disguising it assayed. This is why groups like unified Seattle are challenging this broken system and calling attention. To what lobe are your check and comments are unacceptable justification for responsibility and revision unified Seattle calls for real change that will help those suffering from the closing sick people in Mo Better Burger Shack and can't miss with only allow the problem to fester and grow with a roof over his head. Thank you. Good afternoon. My name is Elliot Bruno. It's on the professor of biology at u-dub. I'm only speaking for myself today and I wanted to talk about environmental impacts which has gotten short shrift. I think especially the certainty that allowing increase lock coverage under this proposal will lead to increased stormwater pollution at Zion stand it most of these proposals will fall under the threshold for drainage review, but they can increase lot coverage up to 65% This is going to lead to increased water running in to the drains with all the chemicals to pick up in the roadways. My colleagues the national marine fisheries have already showed that coho salmon have 100% mortality. When exposed to this Wastewater last year. We got all upset about that. Orca pushing is dead baby around but really being green doesn't mean anything if we only do it when it's economically convenient. Thank you. dubbed on Cave Matt Hutchins, Michelle Linden was going to say something really bitter, but I've I decided to not bother. Thank you. Hi, I'm at Hutchins. I'm speaking on behalf of AIA Seattle on the co-chair of the housing task force or we sent you guys a letter in expressing our support and I'm just going to summarize representing 2400 licensed Architects supports this legislation, especially removing the parking and owner occupancy requirements. We also strongly support the FFA are limitations on home size. You think that in general this is an important point of change in our city with respect to deciding who gets to live here and how about our neighborhoods look like and then that we've done the study and time to act we encourage you now to prove this legislation is key components. Thank you for all your work. Hi, my name is Michelle Lyndon, and I'm also a licensed architect. I do it a lot of what he just said except for as it comes to that. They are limits. I'm really confused as to why the f a r limit has been added to this legislation limiting someone's ability to build what they want isn't going to incentivize them to build additional units frankly. I would suggest that it's extremely classist and a lead us to Ted to tell Seattle lights that the only ones worthy of a larger home or the ones that can afford a large lot as we know. There are fewer and fewer families that can afford a large lot in Seattle. The SAR limit is penalizing families. That's my Target demographic without benefiting residence and potential backyard Cottages. I feel it backyard Cottage. Let us legislation while imperfect should be supported and it should be accepted. But you said Nick's the SAR regulations permit. Thank you. The last three speakers are Glen Penninger. I'm sorry if I'm saying it wrong, Julie Campbell and Angela Compton. Good afternoon, Council and Glenn pittenger Emma a third-generation Seattle resident and lived here since 1967. I've owned my single-family home for 26 years and I urge you to vote Yes today and passes legislation. It's time to stop stalling the ability to add more options to our our house our neighborhoods, and it's time to end the classism that is dominated zoning in Seattle for the last hundred years. Thank you. Hello, my name is Julie Campbell. I'm an architecture in Seattle. And with all due respect them at Hutchins of the AI. I represent a smaller group of AI members single-family architects who have some issues with the proposal that they stand right now. I want I'm going to go off script because I I want to make my point brief. We all of us every one of us believe in accessory dwelling units. I want to build one in my property. But what we all fear is that this is going to be a big giveaway to developers that is really going to change the fabric of our city beyond what any of us can imagine and I think that fear is Pez been represented in this room today because many people are talking about how special this woman as a real estate agent developers will come in like swoop in like Hawks. That was a comment that came up in the area for him last month with guest speakers for Minneapolis one of those City play. Said that while they're in the midst of this of passing the new bills, they're getting their phones are getting blown up by developers looking for opportunities with this. So I urge you to consider one of two points today. When you cast your vote either remove the third unit or remove the home owner occupancy just as a way to slow this train down, you know, we could add that in two years when we see how this is going to be strapped up. That's what I want to say. Thank you. Holiday combo thank you so much for being here today. My name is Angela Compton and I am also third-generation Seattle Light who has never lived in a home owned by me or my family and we've been renters my entire life and I've lived in a variety of homes from duplexes backyard Cottages to living with family members and single family houses and all of it. I would really like to say that I support this legislation without any additional amendments in my adult life. I have never owned a car and I live in Seattle. I actually walk most places, occasionally I take transit, but for the most part of my feet are my way of transportation and is not true, but another thing is I would like to tell a story about my grandma. I'm so my grandma owned a very large single family house with 4 bedrooms in it and after my aunts and uncles were all old and moved out and my grandfather died. Really large home for my grandma my grandma then actually shoot on the 4-Plex. She moved into one of the units in her fourplex and rent it out that single family house when my uncle got out of the Marines him and his family didn't have anywhere to go and my grandma actually build a basement unit in that single-family home, but she was renting out and my uncle and his family moved into that home and are still living there. So that is like one of the ways that we can create Solutions in our community. There are currently about 30,000 single family homes that are used as rentals in Seattle, and if we add an owner occupancy requirements, and if we add parking requirements, we are going to hinder those homes from allowing more families to live in Seattle. Thank you. justified in public Common Pleas play Disturbia now on payment of bills. Please read the title. Cancel bell when 19559 app reminds Pacer Exam Center in payment 3rd Ave Council, but one 19559. Thank you. It's been moved and seconded the bill pass. Are there any comments? Please call the role of the passage of the bill for both parents want a term favor and opposed the bill passes and the chair will sign it up. Please read the report of the city council to be part of the city council agenda item one comfortable when 19558 really into the city streets changing the name of the designated Festival Street portion of East Denny Way between Broadway East and 10th Avenue East to East Barbara Bailey way as he was eating the revelant portions of ordinance for 044096889 10 Ordnance 102981 and other ordinances to the extent inconsistent. Thank you. I'm cancel becomes president. I don't have much to add to the great public comment. We heard a testimony from family members friends co-workers co-owners and even charity cases like former council member Clark and icon in the city and Capitol Hill and her loss was not just a lost to the family members and friends but the whole city and I'm proud to have been the sponsor of this legislation, but the credit really goes to Mayor durkan and her team for doing the work to get this before us and I'm grateful to Premier Durkins leadership on this and colleagues. I think it'll be exciting when the at sign goes out when we get to see that scratched off East Barbara Bailey weigh Taylor Commons Please call the roll on the passage of the bill and Solace herbal O'Brien. I ate in favour Nana post. The bill passes and the chair will sign it. please read the report of the city council Agenda 21 9553 Blaine to City employment authorized an execution of a collective bargaining agreement between the city Seattle and the International Brotherhood of Electrical Workers Local Union number 77 power markers unit to be effective January 1st, 2017 to December 31st, 2020 and ratifying confirming searching for Iraq's Thank you very much for this. This legislation was referred directly to the full Council. It's being proposed by our Seattle Department of Human Resources. And normally that particular Department would legislation from there would be referred to my committee, but it's coming directly here today the legislation authorizes the execution of a collective bargaining agreement between the city of Seattle and the International Brotherhood of Electrical Workers. That's Local Union number 77 call the power marketers unit that has 15 1 5 regular employees and his contract will be effective January 1st through December 31st, 2020. And since it's already two and a half years behind it will be effective retroactive. So the extended process of deliberation proposed the result of a three-year process that began in 2016 and it reflects the extended negotiation as I mentioned, so it will update wages from 20. 14 and it has no impact on the current budget since it was included in our 2019 budget and funding in 2020 will be addressed by the executive first in the annual budgeting process. We recommend to pass. the commons I will call myself before calling on the passage of the Bell visited item approves the Union contract as counter bactrim side negotiate in the city and the government and IBEW 77 who represent many Seattle City Light workers who maintain the power lines of stations in power plants to keep the lights on in Seattle on rainy windy winter nights. When a tree falls on the power lines in your power goes out. It is IBEW 77 members who go out in the storm and fix the problem without their work. We were to have no street lights Amazon would have no power to run their data centers and Newkirk would not melt the steel guitar really the Ultimate Green jobs for writing carbon-free power to Seattle and Beyond under a good Union contract many more of these positions as part of a green New Deal to add wind generation to Seattle's Hydro power to export electricity outside the city replacing the colon natural gas power used in the region. Please call the role of the passage of the bill. extra Gonzalez herbal Ora's I'm sorry. I was calling roll on the passage of the bill. Mascara O'Brien, please read the report of the sustainability and transportation committee on Transportation committee Chen time three kinds of 01195434392 land-use and Zoning many sections 23.40 4.0 11.0 14.0 17.0 25041. 23.45 Point 54523. 8.84 800 2.0 32.0 38 + 23.86 + 007 code to remove barriers to the creation of attached and detached accessory dwelling units in to add a floor area ratio requirement in certain single-family zones. The thank you and I know that their Amendment on this item, so if you want to make an electric comment, and then to give minutes, I'll make a few comments about this. And then we can walk to maybe the amendments in order to just give some highlights of what this legislation does. Do the intent here is to make it easier for folks to build accessory dwelling units whether those are attached or detached the legislation is based on well over four years of work now and receiving Community feedback on what people are communities would like to see and what kind of flexibility they would like to have or what kind of barriers they see today. The main changes are going to happen one is that currently the restrictions are there you can only build an 800 square-foot backyard Cottage. This would allow them to be a thousand square feet. Will you allow them to be 1 to 2 ft taller? Cuz we heard from a lot of folks at that second floor Living Spaces very difficult to make it habitable space but one to text a few to height would make a big difference. When you eliminate the parking requirement. We hear that the expense and the necessity of building off street parking spot for these units is Terrier and it's goes against some of our climate values also currently there's a limit you can either build a backyard Cottage or an accessory in an in-law unit. This legislation would allow you to build both and finally the current requirement that there's an owner occupancy requirements meeting. The owner has to live on-site what we heard from community members was often that they plan to live on site but making the investment necessary to add an accessory unit. And then the fear that did something that happened in their life where they get transferred for a job or have to move out of town to take care of a family member. They be required either leave their main house vacant or kick their tenant out and lose that rent that uncertainty like made it really challenging for them to make the type of investment through a hoping to make it was the main changes is obviously some other ones are in addition. We heard and comment that it would place a f a r limit of floor area ratio limit of a point. 5 square feet per square foot of a lot with an absolute minimum minimum 2500 whichever is greater between that a lot size couple things that doesn't do. I just want to clarify because we heard in public comment currency law in the single-family Zone. You're only allowed to cover 35% of the lot the other 65% of the lot needs to be open. This does not change that at all. So if someone commented that we can cover 65% of all it's not accurate 65% of what has to be open. There's no change to what's currently allowed in the single-family Zone. Similarly. This doesn't loosen tree regulations as a modest regulation about adding an additional Tree in certain cases, but a largely leaves the existing tree regulations in place recognizing at least for me that I think we need to do some work to have a better tree code but did not address its specifics lucidly in this backyard Cottage legislation to rather address that comprehensively and as we heard and public comment Requesting an energy to hopefully get something done this year, which I would fully support with that colleagues. I'll save other comments and questions and and walk through the Amendments if it's okay with your council president starting with the proposed amendment ever won on the agenda. I'll go ahead and move amendment number one, which is a technical Amendment and just a substitute for the legislation to clean up a lot of the language but doesn't stain Geneva policy issues. You know, I'm virgin d645 that which is amendment number one. Go to Second already any comments on the amendment. Those in favor of amendment number one. Please. Go die and raise your hands. Was supposed to know the motion carries and the amendment is adopted. Second second amendment be proposed by counsel him to take us alive defer to him to speak to this in the commotion or single-family neighborhoods. We should also be expanding opportunities for folks to get around by bike or other future Mobility options in those areas of this amendment would incentivize building bike parking in dadu's by giving up to 35 square feet a bike parking area for the maximum size of a d a d you it would also request a test. Look into opportunities for expanding bike public bike parking it in single-family zones, which I believe should be a priority as we have more density and his bike and scooter programs and expand our city. I hope I can count on your support. we need a second for the it's been moved and seconded and introduced by concert Pacheco. Any other comments has happened and your commitment to not penalizing folks would have created an extra space for alternative transportation notes. Thank you for leadership come out. Amendment number to please go die and raise your hands with no. the motion carries in the Amendments adopted Number 3 con Sombrero Bryan, I believe you're moving this. I am moving this. We got a lot of discussion throughout this process including the committee about the impact that short-term rentals may have on on the use of accessory dwelling units in back their Cottages. We did a pretty extensive body of work around short-term rentals about a year-and-a-half ago when we put those regulations in place. I'm should be clear with those regulations allow is that individuals in the city of Seattle may use their primary residence as a short-term rental. So if that's a single-family home, they could either rent out a a guest room in that single family home or they could rent out the entire home while they're away on vacation or traveling or whatever that might be and they could have a second unit to use accessory as a story as a short-term rental on so that would allow someone in addition to their primary home to own a second unit could be a single family home. Could be a townhouse that could be a condo. It could be an accessory unit that they can just have their primary plus one other unit is what the limits are. I think that there is a possibility as we look forward in if we think short-term rentals is more broadly is a challenge to our our housing needs. I would certainly be open to considering changing that but the moment I don't think it's fair to limit what people can do an accessory unit Beyond what's already Define versus what people could do by owning single family homes Townhomes real houses the like I'm but I do think it's important to watch what happens and we have language in the bill already that the director of The Office of Financial administrative Services Which authorized short term rental used to monitor the license and we also request sale department of construction inspections to work with that fast identify other recommendations is appropriate to ratify the legislation what this With this amendment would do with add the language. That's basically to say it's the council's intent on it says if this report would reveal that a significant number of accessory dwelling units are being used solely as short-term rentals a city council intends to impose additional restrictions for probation on short term rental using accessory dwelling units. So I would go ahead and move amendment number three. Buy guns Amber O'Brien any other comments on this amendment? What do boobs get up at the moment. I think that's a mini of us share the desire that you've just articulated and one that we've heard from Council council chambers before which is to make sure that we are meeting our goals of creating greater long term rental housing options in Seattle and it is clear from the data is that speculation has not materialized. In fact, we've seen and other similar cities like Portland that the units that are being created as backyard Cottages that a detached dwelling units accessory dwelling units are predominantly being used for long term housing rentals and not short-term housing rentals for vacation rental. So the first line from the Seattle Times editorial board said data and research ought to guide the city council as they consider policies that would when address of Housing and We are exactly doing that were using data to drive the policy Solutions the data shows from the report that was presented in your Committee just a few weeks ago. She was that overwhelmingly two-thirds of those who currently have a backyard Cottage in Portland for example have lived in their homes in the primary residence or own their home as a primary residence for longer than 5 years. And if you count those who own or are live in the primary residence for greater than one actually have that owner-occupancy on self-imposed because they've owned it for a longer than one year. And then when you ask a question, how are these rental units being used is occupying them 74% So 3/4 of the individuals that are renting these units that have been created because of the allowance of backyard Cottages are long-term rentals and also to friends and family the vast majority are being used for long-term rentals and from friends and family. This is exactly what we want to do. Data-driven solutions to get to our our desire to create greater stability for rental units and for greater affordability. So I think that it's rooted and what we've heard from community over the last few years frankly about how we can create access and fewer restrictions to these rental units and Community Partners believe that the language that you already work on. I'm from my conversations with the folks time is going to help us get there looking forward to look at the data that comes in from around city, but I think it's important that we underscore we are absolutely using data driven Solutions here and the data has shown that the speculation has not occurred. Thank you for putting for this amendment. Those in favor of amendment number three, please go die and raise your hands. They're Noah post. So the motion carries and the amendment is adopted. Are there any other amendments of my hard-boiled? Thank you. So I move to amend Council Bill 1195 44 by amending section v as shown in Amendment 4 and I will pass this out. This was distributed via email, but it does not attach to folks agendas. It was distributed this morning before noon for our Council rules. 11:15. I think that might be right. This is the same as I meant that was discussed in in the park committee. I think I'll wait for hopefully I might get a second. I do not support them, but I'll give you a courtesy second education committee and it we had a vote on it. It was voted on 222 not passing am I to amendments in that particular meeting the fur? Amendment was to focus on my desire for us to really make sure that this strategy of accessory dwelling units is really being focused on rental housing. And so it was the intention of the amendment was to as as we voted on it was to really drastically limit the conversion of these units to short-term rentals. The I'm not bringing that met Amendment forward again because I'm taking a look at what the numbers are as relates to the residential housing market and the Puget Sound Sage 2016 report indicated that at that time in the city of Seattle there about 2800 short term rental whole units of about 357000 residential housing. It's in the city. So that works out to be less than 1% is 7/10 of a percent. So if you take a look at what's anticipated under the E is for Adu development of the next 10 years. The the estimate is about 4,400 units per year. I mean, sorry over 10 years are 440 units per year on that works out to be about 35 of the units becoming short-term rentals. So I've been I've been reassured that my concerns about that. It's I think it's good to put them on hold until we have more information. So I appreciate the council member O'Brien's amendment to study this issue. I am still concerned about the Specter of Market shifting to take advantage of these new regulations until the second amendment is one that is focused on trying to address. AAA specular Market that will flip these units and in such a way that will have a displacement impact on on renters. So I'm just for clarification sake this amendment would require one-year ownership before permitting II Adu. It is not a owner owner occupancy requirement. It's not about whether or not renters make good good Neighbours at all and it is not an additional year. So folks who who own a house and have done so for your more the vast majority of homeowners in the city could build 280 use immediately. But what this does is the study area showed that 80% of the study area for the EU legislation was currently owner-occupied and 20% of that. Study area was renter-occupied. So it also fine found that he is found that there is a chance of of Basically, the properties being flipped and and it. Also aligned with the 20% number So 20% of the adus being built being built under these again speculative market conditions and it's true that we don't know for sure about what's going to happen in this market, but we do know what's been happening in other cities and there's no reason to believe that this isn't already happening here. We just haven't done in an analysis of how it happened here. So Fortune Magazine says single-family home rentals have long been dominated by local entrepreneurs mom and pop investors and historically when bigger fish such as head futhead funds and Real Estate Investment Trust invested real estate historically, they focus on apartment buildings, but the historic housing crash of the 2000 change the math and over the past seven years those investors have a mass of Cancel portfolio some 300,000 houses and all these players include invitation home or read that is a product of a merger of rental divisions of several investment firms, including Blackstone Starwood capital and Colony Capital American homes for rent in Amherst. All of these landlords use automated house-hunting to fuel their growth The Wall Street Journal says big private Equity firms real estate speculators and others that buy properties comprise more than 11% of all home purchases in 2018 as investor purchases are the highest on record in nearly twice the levels before the 2008 housing crash. The New York Times writes Trends are being spurred by a fast-growing industry that promotes an investment in single-family homes lenders who provide the capital brokers who handle transactions wholesalers who buy homes by the dozens and sell them before they even take possession. Finally the guardian rights that the un's housing advisor has accused private Equity firms. And one of the world's largest corporate residential landlords, Blackstone Group of exploiting tenants wrecking havoc and communities and helping to fuel a new Global housing crisis blackstone's business practices include massively inflating rents and imposing a ray of heavy fees and charges for ordinary repairs. So when you take this this 20% number 20% of the the the units that are currently renter-occupied and and you look at the Eis that says that those are properties that that could be flipped and the renter has displaced I ask myself how many families does that represent in a year? And again using the numbers in the Eis of 440 new adus a year that could displace 88 Family Theater in our city. And so this amendment again, we don't know what's necessarily going to happen in this housing market and we can't prohibit specular development but the amendment would create a speed bump as a disincentive perspective of development created a more cautious approach in case you know the assumptions that we have about development or wrong and this would provide a small incentive Bank of America open tomorrow for Brian appreciate the concern and the intent of this although my concern in the reason I suppose this is what I see that is actually happening with backyard cottages and accessory units is it it is typically a lot of the folks we heard from today or our neighbors who want to build these and if someone is to buy a you know a new house if they went by the house in the neighborhood and they're moving in and they're doing a remodel that point before they move in and they want to add two units that point because that would be the logical time of the under-construction to do it. I think that is a good thing and I want to be clear that I'm not sheepish about folks having to accessory units on a watt the point of this legislation is I hope that we see two accessory units on a lot of single-family lost because I think that's going to be good for our neighborhoods, but Aladdin new opportunities for People who can't afford to live in some of these neighborhoods to live in those neighborhoods and it might help the homeowner too. And I think the logic of doing that all at once as opposed to saying I'm going to come in and remodel the house or whatever and that accessory you and then have to pause for a year until I can have the second one will see the ad cost and disruption and I think that that is a reason not to do this to allowed to before Is not the that is a scenario for somebody newly by buying a property correct? Not for people who currently own their homes and want to Cuz remember any other council members. a topo Chico so I voted against the cement many committee and will be Merino again. Today. We are going on this legislation because we need more 80 using Seattle to provide more people with housing options and I'm concerned that this amendment would make it more difficult and costly to build a second ATU. I do share councilmember Horrible's have a concern about speculation but between the Eis and trans another cities, I'm not found compelling evidence that ATU reform will cause speculation without data supporting a concern. I don't think Now's the Time to restrict ATU development that said this legislation does include regular reports of the Council on 82 development Trends. So I'm voting no today if a future Council wishes to address any potential challenges are they can do so at that time. I want to add a couple, just before handing it to cancel my horrible to close it out because it's her amendment. I really appreciate councilmember Horrible's efforts on making sure that we really speak up against speculation against corporate developers. I'm really strongly supportive of all of those points. But I also would Echo the point at me bro Brian made and in addition to that I will be voting know as well on this addition to that also say that absolutely we have to be pushing back against the for-profit market again, as other council members of said the data is not not showing it speculation is much more is better than in the building of the hours of luxury units Andrew houses. I'm not seeing any speculative Adu bubble anywhere. And so I think that what we should be doing in What is 1000 disability through and then also fighting for rent control in a massive expansion of social housing which is high-quality publicly owned housing. Yeah, the only closing remarks I have is again the Eis showed that at most with an amendment like this perhaps 80 units a year not to get built. We also know that 20% of the study area represents renter households 8 minutes approximately it. So again, this is about preserving the housing for 88 families a year who rely on that rental housing and trying to make sure that those properties aren't flipped over to a speculative Market. And you guys were herbold. Those in favor of amendment number for police, Rhode Island, raise your hands. Those opposed please vote no and raise your hands. No. The motion fails and the amendment is not adopted. Are there any other time so I think they're done with the amendment as far as I understand. Do you want to just close it out? And should I invite you to say a few words and let my colleagues make some comments and then if I can wrap up if that's okay. I want to take my colleagues. I want to thank folks here today. I know that we heard mixed comments today as we have throughout the three to four your process. We've been working on this and I know some people will feel like this is a win some will feel like as a lost some feel like it's next. But I think it's even ask I often get asked why did it take so many years to pass a piece of legislation. They were talking about 4,400 units 2400 units additional units being built in the next 10 years. And I think it's a fair question because it's a lot of work that people have done for a relatively modest shift and what we predict will happen. Neighborhoods, but I also think the reason folks it engages such a deep level is because there's a fundamental question about what are we going to do in our single-family zones? And what's appropriate and I do think that that's why this is taking so long. That's why so many folks have been engaged and I think it's been a really robust conversation and import conversation. It's an important conversation for Seattle to have and frankly. It's a conversation that's happening in high-cost communities around the country right now and I believe that in a city where are single-family zoning represents about three-quarters of the residential zoning in the city of Seattle and in a city that's been growing as fast as Seattle has we seen the population in our single-family zones decline over years because there's really not capacity to add additional housing in the single-family zones and because of household sizes are continuing to shrink in our country and in our city as a result in this big chunk of land that set aside for single-family zoning is housing fewer and fewer people and I think this is an opportunity to To stem that Trend to allow additional units to allow smaller units that will be more affordable as we seen your evidence of other cities and my colleagues Mosquito .22 eloquently. These are often rented out of below-market-rate often to friends families and neighbors and well it is relatively modest modest both in terms that I don't think this is going to sell this all over housing crisis nor do I think it's going to radically transform our neighborhoods. I do think it ask a big question of what are we going to do with our single-family zones going forward and who gets access to those and who is locked out because the pricing there's a lot of comments we made you don't know exactly how it's going to play out. We have a lot of evidence from what's happened in similar cities. And so I believe that that's probably what will happen here, but we will clearly be watching this closely as it moves forward and I believe this is going to be an opportunity to invite so many more people into some of our most exclusive neighborhoods in a way that will really strengthen those neighborhood. So make them more diverse from an economic. Diverse racially. I'm more richer also not rich new terms of financial wealth Ritz, but in a rich of like richness of humanity, and those additional people will be supporting the businesses and make those businesses stronger is it means Transit ridership will have better by transit and I think it would make her school's more Mexico parks that are used and I think it's overall. It's a really beneficial thing for a community. I know that some folks. So disappointed. Some folks are thrilled by what I think it will happen in a few minutes, but I really appreciate everyone's engagement on this and look forward for the conversation about a single-family Zone's continued. I'd like to reserve II just a minute at the end that I will stop back when I call you sometime. Think you can swim by Brian. Thank you so much for your words and your leadership on this and I want to acknowledge the division that this particular legislation has had the whole adu.edu complication and discussions. We have had over the last decade has been amazing to me whether it's the owner occupancy rule or parking whether or not we should deal with size of lot and even among some of my favorite Architects and designers. I have heard and received dozens of emails even this weekend in as early as 6:30 this morning. I'm still having debates with people about whether or not the legislation goes too far or doesn't go far enough. So I do recognize that there is a division and there is a concern about this but frankly, I am a big fan of these dadu's and AD used in residential zones. I lived in a single-family home for 20 years in Lake Forest Park my husband and I knew now live in a condo downtown. But one of the things that was terrific about our place downtown is that we were able to move my father into unit. That was right next door to us now. Have we had the single-family home? We had looked at having a detached dwelling unit for him in Lake Forest Park. I think one of the most important things about expanding this legislation is that we can focus on the all ages and abilities part and that's something I've been advocating for 4 years making sure that seniors if they chose could stay in their house have a place they could run out or the reverse which is something that we're hearing particularly and some of the larger homes are seniors would like to stay in their neighborhood. They have their Community they want to stay there but it's easier for them to have a nice detach Exhilarate accessory dwelling unit or even one that is attached where their family can move into the home. We've seen that happen and some of the other cities such as Portland. Los Angeles Austin that are dad friendly we're going to be taking another step forward and once again people will be looking at how is it impacting us? How does it impact our neighborhoods? And I really respect the third amendment councilmember O'Brien for we're going to be looking at what actually happens allowing space and some Grace that if we need to change this again next year that we can I'm also believe a real believer that allowing for flexibility and what these designs look like so that somebody who has a disability can build something that is going to accommodate him or herself. And I believe this is going to be a real opportunity for us and with regard to the no on-site parking requirements. I'll tell you that's one that I scratched my head over and struggled with talk to a lot of people about ultimate believed believed that not everybody in the city does have a car wants to drive a car and wear these neighborhoods are going to accommodate it. There is Tran. 2/3 lift there's other opportunities for people to get around as one young woman said earlier that she uses her feet to get around. That's a good thing for all of us. So I concluded that I can live with this no parking requirement for now again, I'd like to see what kind of impact that has in the neighborhoods. And if it has a negative impact, I'd like to look at rpz opportunities once again and see what we we can do or should be doing with those. So just in short, I'm an advocate for the cottages for the in-law suites. I want to acknowledge what Rex Holbein has done with the block project. Someone brought this up earlier. I want to say thank you to the AIA those of you that have contacted me over the years and it hasn't just been for the last year. We all went to Portland in 2011. It was the first time I'd seen what could be accomplished for a relatively I think financially Frugal amount of money in people's backyards. I also wanted Knowledge the fact that what we're trying to do here is not discriminate against renters everybody who spoke today acknowledged that as well, but the next step I think is financial Innovation. What we can do what options are available to encourage emergency by merging loan projects or more available financing options around capital for construction and we will just see what we can do. I think in the city, I'd love to see if we couldn't be a leader in that front. So I'm just in some I believe that this is a change that is important as councilman from Escape the said thank you. It is data-driven. I was quite surprised when I read the editorial from the Seattle Times suggesting that we weren't thinking about that, but I'm really glad that we are embracing and welcoming people who want to live in our beautiful neighborhoods, and I'm glad that we can help move this forward. So I'll be voting. Yes. Any other continents? If I'm okay, thank you. So this legislation obviously, it has been a long time in the making I want to give a special thanks to a council member Mike O'Brien for all of the years of work that you have been doing on this particular piece of legislation. Thank you so much for your steadfast commitment and dedication to making sure that we have a path forward for additional housing choice and I just want to acknowledge and recognize all of the countless number of hours and days and weeks you have spent on really championing this so thank you so much for all of that. So I really you know, I think it's important for us to acknowledge that what we're doing here. Today is is really a task or a modest change to existing law. And the code is it exists. It is not a massive zoning change despite what you may be reading and some of the print media and frankly. I think that that recycled in Use rhetoric rhetoric does not make it true. Just because you keep saying it so currently we already allows single family homes 3 units on each lap this legislation will address barriers to construction for many homeowners who want to see natural density in their neighborhood and welcome more Neighbors in the course of doing so some of the same rhetoric out there that have led me to believe the ATU and dadu's and triplexes are the same thing as o a t u n d a d u construction will lead to a three-story structure next door to a single family home is simply just not true nor is it the reality while they can have the same number of units a to use in in Daddy's by definition are axillary to the single-family home already on the lot as basement apartments or backyard cottages and I don't believe there is such a thing as too much housing in a city that is growing as quickly as the city of Seattle and this bill will help to bring more house. Same to every single neighborhood my support for this legislation is about creating more housing choice for everyone. We have a lot of work to do to bill the amount of housing Seattle and this region needs now and in the future, we need more permanent Supportive Housing when you more deeply affordable housing and we also need this kind of housing ATU and dadu's are housing options that can be affordable as well as full as fill some of that need for the missile missing middle housing more than any of these options what I've heard from more than any of these options what I've heard from constituents to use as it is that this will be their plan to be able to age in place and still stay in the city or how their kids now or soon to be an adult can find an affordable place to stay in an increasingly expensive competitive housing market ATU and dadu's it can mean multi-generational Housing for families to stay close but still have space in Independence and I had an opportunity to attend some of the sure rats in community that were led by the department of neighborhoods and heard this same over and over again from people who were interested not speculators not developers ordinary single-family home owners who are looking for that tool way to continue to be able to stay in their house while also welcomed me more people is in the neighborhood and I think that that is the intent that is driving my vote in favor of this legislation. We have a housing shortage. This is felt by many residents of Seattle particularly for renters and for households who have zero or limited options when it comes to housing just last week Harvard's Joint Center for housing studies join the chorus of research and data. I said research and data. With their 2019 national state of housing report adding to what we know about the state of housing in the Seattle area, 1 start statistics show that the cost of land in King County has changed 86.4% and housing construction overall has not kept pace with household growth in the last eight years with expensive land cost adding more 80s and dadu's is one strategy to minimize land cost while building more housing on the footprint that currently exists reports show that since 2011 there has been a 54% decline and housing unit that are considered affordable units in this region more and more households are becoming increasingly increasingly cost burden pay more of their income towards rent. We need more housing and we need more housing choice for me as a policy-maker. I will not leave any policy tool off the table that will help bring more housing. To our growing city. This also means I will work with my current and future call East identify ways to make this tool a reality and accessible for every homeowner and neighborhood in Seattle. For example as councilman Bradshaw already reference. There's exciting work being done in place in other places to help us in the space in Portland, Oregon. For example, there are non bank community lenders like craft 3 that help homeowners Finance Adu construction or office of housing has an a t u d a d u financing pilot for low-income homeowners as well. So I wouldn't like to continue to develop those does creative financing options and also work with our state legislators along with my colleagues on Council to have more of these tools available for Seattle homeowners to be able to access a financing to be able to bring their Adu Andy Adu plans for reality. I also wanted to take an opportunity to to share a constituent perspective that I received over the the many several last week's that we've all been getting inundated with emails. And and I think this is important because there have been some comments during public testimony that somehow as a nine elected officials up on this diet to represent the city that we have our heads stuck in the sand or that we don't get what's happening in the city with my neighbors and moving about the city like an ordinary person would do and engaging with folks about about their stories and there's one constituent who shared a personal story with me in response to a newsletter that I recently sent out on this particular issue and she shared with me that she'd been a resident since 1959 and she has also seen how Seattle has changed over the decades to become an increasingly complex Urban environment. She also is the owner of the mother-in-law apartment in her home as well as the owner of a short-term rental. She tells it told me that without the income from these two units that she rents below-market-rate that she's chosen to rent below-market-rate. She wouldn't be able to keep her home and she would no longer live in the city of Seattle. She shared with me that she feels a sense of security from having people come and go living their lives and looking out for each other along the way having an Adu in short term rental to her humanizes the city the diversity. This is brought into our neighborhood and life is good for anyone that is her belief, and she encouraged me today to take a bold step and vote in favor of this legislation, and I couldn't agree more with her sentiment. So today I will be voting station and Bryan and seeing this code change through your leadership on this issue will help to eliminate some of these barriers to bring more adus and dadu's to every Seattle neighborhood. Thank you. Thank you very much presidents and I am really excited about today. I'm really excited to apply the Council on this for a number of years has helped us against over the final finish line with your office. And I just can't thank you enough for your leadership on this effort. So thank you for shepherding this forward over the last 4 years. This is a really exciting a day for us to legislation and I can vote on it that includes the right balance to make sure that there is access to more housing options around the city and to make sure that were mitigating against the speculation in the market that we've heard so much about and that we were concerned about but doesn't seem to be playing out in other cities were also figuring out how to set the foundation for future rezoning to correct past historic wrongs. And this is one important key piece of the puzzle as we try to address the housing crisis across the city and there's a few issues that have come up and I want to thank the folks from the AI. Who work here are the architects who have also raised some of the issues that we've heard from some of the people who are concerned about this legislation and I'm going to address that I think that we do have a lot to do to help improve permitting that is something that we can do and also passes legislation today. We are also concerned about some of the fees that we've heard about that our friends at the King County Council are also trying to address some of those two talked about a $10,000 hook-up fee for sewer that could be too costly for many people and we're working in Partnership and I just got great news that the King County Council is taking this issue up in the third quarter of 2019 these real issues that she brought to us are things that we've heard and we can address I working together, but we have got the passes legislation today. So I'm going to come to you to continue to work on this because I'm not and I'm really excited about action and I'm really excited about the foundation. I'm going to use that pun intended. Resigning until 65 days ago. I was a renter and have been around for my entire time in Seattle. I in that time that I was a renter in for example in Queen Anne when I was at 10th and Olympic had the chance to hold the door open for my neighbor who was leaving that day to go get married. I had the chance to go visit my other neighbor who was in the hospital because he's a World War II vet and was in home care and had just had surgery. I had the chance to hear from my husband about how he literally carried home our elderly neighbor because she fell while walking her dog and carried her home to her house. We are neighbors dogs. We've been there to take care of our friends as as if they were family centers are good. And not only are they good Seattle is already a rental city is 52% of our residents who make up Seattle their residents bear renters and the absolutely need more options around the city. So I'm excited about putting forward with you or leadership the opportunity for more people to be able to afford to live. City accessing The Limited rental units that we have has continued to shrink over and over the years as we seen a 20% increase in the population size and just the last six to eight years and as the population has increased we have not been able to address the housing crisis that's in front of us mostly because of litigation and delays. And today we're responding to that that we see in our community for more affordable rental units to address an increase in population and to address the fact that we need more folks to be able to afford to live in the city and hopefully creating an accessory dwelling unit a detached dwelling unit and their backyard also stay in place and place and not be pushed out of the city. I think that this bill that you have in front of us helps to address the acute housing shortage that frankly has been exacerbated by an influx of the increase population. But the reason that it's exacerbated is we already had an insufficient housing Supply that was routed an exclusionary housing and Zoning issues that was rooted in Redlining and racist policies of the past and as we take bit by bit to address the policy changes that are needed again. We know that there's no one single policy solution, but we have got to have the political Courage the past the public policy to undo past wrongs and passed out a policy that left so many out of our city. I'm really excited. Also that this legislation helped us create the ability for us to get away from the owner occupancy requirements. I'm not also flag that one day. I think we should change the lot size requirement so that maybe more people can afford to own that parcel and we can have smaller lot requirements. So that more people could potentially have the ability for first-time home buyer options. Like I just had I want to learn the second thing that has come up. I think we're cute Italy over the last few weeks, you know many of us sat up here just last week and we all signed a commitment to address the climate crisis. I'll sign the commitment to rest the green New Deal and as we put forward our Solutions around it, we have got to recognize that the largest contributor to Greenhouse emissions and pollution is car Mission and we are now the third largest Mega commuters City in the entire country part of the reason that people are having to commute such long distances is because we haven't created that affordable housing. So this is exactly how we live our values as a green City. This is exactly what we should be doing to address the impacts of environmental encroachment by that is created by sprawl when we're not creating the ability for folks to build inner city. This is how we move forward with our commitment to impart address the green new deal. That's so needed. So I'm really excited cuz the housing that we ran out for me. Will allow people to live near their school live closer to grocery stores with closer to health centers with additional housing and Zoning changes and our commitments to bike lanes and scooters legalizing scooters and more buses and more dedicated by a dedicated bus lanes. I think helps to address the Public Health crisis that's been created by not having sufficient housing in our city. Again, this is an intersection of climate Public Health an affordability goals, and I'm really excited because we know that also when we were when we create smaller dwelling units, we can reduce our carbon footprint because they're more efficient and they can see him half as much energy as he's larger units by saying the potential of getting across the pond by Sproul like forests and parks and farms and wildlife habitat. That's the land we should be protecting not pass policies that have excluded folks from living in And I do think that we have an opportunity and combination with the language that you have helped to Champion with them and Destroy housing affordability that allowed for greener setbacks and tree protections and mha this language that we put in front of us today. Thank you for including my amendments a few weeks ago that allowed for rooftops to be created. So people can have Gardens & rooftop spaces as we think about denser living situations. I know that having access to a rooftop and allowing people to get some sunlight is really important allowing them to build our to grow in their own garden and things like that will be really beneficial add to the city and thank you for helping to address the fa are requirements needed so that more people could have rooftops. I want to thank my friend Sam who let me come over to his daddy who recently I have a two-bedroom Daddy-o and disra 5 and we have the chance to see how that the mother of the family that live. There was able to live near her kiddos care for her grand kiddos. And not have to commute 2 hours to come see them in there helping to care for the family. This is about intergenerational commitments to create additional affordable housing throughout the city. He'll be more people stay in the city and my hope is that we do more to address the the need for us to build on this that headline from sightline a few weeks ago said a duplex or Triplex and fourplex can cut a single blocks carbon emission by 20% So today is a good first start really excited to work with you on the next effort as this full Council continues to address the housing crisis throughout this year. Councilmember herbivore snakes and then comes moon for Jacob. I'm so as I mentioned before I definitely support the ability of existing owners to build two new units on their lot. But the Eis shows that it's more profitable unto this ordinance to sell once property then to build into a new owner whether or not it's an investor or resident who buys with the intention of immediately purchasing a property in immediately building to a way to use as soon as they do. So as soon as they buy the primary unit is likely to do so and displace it existing like your family. I'm not I'm a little bit at a loss why we would not discourage this from occurring. I'm all for the sake of maintaining the profit motive for a new owner to purchase property this place a rental tenant. I just think that the amendment I offered earlier is a really useful Safeguard but nevertheless I do strongly support this legislation. I just want to say a few words to the folks who Do I hear with concerns that I mean the red represent 80 years are going to destroy their neighborhoods. And you know, we've we've thrown around this 4400 over 10 years number a bit that works out to be 440 units a year over the study area, which is 35000 acres and if you convert that to that that is 180 you A year over 80 acres which works out to be about 180 you for every 30 to 50 square blocks in the city. So I just think it's really out of out of perspective to suggest that this legislation is going to destroy single-family neighborhoods. And you know, I I I support the overall goals of the legislation to increase opportunities and flexibility for both renters and existing homeowners, and I'm excited about being able to do more so that these units that are being built are actually affordable both by reducing the permitting costs the design cost the construction costs as well as for the development of the office of housing pilot program to support the development of affordable rentals, so Are those reasons I will be voting in favor of the legislation. 7th September 2014 calendar O'Brien the city council adopted a resolution 31547 that's almost 5 years ago. And as my mother would always tell me I keep trying for 5 years or anyting that she had to wait for me which was medical. So thank you for just your willingness and your your the wellness and your desire to keep going on this legislation over those five years because it where you are finally at about today. So when I first moved to Seattle to take me to go to attend grad school at u-dub first, I found my first place to call home in a backyard Cottage and Wedgewood and I literally lived in another ATU and Wallingford without these ladies use. I don't know if I would have been found an affordable place to live and if I would be calling Seattle home today, we have the opportunity to make sure that more people have the housing options that allowed me to make Seattle home at someone that was watch my own parents struggle to stay in their own. Home, I'll see this legislation as a valuable tool for homeowners who are struggling to hang on or who want the Asian place or who are watching their family and community members be pushed out of the city the Amendments that were offering committee Wallace allow us to continue to make this legislation better by having a gun permit at 18-years come into compliance with reports back to the Council on the 80 alone pot pilot and reports back on demographics and run charge for a to use lastly but this conversation surrounding density as a conversation surrounding density continues Anchorage folks not to demonize one another I've heard today in German office hours within a district that renters don't care about the neighborhoods surrender myself. I show up every day to work with a desire to make my community better. Let me be clear. We're all neighbors and it's time that we show each other the respect that we each deserve. As a city grows, we should go together and grow equitably this legislation helped us just helped us to do just that and I'm proud to vote in support of this. Thank you. Thank you. I forgot to mention Ali penuche. Thank you. Thank you so much for all your good work on that Susie and Lakeisha as well really appreciate all of the work that you have done. And when the question but the trees came up, I forgot to mention that the urban forestry commission and I are working with the mayor's office to look for a work plan that we can lay out and make really clear what we're doing how we're preserving and protecting the trees and once again alley panuccio be helping us work on that so many things. I wanted to make a few comments myself and then I will hand it over to the council member O'Brien to close it out before we take the boat. I am strongly in favor of this legislation and I will be voting. Yes, and I thank all the activist and Community organizations that have advocated for this not just this year but for several years and I do agree with many who have spent said that they shoot at this was a long time coming and it should have been done a long time ago, especially given the acute housing crisis that we're facing. I also think it is really bad for anybody to make an any any any context where there is negative rhetoric against renters renters are not only about half a varsity records are now a more and more of the residents of metropolitan areas most working-class and middle-class people don't get out at 4 to buy homes, and they are forced to run. And there's nothing wrong with renting it is, you know, regardless of whether you have ownership of your property or not. You are residents of the neighborhood. In fact, I would extend that even father and say that even if you are homeless you are community members and it doesn't matter and you not only have every right to your community and to your neighborhood and to your city, but nobody should question your commitment to society. In fact that if anybody's commitment should be questioned. It should be the for-profit corporate developers in the Property Management Corporation who are enriching themselves beyond belief at the expense of the renters in our city. I also wanted to add that you know again, I'd appreciate it and putting it in writing. This bill has been greatly exaggerated by its detractors right now as the urbanist article from October last year mentioned only 1% of single-family Lots in Seattle have an Adu or a dadu's so I don't think this is in any way going to do butterflies, Wisconsin Lavar ball said destroy a single-family neighborhood. I also think it is important to know. Something about Brian did and I appreciate that that the best promoters have also greatly exaggerated the bill in terms of the effect. It will have for affordable housing. I absolutely support it will have some positive effect. There's no question about it and I support every single affordable home that we can generate through a You know Siri is a comprehensive policies, but we should also have it in perspective that it is not going to address the housing crisis in the way that we want to address the housing crisis. And so we do need to get to work on Far bigger public policies than than this one. Although I strongly support this one and we need to go forward on this one. I also wanted to thank the working-class and middle-class homeowners like Ruby Holland who's an African-American homeowner in District 3 who have advocated for this bill as well making the important point that for the homeowners who are able to build and a backyard Cottage. It could potentially be a very urgently needed source of income especially people who are head with large Healthcare cost and also the high property taxes because this the city does not have does not really have any Progressive taxes. So I really appreciate the homeowners have joined the renters in advocating for the spelling is a really good a positive example of our homeowners and rent. Can come together and fight together for some for affordable housing policies. I also wanted to reiterate a point that we have been made repeatedly and don't remember O'Brien's, how do you adjust that? The Bonita also shows that the homeowners who can afford to build a backyard Cottages are the more well-off homeowners and the homeowners who need to build, you know, in order to get a source of income and rent it out as affordable housing often cannot afford to build it. And so I do want to keep alive the question of how we will provide public sources of funds for the homeowners who want to build a backyard Cottage but cannot afford to erase the capital expenses that they will need to in order to make that happen. I also wanted to add one other thing that again from the urbanist article in October of last year weather report that in contrast to what we have in Seattle in Vancouver British Columbia, which has been a Pioneer in Adu land use code liberalization. Roughly 35% of single-family Lottery to use which they referred to as laneway housing resulting in about 25,000 380 use + 1003 + 350 dadu's the closest city. I think Vancouver BC has light on this and I think it should be our goal to really move forward in a big way in Seattle as well because we have you know, there are sister cities in many different ways and comes up with the problems the density in and all of that. So I think that does provide a good guidance for us last but not least. I will say I hope all the activist and the community organizations have been fighting for this correctly, but also join us in the struggle for much more far-reaching public policies and not only join us in Seattle, but join the movement in New York, which I want just one major victory starting the trees by forcing the New York state legislature to pass not only a closing of the loopholes on the rent control existing rent control legislation in the city in New York City, but also enable A whole host of tenants rights to be passed and also enabling other municipalities in the state in New York state to pass rent control because we have seen the rain rain control does not have corporate loopholes. It has provided a Lifeline too many people inside. I just met a good constituent recently who said that her son and his wife used to live in the Bay Area they lived in a rent-controlled home as a particularly at a time Madea Big Bang Theory on family and they needed one control and rent control enable them to actually save up even on their middle-class salary and they were able to come and buy a house here. So, you know it in reality homeowners and renters have a joint incentive to fight for rent control together and I really urge everybody who's watching this to join us at the rent control rally on July 20th at 6 p.m. At the all programs Christian Church on Broadway, and I will now hand it over to can't remember O'Brien and I just wanted to point out actually that The the petition for rent control we've both my staff and many many volunteers were not volunteering. What does have gone throughout the city in a different of farmers markets including Red Lake City Farmers Market at Solstice at the around the three days of Pride and we've collected 7500 signatures, which is a huge amount especially given all the negative mythology about rent control. So I really orange everybody who's not join the struggle yet to please join it with us. Thank you cancel president, Thank you so much again for your work on this. I appreciate the kind words you share with me personally, you know better than anyone else that the work I do is a mere fraction of the actual work that's done and I get a lot of credit for that that we bounced around for my from topic to topic and the staff behind us to support us make this possible. So I want to say thanks in those folks. I want to start with a couple volunteers that are here. I know Lauren example has been dedicating a lot of your unpaid time to making this work. So, thank you. Can I hear your Advocates and your voice matters, but you've been really good at helping me connect with community members and really understand what the need isn't community and I'm grateful for that. Alia want to thank you so much for your years of work on this not just in the typical Central staff member but spending multiple hours on the stand during the examiner examination and all sorts of other roles. You're an amazing resource for the city of an amazing resource for me on this particular piece of legislation. I'm very grateful for that. I want to thank Nick and the mayor's Eve work for your work has been your work has been amazing and I'm really grateful to listen Aaron past mayors who allowed the city council to have access to your expertise in your team's actually he's going back to the very first kind of community meetings. When I first met you I'm doing this for three years ago. You're just thoughtful approach has been really really helpful to The Guiding his policy along the way and I'm I really applaud you work for that. As has been mentioned this process has taken quite some time both of the long process during which babies have been born including a baby that's in the back today. So I want to thank my staff members Susie who has been working on this tirelessly for years. She's currently on Parental leave, but as well as that, I believe his first city council meeting today so we can give that time for us to be here. And then in the near-term we've taken enough time today, and we've managed to put Ezra asleep. So that's also one of our strength up here right way to go but soon he thinks you work on that and Susie's absence Alicia and my office has been the lead picking up this work week on long enough to Talisha probably had to go to the meeting that I was supposed to be at 20 minutes ago, but I'm really grateful for her out highly. So there you are your back. Thank you so much for you. My whole team is going to play the part of all this. I appreciate your leadership on this that is all I have to say colleagues there so many amazing photos throughout the community that have worked on this and other departments and elsewhere, but it's a team effort here. And you know, I look forward to this folks will see how it goes. Spectre Gonzales herbold, I was O'Brien built buses and the charitable sign in. I I know I've overlooked a few folks, but I am looking at Sherry right now, and I apologize. I didn't mention to you with the likes of Madden or have you been amazing Point person to work with? So thank you for all that. Thank you. What is civil rights utilities Economic Development and arts commission died in for appointment 1376 reappointment of Brianna Simpson as member Seattle lgbtq commission for turntable 3 2021 the committee recommends the appointment be confirmed. Has been a lgbtq commissioner for a short. Of time, but they have only become more passionate about Building Bridges between the LGBT community and city government and ensuring that the voices of the most marginalized are not only being heard but elevated in a city with increasing National stature Byram has experience working as a program manager for Pathways in training at Youth Care and is excited to continue working with the canoe the commission to ensure that meetings are accessible and accountable to the community. The lgbtq commission is tasked with representing. Any other comments? Those in favor of confirming the appointment, please. Go die. The motion carries in the appointment is confirmed. Please read the report of the finance and neighborhoods, d52 really into the esler Crescent improvements it can you recommend some bill pass. Thank you very much. I know all of us have been here for 2 hours and 22 minutes. I'm going to try to shorten this if you have any questions, let me know many of you are well aware that I have been supporting what we call the yesler Crescent for years. We got nine hundred thousand plus in the budget last year. So what we're doing is it is lifting a Proviso the parks department has been fabulous and we have worked very closely with our King County Friends of the judges and the facilities folks across the street at besc the Pioneer Square Alliance down the street people have come together. The money has been identified going to be activating that Park adding more tables and chairs at kiosk better lied and cleaning it up continuing to Lim and I recommend that we proceed with this left the Proviso Any other comments? Please call the roll on the passage of the bill. Thanks in solace. Did you get confused? mascara O'Brien Pacheco Please read the item of the financial Neighbors coming to 19540 Wellington start preservation posing controls upon the Ainsworth and Dunn Warehouse. Can you recommend Seville pass? Thank you. And again, this is Landmark legislation that unanimously passed out of the committee to Ainsworth and Dunn Warehouse commonly known as The Old Spaghetti Factory will have controls on the outside the exterior. They've actually done a fantastic job with cleaning of the bricks the outside and they've restored the old windows. So they're complying they want to do this work and the exposed interior structure as well as these old very old beams on that. They are restoring To look like they did when they were new. It's really been an impressive part of the new Waterfront and we recommend that this be the Atlanta Mark legislation be accepted. Are you guys coming back to any other comments? Please read. Please call the role in the passage of the bill. Mascara O'Brien the gender Equity safe communities new Americans and education committee 95407 relating to a community service officer program a mini corn s-125 724 which adopt at the 2019 budget lifting and provides oral and biting fly and confirming search Empire Axe could recommence about past tense presidents. 10119547 is I mentioned it this morning during Council briefing would lift a 2019 budget Proviso to allow the sale Police Department to advance its implementation of the Community Service Officer program really quickly by way of background this program. And this unit will be staffed by non-commissioned officers were trained and work as liaison. Between a community and the police department community service officers will not carry weapons nor enforce criminal laws instead. They will serve to bridge the service gap on non-criminal calls for service and perform a variety of Public Safety related community service and Outreach work there for freeing up sworn police officers to focus on more critical matters They will receive training and police operations social work the escalation conflict resolution and mediation Crisis Intervention institutional racism and cultural competency using internal and external training channels community service officers Walter develop Community Partnerships to support increase collaboration between the Seattle Police Department and the community for the purpose of leveraging community strength enforcement and social issues community service officers will work assigned areas of the city on foot or in marked Community Service Officer Vehicles responding to radio dispatch calls for service largely of the directions. Patrol officers the Salem Police Department plans to deploy initially 10 community service officers and to Community Service Officer supervisors across two shifts shifts up to six days a week Monday through Saturday, excluding Sundays and holidays that is subject to change depending on calls and demands of the program and of course future funding in in the future. So I promise this morning during Council briefing that I would bring ensure with you all a copy of the job description and posting for the Community Service Officer program. I've had distributed that for you all to take a look at but I think with all this information we are ready to lift the Proviso and the committee recommends that we do so to call Allentown Police Department to advance the Community Service Officer program. Made a comment about her belt. Just thank you real quickly. I I I truly believe that bringing back the Community Service Officer program will be a really valuable addition to placing in Seattle in the southwest Precinct a top Community concern is that the number of police officers are not sufficient to meet the staffing needs to adequately address Public Safety proud co-sponsor of legislation to bring back the CSI was but recognized that counts member customer Brian took the took the lead on proposing it in a couple budget Cycles back and many many things to come from Gonzales for adeptly and expertly I'm getting us to this to this point and sworn officers can prioritize non-emergency Community Services associated with law enforcement and as we've heard that frees up law police officers to better respond to 9-1-1 calls and and needs for proactive policing given our challenge in this city as well as other large cities in hiring. Officers bring back. The CSO program is really important stuff and also a shout out for to assistant chief Diaz for his work on this as well. Dallas I really appreciate your leadership on this. I apologize for not being able to be at the committee meeting last week, but it's been over a year and a half since we allocated the budget and it's a little disappointing of taking this long but setting that aside and how we move forward. I really appreciate your leadership and keeping an eye out for it. So grateful for that I can absolutely Please call the role of the passage of the bill Gonzalez O'Brien presidents were seven and favor and Anna post. Is there any other for their business to come before the council? The president's keto thank you madam president. I would like to be at I would like to ask to be excused next Monday for the purposes of going to Washington DC to meet with the folks from the national league of cities on their house and ask for revealing of the report. I'm so I'll be a very short trip, but I will have to miss next Monday if I can be excused has been moved and seconded all in favor. Say aye. another for so that passes any other motions the nun meeting is adjourned.", "end_time": 8844.9}]}